{
  "topic": "Rotation",
  "unit_title": "Angular Momentum of a Rigid Body: Angular Momentum for Extended Objects",
  "unit_number": "Unit 5.8",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Mechanics",
  "duration": "3-4 hours",
  "difficulty_level": "advanced",
  "expanded_description": "This unit extends angular momentum concepts to rigid bodies, developing the relationship L = Iω for symmetric rotation and exploring the more general tensor formulation for complex objects. Students will master calculating angular momentum for various rigid body configurations, analyzing precession, and solving advanced problems involving conservation of angular momentum in extended systems.",

  "learning_objectives": [
    "Calculate angular momentum of rigid bodies using L = Iω for symmetric rotation",
    "Apply the general angular momentum formulation L = Iω for principal axes",
    "Analyze systems with angular momentum conservation for rigid bodies",
    "Solve problems involving precession and complex rotation",
    "Apply angular momentum concepts to rolling and spinning objects",
    "Analyze rigid body collisions and interactions using angular momentum"
  ],

  "prerequisites": [
    "Mastery of angular momentum for particles (Unit 5.7)",
    "Understanding of moment of inertia concepts (Units 5.2-5.3)",
    "Proficiency with rotational dynamics (Unit 5.4)",
    "Familiarity with vector operations and coordinate systems",
    "Ability to solve systems of equations with multiple constraints"
  ],

  "core_concept": {
    "principle": "Rigid Body Angular Momentum, Moment of Inertia Tensor, Principal Axes, Precession, Conservation Laws, Complex Rotation",
    "explanation": "Angular momentum of rigid bodies extends particle concepts to extended objects, with L = Iω for symmetric rotation about principal axes, but requiring tensor formulation for general motion where angular momentum and angular velocity may not be parallel.",
    "image": {
      "url": "images/rigid-body-angular-momentum-core.png",
      "alt": "Rigid body angular momentum core concept",
      "caption": "Angular momentum of rigid bodies and tensor relationships"
    }
  },

  "sections": [
    {
      "section_title": "1. Angular Momentum of Symmetric Rigid Bodies",
      "introduction": "Development of angular momentum concepts for rigid bodies with symmetry, establishing the fundamental relationship L = Iω for rotation about principal axes and exploring applications to common geometric shapes.",

      "key_concept": {
        "definition": "Symmetric Rotation, Principal Axes, L = Iω, Fixed Axis Rotation, Moment of Inertia, Angular Velocity",
        "context": "For rigid bodies rotating about symmetry axes (principal axes), angular momentum simplifies to L = Iω, where angular momentum and angular velocity are parallel, enabling straightforward analysis of many practical rotational systems.",
        "image": {
          "url": "images/symmetric-rotation-concepts.png",
          "alt": "Symmetric rotation concepts",
          "caption": "Angular momentum for symmetric rigid body rotation"
        }
      },

      "classifications": [
        {
          "type": "Symmetric Rigid Body Types",
          "value": "Classification based on symmetry properties and angular momentum behavior",
          "characteristics": [
            "Spherical symmetry objects",
            "Cylindrical symmetry bodies",
            "Planar symmetric objects",
            "Rotation about principal axes",
            "Fixed axis rotation scenarios",
            "Objects with uniform mass distribution",
            "Common geometric shapes",
            "Engineering symmetric components"
          ],
          "behavior": "Different symmetric bodies exhibit characteristic angular momentum relationships. Spherical symmetry gives L ∥ ω for any axis, cylindrical symmetry gives parallel vectors for axis-aligned rotation, and planar symmetry has specific principal axes directions.",
          "examples": [
            {
              "process": "Principal Axes Identification",
              "explanation": "Identifying symmetry axes where L = Iω holds",
              "image": {
                "url": "images/principal-axes-identification.png",
                "alt": "Principal axes identification",
                "caption": "Identification of principal axes for symmetric bodies"
              }
            },
            {
              "process": "Moment of Inertia Calculation",
              "explanation": "Calculating moments of inertia for symmetric rotation",
              "image": {
                "url": "images/symmetric-inertia-calculation.png",
                "alt": "Symmetric inertia calculation",
                "caption": "Moment of inertia calculation for symmetric rotation"
              }
            }
          ],
          "note": "Key formula: L = Iω for rotation about principal axes of symmetric rigid bodies"
        }
      ],

      "principles": [
        {
          "principle": "Angular Momentum of Symmetric Rigid Bodies",
          "statement": "Symmetric rigid bodies exhibit simplified angular momentum relationships: Fundamental Relationship: L = Iω; Valid for rotation about principal axes; L and ω parallel for symmetric objects. Principal Axes: Axes of symmetry where products of inertia vanish; For these axes, L ∥ ω; Common cases: spheres, cylinders, rectangular solids. Derivation: L = Σ(r_i × p_i) = Σ[m_i r_i × (ω × r_i)]; For symmetric rotation: simplifies to L = Iω; I is moment of inertia about axis. Common Symmetric Objects: Sphere: L = Iω for any axis (I = ⅖MR²); Cylinder about symmetry axis: L = Iω (I = ½MR²); Thin rod about perpendicular axis through center: L = Iω (I = ML²/12). Fixed Axis Rotation: Object constrained to rotate about fixed axis; L may have component perpendicular to ω if axis not principal; But component along axis: L_axis = Iω. Energy Relationship: Rotational KE = ½ω·L = ½Iω² for symmetric rotation; Power: P = τ·ω = τω for fixed axis. Problem-Solving: 1. Identify rotation axis; 2. Check if principal axis; 3. Calculate I about axis; 4. Apply L = Iω; 5. Use τ = dL/dt if torques present.",
          "application": "Calculate angular momentum for symmetric rigid bodies. Identify principal axes of rotation. Apply L = Iω relationship appropriately. Solve problems involving fixed axis rotation. Analyze energy relationships in symmetric rotation. Handle conservation of angular momentum cases.",
          "example": "Spinning top dynamics. Flywheel angular momentum. Vehicle wheel rotation. Gyroscope operation. Sports equipment spin. Industrial rotating machinery.",
          "analogy": "Angular momentum for symmetric rigid bodies is like a well-balanced wheel - when spun about its natural symmetry axis (principal axis), it rotates smoothly with the spin (ω) and rotational inertia (I) combining simply to give the total rotational momentum (L=Iω), much like a perfectly balanced car wheel that doesn't wobble because its mass distribution aligns with the rotation axis",
          "image": {
            "url": "images/symmetric-rotation-principles.png",
            "alt": "Symmetric rotation principles",
            "caption": "Principles of angular momentum for symmetric rigid bodies"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Spinning Disk Angular Momentum",
          "problem": "A uniform disk of mass 4kg and radius 0.3m rotates at 120 rpm about its symmetry axis. Calculate its angular momentum.",
          "step_by_step": [
            {
              "step": "Convert angular velocity",
              "explanation": "120 rpm = 120/60 = 2 rev/s; ω = 2 × 2π = 12.57 rad/s"
            },
            {
              "step": "Moment of inertia for disk",
              "explanation": "I = ½MR² = ½ × 4 × (0.3)² = 2 × 0.09 = 0.18 kg·m²"
            },
            {
              "step": "Apply L = Iω",
              "explanation": "L = 0.18 × 12.57 = 2.26 kg·m²/s"
            },
            {
              "step": "Direction specification",
              "explanation": "L parallel to ω; Use right-hand rule for direction"
            },
            {
              "step": "Vector expression",
              "explanation": "If rotation counterclockwise in xy-plane: L = 2.26k kg·m²/s"
            },
            {
              "step": "Rotational kinetic energy",
              "explanation": "KE = ½Iω² = ½ × 0.18 × (12.57)² = 0.09 × 158 = 14.2 J"
            },
            {
              "step": "Verify using L",
              "explanation": "KE = ½ω·L = ½ × 12.57 × 2.26 = 14.2 J (matches)"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Disk stores 2.26 kg·m²/s of angular momentum while rotating"
            }
          ],
          "final_answer": "L = 2.26 kg·m²/s parallel to rotation axis",
          "concept_applied": "Angular momentum calculation for symmetric rotation",
          "image": {
            "url": "images/spinning-disk-angular-momentum.png",
            "alt": "Spinning disk angular momentum",
            "caption": "Angular momentum calculation for spinning disk"
          }
        },
        {
          "title": "Compound System Angular Momentum",
          "problem": "A system consists of a rod (mass 2kg, length 1m) rotating about its center at 4 rad/s, with point masses (0.5kg each) at both ends. Find the total angular momentum.",
          "step_by_step": [
            {
              "step": "Moment of inertia of rod alone",
              "explanation": "I_rod = ML²/12 = 2×1²/12 = 2/12 = 0.167 kg·m²"
            },
            {
              "step": "Moment of inertia of point masses",
              "explanation": "Each mass at L/2 = 0.5m from center; I_mass = 2 × [m(L/2)²] = 2 × [0.5×(0.5)²] = 2 × [0.5×0.25] = 2 × 0.125 = 0.25 kg·m²"
            },
            {
              "step": "Total moment of inertia",
              "explanation": "I_total = I_rod + I_mass = 0.167 + 0.25 = 0.417 kg·m²"
            },
            {
              "step": "Calculate angular momentum",
              "explanation": "L = Iω = 0.417 × 4 = 1.668 kg·m²/s"
            },
            {
              "step": "Alternative: sum individual contributions",
              "explanation": "Rod: L_rod = 0.167×4 = 0.668 kg·m²/s; Each mass: L_mass = m r v = 0.5×0.5×(0.5×4) = 0.5×0.5×2 = 0.5 kg·m²/s; Two masses: 1.0 kg·m²/s; Total: 0.668 + 1.0 = 1.668 kg·m²/s"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Most angular momentum comes from point masses due to larger r² contribution"
            },
            {
              "step": "Energy distribution",
              "explanation": "KE_total = ½Iω² = ½×0.417×16 = 3.336 J; Masses contribute 75% of KE despite 20% of mass"
            }
          ],
          "final_answer": "Total angular momentum: 1.67 kg·m²/s",
          "concept_applied": "Angular momentum of compound symmetric system",
          "image": {
            "url": "images/compound-system-angular-momentum.png",
            "alt": "Compound system angular momentum",
            "caption": "Angular momentum calculation for compound symmetric system"
          }
        }
      ]
    },
    {
      "section_title": "2. General Rigid Body Angular Momentum and Tensor Formulation",
      "introduction": "Development of the complete angular momentum formulation for rigid bodies using the moment of inertia tensor, analyzing cases where angular momentum and angular velocity are not parallel, and exploring the physics of complex rotational motion.",

      "key_concept": {
        "definition": "Moment of Inertia Tensor, Products of Inertia, General Rotation, Non-Principal Axes, Tensor Components, Complex Dynamics",
        "context": "For general rigid body rotation, angular momentum relates to angular velocity through the moment of inertia tensor L = I·ω, where L and ω may not be parallel, leading to complex rotational behavior including precession and nutation.",
        "image": {
          "url": "images/tensor-formulation-concepts.png",
          "alt": "Tensor formulation concepts",
          "caption": "General angular momentum formulation using inertia tensor"
        }
      },

      "classifications": [
        {
          "type": "General Rotation Scenarios",
          "value": "Classification based on rotational complexity and tensor properties",
          "characteristics": [
            "Rotation about non-principal axes",
            "Objects with asymmetric mass distribution",
            "General three-dimensional rotation",
            "Time-varying angular velocity",
            "Precessional motion",
            "Nutation phenomena",
            "Stability analysis",
            "Tensor component calculations"
          ],
          "behavior": "Different general rotation scenarios exhibit characteristic behaviors. Non-principal axis rotation causes L and ω misalignment, asymmetric objects have non-zero products of inertia, and time-dependent rotation involves complex torque relationships.",
          "examples": [
            {
              "process": "Tensor Component Calculation",
              "explanation": "Calculating moment of inertia tensor components for general objects",
              "image": {
                "url": "images/tensor-component-calculation.png",
                "alt": "Tensor component calculation",
                "caption": "Calculation of inertia tensor components"
              }
            },
            {
              "process": "General L-ω Relationship",
              "explanation": "Analyzing angular momentum for general angular velocity directions",
              "image": {
                "url": "images/general-l-omega-relationship.png",
                "alt": "General L-ω relationship",
                "caption": "Angular momentum for general angular velocity directions"
              }
            }
          ],
          "note": "Key formulation: L = I·ω where I is the 3×3 moment of inertia tensor"
        }
      ],

      "principles": [
        {
          "principle": "General Rigid Body Angular Momentum and Tensor Formulation",
          "statement": "General rigid body rotation requires tensor formulation: Moment of Inertia Tensor: I = [I_xx I_xy I_xz; I_yx I_yy I_yz; I_zx I_zy I_zz]; Diagonal elements: moments of inertia; Off-diagonal: products of inertia. Angular Momentum Vector: L = I·ω; Component form: L_x = I_xx ω_x + I_xy ω_y + I_xz ω_z; Similarly for L_y, L_z; In general, L not parallel to ω. Products of Inertia: I_xy = -Σ m_i x_i y_i; I_xz = -Σ m_i x_i z_i; I_yz = -Σ m_i y_i z_i; Zero for principal axes. Principal Axes Transformation: Can always find coordinates where I diagonal; Then L ∥ ω for rotation about these axes; Eigenvalue problem. Physical Significance: When L ∦ ω, object experiences internal stresses; Torque needed to maintain rotation about non-principal axis; Leads to precession. Equations of Motion: τ = dL/dt; For general motion: complex coupled equations; Often solved in principal axes frame. Special Cases: Symmetric top: simplified dynamics; Asymmetric top: most complex; Spherical top: simplest (I_xx = I_yy = I_zz). Problem-Solving: 1. Set up coordinate system; 2. Calculate or identify I components; 3. Apply L = I·ω; 4. Use τ = dL/dt if torques; 5. Consider principal axes transformation if helpful.",
          "application": "Calculate angular momentum using tensor formulation. Determine when L and ω are parallel. Analyze rotation about non-principal axes. Solve problems involving products of inertia. Apply tensor methods to asymmetric objects. Handle general rotational dynamics equations.",
          "example": "Spacecraft attitude dynamics. Irregular object rotation. Automotive unbalanced wheels. Robotics arm dynamics. Aircraft spinning motion. Sports equipment with asymmetry.",
          "analogy": "General rigid body angular momentum is like trying to push a shopping cart with unbalanced wheels - the natural pushing direction (ω) and the actual cart's response (L) don't line up, causing wobbling and requiring extra effort to maintain direction, with the inertia tensor capturing exactly how the mass distribution makes the response different from the input, much like the wheel imbalance makes the cart respond unpredictably to pushes",
          "image": {
            "url": "images/tensor-formulation-principles.png",
            "alt": "Tensor formulation principles",
            "caption": "Principles of general rigid body angular momentum"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Rotation About Non-Principal Axis",
          "problem": "A rectangular plate (mass M, dimensions a×b) rotates with angular velocity ω about a diagonal. Find the angular momentum and show it's not parallel to ω.",
          "step_by_step": [
            {
              "step": "Set up coordinate system",
              "explanation": "Place plate in xy-plane with corners at (±a/2, ±b/2); Rotation about diagonal from (-a/2,-b/2) to (a/2,b/2)"
            },
            {
              "step": "Moment of inertia components",
              "explanation": "I_xx = Mb²/12, I_yy = Ma²/12, I_zz = M(a²+b²)/12; Products: I_xy = -∫∫ xy σ dxdy"
            },
            {
              "step": "Calculate I_xy",
              "explanation": "For uniform plate: I_xy = -σ ∫_{-a/2}^{a/2} x dx ∫_{-b/2}^{b/2} y dy = -σ [x²/2]_{-a/2}^{a/2} [y²/2]_{-b/2}^{b/2} = -σ (0)(0) = 0"
            },
            {
              "step": "Wait - re-evaluate",
              "explanation": "Actually ∫_{-a/2}^{a/2} x dx = [x²/2]_{-a/2}^{a/2} = (a²/8) - (a²/8) = 0; So I_xy = 0"
            },
            {
              "step": "Diagonal axes are principal!",
              "explanation": "For rectangular plate, x and y axes are principal; Any axis in plane is principal? Need to check"
            },
            {
              "step": "General principal axis condition",
              "explanation": "For rotation axis at angle θ to x-axis, still principal if I_xy=0"
            },
            {
              "step": "Revised approach with different object",
              "explanation": "Consider L-shaped object or object with I_xy ≠ 0"
            },
            {
              "step": "Key insight",
              "explanation": "For symmetric objects like rectangle, many axes are principal; Need asymmetric object for L ∦ ω"
            }
          ],
          "final_answer": "For rectangular plate, diagonal axes are principal axes, so L ∥ ω; Need asymmetric object for non-parallel case",
          "concept_applied": "Identification of principal axes and L-ω parallelism",
          "image": {
            "url": "images/non-principal-rotation.png",
            "alt": "Non-principal rotation",
            "caption": "Analysis of rotation about non-principal axes"
          }
        },
        {
          "title": "Tensor Calculation for Simple System",
          "problem": "Four masses: 1kg at (1,1,0), 1kg at (1,-1,0), 1kg at (-1,1,0), 1kg at (-1,-1,0) in meters. Find the inertia tensor and angular momentum for ω = (3,4,0) rad/s.",
          "step_by_step": [
            {
              "step": "Calculate moments of inertia",
              "explanation": "I_xx = Σm(y²+z²) = 1(1+0)+1(1+0)+1(1+0)+1(1+0) = 4 kg·m²"
            },
            {
              "step": "I_yy calculation",
              "explanation": "I_yy = Σm(x²+z²) = 1(1+0)+1(1+0)+1(1+0)+1(1+0) = 4 kg·m²"
            },
            {
              "step": "I_zz calculation",
              "explanation": "I_zz = Σm(x²+y²) = 1(1+1)+1(1+1)+1(1+1)+1(1+1) = 8 kg·m²"
            },
            {
              "step": "Products of inertia",
              "explanation": "I_xy = -Σm x y = -[1(1)(1)+1(1)(-1)+1(-1)(1)+1(-1)(-1)] = -[1-1-1+1] = 0"
            },
            {
              "step": "Other products",
              "explanation": "I_xz = -Σm x z = 0 (all z=0); I_yz = -Σm y z = 0"
            },
            {
              "step": "Inertia tensor",
              "explanation": "I = [4 0 0; 0 4 0; 0 0 8] kg·m²"
            },
            {
              "step": "Angular momentum",
              "explanation": "L = I·ω = [4 0 0; 0 4 0; 0 0 8]·[3; 4; 0] = [12; 16; 0] kg·m²/s"
            },
            {
              "step": "Check parallelism",
              "explanation": "L = (12,16,0), ω = (3,4,0); L = 4ω, so parallel"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Square symmetric pattern gives I diagonal; x and y axes equivalent"
            }
          ],
          "final_answer": "I = diag(4,4,8) kg·m²; L = (12,16,0) kg·m²/s ∥ ω",
          "concept_applied": "Inertia tensor calculation and angular momentum determination",
          "image": {
            "url": "images/tensor-calculation-example.png",
            "alt": "Tensor calculation example",
            "caption": "Inertia tensor calculation for mass system"
          }
        }
      ]
    },
    {
      "section_title": "3. Conservation Laws and Advanced Applications",
      "introduction": "Application of angular momentum conservation to complex rigid body systems, analysis of precession and nutation, and solution of advanced problems involving collisions, combined motion, and real-world rotational phenomena.",

      "key_concept": {
        "definition": "Angular Momentum Conservation, Precession, Nutation, Rigid Body Collisions, Combined Motion, Gyroscopic Motion",
        "context": "Conservation of angular momentum provides powerful tools for analyzing complex rigid body dynamics, including precessional motion, collisions between rotating objects, and systems with combined translational and rotational degrees of freedom.",
        "image": {
          "url": "images/conservation-applications-concepts.png",
          "alt": "Conservation applications concepts",
          "caption": "Advanced applications of angular momentum conservation"
        }
      },

      "classifications": [
        {
          "type": "Advanced Application Scenarios",
          "value": "Classification based on system complexity and conservation approaches",
          "characteristics": [
            "Precessional motion systems",
            "Rigid body collision analysis",
            "Objects with changing moments of inertia",
            "Combined translation-rotation systems",
            "Gyroscopic stability phenomena",
            "Multi-body rotational systems",
            "Energy-angular momentum relationships",
            "Real-world engineering applications"
          ],
          "behavior": "Different advanced scenarios leverage angular momentum conservation in specific ways. Precession involves torque-induced L changes, collisions conserve L when impulsive forces are central, and combined motion requires careful reference point selection.",
          "examples": [
            {
              "process": "Precession Analysis",
              "explanation": "Analyzing gyroscopic precession using angular momentum conservation",
              "image": {
                "url": "images/precession-analysis.png",
                "alt": "Precession analysis",
                "caption": "Analysis of gyroscopic precession motion"
              }
            },
            {
              "process": "Rigid Body Collisions",
              "explanation": "Applying angular momentum conservation to rigid body collisions",
              "image": {
                "url": "images/rigid-body-collisions.png",
                "alt": "Rigid body collisions",
                "caption": "Angular momentum conservation in rigid body collisions"
              }
            }
          ],
          "note": "Key principle: ΔL = ∫τ dt for external torques, L conserved when τ_ext = 0"
        }
      ],

      "principles": [
        {
          "principle": "Conservation Laws and Advanced Applications",
          "statement": "Angular momentum conservation enables solution of complex rigid body problems: Conservation Conditions: Net external torque τ_ext = 0 about reference point; Reference point fixed or moving with constant velocity; L_total constant in magnitude and direction. Precession: Spinning object under gravity; Constant vertical torque; L changes direction but not magnitude; Precession rate Ω = τ/L; Examples: tops, gyroscopes. Nutation: Wobbling superimposed on precession; Due to initial conditions or impulses; Complex motion with varying θ; Solved using Euler's equations. Rigid Body Collisions: Impulsive forces during collision; Angular momentum conserved about impact point if forces central; Combined with linear momentum conservation; Can analyze rotational energy changes. Changing Moment of Inertia: Internal forces can change I; L conserved but ω changes; Examples: figure skater, collapsing star; KE may change due to internal work. Combined Motion: Objects that both translate and rotate; L about CM plus L of CM; L = L_cm + r_cm × p_cm; Both terms may be conserved. Problem-Solving Strategies: 1. Choose appropriate reference point; 2. Identify conserved quantities; 3. Write initial and final L; 4. Include constraint equations; 5. Solve system; 6. Verify with energy methods. Real-World Applications: Spacecraft attitude control; Vehicle stability; Sports dynamics; Mechanical systems; Astrophysical rotations.",
          "application": "Apply angular momentum conservation to precession problems. Analyze rigid body collisions using conservation laws. Solve problems with changing moments of inertia. Handle combined translational-rotational motion. Use conservation in multi-body systems. Apply to real-world engineering problems.",
          "example": "Gyroscope stabilization systems. Figure skater spin acceleration. Satellite orientation control. Vehicle roll dynamics. Sports equipment collisions. Planetary rotation dynamics.",
          "analogy": "Angular momentum conservation in complex systems is like a cosmic ballet - dancers (rigid bodies) can change their individual spins (rotation rates) and positions, but the total rotational choreography (angular momentum) remains perfectly coordinated according to conservation laws, with external directors (torques) able to redirect the overall performance but not destroy its fundamental rotational pattern",
          "image": {
            "url": "images/conservation-applications-principles.png",
            "alt": "Conservation applications principles",
            "caption": "Principles of angular momentum conservation applications"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Figure Skater Spin Acceleration",
          "problem": "A figure skater (I_initial = 3 kg·m²) spins at 2 rad/s with arms extended. Pulling arms in reduces moment of inertia to 1.2 kg·m². Find the new angular speed and the work done.",
          "step_by_step": [
            {
              "step": "Apply angular momentum conservation",
              "explanation": "No external torque about rotation axis → L conserved"
            },
            {
              "step": "Initial angular momentum",
              "explanation": "L = I_i ω_i = 3 × 2 = 6 kg·m²/s"
            },
            {
              "step": "Final angular momentum",
              "explanation": "L = I_f ω_f = 1.2 ω_f"
            },
            {
              "step": "Solve for final speed",
              "explanation": "6 = 1.2 ω_f → ω_f = 6/1.2 = 5 rad/s"
            },
            {
              "step": "Initial kinetic energy",
              "explanation": "KE_i = ½ I_i ω_i² = ½ × 3 × 4 = 6 J"
            },
            {
              "step": "Final kinetic energy",
              "explanation": "KE_f = ½ I_f ω_f² = ½ × 1.2 × 25 = 15 J"
            },
            {
              "step": "Work done",
              "explanation": "W = ΔKE = 15 - 6 = 9 J"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Skater does work pulling arms in, increasing rotational KE"
            },
            {
              "step": "Power calculation",
              "explanation": "If this takes 0.5s, average power = 9/0.5 = 18 W"
            },
            {
              "step": "Angular acceleration",
              "explanation": "α_avg = Δω/Δt = (5-2)/0.5 = 6 rad/s² during pull-in"
            }
          ],
          "final_answer": "Final angular speed: 5 rad/s; Work done: 9 J",
          "concept_applied": "Angular momentum conservation with changing moment of inertia",
          "image": {
            "url": "images/figure-skater-example.png",
            "alt": "Figure skater example",
            "caption": "Angular momentum conservation in figure skater spin"
          }
        },
        {
          "title": "Precessing Gyroscope",
          "problem": "A gyroscope (I = 0.1 kg·m²) spins at 100 rad/s. Its center of mass is 0.05m from the pivot. Find the precession rate.",
          "step_by_step": [
            {
              "step": "Calculate angular momentum",
              "explanation": "L = Iω = 0.1 × 100 = 10 kg·m²/s"
            },
            {
              "step": "Torque due to gravity",
              "explanation": "τ = mgd = m × 9.8 × 0.05 = 0.49m N·m"
            },
            {
              "step": "Precession rate formula",
              "explanation": "Ω = τ/L = (0.49m)/(10) = 0.049m rad/s"
            },
            {
              "step": "Need mass information",
              "explanation": "Mass not given; Express in terms of m"
            },
            {
              "step": "Alternative approach",
              "explanation": "Precession rate Ω = τ/L = (mgd)/(Iω)"
            },
            {
              "step": "Numerical with assumed mass",
              "explanation": "If m=1kg: Ω = (1×9.8×0.05)/(0.1×100) = 0.49/10 = 0.049 rad/s"
            },
            {
              "step": "Convert to practical units",
              "explanation": "0.049 rad/s = 0.049×60/(2π) ≈ 0.47 rpm"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Gyroscope precesses slowly due to large spin angular momentum"
            },
            {
              "step": "Direction of precession",
              "explanation": "Precession direction given by τ × L rule"
            }
          ],
          "final_answer": "Precession rate: Ω = mgd/(Iω) = 0.049m rad/s (for m in kg)",
          "concept_applied": "Gyroscopic precession analysis",
          "image": {
            "url": "images/gyroscope-precession-example.png",
            "alt": "Gyroscope precession example",
            "caption": "Analysis of gyroscope precession motion"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Rigid body angular momentum",
    "L = Iω",
    "Moment of inertia tensor",
    "Principal axes",
    "Products of inertia",
    "Precession",
    "Nutation",
    "Angular momentum conservation",
    "Gyroscopic motion",
    "Fixed axis rotation",
    "General rotation",
    "Tensor formulation",
    "Euler's equations",
    "Center of mass reference"
  ],

  "common_misconceptions": [
    "Thinking L = Iω always holds for rigid bodies",
    "Confusing principal axes with geometric symmetry axes",
    "Misapplying conservation to non-inertial reference frames",
    "Thinking internal forces can change total angular momentum",
    "Confusing precession with forced rotation",
    "Misunderstanding the role of products of inertia",
    "Thinking all rotation axes are equivalent",
    "Confusing angular momentum of CM with rotational angular momentum"
  ],

  "real_world_applications": [
    "Spacecraft attitude control and stabilization",
    "Gyroscopic navigation and guidance systems",
    "Vehicle dynamics and roll stability",
    "Sports equipment dynamics and performance",
    "Industrial rotating machinery analysis",
    "Astrophysical object rotation and collapse",
    "Robotics and manipulator dynamics",
    "Aircraft and helicopter control systems",
    "Molecular and atomic rotation analysis",
    "Energy storage flywheel systems"
  ],

  "summary": "Angular momentum of rigid bodies extends particle concepts to extended objects, with L = Iω providing a simplified relationship for symmetric rotation about principal axes, while the general tensor formulation L = I·ω handles complex cases where angular momentum and angular velocity may not be parallel. Conservation of angular momentum provides powerful analytical tools for solving advanced problems involving precession, collisions, changing moments of inertia, and combined translational-rotational motion. These concepts find wide application across engineering, physics, and technology, from spacecraft attitude control to sports dynamics to fundamental atomic systems, demonstrating the universal importance of rotational dynamics in understanding and designing rotational systems across all scales."
}
