{
  "topic": "Rotation",
  "unit_title": "Conservation of Angular Momentum: Angular Momentum Conservation",
  "unit_number": "Unit 5.9",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Mechanics",
  "duration": "3-4 hours",
  "difficulty_level": "advanced",
  "expanded_description": "This capstone unit synthesizes angular momentum concepts to solve complex problems using conservation of angular momentum. Students will master applying conservation principles to systems ranging from particle collisions to astrophysical phenomena, developing sophisticated problem-solving strategies for scenarios involving changing moments of inertia, combined motion, and complex constraints.",

  "learning_objectives": [
    "Apply conservation of angular momentum to complex multi-object systems",
    "Solve problems involving changing moments of inertia and mass distributions",
    "Analyze collisions and interactions using angular momentum conservation",
    "Apply conservation principles to combined translational and rotational motion",
    "Solve real-world problems across physics and engineering domains",
    "Develop systematic approaches for complex angular momentum scenarios"
  ],

  "prerequisites": [
    "Mastery of angular momentum for particles and rigid bodies (Units 5.7-5.8)",
    "Understanding of moment of inertia concepts (Units 5.2-5.3)",
    "Proficiency with rotational dynamics and energy (Units 5.4-5.5)",
    "Familiarity with conservation laws and vector mathematics",
    "Ability to solve complex systems of equations with multiple constraints"
  ],

  "core_concept": {
    "principle": "Angular Momentum Conservation, Isolated Systems, Changing Inertia, Collision Analysis, Combined Motion, Systematic Methods",
    "explanation": "Conservation of angular momentum provides powerful problem-solving tools for systems with zero net external torque, enabling analysis of complex scenarios involving changing mass distributions, collisions, and combined motion through the principle L_initial = L_final.",
    "image": {
      "url": "images/angular-momentum-conservation-core.png",
      "alt": "Angular momentum conservation core concept",
      "caption": "Conservation of angular momentum in complex systems"
    }
  },

  "sections": [
    {
      "section_title": "1. Fundamental Conservation Principles and Conditions",
      "introduction": "Establishment of the rigorous conditions for angular momentum conservation, development of systematic application methods, and exploration of the profound implications across physical systems from microscopic to cosmic scales.",

      "key_concept": {
        "definition": "Conservation Conditions, Isolated Systems, External Torque, Reference Frame Selection, Vector Conservation, Application Framework",
        "context": "Angular momentum is conserved when the net external torque on a system is zero, providing a powerful conservation law that holds across all physical scales and enables solutions to otherwise intractable problems.",
        "image": {
          "url": "images/conservation-principles-concepts.png",
          "alt": "Conservation principles concepts",
          "caption": "Fundamental principles and conditions for angular momentum conservation"
        }
      },

      "classifications": [
        {
          "type": "Conservation Scenarios",
          "value": "Classification based on system isolation and torque conditions",
          "characteristics": [
            "Completely isolated systems",
            "Systems with central forces only",
            "Objects with spherical symmetry",
            "Motion in force-free regions",
            "Impulsive interaction systems",
            "Symmetry-based conservation",
            "Approximately conserved systems",
            "Component-wise conservation"
          ],
          "behavior": "Different conservation scenarios exhibit specific characteristics. Completely isolated systems conserve total angular momentum exactly, central force systems conserve angular momentum about the force center, and symmetric systems may conserve specific components.",
          "examples": [
            {
              "process": "Conservation Condition Analysis",
              "explanation": "Determining when angular momentum conservation applies to specific systems",
              "image": {
                "url": "images/conservation-condition-analysis.png",
                "alt": "Conservation condition analysis",
                "caption": "Analysis of conditions for angular momentum conservation"
              }
            },
            {
              "process": "Reference Frame Selection",
              "explanation": "Choosing optimal reference points for applying conservation principles",
              "image": {
                "url": "images/reference-frame-selection.png",
                "alt": "Reference frame selection",
                "caption": "Selection of reference frames for conservation analysis"
              }
            }
          ],
          "note": "Key principle: L_total is conserved when τ_ext = 0 about a point fixed in an inertial frame"
        }
      ],

      "principles": [
        {
          "principle": "Fundamental Conservation Principles and Conditions",
          "statement": "Angular momentum conservation rests on specific physical and mathematical foundations: Conservation Law: If τ_ext = 0, then dL/dt = 0 → L = constant; Valid for both particles and extended systems; Vector conservation: all three components conserved. Conditions for Conservation: No external torques; External forces but zero torque about chosen point; Impulsive interactions with central forces; Isolated systems. Reference Point Selection: Must be fixed in inertial frame or moving with constant velocity; Center of mass often optimal choice; Different points may give different L values but same physics. Central Force Systems: Forces directed along position vectors; Gravitational, electrostatic forces; τ = r × F = 0; Angular momentum conserved about force center. Symmetry and Conservation: Spherical symmetry: L conserved about center; Cylindrical symmetry: L_z conserved; Planar symmetry: specific components conserved. Implications: Motion confined to plane perpendicular to L; Constant areal velocity (Kepler's second law); Rotation axis stability. Problem-Solving Framework: 1. Identify system boundaries; 2. Check τ_ext = 0 condition; 3. Choose optimal reference point; 4. Calculate L_initial and L_final; 5. Apply L_i = L_f; 6. Include other conservation laws. Verification Methods: Check units and dimensions; Verify vector component consistency; Examine limiting cases; Use alternative solution methods.",
          "application": "Determine when angular momentum conservation applies. Select optimal reference points for analysis. Apply conservation to central force systems. Use symmetry to identify conserved components. Develop systematic problem-solving approaches. Verify conservation applications.",
          "example": "Planetary orbital dynamics. Atomic and molecular systems. Satellite motion analysis. Particle accelerator collisions. Astrophysical jet formation. Quantum mechanical systems.",
          "analogy": "Angular momentum conservation is like a cosmic accounting system - when no external 'bookkeepers' (torques) intervene, the total rotational 'ledger' (angular momentum) remains perfectly balanced regardless of internal transactions, allowing us to trace the rotational inheritance through complex transformations much like following money through various exchanges in a closed economy",
          "image": {
            "url": "images/conservation-principles-image.png",
            "alt": "Conservation principles",
            "caption": "Fundamental principles of angular momentum conservation"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Orbital Transfer Analysis",
          "problem": "A satellite of mass m orbits Earth in a circular orbit of radius R. Using a brief rocket burn, it transfers to a circular orbit of radius 2R. Show that angular momentum is conserved during the burn and find the required velocity changes.",
          "step_by_step": [
            {
              "step": "Initial circular orbit velocity",
              "explanation": "v_i = √(GM/R) from F_gravity = F_centripetal"
            },
            {
              "step": "Initial angular momentum",
              "explanation": "L_i = m R v_i = m R √(GM/R) = m √(GMR)"
            },
            {
              "step": "Final circular orbit velocity",
              "explanation": "v_f = √(GM/(2R)) = √(GM/(2R))"
            },
            {
              "step": "Final angular momentum",
              "explanation": "L_f = m (2R) v_f = m (2R) √(GM/(2R)) = m √(2R) √(GM) = m √(2GMR)"
            },
            {
              "step": "Compare L_i and L_f",
              "explanation": "L_f = √2 × L_i; Angular momentum not conserved! Rocket provides external torque"
            },
            {
              "step": "Identify the issue",
              "explanation": "Rocket thrust provides external force → external torque about Earth's center"
            },
            {
              "step": "Hohmann transfer analysis",
              "explanation": "In actual orbital transfers, angular momentum changes; Conservation doesn't apply due to thrust"
            },
            {
              "step": "Correct conservation scenario",
              "explanation": "For conservation, need no external torques; Gravitational orbits without propulsion conserve L"
            },
            {
              "step": "Physical insight",
              "explanation": "This demonstrates importance of checking τ_ext = 0 condition carefully"
            }
          ],
          "final_answer": "Angular momentum not conserved during rocket burns; L increases by factor √2 in this transfer",
          "concept_applied": "Analysis of conservation conditions in orbital mechanics",
          "image": {
            "url": "images/orbital-transfer-analysis.png",
            "alt": "Orbital transfer analysis",
            "caption": "Analysis of angular momentum in orbital transfers"
          }
        },
        {
          "title": "Central Force Motion",
          "problem": "A particle moves under a central force F(r) = -k/r². Show that angular momentum is conserved and derive Kepler's second law.",
          "step_by_step": [
            {
              "step": "Identify force type",
              "explanation": "Central force: F ∥ r (directed toward force center)"
            },
            {
              "step": "Calculate torque",
              "explanation": "τ = r × F = r × (central force) = 0 (parallel vectors)"
            },
            {
              "step": "Apply conservation",
              "explanation": "τ = dL/dt = 0 → L = constant"
            },
            {
              "step": "Areal velocity definition",
              "explanation": "dA/dt = ½|r × v| (area swept per time)"
            },
            {
              "step": "Relate to angular momentum",
              "explanation": "L = m(r × v) → |r × v| = |L|/m"
            },
            {
              "step": "Substitute into areal velocity",
              "explanation": "dA/dt = ½(|L|/m) = constant"
            },
            {
              "step": "Interpret result",
              "explanation": "Constant areal velocity → equal areas in equal times (Kepler's second law)"
            },
            {
              "step": "Historical significance",
              "explanation": "This was Kepler's original formulation based on planetary observations"
            },
            {
              "step": "Physical implication",
              "explanation": "Particle moves faster when closer to center, slower when farther, maintaining constant dA/dt"
            }
          ],
          "final_answer": "Angular momentum conserved (L constant); Areal velocity constant (dA/dt = |L|/2m) - Kepler's second law",
          "concept_applied": "Conservation in central force motion and Kepler's laws",
          "image": {
            "url": "images/central-force-conservation.png",
            "alt": "Central force conservation",
            "caption": "Angular momentum conservation in central force motion"
          }
        }
      ]
    },
    {
      "section_title": "2. Systems with Changing Moments of Inertia",
      "introduction": "Analysis of systems where angular momentum conservation enables solving problems with changing mass distributions and moments of inertia, including collapsing stars, spinning athletes, and variable geometry mechanisms.",

      "key_concept": {
        "definition": "Variable Inertia, Mass Redistribution, Internal Forces, Energy Considerations, Angular Velocity Changes, Conservation Applications",
        "context": "When moments of inertia change due to mass redistribution while net external torque remains zero, angular momentum conservation requires compensating changes in angular velocity, enabling analysis of diverse phenomena from stellar collapse to athletic performance.",
        "image": {
          "url": "images/changing-inertia-concepts.png",
          "alt": "Changing inertia concepts",
          "caption": "Angular momentum conservation in systems with changing moments of inertia"
        }
      },

      "classifications": [
        {
          "type": "Variable Inertia Systems",
          "value": "Classification based on mechanisms of moment of inertia changes",
          "characteristics": [
            "Mass redistribution systems",
            "Collapsing or expanding objects",
            "Deformable body systems",
            "Multi-component assemblies",
            "Phase transition systems",
            "Astrophysical collapse scenarios",
            "Biological motion systems",
            "Mechanical adjustment systems"
          ],
          "behavior": "Different variable inertia systems exhibit characteristic behaviors. Mass redistribution changes I through internal forces, collapsing objects dramatically increase ω, and multi-component systems can transfer angular momentum between parts.",
          "examples": [
            {
              "process": "Internal Force Analysis",
              "explanation": "Analyzing how internal forces change moments of inertia without external torques",
              "image": {
                "url": "images/internal-force-analysis.png",
                "alt": "Internal force analysis",
                "caption": "Analysis of internal forces in variable inertia systems"
              }
            },
            {
              "process": "Energy Transfer Mechanisms",
              "explanation": "Examining energy changes during moment of inertia variations",
              "image": {
                "url": "images/energy-transfer-mechanisms.png",
                "alt": "Energy transfer mechanisms",
                "caption": "Energy transfer in systems with changing inertia"
              }
            }
          ],
          "note": "Key relationship: I₁ω₁ = I₂ω₂ when L conserved and τ_ext = 0"
        }
      ],

      "principles": [
        {
          "principle": "Systems with Changing Moments of Inertia",
          "statement": "Changing moment of inertia systems demonstrate profound conservation implications: Fundamental Relationship: τ_ext = 0 → L = Iω = constant; If I changes, ω must change inversely; I↑ → ω↓ and vice versa. Internal Forces: Can change I through mass redistribution; Do zero net work on system; Cannot change total L; Can transfer angular momentum between parts. Energy Considerations: Rotational KE = ½Iω² = L²/(2I); If I decreases, KE increases; Energy comes from internal work; If I increases, KE decreases; Energy goes to internal storage. Common Examples: Figure skater pulling arms in: I decreases, ω increases; Collapsing star: I decreases dramatically, ω increases enormously; Swinging ball on string pulled in: I decreases, ω increases. Multi-Component Systems: Different parts can have different I changes; Total L conserved; May involve complex energy transfers; Can analyze using L = ΣI_iω_i. Problem-Solving Approach: 1. Verify τ_ext = 0; 2. Calculate initial L; 3. Determine final I; 4. Apply L conservation: I_iω_i = I_fω_f; 5. Calculate energy changes; 6. Verify internal work. Limitations: Assumes rigid body approximation; Deformable bodies more complex; Internal dissipation may occur; Real systems have energy losses.",
          "application": "Solve problems with changing moments of inertia. Analyze energy changes in variable I systems. Handle multi-component systems with internal transfers. Apply to astrophysical and biological systems. Calculate work done by internal forces. Model real-world variable geometry systems.",
          "example": "Figure skater spin acceleration. Neutron star formation. Satellite with deploying booms. Diver rotation control. Swinging ball demonstration. Variable flywheel systems.",
          "analogy": "Systems with changing moments of inertia are like ice skaters on a frictionless pond - when they pull their arms inward (decreasing I), they must spin faster (increasing ω) to maintain their rotational 'budget' (conserved L), with the energy for faster spinning coming from their own muscle work, just as internal forces in physical systems can reshuffle rotational energy while respecting the overall angular momentum conservation",
          "image": {
            "url": "images/changing-inertia-principles.png",
            "alt": "Changing inertia principles",
            "caption": "Principles of angular momentum conservation with changing inertia"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Neutron Star Formation",
          "problem": "A star with mass 2×10³⁰ kg and radius 7×10⁸ m rotates once every 25 days. It collapses to form a neutron star of radius 10 km. Find the new rotation period, assuming 90% of mass is lost and angular momentum conserved.",
          "step_by_step": [
            {
              "step": "Initial angular velocity",
              "explanation": "ω_i = 2π/(25×24×3600) = 2π/2.16×10⁶ = 2.91×10⁻⁶ rad/s"
            },
            {
              "step": "Initial moment of inertia",
              "explanation": "Assume sphere: I_i = ⅖M_i R_i² = ⅖(2×10³⁰)(7×10⁸)² = ⅖(2×10³⁰)(4.9×10¹⁷) = 3.92×10⁴⁷ kg·m²"
            },
            {
              "step": "Initial angular momentum",
              "explanation": "L = I_i ω_i = (3.92×10⁴⁷)(2.91×10⁻⁶) = 1.14×10⁴² kg·m²/s"
            },
            {
              "step": "Final mass",
              "explanation": "M_f = 0.1 × 2×10³⁰ = 2×10²⁹ kg (10% of original)"
            },
            {
              "step": "Final moment of inertia",
              "explanation": "I_f = ⅖M_f R_f² = ⅖(2×10²⁹)(10⁴)² = ⅖(2×10²⁹)(10⁸) = 8×10³⁶ kg·m²"
            },
            {
              "step": "Apply angular momentum conservation",
              "explanation": "L = I_f ω_f → ω_f = L/I_f = (1.14×10⁴²)/(8×10³⁶) = 1.425×10⁵ rad/s"
            },
            {
              "step": "Final rotation period",
              "explanation": "T_f = 2π/ω_f = 2π/(1.425×10⁵) = 4.41×10⁻⁵ s"
            },
            {
              "step": "Convert to milliseconds",
              "explanation": "T_f = 0.0441 ms"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Neutron star rotates ~23,000 times per second! (Actual pulsars are this fast)"
            },
            {
              "step": "Energy increase",
              "explanation": "KE increases enormously due to dramatic I decrease"
            }
          ],
          "final_answer": "New rotation period: 0.044 ms (rotation rate: ~23,000 rpm)",
          "concept_applied": "Angular momentum conservation in stellar collapse",
          "image": {
            "url": "images/neutron-star-formation.png",
            "alt": "Neutron star formation",
            "caption": "Angular momentum conservation in neutron star formation"
          }
        },
        {
          "title": "Variable Geometry Flywheel",
          "problem": "A flywheel (I=5 kg·m²) rotates at 10 rad/s. Movable masses are pulled inward, reducing moment of inertia to 2 kg·m². Find the new speed and the work done.",
          "step_by_step": [
            {
              "step": "Initial angular momentum",
              "explanation": "L = I_i ω_i = 5 × 10 = 50 kg·m²/s"
            },
            {
              "step": "Apply conservation",
              "explanation": "L = I_f ω_f → 50 = 2 ω_f → ω_f = 25 rad/s"
            },
            {
              "step": "Initial kinetic energy",
              "explanation": "KE_i = ½ I_i ω_i² = ½ × 5 × 100 = 250 J"
            },
            {
              "step": "Final kinetic energy",
              "explanation": "KE_f = ½ I_f ω_f² = ½ × 2 × 625 = 625 J"
            },
            {
              "step": "Work done",
              "explanation": "W = ΔKE = 625 - 250 = 375 J"
            },
            {
              "step": "Power calculation",
              "explanation": "If this takes 2 seconds, average power = 375/2 = 187.5 W"
            },
            {
              "step": "Angular acceleration",
              "explanation": "α_avg = Δω/Δt = (25-10)/2 = 7.5 rad/s²"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Internal work increases rotational energy while conserving angular momentum"
            },
            {
              "step": "Efficiency consideration",
              "explanation": "In real systems, some energy lost to friction during mass movement"
            }
          ],
          "final_answer": "New speed: 25 rad/s; Work done: 375 J",
          "concept_applied": "Angular momentum conservation with work calculation",
          "image": {
            "url": "images/variable-flywheel.png",
            "alt": "Variable flywheel",
            "caption": "Angular momentum conservation in variable geometry flywheel"
          }
        }
      ]
    },
    {
      "section_title": "3. Complex Systems and Advanced Applications",
      "introduction": "Application of angular momentum conservation to sophisticated multi-object systems, combined motion scenarios, and real-world engineering and astrophysical problems requiring integrated analysis of multiple physical principles.",

      "key_concept": {
        "definition": "Multi-Object Systems, Combined Motion, Collision Analysis, Real-World Applications, Integrated Methods, Advanced Problem-Solving",
        "context": "Advanced applications of angular momentum conservation involve complex systems with multiple interacting components, combined translational and rotational motion, and real-world scenarios that require careful selection of reference frames and integration of multiple conservation laws.",
        "image": {
          "url": "images/complex-systems-concepts.png",
          "alt": "Complex systems concepts",
          "caption": "Angular momentum conservation in complex multi-object systems"
        }
      },

      "classifications": [
        {
          "type": "Advanced Application Domains",
          "value": "Classification based on system complexity and application areas",
          "characteristics": [
            "Multi-body collision systems",
            "Combined translation-rotation scenarios",
            "Astrophysical scale applications",
            "Quantum mechanical systems",
            "Engineering design applications",
            "Biological and biomechanical systems",
            "Experimental verification setups",
            "Cross-disciplinary applications"
          ],
          "behavior": "Different advanced domains require specialized approaches. Multi-body systems need careful reference point selection, combined motion requires separation of CM and rotational terms, and different scales may involve relativistic or quantum considerations.",
          "examples": [
            {
              "process": "Multi-Body System Analysis",
              "explanation": "Applying angular momentum conservation to systems with multiple interacting objects",
              "image": {
                "url": "images/multi-body-analysis.png",
                "alt": "Multi-body analysis",
                "caption": "Angular momentum conservation in multi-body systems"
              }
            },
            {
              "process": "Combined Motion Decomposition",
              "explanation": "Separating translational and rotational components in complex motion",
              "image": {
                "url": "images/combined-motion-decomposition.png",
                "alt": "Combined motion decomposition",
                "caption": "Decomposition of combined translational and rotational motion"
              }
            }
          ],
          "note": "Key approach: L_total = L_rotation + L_translation = I_cmω + r_cm × p_cm"
        }
      ],

      "principles": [
        {
          "principle": "Complex Systems and Advanced Applications",
          "statement": "Advanced angular momentum conservation covers sophisticated scenarios: Multi-Object Systems: Total L = ΣL_i about common point; Conserved if net external torque = 0; Internal forces cancel in pairs; Can analyze complex interactions. Combined Motion: Object moving and rotating; L about fixed point = L_rotation + L_translation; L_rotation = I_cmω about CM; L_translation = r_cm × p_cm. Collision Analysis: Impulsive forces often central during brief collisions; Angular momentum conserved about impact point; Combined with linear momentum conservation; Can determine post-collision motion. Reference Frame Strategies: Laboratory frame: fixed reference point; Center of mass frame: often simplifies analysis; Rotating frames: require fictitious forces. Real-World Applications: Spacecraft docking and separation; Vehicle dynamics and control; Sports equipment interactions; Manufacturing processes; Astrophysical phenomena. Problem-Solving Methodology: 1. Define system boundaries clearly; 2. Choose optimal reference frame; 3. Identify all conserved quantities; 4. Write equations for initial and final states; 5. Include constraint equations; 6. Solve system systematically; 7. Verify with energy methods. Cross-Disciplinary Connections: Classical mechanics to quantum mechanics; Macroscopic to microscopic scales; Engineering to natural systems; Theoretical predictions to experimental verification.",
          "application": "Apply conservation to multi-object systems with interactions. Analyze combined translational and rotational motion. Solve complex collision problems using conservation laws. Handle real-world engineering applications. Develop integrated problem-solving strategies. Connect classical concepts to modern physics.",
          "example": "Spacecraft rendezvous and docking. Automotive crash analysis. Planetary formation dynamics. Particle physics collisions. Robotics and automation systems. Sports biomechanics analysis.",
          "analogy": "Advanced angular momentum conservation is like conducting a symphony of rotating systems - each instrument (object) has its own rotational part, the conductor (problem solver) must coordinate all parts respecting the overall conservation laws, different sections (subsystems) can exchange rotational patterns while maintaining the total musical structure, and the performance can range from intimate chamber music (simple systems) to grand orchestral works (complex multi-body systems), all following the same fundamental principles of rotational harmony",
          "image": {
            "url": "images/complex-systems-principles.png",
            "alt": "Complex systems principles",
            "caption": "Principles of angular momentum conservation in complex systems"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Spacecraft Docking Maneuver",
          "problem": "A spacecraft (mass 2000 kg, I=3000 kg·m²) approaches a space station (mass 10000 kg, I=50000 kg·m²) rotating at 0.5 rad/s. The spacecraft docks tangentially at 5 m/s. Find the final rotation rate.",
          "step_by_step": [
            {
              "step": "Initial angular momentum of station",
              "explanation": "L_station = I_station ω_i = 50000 × 0.5 = 25000 kg·m²/s"
            },
            {
              "step": "Spacecraft approach parameters",
              "explanation": "Assume docking at R=10m from station center; Tangential velocity means maximum L contribution"
            },
            {
              "step": "Spacecraft angular momentum about station center",
              "explanation": "L_spacecraft = m v R = 2000 × 5 × 10 = 100000 kg·m²/s"
            },
            {
              "step": "Total initial angular momentum",
              "explanation": "L_total = L_station + L_spacecraft = 25000 + 100000 = 125000 kg·m²/s"
            },
            {
              "step": "Final moment of inertia",
              "explanation": "I_total = I_station + I_spacecraft + m_spacecraft R² = 50000 + 3000 + 2000×100 = 50000 + 3000 + 200000 = 253000 kg·m²"
            },
            {
              "step": "Apply angular momentum conservation",
              "explanation": "L_total = I_total ω_f → 125000 = 253000 ω_f"
            },
            {
              "step": "Solve for final angular velocity",
              "explanation": "ω_f = 125000/253000 = 0.494 rad/s"
            },
            {
              "step": "Compare with initial",
              "explanation": "Station slightly slows from 0.5 to 0.494 rad/s due to added mass"
            },
            {
              "step": "Energy analysis",
              "explanation": "Initial KE: ½(50000)(0.5)² + ½(2000)(5)² = 6250 + 25000 = 31250 J; Final KE: ½(253000)(0.494)² = 30850 J; Energy decreases due to inelastic docking"
            }
          ],
          "final_answer": "Final rotation rate: 0.494 rad/s",
          "concept_applied": "Angular momentum conservation in multi-body docking",
          "image": {
            "url": "images/spacecraft-docking.png",
            "alt": "Spacecraft docking",
            "caption": "Angular momentum conservation in spacecraft docking"
          }
        },
        {
          "title": "Compound Collision Analysis",
          "problem": "A rod (mass M, length L) pivoted at one end is struck by a clay blob (mass m, velocity v) that sticks to the end. Find the final angular velocity.",
          "step_by_step": [
            {
              "step": "Initial angular momentum about pivot",
              "explanation": "L_i = m v (L) (clay at distance L with velocity v)"
            },
            {
              "step": "Final moment of inertia",
              "explanation": "I_rod = ML²/3 (about end); I_clay = mL² (at end); I_total = ML²/3 + mL² = L²(M/3 + m)"
            },
            {
              "step": "Apply angular momentum conservation",
              "explanation": "L_i = I_total ω_f → m v L = L²(M/3 + m) ω_f"
            },
            {
              "step": "Solve for final angular velocity",
              "explanation": "ω_f = (m v L) / [L²(M/3 + m)] = (m v) / [L(M/3 + m)]"
            },
            {
              "step": "Simplify expression",
              "explanation": "ω_f = (3m v) / [L(M + 3m)]"
            },
            {
              "step": "Check limiting cases",
              "explanation": "If m << M: ω_f ≈ (3m v)/(M L) (small); If m >> M: ω_f ≈ v/L (maximum)"
            },
            {
              "step": "Energy analysis",
              "explanation": "Initial KE: ½m v²; Final KE: ½I_total ω_f² = ½L²(M/3+m)[(3m v)²/(L²(M+3m)²)] = (9m² v²)/(2(M+3m)); Energy loss: ΔKE = ½m v²[1 - (9m)/(M+3m)]"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Inelastic collision dissipates energy while conserving angular momentum"
            }
          ],
          "final_answer": "Final angular velocity: ω = (3m v)/[L(M + 3m)]",
          "concept_applied": "Angular momentum conservation in inelastic collision",
          "image": {
            "url": "images/compound-collision.png",
            "alt": "Compound collision",
            "caption": "Angular momentum conservation in compound collision"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Angular momentum conservation",
    "τ_ext = 0",
    "L_initial = L_final",
    "Changing moment of inertia",
    "Central forces",
    "Multi-object systems",
    "Combined motion",
    "Reference frame selection",
    "Collision analysis",
    "Internal forces",
    "Energy transfer",
    "Conservation conditions",
    "System boundaries",
    "Real-world applications"
  ],

  "common_misconceptions": [
    "Thinking angular momentum is always conserved",
    "Confusing internal and external torques",
    "Misapplying conservation to non-inertial frames",
    "Thinking energy is always conserved with angular momentum",
    "Confusing different reference points",
    "Misunderstanding central force conditions",
    "Thinking all collisions conserve angular momentum",
    "Confusing linear and angular momentum conservation"
  ],

  "real_world_applications": [
    "Spacecraft attitude control and orbital mechanics",
    "Astrophysical phenomena and star formation",
    "Vehicle dynamics and crash analysis",
    "Sports biomechanics and equipment design",
    "Particle physics and collision experiments",
    "Robotics and automation systems",
    "Manufacturing and industrial processes",
    "Quantum mechanical systems and atomic physics",
    "Geophysical and planetary science",
    "Engineering design and mechanical systems"
  ],

  "summary": "Conservation of angular momentum represents one of the most powerful and universally applicable principles in physics, enabling solutions to complex problems across scales from subatomic particles to galactic systems. When net external torque is zero, angular momentum remains constant regardless of internal changes, allowing analysis of systems with variable moments of inertia, complex collisions, and combined translational-rotational motion. Through careful selection of reference frames, identification of conserved quantities, and systematic application of conservation principles, we can solve otherwise intractable problems in orbital mechanics, astrophysics, engineering design, and fundamental physics. This capstone unit synthesizes rotational dynamics concepts into a comprehensive framework for analyzing and predicting rotational behavior in the most challenging and sophisticated physical systems."
}
