{
  "topic": "Rotation",
  "unit_title": "Rolling Without Slipping: Combined Translation and Rotation",
  "unit_number": "Unit 5.6",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Mechanics",
  "duration": "3-4 hours",
  "difficulty_level": "advanced",
  "expanded_description": "This unit explores the sophisticated dynamics of rolling without slipping, where objects exhibit both translational and rotational motion simultaneously. Students will master the kinematic constraints, energy relationships, and force analyses unique to rolling motion, and apply these concepts to solve complex problems involving various geometric shapes rolling on different surfaces.",

  "learning_objectives": [
    "Apply the rolling without slipping condition v_cm = Rω and a_cm = Rα",
    "Analyze rolling motion using both force and energy methods",
    "Solve problems involving objects rolling on inclines and curved paths",
    "Calculate static friction requirements for rolling without slipping",
    "Analyze rolling race problems between different geometric shapes",
    "Apply rolling dynamics to real-world mechanical systems"
  ],

  "prerequisites": [
    "Mastery of rotational dynamics (Unit 5.4)",
    "Understanding of rotational energy concepts (Unit 5.5)",
    "Proficiency with moment of inertia calculations (Units 5.2-5.3)",
    "Familiarity with friction concepts and Newton's laws",
    "Ability to solve systems of equations with constraints"
  ],

  "core_concept": {
    "principle": "Rolling Without Slipping, Combined Motion, Kinematic Constraints, Static Friction, Instantaneous Center, Energy Distribution",
    "explanation": "Rolling without slipping represents a special case of rigid body motion where translational and rotational motion are coupled through the constraint v_cm = Rω, with the point of contact instantaneously at rest relative to the surface.",
    "image": {
      "url": "images/rolling-core.png",
      "alt": "Rolling without slipping core concept",
      "caption": "Combined translational and rotational motion in rolling without slipping"
    }
  },

  "sections": [
    {
      "section_title": "1. Kinematics and Constraints of Rolling Motion",
      "introduction": "Development of the fundamental kinematic relationships for rolling without slipping, including the velocity and acceleration constraints, analysis of different points on a rolling object, and the concept of instantaneous center of rotation.",

      "key_concept": {
        "definition": "Rolling Condition, Velocity Distribution, Instantaneous Center, Contact Point, Combined Motion, Constraint Equations",
        "context": "Rolling without slipping imposes specific kinematic constraints that couple translational and rotational motion, creating unique velocity distributions and defining an instantaneous center of rotation at the contact point.",
        "image": {
          "url": "images/rolling-kinematics-concepts.png",
          "alt": "Rolling kinematics concepts",
          "caption": "Kinematic constraints and velocity distributions in rolling motion"
        }
      },

      "classifications": [
        {
          "type": "Rolling Motion Types",
          "value": "Classification based on object geometry and surface conditions",
          "characteristics": [
            "Pure rolling without slipping",
            "Rolling with slipping",
            "Accelerated rolling",
            "Decelerated rolling",
            "Rolling on inclined surfaces",
            "Rolling on curved paths",
            "Objects with different inertia distributions",
            "Multi-object rolling systems"
          ],
          "behavior": "Different rolling scenarios exhibit characteristic motion patterns. Pure rolling maintains the no-slip condition, accelerated rolling requires static friction, and different geometric shapes distribute energy differently between translation and rotation.",
          "examples": [
            {
              "process": "Velocity Analysis in Rolling",
              "explanation": "Analyzing velocity distributions for different points on a rolling object",
              "image": {
                "url": "images/rolling-velocity-analysis.png",
                "alt": "Rolling velocity analysis",
                "caption": "Velocity analysis for points on a rolling object"
              }
            },
            {
              "process": "Instantaneous Center Determination",
              "explanation": "Identifying the instantaneous center of rotation in rolling motion",
              "image": {
                "url": "images/instantaneous-center.png",
                "alt": "Instantaneous center",
                "caption": "Determination of instantaneous center in rolling motion"
              }
            }
          ],
          "note": "Key constraint: v_cm = Rω and a_cm = Rα for rolling without slipping"
        }
      ],

      "principles": [
        {
          "principle": "Kinematics and Constraints of Rolling Motion",
          "statement": "Rolling without slipping involves coupled translational and rotational motion: Fundamental Constraints: Velocity: v_cm = Rω (center of mass velocity); Acceleration: a_cm = Rα (center of mass acceleration); Contact point has zero velocity relative to surface. Velocity Distribution: Center of mass: v_cm forward; Top point: v_top = v_cm + Rω = 2v_cm (forward); Bottom (contact) point: v_bottom = v_cm - Rω = 0; Side points: combination of components. Instantaneous Center of Rotation: For rolling without slipping, the contact point is instantaneously at rest; The entire object rotates instantaneously about the contact point; Useful for velocity calculations. Position and Angle Relationship: Distance traveled: s = Rθ; Linear displacement equals arc length; Valid for pure rolling. Acceleration Relationships: Linear acceleration of CM related to angular acceleration; Tangential acceleration at different points; Centripetal acceleration for curved paths. Different Geometric Shapes: Same constraints apply to all rigid bodies; Different mass distributions affect dynamics but not pure kinematics; Moment of inertia determines energy distribution. Problem-Solving Approach: 1. Identify rolling condition; 2. Apply constraint equations; 3. Use appropriate kinematic equations; 4. Solve for unknown quantities; 5. Verify physical reasonableness.",
          "application": "Apply rolling constraints to various geometric shapes. Analyze velocity distributions on rolling objects. Use instantaneous center method for velocity calculations. Solve kinematic problems involving rolling motion. Determine position and orientation relationships. Analyze accelerated rolling scenarios.",
          "example": "Vehicle wheel motion analysis. Ball rolling on flat surface. Cylinder rolling down incline. Gear meshing in machinery. Conveyor belt systems. Sports ball dynamics.",
          "analogy": "Rolling without slipping is like a tank track moving - each track segment makes temporary contact with the ground (instantaneous center), then lifts off as the tank moves forward, with the overall motion combining the forward movement of the vehicle (translation) and the circular motion of the tracks (rotation), perfectly synchronized so no sliding occurs at the contact points",
          "image": {
            "url": "images/rolling-kinematics-principles.png",
            "alt": "Rolling kinematics principles",
            "caption": "Principles of rolling motion kinematics and constraints"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Velocity Analysis of Rolling Wheel",
          "problem": "A wheel of radius R rolls without slipping with center velocity v. Find the velocities of points at the top, bottom, and side of the wheel relative to the ground.",
          "step_by_step": [
            {
              "step": "Apply rolling condition",
              "explanation": "v_cm = v, ω = v/R"
            },
            {
              "step": "General velocity formula",
              "explanation": "For any point: v_point = v_cm + ω × r (vector sum)"
            },
            {
              "step": "Top point (r = R upward)",
              "explanation": "v_top = v_cm + ω × (R↑) = v→ + (v/R)(R) → = v→ + v→ = 2v→"
            },
            {
              "step": "Bottom point (r = R downward)",
              "explanation": "v_bottom = v_cm + ω × (R↓) = v→ + (v/R)(-R) → = v→ - v→ = 0"
            },
            {
              "step": "Right side point (r = R right)",
              "explanation": "v_side = v_cm + ω × (R→) = v→ + (v/R)(R) ↑ = v→ + v↑"
            },
            {
              "step": "Magnitude for side point",
              "explanation": "|v_side| = √(v² + v²) = v√2"
            },
            {
              "step": "Direction for side point",
              "explanation": "45° upward from horizontal"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Contact point instantaneously at rest; Top point moves fastest at 2v; Side points move at 45° angles"
            }
          ],
          "final_answer": "Top: 2v forward; Bottom: 0; Side: v√2 at 45° upward",
          "concept_applied": "Velocity distribution in rolling motion",
          "image": {
            "url": "images/wheel-velocity-example.png",
            "alt": "Wheel velocity example",
            "caption": "Velocity analysis for points on a rolling wheel"
          }
        },
        {
          "title": "Accelerated Rolling Kinematics",
          "problem": "A solid cylinder starts from rest and rolls without slipping down an incline. After 3 seconds, it has moved 9m down the incline. Find the cylinder's radius.",
          "step_by_step": [
            {
              "step": "Use linear kinematics",
              "explanation": "s = ½a_cm t² → 9 = ½a_cm (3)² → 9 = 4.5a_cm → a_cm = 2 m/s²"
            },
            {
              "step": "Relate linear and angular acceleration",
              "explanation": "a_cm = Rα (rolling condition)"
            },
            {
              "step": "Need another relationship",
              "explanation": "Use dynamics or energy; From energy: a_cm = g sinθ / (1 + I/(MR²))"
            },
            {
              "step": "For solid cylinder",
              "explanation": "I = ½MR² → I/(MR²) = ½ → a_cm = g sinθ / (1 + ½) = (2/3)g sinθ"
            },
            {
              "step": "Solve for sinθ",
              "explanation": "2 = (2/3)(9.8) sinθ → 2 = 6.533 sinθ → sinθ = 0.306"
            },
            {
              "step": "Find angular acceleration",
              "explanation": "α = a_cm/R = 2/R"
            },
            {
              "step": "Insufficient information",
              "explanation": "Cannot find R from given information alone; Need additional constraint"
            },
            {
              "step": "Revised approach",
              "explanation": "The distance traveled relates to both linear and angular motion through s = Rθ"
            },
            {
              "step": "Angular displacement",
              "explanation": "θ = s/R = 9/R radians"
            },
            {
              "step": "Angular kinematics",
              "explanation": "θ = ½αt² → 9/R = ½(2/R)(3)² = ½(2/R)(9) = 9/R"
            },
            {
              "step": "Identity result",
              "explanation": "Equation is automatically satisfied; R cancels out; Cannot determine R from kinematics alone"
            }
          ],
          "final_answer": "Radius cannot be determined from given kinematic information alone; Additional constraints needed",
          "concept_applied": "Kinematic constraints in accelerated rolling",
          "image": {
            "url": "images/accelerated-rolling-example.png",
            "alt": "Accelerated rolling example",
            "caption": "Kinematic analysis of accelerated rolling motion"
          }
        }
      ]
    },
    {
      "section_title": "2. Dynamics and Energy of Rolling Motion",
      "introduction": "Analysis of the forces and energy relationships in rolling without slipping, including the role of static friction, applications of Newton's laws to combined motion, and energy methods for solving rolling problems.",

      "key_concept": {
        "definition": "Static Friction, Force Analysis, Energy Distribution, Work-Energy Theorem, Rolling Resistance, Conservation Methods",
        "context": "Rolling without slipping involves sophisticated dynamics where static friction provides the torque needed for rotation without dissipating energy, and the total kinetic energy is distributed between translation and rotation according to the object's moment of inertia.",
        "image": {
          "url": "images/rolling-dynamics-concepts.png",
          "alt": "Rolling dynamics concepts",
          "caption": "Force analysis and energy distribution in rolling motion"
        }
      },

      "classifications": [
        {
          "type": "Rolling Dynamics Approaches",
          "value": "Classification based on analytical methods and force considerations",
          "characteristics": [
            "Force and torque analysis",
            "Energy conservation methods",
            "Work-energy theorem applications",
            "Static friction requirements",
            "Minimum friction calculations",
            "Rolling on different surfaces",
            "Accelerated rolling dynamics",
            "Deceleration and braking scenarios"
          ],
          "behavior": "Different analytical approaches provide complementary insights into rolling dynamics. Force methods reveal friction requirements, energy methods simplify acceleration calculations, and work-energy methods handle non-conservative situations.",
          "examples": [
            {
              "process": "Force Analysis for Rolling",
              "explanation": "Applying Newton's laws and torque equations to rolling objects",
              "image": {
                "url": "images/rolling-force-analysis.png",
                "alt": "Rolling force analysis",
                "caption": "Force and torque analysis for rolling objects"
              }
            },
            {
              "process": "Energy Methods in Rolling",
              "explanation": "Using energy conservation to analyze rolling motion",
              "image": {
                "url": "images/rolling-energy-methods.png",
                "alt": "Rolling energy methods",
                "caption": "Energy conservation methods for rolling motion"
              }
            }
          ],
          "note": "Key insight: Static friction in rolling without slipping does no work and is necessary for accelerated rolling"
        }
      ],

      "principles": [
        {
          "principle": "Dynamics and Energy of Rolling Motion",
          "statement": "Rolling dynamics involves combined application of Newton's laws and energy principles: Force Analysis: Translation: ΣF = ma_cm; Rotation: Στ = Iα; For rolling without slipping: a_cm = Rα; Static friction provides necessary torque. Role of Friction: Static friction required for accelerated rolling; Does zero work in pure rolling (v_contact=0); Determines maximum acceleration without slipping; f_s ≤ μ_s N. Energy Considerations: Total KE = ½mv_cm² + ½Iω²; For rolling: ω = v_cm/R, so KE = ½(m + I/R²)v²; Effective mass concept. Energy Conservation: For conservative systems: mgh = ½(m + I/R²)v²; Acceleration: a_cm = g sinθ / (1 + I/(mR²)). Common Objects: Solid sphere: I = ⅖mR² → a = (5/7)g sinθ; Solid cylinder: I = ½mR² → a = (2/3)g sinθ; Hollow cylinder: I = mR² → a = (½)g sinθ. Problem-Solving Strategies: Force method: Write F=ma and τ=Iα, use a=Rα, solve system; Energy method: Use conservation, often simpler; Choice depends on needed information. Applications: Incline problems; Rolling race scenarios; Vehicle acceleration; Braking systems; Mechanical advantage systems.",
          "application": "Analyze forces in rolling motion on inclines. Calculate static friction requirements. Apply energy conservation to rolling systems. Solve rolling race problems. Determine acceleration for different shapes. Analyze braking and deceleration in rolling.",
          "example": "Objects rolling down ramps (which wins?). Vehicle acceleration and braking. Ball rolling on various surfaces. Industrial roller systems. Sports equipment dynamics. Conveyor system design.",
          "analogy": "Rolling dynamics is like a coordinated dance partnership - the forward motion (translation) and spinning motion (rotation) must stay perfectly synchronized (v=Rω), with static friction acting as the connection that maintains this synchronization without energy loss, while different dance styles (object shapes) require different levels of coordination effort (friction requirements) to maintain the perfect timing",
          "image": {
            "url": "images/rolling-dynamics-principles.png",
            "alt": "Rolling dynamics principles",
            "caption": "Principles of rolling motion dynamics and energy"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Sphere Rolling Down Incline with Friction Analysis",
          "problem": "A solid sphere rolls without slipping down an incline of angle 30°. Find the acceleration and the minimum coefficient of static friction needed.",
          "step_by_step": [
            {
              "step": "Forces on sphere",
              "explanation": "Weight mg downward; Normal force N; Static friction f_s up incline"
            },
            {
              "step": "Translation equation",
              "explanation": "ma = mg sinθ - f_s (down incline positive)"
            },
            {
              "step": "Rotation equation",
              "explanation": "Iα = f_s R (friction provides torque)"
            },
            {
              "step": "Moment of inertia",
              "explanation": "Solid sphere: I = ⅖mR²"
            },
            {
              "step": "Rolling condition",
              "explanation": "a = Rα"
            },
            {
              "step": "Combine equations",
              "explanation": "From rotation: f_s R = (⅖mR²)(a/R) → f_s = ⅖ma"
            },
            {
              "step": "Substitute into translation",
              "explanation": "ma = mg sinθ - ⅖ma → ma + ⅖ma = mg sinθ → (7/5)ma = mg sinθ"
            },
            {
              "step": "Solve for acceleration",
              "explanation": "a = (5/7)g sinθ = (5/7)(9.8)(0.5) = 3.5 m/s²"
            },
            {
              "step": "Find friction force",
              "explanation": "f_s = ⅖ma = ⅖m(3.5) = 1.4m N"
            },
            {
              "step": "Normal force",
              "explanation": "N = mg cosθ = m(9.8)(0.866) = 8.49m N"
            },
            {
              "step": "Minimum coefficient of friction",
              "explanation": "μ_min = f_s/N = 1.4m/8.49m = 0.165"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Acceleration 3.5 m/s² is less than sliding value 4.9 m/s²; Requires μ ≥ 0.165"
            }
          ],
          "final_answer": "Acceleration: 3.5 m/s²; Minimum μ_s: 0.165",
          "concept_applied": "Force analysis with friction requirements",
          "image": {
            "url": "images/sphere-incline-example.png",
            "alt": "Sphere incline example",
            "caption": "Force analysis for sphere rolling down incline"
          }
        },
        {
          "title": "Energy Method for Rolling Acceleration",
          "problem": "A hollow cylinder (I=mR²) rolls without slipping from rest down an incline of height h. Find the speed at the bottom using energy conservation.",
          "step_by_step": [
            {
              "step": "Initial energy",
              "explanation": "E_i = mgh (gravitational potential)"
            },
            {
              "step": "Final energy",
              "explanation": "E_f = ½mv² + ½Iω² (translational + rotational KE)"
            },
            {
              "step": "Moment of inertia",
              "explanation": "Hollow cylinder: I = mR²"
            },
            {
              "step": "Rolling condition",
              "explanation": "ω = v/R"
            },
            {
              "step": "Substitute into energy",
              "explanation": "E_f = ½mv² + ½(mR²)(v²/R²) = ½mv² + ½mv² = mv²"
            },
            {
              "step": "Apply energy conservation",
              "explanation": "mgh = mv²"
            },
            {
              "step": "Solve for velocity",
              "explanation": "v = √(gh)"
            },
            {
              "step": "Compare with other shapes",
              "explanation": "Solid sphere: v = √(10gh/7) ≈ √(1.429gh); Solid cylinder: v = √(4gh/3) ≈ √(1.333gh); Hollow cylinder: v = √(gh)"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Hollow cylinder slowest because most energy goes to rotation; Solid sphere fastest"
            },
            {
              "step": "Acceleration comparison",
              "explanation": "From v² = 2as with s = h/sinθ, a = (v² sinθ)/(2h) = (gh sinθ)/(2h) = ½g sinθ"
            }
          ],
          "final_answer": "Speed at bottom: v = √(gh)",
          "concept_applied": "Energy conservation in rolling motion",
          "image": {
            "url": "images/rolling-energy-example.png",
            "alt": "Rolling energy example",
            "caption": "Energy method for rolling object on incline"
          }
        }
      ]
    },
    {
      "section_title": "3. Advanced Rolling Scenarios and Applications",
      "introduction": "Analysis of complex rolling scenarios including rolling on curved paths, objects with unusual mass distributions, rolling with slipping transitions, and real-world applications in engineering and technology.",

      "key_concept": {
        "definition": "Curved Path Rolling, Unusual Mass Distributions, Slipping Transitions, Real-World Applications, Complex Constraints, Advanced Problem-Solving",
        "context": "Advanced rolling scenarios involve complex geometries, curved paths, transitions between rolling with and without slipping, and sophisticated applications that require integrated analysis of multiple physical principles.",
        "image": {
          "url": "images/advanced-rolling-concepts.png",
          "alt": "Advanced rolling concepts",
          "caption": "Complex rolling scenarios and advanced applications"
        }
      },

      "classifications": [
        {
          "type": "Advanced Rolling Scenarios",
          "value": "Classification based on complexity and specialized applications",
          "characteristics": [
            "Rolling on curved surfaces and paths",
            "Objects with off-center mass distributions",
            "Transitions between rolling and slipping",
            "Rolling with external driving forces",
            "Multi-object rolling systems",
            "Non-uniform rolling objects",
            "Rolling with deformation effects",
            "Real-world engineering applications"
          ],
          "behavior": "Different advanced scenarios exhibit unique behaviors. Curved path rolling involves centripetal forces, mass distribution affects stability, slipping transitions change friction behavior, and real-world applications often combine multiple physical effects.",
          "examples": [
            {
              "process": "Curved Path Rolling Analysis",
              "explanation": "Analyzing rolling motion on curved surfaces and banked paths",
              "image": {
                "url": "images/curved-path-rolling.png",
                "alt": "Curved path rolling",
                "caption": "Analysis of rolling motion on curved paths"
              }
            },
            {
              "process": "Slipping Transition Analysis",
              "explanation": "Analyzing transitions between rolling with and without slipping",
              "image": {
                "url": "images/slipping-transitions.png",
                "alt": "Slipping transitions",
                "caption": "Analysis of transitions between rolling and slipping"
              }
            }
          ],
          "note": "Key challenge: Rolling on curved paths requires analyzing centripetal forces and normal force variations"
        }
      ],

      "principles": [
        {
          "principle": "Advanced Rolling Scenarios and Applications",
          "statement": "Advanced rolling scenarios extend basic principles to complex situations: Curved Path Rolling: On banked curves: normal force has horizontal component; On vertical loops: requires minimum speed; On arbitrary curves: centripetal acceleration important. Unusual Mass Distributions: Off-center CM: additional torque from gravity; Variable density: affects moment of inertia; Asymmetric objects: complex dynamics. Rolling-Slipping Transitions: Object starts slipping when f_s max = μ_s N exceeded; During slipping: kinetic friction acts; Can transition back to rolling; Energy dissipated during slipping. Real-World Applications: Vehicle dynamics: tire-road interaction; Ball bearings: efficient rolling; Industrial rollers: material transport; Sports equipment: balls, wheels, disks; Robotics: wheeled locomotion. Complex Constraints: Multiple rolling objects connected; Rolling with driving torques; Rolling with deformation; Non-rigid rolling objects; Rolling with air resistance. Problem-Solving Strategies: 1. Identify all constraints and transitions; 2. Apply appropriate friction model; 3. Use energy methods when possible; 4. Check all force and torque balances; 5. Verify physical reasonableness; 6. Consider limiting cases. Special Techniques: Instantaneous center method for velocities; Energy methods for conservative systems; Impulse-momentum for collisions; Numerical methods for complex paths.",
          "application": "Analyze rolling on curved and banked paths. Handle objects with unusual mass distributions. Solve problems involving rolling-slipping transitions. Apply rolling concepts to real-world engineering. Solve complex multi-object rolling systems. Use advanced problem-solving strategies.",
          "example": "Vehicle cornering dynamics. Ball rolling through loops and curves. Manufacturing roller systems. Sports ball behavior on various surfaces. Robotics wheel design. Amusement ride dynamics.",
          "analogy": "Advanced rolling scenarios are like sophisticated dance performances on challenging stages - curved path rolling is like dancing on a sloped or banked floor requiring careful balance, unusual mass distributions are like dancing with asymmetric weights requiring extra control, slipping transitions are like recovering from a misstep, and real-world applications are like choreographing entire dance routines that combine all these elements seamlessly for practical purposes",
          "image": {
            "url": "images/advanced-rolling-principles.png",
            "alt": "Advanced rolling principles",
            "caption": "Principles of advanced rolling scenarios and applications"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Rolling on a Banked Curve",
          "problem": "A car travels at 20 m/s around a banked curve of radius 50m. The curve is banked at 15°. Determine if the car can negotiate the curve without relying on friction, and find the required friction if not.",
          "step_by_step": [
            {
              "step": "Ideal banking condition",
              "explanation": "For no friction: tanθ = v²/(Rg)"
            },
            {
              "step": "Calculate required banking",
              "explanation": "θ_ideal = arctan(v²/(Rg)) = arctan(400/(50×9.8)) = arctan(400/490) = arctan(0.816) = 39.2°"
            },
            {
              "step": "Compare with actual banking",
              "explanation": "Actual θ = 15° < 39.2°, so friction needed toward center"
            },
            {
              "step": "Force analysis",
              "explanation": "N sinθ + f cosθ = mv²/R (horizontal); N cosθ - f sinθ = mg (vertical)"
            },
            {
              "step": "Solve for friction",
              "explanation": "From vertical: N = mg/(cosθ - μ sinθ) assuming f = μN; Better to solve generally"
            },
            {
              "step": "General solution",
              "explanation": "f = m[v²/R cosθ - g sinθ] / [sin²θ + cos²θ] = m[v²/R cosθ - g sinθ]"
            },
            {
              "step": "Calculate numerical value",
              "explanation": "f/m = (400/50)cos15° - 9.8 sin15° = 8×0.966 - 9.8×0.259 = 7.728 - 2.536 = 5.192 m/s²"
            },
            {
              "step": "Find normal force",
              "explanation": "N/m = g cosθ + (v²/R) sinθ = 9.8×0.966 + 8×0.259 = 9.47 + 2.07 = 11.54 m/s²"
            },
            {
              "step": "Required friction coefficient",
              "explanation": "μ = f/N = 5.192/11.54 = 0.45"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Substantial friction needed (μ=0.45) because banking is insufficient"
            }
          ],
          "final_answer": "Friction required: μ = 0.45 toward center of curve",
          "concept_applied": "Rolling on banked curves with friction",
          "image": {
            "url": "images/banked-curve-example.png",
            "alt": "Banked curve example",
            "caption": "Analysis of rolling on banked curves"
          }
        },
        {
          "title": "Transition from Slipping to Rolling",
          "problem": "A billiard ball is struck with a cue stick, giving it initial velocity v₀ but no initial rotation. If μ_k = 0.2, find how long it takes to start rolling without slipping and the final velocity.",
          "step_by_step": [
            {
              "step": "Initial conditions",
              "explanation": "v_i = v₀, ω_i = 0 (slipping initially)"
            },
            {
              "step": "Forces during slipping",
              "explanation": "Friction f_k = μ_k mg opposite to motion"
            },
            {
              "step": "Linear acceleration",
              "explanation": "a = -f_k/m = -μ_k g (deceleration)"
            },
            {
              "step": "Angular acceleration",
              "explanation": "α = τ/I = (f_k R)/I = (μ_k mgR)/(⅖mR²) = (5/2)μ_k g/R"
            },
            {
              "step": "Velocity as function of time",
              "explanation": "v(t) = v₀ - μ_k g t"
            },
            {
              "step": "Angular velocity as function of time",
              "explanation": "ω(t) = 0 + αt = (5/2)μ_k g t/R"
            },
            {
              "step": "Rolling condition",
              "explanation": "v(t) = Rω(t) when rolling begins"
            },
            {
              "step": "Set up equation",
              "explanation": "v₀ - μ_k g t = R × [(5/2)μ_k g t/R] = (5/2)μ_k g t"
            },
            {
              "step": "Solve for time",
              "explanation": "v₀ - μ_k g t = (5/2)μ_k g t → v₀ = (7/2)μ_k g t → t = (2v₀)/(7μ_k g)"
            },
            {
              "step": "Final velocity",
              "explanation": "v_f = v₀ - μ_k g t = v₀ - μ_k g (2v₀)/(7μ_k g) = v₀ - (2/7)v₀ = (5/7)v₀"
            },
            {
              "step": "Numerical example",
              "explanation": "For v₀ = 5 m/s, μ_k = 0.2: t = (2×5)/(7×0.2×9.8) = 10/13.72 = 0.73 s; v_f = (5/7)×5 = 3.57 m/s"
            },
            {
              "step": "Energy loss",
              "explanation": "Initial KE: ½mv₀²; Final KE: ½mv_f² + ½Iω_f² = ½m(25/49)v₀² + ½(⅖mR²)(25/49)(v₀²/R²) = (25/98 + 10/98)mv₀² = (35/98)mv₀² = (5/14)mv₀²; Fraction lost: 1 - 5/14 = 9/14 ≈ 64%"
            }
          ],
          "final_answer": "Time to start rolling: t = 2v₀/(7μ_kg); Final velocity: v_f = (5/7)v₀",
          "concept_applied": "Transition from slipping to rolling",
          "image": {
            "url": "images/slipping-transition-example.png",
            "alt": "Slipping transition example",
            "caption": "Analysis of transition from slipping to rolling"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Rolling without slipping",
    "v_cm = Rω",
    "a_cm = Rα",
    "Static friction",
    "Instantaneous center",
    "Combined motion",
    "Kinematic constraints",
    "Energy distribution",
    "Rolling resistance",
    "Banked curves",
    "Slipping transitions",
    "Moment of inertia",
    "Contact point",
    "Velocity distribution"
  ],

  "common_misconceptions": [
    "Thinking friction always opposes motion in rolling",
    "Confusing static and kinetic friction in rolling",
    "Believing the contact point has absolute zero velocity",
    "Thinking all rolling objects accelerate equally down inclines",
    "Confusing rolling without slipping with pure rotation",
    "Misapplying energy conservation during slipping",
    "Thinking rolling friction is the same as sliding friction",
    "Confusing instantaneous center with fixed rotation center"
  ],

  "real_world_applications": [
    "Vehicle tire dynamics and traction control",
    "Ball bearing and roller bearing systems",
    "Industrial conveyor and transport systems",
    "Sports equipment design (balls, wheels, disks)",
    "Robotics and autonomous vehicle navigation",
    "Manufacturing roller systems",
    "Amusement ride dynamics",
    "Aerospace landing gear systems",
    "Medical device rollers and wheels",
    "Construction equipment mobility systems"
  ],

  "summary": "Rolling without slipping represents a sophisticated form of rigid body motion that combines translation and rotation through the fundamental constraints v_cm = Rω and a_cm = Rα. This unique motion involves static friction that enables acceleration without energy dissipation, distinct velocity distributions across the object, and an instantaneous center of rotation at the contact point. Through careful analysis of forces, energy distributions, and kinematic constraints, we can solve complex problems involving various geometric shapes rolling on different surfaces, including inclined planes, curved paths, and banked curves. The advanced concepts of rolling-slipping transitions, unusual mass distributions, and real-world applications demonstrate the power and versatility of rolling dynamics across engineering, physics, and technology, providing essential tools for analyzing and designing systems where efficient motion with minimal energy loss is crucial."
}
