{
  "topic": "Rotation",
  "unit_title": "Rotational Kinematics: Angular Motion with Calculus",
  "unit_number": "Unit 5.1",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Mechanics",
  "duration": "3-4 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "This foundational unit introduces rotational kinematics using calculus-based approaches, establishing the mathematical framework for describing rotational motion. Students will develop proficiency with angular position, velocity, and acceleration relationships, and apply calculus to solve complex rotational motion problems involving variable angular acceleration and non-uniform rotation.",

  "learning_objectives": [
    "Define and apply angular position, velocity, and acceleration using calculus",
    "Solve rotational kinematics problems with constant and variable angular acceleration",
    "Relate linear and angular kinematic quantities",
    "Apply integration and differentiation to rotational motion problems",
    "Analyze complex rotational scenarios with changing acceleration",
    "Develop mathematical models for real-world rotational systems"
  ],

  "prerequisites": [
    "Mastery of linear kinematics and calculus",
    "Understanding of derivatives and integrals in physics context",
    "Proficiency with trigonometric functions and coordinate systems",
    "Familiarity with basic rotational concepts from introductory physics",
    "Ability to set up and solve differential equations"
  ],

  "core_concept": {
    "principle": "Angular Kinematics, Calculus Applications, Rotational-Linear Relationships, Variable Acceleration, Integration Methods",
    "explanation": "Rotational kinematics extends linear motion concepts to rotation, using calculus to describe relationships between angular position, velocity, and acceleration, particularly for cases with non-constant acceleration.",
    "image": {
      "url": "images/rotational-kinematics-core.png",
      "alt": "Rotational kinematics core concept",
      "caption": "Calculus-based framework for rotational kinematics"
    }
  },

  "sections": [
    {
      "section_title": "1. Fundamental Angular Quantities and Calculus Relationships",
      "introduction": "Development of the mathematical foundation for rotational kinematics, establishing definitions of angular position, velocity, and acceleration, and their relationships through calculus operations.",

      "key_concept": {
        "definition": "Angular Position, Angular Velocity, Angular Acceleration, Calculus Relationships, Derivative-Integral Connections",
        "context": "The core kinematic quantities for rotational motion are mathematically connected through differentiation and integration, enabling analysis of complex rotational scenarios.",
        "image": {
          "url": "images/angular-quantities-concepts.png",
          "alt": "Angular quantities concepts",
          "caption": "Fundamental angular quantities and their calculus relationships"
        }
      },

      "classifications": [
        {
          "type": "Angular Kinematic Quantities",
          "value": "Classification based on rotational motion descriptors and their mathematical properties",
          "characteristics": [
            "Angular position as fundamental variable",
            "Angular velocity as rate of change",
            "Angular acceleration as second derivative",
            "Vector nature of rotational quantities",
            "Right-hand rule conventions",
            "Unit consistency and dimensional analysis",
            "Calculus-based relationships",
            "Frame of reference considerations"
          ],
          "behavior": "Different angular quantities exhibit specific mathematical relationships. Position integrates to displacement, velocity differentiates to acceleration, and these relationships enable solving complex motion problems.",
          "examples": [
            {
              "process": "Derivative Relationships",
              "explanation": "Applying differentiation to connect angular position, velocity, and acceleration",
              "image": {
                "url": "images/angular-derivatives.png",
                "alt": "Angular derivatives",
                "caption": "Derivative relationships between angular quantities"
              }
            },
            {
              "process": "Integration Methods",
              "explanation": "Using integration to determine angular position from acceleration or velocity",
              "image": {
                "url": "images/angular-integration.png",
                "alt": "Angular integration",
                "caption": "Integration methods for rotational kinematics"
              }
            }
          ],
          "note": "Key principle: ω = dθ/dt, α = dω/dt = d²θ/dt² - the fundamental calculus relationships"
        }
      ],

      "principles": [
        {
          "principle": "Fundamental Angular Quantities and Calculus Relationships",
          "statement": "Rotational kinematics builds on three fundamental quantities with precise calculus relationships: Angular Position (θ): Measured in radians; Defines orientation relative to reference; Can be positive or negative; Related to revolutions: 1 rev = 2π rad. Angular Velocity (ω): ω = dθ/dt (instantaneous angular velocity); Average angular velocity: ω_avg = Δθ/Δt; Vector direction given by right-hand rule; Units: rad/s. Angular Acceleration (α): α = dω/dt = d²θ/dt² (instantaneous angular acceleration); Average angular acceleration: α_avg = Δω/Δt; Units: rad/s². Calculus Relationships: Differentiation chain: θ → ω → α; Integration chain: α → ω → θ; For constant α: ω = ω₀ + αt, θ = θ₀ + ω₀t + ½αt², ω² = ω₀² + 2αΔθ. Variable Acceleration: General case: ω(t) = ∫α(t)dt + ω₀; θ(t) = ∫ω(t)dt + θ₀; Requires solving differential equations. Rotational-Linear Relationships: s = rθ (arc length); v = rω (tangential velocity); a_t = rα (tangential acceleration); a_r = rω² = v²/r (centripetal acceleration). Problem-Solving Framework: 1. Identify known quantities and target variable; 2. Choose appropriate kinematic equations; 3. Apply calculus operations as needed; 4. Solve for unknown; 5. Verify units and reasonableness.",
          "application": "Apply calculus relationships to rotational motion problems. Differentiate angular position to find velocity and acceleration. Integrate angular acceleration to find velocity and position. Solve problems with variable angular acceleration. Relate rotational and linear motion quantities. Develop mathematical models for rotational systems.",
          "example": "Engine crankshaft rotation analysis. CD/DVD drive spin-up characteristics. Ferris wheel motion profiling. Wind turbine blade kinematics. Gyroscope precession analysis. Planetary orbital motion approximations.",
          "analogy": "Rotational kinematics with calculus is like tracking a car's journey with GPS data - the position (angular position) tells you where you are, the speedometer reading (angular velocity) tells you how fast you're changing position, and the acceleration (angular acceleration) tells you how quickly your speed is changing, with calculus providing the precise mathematical relationships between these measurements over time",
          "image": {
            "url": "images/angular-quantities-principles.png",
            "alt": "Angular quantities principles",
            "caption": "Principles of angular quantities and calculus relationships"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Variable Angular Acceleration Problem",
          "problem": "A wheel starts from rest with angular acceleration α(t) = 2t - 0.5 rad/s² for 0 ≤ t ≤ 4s. Find the angular velocity and angular position at t = 4s.",
          "step_by_step": [
            {
              "step": "Identify initial conditions",
              "explanation": "ω₀ = 0 rad/s (starts from rest); θ₀ = 0 rad (assume initial position zero)"
            },
            {
              "step": "Find angular velocity by integration",
              "explanation": "ω(t) = ∫α(t)dt + ω₀ = ∫(2t - 0.5)dt = t² - 0.5t + C; Since ω(0) = 0, C = 0; So ω(t) = t² - 0.5t rad/s"
            },
            {
              "step": "Evaluate angular velocity at t = 4s",
              "explanation": "ω(4) = (4)² - 0.5(4) = 16 - 2 = 14 rad/s"
            },
            {
              "step": "Find angular position by integration",
              "explanation": "θ(t) = ∫ω(t)dt + θ₀ = ∫(t² - 0.5t)dt = (t³/3) - (0.5t²/2) = t³/3 - t²/4 rad"
            },
            {
              "step": "Evaluate angular position at t = 4s",
              "explanation": "θ(4) = (4³/3) - (4²/4) = 64/3 - 16/4 = 21.33 - 4 = 17.33 rad"
            },
            {
              "step": "Convert to revolutions if desired",
              "explanation": "Revolutions = θ/(2π) = 17.33/(2π) = 2.76 revolutions"
            },
            {
              "step": "Physical interpretation",
              "explanation": "The wheel accelerates non-uniformly, reaching 14 rad/s (about 2.23 rev/s) after 4 seconds"
            }
          ],
          "final_answer": "At t = 4s: ω = 14 rad/s, θ = 17.33 rad (2.76 revolutions)",
          "concept_applied": "Variable angular acceleration with integration",
          "image": {
            "url": "images/variable-acceleration-example.png",
            "alt": "Variable acceleration example",
            "caption": "Analysis of rotational motion with variable angular acceleration"
          }
        },
        {
          "title": "Rotational-Linear Relationship Application",
          "problem": "A car accelerates from rest with constant linear acceleration of 2 m/s². The tires have radius 0.3m. Find the angular acceleration of the tires and the number of revolutions after 8 seconds.",
          "step_by_step": [
            {
              "step": "Relate linear and angular acceleration",
              "explanation": "a_t = rα, where a_t is tangential acceleration; For rolling without slipping, a_t = a_car = 2 m/s²"
            },
            {
              "step": "Calculate angular acceleration",
              "explanation": "α = a_t/r = 2/0.3 = 6.67 rad/s²"
            },
            {
              "step": "Find angular position using constant acceleration equations",
              "explanation": "θ = θ₀ + ω₀t + ½αt² = 0 + 0 + ½(6.67)(8)²"
            },
            {
              "step": "Calculate angular displacement",
              "explanation": "θ = 0.5 × 6.67 × 64 = 3.335 × 64 = 213.44 rad"
            },
            {
              "step": "Convert to revolutions",
              "explanation": "Revolutions = θ/(2π) = 213.44/(2π) = 213.44/6.283 = 33.97 revolutions"
            },
            {
              "step": "Verify with linear motion",
              "explanation": "Linear distance: s = ½at² = 0.5×2×64 = 64m; Arc length: s = rθ = 0.3×213.44 = 64.03m (matches)"
            },
            {
              "step": "Physical significance",
              "explanation": "The tires rotate nearly 34 times while the car accelerates to v = at = 2×8 = 16 m/s"
            }
          ],
          "final_answer": "Angular acceleration: 6.67 rad/s²; Number of revolutions: 34 revolutions after 8 seconds",
          "concept_applied": "Rotational-linear relationships and constant acceleration",
          "image": {
            "url": "images/rotational-linear-example.png",
            "alt": "Rotational-linear example",
            "caption": "Application of rotational-linear relationships"
          }
        }
      ]
    },
    {
      "section_title": "2. Complex Rotational Motion Analysis",
      "introduction": "Analysis of sophisticated rotational scenarios involving non-constant acceleration, piecewise functions, and systems with multiple rotational components, requiring advanced calculus techniques and problem-solving strategies.",

      "key_concept": {
        "definition": "Non-Constant Acceleration, Piecewise Functions, Multiple Rotational Components, Differential Equations, Numerical Methods, System Analysis",
        "context": "Real-world rotational systems often involve variable acceleration, complex acceleration profiles, and interconnected rotational components, requiring advanced mathematical approaches for complete analysis.",
        "image": {
          "url": "images/complex-rotation-concepts.png",
          "alt": "Complex rotation concepts",
          "caption": "Analysis of complex rotational motion scenarios"
        }
      },

      "classifications": [
        {
          "type": "Complex Rotational Scenarios",
          "value": "Classification based on rotational motion complexity and solution methods",
          "characteristics": [
            "Non-constant angular acceleration",
            "Piecewise-defined motion segments",
            "Coupled rotational systems",
            "Oscillatory rotational motion",
            "Rotational motion with constraints",
            "Systems with variable inertia",
            "Transient rotational behavior",
            "Multi-stage rotational processes"
          ],
          "behavior": "Different complex scenarios require specific mathematical approaches. Non-constant acceleration needs integration, piecewise functions require segment analysis, and coupled systems need simultaneous equations.",
          "examples": [
            {
              "process": "Differential Equation Solutions",
              "explanation": "Solving rotational motion described by differential equations",
              "image": {
                "url": "images/rotational-differential-equations.png",
                "alt": "Rotational differential equations",
                "caption": "Solving rotational motion using differential equations"
              }
            },
            {
              "process": "Piecewise Function Analysis",
              "explanation": "Analyzing rotational motion with different equations in different time intervals",
              "image": {
                "url": "images/piecewise-rotation.png",
                "alt": "Piecewise rotation",
                "caption": "Analysis of piecewise rotational motion"
              }
            }
          ],
          "note": "Key insight: Complex rotational motion often requires breaking problems into manageable segments or using numerical methods"
        }
      ],

      "principles": [
        {
          "principle": "Complex Rotational Motion Analysis",
          "statement": "Complex rotational scenarios require advanced analytical approaches: Non-Constant Acceleration: General case: α(t) given as function of time; Solution: ω(t) = ω₀ + ∫α(t)dt, θ(t) = θ₀ + ∫ω(t)dt; Common cases: α(t) = kt (linear), α(t) = k/ω (inverse), α(θ) (position-dependent). Piecewise Functions: Motion described by different equations in different intervals; Approach: Solve each segment sequentially; Use final state of each segment as initial conditions for next; Ensure continuity at boundaries. Coupled Systems: Multiple rotating components connected; Constraint equations relate angular velocities; Gear systems: ω₁r₁ = ω₂r₂; Belt systems: v = r₁ω₁ = r₂ω₂; Conservation principles may apply. Differential Equations: Second-order: d²θ/dt² = f(t, θ, dθ/dt); Common forms: Constant coefficient, variable coefficient, non-linear; Solution methods: Separation of variables, characteristic equation, numerical integration. Numerical Methods: Euler method: ω_{i+1} = ω_i + α_iΔt, θ_{i+1} = θ_i + ω_iΔt; Runge-Kutta methods for higher accuracy; Useful when analytical solutions are intractable. System Analysis: Identify all rotating components; Write kinematic relationships; Apply constraints; Solve system of equations; Verify with energy or momentum methods. Applications: Electric motor startup transients; Vehicle transmission systems; Industrial rotating machinery; Robotics joint motion; Aerospace control systems.",
          "application": "Analyze rotational motion with non-constant acceleration. Solve piecewise rotational motion problems. Analyze coupled rotational systems. Solve rotational differential equations. Apply numerical methods to complex rotation. Design and analyze multi-component rotational systems.",
          "example": "Engine acceleration during gear shifts. Hard disk drive spin-up characteristics. Wind turbine response to gusting winds. Robotics arm trajectory planning. Amusement ride acceleration profiles. Satellite attitude control systems.",
          "analogy": "Complex rotational analysis is like conducting an orchestra - each instrument (rotational component) has its own part (motion equation), but they must play together harmoniously (satisfy constraints), with the conductor (problem solver) ensuring proper timing and coordination between sections, sometimes requiring rehearsal (numerical iteration) to get the performance right, and dealing with unexpected changes (variable conditions) while maintaining the overall musical structure (conservation principles)",
          "image": {
            "url": "images/complex-rotation-principles.png",
            "alt": "Complex rotation principles",
            "caption": "Principles of complex rotational motion analysis"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Piecewise Rotational Acceleration",
          "problem": "A motor accelerates a flywheel as follows: 0-2s: α = 4 rad/s², 2-5s: α = 0, 5-8s: α = -2 rad/s². If the flywheel starts from rest, find the total angular displacement after 8 seconds.",
          "step_by_step": [
            {
              "step": "Segment 1: 0-2s, α = 4 rad/s²",
              "explanation": "ω₁ = ω₀ + αt = 0 + 4×2 = 8 rad/s; θ₁ = θ₀ + ω₀t + ½αt² = 0 + 0 + ½(4)(2)² = 8 rad"
            },
            {
              "step": "Segment 2: 2-5s, α = 0",
              "explanation": "ω₂ = ω₁ = 8 rad/s (constant); θ₂ = θ₁ + ω₁Δt = 8 + 8×3 = 8 + 24 = 32 rad"
            },
            {
              "step": "Segment 3: 5-8s, α = -2 rad/s²",
              "explanation": "ω₃ = ω₂ + αt = 8 + (-2)×3 = 8 - 6 = 2 rad/s; θ₃ = θ₂ + ω₂t + ½αt² = 32 + 8×3 + ½(-2)(3)² = 32 + 24 - 9 = 47 rad"
            },
            {
              "step": "Total angular displacement",
              "explanation": "θ_total = 47 rad"
            },
            {
              "step": "Convert to revolutions",
              "explanation": "Revolutions = 47/(2π) = 7.48 revolutions"
            },
            {
              "step": "Physical interpretation",
              "explanation": "The flywheel accelerates, coasts at constant speed, then decelerates but doesn't stop completely"
            },
            {
              "step": "Verification",
              "explanation": "Area under ω-t graph should equal displacement; Can verify graphically"
            }
          ],
          "final_answer": "Total angular displacement: 47 radians (7.48 revolutions); Final angular velocity: 2 rad/s",
          "concept_applied": "Piecewise rotational acceleration analysis",
          "image": {
            "url": "images/piecewise-acceleration-example.png",
            "alt": "Piecewise acceleration example",
            "caption": "Analysis of piecewise rotational acceleration"
          }
        },
        {
          "title": "Coupled Gear System Analysis",
          "problem": "Two gears mesh together: Gear A (20 teeth) connected to a motor providing α_A = 3 rad/s², Gear B (60 teeth) initially at rest. Find the angular acceleration of Gear B and the time for Gear B to reach 4 rad/s.",
          "step_by_step": [
            {
              "step": "Gear ratio relationship",
              "explanation": "For meshing gears: N_Aω_A = N_Bω_B, where N is number of teeth; So ω_B = (N_A/N_B)ω_A = (20/60)ω_A = (1/3)ω_A"
            },
            {
              "step": "Angular acceleration relationship",
              "explanation": "Differentiate: α_B = (N_A/N_B)α_A = (1/3)×3 = 1 rad/s²"
            },
            {
              "step": "Time to reach target velocity",
              "explanation": "For Gear B: ω_B = ω_{B0} + α_Bt; 4 = 0 + 1×t; t = 4 seconds"
            },
            {
              "step": "Verify with Gear A motion",
              "explanation": "In 4 seconds, ω_A = ω_{A0} + α_At = 0 + 3×4 = 12 rad/s; ω_B should be (1/3)ω_A = 4 rad/s (matches)"
            },
            {
              "step": "Angular displacements",
              "explanation": "θ_A = ½α_At² = ½×3×16 = 24 rad; θ_B = ½α_Bt² = ½×1×16 = 8 rad; Ratio θ_A/θ_B = 3:1 matches gear ratio"
            },
            {
              "step": "Physical significance",
              "explanation": "The smaller gear rotates faster but with less torque; The system provides speed reduction with torque multiplication"
            }
          ],
          "final_answer": "Angular acceleration of Gear B: 1 rad/s²; Time to reach 4 rad/s: 4 seconds",
          "concept_applied": "Coupled gear system kinematics",
          "image": {
            "url": "images/gear-system-example.png",
            "alt": "Gear system example",
            "caption": "Kinematic analysis of coupled gear systems"
          }
        }
      ]
    },
    {
      "section_title": "3. Advanced Applications and Problem-Solving Strategies",
      "introduction": "Application of rotational kinematics to sophisticated real-world scenarios and development of systematic problem-solving approaches for complex rotational motion problems, including optimization and error analysis.",

      "key_concept": {
        "definition": "Real-World Applications, Systematic Problem-Solving, Optimization Techniques, Error Analysis, Modeling Approaches, Verification Methods",
        "context": "Advanced rotational kinematics involves applying mathematical frameworks to real engineering systems, developing systematic solution strategies, and incorporating practical considerations like optimization and uncertainty.",
        "image": {
          "url": "images/advanced-applications-concepts.png",
          "alt": "Advanced applications concepts",
          "caption": "Advanced applications and problem-solving strategies for rotational kinematics"
        }
      },

      "classifications": [
        {
          "type": "Advanced Rotational Applications",
          "value": "Classification based on application domains and solution sophistication",
          "characteristics": [
            "Engineering system design and analysis",
            "Motion profile optimization",
            "Experimental verification methods",
            "Computational modeling approaches",
            "Uncertainty and error analysis",
            "System performance prediction",
            "Control system applications",
            "Real-time motion planning"
          ],
          "behavior": "Different applications require tailored approaches. Engineering design focuses on performance optimization, experimental verification emphasizes measurement accuracy, and control applications prioritize stability and response time.",
          "examples": [
            {
              "process": "Motion Profile Optimization",
              "explanation": "Designing rotational motion trajectories for optimal performance",
              "image": {
                "url": "images/motion-optimization.png",
                "alt": "Motion optimization",
                "caption": "Optimization of rotational motion profiles"
              }
            },
            {
              "process": "Experimental Kinematics",
              "explanation": "Measuring and verifying rotational motion in laboratory settings",
              "image": {
                "url": "images/experimental-rotation.png",
                "alt": "Experimental rotation",
                "caption": "Experimental measurement of rotational kinematics"
              }
            }
          ],
          "note": "Key principle: Real applications require balancing mathematical idealization with practical constraints and uncertainties"
        }
      ],

      "principles": [
        {
          "principle": "Advanced Applications and Problem-Solving Strategies",
          "statement": "Advanced rotational kinematics extends to sophisticated applications and systematic approaches: Engineering Applications: Electric motor characterization: startup transients, steady-state operation; Vehicle dynamics: wheel rotation, transmission systems; Robotics: joint motion planning, trajectory optimization; Manufacturing: conveyor systems, rotating tools; Aerospace: reaction wheels, control moment gyros. Systematic Problem-Solving: Framework: 1. Problem understanding: identify knowns, unknowns, constraints; 2. System modeling: choose appropriate mathematical framework; 3. Equation formulation: apply kinematic relationships; 4. Solution: analytical or numerical methods; 5. Verification: check units, limits, alternative methods; 6. Interpretation: physical meaning and implications. Optimization Techniques: Minimum time problems: optimize acceleration profiles; Energy efficiency: minimize losses; Vibration reduction: smooth motion profiles; Performance metrics: maximize speed, precision, or throughput. Error Analysis: Measurement uncertainty propagation; Modeling error estimation; Numerical method accuracy; Sensitivity to parameter variations; Statistical analysis of repeated measurements. Computational Methods: Numerical integration for complex α(t); Iterative solutions for implicit equations; Simulation of multi-body systems; Parameter estimation from data; Real-time calculation for control. Verification and Validation: Dimensional analysis checks; Limiting case verification; Experimental correlation; Peer review of methods; Documentation of assumptions and limitations. Professional Practice: Clear communication of results; Uncertainty reporting; Ethical consideration of applications; Continuous improvement through feedback.",
          "application": "Apply rotational kinematics to engineering system design. Develop systematic problem-solving approaches. Optimize rotational motion profiles. Perform error analysis on rotational measurements. Use computational methods for complex problems. Verify solutions through multiple methods.",
          "example": "Industrial robot trajectory planning. Hard drive disk acceleration optimization. Wind turbine control system design. Automotive transmission shift scheduling. Satellite attitude control system design. Amusement ride motion profiling.",
          "analogy": "Advanced rotational kinematics applications are like architectural engineering - you start with fundamental principles (kinematic equations), design a structure (motion profile), optimize for specific criteria (time, energy, smoothness), account for real-world constraints (friction, motor limits), verify through modeling and testing, and ultimately create a functional system that performs reliably under various conditions, with careful documentation and consideration of safety margins",
          "image": {
            "url": "images/advanced-applications-principles.png",
            "alt": "Advanced applications principles",
            "caption": "Principles of advanced applications and problem-solving strategies"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Optimal Acceleration Profile Design",
          "problem": "Design a time-optimal acceleration profile for a rotating machine to go from rest to 1200 rpm in 5 seconds, with the constraint that angular acceleration cannot exceed 10 rad/s². Find the minimum time possible.",
          "step_by_step": [
            {
              "step": "Convert target velocity to rad/s",
              "explanation": "1200 rpm = 1200/60 = 20 rev/s; ω_f = 20 × 2π = 125.66 rad/s"
            },
            {
              "step": "Check minimum time with maximum acceleration",
              "explanation": "t_min = Δω/α_max = 125.66/10 = 12.57 seconds"
            },
            {
              "step": "Compare with required time",
              "explanation": "12.57s > 5s, so impossible with given constraints"
            },
            {
              "step": "Find required acceleration for 5s time",
              "explanation": "α_required = Δω/t = 125.66/5 = 25.13 rad/s²"
            },
            {
              "step": "Design alternative profile",
              "explanation": "Use maximum acceleration (10 rad/s²) for as long as possible, then coast"
            },
            {
              "step": "Time at maximum acceleration",
              "explanation": "t_acc = ω_max/α_max = 125.66/10 = 12.57s (but this exceeds total time)"
            },
            {
              "step": "Revised approach with given time constraint",
              "explanation": "Since 5s < 12.57s, we cannot reach target speed with given acceleration limit"
            },
            {
              "step": "Maximum achievable speed in 5s",
              "explanation": "ω_max_achievable = α_maxt = 10×5 = 50 rad/s = 477.5 rpm"
            },
            {
              "step": "Physical interpretation",
              "explanation": "The acceleration constraint makes the original goal impossible; Either increase acceleration limit or increase time allowed"
            }
          ],
          "final_answer": "Original goal impossible with constraints: requires 25.13 rad/s² acceleration but limited to 10 rad/s²; Maximum achievable: 477.5 rpm in 5 seconds",
          "concept_applied": "Motion profile optimization with constraints",
          "image": {
            "url": "images/optimization-example.png",
            "alt": "Optimization example",
            "caption": "Optimization of rotational motion profiles with constraints"
          }
        },
        {
          "title": "Experimental Error Analysis in Rotational Measurements",
          "problem": "In an experiment measuring angular acceleration, the angular position is measured with uncertainty ±0.01 rad and time with ±0.001s. For measurements at t=2.000s, θ=8.050rad and at t=2.100s, θ=8.855rad, find the angular acceleration and its uncertainty.",
          "step_by_step": [
            {
              "step": "Calculate angular velocities",
              "explanation": "ω₁ = Δθ/Δt around t=2.000s; Use symmetric difference if possible; For this case, use two points"
            },
            {
              "step": "Average angular velocity calculation",
              "explanation": "Δθ = 8.855 - 8.050 = 0.805 rad; Δt = 2.100 - 2.000 = 0.100 s; ω_avg = 0.805/0.100 = 8.05 rad/s"
            },
            {
              "step": "Angular acceleration estimate",
              "explanation": "This gives average ω over interval; Need more points for acceleration; Assume this is instantaneous ω at t=2.05s"
            },
            {
              "step": "Uncertainty in angular velocity",
              "explanation": "δω/ω = √((δθ/θ)² + (δt/t)²) = √((0.01/0.805)² + (0.001/0.100)²) = √(0.000154 + 0.0001) = √0.000254 = 0.0159"
            },
            {
              "step": "Absolute uncertainty in ω",
              "explanation": "δω = 0.0159 × 8.05 = 0.128 rad/s"
            },
            {
              "step": "Need additional measurement for acceleration",
              "explanation": "With only two points, cannot determine acceleration reliably; Need at least three points"
            },
            {
              "step": "General uncertainty propagation",
              "explanation": "For α = Δω/Δt, δα/α = √((δω/ω)² + (δt/t)²); With typical values, uncertainty around 2-5%"
            },
            {
              "step": "Experimental design implications",
              "explanation": "Need careful measurement strategy to minimize uncertainty; Use multiple data points and curve fitting"
            }
          ],
          "final_answer": "With given data: ω ≈ 8.05 ± 0.13 rad/s at t=2.05s; Insufficient data for reliable acceleration calculation; Typical acceleration uncertainty ~2-5% with good experimental design",
          "concept_applied": "Experimental error analysis in rotational measurements",
          "image": {
            "url": "images/error-analysis-example.png",
            "alt": "Error analysis example",
            "caption": "Error analysis for experimental rotational kinematics"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Angular position",
    "Angular velocity",
    "Angular acceleration",
    "Radians",
    "Right-hand rule",
    "Tangential acceleration",
    "Centripetal acceleration",
    "Rotational kinematics",
    "Calculus applications",
    "Variable acceleration",
    "Piecewise functions",
    "Gear ratios",
    "Optimization",
    "Error analysis"
  ],

  "common_misconceptions": [
    "Confusing angular and linear motion equations",
    "Using degrees instead of radians in calculus operations",
    "Misapplying constant acceleration equations to variable acceleration",
    "Confusing tangential and centripetal acceleration",
    "Incorrect sign conventions for rotational direction",
    "Assuming all rotational motion has constant acceleration",
    "Confusing angular velocity and angular acceleration vectors",
    "Misapplying gear ratio relationships"
  ],

  "real_world_applications": [
    "Electric motor design and characterization",
    "Vehicle transmission and drivetrain systems",
    "Robotics joint motion and trajectory planning",
    "Industrial machinery and manufacturing systems",
    "Aerospace attitude control systems",
    "Hard disk drive and optical drive operation",
    "Wind turbine and power generation systems",
    "Amusement ride motion profiling and safety",
    "Sports equipment dynamics (golf clubs, baseball bats)",
    "Medical device rotation systems"
  ],

  "summary": "Rotational kinematics with calculus provides the fundamental mathematical framework for analyzing rotational motion, establishing precise relationships between angular position, velocity, and acceleration through differentiation and integration. This unit develops proficiency with both constant and variable acceleration scenarios, relates rotational and linear motion quantities, and applies these concepts to complex real-world systems. Through systematic problem-solving approaches, optimization techniques, and error analysis, students learn to model and analyze sophisticated rotational scenarios across engineering, technology, and scientific applications. The calculus-based foundation established here serves as essential preparation for subsequent topics in rotational dynamics, energy, and momentum, demonstrating the power of mathematical methods in understanding and predicting rotational behavior in physical systems."
}
