{
  "topic": "Rotation",
  "unit_title": "Rotational Kinetic Energy and Work: Energy in Rotational Motion",
  "unit_number": "Unit 5.5",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Mechanics",
  "duration": "3-4 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "This unit develops the concepts of rotational kinetic energy and work, establishing the energy methods for analyzing rotational motion. Students will learn to calculate rotational kinetic energy, apply the work-energy theorem to rotational systems, and solve complex problems using energy conservation methods that integrate both rotational and translational motion.",

  "learning_objectives": [
    "Define and calculate rotational kinetic energy for various objects",
    "Apply the work-energy theorem to rotational motion",
    "Calculate work done by constant and variable torques",
    "Solve problems using conservation of mechanical energy with rotation",
    "Analyze systems with combined rotational and translational kinetic energy",
    "Apply energy methods to real-world rotational systems"
  ],

  "prerequisites": [
    "Mastery of rotational dynamics (Unit 5.4)",
    "Understanding of work-energy concepts in linear motion",
    "Proficiency with moment of inertia calculations (Units 5.2-5.3)",
    "Familiarity with conservation of energy principles",
    "Ability to set up and solve energy conservation equations"
  ],

  "core_concept": {
    "principle": "Rotational Kinetic Energy, Work in Rotation, Energy Conservation, Work-Energy Theorem, Rolling Energy, Power in Rotation",
    "explanation": "Rotational kinetic energy (½Iω²) serves as the rotational analog of translational kinetic energy (½mv²), with work done by torque (∫τdθ) causing changes in rotational kinetic energy according to the work-energy theorem for rotation.",
    "image": {
      "url": "images/rotational-energy-core.png",
      "alt": "Rotational energy core concept",
      "caption": "Rotational kinetic energy and work-energy relationships"
    }
  },

  "sections": [
    {
      "section_title": "1. Rotational Kinetic Energy and Work-Energy Theorem",
      "introduction": "Development of the concept of rotational kinetic energy as ½Iω² and establishment of the work-energy theorem for rotational motion, relating work done by torque to changes in rotational kinetic energy.",

      "key_concept": {
        "definition": "Rotational Kinetic Energy, Work by Torque, Work-Energy Theorem, Angular Velocity, Moment of Inertia, Energy Transformation",
        "context": "Rotational kinetic energy quantifies the energy associated with rotational motion, while work done by torque transfers energy into or out of the rotational system, following the same fundamental principles as linear motion but adapted for rotation.",
        "image": {
          "url": "images/rotational-energy-concepts.png",
          "alt": "Rotational energy concepts",
          "caption": "Fundamental concepts of rotational kinetic energy and work"
        }
      },

      "classifications": [
        {
          "type": "Rotational Energy Forms",
          "value": "Classification based on energy expressions and work calculations in rotational systems",
          "characteristics": [
            "Pure rotational kinetic energy",
            "Combined rotational-translational energy",
            "Work by constant torque",
            "Work by variable torque",
            "Rotational potential energy storage",
            "Energy dissipation in rotation",
            "Rotational power calculations",
            "Energy conservation applications"
          ],
          "behavior": "Different rotational energy forms follow specific mathematical relationships. Pure rotation involves only ½Iω², combined motion includes both rotational and translational terms, and work calculations depend on whether torque is constant or variable.",
          "examples": [
            {
              "process": "Rotational Kinetic Energy Calculation",
              "explanation": "Calculating rotational kinetic energy for various objects and motion states",
              "image": {
                "url": "images/rotational-ke-calculation.png",
                "alt": "Rotational KE calculation",
                "caption": "Calculation of rotational kinetic energy for different objects"
              }
            },
            {
              "process": "Work by Torque Integration",
              "explanation": "Calculating work done by torque through angular displacement integration",
              "image": {
                "url": "images/torque-work-integration.png",
                "alt": "Torque work integration",
                "caption": "Work calculation through torque integration"
              }
            }
          ],
          "note": "Key formulas: KE_rot = ½Iω², W = ∫τdθ, P = τω"
        }
      ],

      "principles": [
        {
          "principle": "Rotational Kinetic Energy and Work-Energy Theorem",
          "statement": "Rotational energy concepts extend energy methods to rotation: Rotational Kinetic Energy: KE_rot = ½Iω²; Analogous to KE_trans = ½mv²; I is moment of inertia (rotational mass); ω is angular velocity; Units: joules (J). Work by Torque: Work done by constant torque: W = τΔθ (τ constant); Work done by variable torque: W = ∫τdθ; Power: P = dW/dt = τω; Work-energy theorem: W_net = ΔKE_rot = ½Iω_f² - ½Iω_i². Energy Conservation: For conservative systems: KE_rot_i + PE_i = KE_rot_f + PE_f; May include both rotational and translational terms; Useful for solving motion problems without forces. Combined Motion Energy: Total kinetic energy: KE_total = ½mv_cm² + ½Iω²; For rolling without slipping: v_cm = Rω, so KE_total = ½mv² + ½I(v²/R²) = ½(m + I/R²)v². Problem-Solving with Energy: Advantages: Often simpler than force approach; Doesn't require knowing forces explicitly; Handles variable forces naturally; Provides scalar equations. Applications: Rotating flywheel energy storage; Pendulum motion with rotational inertia; Objects rolling down inclines; Rotational collision analysis. Verification Methods: Check energy units (joules); Verify conservation in isolated systems; Compare with force method results; Check physical reasonableness.",
          "application": "Calculate rotational kinetic energy for various systems. Determine work done by constant and variable torques. Apply work-energy theorem to rotational motion. Use energy conservation in rotational systems. Analyze combined rotational-translational motion energetically. Solve complex problems using energy methods.",
          "example": "Flywheel energy storage systems. Pendulum and balance wheel mechanisms. Objects rolling down ramps. Vehicle wheel dynamics. Sports equipment rotation energy. Industrial rotating machinery.",
          "analogy": "Rotational energy concepts parallel linear energy concepts - rotational kinetic energy (½Iω²) is like the energy of a spinning top, work by torque (∫τdθ) is like winding up a spring-driven mechanism, and the work-energy theorem ensures that the work you put in through turning equals the energy gained by rotation, just as pushing an object linearly gives it translational kinetic energy",
          "image": {
            "url": "images/rotational-energy-principles.png",
            "alt": "Rotational energy principles",
            "caption": "Principles of rotational kinetic energy and work-energy theorem"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Flywheel Energy Storage Calculation",
          "problem": "A flywheel (I=50 kg·m²) accelerates from rest to 1200 rpm under a constant torque of 100 N·m. Calculate the work done and the final rotational kinetic energy.",
          "step_by_step": [
            {
              "step": "Convert final angular velocity to rad/s",
              "explanation": "1200 rpm = 1200/60 = 20 rev/s; ω_f = 20 × 2π = 125.66 rad/s"
            },
            {
              "step": "Calculate final rotational kinetic energy",
              "explanation": "KE_rot = ½Iω² = ½(50)(125.66)² = 25 × 15790.4 = 394,760 J"
            },
            {
              "step": "Verify using work-energy theorem",
              "explanation": "W_net = ΔKE_rot = 394,760 - 0 = 394,760 J"
            },
            {
              "step": "Calculate angular displacement using kinematics",
              "explanation": "Need time or acceleration to find Δθ; Use τ = Iα → α = τ/I = 100/50 = 2 rad/s²"
            },
            {
              "step": "Find time to reach final speed",
              "explanation": "ω_f = ω_i + αt → 125.66 = 0 + 2t → t = 62.83 s"
            },
            {
              "step": "Calculate angular displacement",
              "explanation": "Δθ = ω_i t + ½αt² = 0 + ½(2)(62.83)² = 3948 rad"
            },
            {
              "step": "Calculate work using torque",
              "explanation": "W = τΔθ = 100 × 3948 = 394,800 J (matches within rounding)"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Flywheel stores about 395 kJ of energy, equivalent to lifting 4000 kg 10 meters"
            }
          ],
          "final_answer": "Work done = 395,000 J; Final rotational KE = 395,000 J",
          "concept_applied": "Rotational work-energy theorem application",
          "image": {
            "url": "images/flywheel-energy-example.png",
            "alt": "Flywheel energy example",
            "caption": "Energy calculation for flywheel storage system"
          }
        },
        {
          "title": "Variable Torque Work Calculation",
          "problem": "A torque τ(θ) = 20 + 5θ N·m (θ in radians) acts on a wheel from θ=0 to θ=4 rad. If the wheel has I=2 kg·m² and starts from rest, find the work done and final angular velocity.",
          "step_by_step": [
            {
              "step": "Calculate work using integration",
              "explanation": "W = ∫τdθ = ∫₀⁴ (20 + 5θ)dθ"
            },
            {
              "step": "Evaluate the integral",
              "explanation": "W = [20θ + (5θ²)/2]₀⁴ = [20×4 + (5×16)/2] - 0 = 80 + 40 = 120 J"
            },
            {
              "step": "Apply work-energy theorem",
              "explanation": "W = ΔKE_rot = ½Iω_f² - ½Iω_i² = ½(2)ω_f² - 0 = ω_f²"
            },
            {
              "step": "Solve for final angular velocity",
              "explanation": "ω_f² = 120 → ω_f = √120 = 10.95 rad/s"
            },
            {
              "step": "Convert to rpm if desired",
              "explanation": "ω_f = 10.95 rad/s = 10.95/(2π) rev/s = 1.74 rev/s = 104.5 rpm"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Increasing torque with angle means more work done per radian as rotation progresses"
            },
            {
              "step": "Average torque calculation",
              "explanation": "τ_avg = W/Δθ = 120/4 = 30 N·m; Between initial 20 N·m and final 40 N·m"
            }
          ],
          "final_answer": "Work done = 120 J; Final angular velocity = 10.95 rad/s (104.5 rpm)",
          "concept_applied": "Work by variable torque and energy methods",
          "image": {
            "url": "images/variable-torque-work-example.png",
            "alt": "Variable torque work example",
            "caption": "Work calculation for variable torque system"
          }
        }
      ]
    },
    {
      "section_title": "2. Energy Conservation in Rotational Systems",
      "introduction": "Application of conservation of mechanical energy principles to rotational systems, including analysis of objects rolling without slipping, rotational pendulums, and systems with both rotational and translational energy components.",

      "key_concept": {
        "definition": "Energy Conservation, Rolling Motion, Gravitational Potential Energy, Rotational Potential Energy, Conservative Systems, Energy Transformation",
        "context": "Conservation of mechanical energy provides powerful methods for analyzing rotational systems, particularly for conservative systems where energy transforms between rotational kinetic energy, translational kinetic energy, and potential energy forms.",
        "image": {
          "url": "images/energy-conservation-concepts.png",
          "alt": "Energy conservation concepts",
          "caption": "Energy conservation principles in rotational systems"
        }
      },

      "classifications": [
        {
          "type": "Rotational Energy Conservation Scenarios",
          "value": "Classification based on system types and energy transformation pathways",
          "characteristics": [
            "Pure rotational systems",
            "Rolling without slipping scenarios",
            "Rotational pendulum systems",
            "Combined translation-rotation systems",
            "Multi-object rotational systems",
            "Systems with elastic potential energy",
            "Rotational systems with friction",
            "Energy dissipation scenarios"
          ],
          "behavior": "Different conservation scenarios exhibit characteristic energy transformations. Rolling objects convert gravitational potential to both translational and rotational kinetic energy, pendulums exchange potential and rotational kinetic energy, and multi-object systems may involve complex energy distributions.",
          "examples": [
            {
              "process": "Rolling Object Energy Analysis",
              "explanation": "Analyzing energy conservation for objects rolling without slipping",
              "image": {
                "url": "images/rolling-energy-analysis.png",
                "alt": "Rolling energy analysis",
                "caption": "Energy analysis for rolling objects"
              }
            },
            {
              "process": "Rotational Pendulum Energy",
              "explanation": "Applying energy conservation to rotational pendulum systems",
              "image": {
                "url": "images/rotational-pendulum-energy.png",
                "alt": "Rotational pendulum energy",
                "caption": "Energy conservation in rotational pendulum systems"
              }
            }
          ],
          "note": "Key principle: For conservative systems, KE_rot + KE_trans + PE = constant"
        }
      ],

      "principles": [
        {
          "principle": "Energy Conservation in Rotational Systems",
          "statement": "Energy conservation provides powerful analytical tools for rotational systems: Conservation Principle: For conservative systems: E_total = KE_trans + KE_rot + PE = constant; KE_trans = ½mv_cm²; KE_rot = ½Iω²; PE typically gravitational or elastic. Rolling Without Slipping: Special case with constraint: v_cm = Rω; Total KE = ½mv² + ½Iω² = ½mv² + ½I(v²/R²) = ½(m + I/R²)v²; Effective mass concept: m_eff = m + I/R². Common Scenarios: Object rolling down incline: mgh = ½mv² + ½Iω² = ½(m + I/R²)v²; Rotational pendulum: mgh = ½Iω² (for pure rotation); Spring-mass with rotation: ½kx² + ½Iω² = constant. Problem-Solving Strategy: 1. Identify all energy forms present; 2. Write initial total energy; 3. Write final total energy; 4. Apply conservation: E_i = E_f; 5. Include constraint equations if needed; 6. Solve for unknown quantities. Advantages of Energy Methods: Often simpler than force approach; Don't need to know forces or time; Naturally handles variable acceleration; Provides scalar equations. Limitations: Only works for conservative systems; Doesn't give time information directly; May need additional constraints. Applications: Rolling race problems; Pendulum motion analysis; Rotational collision problems; Energy storage systems; Mechanical advantage systems.",
          "application": "Apply energy conservation to rolling objects. Analyze rotational pendulum systems. Solve incline problems using energy methods. Handle combined translational-rotational motion. Use energy methods for complex systems. Verify results with alternative approaches.",
          "example": "Objects rolling down ramps (which wins the race?). Physical pendulum motion analysis. Yo-yo and spool dynamics. Vehicle braking energy distribution. Sports equipment energy analysis. Mechanical energy storage systems.",
          "analogy": "Energy conservation in rotational systems is like managing a budget with different currency types - you can exchange between cash (translational KE), foreign currency (rotational KE), and savings (potential energy), but the total value remains constant in a closed system, with the exchange rates determined by the object's properties and constraints",
          "image": {
            "url": "images/energy-conservation-principles.png",
            "alt": "Energy conservation principles",
            "caption": "Principles of energy conservation in rotational systems"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Sphere Rolling Down Incline (Energy Method)",
          "problem": "A solid sphere (mass M, radius R) rolls without slipping down an incline of height h. Find the speed at the bottom using energy conservation.",
          "step_by_step": [
            {
              "step": "Identify energy forms",
              "explanation": "Initial: gravitational PE = Mgh; Final: translational KE + rotational KE"
            },
            {
              "step": "Write energy conservation equation",
              "explanation": "Mgh = ½Mv² + ½Iω²"
            },
            {
              "step": "Moment of inertia for solid sphere",
              "explanation": "I = ⅖MR²"
            },
            {
              "step": "Rolling without slipping condition",
              "explanation": "ω = v/R"
            },
            {
              "step": "Substitute into energy equation",
              "explanation": "Mgh = ½Mv² + ½(⅖MR²)(v²/R²) = ½Mv² + (⅕)Mv²"
            },
            {
              "step": "Simplify equation",
              "explanation": "Mgh = (½ + ⅕)Mv² = (5/10 + 2/10)Mv² = (7/10)Mv²"
            },
            {
              "step": "Solve for velocity",
              "explanation": "v² = (10/7)gh → v = √(10gh/7)"
            },
            {
              "step": "Compare with sliding object",
              "explanation": "Sliding object: v = √(2gh); Sphere slower due to rotational inertia"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Only 5/7 of energy goes to translation; 2/7 goes to rotation"
            }
          ],
          "final_answer": "Speed at bottom: v = √(10gh/7)",
          "concept_applied": "Energy conservation for rolling without slipping",
          "image": {
            "url": "images/rolling-sphere-energy-example.png",
            "alt": "Rolling sphere energy example",
            "caption": "Energy conservation analysis for sphere rolling down incline"
          }
        },
        {
          "title": "Physical Pendulum Energy Analysis",
          "problem": "A thin rod (mass M, length L) pivoted at one end is displaced 30° from vertical and released. Find the angular speed at the lowest point using energy conservation.",
          "step_by_step": [
            {
              "step": "Identify energy forms",
              "explanation": "Initial: gravitational PE; Final: rotational KE"
            },
            {
              "step": "Calculate initial height of CM",
              "explanation": "CM at L/2 from pivot; Initial height: h_i = (L/2)cos30° = (L/2)(√3/2) = L√3/4"
            },
            {
              "step": "Final height of CM",
              "explanation": "h_f = L/2 (lowest position)"
            },
            {
              "step": "Change in gravitational PE",
              "explanation": "ΔPE = Mg(h_f - h_i) = Mg[L/2 - L√3/4] = MgL(2 - √3)/4"
            },
            {
              "step": "Moment of inertia about end",
              "explanation": "I = ML²/3"
            },
            {
              "step": "Energy conservation equation",
              "explanation": "ΔPE = ΔKE_rot → MgL(2 - √3)/4 = ½Iω² - 0"
            },
            {
              "step": "Substitute I and solve for ω",
              "explanation": "MgL(2 - √3)/4 = ½(ML²/3)ω²"
            },
            {
              "step": "Simplify and solve",
              "explanation": "g(2 - √3)/4 = (L/6)ω² → ω² = (6g/4L)(2 - √3) = (3g/2L)(2 - √3)"
            },
            {
              "step": "Numerical evaluation",
              "explanation": "2 - √3 ≈ 2 - 1.732 = 0.268; ω ≈ √[(3×9.8)/(2L) × 0.268] ≈ √(3.94/L) rad/s"
            },
            {
              "step": "Physical interpretation",
              "explanation": "For L=1m, ω≈1.98 rad/s; Energy method avoids solving differential equation"
            }
          ],
          "final_answer": "Angular speed at bottom: ω = √[(3g/2L)(2 - √3)]",
          "concept_applied": "Energy conservation in physical pendulum",
          "image": {
            "url": "images/physical-pendulum-energy-example.png",
            "alt": "Physical pendulum energy example",
            "caption": "Energy analysis for physical pendulum system"
          }
        }
      ]
    },
    {
      "section_title": "3. Advanced Applications and Power in Rotation",
      "introduction": "Advanced applications of rotational energy concepts including power calculations, rotational collisions, systems with energy dissipation, and complex multi-object systems, with development of systematic problem-solving strategies.",

      "key_concept": {
        "definition": "Rotational Power, Energy Dissipation, Rotational Collisions, Multi-object Systems, Complex Constraints, Systematic Problem-Solving",
        "context": "Advanced rotational energy analysis involves power calculations, handling non-conservative systems with energy dissipation, analyzing rotational collisions, and solving complex multi-object systems that require sophisticated energy methods.",
        "image": {
          "url": "images/advanced-applications-concepts.png",
          "alt": "Advanced applications concepts",
          "caption": "Advanced applications of rotational energy concepts"
        }
      },

      "classifications": [
        {
          "type": "Advanced Rotational Energy Scenarios",
          "value": "Classification based on complexity and specialized solution methods",
          "characteristics": [
            "Rotational power and efficiency",
            "Energy dissipation in rotating systems",
            "Rotational collision analysis",
            "Multi-object rotational systems",
            "Systems with non-conservative forces",
            "Variable inertia systems",
            "Rotational energy transfer",
            "Complex constraint systems"
          ],
          "behavior": "Different advanced scenarios require specialized energy approaches. Power analysis involves time rates, dissipative systems use work-energy theorem with non-conservative work, rotational collisions may conserve or not conserve energy, and multi-object systems require careful energy accounting.",
          "examples": [
            {
              "process": "Rotational Power Analysis",
              "explanation": "Analyzing power requirements and efficiency in rotational systems",
              "image": {
                "url": "images/rotational-power-analysis.png",
                "alt": "Rotational power analysis",
                "caption": "Power analysis in rotational systems"
              }
            },
            {
              "process": "Rotational Collision Energy",
              "explanation": "Applying energy methods to analyze rotational collisions",
              "image": {
                "url": "images/rotational-collision-energy.png",
                "alt": "Rotational collision energy",
                "caption": "Energy analysis in rotational collisions"
              }
            }
          ],
          "note": "Key formulas: P = τω, W_nc = ΔE for non-conservative systems"
        }
      ],

      "principles": [
        {
          "principle": "Advanced Applications and Power in Rotation",
          "statement": "Advanced rotational energy concepts extend to complex scenarios: Rotational Power: Instantaneous power: P = dW/dt = τω; Average power: P_avg = W/Δt = τ_avgω_avg; Units: watts (W); Efficiency: η = P_out/P_in. Energy Dissipation: Work-energy theorem with friction: W_nc = ΔE = ΔKE + ΔPE; Friction work usually negative (energy loss); Rolling with slipping dissipates energy. Rotational Collisions: May be elastic (KE conserved) or inelastic (KE not conserved); Angular momentum often conserved; Coefficient of restitution for rotational collisions. Multi-object Systems: Total energy = Σ(½m_iv_i² + ½I_iω_i²) + PE; May include constraint equations; Often solved with conservation laws. Variable Inertia Systems: Objects with changing I (figure skater pulling arms in); Conservation of angular momentum; KE changes as I changes; Work may be done internally. Complex Constraints: Systems with multiple connected objects; Gear systems with energy transfer; Belt and pulley systems; Requires careful kinematic relationships. Problem-Solving Strategy: 1. Identify all energy forms and transfers; 2. Apply appropriate conservation laws; 3. Include constraint equations; 4. Account for non-conservative work if present; 5. Solve system of equations; 6. Verify with alternative methods. Applications: Motor and generator efficiency; Vehicle drivetrain energy loss; Sports equipment energy transfer; Mechanical advantage systems; Energy storage flywheels.",
          "application": "Calculate power in rotational systems. Analyze energy dissipation in rotating systems. Solve rotational collision problems. Handle multi-object rotational systems. Analyze variable inertia systems. Apply systematic problem-solving to complex scenarios.",
          "example": "Electric motor power requirements. Vehicle braking energy dissipation. Figure skater spin acceleration. Gear train efficiency analysis. Collision analysis for rotating objects. Compound pendulum systems.",
          "analogy": "Advanced rotational energy analysis is like managing a complex energy ecosystem - you track energy flows between different 'species' (rotational KE, translational KE, PE), account for 'predation' (energy dissipation), handle 'migration' (energy transfer between objects), and monitor the 'metabolism' (power requirements), all while maintaining the overall energy balance according to conservation principles",
          "image": {
            "url": "images/advanced-applications-principles.png",
            "alt": "Advanced applications principles",
            "caption": "Principles of advanced rotational energy applications"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Motor Power and Efficiency Calculation",
          "problem": "An electric motor delivers a constant torque of 50 N·m to accelerate a flywheel from rest to 1800 rpm in 10 seconds. If the motor draws 12 kW of electrical power, calculate the flywheel's moment of inertia and the motor's efficiency.",
          "step_by_step": [
            {
              "step": "Convert final angular velocity",
              "explanation": "1800 rpm = 1800/60 = 30 rev/s; ω_f = 30 × 2π = 188.5 rad/s"
            },
            {
              "step": "Find work done by motor",
              "explanation": "Need angular acceleration: α = Δω/Δt = 188.5/10 = 18.85 rad/s²"
            },
            {
              "step": "Find moment of inertia",
              "explanation": "τ = Iα → 50 = I × 18.85 → I = 50/18.85 = 2.65 kg·m²"
            },
            {
              "step": "Calculate work done on flywheel",
              "explanation": "W = ΔKE_rot = ½Iω_f² = ½(2.65)(188.5)² = 1.325 × 35532 = 47,100 J"
            },
            {
              "step": "Calculate mechanical power output",
              "explanation": "P_mech = W/Δt = 47,100/10 = 4,710 W = 4.71 kW"
            },
            {
              "step": "Calculate efficiency",
              "explanation": "η = P_out/P_in = 4.71/12 = 0.3925 = 39.25%"
            },
            {
              "step": "Alternative using average power",
              "explanation": "P_mech = τω_avg = 50 × (188.5/2) = 50 × 94.25 = 4,712 W (matches)"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Motor is 39% efficient; Significant energy loss to heat, sound, etc."
            }
          ],
          "final_answer": "Moment of inertia: 2.65 kg·m²; Motor efficiency: 39.3%",
          "concept_applied": "Rotational power and efficiency calculations",
          "image": {
            "url": "images/motor-efficiency-example.png",
            "alt": "Motor efficiency example",
            "caption": "Power and efficiency analysis for motor-flywheel system"
          }
        },
        {
          "title": "Rotational Collision with Energy Loss",
          "problem": "A disk (I=0.5 kg·m², ω_i=20 rad/s) collides with an identical stationary disk. If they stick together, find the final angular velocity and energy loss.",
          "step_by_step": [
            {
              "step": "Apply angular momentum conservation",
              "explanation": "L_initial = L_final; Iω_i + 0 = (I + I)ω_f = 2Iω_f"
            },
            {
              "step": "Solve for final angular velocity",
              "explanation": "ω_f = ω_i/2 = 20/2 = 10 rad/s"
            },
            {
              "step": "Calculate initial kinetic energy",
              "explanation": "KE_i = ½Iω_i² = ½(0.5)(20)² = 0.25 × 400 = 100 J"
            },
            {
              "step": "Calculate final kinetic energy",
              "explanation": "KE_f = ½(2I)ω_f² = ½(1.0)(10)² = 0.5 × 100 = 50 J"
            },
            {
              "step": "Calculate energy loss",
              "explanation": "ΔKE = KE_f - KE_i = 50 - 100 = -50 J"
            },
            {
              "step": "Fraction of energy lost",
              "explanation": "Fraction = |ΔKE|/KE_i = 50/100 = 0.5 = 50%"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Perfectly inelastic rotational collision; Half of initial energy dissipated"
            },
            {
              "step": "Compare with linear collision",
              "explanation": "Similar to 1D perfectly inelastic collision where two equal masses stick together"
            }
          ],
          "final_answer": "Final angular velocity: 10 rad/s; Energy loss: 50 J (50% of initial energy)",
          "concept_applied": "Rotational collision with energy dissipation",
          "image": {
            "url": "images/rotational-collision-example.png",
            "alt": "Rotational collision example",
            "caption": "Energy analysis in rotational collision"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Rotational kinetic energy",
    "Work by torque",
    "Work-energy theorem",
    "Power in rotation",
    "Energy conservation",
    "Rolling without slipping",
    "Rotational collisions",
    "Energy dissipation",
    "Moment of inertia",
    "Angular velocity",
    "Torque",
    "Efficiency",
    "Conservative systems",
    "Non-conservative work"
  ],

  "common_misconceptions": [
    "Thinking rotational kinetic energy depends only on angular velocity",
    "Confusing work by torque with work by force",
    "Misapplying energy conservation to non-conservative systems",
    "Forgetting the vector nature of angular quantities in energy calculations",
    "Confusing different reference frames for energy calculations",
    "Thinking all rolling objects have the same speed down inclines",
    "Misunderstanding energy distribution in combined motion",
    "Confusing power calculations in rotational vs linear systems"
  ],

  "real_world_applications": [
    "Flywheel energy storage systems",
    "Vehicle drivetrain and braking systems",
    "Electric motor and generator efficiency",
    "Sports equipment dynamics and performance",
    "Industrial rotating machinery energy analysis",
    "Pendulum clocks and timing mechanisms",
    "Wind turbine energy conversion",
    "Exercise equipment resistance systems",
    "Aerospace attitude control systems",
    "Manufacturing process energy optimization"
  ],

  "summary": "Rotational kinetic energy and work concepts provide powerful energy-based methods for analyzing rotational motion, with ½Iω² representing the rotational analog of translational kinetic energy and work done by torque (∫τdθ) causing changes in rotational energy. Energy conservation methods enable elegant solutions to complex rotational problems, particularly for systems involving rolling motion, pendulums, and combined rotational-translational dynamics. Advanced applications extend to power calculations, energy dissipation analysis, rotational collisions, and complex multi-object systems, demonstrating the universal applicability of energy methods across rotational scenarios. These energy-based approaches complement force-based rotational dynamics, often providing simpler solutions and deeper physical insight into rotational behavior across engineering, physics, and technology applications."
}
