{
  "expanded_description": "This section focuses on how scientific data is collected, organized, analyzed, and interpreted to draw meaningful conclusions in physics investigations. Good data analysis transforms raw measurements into insights about how the physical world works.",
  "core_concept": {
    "principle": "Data analysis involves collecting accurate measurements, organizing them systematically, and interpreting patterns to identify relationships and draw evidence-based conclusions.",
    "explanation": "In physics, data analysis helps transform raw measurements into meaningful information that supports or rejects a hypothesis. It's the bridge between conducting experiments and understanding what the results mean.",
    "image": {
      "src": "images/unit1/data_analysis_process.png",
      "alt": "Flowchart showing the data analysis process from collection to interpretation",
      "caption": "Data analysis transforms raw measurements into scientific understanding"
    }
  },
  "sections": [
    {
      "section_title": "What is Scientific Data?",
      "introduction": "Every scientific investigation produces information known as data. Data provides the evidence that supports scientific conclusions and allows us to answer research questions objectively.",
      "key_concept": {
        "definition": "Scientific data refers to observations and measurements collected during experiments or investigations. It is the factual information upon which scientific conclusions are based.",
        "context": "In physics, data often includes measurements such as distance, time, mass, temperature, force, velocity, acceleration, and electric current. Data can be numbers, descriptions, or both."
      },
      "classifications": [
        {
          "type": "Qualitative Data",
          "value": "Descriptive data based on observations using the senses",
          "characteristics": [
            "Non-numerical",
            "Descriptive",
            "Based on qualities or properties",
            "Cannot be graphed numerically"
          ],
          "behavior": "Describes qualities, characteristics, or properties without using numbers.",
          "examples": [
            {
              "process": "Observation of motion",
              "explanation": "Describing motion as 'fast,' 'slow,' 'smooth,' or 'jerky.' The object is moving quickly. The surface is rough."
            },
            {
              "process": "Physical properties",
              "explanation": "The magnet is strong. The water is hot. The sound is loud. The wire is flexible."
            },
            {
              "process": "Color changes",
              "explanation": "In chemistry experiments: 'The solution turned blue.' In physics: 'The bulb glowed brightly.'"
            }
          ],
          "note": "Qualitative data is useful for initial observations and describing phenomena, but physics emphasizes quantitative data for precision."
        },
        {
          "type": "Quantitative Data",
          "value": "Numerical data obtained through measurement",
          "characteristics": [
            "Numerical",
            "Measurable with instruments",
            "Includes units",
            "Can be analyzed mathematically"
          ],
          "behavior": "Provides specific numerical values that allow precise comparisons, calculations, and graphing.",
          "examples": [
            {
              "process": "Measurement of speed",
              "explanation": "Recording speed as 4.5 m/s, not just 'fast.' This allows comparison: 4.5 m/s is faster than 3.2 m/s."
            },
            {
              "process": "Physical measurements",
              "explanation": "Mass = 2.5 kg, Temperature = 25°C, Time = 15 s, Distance = 100 m, Current = 0.5 A."
            },
            {
              "process": "Calculated values",
              "explanation": "Acceleration = 2.0 m/s², Force = 10 N, Energy = 50 J (calculated from measurements)."
            }
          ],
          "note": "Quantitative data is essential in physics because it allows mathematical analysis, graphing, and precise testing of relationships."
        }
      ],
      "principles": [
        {
          "principle": "Both Types Are Valuable",
          "statement": "Qualitative observations can guide what to measure quantitatively.",
          "application": "Noticing qualitatively that 'heavier objects seem to fall faster' leads to quantitative experiments measuring mass and fall time.",
          "example": "Observing 'the water is getting warmer' (qualitative) prompts measuring temperature every minute (quantitative)."
        }
      ],
      "image": {
        "src": "images/unit1/qualitative_vs_quantitative_data.png",
        "alt": "Comparison chart showing examples of qualitative and quantitative data",
        "caption": "Qualitative data describes; quantitative data measures"
      }
    },
    {
      "section_title": "Collecting Data Accurately",
      "introduction": "Accurate data collection is essential for obtaining reliable experimental results. The quality of your data determines the quality of your conclusions.",
      "key_concept": {
        "definition": "Data collection involves making careful observations and taking precise measurements using appropriate instruments and techniques.",
        "context": "Good data collection minimizes errors, ensures measurements are reproducible, and provides the foundation for valid conclusions."
      },
      "principles": [
        {
          "principle": "Use Appropriate Instruments",
          "statement": "Choose measuring instruments that match the precision needed and the quantity being measured.",
          "application": "Using tools designed for the measurement task ensures accuracy.",
          "example": "Use a stopwatch for timing motion (not a wall clock), a meter stick for length (not estimating by eye), a thermometer for temperature (not feeling with your hand)."
        },
        {
          "principle": "Read Instruments Correctly",
          "statement": "Take readings carefully, at eye level, and to the appropriate precision.",
          "application": "Proper reading technique reduces measurement errors.",
          "example": "Read a graduated cylinder at eye level at the bottom of the meniscus. Record to the smallest division (e.g., 24.5 mL, not just 25 mL)."
        },
        {
          "principle": "Maintain Consistency",
          "statement": "Measurements should be taken under the same conditions using the same method.",
          "application": "Reduces variability and makes comparisons valid.",
          "example": "If timing starts when the object is released in trial 1, start timing the same way in all trials. Don't change starting criteria partway through."
        },
        {
          "principle": "Repeat Measurements",
          "statement": "Take multiple measurements and calculate averages to reduce the impact of random errors.",
          "application": "Averaging several trials gives more reliable results than a single measurement.",
          "example": "Measure the period of a pendulum three times (14.2 s, 14.5 s, 14.3 s) and average them (14.3 s) rather than using a single measurement."
        },
        {
          "principle": "Record Immediately and Accurately",
          "statement": "Write down measurements as soon as they're taken, including units.",
          "application": "Prevents forgetting values or confusing which number goes with which trial.",
          "example": "Record 'Trial 1: 5.2 s, Trial 2: 5.4 s' immediately in a data table, not on scraps of paper to organize later."
        }
      ],
      "worked_examples": [
        {
          "title": "Proper Data Collection Technique",
          "problem": "You need to measure how far a toy car travels in 5 seconds. Describe proper data collection procedures.",
          "step_by_step": [
            {
              "step": "Choose appropriate instruments",
              "explanation": "Use a stopwatch for time (to 0.1 s precision) and a meter stick or measuring tape for distance (to nearest cm)."
            },
            {
              "step": "Set up consistent procedure",
              "explanation": "Mark a clear starting line. Decide exactly when to start timing (when car crosses line) and when to stop (after exactly 5.0 s). Mark where car is at that moment."
            },
            {
              "step": "Conduct multiple trials",
              "explanation": "Release the car and collect data at least three times. Record all measurements immediately."
            },
            {
              "step": "Record data with units",
              "explanation": "Trial 1: 125 cm, Trial 2: 128 cm, Trial 3: 126 cm (not just 125, 128, 126)."
            },
            {
              "step": "Calculate average",
              "explanation": "Average = (125 + 128 + 126) ÷ 3 = 126.3 cm ≈ 126 cm"
            }
          ],
          "final_answer": "Proper data collection uses appropriate instruments, consistent procedures, multiple trials, immediate recording with units, and averaging to get reliable results.",
          "concept_applied": "Following systematic data collection procedures ensures measurements are accurate and reproducible."
        }
      ],
      "image": {
        "src": "images/unit1/proper_measurement_technique.png",
        "alt": "Illustrations showing correct vs incorrect ways to read measuring instruments",
        "caption": "Proper technique is essential for accurate data collection"
      }
    },
    {
      "section_title": "Organizing Data in Tables",
      "introduction": "Raw data must be organized systematically so it can be easily understood and analyzed. Data tables are the primary organizational tool in science.",
      "key_concept": {
        "definition": "A data table is an organized arrangement of measurements and observations in rows and columns with clear labels and units.",
        "context": "Well-organized data reveals patterns, makes calculations easier, and allows others to understand and verify your work."
      },
      "principles": [
        {
          "principle": "Use Clear Column Headings",
          "statement": "Each column must have a descriptive heading that includes the quantity name and units in parentheses.",
          "application": "Makes it immediately clear what each number represents.",
          "example": "Column headings: 'Time (s)' and 'Distance (m)' (not just 't' and 'd' with no units)."
        },
        {
          "principle": "Organize Logically",
          "statement": "Arrange data in a logical order—usually with the independent variable in the first column.",
          "application": "Makes relationships easier to see and follows standard convention.",
          "example": "In a distance-time table: Time (independent) in left column, Distance (dependent) in right column, arranged in increasing time order."
        },
        {
          "principle": "Include All Trials",
          "statement": "If multiple trials are conducted, show all individual measurements plus the average.",
          "application": "Allows others to see variability and verify your averaging.",
          "example": "Columns: Time (s) | Trial 1 (m) | Trial 2 (m) | Trial 3 (m) | Average (m)"
        },
        {
          "principle": "Use Consistent Precision",
          "statement": "Record all similar measurements to the same number of decimal places.",
          "application": "Shows the precision of your measurements and maintains consistency.",
          "example": "If measuring to nearest 0.1 s: use 5.0 s, 10.0 s, 15.0 s (not 5 s, 10 s, 15 s)."
        }
      ],
      "worked_examples": [
        {
          "title": "Creating a Proper Data Table",
          "problem": "You measured how the distance a spring stretches depends on the mass hung from it. You tested 100 g, 200 g, 300 g, and 400 g, measuring the stretch three times for each mass. Organize this data in a table.",
          "step_by_step": [
            {
              "step": "Identify variables",
              "explanation": "Independent variable: Mass (what you changed). Dependent variable: Spring stretch (what you measured)."
            },
            {
              "step": "Create column headings",
              "explanation": "Mass (g) | Stretch Trial 1 (cm) | Stretch Trial 2 (cm) | Stretch Trial 3 (cm) | Average Stretch (cm)"
            },
            {
              "step": "Enter data in rows",
              "explanation": "Each row represents one value of the independent variable with its corresponding measurements."
            },
            {
              "step": "Example table structure",
              "explanation": "```\nMass (g) | Trial 1 (cm) | Trial 2 (cm) | Trial 3 (cm) | Average (cm)\n100      | 2.3          | 2.4          | 2.3          | 2.3\n200      | 4.5          | 4.6          | 4.4          | 4.5\n300      | 6.8          | 6.7          | 6.9          | 6.8\n400      | 9.1          | 9.0          | 9.2          | 9.1\n```"
            }
          ],
          "final_answer": "A proper data table has clear headings with units, independent variable in the first column, all trial data shown, and calculated averages in the final column.",
          "concept_applied": "Organized tables make data analysis easier and communicate results clearly."
        }
      ],
      "image": {
        "src": "images/unit1/example_data_tables.png",
        "alt": "Examples of well-formatted data tables for different types of experiments",
        "caption": "Proper data tables include headings with units, organized columns, and clear presentation"
      }
    },
    {
      "section_title": "Analyzing Data: Finding Patterns and Trends",
      "introduction": "Data analysis helps scientists understand what the collected data means by identifying patterns, relationships, and trends.",
      "key_concept": {
        "definition": "Data analysis involves examining organized data to identify patterns, calculate relationships, and draw conclusions about how variables are related.",
        "context": "Analysis transforms numbers into understanding—it's where we discover whether variables are related and how."
      },
      "principles": [
        {
          "principle": "Look for Patterns",
          "statement": "Examine data systematically to identify how the dependent variable changes as the independent variable changes.",
          "application": "Patterns reveal relationships between variables.",
          "example": "If distance increases by equal amounts for equal time intervals (10 m in 1st second, 10 m in 2nd second, 10 m in 3rd second), this shows constant speed."
        },
        {
          "principle": "Calculate When Appropriate",
          "statement": "Perform calculations to find averages, rates, or other derived quantities.",
          "application": "Calculations can reveal relationships not obvious in raw data.",
          "example": "Calculate speed for each time interval: speed = distance/time. If all speeds are the same, motion is uniform."
        },
        {
          "principle": "Compare to Predictions",
          "statement": "Check whether data patterns match what the hypothesis predicted.",
          "application": "Determines whether the hypothesis is supported.",
          "example": "Hypothesis predicted force and acceleration would be proportional. Data shows acceleration doubling when force doubles—hypothesis supported."
        },
        {
          "principle": "Identify Anomalies",
          "statement": "Notice data points that don't fit the pattern (outliers).",
          "application": "Outliers may indicate measurement errors or unusual conditions worth investigating.",
          "example": "Nine measurements show a clear trend, but one is far off—check if that trial had a mistake."
        }
      ],
      "process_flow": [
        {
          "step": "1",
          "process": "Examine the Data Table",
          "description": "Look at the organized data to see how values change.",
          "mechanism": "Read down columns to see if values increase, decrease, or stay constant.",
          "result": "Initial sense of whether there's a pattern.",
          "applications": [
            "Does distance always increase as time increases?",
            "Does temperature change uniformly or in jumps?",
            "Are there any unusual values?"
          ]
        },
        {
          "step": "2",
          "process": "Calculate Derived Quantities",
          "description": "Perform calculations to find averages, differences, ratios, or rates.",
          "mechanism": "Use formulas to calculate new values from measured data.",
          "result": "Additional columns of calculated data that may reveal patterns.",
          "applications": [
            "Calculate average of multiple trials",
            "Calculate speed = distance ÷ time for each interval",
            "Calculate change in temperature per minute"
          ]
        },
        {
          "step": "3",
          "process": "Create Graphs",
          "description": "Plot data on appropriate graphs to visualize relationships.",
          "mechanism": "Use the graphing techniques from Section 1.7 to create visual representations.",
          "result": "Visual display of patterns and relationships.",
          "applications": [
            "Distance vs. time graph shows motion type",
            "Force vs. acceleration graph shows proportionality",
            "Temperature vs. time graph shows heating rate"
          ]
        },
        {
          "step": "4",
          "process": "Identify Relationships",
          "description": "Determine the mathematical relationship between variables.",
          "mechanism": "Look for proportional, inverse, linear, or other relationships.",
          "result": "Understanding of how variables are connected.",
          "applications": [
            "Direct proportion (straight line through origin)",
            "Linear but not proportional (straight line with intercept)",
            "Non-linear relationships (curves)"
          ]
        },
        {
          "step": "5",
          "process": "Draw Conclusions",
          "description": "Interpret what the patterns mean in terms of the original question.",
          "mechanism": "Connect data patterns to physical principles and the hypothesis.",
          "result": "Answer to the research question based on evidence.",
          "applications": [
            "Conclude whether hypothesis is supported or rejected",
            "Explain observations using physics principles",
            "Identify what was learned from the investigation"
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Analyzing Distance-Time Data",
          "problem": "A student records the distance traveled by a toy car at equal time intervals:\n\nTime (s): 0, 1, 2, 3, 4, 5\nDistance (m): 0, 3, 6, 9, 12, 15\n\nAnalyze this data to determine the type of motion.",
          "step_by_step": [
            {
              "step": "Organize and examine data",
              "explanation": "Data is already in table form. Distance increases from 0 to 15 m as time goes from 0 to 5 s."
            },
            {
              "step": "Look for patterns",
              "explanation": "Check how distance changes: 0→3 (change of 3), 3→6 (change of 3), 6→9 (change of 3), 9→12 (change of 3), 12→15 (change of 3). Distance increases by exactly 3 m every second."
            },
            {
              "step": "Calculate speed",
              "explanation": "Speed = distance/time = 3 m / 1 s = 3 m/s for every interval. Speed is constant.",
              "calculation": "Interval 1: (3-0)/(1-0) = 3 m/s\nInterval 2: (6-3)/(2-1) = 3 m/s\nInterval 3: (9-6)/(3-2) = 3 m/s\nAll intervals: 3 m/s"
            },
            {
              "step": "Interpret pattern",
              "explanation": "Uniform increase in distance means constant speed. The car is moving with uniform motion (no acceleration)."
            }
          ],
          "final_answer": "The car moves with constant speed of 3 m/s. The uniform increase in distance (3 m every second) indicates no acceleration—this is uniform motion.",
          "concept_applied": "Analyzing patterns in data reveals the physical nature of motion. Equal distance intervals in equal time intervals means constant speed."
        },
        {
          "title": "Identifying Relationships in Data",
          "problem": "Data from stretching a spring:\n\nMass (g): 0, 50, 100, 150, 200\nStretch (cm): 0, 2.5, 5.0, 7.5, 10.0\n\nWhat is the relationship between mass and stretch?",
          "step_by_step": [
            {
              "step": "Examine the pattern",
              "explanation": "As mass increases, stretch increases. Check if it's proportional."
            },
            {
              "step": "Check for direct proportion",
              "explanation": "Direct proportion means y/x is constant and the line passes through (0,0). Calculate stretch/mass:\n2.5/50 = 0.05\n5.0/100 = 0.05\n7.5/150 = 0.05\n10.0/200 = 0.05"
            },
            {
              "step": "Verify through origin",
              "explanation": "When mass = 0, stretch = 0. The relationship passes through the origin."
            },
            {
              "step": "State relationship",
              "explanation": "Stretch is directly proportional to mass. This follows Hooke's Law: F ∝ x (force proportional to extension)."
            }
          ],
          "final_answer": "Spring stretch is directly proportional to the mass hung from it. The constant ratio (0.05 cm/g) is the spring constant. Every 50 g produces 2.5 cm of stretch.",
          "concept_applied": "Direct proportion is identified when the ratio of dependent to independent variable is constant and the relationship passes through the origin."
        }
      ],
      "image": {
        "src": "images/unit1/data_analysis_examples.png",
        "alt": "Examples showing how to identify different patterns in data",
        "caption": "Different patterns in data reveal different physical relationships"
      }
    },
    {
      "section_title": "Sources of Error in Data",
      "introduction": "No measurement is perfect. Understanding sources of error helps scientists evaluate the reliability of their data and conclusions.",
      "key_concept": {
        "definition": "Measurement errors are differences between measured values and true values. They can be random (unpredictable variations) or systematic (consistent bias).",
        "context": "Recognizing and minimizing errors improves the quality of scientific investigations."
      },
      "classifications": [
        {
          "type": "Random Errors",
          "value": "Unpredictable variations that cause measurements to scatter around the true value",
          "characteristics": [
            "Vary unpredictably from trial to trial",
            "Equally likely to be above or below true value",
            "Affect precision, not accuracy",
            "Reduced by taking multiple measurements and averaging"
          ],
          "behavior": "Cause measurements to scatter around the true value. Half tend to be too high, half too low.",
          "examples": [
            {
              "process": "Human reaction time",
              "explanation": "Starting or stopping a stopwatch involves reaction time that varies slightly (0.1-0.3 s) each time, causing time measurements to vary randomly."
            },
            {
              "process": "Reading uncertainty",
              "explanation": "Estimating between graduation marks on a ruler. One time you might read 5.3 cm, another time 5.4 cm for the same length."
            },
            {
              "process": "Environmental fluctuations",
              "explanation": "Air currents causing a balance reading to fluctuate slightly, or temperature variations affecting measurements."
            },
            {
              "process": "Parallax error",
              "explanation": "Reading a scale from slightly different angles in different trials, causing small variations in readings."
            }
          ],
          "note": "Random errors can be reduced by: (1) Taking multiple measurements and averaging, (2) Using more precise instruments, (3) Controlling environmental conditions, (4) Improving technique with practice."
        },
        {
          "type": "Systematic Errors",
          "value": "Consistent errors that shift all measurements in the same direction",
          "characteristics": [
            "Occur consistently in the same direction",
            "Repeatable—same error every time",
            "Affect accuracy, not precision",
            "NOT reduced by averaging multiple trials",
            "Must be identified and corrected"
          ],
          "behavior": "Shift all measurements consistently too high or too low by approximately the same amount.",
          "examples": [
            {
              "process": "Zero error",
              "explanation": "A balance that reads +2.0 g when empty will add 2.0 g to every mass measurement. All readings are consistently 2.0 g too high."
            },
            {
              "process": "Miscalibrated instrument",
              "explanation": "A thermometer that consistently reads 5°C too low will make all temperature measurements 5°C below actual values."
            },
            {
              "process": "Worn measuring tool",
              "explanation": "A ruler with the first centimeter worn off will make all length measurements 1 cm too short if measured from the worn end."
            },
            {
              "process": "Technique error",
              "explanation": "Always reading a graduated cylinder from above (not eye level) causes all volume measurements to be consistently too low due to parallax."
            }
          ],
          "note": "Systematic errors are corrected by: (1) Calibrating instruments before use, (2) Using proper technique, (3) Checking for zero errors, (4) Comparing with known standards."
        }
      ],
      "principles": [
        {
          "principle": "Effect on Accuracy and Precision",
          "statement": "Random errors affect precision (scatter). Systematic errors affect accuracy (closeness to true value).",
          "application": "You can have precise but inaccurate data (systematic error) or accurate but imprecise data (random errors).",
          "example": "A miscalibrated scale giving 52.0 g, 52.1 g, 52.0 g for a 50.0 g mass is precise (consistent) but not accurate (wrong by 2 g due to systematic error)."
        },
        {
          "principle": "Averaging Helps Random Errors Only",
          "statement": "Taking multiple measurements and averaging reduces random errors but does NOT reduce systematic errors.",
          "application": "Multiple trials improve precision but don't fix consistent bias.",
          "example": "If a thermometer always reads 3°C too high, averaging 100 measurements won't fix it—all 100 will be 3°C too high, and so will the average."
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Error Types",
          "problem": "A student measures the length of a table five times using a meter stick:\n74.3 cm, 74.1 cm, 74.4 cm, 74.2 cm, 74.3 cm (average: 74.3 cm)\n\nThe actual length is 75.3 cm. (a) What type of error is present? (b) What might have caused it? (c) How can it be corrected?",
          "step_by_step": [
            {
              "step": "Analyze the measurements",
              "explanation": "Measurements are very consistent (74.1-74.4 cm range), showing good precision. However, all are about 1 cm below the true value of 75.3 cm."
            },
            {
              "step": "Identify error type",
              "explanation": "The consistent offset (all measurements too low by ~1 cm) indicates systematic error. Random errors would cause scatter above and below the true value."
            },
            {
              "step": "Determine likely cause",
              "explanation": "Possible causes: (1) First 1 cm of meter stick is worn/damaged, (2) Student consistently started measuring from 1 cm mark instead of 0, (3) Parallax error from always viewing from the same incorrect angle."
            },
            {
              "step": "Suggest correction",
              "explanation": "Check the meter stick for wear, ensure starting measurement from true zero, use proper eye-level reading technique, or compare with a different measuring tool to verify."
            }
          ],
          "final_answer": "(a) Systematic error—all measurements consistently 1 cm too low. (b) Likely caused by starting measurement from a worn end or from the 1 cm mark instead of 0. (c) Check and correct the measuring technique, verify the tool's zero point, and remeasure.",
          "concept_applied": "Systematic errors show up as consistent bias in one direction and require correcting the technique or instrument, not just averaging more trials."
        }
      ],
      "image": {
        "src": "images/unit1/random_vs_systematic_errors.png",
        "alt": "Target diagrams showing effects of random and systematic errors",
        "caption": "Random errors cause scatter; systematic errors cause consistent offset"
      }
    },
    {
      "section_title": "Evaluating Data Quality",
      "introduction": "Not all data is equally reliable. Scientists must evaluate data quality to determine how much confidence to place in their conclusions.",
      "principles": [
        {
          "principle": "Check for Consistency",
          "statement": "Repeated measurements should be reasonably close to each other.",
          "application": "Large variations between trials suggest problems with technique or uncontrolled variables.",
          "example": "Times of 10.2 s, 10.3 s, 10.2 s show good consistency. Times of 10.2 s, 15.8 s, 9.1 s suggest measurement problems."
        },
        {
          "principle": "Consider Measurement Precision",
          "statement": "Instrument precision limits how certain you can be about measurements.",
          "application": "Don't report more precision than your instrument allows.",
          "example": "A ruler marked in mm allows measurement to ±0.5 mm. Reporting 24.327 mm falsely suggests greater precision than possible."
        },
        {
          "principle": "Identify and Handle Outliers",
          "statement": "Data points far from the trend may be errors and should be investigated.",
          "application": "Don't automatically discard outliers, but understand why they occurred.",
          "example": "Nine measurements near 5.0 s, one at 12.3 s. Investigate the outlier—was there a timing mistake? If so, you might exclude it or repeat that trial."
        },
        {
          "principle": "Document Everything",
          "statement": "Record conditions, procedures, and any unusual observations.",
          "application": "Allows you and others to evaluate data quality and reproducibility.",
          "example": "Note if one trial was affected by wind, if an instrument was recalibrated between trials, or if a procedure was modified."
        }
      ]
    }
  ],
  "key_terms": [
    "Data",
    "Qualitative data",
    "Quantitative data",
    "Data analysis",
    "Pattern",
    "Trend",
    "Data table",
    "Average",
    "Precision",
    "Accuracy",
    "Error",
    "Random error",
    "Systematic error",
    "Outlier",
    "Derived quantity"
  ],
  "summary": "Data analysis is the systematic process of collecting, organizing, and interpreting experimental measurements to draw meaningful conclusions. Scientific data can be qualitative (descriptive) or quantitative (numerical), with physics emphasizing quantitative measurements for precision. Proper data collection requires using appropriate instruments, maintaining consistency, taking multiple measurements, and recording values immediately with units. Data must be organized in tables with clear headings, units, and logical arrangement—typically with the independent variable in the first column. Analysis involves identifying patterns and trends, calculating derived quantities, creating graphs, and comparing results to predictions. Understanding measurement errors is crucial: random errors cause unpredictable variations and are reduced by averaging multiple trials, while systematic errors cause consistent bias and must be identified and corrected. Quality data analysis transforms raw numbers into scientific understanding, providing the evidence needed to support or reject hypotheses and advance our knowledge of the physical world."
}
