{
  "expanded_description": "Science is a systematic way of understanding the natural world through observation, evidence, and logical reasoning. It helps us explain how physical phenomena occur and allows us to make reliable predictions.",
  "core_concept": {
    "principle": "Science seeks to understand nature through evidence-based inquiry.",
    "explanation": "Scientific knowledge is developed by observing natural phenomena, asking questions, testing ideas through experiments, and refining explanations based on evidence.",
    "image": {
      "src": "images/nature_of_science_overview.png",
      "alt": "Overview of scientific inquiry",
      "caption": "Science uses observation, experimentation, and reasoning to understand the natural world."
    }
  },
  "sections": [
    {
      "section_title": "What Is Science?",
      "introduction": "Science is not just a collection of facts, but a process for discovering how the universe works.",
      "key_concept": {
        "definition": "Science is the systematic study of the natural world through observation and experimentation.",
        "context": "Physics, chemistry, and biology are branches of science that focus on different aspects of nature."
      },
      "principles": [
        {
          "principle": "Empirical Evidence",
          "statement": "Scientific ideas must be supported by observable and measurable evidence.",
          "application": "Measurements of motion, force, or temperature are used to test physics ideas.",
          "example": "Measuring how far an object falls in one second.",
          "analogy": "Like checking receipts to confirm how much money was spent."
        }
      ]
    },
    {
      "section_title": "Characteristics of Science",
      "classifications": [
        {
          "type": "Scientific Knowledge",
          "value": "Evidence-based",
          "characteristics": [
            "Observable",
            "Testable",
            "Repeatable"
          ],
          "behavior": "Scientific explanations change when new evidence is discovered.",
          "examples": [
            {
              "process": "Revision of models",
              "explanation": "Atomic models changed as better experiments were developed."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Science and Society",
      "introduction": "Scientific discoveries influence technology, health, and daily life.",
      "categories": [
        {
          "type": "Applications of Science",
          "description": "Using scientific knowledge to solve real-world problems.",
          "examples": [
            {
              "process": "Electric power generation",
              "explanation": "Physics principles are used to generate and distribute electricity."
            }
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Science",
    "Observation",
    "Evidence",
    "Experiment",
    "Theory"
  ],
  "summary": "Science is a dynamic process that builds knowledge about the natural world using evidence, experimentation, and logical reasoning. It evolves over time and plays a crucial role in shaping technology and society."
}
