{
  "expanded_description": "Where do wages come from? Why do some workers earn more than others? The answers lie in factor markets—markets for the inputs used to produce goods and services. Labor markets, capital markets, and land markets all operate according to supply and demand, but with important twists. Demand for factors is derived from the demand for the products they help produce. Understanding factor markets is essential for analyzing income distribution, wage determination, and the effects of minimum wage laws, unions, and immigration. In this unit, we'll explore how firms decide how many workers to hire, how wages are determined, why wages differ across occupations and individuals, and what happens when either employers or workers have market power.",
  
  "core_concept": {
    "principle": "Factor markets are markets for the inputs used in production: labor, capital, and land. (1) Derived demand: Demand for factors is derived from the demand for the final goods they produce. Firms hire factors not because they want them directly, but because they contribute to producing output that can be sold. (2) Marginal revenue product (MRP): The additional revenue generated by hiring one more unit of a factor. For a competitive firm, $MRP = MP \\times P$. For a firm with market power, $MRP = MP \\times MR$. (3) Profit-maximizing hiring: Firms hire additional units of a factor as long as $MRP$ exceeds the factor's price (wage for labor). The optimal quantity is where $MRP =$ factor price. (4) Factor supply: The supply of labor depends on workers' trade-off between work and leisure, population, and other factors. (5) Equilibrium: Factor prices (wages, rental rates) are determined by supply and demand in factor markets. (6) Wage differentials: Differences in wages arise from differences in human capital, compensating differentials, discrimination, and market power. (7) Market power: Monopsony (single buyer of labor) can压低 wages; unions can raise wages above competitive levels.",
    
    "explanation": "Think of a farmer deciding how many workers to hire. Each worker helps produce more crops. The farmer compares the value of the additional crops to the wage. That's derived demand—the demand for workers comes from the demand for crops. If crop prices rise, workers become more valuable, and the farmer hires more. This same logic applies to all factors of production.",
    
    "image": {
      "src": "images/unit8/factor_markets_overview.png",
      "alt": "Circular flow showing households supplying labor to firms, firms paying wages",
      "caption": "Figure 8.0.1: Factor markets connect households (suppliers of labor) and firms (demanders of labor)."
    }
  },

  "sections": [
    {
      "section_title": "8.1 Derived Demand for Labor",
      "introduction": "Why do firms hire workers? Not because they like employing people, but because workers produce output that can be sold. This makes the demand for labor a derived demand—it derives from the demand for the final product. Understanding this concept is essential for analyzing how changes in product markets affect labor markets, and vice versa. In this section, we'll explore what derived demand means, how it connects product and factor markets, and what factors shift the demand for labor.",
      
      "introduction_image": {
        "src": "images/unit8/derived_demand_intro.png",
        "alt": "Chain linking product demand to labor demand",
        "caption": "Figure 8.1.1: Demand for labor is derived from demand for the final product."
      },
      
      "key_concept": {
        "definition": "Derived demand means that the demand for a factor of production (like labor) comes from the demand for the goods and services that factor helps produce. (1) Connection to product market: The demand for labor is not direct—firms don't value labor for itself but for what it produces. If consumers want more of a good, firms will want more labor to produce it. (2) Determinants of labor demand: (a) Product demand: Stronger product demand increases labor demand. (b) Productivity: More productive workers are more valuable. (c) Prices of other inputs: Changes in capital costs or technology affect labor demand. (3) Shifters of labor demand: Labor demand shifts when: (a) Product demand changes (e.g., increased demand for cars increases auto worker demand). (b) Productivity changes (e.g., better training makes workers more valuable). (c) Prices of other inputs change (e.g., cheaper machinery might substitute for labor or complement it). (4) Elasticity of labor demand: Responsiveness of labor demand to wage changes depends on: elasticity of product demand, ease of substituting other inputs, and labor's share of costs. (5) Importance: Derived demand explains why labor market conditions are tied to product market conditions—recessions reduce product demand, which reduces labor demand, leading to unemployment.",
        
        "context": "The concept of derived demand was developed by Alfred Marshall, who also analyzed the factors affecting the elasticity of derived demand. Understanding derived demand is essential for analyzing wage determination, the effects of trade on labor markets, and the impact of technological change on employment. In AP Microeconomics, derived demand is the foundation for understanding factor market analysis.",
        
        "image": {
          "src": "images/unit8/derived_demand_diagram.png",
          "alt": "Diagram showing product market affecting labor market",
          "caption": "Figure 8.1.2: Labor demand derives from product demand."
        }
      },

      "classifications": [
        {
          "type": "Direct vs. Derived Demand",
          "value": "Labor demand is derived, not direct",
          "characteristics": ["Comes from product demand", "Firms hire to produce, not for own sake", "Connected to consumer preferences", "Changes with product market conditions", "Fundamental concept"],
          "behavior": "Direct demand is demand for a good for its own sake—consumers want pizza because they enjoy eating it. Derived demand is demand for an input because it helps produce something else. Firms demand labor not because they enjoy employing workers, but because workers produce output that can be sold. This distinction is crucial: anything that affects product demand will affect labor demand. If people want fewer cars, automakers need fewer workers. This is why labor markets are pro-cyclical—they boom when product demand is high and slump during recessions. Understanding derived demand helps explain why workers in different industries have different fortunes based on demand for their products.",
          
          "image": {
            "src": "images/unit8/direct_vs_derived.png",
            "alt": "Comparison: direct demand for pizza vs. derived demand for pizza workers",
            "caption": "Figure 8.1.3: Labor demand is derived from product demand."
          },
          
          "examples": [
            {
              "process": "Auto industry",
              "explanation": "Demand for auto workers derives from demand for cars. When gasoline prices rise and SUV demand falls, automakers lay off workers."
            },
            {
              "process": "Healthcare workers",
              "explanation": "Demand for nurses derives from demand for healthcare services. An aging population increases healthcare demand, raising demand for nurses."
            }
          ]
        },
        {
          "type": "Shifters of Labor Demand",
          "value": "Factors that change labor demand",
          "characteristics": ["Product demand changes", "Productivity changes", "Technology changes", "Input price changes", "Number of firms"],
          "behavior": "The demand for labor can shift due to several factors: (1) Changes in product demand: If consumers want more of a good, the value of workers producing that good increases, shifting labor demand right. (2) Changes in productivity: If workers become more productive (better training, better technology), they are more valuable, shifting labor demand right. (3) Changes in technology: New technology can either complement labor (increase demand) or substitute for labor (decrease demand). (4) Changes in prices of other inputs: If the price of capital falls, firms may substitute capital for labor (decreasing labor demand) or expand output (increasing labor demand)—the net effect depends on whether the substitution or output effect dominates. (5) Changes in the number of firms: More firms in an industry increase total labor demand.",
          
          "image": {
            "src": "images/unit8/labor_demand_shifters.png",
            "alt": "Labor demand shifting right and left with factors listed",
            "caption": "Figure 8.1.4: Labor demand shifts with product demand, productivity, and technology."
          },
          
          "examples": [
            {
              "process": "Increased demand for houses",
              "explanation": "A housing boom increases demand for construction workers—labor demand shifts right."
            },
            {
              "process": "Automation in manufacturing",
              "explanation": "Robots replacing assembly line workers shifts labor demand left (substitution effect)."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Labor Demand Is Derived from Product Demand",
          "statement": "The most fundamental idea in labor economics is that the demand for labor is derived from the demand for the goods and services that labor produces. Firms don't hire workers because they like them; they hire because workers create value by producing things consumers want. This means that anything that affects product demand will affect labor demand. If the demand for a product increases, the value of workers producing that product increases, and firms will want to hire more. If product demand decreases, workers become less valuable, and firms will hire fewer. This derived demand relationship connects product markets and factor markets, explaining why labor market conditions mirror conditions in product markets.",
          "application": "To predict changes in labor demand, look first at product demand. If you expect product demand to rise, labor demand will rise. If product demand falls, labor demand falls. This applies to industries, occupations, and even geographic areas.",
          "example": "During the COVID-19 pandemic, demand for restaurant meals fell dramatically. This reduced the derived demand for restaurant workers, leading to massive layoffs.",
          
          "image": {
            "src": "images/unit8/derived_principle.png",
            "alt": "Flow from product demand to labor demand",
            "caption": "Figure 8.1.5: Labor demand derives from product demand."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing Derived Demand Shifts",
          
          "image": {
            "src": "images/unit8/derived_example1.png",
            "alt": "Scenarios affecting labor demand",
            "caption": "Figure 8.1.6: Determine effect on labor demand."
          },
          
          "problem": "For each event, determine whether the demand for labor in the specified industry increases, decreases, or stays the same:<br>a) Demand for new homes increases sharply.<br>b) A new training program makes construction workers more productive.<br>c) The price of robotic welding equipment falls significantly.<br>d) A recession reduces consumer spending on restaurant meals.<br>e) A new law requires nurses to have additional certification, reducing the number of qualified workers (note: this affects supply, not demand).",
          
          "step_by_step": [
            {
              "step": "Event a",
              "explanation": "Increased demand for homes increases derived demand for construction workers. Labor demand increases."
            },
            {
              "step": "Event b",
              "explanation": "Increased productivity makes workers more valuable, increasing labor demand."
            },
            {
              "step": "Event c",
              "explanation": "Cheaper robots could substitute for labor (decreasing demand) or could lower costs and expand output (increasing demand). The net effect is ambiguous without more information."
            },
            {
              "step": "Event d",
              "explanation": "Reduced demand for restaurant meals reduces derived demand for restaurant workers. Labor demand decreases."
            },
            {
              "step": "Event e",
              "explanation": "This affects the supply of nurses, not demand. Labor demand is unchanged."
            }
          ],
          
          "final_answer": "a) Increase. b) Increase. c) Ambiguous (substitution vs. output effect). d) Decrease. e) No change (supply shift).",
          "concept_applied": "Labor demand shifts with product demand and productivity. Technology changes can have ambiguous effects."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Product Market",
          "description": "Determine what product the labor helps produce.",
          "mechanism": "Labor is used to produce specific goods or services. Identify the relevant product market.",
          "result": "Connection between labor and product.",
          
          "image": {
            "src": "images/unit8/derived_step1.png",
            "alt": "Worker and product",
            "caption": "Figure 8.1.7: Step 1 - Identify what product the labor produces."
          }
        },
        {
          "step": 2,
          "process": "Assess Product Demand Conditions",
          "description": "Determine what is happening to demand for the product.",
          "mechanism": "Product demand up → labor demand up. Product demand down → labor demand down.",
          "result": "Direction of labor demand change.",
          
          "image": {
            "src": "images/unit8/derived_step2.png",
            "alt": "Product demand graph",
            "caption": "Figure 8.1.8: Step 2 - Assess product demand."
          }
        },
        {
          "step": 3,
          "process": "Consider Productivity Changes",
          "description": "Determine if worker productivity is changing.",
          "mechanism": "Productivity up → labor demand up. Productivity down → labor demand down.",
          "result": "Productivity effect.",
          
          "image": {
            "src": "images/unit8/derived_step3.png",
            "alt": "Productivity increasing",
            "caption": "Figure 8.1.9: Step 3 - Consider productivity changes."
          }
        },
        {
          "step": 4,
          "process": "Evaluate Technology and Input Prices",
          "description": "Consider how technology and other input prices affect labor demand.",
          "mechanism": "Substitution effect (replace labor) vs. output effect (expand production). Net effect may be ambiguous.",
          "result": "Technology/input price assessment.",
          
          "image": {
            "src": "images/unit8/derived_step4.png",
            "alt": "Robot and worker",
            "caption": "Figure 8.1.10: Step 4 - Evaluate technology and input prices."
          }
        },
        {
          "step": 5,
          "process": "Determine Net Effect on Labor Demand",
          "description": "Combine all factors to determine overall shift in labor demand.",
          "mechanism": "If multiple factors, consider net effect. Some changes may have ambiguous effects requiring analysis.",
          "result": "Labor demand shift direction.",
          
          "image": {
            "src": "images/unit8/derived_step5.png",
            "alt": "Labor demand shifting",
            "caption": "Figure 8.1.11: Step 5 - Determine net effect on labor demand."
          }
        }
      ],

      "image": {
        "src": "images/unit8/derived_demand_summary.png",
        "alt": "Comprehensive summary: derived demand concept, shifters, relationship to product markets",
        "caption": "Figure 8.1.12: Derived demand for labor summary."
      }
    }
  ],

  "key_terms": [
    "Derived demand",
    "Factor markets",
    "Labor demand",
    "Product demand",
    "Productivity",
    "Substitution effect",
    "Output effect",
    "Complementary inputs",
    "Substitute inputs",
    "Elasticity of labor demand",
    "Marshall's rules",
    "Factor substitution",
    "Technological change",
    "Labor-saving technology",
    "Labor-complementary technology"
  ],

  "summary": "Demand for labor is derived demand—it comes from the demand for the goods and services that labor produces. Firms hire workers not for their own sake, but because they produce output that can be sold. This means that labor market conditions are closely tied to product market conditions. Key determinants of labor demand include: product demand (stronger product demand increases labor demand), worker productivity (more productive workers are more valuable), and technology/input prices (changes can either substitute for labor or complement it). Labor demand shifts when any of these factors change. The elasticity of labor demand depends on the elasticity of product demand, the ease of substituting other inputs, and labor's share of costs. Understanding derived demand is essential for analyzing wage determination, employment fluctuations, and the effects of policies like minimum wage laws and immigration."
}
