{
  "topic": "Forces and Free Body Diagrams",
  "unit_title": "Identifying Forces and Drawing Free Body Diagrams",
  "unit_number": "Unit 2.1",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics 1",
  "duration": "3-4 hours",
  "difficulty_level": "introductory",
  "expanded_description": "Comprehensive introduction to force identification and free body diagram construction. Covers fundamental forces in mechanics, proper FBD techniques, and systematic approaches for analyzing forces acting on objects. Essential foundation for Newton's Laws applications.",

  "learning_objectives": [
    "Identify all forces acting on an object in various situations",
    "Draw proper free body diagrams using correct conventions",
    "Distinguish between different types of forces",
    "Apply systematic approaches for force identification",
    "Resolve forces into components when necessary",
    "Use FBDs as problem-solving tools in mechanics"
  ],

  "prerequisites": [
    "Basic vector concepts",
    "Understanding of mass vs. weight",
    "Coordinate systems",
    "Trigonometric functions",
    "Basic algebra skills",
    "Visual representation skills"
  ],

  "core_concept": {
    "principle": "Force Identification: Contact forces, Field forces, Force vectors, Newton's Third Law pairs, FBD conventions, System isolation, Force components, Equilibrium analysis.",
    "explanation": "Free body diagrams are visual representations that isolate an object and show all external forces acting on it, providing the foundation for applying Newton's Laws to solve mechanics problems.",
    "image": {
      "url": "images/fbd-core.png",
      "alt": "Free body diagram core concepts",
      "caption": "Fundamental principles of force identification and FBD construction"
    }
  },

  "sections": [
    {
      "section_title": "1. Fundamental Forces and Identification",
      "introduction": "Understanding the different types of forces in mechanics and developing systematic approaches for identifying all forces acting on an object.",

      "key_concept": {
        "definition": "Force types, Contact forces, Field forces, Force identification, System boundaries, External vs internal forces, Force properties, Measurement units.",
        "context": "Forces are interactions that cause objects to accelerate, classified as contact forces (require physical contact) or field forces (act at a distance), with each having specific characteristics and identification methods.",
        "image": {
          "url": "images/force-identification.png",
          "alt": "Force identification",
          "caption": "Systematic approach to force identification"
        }
      },

      "classifications": [
        {
          "type": "Force Classification System",
          "value": "Classification based on force nature and interaction type",
          "characteristics": [
            "Contact forces",
            "Field forces",
            "Applied forces",
            "Support forces",
            "Restoring forces",
            "Dissipative forces"
          ],
          "behavior": "Different force types have distinct identification methods: contact forces require checking for physical interactions, field forces depend on object properties, and constraint forces maintain geometric relationships",
          "examples": [
            {
              "process": "Contact Force Identification",
              "explanation": "Systematically checking all surfaces in contact for normal and friction forces",
              "image": {
                "url": "images/contact-forces.png",
                "alt": "Contact forces",
                "caption": "Identification of contact forces"
              }
            },
            {
              "process": "Field Force Analysis",
              "explanation": "Identifying forces that act at a distance based on object properties",
              "image": {
                "url": "images/field-forces.png",
                "alt": "Field forces",
                "caption": "Analysis of field forces"
              }
            }
          ],
          "note": "Key forces: Weight (mg), Normal force, Friction, Tension, Spring force, Applied push/pull; Always check: surfaces in contact, ropes/strings attached, field interactions, constraint conditions."
        }
      ],

      "principles": [
        {
          "principle": "Force Identification and Classification",
          "statement": "Systematic force identification is crucial for accurate mechanics analysis and involves recognizing all interactions acting on an object: Fundamental Force Types: Contact Forces: Require physical contact; Normal force: perpendicular to surface; Friction force: parallel to surface; Tension: through ropes, strings, cables; Spring force: proportional to deformation; Applied forces: pushes, pulls; Support forces: reactions at constraints. Field Forces: Act at a distance; Weight (gravitational force): F_g = mg, directed downward; Electric and magnetic forces: depend on charges and fields; Nuclear forces: subatomic scale. Force Properties: Vectors: have magnitude and direction; Measured in Newtons (N); 1 N = 1 kg·m/s²; Can be resolved into components; Obey vector addition rules; Can cause acceleration (Newton's Second Law). Systematic Identification Method: Step 1: Isolate the object of interest; Step 2: Check for field forces (always weight); Step 3: Check all contact points/surfaces; Step 4: Identify strings, ropes, cables attached; Step 5: Look for springs or elastic connections; Step 6: Consider constraint forces. Common Force Characteristics: Weight: always acts at center of mass, directed downward; Normal force: always perpendicular to surface; Friction: always parallel to surface, opposes motion; Tension: always pulls away from object; Spring force: always toward equilibrium position. Newton's Third Law Considerations: Every force has an equal and opposite reaction force; Action-reaction pairs act on different objects; Internal vs external force distinction; Don't include reaction forces in FBD of the object. Special Situations: Inclined planes: resolve weight into components; Circular motion: look for centripetal forces; Fluid environments: buoyancy and drag forces; Electromagnetic systems: Lorentz forces; Multi-body systems: identify interaction forces.",
          "application": "Systematically identify all forces on an object. Distinguish between different force types. Apply Newton's Third Law correctly. Determine force directions based on context. Identify missing or extraneous forces. Prepare for FBD construction.",
          "example": "Book on table: weight (down), normal force (up). Book pushed on table: add applied force (horizontal), friction (opposing motion). Car on hill: weight (down), normal (perpendicular to surface), friction (parallel to surface).",
          "analogy": "Like a detective at a crime scene - you must carefully examine every piece of evidence (contact points, field interactions) to identify all suspects (forces) involved, making sure not to miss any clues or include any red herrings, with each suspect having specific characteristics and modus operandi",
          "image": {
            "url": "images/force-identification-principles.png",
            "alt": "Force identification principles",
            "caption": "Principles of force identification and classification"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Basic Force Identification on Level Surface",
          "problem": "Identify all forces acting on: (a) Book resting on table, (b) Book being pushed to the right on table, (c) Book sliding to the right on table.",
          "step_by_step": [
            {
              "step": "Case (a): Book at rest on table",
              "explanation": "Weight (downward) - field force; Normal force (upward) - contact force from table"
            },
            {
              "step": "Case (b): Book pushed but not moving",
              "explanation": "Weight (down); Normal force (up); Applied push force (right); Static friction (left) - opposes impending motion"
            },
            {
              "step": "Case (c): Book sliding right",
              "explanation": "Weight (down); Normal force (up); Applied force (right) if still pushing; Kinetic friction (left) - opposes motion"
            },
            {
              "step": "Force characteristics",
              "explanation": "All are contact forces except weight; Normal force always perpendicular to surface; Friction always parallel to surface"
            },
            {
              "step": "Newton's Third Law pairs",
              "explanation": "Book's weight pairs with Earth's upward pull; Normal force pairs with table's downward push on book; etc. (but these act on different objects)"
            }
          ],
          "final_answer": "(a) Weight ↓, Normal force ↑; (b) Weight ↓, Normal ↑, Applied →, Static friction ←; (c) Weight ↓, Normal ↑, Applied → (if present), Kinetic friction ←",
          "concept_applied": "Basic force identification",
          "image": {
            "url": "images/basic-force-id.png",
            "alt": "Basic force identification example",
            "caption": "Basic force identification on level surface"
          }
        },
        {
          "title": "Force Identification on Inclined Plane",
          "problem": "Identify forces on a block: (a) At rest on frictionless incline, (b) Sliding down rough incline, (c) Being pushed up rough incline.",
          "step_by_step": [
            {
              "step": "Coordinate system setup",
              "explanation": "Use inclined coordinates: x parallel to surface, y perpendicular to surface"
            },
            {
              "step": "Case (a): At rest on frictionless incline",
              "explanation": "Weight (vertical down); Normal force (perpendicular to surface); No friction (frictionless)"
            },
            {
              "step": "Case (b): Sliding down rough incline",
              "explanation": "Weight (vertical down); Normal force (perpendicular to surface); Kinetic friction (up incline - opposes motion)"
            },
            {
              "step": "Case (c): Pushed up rough incline",
              "explanation": "Weight (vertical down); Normal force (perpendicular to surface); Applied force (up incline); Kinetic friction (down incline - opposes motion)"
            },
            {
              "step": "Weight components",
              "explanation": "Weight resolves into: mg sinθ (down incline), mg cosθ (into surface)"
            },
            {
              "step": "Force directions verification",
              "explanation": "Friction always opposes motion or impending motion; Normal always perpendicular to surface"
            }
          ],
          "final_answer": "(a) Weight, Normal; (b) Weight, Normal, Kinetic friction (up incline); (c) Weight, Normal, Applied (up), Kinetic friction (down)",
          "concept_applied": "Inclined plane force identification",
          "image": {
            "url": "images/incline-force-id.png",
            "alt": "Incline force identification example",
            "caption": "Force identification on inclined plane"
          }
        }
      ]
    },
    {
      "section_title": "2. Free Body Diagram Construction",
      "introduction": "Mastering the techniques for drawing proper free body diagrams that accurately represent all forces acting on an object.",

      "key_concept": {
        "definition": "FBD conventions, Vector representation, Scale diagrams, Component resolution, System isolation, Coordinate systems, Labeling standards, Diagram interpretation.",
        "context": "Free body diagrams are standardized visual tools that represent an object as a point or simple shape with all external forces shown as vectors originating from the object's center.",
        "image": {
          "url": "images/fbd-construction.png",
          "alt": "FBD construction",
          "caption": "Proper techniques for free body diagram construction"
        }
      },

      "classifications": [
        {
          "type": "FBD Construction Methods",
          "value": "Classification based on complexity and coordinate systems",
          "characteristics": [
            "Basic single-object FBDs",
            "Component-resolved FBDs",
            "Inclined coordinate FBDs",
            "Multi-body FBD systems",
            "Rotational FBDs",
            "Constraint-based FBDs"
          ],
          "behavior": "Different FBD types serve specific analytical purposes: basic FBDs show overall forces, component FBDs facilitate equation writing, and specialized FBDs handle rotational or constrained motion",
          "examples": [
            {
              "process": "Standard FBD Construction",
              "explanation": "Creating basic free body diagrams with all forces shown as vectors",
              "image": {
                "url": "images/standard-fbd.png",
                "alt": "Standard FBD",
                "caption": "Standard free body diagram construction"
              }
            },
            {
              "process": "Component FBD Development",
              "explanation": "Resolving forces into components for equation application",
              "image": {
                "url": "images/component-fbd.png",
                "alt": "Component FBD",
                "caption": "Component-based free body diagram"
              }
            }
          ],
          "note": "FBD standards: Object as dot or simple shape; Forces as arrows pointing away from object; Reasonable length proportions; Clear labeling; Consistent coordinate system; No internal forces; No acceleration vectors."
        }
      ],

      "principles": [
        {
          "principle": "Free Body Diagram Construction Standards",
          "statement": "Proper free body diagram construction follows specific conventions that ensure accurate force representation and facilitate problem-solving: Basic FBD Conventions: Represent object as point or simple shape; Draw all external forces as vectors; Vectors point in actual force directions; Arrow tails at object center; Label all forces clearly; Use reasonable length proportions. Force Representation Standards: Weight: always straight down from center; Normal force: perpendicular to surface away from surface; Friction: parallel to surface opposing motion; Tension: away from object along rope; Spring force: toward or away from anchor point; Applied forces: in specified direction. Coordinate System Selection: Standard Cartesian: x-horizontal, y-vertical; Inclined coordinates: parallel and perpendicular to surface; Polar coordinates: radial and tangential; Choose system to simplify components; Be consistent throughout analysis. Component Resolution: Resolve forces into components when helpful; Show components as dashed lines or separate diagram; Useful for inclined planes, projectiles, circular motion; Helps identify net force in each direction. Multi-Body Diagrams: Draw separate FBD for each object; Identify interaction forces between objects; Newton's Third Law pairs have equal magnitude, opposite direction; Use consistent labeling for interaction forces. Common FBD Errors to Avoid: Including internal forces; Showing acceleration vectors on FBD; Missing forces (especially weight); Incorrect force directions; Inconsistent coordinate systems; Unlabeled or poorly scaled vectors. Special Situation FBDs: Objects in fluids: include buoyancy and drag; Charged particles: include electric/magnetic forces; Rotating systems: include centripetal forces; Connected systems: identify constraint forces. FBD as Problem-Solving Tool: Foundation for Newton's Second Law: ΣF = ma; Helps identify unknown forces; Reveals force relationships; Guides equation setup; Provides visual check of reasoning.",
          "application": "Construct proper free body diagrams following conventions. Select appropriate coordinate systems. Resolve forces into components when needed. Draw multi-body diagrams with consistent labeling. Identify and correct common FBD errors. Use FBDs as problem-solving foundations.",
          "example": "Box on incline: FBD shows weight (down), normal (perpendicular to surface), friction (parallel to surface). Pendulum: FBD shows weight (down), tension (along string). Car on banked curve: FBD shows weight (down), normal (at angle), friction (optional).",
          "analogy": "Like an architect's blueprint - the FBD provides a clean, simplified representation of all the structural elements (forces) acting on your building (object), with standardized symbols and conventions that allow different engineers to understand and work with the same information unambiguously",
          "image": {
            "url": "images/fbd-construction-principles.png",
            "alt": "FBD construction principles",
            "caption": "Principles of free body diagram construction"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Basic FBD for Object on Horizontal Surface",
          "problem": "Draw FBD for: (a) Box at rest on floor, (b) Box being pulled to right at constant velocity, (c) Box accelerating to right.",
          "step_by_step": [
            {
              "step": "Case (a): Box at rest",
              "explanation": "Dot representing box; Weight vector downward labeled 'mg' or 'F_g'; Normal vector upward labeled 'F_N' or 'N'; Equal length vectors (balanced forces)"
            },
            {
              "step": "Case (b): Constant velocity to right",
              "explanation": "Dot for box; Weight down; Normal up; Tension/pull force right labeled 'F_T' or 'T'; Friction left labeled 'f_k'; Tension and friction equal length (zero net force)"
            },
            {
              "step": "Case (c): Accelerating right",
              "explanation": "Dot for box; Weight down; Normal up; Applied force right (longer arrow); Friction left (shorter arrow); Net force to right (acceleration direction)"
            },
            {
              "step": "Vector scaling",
              "explanation": "Scale arrow lengths to represent relative magnitudes; Balanced forces equal length; Unbalanced forces show net force direction"
            },
            {
              "step": "Labeling standards",
              "explanation": "Clear labels for each force; Consistent notation; No acceleration vectors on FBD"
            }
          ],
          "final_answer": "Three separate FBDs showing: (a) Balanced vertical forces; (b) Balanced horizontal and vertical forces; (c) Unbalanced horizontal forces with net force right",
          "concept_applied": "Basic FBD construction",
          "image": {
            "url": "images/basic-fbd.png",
            "alt": "Basic FBD example",
            "caption": "Basic free body diagram construction"
          }
        },
        {
          "title": "FBD for Connected System",
          "problem": "Two boxes connected by string: Box A (5 kg) on table, Box B (3 kg) hanging over pulley. Draw FBD for each box.",
          "step_by_step": [
            {
              "step": "Isolate Box A (on table)",
              "explanation": "Dot for Box A; Weight A downward (m_A g); Normal force upward; Tension right (away from box); Friction left (opposing motion)"
            },
            {
              "step": "Isolate Box B (hanging)",
              "explanation": "Dot for Box B; Weight B downward (m_B g); Tension upward (along string)"
            },
            {
              "step": "Newton's Third Law consistency",
              "explanation": "Tension on Box A and Box B are equal magnitude, opposite direction (action-reaction pair)"
            },
            {
              "step": "Coordinate systems",
              "explanation": "Box A: standard x-y; Box B: vertical direction most important"
            },
            {
              "step": "Force relationships",
              "explanation": "If moving right: friction opposes Box A motion; Tension connects both boxes; Weights depend on masses"
            },
            {
              "step": "Complete FBD set",
              "explanation": "Two separate but connected diagrams showing all forces on each object"
            }
          ],
          "final_answer": "Box A FBD: Weight ↓, Normal ↑, Tension →, Friction ←; Box B FBD: Weight ↓, Tension ↑; Tension forces are Newton's Third Law pair",
          "concept_applied": "Connected system FBD",
          "image": {
            "url": "images/connected-fbd.png",
            "alt": "Connected system FBD example",
            "caption": "Free body diagrams for connected system"
          }
        }
      ]
    },
    {
      "section_title": "3. Advanced FBD Applications and Problem Solving",
      "introduction": "Applying free body diagrams to complex scenarios and using them as foundational tools for solving mechanics problems.",

      "key_concept": {
        "definition": "Complex systems, Constraint forces, Rotational dynamics, Fluid forces, Electromagnetic forces, Problem-solving framework, System analysis, Advanced applications.",
        "context": "Advanced FBD applications extend to complex multi-body systems, rotational dynamics, and specialized force situations, providing the visual foundation for sophisticated mechanics problem-solving.",
        "image": {
          "url": "images/advanced-fbd.png",
          "alt": "Advanced FBD applications",
          "caption": "Advanced applications of free body diagrams"
        }
      },

      "classifications": [
        {
          "type": "Advanced FBD Applications",
          "value": "Classification based on system complexity and force types",
          "characteristics": [
            "Multi-body constrained systems",
            "Rotational dynamics FBDs",
            "Fluid environment FBDs",
            "Electromagnetic force FBDs",
            "Non-inertial reference frames",
            "Variable force systems"
          ],
          "behavior": "Advanced FBD applications require specialized approaches: multi-body systems need interaction force identification, rotational FBDs include torque considerations, and non-inertial frames introduce fictitious forces",
          "examples": [
            {
              "process": "Rotational FBD Analysis",
              "explanation": "Creating extended free body diagrams that include force positions for torque calculation",
              "image": {
                "url": "images/rotational-fbd.png",
                "alt": "Rotational FBD",
                "caption": "Extended FBD for rotational dynamics"
              }
            },
            {
              "process": "Constrained System FBD",
              "explanation": "Analyzing systems with geometric constraints and connection forces",
              "image": {
                "url": "images/constrained-fbd.png",
                "alt": "Constrained system FBD",
                "caption": "FBD for mechanically constrained systems"
              }
            }
          ],
          "note": "Advanced techniques: Extended FBDs for rotation; Virtual work methods; Constraint force identification; Non-inertial frame transformations; Distributed force representations; Energy method cross-verification."
        }
      ],

      "principles": [
        {
          "principle": "Advanced FBD Applications and Problem-Solving",
          "statement": "Free body diagrams serve as the foundation for solving complex mechanics problems through systematic analysis and advanced applications: Multi-Body System Analysis: Draw separate FBD for each object; Identify all interaction forces; Use Newton's Third Law for force pairs; Solve simultaneous equations; Consider constraints and connections; Examples: pulley systems, connected vehicles, stacked objects. Rotational Dynamics FBDs: Extended FBD shows object shape; Indicate force application points; Essential for torque calculations; Include pivot/reaction forces; Consider center of mass position; Examples: levers, rotating objects, balanced systems. Constrained Motion FBDs: Identify geometric constraints; Include constraint forces; Use appropriate coordinate systems; Consider degrees of freedom; Examples: objects on wires, mechanical linkages, guided motion. Fluid Environment FBDs: Include buoyancy force (opposes weight); Add drag force (opposes motion); Consider lift forces if relevant; Account for added mass effects; Examples: objects in air/water, falling with air resistance, submerged objects. Electromagnetic Force FBDs: Include electric forces on charges; Add magnetic forces on moving charges; Consider field directions; Use right-hand rules; Examples: charged particles in fields, current-carrying wires, electromagnetic devices. Non-Inertial Reference Frames: Include fictitious forces; Centrifugal force in rotating frames; Coriolis force for moving objects; Euler force for accelerating rotation; Examples: objects on merry-go-round, accelerating elevators. Problem-Solving Framework: Step 1: Identify system and draw FBD; Step 2: Choose coordinate system; Step 3: Resolve forces into components; Step 4: Apply Newton's Second Law (ΣF = ma); Step 5: Solve for unknowns; Step 6: Verify with physical reasoning. Advanced Analysis Techniques: Use FBD with energy methods; Combine with momentum principles; Apply to variable mass systems; Extend to continuous systems; Use computational approaches for complex systems.",
          "application": "Analyze complex multi-body systems using FBDs. Create extended FBDs for rotational problems. Handle constrained motion with proper FBDs. Include fluid and electromagnetic forces. Work with non-inertial reference frames. Use FBDs in comprehensive problem-solving frameworks.",
          "example": "Atwood machine: FBD for each mass showing weights and tension. Car on banked curve: FBD showing weight, normal, friction, with components for circular motion. Charged particle in uniform field: FBD showing electric/magnetic forces. Object in accelerating elevator: FBD including fictitious forces.",
          "analogy": "Like a master chess player analyzing a complex position - the FBD provides the complete 'board setup' showing all the pieces (forces) and their relationships, allowing you to plan multiple moves ahead (solve equations) and anticipate how the position (motion) will evolve, with advanced techniques needed for especially tricky positions (complex systems)",
          "image": {
            "url": "images/advanced-fbd-principles.png",
            "alt": "Advanced FBD principles",
            "caption": "Principles of advanced FBD applications"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Pulley System FBD Analysis",
          "problem": "Mass A (4 kg) on rough table (μ_k = 0.2), Mass B (6 kg) hanging, connected by string over pulley. Draw FBDs and identify all forces.",
          "step_by_step": [
            {
              "step": "FBD for Mass A (on table)",
              "explanation": "Dot for Mass A; Weight A: 39.2 N down; Normal force: 39.2 N up; Tension: right; Kinetic friction: left, f_k = μ_k N = 0.2 × 39.2 = 7.84 N"
            },
            {
              "step": "FBD for Mass B (hanging)",
              "explanation": "Dot for Mass B; Weight B: 58.8 N down; Tension: up"
            },
            {
              "step": "Newton's Third Law application",
              "explanation": "Tension on Mass A and Mass B equal magnitude (same string)"
            },
            {
              "step": "System motion analysis",
              "explanation": "Mass B heavier, so system accelerates with Mass B descending, Mass A moving right"
            },
            {
              "step": "Force magnitudes",
              "explanation": "Net force causes acceleration: (58.8 - 7.84) = 50.96 N for total mass 10 kg, a = 5.096 m/s²"
            },
            {
              "step": "Tension calculation",
              "explanation": "From Mass B: T = m_B(g - a) = 6(9.8 - 5.096) = 6 × 4.704 = 28.22 N"
            }
          ],
          "final_answer": "Mass A FBD: Weight (39.2 N ↓), Normal (39.2 N ↑), Tension (→), Friction (7.84 N ←); Mass B FBD: Weight (58.8 N ↓), Tension (↑); System accelerates with a = 5.10 m/s², T = 28.2 N",
          "concept_applied": "Pulley system FBD analysis",
          "image": {
            "url": "images/pulley-fbd.png",
            "alt": "Pulley system FBD example",
            "caption": "FBD analysis of pulley system"
          }
        },
        {
          "title": "Banked Curve FBD with Friction",
          "problem": "Car on banked curve (radius 50 m, bank angle 20°). Draw FBD showing all forces and their components for circular motion.",
          "step_by_step": [
            {
              "step": "Standard forces identification",
              "explanation": "Weight: vertically downward; Normal force: perpendicular to road surface; Friction: parallel to road surface"
            },
            {
              "step": "Coordinate system selection",
              "explanation": "Use banked coordinates: x horizontal toward center, y vertical, or inclined coordinates parallel/perpendicular to surface"
            },
            {
              "step": "Force resolution",
              "explanation": "Resolve normal force: N cosθ (vertical), N sinθ (horizontal toward center); Resolve friction: f cosθ (horizontal), f sinθ (vertical)"
            },
            {
              "step": "Circular motion requirements",
              "explanation": "Net horizontal force provides centripetal acceleration: mv²/r; Net vertical force = 0 (no vertical acceleration)"
            },
            {
              "step": "Friction direction",
              "explanation": "Friction can be up or down bank depending on speed; At design speed, no friction needed; Below design speed, friction up bank; Above design speed, friction down bank"
            },
            {
              "step": "Complete FBD",
              "explanation": "Car as dot; Weight down; Normal perpendicular to surface; Friction parallel to surface; Show components for equation setup"
            }
          ],
          "final_answer": "FBD shows: Weight (↓), Normal (perpendicular to surface), Friction (parallel to surface); Components: Normal has N cosθ (↑) and N sinθ (→); Friction components depend on speed relative to design speed",
          "concept_applied": "Banked curve FBD analysis",
          "image": {
            "url": "images/banked-curve-fbd.png",
            "alt": "Banked curve FBD example",
            "caption": "FBD for car on banked curve"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Free body diagram",
    "Normal force",
    "Friction",
    "Tension",
    "Weight",
    "Applied force",
    "Newton's Third Law",
    "Force components",
    "Contact forces",
    "Field forces",
    "System isolation",
    "Vector representation"
  ],

  "common_misconceptions": [
    "Thinking FBDs should include acceleration vectors",
    "Confusing weight with mass",
    "Including reaction forces on the same FBD",
    "Missing hidden forces like normal force",
    "Drawing forces in wrong directions",
    "Thinking friction always opposes motion (it opposes relative motion)"
  ],

  "real_world_applications": [
    "Structural engineering design and analysis",
    "Vehicle dynamics and safety systems",
    "Sports equipment design and performance",
    "Mechanical system design and optimization",
    "Construction crane and lifting safety",
    "Biomechanics and human movement analysis",
    "Aerospace vehicle design",
    "Robotics and automation systems",
    "Amusement ride safety analysis",
    "Product packaging and transportation safety"
  ],

  "summary": "Free body diagrams are essential visual tools in mechanics that represent all external forces acting on an object. Proper FBD construction involves systematic force identification, correct vector representation, and appropriate coordinate system selection. These diagrams serve as the foundation for applying Newton's Laws to solve mechanics problems, from simple single-object scenarios to complex multi-body systems. Mastering FBD techniques is crucial for success in AP Physics 1 and provides fundamental skills for all fields involving mechanical analysis."
}
