{
  "topic": "Newton's First Law",
  "unit_title": "Law of Inertia and Equilibrium",
  "unit_number": "Unit 2.2",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics 1",
  "duration": "2-3 hours",
  "difficulty_level": "introductory",
  "expanded_description": "Comprehensive study of Newton's First Law of Motion, focusing on the concept of inertia, equilibrium conditions, and applications to static systems. Essential foundation for understanding force-motion relationships and preparing for Newton's Second Law.",

  "learning_objectives": [
    "State and explain Newton's First Law of Motion",
    "Define and identify inertial reference frames",
    "Analyze objects in static equilibrium",
    "Apply Newton's First Law to solve equilibrium problems",
    "Distinguish between mass and weight",
    "Recognize inertial effects in everyday situations"
  ],

  "prerequisites": [
    "Force identification skills",
    "Free body diagram construction",
    "Vector addition concepts",
    "Basic algebra skills",
    "Understanding of velocity and acceleration"
  ],

  "core_concept": {
    "principle": "Newton's First Law Fundamentals: Law of inertia, Equilibrium conditions, Inertial reference frames, Net force concept, Mass as inertia measure, Static analysis, Force balance.",
    "explanation": "Newton's First Law states that objects maintain their state of motion unless acted upon by a net external force, introducing the fundamental concepts of inertia and equilibrium.",
    "image": {
      "url": "images/newton-first-core.png",
      "alt": "Newton's First Law core concepts",
      "caption": "Fundamental principles of Newton's First Law and inertia"
    }
  },

  "sections": [
    {
      "section_title": "1. Newton's First Law and Inertia",
      "introduction": "Understanding the fundamental concepts of inertia and the relationship between forces and changes in motion state.",

      "key_concept": {
        "definition": "Law of inertia, Inertia definition, Mass as inertia measure, State of motion, Net external force, Natural motion, Resistance to change.",
        "context": "Newton's First Law establishes that objects naturally maintain their current state of motion, with inertia representing the resistance to changes in that motion state.",
        "image": {
          "url": "images/inertia-concepts.png",
          "alt": "Inertia concepts",
          "caption": "Concept of inertia and resistance to motion change"
        }
      },

      "classifications": [
        {
          "type": "Inertia Manifestations",
          "value": "Classification based on how inertia appears in different motion states",
          "characteristics": [
            "Rest inertia",
            "Constant velocity inertia",
            "Directional inertia",
            "Rotational inertia",
            "Mass dependence",
            "Acceleration resistance"
          ],
          "behavior": "Inertia manifests differently depending on the object's current motion state but always represents resistance to changes in that state",
          "examples": [
            {
              "process": "Rest Inertia Demonstration",
              "explanation": "Objects at rest tend to remain at rest unless acted upon by net force",
              "image": {
                "url": "images/rest-inertia.png",
                "alt": "Rest inertia",
                "caption": "Inertia of objects at rest"
              }
            },
            {
              "process": "Motion Inertia Analysis",
              "explanation": "Objects in motion tend to maintain constant velocity unless acted upon",
              "image": {
                "url": "images/motion-inertia.png",
                "alt": "Motion inertia",
                "caption": "Inertia of objects in motion"
              }
            }
          ],
          "note": "Key principles: Inertia is measured by mass; All objects have inertia; Inertia depends only on mass, not speed; Inertia resists all motion changes: starting, stopping, turning, speeding up, slowing down."
        }
      ],

      "principles": [
        {
          "principle": "Newton's First Law and Inertia Concepts",
          "statement": "Newton's First Law establishes the fundamental relationship between force and motion through the concept of inertia: Formal Statement: 'Every object continues in its state of rest, or of uniform motion in a straight line, unless compelled to change that state by forces impressed upon it.' Inertia Definition: The tendency of objects to resist changes in their state of motion; Not a force itself, but a property of matter; Measured by mass (kg); More mass = more inertia. Key Implications: No net force needed to maintain constant velocity; Net force required to change motion state; Objects 'want' to keep doing what they're already doing; Force causes acceleration, not motion. Mass vs Weight: Mass: measure of inertia (kg), scalar quantity, constant everywhere; Weight: gravitational force (N), vector quantity, depends on location; Relationship: Weight = mass × gravitational acceleration. Inertial Reference Frames: Frames where Newton's First Law holds; Non-accelerating reference frames; Earth's surface is approximately inertial for most purposes; Accelerating frames require fictitious forces. Everyday Examples: Car suddenly stopping: passengers continue forward; Car turning: passengers feel pushed outward; Tablecloth trick: objects remain stationary; Ice skating: gliding continues with little force. Historical Context: Aristotle: force needed to maintain motion; Galileo: introduced concept of inertia; Newton: formalized as first law; Einstein: extended to general relativity. Common Misconceptions: Objects need constant force to keep moving; Force causes motion (rather than acceleration); Inertia is a force; Heavier objects fall faster (they don't - Galileo's experiment).",
          "application": "Identify situations where Newton's First Law applies. Explain inertial effects in everyday life. Distinguish between mass and weight. Recognize inertial reference frames. Analyze why objects maintain their motion state. Apply inertia concepts to predict motion behavior.",
          "example": "Coffee cup on car dashboard: when car accelerates, cup slides backward (tends to remain at rest relative to ground). Hockey puck on ice: continues sliding with nearly constant velocity. Book on table: remains at rest until pushed.",
          "analogy": "Like a stubborn person set in their ways - an object at rest is like someone who doesn't want to get up and start moving, while an object in motion is like someone who doesn't want to stop or change direction once they're going, with the 'stubbornness' (inertia) depending on their 'personality' (mass)",
          "image": {
            "url": "images/first-law-principles.png",
            "alt": "First Law principles",
            "caption": "Principles of Newton's First Law and inertia"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing Inertia in Vehicle Motion",
          "problem": "A passenger is sitting in a car. Describe what the passenger experiences and why according to Newton's First Law when: (a) Car accelerates from rest, (b) Car brakes suddenly, (c) Car turns left.",
          "step_by_step": [
            {
              "step": "Case (a): Car accelerates from rest",
              "explanation": "Passenger tends to remain at rest while car seat pushes forward; Passenger feels pressed back into seat; Inertia resists starting motion"
            },
            {
              "step": "Case (b): Car brakes suddenly",
              "explanation": "Passenger tends to continue forward motion while car slows; Passenger feels thrown forward; Seatbelt provides stopping force; Inertia resists stopping motion"
            },
            {
              "step": "Case (c): Car turns left",
              "explanation": "Passenger tends to continue straight while car turns left; Passenger feels pushed to the right; Door provides centripetal force; Inertia resists direction change"
            },
            {
              "step": "Newton's First Law application",
              "explanation": "In each case, passenger maintains original motion state until external force acts"
            },
            {
              "step": "Safety implications",
              "explanation": "Seatbelts, airbags, and crumple zones all work with/against inertia to protect passengers"
            }
          ],
          "final_answer": "(a) Pressed backward - resists starting motion; (b) Thrown forward - resists stopping motion; (c) Pushed right - resists direction change. All demonstrate inertia maintaining original motion state.",
          "concept_applied": "Inertia analysis in vehicle motion",
          "image": {
            "url": "images/vehicle-inertia.png",
            "alt": "Vehicle inertia example",
            "caption": "Inertia effects in vehicle motion"
          }
        },
        {
          "title": "Mass vs Weight Distinction",
          "problem": "An astronaut has mass 80 kg on Earth. Find: (a) Weight on Earth (g = 9.8 m/s²), (b) Mass on Moon, (c) Weight on Moon (g = 1.6 m/s²), (d) Explain why mass is constant but weight changes.",
          "step_by_step": [
            {
              "step": "Weight on Earth",
              "explanation": "W_earth = m × g_earth = 80 × 9.8 = 784 N"
            },
            {
              "step": "Mass on Moon",
              "explanation": "Mass is constant everywhere = 80 kg"
            },
            {
              "step": "Weight on Moon",
              "explanation": "W_moon = m × g_moon = 80 × 1.6 = 128 N"
            },
            {
              "step": "Mass vs weight explanation",
              "explanation": "Mass measures amount of matter/inertia; Weight measures gravitational force; Mass constant, weight depends on gravitational field strength"
            },
            {
              "step": "Inertia implications",
              "explanation": "Astronaut has same inertia on Moon (same mass) but feels lighter (less weight)"
            }
          ],
          "final_answer": "(a) Weight on Earth = 784 N, (b) Mass on Moon = 80 kg, (c) Weight on Moon = 128 N, (d) Mass measures inertia (constant), weight measures gravitational force (varies with location).",
          "concept_applied": "Mass vs weight distinction",
          "image": {
            "url": "images/mass-weight.png",
            "alt": "Mass vs weight example",
            "caption": "Distinction between mass and weight"
          }
        }
      ]
    },
    {
      "section_title": "2. Equilibrium Conditions and Analysis",
      "introduction": "Applying Newton's First Law to analyze systems in equilibrium where the net force equals zero.",

      "key_concept": {
        "definition": "Static equilibrium, Dynamic equilibrium, Net force zero, Force balance, Equilibrium equations, Support forces, Constraint conditions, Stability analysis.",
        "context": "Equilibrium occurs when all forces on an object are balanced, resulting in zero net force and constant velocity (which includes the special case of zero velocity).",
        "image": {
          "url": "images/equilibrium-concepts.png",
          "alt": "Equilibrium concepts",
          "caption": "Conditions and analysis of equilibrium systems"
        }
      },

      "classifications": [
        {
          "type": "Equilibrium Types",
          "value": "Classification based on motion state and force conditions",
          "characteristics": [
            "Static equilibrium",
            "Dynamic equilibrium",
            "Translational equilibrium",
            "Rotational equilibrium",
            "Stable equilibrium",
            "Unstable equilibrium"
          ],
          "behavior": "Different equilibrium types have distinct characteristics but all satisfy the fundamental condition of zero net force",
          "examples": [
            {
              "process": "Static Equilibrium Analysis",
              "explanation": "Analyzing objects at rest with all forces balanced",
              "image": {
                "url": "images/static-equilibrium.png",
                "alt": "Static equilibrium",
                "caption": "Analysis of static equilibrium"
              }
            },
            {
              "process": "Dynamic Equilibrium Application",
              "explanation": "Analyzing objects moving with constant velocity",
              "image": {
                "url": "images/dynamic-equilibrium.png",
                "alt": "Dynamic equilibrium",
                "caption": "Application to dynamic equilibrium"
              }
            }
          ],
          "note": "Equilibrium conditions: Net force = 0 (ΣF = 0); Constant velocity (including v = 0); For extended objects: net torque = 0 also required; All force components must balance separately."
        }
      ],

      "principles": [
        {
          "principle": "Equilibrium Conditions and Analysis",
          "statement": "Newton's First Law provides the mathematical foundation for analyzing systems in equilibrium through force balance equations: Equilibrium Definition: State where net external force = 0; Object maintains constant velocity; Special case: static equilibrium (velocity = 0). Mathematical Formulation: Vector form: ΣF⃗ = 0; Component form: ΣF_x = 0 and ΣF_y = 0; For 3D: ΣF_z = 0 also; Each direction independent. Static Equilibrium: Object at rest; All forces balanced; Common examples: buildings, bridges, furniture, stationary objects; Requires net force = 0 and net torque = 0 for extended objects. Dynamic Equilibrium: Object moving with constant velocity; All forces balanced; Common examples: car at constant speed, terminal velocity, orbiting satellites; Acceleration = 0. Problem-Solving Approach: Step 1: Draw free body diagram; Step 2: Choose coordinate system; Step 3: Resolve forces into components; Step 4: Apply ΣF_x = 0 and ΣF_y = 0; Step 5: Solve for unknowns; Step 6: Verify solution. Common Equilibrium Situations: Object on level surface: weight = normal force; Object on incline: components balance; Hanging object: tension = weight; Multiple support points: forces distribute; Connected systems: tension relationships. Extended Objects: Require both translational and rotational equilibrium; Net force = 0 and net torque = 0; Center of mass considerations; Support force distributions. Stability Concepts: Stable equilibrium: returns to equilibrium after small displacement; Unstable equilibrium: moves away after small displacement; Neutral equilibrium: stays in new position after displacement.",
          "application": "Identify systems in equilibrium. Apply ΣF = 0 conditions to solve problems. Distinguish between static and dynamic equilibrium. Solve for unknown forces in balanced systems. Analyze multi-force equilibrium situations. Verify equilibrium conditions mathematically.",
          "example": "Book on table: weight down = normal force up. Car at constant speed: engine force forward = friction/drag backward. Chandelier hanging: tension up = weight down. Object on incline: normal force components balance weight components.",
          "analogy": "Like a perfectly balanced scale - when all the forces 'balance out' to zero net effect, the object maintains its current state, whether that's sitting perfectly still (static) or moving steadily without change (dynamic), just as a scale stays balanced when weights are equal on both sides",
          "image": {
            "url": "images/equilibrium-principles.png",
            "alt": "Equilibrium principles",
            "caption": "Principles of equilibrium analysis"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Static Equilibrium on Level Surface",
          "problem": "A 10 kg box rests on a horizontal floor. (a) Draw FBD, (b) Calculate all forces, (c) If pushed with 40 N horizontal force but doesn't move, find friction force.",
          "step_by_step": [
            {
              "step": "FBD construction",
              "explanation": "Box as dot; Weight downward: W = mg = 10 × 9.8 = 98 N; Normal force upward; No other forces initially"
            },
            {
              "step": "Force calculation at rest",
              "explanation": "ΣF_y = 0: N - W = 0, so N = 98 N; ΣF_x = 0 (no horizontal forces)"
            },
            {
              "step": "With 40 N push but no motion",
              "explanation": "Add applied force: 40 N to right; Add static friction: to left; Still ΣF_x = 0 and ΣF_y = 0"
            },
            {
              "step": "Friction force calculation",
              "explanation": "ΣF_x = 0: 40 - f_s = 0, so f_s = 40 N"
            },
            {
              "step": "Maximum static friction check",
              "explanation": "f_s ≤ μ_s N; Here 40 N ≤ μ_s × 98, so μ_s ≥ 0.41"
            },
            {
              "step": "Equilibrium verification",
              "explanation": "All forces balanced: vertical: 98 N up = 98 N down; horizontal: 40 N right = 40 N left"
            }
          ],
          "final_answer": "(a) FBD: Weight (98 N ↓), Normal (98 N ↑), Applied (40 N →), Friction (40 N ←); (b) At rest: N = 98 N; (c) With push: f_s = 40 N (static friction balances applied force)",
          "concept_applied": "Static equilibrium analysis",
          "image": {
            "url": "images/static-equilibrium-example.png",
            "alt": "Static equilibrium example",
            "caption": "Static equilibrium on level surface"
          }
        },
        {
          "title": "Equilibrium on Inclined Plane",
          "problem": "A 5 kg block rests on a 30° frictionless incline. Find: (a) Normal force, (b) Why block doesn't slide, (c) Required friction if incline had friction.",
          "step_by_step": [
            {
              "step": "Force components",
              "explanation": "Weight: mg = 5 × 9.8 = 49 N; Parallel to incline: mg sin30° = 49 × 0.5 = 24.5 N; Perpendicular: mg cos30° = 49 × 0.866 = 42.4 N"
            },
            {
              "step": "Normal force calculation",
              "explanation": "ΣF_perpendicular = 0: N - mg cos30° = 0; N = 42.4 N"
            },
            {
              "step": "Frictionless case analysis",
              "explanation": "ΣF_parallel = mg sin30° = 24.5 N ≠ 0; But problem says block at rest - this is impossible on frictionless incline! Must be held by other force"
            },
            {
              "step": "Correction with friction",
              "explanation": "Assume friction present: ΣF_parallel = 0: mg sin30° - f_s = 0; f_s = 24.5 N"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Static friction provides exactly 24.5 N up incline to balance gravity component"
            },
            {
              "step": "Coefficient requirement",
              "explanation": "f_s ≤ μ_s N; 24.5 ≤ μ_s × 42.4; μ_s ≥ 0.578"
            }
          ],
          "final_answer": "(a) Normal force = 42.4 N; (b) Block doesn't slide because static friction = 24.5 N balances gravity component; (c) Required friction = 24.5 N up incline, requiring μ_s ≥ 0.578",
          "concept_applied": "Inclined plane equilibrium",
          "image": {
            "url": "images/incline-equilibrium.png",
            "alt": "Incline equilibrium example",
            "caption": "Equilibrium on inclined plane"
          }
        }
      ]
    },
    {
      "section_title": "3. Applications and Problem Solving",
      "introduction": "Applying Newton's First Law to solve practical problems and analyze real-world equilibrium situations.",

      "key_concept": {
        "definition": "Practical applications, Multi-body systems, Constraint forces, Real-world scenarios, Problem-solving strategies, Force measurement, System analysis, Engineering applications.",
        "context": "Newton's First Law finds extensive applications in analyzing structures, vehicles, sports, and everyday situations where forces are balanced and motion is unchanging.",
        "image": {
          "url": "images/first-law-applications.png",
          "alt": "First Law applications",
          "caption": "Practical applications of Newton's First Law"
        }
      },

      "classifications": [
        {
          "type": "Application Domains",
          "value": "Classification based on practical contexts and system types",
          "characteristics": [
            "Structural analysis",
            "Vehicle dynamics",
            "Sports mechanics",
            "Everyday phenomena",
            "Biological systems",
            "Engineering design"
          ],
          "behavior": "Different application domains present unique equilibrium scenarios requiring specialized analysis approaches but all rely on the fundamental principle of force balance",
          "examples": [
            {
              "process": "Structural Force Analysis",
              "explanation": "Analyzing forces in buildings, bridges, and mechanical structures",
              "image": {
                "url": "images/structural-analysis.png",
                "alt": "Structural analysis",
                "caption": "Force analysis in structural systems"
              }
            },
            {
              "process": "Vehicle Equilibrium Applications",
              "explanation": "Applying equilibrium concepts to analyze vehicles at constant speed",
              "image": {
                "url": "images/vehicle-equilibrium.png",
                "alt": "Vehicle equilibrium",
                "caption": "Equilibrium applications in vehicle dynamics"
              }
            }
          ],
          "note": "Application strategies: Identify all interaction points; Use appropriate coordinate systems; Consider constraint conditions; Verify force directions; Check mathematical consistency; Interpret physical meaning."
        }
      ],

      "principles": [
        {
          "principle": "Practical Applications and Problem-Solving",
          "statement": "Newton's First Law provides powerful analytical tools for solving real-world problems across various domains: Structural Engineering: Buildings and bridges in static equilibrium; Force distribution analysis; Support reaction calculations; Safety factor determinations; Load capacity assessments. Vehicle Dynamics: Cars at constant speed: engine force = total resistance; Aircraft in level flight: lift = weight, thrust = drag; Ships in steady motion: propulsion = water resistance; Bicycles: pedaling force = rolling + air resistance. Sports Applications: Archery: bow forces balanced at full draw; Diving: body position adjustments for entry; Gymnastics: static positions on apparatus; Weightlifting: supporting heavy weights stationary. Everyday Phenomena: Furniture placement: stable equilibrium positions; Stacking objects: force distributions; Hanging pictures: wire tension calculations; Elevators: cable tension at constant speed. Biological Systems: Human posture: muscle forces balancing gravity; Animal locomotion: constant speed running; Plant structures: supporting their own weight; Cell mechanics: internal force balances. Multi-Body Systems: Pulley systems: tension relationships; Connected objects: interaction forces; Stacked blocks: normal force distributions; Hanging systems: cable and support forces. Measurement Applications: Spring scales: measure force by equilibrium; Balances: compare masses through force balance; Force tables: experimental equilibrium verification; Strain gauges: measure deformation from forces. Problem-Solving Framework: Systematic approach: 1) Identify system and draw FBD, 2) Apply ΣF = 0 conditions, 3) Solve equations, 4) Verify physically; Multiple methods: component resolution, vector addition, symmetry arguments; Verification: dimensional analysis, limiting cases, alternative approaches.",
          "application": "Analyze forces in structural systems. Solve vehicle equilibrium problems. Apply to sports and biological systems. Handle multi-body equilibrium situations. Use equilibrium for force measurements. Implement systematic problem-solving approaches.",
          "example": "Bridge analysis: support forces balance traffic loads. Airplane cruising: lift = weight, thrust = drag. Weightlifter holding barbell: muscle forces = barbell weight. Hanging sign: cable tensions balance sign weight.",
          "analogy": "Like a financial budget in perfect balance - when income exactly equals expenses (net force = 0), your bank account remains constant (constant velocity), whether it's sitting at zero (static) or maintaining a steady positive balance (dynamic), with Newton's First Law providing the 'accounting principles' for analyzing the 'financial forces'",
          "image": {
            "url": "images/applications-principles.png",
            "alt": "Applications principles",
            "caption": "Principles of practical applications"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Hanging Sign Equilibrium",
          "problem": "A 20 kg sign hangs from two cables: Cable A at 30° left, Cable B at 45° right. Find tensions in both cables.",
          "step_by_step": [
            {
              "step": "FBD and known forces",
              "explanation": "Sign as point; Weight: W = 20 × 9.8 = 196 N down; Tension A: T_A at 30° left of vertical; Tension B: T_B at 45° right of vertical"
            },
            {
              "step": "Coordinate system",
              "explanation": "x horizontal, y vertical; Up and right positive"
            },
            {
              "step": "Force components",
              "explanation": "T_A: T_Ax = -T_A sin30° = -0.5T_A; T_Ay = T_A cos30° = 0.866T_A; T_B: T_Bx = T_B sin45° = 0.707T_B; T_By = T_B cos45° = 0.707T_B; Weight: W_y = -196 N"
            },
            {
              "step": "Equilibrium equations",
              "explanation": "ΣF_x = 0: -0.5T_A + 0.707T_B = 0; ΣF_y = 0: 0.866T_A + 0.707T_B - 196 = 0"
            },
            {
              "step": "Solve system",
              "explanation": "From ΣF_x: T_B = (0.5/0.707)T_A = 0.707T_A; Substitute into ΣF_y: 0.866T_A + 0.707(0.707T_A) = 196; 0.866T_A + 0.5T_A = 196; 1.366T_A = 196; T_A = 143.5 N"
            },
            {
              "step": "Find T_B",
              "explanation": "T_B = 0.707 × 143.5 = 101.4 N"
            },
            {
              "step": "Verification",
              "explanation": "Check ΣF_y: 0.866×143.5 + 0.707×101.4 = 124.3 + 71.7 = 196 N ✓"
            }
          ],
          "final_answer": "Tension in cable A = 143.5 N, Tension in cable B = 101.4 N. Cables share weight according to their angles.",
          "concept_applied": "Multi-force equilibrium",
          "image": {
            "url": "images/hanging-sign.png",
            "alt": "Hanging sign example",
            "caption": "Equilibrium of hanging sign"
          }
        },
        {
          "title": "Car at Constant Speed Analysis",
          "problem": "A 1500 kg car moves at constant 25 m/s on level road. Total resistance forces = 400 N. Find: (a) Engine force, (b) Normal forces if wheelbase 2.5 m, CG 0.5 m high, 1.0 m from front axle.",
          "step_by_step": [
            {
              "step": "Constant speed condition",
              "explanation": "ΣF_x = 0: Engine force - Resistance = 0; F_engine = 400 N"
            },
            {
              "step": "Vertical forces",
              "explanation": "Weight: W = 1500 × 9.8 = 14700 N; Normal forces: N_front + N_rear = 14700 N"
            },
            {
              "step": "Torque equilibrium (optional advanced)",
              "explanation": "Take moments about rear axle: N_front × 2.5 - W × 1.5 + F_engine × 0.5 = 0"
            },
            {
              "step": "Solve for normal forces",
              "explanation": "N_front × 2.5 - 14700 × 1.5 + 400 × 0.5 = 0; N_front × 2.5 - 22050 + 200 = 0; N_front × 2.5 = 21850; N_front = 8740 N"
            },
            {
              "step": "Find rear normal force",
              "explanation": "N_rear = 14700 - 8740 = 5960 N"
            },
            {
              "step": "Interpretation",
              "explanation": "More weight on front wheels due to engine force creating torque"
            }
          ],
          "final_answer": "(a) Engine force = 400 N (balances resistance); (b) Normal forces: Front = 8740 N, Rear = 5960 N (distribution affected by engine torque)",
          "concept_applied": "Vehicle equilibrium analysis",
          "image": {
            "url": "images/car-equilibrium.png",
            "alt": "Car equilibrium example",
            "caption": "Vehicle equilibrium at constant speed"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Newton's First Law",
    "Inertia",
    "Equilibrium",
    "Net force",
    "Static equilibrium",
    "Dynamic equilibrium",
    "Mass",
    "Weight",
    "Inertial reference frame",
    "Force balance",
    "Constant velocity",
    "State of motion"
  ],

  "common_misconceptions": [
    "Thinking force is needed to maintain constant velocity",
    "Confusing mass with weight",
    "Believing inertia is a force",
    "Thinking heavier objects fall faster",
    "Confusing balanced forces with no forces",
    "Believing objects stop moving when force is removed"
  ],

  "real_world_applications": [
    "Vehicle safety system design (seatbelts, airbags)",
    "Structural engineering and building design",
    "Sports equipment and technique optimization",
    "Spacecraft trajectory planning",
    "Furniture and product design for stability",
    "Amusement ride safety analysis",
    "Human biomechanics and ergonomics",
    "Transportation system design",
    "Weight measurement and scale design",
    "Package handling and shipping safety"
  ],

  "summary": "Newton's First Law establishes the fundamental principle of inertia - that objects maintain their state of motion unless acted upon by a net external force. This introduces the concepts of mass as a measure of inertia, equilibrium conditions where net force equals zero, and the distinction between static and dynamic equilibrium. The law provides the foundation for analyzing force balance in various practical situations, from everyday objects at rest to vehicles moving at constant speed. Mastery of Newton's First Law is essential for understanding more complex force-motion relationships in AP Physics 1."
}
