{
  "course": "AP Physics 1",
  "topic": "Fluid Mechanics",
  "problems": [
    {
      "number": 1,
      "problem": "Two substances — mercury with a density of $\\rho_{\\text{Hg}} = 13600 \\, \\text{kg/m}^3$ and alcohol with a density of $\\rho_{\\text{alc}} = 800 \\, \\text{kg/m}^3$ — are selected for an experiment.\n\nIf the experiment requires equal masses of each liquid, what is the ratio of the volume of alcohol to the volume of mercury?\n\n**Options:**\n\n(A) 1/15\n(B) 1/17\n(C) 1/13\n(D) 1/10\n(E) 17/1",
      "image": null,
      "step_by_step": [
        {
          "step": "Mass–density–volume relationship",
          "explanation": "The fundamental relationship is: mass = density × volume, or $m = \\rho V$. Since the experiment requires equal masses of each liquid, we have $m_{\\text{Hg}} = m_{\\text{alc}}$."
        },
        {
          "step": "Set up equality",
          "explanation": "Substitute the mass expression: $\\rho_{\\text{Hg}} V_{\\text{Hg}} = \\rho_{\\text{alc}} V_{\\text{alc}}$. This equation states that the product of density and volume for mercury equals that for alcohol."
        },
        {
          "step": "Solve for volume ratio $V_{\\text{alc}} / V_{\\text{Hg}}$",
          "explanation": "Rearrange the equation to isolate the volume ratio: $\\frac{V_{\\text{alc}}}{V_{\\text{Hg}}} = \\frac{\\rho_{\\text{Hg}}}{\\rho_{\\text{alc}}}$. Notice that the ratio of volumes is the inverse of the ratio of densities when masses are equal."
        },
        {
          "step": "Substitute given densities",
          "explanation": "Plug in the given values: $\\frac{V_{\\text{alc}}}{V_{\\text{Hg}}} = \\frac{13600 \\, \\text{kg/m}^3}{800 \\, \\text{kg/m}^3} = 17$. The alcohol volume is 17 times larger than the mercury volume for equal masses."
        },
        {
          "step": "Interpret the result",
          "explanation": "This result makes physical sense: alcohol is much less dense than mercury (800 kg/m³ vs. 13600 kg/m³), so you need a much larger volume of alcohol to achieve the same mass. The density ratio of 17:1 directly translates to an inverse volume ratio of 1:17 for equal masses, but the question asks for the ratio of alcohol volume to mercury volume, which is 17:1."
        },
        {
          "step": "Match to answer choices",
          "explanation": "The calculated ratio 17 corresponds to 17/1, which is option (E)."
        }
      ],
      "final_answer": "(E) 17/1"
    },
    {
      "number": 2,
      "problem": "A metal sample is suspended from a thread and submerged in a beaker of water. The metal sample does not touch the sides or bottom of the beaker. The beaker of water is on a laboratory scale as the metal sample is submerged.\n\nWhat happens to the scale reading as the sample is submerged?\n\nOptions:\n\n- The scale reading decreases\n- The scale reading first decreases then increases\n- The scale reading first increases then decreases\n- The scale reading does not change\n- The scale reading increases",
      "image": null,
      "step_by_step": [
        {
          "step": "Understand the physical setup",
          "explanation": "The metal sample is hung from a thread, so its weight is supported by the thread, not by the scale. Initially, before submersion, the scale measures only the weight of the beaker and water. When the sample is submerged, it displaces water and experiences a buoyant force."
        },
        {
          "step": "Apply Newton's Third Law",
          "explanation": "The buoyant force is an upward force exerted by the water on the metal. According to Newton's Third Law, the metal exerts an equal and opposite downward force on the water. This downward reaction force acts on the water and is transmitted through the water to the beaker and then to the scale."
        },
        {
          "step": "Consider the system perspective",
          "explanation": "Before submersion, scale reading = weight of beaker + weight of water. After submersion, the scale must support the additional downward force from the metal on the water. This additional force equals the magnitude of the buoyant force, which is equal to the weight of the water displaced by the metal (Archimedes' principle)."
        },
        {
          "step": "Relate buoyant force to displaced water",
          "explanation": "Buoyant force $F_B = \\rho_{\\text{water}} g V_{\\text{submerged}}$, where $V_{\\text{submerged}}$ is the volume of the metal sample. This force is added to the scale reading because the water is pushed downward by the metal with force $F_B$."
        },
        {
          "step": "Eliminate incorrect options",
          "explanation": "The scale reading increases by exactly the weight of the displaced water. It does not decrease, because the metal's weight is still supported by the thread, not removed from the scale. There is no transient 'first decreases then increases' behavior if the submersion is smooth. The reading simply increases and stays increased."
        }
      ],
      "final_answer": "The scale reading increases"
    },
    {
      "number": 3,
      "problem": "A student claims that when an ideal fluid flows through a constricted section of pipe, its density must increase to maintain the same mass flow rate. Which of the following best evaluates this claim?\n\n- A The claim is correct; density must increase with pressure\n- B The claim is correct; mass conservation requires it\n- C The claim is incorrect; density decreases in constrictions\n- D The claim is incorrect; ideal fluids are incompressible",
      "image": null,
      "step_by_step": [
        {
          "step": "Recall definition of ideal fluid",
          "explanation": "In the context of AP Physics, an ideal fluid is typically defined as incompressible (constant density) and nonviscous. This simplification allows use of the continuity equation and Bernoulli's equation without accounting for density changes."
        },
        {
          "step": "Apply continuity equation",
          "explanation": "The continuity equation for fluid flow is $A_1 v_1 = A_2 v_2$ for an incompressible fluid, where $A$ is cross-sectional area and $v$ is flow speed. More generally, mass flow rate is $\\dot{m} = \\rho A v$. For an incompressible fluid ($\\rho$ constant), mass conservation requires $A_1 v_1 = A_2 v_2$."
        },
        {
          "step": "Analyze the student's claim",
          "explanation": "The student claims density must increase in a constriction to maintain mass flow rate. This would be true if the fluid were compressible and the speed remained constant. However, for an ideal incompressible fluid, density is constant regardless of pressure or pipe geometry. In a constriction, the speed increases to maintain the same volume flow rate (and hence mass flow rate since density is constant)."
        },
        {
          "step": "Evaluate each answer choice",
          "explanation": "A: Incorrect – While pressure may increase in a constriction for some flows, ideal fluids are incompressible, so density does not change with pressure.\nB: Incorrect – Mass conservation does require constant mass flow rate, but for an ideal fluid, this is achieved by speed changes, not density changes.\nC: Incorrect – Density doesn't decrease either; it remains constant.\nD: Correct – The key point is that ideal fluids are modeled as incompressible, so density is constant throughout the flow."
        }
      ],
      "final_answer": "D The claim is incorrect; ideal fluids are incompressible"
    },
    {
      "number": 4,
      "problem": "Suppose that two identical objects are submerged in water. Object A is submerged at a distance of 5 m below the surface, whereas Object B is submerged at a distance of 10 m below the surface.\n\nHow does the buoyant force experienced by each object differ?\n\nPossible Answers:\n\n- The buoyant force experienced by each object is the same\n- The buoyant force experienced by Object A is twice that experienced by Object B\n- The buoyant force experienced by Object B is twice that experienced by Object A\n- We need to know the atmospheric pressure to find out the relative buoyant forces on each object",
      "image": null,
      "step_by_step": [
        {
          "step": "Recall Archimedes' principle",
          "explanation": "Archimedes' principle states: The buoyant force on an object immersed in a fluid is equal to the weight of the fluid displaced by the object. Mathematically, $F_B = \\rho_{\\text{fluid}} V_{\\text{displaced}} g$."
        },
        {
          "step": "Identify what factors determine buoyant force",
          "explanation": "For a fully submerged object, $V_{\\text{displaced}}$ equals the object's own volume. Both objects are identical, so they have the same volume. Both are submerged in the same fluid (water), so $\\rho_{\\text{fluid}}$ is the same. Gravitational acceleration $g$ is the same. Therefore, all terms in $F_B = \\rho_{\\text{fluid}} V g$ are identical for both objects."
        },
        {
          "step": "Consider effect of depth on pressure",
          "explanation": "While hydrostatic pressure increases with depth ($P = P_{\\text{atm}} + \\rho g h$), the buoyant force is the net upward force resulting from the pressure difference between the top and bottom of the object. For a fully submerged object of uniform horizontal cross-section, this pressure difference is $\\Delta P = \\rho g (\\text{height of object})$, independent of absolute depth. Since the objects are identical, their heights are the same, so the pressure difference (and thus buoyant force) is the same regardless of depth."
        },
        {
          "step": "Evaluate each answer choice",
          "explanation": "First choice: Correct – Buoyant force is the same because it depends only on fluid density, object volume, and g, none of which vary with depth for identical objects in the same fluid.\nSecond and third choices: Incorrect – Depth does not double or halve the buoyant force.\nFourth choice: Incorrect – Atmospheric pressure contributes equally to the pressure on top and bottom of the object, so it cancels out in the buoyant force calculation. The buoyant force depends only on the density difference created by the fluid's weight."
        }
      ],
      "final_answer": "The buoyant force experienced by each object is the same"
    },
    {
      "number": 5,
      "problem": "If the area is halved while force remains constant, what is the effect on pressure?\n\n- A Pressure doubles\n- B Pressure quadruples\n- C Pressure remains constant\n- D Pressure halves",
      "image": null,
      "step_by_step": [
        {
          "step": "Recall definition of pressure",
          "explanation": "Pressure is defined as force per unit area: $P = \\frac{F}{A}$, where $F$ is the magnitude of the force component perpendicular to the surface, and $A$ is the area over which the force is distributed."
        },
        {
          "step": "Analyze changes given",
          "explanation": "The problem states that the force $F$ remains constant, while the area $A$ is halved. So if initial area is $A$, the new area is $A_{\\text{new}} = \\frac{A}{2}$."
        },
        {
          "step": "Calculate new pressure",
          "explanation": "Initial pressure: $P = \\frac{F}{A}$. New pressure: $P_{\\text{new}} = \\frac{F}{A_{\\text{new}}} = \\frac{F}{A/2} = 2 \\times \\frac{F}{A} = 2P$."
        },
        {
          "step": "Interpret the result",
          "explanation": "Halving the area while keeping force constant doubles the pressure. This is because the same force is concentrated over half the area, resulting in twice the force per unit area."
        },
        {
          "step": "Check answer choices",
          "explanation": "A: Correct – Pressure doubles.\nB: Incorrect – Pressure would quadruple if area were quartered.\nC: Incorrect – Pressure changes when area changes with constant force.\nD: Incorrect – Pressure would halve if area doubled with constant force."
        }
      ],
      "final_answer": "A Pressure doubles"
    },
    {
      "number": 6,
      "problem": "Suppose that two different balls of equal volume are submerged and held in a container of water.\n\n- Ball A has a density of 0.4 g/cm³\n- Ball B has a density of 0.6 g/cm³\n\nAfter the two balls are released, both of them begin to accelerate upward toward the surface.\n\n**Question:**\n\nWhich ball is expected to accelerate faster?\n\nPossible Answers:\n\n- There is no way to determine the relative acceleration of the two balls\n- Neither ball will accelerate\n- Ball A and Ball B will have the same acceleration\n- Ball A will have greater acceleration\n- Ball B will have greater acceleration",
      "image": null,
      "step_by_step": [
        {
          "step": "Recall buoyant force formula",
          "explanation": "The buoyant force on a fully submerged object is $F_B = \\rho_{\\text{fluid}} V g$, where $V$ is the volume of the object (same for both balls since they have equal volume)."
        },
        {
          "step": "Write weight of each ball",
          "explanation": "Weight $W = \\rho_{\\text{ball}} V g$. So $W_A = \\rho_A V g$ and $W_B = \\rho_B V g$."
        },
        {
          "step": "Net upward force on each",
          "explanation": "When released, the net force acting on each ball is $F_{\\text{net}} = F_B - W = (\\rho_{\\text{water}} - \\rho_{\\text{ball}}) V g$, assuming upward is positive. Since both densities are less than water's density (1.0 g/cm³), the net force is upward for both."
        },
        {
          "step": "Calculate acceleration using Newton's second law",
          "explanation": "Mass of each ball: $m = \\rho_{\\text{ball}} V$. Acceleration $a = F_{\\text{net}} / m = \\frac{(\\rho_{\\text{water}} - \\rho_{\\text{ball}}) V g}{\\rho_{\\text{ball}} V} = \\frac{\\rho_{\\text{water}} - \\rho_{\\text{ball}}}{\\rho_{\\text{ball}}} g$."
        },
        {
          "step": "Compare accelerations",
          "explanation": "For Ball A ($\\rho_A = 0.4$ g/cm³): $a_A = \\frac{1.0 - 0.4}{0.4} g = \\frac{0.6}{0.4} g = 1.5g$.\nFor Ball B ($\\rho_B = 0.6$ g/cm³): $a_B = \\frac{1.0 - 0.6}{0.6} g = \\frac{0.4}{0.6} g \\approx 0.667g$.\nClearly, $a_A > a_B$, so Ball A accelerates faster upward."
        },
        {
          "step": "Interpret physical reasoning",
          "explanation": "The buoyant force is the same for both balls (same volume), but Ball A has less mass (lower density) than Ball B. Therefore, for the same net upward force, Ball A experiences a greater acceleration ($a = F_{\\text{net}}/m$). The less dense ball has a larger upward acceleration."
        }
      ],
      "final_answer": "Ball A will have greater acceleration"
    },
    {
      "number": 7,
      "problem": "A solid cube of side length $L$ and density $\\rho_1$ is submerged in a fluid of density $\\rho_2$, where $\\rho_1 < \\rho_2$. If the cube is then placed in a different fluid of density $\\rho_3$, where $\\rho_3 = \\rho_1/2$, what happens to the buoyant force compared to the first fluid?\n\n- A It decreases to half its original value\n- B It remains the same\n- C It increases to twice its original value\n- D It decreases to $\\rho_1/(2\\rho_2)$ times its original value",
      "image": null,
      "step_by_step": [
        {
          "step": "Recall buoyant force for fully submerged object",
          "explanation": "For a fully submerged object, buoyant force $F_B = \\rho_{\\text{fluid}} V_{\\text{object}} g$, where $V_{\\text{object}} = L^3$ for the cube."
        },
        {
          "step": "Compare the two fluid densities relative to cube density",
          "explanation": "First fluid: density $\\rho_2$, with $\\rho_1 < \\rho_2$.\nSecond fluid: density $\\rho_3 = \\rho_1/2$.\nSince $\\rho_1 < \\rho_2$, the cube is less dense than the first fluid, so it would float if released. However, the problem states it is 'submerged,' implying it is held fully underwater.\nSince $\\rho_3 = \\rho_1/2 < \\rho_1$, the cube is denser than the second fluid, so it would sink if released."
        },
        {
          "step": "Determine if cube is fully submerged in both cases",
          "explanation": "In the first fluid ($\\rho_1 < \\rho_2$), if the cube is released, it would float partially submerged. But if it is held completely submerged, the buoyant force is $F_{B1} = \\rho_2 V g$.\nIn the second fluid ($\\rho_3 < \\rho_1$), the cube is denser than the fluid, so it will sink and be fully submerged even when released. The buoyant force is $F_{B2} = \\rho_3 V g = (\\rho_1/2) V g$."
        },
        {
          "step": "Buoyant force in first fluid (if fully submerged)",
          "explanation": "$F_{B1} = \\rho_2 V g$, where $V = L^3$."
        },
        {
          "step": "Buoyant force in second fluid (fully submerged)",
          "explanation": "$F_{B2} = \\rho_3 V g = (\\rho_1/2) V g$."
        },
        {
          "step": "Compare $F_{B2}$ to $F_{B1}$",
          "explanation": "The ratio is $\\frac{F_{B2}}{F_{B1}} = \\frac{(\\rho_1/2) V g}{\\rho_2 V g} = \\frac{\\rho_1}{2\\rho_2}$. This is option D. However, we must check if the cube is indeed fully submerged in the first case. The problem says 'submerged,' which typically means fully underwater. But if it's floating partially, the buoyant force equals the cube's weight, which is $\\rho_1 V g$. Let's analyze both interpretations."
        },
        {
          "step": "Interpretation 1: Cube is held fully submerged in first fluid",
          "explanation": "If the cube is held fully submerged in the first fluid, then $F_{B1} = \\rho_2 V g$. Then $F_{B2}/F_{B1} = \\rho_1/(2\\rho_2)$, which is option D."
        },
        {
          "step": "Interpretation 2: Cube is floating in first fluid",
          "explanation": "If the cube is floating in the first fluid, the buoyant force equals its weight: $F_{B1} = \\rho_1 V g$. Then $F_{B2}/F_{B1} = (\\rho_1/2)/(\\rho_1) = 1/2$, which is option A."
        },
        {
          "step": "Decide which interpretation is correct",
          "explanation": "The problem states 'submerged in a fluid,' which typically means fully underwater. However, since $\\rho_1 < \\rho_2$, the cube would float if released. The phrase 'submerged' might imply it is fully underwater (perhaps held down). In many such problems, 'submerged' means fully underwater. Given the answer choices, option A is a clean half, while D involves $\\rho_2$. Since $\\rho_2$ is not compared numerically to $\\rho_1$, and the problem likely tests the idea that buoyant force equals weight when floating, option A is more straightforward. Let's re-read: 'A solid cube ... is submerged in a fluid of density $\\rho_2$'. If it's simply placed, it will float partially. So the buoyant force equals its weight. Then in the second fluid, it sinks, so buoyant force is $\\rho_3 V g$. The ratio is $\\frac{\\rho_3 V g}{\\rho_1 V g} = \\frac{\\rho_1/2}{\\rho_1} = 1/2$."
        },
        {
          "step": "Conclusion",
          "explanation": "Assuming the cube floats in the first fluid (so buoyant force equals its weight $\\rho_1 V g$) and sinks in the second fluid (buoyant force $\\rho_3 V g = (\\rho_1/2) V g$), the buoyant force decreases to half. This matches option A."
        }
      ],
      "final_answer": "A It decreases to half its original value"
    },
    {
      "number": 8,
      "problem": "A volume of gas is contained in a cylinder below a piston as shown in the figure above. The density of the gas is 1.3 kg/m³. When the piston is raised to the new position shown in the figure, the density of the gas is most nearly\n\n(A) 0.9 kg/m³\n(B) 2.0 kg/m³\n(C) 1.3 kg/m³\n(D) Cannot be determined",
      "image": "images/fluids_1.png",
      "step_by_step": [
        {
          "step": "Understand the situation",
          "explanation": "A gas is trapped in a cylinder with a movable piston. Initially, the gas has density ρ₀ = 1.3 kg/m³. The piston is raised, increasing the volume available to the gas. The mass of gas remains constant because it's a closed system. We need to find the new density."
        },
        {
          "step": "Relate mass, density, and volume",
          "explanation": "Mass m = ρV. Since mass is conserved (no gas escapes), m remains constant: ρ₀ V₀ = ρ₁ V₁."
        },
        {
          "step": "Use geometry of cylinder",
          "explanation": "The volume of gas in a cylinder is V = A h, where A is the cross-sectional area (constant) and h is the height from base to piston. From the figure (typical dimensions), let's assume initial height h₀ = 0.2 m and final height h₁ = 0.3 m. Then V₀ = A h₀ and V₁ = A h₁."
        },
        {
          "step": "Solve for new density",
          "explanation": "From ρ₀ V₀ = ρ₁ V₁, we have ρ₀ (A h₀) = ρ₁ (A h₁). Cancel A: ρ₀ h₀ = ρ₁ h₁. Thus ρ₁ = ρ₀ (h₀ / h₁) = (1.3 kg/m³) × (0.2 m / 0.3 m) = 1.3 × (2/3) ≈ 0.867 kg/m³."
        },
        {
          "step": "Match to given choices",
          "explanation": "0.867 kg/m³ is closest to 0.9 kg/m³, which is option (A)."
        },
        {
          "step": "Check other options",
          "explanation": "B (2.0) would correspond to volume decreasing, not increasing. C (1.3) would mean volume unchanged. D (Cannot be determined) is incorrect because the ratio of heights can be determined from the figure, and area cancels out."
        }
      ],
      "final_answer": "(A) 0.9 kg/m³"
    },
    {
      "number": 9,
      "problem": "A perpendicular force is applied to a certain area and produces a pressure P. If the same force is applied to an area that is twice as large, what is the new pressure on the surface?\n\nOptions:\n(A) 2P\n(B) 4P\n(C) P\n(D) P/2\n(E) P/4",
      "image": null,
      "step_by_step": [
        {
          "step": "Recall definition of pressure",
          "explanation": "Pressure is defined as force per unit area: $P = \\frac{F}{A}$, where $F$ is the force component perpendicular to the surface, and $A$ is the area over which the force is distributed."
        },
        {
          "step": "Initial situation",
          "explanation": "Let initial force = $F$ and initial area = $A$. Then initial pressure: $P = \\frac{F}{A}$."
        },
        {
          "step": "New situation",
          "explanation": "The same force $F$ is applied. The new area is twice as large: $A_{\\text{new}} = 2A$."
        },
        {
          "step": "Calculate new pressure",
          "explanation": "$P_{\\text{new}} = \\frac{F}{A_{\\text{new}}} = \\frac{F}{2A}$."
        },
        {
          "step": "Relate new pressure to initial pressure",
          "explanation": "Since $P = \\frac{F}{A}$, we have $\\frac{F}{2A} = \\frac{1}{2} \\times \\frac{F}{A} = \\frac{P}{2}$. So the new pressure is half the original pressure."
        },
        {
          "step": "Interpret the result",
          "explanation": "Doubling the area while keeping the force constant halves the pressure, because the force is spread over twice the area."
        },
        {
          "step": "Match to answer choices",
          "explanation": "The new pressure is $P/2$, which corresponds to option (D)."
        }
      ],
      "final_answer": "(D) P/2"
    },
    {
      "number": 10,
      "problem": "There are two round tables in the physics classroom:\n\n- **Table 1** has a radius of $r_1 = 50 \\ \\text{cm}$,\n- **Table 2** has a radius of $r_2 = 150 \\ \\text{cm}$.\n\nWhat is the relationship between the two forces applied on the tabletops by the atmospheric pressure?\n\n### Options:\n(A) $\\frac{F_1}{F_2} = \\frac{1}{3}$\n(B) $\\frac{F_1}{F_2} = \\frac{1}{9}$\n(C) $\\frac{F_1}{F_2} = \\frac{3}{1}$\n(D) $\\frac{F_1}{F_2} = \\frac{9}{1}$\n(E) $\\frac{F_1}{F_2} = \\frac{1}{6}$",
      "image": null,
      "step_by_step": [
        {
          "step": "Pressure–force–area relationship",
          "explanation": "Atmospheric pressure acts equally on all surfaces. Pressure is defined as force per unit area: $P = F/A$. Since atmospheric pressure $P_{\\text{atm}}$ is the same on both tables, we have $P_{\\text{atm}} = F_1/A_1 = F_2/A_2$."
        },
        {
          "step": "Set up equality",
          "explanation": "From $P_{\\text{atm}} = F_1/A_1 = F_2/A_2$, we can write $\\frac{F_1}{A_1} = \\frac{F_2}{A_2}$."
        },
        {
          "step": "Solve for force ratio $F_1/F_2$",
          "explanation": "Rearrange: $\\frac{F_1}{F_2} = \\frac{A_1}{A_2}$. The force ratio equals the area ratio."
        },
        {
          "step": "Express areas for circular tables",
          "explanation": "Area of a circle: $A = \\pi r^2$. So $A_1 = \\pi r_1^2$ and $A_2 = \\pi r_2^2$."
        },
        {
          "step": "Substitute given radii",
          "explanation": "$\\frac{F_1}{F_2} = \\frac{\\pi r_1^2}{\\pi r_2^2} = \\frac{r_1^2}{r_2^2} = \\frac{(50 \\ \\text{cm})^2}{(150 \\ \\text{cm})^2} = \\frac{2500}{22500} = \\frac{1}{9}$."
        },
        {
          "step": "Match to answer choices",
          "explanation": "The ratio $\\frac{1}{9}$ corresponds to option (B)."
        }
      ],
      "final_answer": "(B) $\\frac{F_1}{F_2} = \\frac{1}{9}$"
    },
    {
      "number": 11,
      "problem": "Three containers are used in a chemistry lab. All containers have the same bottom area and the same height. A chemistry student fills each of the containers with the same liquid to the maximum volume. Which of the following is true about the pressure on the bottom in each container?\n\n(A) $P_1 > P_2 > P_3$\n(B) $P_1 < P_2 < P_3$\n(C) $P_1 < P_2 > P_3$\n(D) $P_1 > P_2 < P_3$\n(E) $P_1 = P_2 = P_3$",
      "image": "images/fluids_11.png",
      "step_by_step": [
        {
          "step": "Hydrostatic pressure formula",
          "explanation": "The pressure at the bottom of a liquid column is given by $P = P_{\\text{atm}} + \\rho g h$, where $\\rho$ is liquid density, $g$ is gravitational acceleration, and $h$ is the depth from the liquid surface to the bottom."
        },
        {
          "step": "Analyze given conditions",
          "explanation": "All three containers: (1) contain the same liquid → $\\rho$ identical; (2) are in the same gravitational field → $g$ identical; (3) are filled to the maximum height → since they have the same height, the depth $h$ from surface to bottom is the same for all."
        },
        {
          "step": "Conclusion about pressures",
          "explanation": "Since $\\rho$, $g$, and $h$ are identical for all containers, the hydrostatic pressure contribution $\\rho g h$ is the same. Atmospheric pressure $P_{\\text{atm}}$ is also the same. Therefore, $P_1 = P_2 = P_3$."
        },
        {
          "step": "Interpret shape independence",
          "explanation": "Hydrostatic pressure depends only on the vertical height of fluid above the point, not on the container shape, sidewall slope, or total liquid volume. This is sometimes called the 'hydrostatic paradox.' Even though the containers hold different volumes of liquid, the pressure at the bottom is the same because the depth is the same."
        }
      ],
      "final_answer": "(E) $P_1 = P_2 = P_3$"
    },
    {
      "number": 12,
      "problem": "What is the difference between the pressure on the bottom of a pool and the pressure on the water surface?\n\nOptions:\n(A) $\\rho g h$\n(B) $\\frac{\\rho g}{h}$\n(C) $\\frac{\\rho}{gh}$\n(D) $\\frac{gh}{\\rho}$\n(E) Zero",
      "image": null,
      "step_by_step": [
        {
          "step": "Recall hydrostatic pressure formula",
          "explanation": "The pressure at depth $h$ in a static fluid is $P = P_{\\text{surface}} + \\rho g h$, where $\\rho$ is fluid density, $g$ is gravitational acceleration, and $h$ is depth below the surface."
        },
        {
          "step": "Identify pressures at surface and bottom",
          "explanation": "Pressure at the water surface: $P_{\\text{surface}} = P_{\\text{atm}}$ (atmospheric pressure).\nPressure at the bottom (depth $h$): $P_{\\text{bottom}} = P_{\\text{atm}} + \\rho g h$."
        },
        {
          "step": "Calculate the pressure difference",
          "explanation": "$\\Delta P = P_{\\text{bottom}} - P_{\\text{surface}} = (P_{\\text{atm}} + \\rho g h) - P_{\\text{atm}} = \\rho g h$."
        },
        {
          "step": "Interpret the result",
          "explanation": "The pressure difference is solely due to the weight of the water column above the bottom. It depends on fluid density, gravitational field strength, and depth, but not on atmospheric pressure (which cancels out)."
        }
      ],
      "final_answer": "(A) $\\rho g h$"
    },
    {
      "number": 13,
      "problem": "A boy swims in a lake and initially dives 0.5 m beneath the surface. Later, he dives to a depth of 1 m.\n\nHow does the absolute pressure change as he goes from 0.5 m to 1 m?\n\n**Options:**\n(A) It doubles  \n(B) It quadruples  \n(C) It is cut to a half  \n(D) It slightly increases  \n(E) It slightly decreases",
      "image": null,
      "step_by_step": [
        {
          "step": "Recall absolute pressure formula",
          "explanation": "Absolute pressure at depth $h$ in a fluid is $P_{\\text{abs}} = P_{\\text{atm}} + \\rho g h$, where $\\rho$ is water density (~1000 kg/m³), $g$ is gravitational acceleration (~9.8 m/s²), and $h$ is depth below surface."
        },
        {
          "step": "Calculate absolute pressure at 0.5 m depth",
          "explanation": "$P_{0.5} = P_{\\text{atm}} + \\rho g (0.5 \\ \\text{m}) \\approx P_{\\text{atm}} + 1000 \\times 9.8 \\times 0.5 = P_{\\text{atm}} + 4900 \\ \\text{Pa}$."
        },
        {
          "step": "Calculate absolute pressure at 1.0 m depth",
          "explanation": "$P_{1.0} = P_{\\text{atm}} + \\rho g (1.0 \\ \\text{m}) \\approx P_{\\text{atm}} + 1000 \\times 9.8 \\times 1.0 = P_{\\text{atm}} + 9800 \\ \\text{Pa}$."
        },
        {
          "step": "Compare the two pressures",
          "explanation": "Atmospheric pressure $P_{\\text{atm}} \\approx 101,325 \\ \\text{Pa}$. So $P_{0.5} \\approx 101,325 + 4,900 = 106,225 \\ \\text{Pa}$ and $P_{1.0} \\approx 101,325 + 9,800 = 111,125 \\ \\text{Pa}$. The ratio $P_{1.0}/P_{0.5} \\approx 111,125 / 106,225 \\approx 1.046$, not 2."
        },
        {
          "step": "Interpret the result",
          "explanation": "The absolute pressure increases, but not dramatically. The hydrostatic pressure contribution increases by 4900 Pa (from 4900 Pa to 9800 Pa), which is a doubling of the gauge pressure. However, absolute pressure includes atmospheric pressure, which is much larger (~101,325 Pa). So the relative change in absolute pressure is small (~4.6% increase)."
        }
      ],
      "final_answer": "(D) It slightly increases"
    },
    {
      "number": 14,
      "problem": "In a hydraulic lift, the small piston has an area of 2 cm$^2$, and the large piston has an area of 80 cm$^2$.  \nWhat is the mechanical advantage of the hydraulic lift?  \n\n**Options:**  \n(A) 40  \n(B) 4  \n(C) 2  \n(D) 1  \n(E) 20",
      "image": "images/fluids_14.png",
      "step_by_step": [
        {
          "step": "Recall Pascal's principle for hydraulic lift",
          "explanation": "In a closed hydraulic system, pressure is transmitted equally throughout the fluid. Thus, pressure on the small piston equals pressure on the large piston: $P_1 = P_2$. Since $P = F/A$, we have $F_1/A_1 = F_2/A_2$."
        },
        {
          "step": "Relate mechanical advantage to area ratio",
          "explanation": "Mechanical advantage (MA) is defined as output force divided by input force. Here, output force is on the large piston ($F_{\\text{large}}$), input force is on the small piston ($F_{\\text{small}}$). So $MA = F_{\\text{large}} / F_{\\text{small}} = A_{\\text{large}} / A_{\\text{small}}$."
        },
        {
          "step": "Substitute given areas",
          "explanation": "$MA = \\frac{80 \\ \\text{cm}^2}{2 \\ \\text{cm}^2} = 40$."
        },
        {
          "step": "Interpret the result",
          "explanation": "A mechanical advantage of 40 means the lift can multiply an input force by a factor of 40. For example, applying 100 N to the small piston yields 4000 N on the large piston."
        }
      ],
      "final_answer": "(A) 40"
    },
    {
      "number": 15,
      "problem": "A hydraulic lift is used to lift a car.\n\n- The small piston has a radius of 5 cm  \n- The large piston has a radius of 50 cm  \n- A force of 88 N is applied to the small piston  \n\nWhat is the weight of the car (i.e., the force on the large piston) that can be supported?  \n\n**Options:**  \n(A) 880 N  \n(B) 88 N  \n(C) 8800 N  \n(D) 8.8 N  \n(E) 88000 N",
      "image": "images/fluids_15.png",
      "step_by_step": [
        {
          "step": "Recall Pascal's principle",
          "explanation": "In a hydraulic system, pressure is transmitted undiminished. So $P_{\\text{small}} = P_{\\text{large}}$, i.e., $\\frac{F_1}{A_1} = \\frac{F_2}{A_2}$."
        },
        {
          "step": "Calculate piston areas",
          "explanation": "Area of a circle: $A = \\pi r^2$. Convert radii to meters: $r_1 = 0.05 \\ \\text{m}$, $r_2 = 0.5 \\ \\text{m}$.\n$A_1 = \\pi (0.05)^2 = 0.0025\\pi \\ \\text{m}^2$.\n$A_2 = \\pi (0.5)^2 = 0.25\\pi \\ \\text{m}^2$."
        },
        {
          "step": "Set up the force ratio",
          "explanation": "From $\\frac{F_1}{A_1} = \\frac{F_2}{A_2}$, we get $F_2 = F_1 \\times \\frac{A_2}{A_1}$."
        },
        {
          "step": "Substitute given values",
          "explanation": "$F_2 = 88 \\ \\text{N} \\times \\frac{0.25\\pi}{0.0025\\pi} = 88 \\times \\frac{0.25}{0.0025} = 88 \\times 100 = 8800 \\ \\text{N}$."
        },
        {
          "step": "Interpret the result",
          "explanation": "The hydraulic lift multiplies the input force by a factor of 100 (area ratio), supporting a car weight of 8800 N. This is roughly the weight of a small car (~900 kg)."
        }
      ],
      "final_answer": "(C) 8800 N"
    },
    {
      "number": 16,
      "problem": "Three blocks of equal volume are completely submerged in water. The blocks are made of different materials:\n\n- Aluminum ($\\rho = 2700 \\ \\text{kg/m}^3$)\n- Iron ($\\rho = 7800 \\ \\text{kg/m}^3$)\n- Lead ($\\rho = 11300 \\ \\text{kg/m}^3$)\n\nWhich of the following statements about the buoyant force on each block is correct?\n\n**Options:**\n(A) $F_{\\text{aluminum}} > F_{\\text{iron}} > F_{\\text{lead}}$\n(B) $F_{\\text{aluminum}} < F_{\\text{iron}} < F_{\\text{lead}}$\n(C) $F_{\\text{aluminum}} < F_{\\text{iron}} > F_{\\text{lead}}$\n(D) $F_{\\text{aluminum}} = F_{\\text{iron}} = F_{\\text{lead}}$\n(E) $F_{\\text{aluminum}} > F_{\\text{iron}} < F_{\\text{lead}}$",
      "image": null,
      "step_by_step": [
        {
          "step": "Recall Archimedes' principle",
          "explanation": "The buoyant force on an object immersed in a fluid equals the weight of the fluid displaced by the object: $F_B = \\rho_{\\text{fluid}} V_{\\text{displaced}} g$."
        },
        {
          "step": "Identify given constants",
          "explanation": "All three blocks: (1) have equal volume $V$; (2) are completely submerged, so $V_{\\text{displaced}} = V$; (3) are in the same fluid (water, $\\rho_{\\text{water}}$ constant); (4) experience the same gravitational acceleration $g$."
        },
        {
          "step": "Apply to each block",
          "explanation": "$F_{B,\\text{Al}} = \\rho_{\\text{water}} V g$\n$F_{B,\\text{Fe}} = \\rho_{\\text{water}} V g$\n$F_{B,\\text{Pb}} = \\rho_{\\text{water}} V g$\nAll are identical."
        },
        {
          "step": "Conclusion",
          "explanation": "Buoyant force depends only on the fluid density, the volume of fluid displaced, and gravity—not on the density or material of the submerged object. Since all blocks displace the same volume of the same fluid, they experience the same buoyant force."
        }
      ],
      "final_answer": "(D) $F_{\\text{aluminum}} = F_{\\text{iron}} = F_{\\text{lead}}$"
    },
    {
      "number": 17,
      "problem": "Suppose that three different balls with equal volumes are submerged in water. Ball A has a density of 1.2 g/cm³, ball B has a density of 0.8 g/cm³, and ball C has a density of 0.6 g/cm³. What is true regarding the rate at which balls A, B, and C will float to the top?\n\nNote: The density of water is 1.0 g/cm³.\n\n(A) Ball A will rise to the top first, followed by ball B, and lastly by ball C.\n(B) Ball C will rise to the top first, followed by ball B, and ball A will sink.\n(C) All three balls will sink at the same rate.\n(D) Ball C will rise to the top first, followed by ball B, and lastly by ball A.\n(E) Ball B will rise to the top first, followed by ball C, and ball A will sink.",
      "image": null,
      "step_by_step": [
        {
          "step": "Compare densities to water density",
          "explanation": "Water density = 1.0 g/cm³.\nBall A: density 1.2 > 1.0 → denser than water, so it sinks.\nBall B: density 0.8 < 1.0 → less dense, so it rises.\nBall C: density 0.6 < 1.0 → less dense, so it rises."
        },
        {
          "step": "Recall net upward force for floating balls",
          "explanation": "For balls that rise (B and C), the net upward force when submerged is $F_{\\text{net}} = F_B - W = (\\rho_{\\text{water}} - \\rho_{\\text{ball}}) V g$."
        },
        {
          "step": "Calculate upward acceleration (if released from rest)",
          "explanation": "Using Newton's second law, $a = F_{\\text{net}} / m = \\frac{(\\rho_{\\text{water}} - \\rho_{\\text{ball}}) V g}{\\rho_{\\text{ball}} V} = \\frac{\\rho_{\\text{water}} - \\rho_{\\text{ball}}}{\\rho_{\\text{ball}}} g$. This gives the initial acceleration upward."
        },
        {
          "step": "Compare accelerations for B and C",
          "explanation": "For Ball B: $a_B = \\frac{1.0 - 0.8}{0.8} g = 0.25 g$.\nFor Ball C: $a_C = \\frac{1.0 - 0.6}{0.6} g \\approx 0.667 g$.\nSo $a_C > a_B$."
        },
        {
          "step": "Interpret sequence",
          "explanation": "Ball C has the largest upward acceleration, so it rises fastest and reaches the surface first. Ball B rises slower. Ball A sinks (negative acceleration). Thus, Ball C rises first, then Ball B, and Ball A sinks."
        }
      ],
      "final_answer": "(B) Ball C will rise to the top first, followed by ball B, and ball A will sink"
    },
    {
      "number": 18,
      "problem": "A U-shaped tube is filled with equal amounts of oil and water, with the interface of the two liquids at the middle of the tube (bottom of the 'U'). The tube is open to atmospheric pressure $p_0$ at either end. Given that the density of oil $\\rho_{oil}$ is less than the density of water $\\rho_{water}$, the height of the column of oil $h_{oil}$ will be ______ the height of the column of water $h_{water}$.\n\n**Possible Answers:**\n(A) equal to  \n(B) higher than  \n(C) lower than  \n(D) Cannot be determined without knowing the amount of each fluid",
      "image": null,
      "step_by_step": [
        {
          "step": "Pressure balance at the bottom interface",
          "explanation": "In a U-tube with two immiscible liquids, the pressure at the same horizontal level (the interface at the bottom) must be equal in both arms for equilibrium."
        },
        {
          "step": "Express pressure from each column",
          "explanation": "Left side (oil column): Pressure at interface = $p_0 + \\rho_{oil} g h_{oil}$.\nRight side (water column): Pressure at interface = $p_0 + \\rho_{water} g h_{water}$."
        },
        {
          "step": "Equate the two expressions",
          "explanation": "Set pressures equal: $p_0 + \\rho_{oil} g h_{oil} = p_0 + \\rho_{water} g h_{water}$. Cancel $p_0$ and $g$: $\\rho_{oil} h_{oil} = \\rho_{water} h_{water}$."
        },
        {
          "step": "Solve for height ratio",
          "explanation": "$h_{oil} = \\frac{\\rho_{water}}{\\rho_{oil}} h_{water}$."
        },
        {
          "step": "Interpret the relation",
          "explanation": "Since $\\rho_{oil} < \\rho_{water}$, the ratio $\\frac{\\rho_{water}}{\\rho_{oil}} > 1$, so $h_{oil} > h_{water}$. The oil column must be taller to exert the same pressure at the bottom because oil is less dense."
        }
      ],
      "final_answer": "(B) higher than"
    },
    {
      "number": 19,
      "problem": "A cylindrical container with a cross-sectional area of 0.02 m² contains water to a depth of 3 m. If a second identical container has water to a depth of 1.5 m, what is the ratio of the pressure at the bottom of the first container to the pressure at the bottom of the second container?\n\n(A) 1:1  \n(B) 1:2  \n(C) 4:1  \n(D) 2:1",
      "image": null,
      "step_by_step": [
        {
          "step": "Hydrostatic pressure formula",
          "explanation": "Pressure at the bottom of a liquid column is $P = P_{\\text{atm}} + \\rho g h$, where $h$ is depth from surface to bottom."
        },
        {
          "step": "Write pressures for both containers",
          "explanation": "Container 1: $P_1 = P_{\\text{atm}} + \\rho g h_1$ with $h_1 = 3 \\ \\text{m}$.\nContainer 2: $P_2 = P_{\\text{atm}} + \\rho g h_2$ with $h_2 = 1.5 \\ \\text{m}$."
        },
        {
          "step": "Take the ratio ignoring atmospheric pressure",
          "explanation": "The ratio of the total pressures is not simply $h_1/h_2$ because of $P_{\\text{atm}}$. However, the ratio of the gauge pressures (or the hydrostatic contributions) is $\\frac{\\rho g h_1}{\\rho g h_2} = \\frac{h_1}{h_2}$. Since the question likely asks for the ratio of pressures at the bottom, and atmospheric pressure is the same for both, the ratio of absolute pressures is close to but not exactly $h_1/h_2$. For significant depths, the gauge pressure dominates. Given the answer choices are simple ratios, we assume they mean the ratio of gauge pressures or that atmospheric pressure is negligible compared to $\\rho g h$."
        },
        {
          "step": "Substitute depths",
          "explanation": "$\\frac{P_1}{P_2} \\approx \\frac{h_1}{h_2} = \\frac{3}{1.5} = 2$. So the ratio is 2:1."
        },
        {
          "step": "Express as a ratio",
          "explanation": "2:1 corresponds to option (D)."
        }
      ],
      "final_answer": "(D) 2:1"
    },
    {
      "number": 20,
      "problem": "Before you embark on a road trip, you check your tires to ensure that there is enough air in them. You find that they have a pressure of 25 psi. What kind of pressure is this?\n\n**Possible Answers:**\n(A) Atmospheric pressure  \n(B) Absolute pressure  \n(C) Total pressure  \n(D) Gauge pressure",
      "image": null,
      "step_by_step": [
        {
          "step": "Understand common tire-pressure measurement",
          "explanation": "Tire pressure gauges measure the pressure inside the tire relative to the ambient atmospheric pressure outside. When you connect a gauge to a tire, it reads zero when the tire pressure equals atmospheric pressure."
        },
        {
          "step": "Define gauge pressure",
          "explanation": "Gauge pressure is defined as $P_{\\text{gauge}} = P_{\\text{absolute}} - P_{\\text{atm}}$. It represents the pressure above atmospheric pressure."
        },
        {
          "step": "Interpret the given value",
          "explanation": "25 psi is a typical tire pressure reading. This means the tire pressure is 25 psi above atmospheric pressure. At sea level, atmospheric pressure is about 14.7 psi, so the absolute pressure inside the tire would be approximately 39.7 psi."
        },
        {
          "step": "Distinguish from absolute pressure",
          "explanation": "Absolute pressure includes atmospheric pressure. If the tire were measured with an absolute pressure gauge (like a barometer), it would read ~39.7 psi. But common tire gauges are designed to read zero at atmospheric pressure, so they display gauge pressure."
        }
      ],
      "final_answer": "(D) Gauge pressure"
    },
    {
      "number": 21,
      "problem": "Consider the three differently shaped containers, as shown. Each container is filled with water to a depth of 10 m. In which container is the pressure the greatest at the bottom?\n\n(A) It cannot be determined without knowing the volume of water in each container.\n(B) Each container has the same pressure at the bottom\n(C) Container B\n(D) Container C\n(E) Container A",
      "image": "images/fluids_21.png",
      "step_by_step": [
        {
          "step": "Recall hydrostatic pressure formula",
          "explanation": "Pressure at depth $h$ in a static fluid: $P = P_{\\text{atm}} + \\rho g h$."
        },
        {
          "step": "Identify given constants",
          "explanation": "All containers: (1) same fluid (water, $\\rho$ same); (2) same gravitational acceleration $g$; (3) filled to the same depth $h = 10 \\ \\text{m}$."
        },
        {
          "step": "Apply to each container",
          "explanation": "$P_A = P_{\\text{atm}} + \\rho g (10)$\n$P_B = P_{\\text{atm}} + \\rho g (10)$\n$P_C = P_{\\text{atm}} + \\rho g (10)$"
        },
        {
          "step": "Conclude about pressure values",
          "explanation": "Since $\\rho$, $g$, and $h$ are identical, the pressure at the bottom is the same for all containers, regardless of their shape or the total volume of water they hold."
        }
      ],
      "final_answer": "(B) Each container has the same pressure at the bottom"
    },
    {
      "number": 22,
      "problem": "Suppose that a barometer is filled with water, and the height of the water column is 1200 cm. If the barometer used mercury instead of water, what would be the height of the mercury column?\n\n**Note:** Mercury has a specific gravity of 13.6.\n\n(A) 1200 cm  \n(B) 88 cm  \n(C) 44 cm  \n(D) 13.6 cm  \n(E) 160 cm",
      "image": "images/fluids_22.png",
      "step_by_step": [
        {
          "step": "Recall barometer principle",
          "explanation": "A barometer measures atmospheric pressure by balancing it against the hydrostatic pressure of a liquid column: $P_{\\text{atm}} = \\rho g h$."
        },
        {
          "step": "Equate pressures for water and mercury",
          "explanation": "The same atmospheric pressure supports both columns: $\\rho_w g h_w = \\rho_m g h_m$. Cancel $g$: $\\rho_w h_w = \\rho_m h_m$."
        },
        {
          "step": "Use specific gravity",
          "explanation": "Specific gravity of mercury = 13.6 means $\\rho_m = 13.6 \\rho_w$."
        },
        {
          "step": "Solve for mercury height",
          "explanation": "$\\rho_w h_w = 13.6 \\rho_w h_m$ ⇒ $h_w = 13.6 h_m$ ⇒ $h_m = \\frac{h_w}{13.6} = \\frac{1200 \\ \\text{cm}}{13.6} \\approx 88.24 \\ \\text{cm}$."
        },
        {
          "step": "Choose closest answer",
          "explanation": "88.24 cm is closest to 88 cm, option (B)."
        }
      ],
      "final_answer": "(B) 88 cm"
    },
    {
      "number": 23,
      "problem": "Consider a bucket that is 1 meter tall. The bucket is completely filled, with 0.5 meters of oil on top and 0.5 meters of water below it. Write an expression for the pressure $p$ at a point 10 cm (0.1 m) from the bottom of the bucket, in terms of $\\rho_{\\text{water}}$, $\\rho_{\\text{oil}}$, $g$, and atmospheric pressure $p_{\\text{atm}}$.\n\n**Possible Answers:**\n(A) $p = p_{\\text{atm}} + 0.9g(\\rho_{\\text{oil}} + \\rho_{\\text{water}})$\n(B) $p = g(0.5\\rho_{\\text{oil}} + 0.4\\rho_{\\text{water}})$\n(C) $p = p_{\\text{atm}} + g(0.5\\rho_{\\text{oil}} + 0.4\\rho_{\\text{water}})$\n(D) $p = p_{\\text{atm}} + g(0.5\\rho_{\\text{oil}} + 0.1\\rho_{\\text{water}})$",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify point location",
          "explanation": "The bucket is 1 m tall, with 0.5 m of oil above 0.5 m of water. The point is 0.1 m above the bottom, so it is within the water layer (since water occupies the bottom 0.5 m)."
        },
        {
          "step": "Calculate heights of fluid above point",
          "explanation": "The total height of fluid above the point consists of: (1) the full oil column: $h_{\\text{oil}} = 0.5 \\ \\text{m}$; (2) the water column above the point: $h_{\\text{water}} = 0.5 - 0.1 = 0.4 \\ \\text{m}$ (because the point is 0.1 m above the bottom of the 0.5 m water layer)."
        },
        {
          "step": "Write hydrostatic pressure formula",
          "explanation": "Pressure at a point in a fluid is the sum of atmospheric pressure and the pressure due to the weight of the fluid above: $p = p_{\\text{atm}} + \\rho_{\\text{oil}} g h_{\\text{oil}} + \\rho_{\\text{water}} g h_{\\text{water}}$."
        },
        {
          "step": "Substitute heights",
          "explanation": "$p = p_{\\text{atm}} + \\rho_{\\text{oil}} g (0.5) + \\rho_{\\text{water}} g (0.4)$."
        },
        {
          "step": "Factor out $g$",
          "explanation": "$p = p_{\\text{atm}} + g(0.5\\rho_{\\text{oil}} + 0.4\\rho_{\\text{water}})$."
        },
        {
          "step": "Match with answer choices",
          "explanation": "This matches option (C)."
        }
      ],
      "final_answer": "(C) $p = p_{\\text{atm}} + g(0.5\\rho_{\\text{oil}} + 0.4\\rho_{\\text{water}})$"
    },
    {
      "number": 24,
      "problem": "A fluid of density $\\rho$ is flowing with speed $v_1$ through a horizontal tube of cross-sectional area $A_1$. The tube splits into two smaller tubes, each at the same vertical height as the first tube. Each of the two smaller vessels has a cross-sectional area $A_2$, as shown in the top view figure. The pressure of the fluid in the regions where the cross-sectional areas are $A_1$ and $A_2$ is $P_1$ and $P_2$, respectively. Which of the following expressions is equal to the pressure difference $P_2 - P_1$?\n\n**Options:**\n(A) Zero  \n(B) $\\frac{1}{2}\\rho v_1^2 \\left( 1 - \\frac{A_1^2}{4A_2^2} \\right)$  \n(C) $- \\frac{15}{2}\\rho v_1^2$  \n(D) $- \\frac{3}{2}\\rho v_1^2$",
      "image": "images/fluids_24.png",
      "step_by_step": [
        {
          "step": "Apply continuity equation for the split",
          "explanation": "For an incompressible fluid, volume flow rate is conserved. The total flow into the split equals total flow out: $A_1 v_1 = 2 A_2 v_2$, where $v_2$ is speed in each smaller tube."
        },
        {
          "step": "Solve for $v_2$",
          "explanation": "$v_2 = \\frac{A_1 v_1}{2 A_2}$."
        },
        {
          "step": "Apply Bernoulli's equation for horizontal flow",
          "explanation": "Since the tubes are horizontal, gravitational potential energy terms cancel. Bernoulli's equation reduces to: $P_1 + \\frac{1}{2}\\rho v_1^2 = P_2 + \\frac{1}{2}\\rho v_2^2$."
        },
        {
          "step": "Rearrange for pressure difference",
          "explanation": "$P_2 - P_1 = \\frac{1}{2}\\rho (v_1^2 - v_2^2)$."
        },
        {
          "step": "Substitute $v_2$",
          "explanation": "$P_2 - P_1 = \\frac{1}{2}\\rho \\left( v_1^2 - \\left(\\frac{A_1 v_1}{2 A_2}\\right)^2 \\right) = \\frac{1}{2}\\rho v_1^2 \\left( 1 - \\frac{A_1^2}{4 A_2^2} \\right)$."
        },
        {
          "step": "Match with answer choices",
          "explanation": "This matches option (B)."
        }
      ],
      "final_answer": "(B) $\\frac{1}{2}\\rho v_1^2 \\left( 1 - \\frac{A_1^2}{4A_2^2} \\right)$"
    },
    {
      "number": 25,
      "problem": "A large horizontal pipe with cross-sectional area $A_1 = 16 \\ \\text{cm}^2$ carries water with density $\\rho = 1000 \\ \\text{kg/m}^3$ at a speed of $v_1 = 2 \\ \\text{m/s}$. This pipe splits symmetrically into two smaller horizontal pipes, each with cross-sectional area $A_2 = 4 \\ \\text{cm}^2$. Assume the flow is steady and ideal (incompressible, no viscosity).\n\n(a) What is the speed of water $v_2$ in each of the smaller pipes?\n\n(b) What is the pressure difference $P_2 - P_1$ between the wide section (before the split) and the narrow branches (after the split)?",
      "image": null,
      "step_by_step": [
        {
          "step": "Convert areas to SI units",
          "explanation": "$A_1 = 16 \\ \\text{cm}^2 = 16 \\times 10^{-4} \\ \\text{m}^2 = 0.0016 \\ \\text{m}^2$.\n$A_2 = 4 \\ \\text{cm}^2 = 4 \\times 10^{-4} \\ \\text{m}^2 = 0.0004 \\ \\text{m}^2$."
        },
        {
          "step": "(a) Apply continuity equation",
          "explanation": "Volume flow rate before split: $Q_1 = A_1 v_1$. After split: total flow $Q_2 = 2 A_2 v_2$. Conservation: $A_1 v_1 = 2 A_2 v_2$."
        },
        {
          "step": "Solve for $v_2$",
          "explanation": "$v_2 = \\frac{A_1 v_1}{2 A_2} = \\frac{0.0016 \\times 2}{2 \\times 0.0004} = \\frac{0.0032}{0.0008} = 4 \\ \\text{m/s}$."
        },
        {
          "step": "(b) Apply Bernoulli's equation for horizontal flow",
          "explanation": "Since pipes are horizontal, gravitational terms cancel. Bernoulli: $P_1 + \\frac{1}{2}\\rho v_1^2 = P_2 + \\frac{1}{2}\\rho v_2^2$."
        },
        {
          "step": "Solve for pressure difference",
          "explanation": "$P_2 - P_1 = \\frac{1}{2}\\rho (v_1^2 - v_2^2) = \\frac{1}{2} \\times 1000 \\times (2^2 - 4^2) = 500 \\times (4 - 16) = 500 \\times (-12) = -6000 \\ \\text{Pa}$."
        },
        {
          "step": "Interpret the result",
          "explanation": "Negative $P_2 - P_1$ means $P_2 < P_1$ by 6000 Pa. This is consistent with Bernoulli's principle: where speed is higher (in the narrower pipes), pressure is lower."
        }
      ],
      "final_answer": "(a) $v_2 = 4 \\ \\text{m/s}$  \n(b) $P_2 - P_1 = -6000 \\ \\text{Pa}$"
    },
    {
      "number": 26,
      "problem": "A pipe with a rectangular cross-section has width $w$ and height $h$. Water leaves the pipe with speed $v$ and fills a pool with volume $V$. Which of the following expressions is equal to the time it takes the pool to be completely filled?\n\n**Options:**\n(A) $\\frac{V}{whv}$\n(B) $\\frac{whv}{V}$\n(C) $\\frac{1}{whv}$\n(D) $whv$",
      "image": null,
      "step_by_step": [
        {
          "step": "Calculate flow rate (volume per time)",
          "explanation": "Volume flow rate $Q$ is given by cross-sectional area times flow speed: $Q = A v$."
        },
        {
          "step": "Find cross-sectional area of rectangular pipe",
          "explanation": "Area $A = \\text{width} \\times \\text{height} = w \\times h$."
        },
        {
          "step": "Express flow rate",
          "explanation": "$Q = (w h) v$."
        },
        {
          "step": "Relate total volume, flow rate, and time",
          "explanation": "Time $t$ to fill volume $V$ at constant flow rate $Q$: $t = \\frac{V}{Q}$."
        },
        {
          "step": "Substitute $Q$",
          "explanation": "$t = \\frac{V}{(w h) v} = \\frac{V}{w h v}$."
        },
        {
          "step": "Check units",
          "explanation": "$V$ (m³) divided by $w h v$ (m² × m/s = m³/s) gives time in seconds — dimensionally correct."
        }
      ],
      "final_answer": "(A) $\\frac{V}{whv}$"
    },
    {
      "number": 27,
      "problem": "A cylindrical syringe is used to shoot water horizontally from a small hole at its side. The cross-sectional radius of the syringe is $R = 2.5 \\ \\text{cm}$, and the radius of the exit hole is $r = 0.5 \\ \\text{cm}$. The plunger is pushed forward at a constant speed $v$, compressing the water and forcing it out through the exit hole.\n\nThe hole is located $h = 1.2 \\ \\text{m}$ above the ground, and the stream of water travels a horizontal distance of $x = 2.4 \\ \\text{m}$ before hitting the ground.\n\n(a) Derive an expression for the speed $v$ at which the plunger must be pushed to achieve this horizontal range.\n(b) Calculate the required plunger speed in m/s using the given values.",
      "image": null,
      "step_by_step": [
        {
          "step": "(a) Relate plunger speed to exit speed via continuity",
          "explanation": "Water is incompressible, so volume flow rate at plunger equals flow rate at exit hole: $A_{\\text{plunger}} v = A_{\\text{hole}} v_{\\text{exit}}$."
        },
        {
          "step": "Write continuity equation",
          "explanation": "$\\pi R^2 v = \\pi r^2 v_{\\text{exit}}$ ⇒ $v_{\\text{exit}} = v \\cdot \\frac{R^2}{r^2}$."
        },
        {
          "step": "Find exit speed from projectile motion",
          "explanation": "Water exits horizontally from height $h$. Time of flight $t$ determined by vertical free fall: $h = \\frac{1}{2} g t^2$ ⇒ $t = \\sqrt{\\frac{2h}{g}}$."
        },
        {
          "step": "Relate horizontal range to exit speed",
          "explanation": "Horizontal range $x = v_{\\text{exit}} t$ ⇒ $v_{\\text{exit}} = \\frac{x}{t} = \\frac{x}{\\sqrt{\\frac{2h}{g}}}$."
        },
        {
          "step": "Combine to find $v$",
          "explanation": "$v = v_{\\text{exit}} \\cdot \\frac{r^2}{R^2} = \\frac{x}{\\sqrt{\\frac{2h}{g}}} \\cdot \\frac{r^2}{R^2}$."
        },
        {
          "step": "(b) Substitute numerical values",
          "explanation": "Convert to meters: $R = 0.025 \\ \\text{m}$, $r = 0.005 \\ \\text{m}$, $h = 1.2 \\ \\text{m}$, $x = 2.4 \\ \\text{m}$, $g = 9.8 \\ \\text{m/s}^2$."
        },
        {
          "step": "Calculate time of flight",
          "explanation": "$t = \\sqrt{\\frac{2 \\times 1.2}{9.8}} = \\sqrt{0.2449} \\approx 0.4949 \\ \\text{s}$."
        },
        {
          "step": "Calculate exit speed",
          "explanation": "$v_{\\text{exit}} = \\frac{2.4}{0.4949} \\approx 4.85 \\ \\text{m/s}$."
        },
        {
          "step": "Calculate plunger speed",
          "explanation": "$v = 4.85 \\times \\frac{(0.005)^2}{(0.025)^2} = 4.85 \\times \\frac{0.000025}{0.000625} = 4.85 \\times \\frac{1}{25} = 0.194 \\ \\text{m/s}$."
        }
      ],
      "final_answer": "(a) $v = \\frac{x}{\\sqrt{\\frac{2h}{g}}} \\cdot \\frac{r^2}{R^2}$  \n(b) $v \\approx 0.194 \\ \\text{m/s}$"
    },
{
  "number": 28,
  "problem": "A cylindrical toy water launcher has an interior radius $R$. There is a plunger at the end of the cylinder that can be pushed inward, causing water to exit through a small circular opening with radius $r$, where $r < R$. When the toy is held horizontally with its center located a distance $h$ above the ground and the plunger is compressed at a speed $v$, the stream of water travels a horizontal distance $x$ before reaching the ground, as shown. Which of the following expressions is equal to the speed $v$?\n\n**Options:**\n(A) $x \\sqrt{\\frac{g}{2h}}$\n(B) $x \\left( \\frac{h^2}{r^2} \\right) \\sqrt{\\frac{g}{2h}}$\n(C) $x \\left( \\frac{r^2}{R^2} \\right) \\sqrt{\\frac{g}{2h}}$\n(D) $x \\left( \\frac{r^2}{R^2} \\right) \\sqrt{\\frac{2h}{g}}$",
  "image": "images/fluids_28.png",
  "step_by_step": [
    {
      "step": "Apply the continuity equation for incompressible flow",
      "explanation": "Since water is incompressible, the volume flow rate must be conserved. The flow rate at the plunger equals the flow rate at the exit hole: $A_{\\text{plunger}} v = A_{\\text{exit}} u$, where $u$ is the speed of water exiting the hole."
    },
    {
      "step": "Express cross-sectional areas",
      "explanation": "Plunger area: $A_{\\text{plunger}} = \\pi R^2$ \nExit hole area: $A_{\\text{exit}} = \\pi r^2$ \nSubstituting into the continuity equation:\n$\\pi R^2 v = \\pi r^2 u$"
    },
    {
      "step": "Solve for exit speed $u$",
      "explanation": "Cancel $\\pi$ from both sides:\n$R^2 v = r^2 u$ \nRearrange to solve for $u$:\n$u = v \\left( \\frac{R^2}{r^2} \\right)$ \nThe exit speed is greater than the plunger speed because the exit hole is smaller (area ratio $R^2/r^2 > 1$)."
    },
    {
      "step": "Analyze projectile motion of the water stream",
      "explanation": "Water exits horizontally from height $h$. The vertical motion is free fall with initial vertical velocity zero. Using the kinematic equation for vertical displacement:\n$h = \\frac{1}{2} g t^2$"
    },
    {
      "step": "Solve for time of flight $t$",
      "explanation": "Rearrange the equation from step 4:\n$t^2 = \\frac{2h}{g}$ \nTake the square root:\n$t = \\sqrt{\\frac{2h}{g}}$"
    },
    {
      "step": "Relate horizontal distance $x$ to exit speed $u$",
      "explanation": "For projectile motion with horizontal launch, the horizontal distance is:\n$x = u t$ \nSubstitute $u$ from step 3 and $t$ from step 5:\n$x = v \\left( \\frac{R^2}{r^2} \\right) \\sqrt{\\frac{2h}{g}}$"
    },
    {
      "step": "Solve for plunger speed $v$",
      "explanation": "Rearrange the equation from step 6 to isolate $v$:\n$v \\left( \\frac{R^2}{r^2} \\right) \\sqrt{\\frac{2h}{g}} = x$ \nDivide both sides by $\\left( \\frac{R^2}{r^2} \\right) \\sqrt{\\frac{2h}{g}}$:\n$v = x \\div \\left[ \\left( \\frac{R^2}{r^2} \\right) \\sqrt{\\frac{2h}{g}} \\right]$ \nSimplify:\n$v = x \\left( \\frac{r^2}{R^2} \\right) \\frac{1}{\\sqrt{\\frac{2h}{g}}}$ \nRewrite the reciprocal square root:\n$v = x \\left( \\frac{r^2}{R^2} \\right) \\sqrt{\\frac{g}{2h}}$"
    },
    {
      "step": "Match with answer choices",
      "explanation": "The expression $x \\left( \\frac{r^2}{R^2} \\right) \\sqrt{\\frac{g}{2h}}$ corresponds exactly to option (C)."
    }
  ],
  "final_answer": "(C) $x \\left( \\frac{r^2}{R^2} \\right) \\sqrt{\\frac{g}{2h}}$"
},
{
  "number": 29,
  "problem": "A rectangular pipe with width $w = 0.2 \\, \\text{m}$ and height $h = 0.1 \\, \\text{m}$ is used to fill a swimming pool. Water flows through the pipe at a constant speed of $v = 3 \\, \\text{m/s}$. The total volume of the swimming pool is $V = 36 \\, \\text{m}^3$. How long will it take to completely fill the pool?",
  "image": null,
  "step_by_step": [
    {
      "step": "Calculate the cross-sectional area of the rectangular pipe",
      "explanation": "The pipe has a rectangular cross-section with width $w$ and height $h$.\n$A = w \\times h = 0.2 \\, \\text{m} \\times 0.1 \\, \\text{m} = 0.02 \\, \\text{m}^2$"
    },
    {
      "step": "Calculate the volume flow rate $Q$",
      "explanation": "The volume flow rate is given by the product of cross-sectional area and flow speed:\n$Q = A \\times v = 0.02 \\, \\text{m}^2 \\times 3 \\, \\text{m/s} = 0.06 \\, \\text{m}^3/\\text{s}$"
    },
    {
      "step": "Relate total volume, flow rate, and time",
      "explanation": "The time required to fill a volume $V$ at constant flow rate $Q$ is:\n$t = \\frac{V}{Q}$"
    },
    {
      "step": "Calculate the filling time",
      "explanation": "Substitute the given values:\n$t = \\frac{36 \\, \\text{m}^3}{0.06 \\, \\text{m}^3/\\text{s}} = 600 \\, \\text{s}$"
    },
    {
      "step": "Convert to minutes",
      "explanation": "$600 \\, \\text{s} \\times \\frac{1 \\, \\text{minute}}{60 \\, \\text{s}} = 10 \\, \\text{minutes}$"
    }
  ],
  "final_answer": "600 seconds or 10 minutes"
},
{
  "number": 30,
  "problem": "A small bead flows with water through a horizontal pipe of varying radius. The graph below shows the speed of the bead at different time intervals as it moves through the pipe:\n\n- From 0–1 s, the bead's speed is 2 m/s\n- From 2–3 s, the bead's speed is 3 m/s\n- From 4–5 s, the bead's speed is 1 m/s\n\nAssume the fluid is incompressible and the flow is steady.\n\nWhich of the following claims is supported by the information?\n\nA. The pipe's radius between 0–1 s is smaller than between 2–3 s.\nB. The pipe's radius between 2–3 s is greater than between 4–5 s.\nC. The pipe's radius between 4–5 s is the largest of the three intervals.\nD. The pipe's radius between 2–3 s is one-third the radius during 4–5 s.",
  "image": "images/fluids_84.png",
  "step_by_step": [
    {
      "step": "Recall the continuity equation for incompressible flow",
      "explanation": "For an incompressible fluid in steady flow, the volume flow rate is constant: $A_1 v_1 = A_2 v_2 = \\text{constant}$. For a circular pipe, cross-sectional area $A = \\pi r^2$, so $\\pi r_1^2 v_1 = \\pi r_2^2 v_2$, which simplifies to $r_1^2 v_1 = r_2^2 v_2$."
    },
    {
      "step": "Establish the inverse relationship between speed and radius",
      "explanation": "From $r^2 v = \\text{constant}$, we have $v \\propto \\frac{1}{r^2}$. Therefore, higher speed corresponds to smaller radius, and lower speed corresponds to larger radius."
    },
    {
      "step": "Rank the speeds and corresponding radii",
      "explanation": "Given speeds:\n- $v_{2-3} = 3 \\, \\text{m/s}$ (fastest → smallest radius)\n- $v_{0-1} = 2 \\, \\text{m/s}$ (middle speed → middle radius)\n- $v_{4-5} = 1 \\, \\text{m/s}$ (slowest → largest radius)\n\nThus: $r_{2-3} < r_{0-1} < r_{4-5}$"
    },
    {
      "step": "Evaluate each claim systematically",
      "explanation": "A. 'Radius (0–1 s) is smaller than radius (2–3 s)'\nFrom the ranking: $r_{0-1} > r_{2-3}$, so this claim is false.\n\nB. 'Radius (2–3 s) is greater than radius (4–5 s)'\nFrom the ranking: $r_{2-3} < r_{4-5}$, so this claim is false.\n\nC. 'Radius (4–5 s) is the largest of the three intervals'\nFrom the ranking: $r_{4-5} > r_{0-1} > r_{2-3}$, so $r_{4-5}$ is indeed the largest. This claim is true.\n\nD. 'Radius (2–3 s) is one-third the radius during 4–5 s'\nUsing the relationship $r^2 v = \\text{constant}$:\n$r_{2-3}^2 \\cdot 3 = r_{4-5}^2 \\cdot 1$\n$3 r_{2-3}^2 = r_{4-5}^2$\n$\\frac{r_{2-3}}{r_{4-5}} = \\frac{1}{\\sqrt{3}} \\approx 0.577$, not $\\frac{1}{3} \\approx 0.333$\nThis claim is false."
    },
    {
      "step": "Conclusion",
      "explanation": "Only claim C is supported by the information. The pipe radius is largest where the speed is slowest (1 m/s during 4–5 s), consistent with the inverse square relationship between speed and radius for incompressible flow."
    }
  ],
  "final_answer": "C. The pipe's radius between 4–5 s is the largest of the three intervals."
},
{
  "number": 31,
  "problem": "A container, which is open at the top, is filled to a height $H$ with water. A small hole is located near the bottom of the container. Water flows from the hole and lands on the floor a horizontal distance $D$ from the container as shown in the figure. Which of the following claims about the distance the water lands from the container is correct?\n\n**Options:**\n\n- **A.** If the container were filled to the top with water, the water would land further from the container.\n- **B.** If the container were filled to a height $H$ with saltwater, which is more dense than fresh water, the water would land closer to the container.\n- **C.** If the container were filled to the top with water, and the container was sealed with a lid, the water would land further from the container.\n- **D.** If the container had a larger diameter, the water would land closer to the container.",
  "image": "images/fluids_85.png",
  "step_by_step": [
    {
      "step": "Derive the horizontal distance formula using Torricelli's law and projectile motion",
      "explanation": "For an open container, the exit speed of water from a hole at depth $h$ below the water surface is given by Torricelli's law:\n$v = \\sqrt{2gh}$\nwhere $h$ is the height of the water column above the hole.\n\nThe water exits horizontally and falls under gravity. The time to fall vertical distance $y$ (from hole to ground) is:\n$t = \\sqrt{\\frac{2y}{g}}$\n\nThe horizontal distance traveled is:\n$D = v \\times t = \\sqrt{2gh} \\times \\sqrt{\\frac{2y}{g}} = 2\\sqrt{hy}$"
    },
    {
      "step": "Analyze option A: Container filled to the top",
      "explanation": "If the container is filled to the top, $h$ increases (more water above the hole).\nFrom $D = 2\\sqrt{hy}$, when $h$ increases, $D$ increases.\nTherefore, the water lands further away.\n✓ Option A is correct."
    },
    {
      "step": "Analyze option B: Using saltwater instead of fresh water",
      "explanation": "Torricelli's law $v = \\sqrt{2gh}$ is independent of fluid density $\\rho$.\nThe density cancels in Bernoulli's equation when both the water surface and the hole are at atmospheric pressure.\nThus, exit speed $v$ remains the same for the same $h$, and $D$ is unchanged.\n✗ Option B is incorrect."
    },
    {
      "step": "Analyze option C: Sealed container with a lid",
      "explanation": "If the container is sealed with a lid but otherwise identical (no added pressure), the pressure at the water surface remains atmospheric.\nThe lid itself, without compressing air above the water, does not increase pressure.\nTherefore, $v = \\sqrt{2gh}$ still applies, and $D$ is unchanged from the open case.\nOnly if additional air pressure were applied would $v$ increase.\nThe problem statement does not indicate any pressure increase, so $D$ remains the same.\n✗ Option C is incorrect."
    },
    {
      "step": "Analyze option D: Larger container diameter",
      "explanation": "The diameter of the container does not appear in $D = 2\\sqrt{hy}$.\nTorricelli's law depends only on $h$, not on container cross-sectional area, as long as the hole is small and the water level drops slowly.\nA larger diameter would not change $h$ or $y$, so $D$ remains the same.\n✗ Option D is incorrect."
    }
  ],
  "final_answer": "A. If the container were filled to the top with water, the water would land further from the container."
},
{
  "number": 32,
  "problem": "Fluid is flowing in the tube with circular cross-sections shown in the figure. Section 1 of the tube has diameter $2d$ and Section 2 has diameter $d$. Which of the following correctly compares the volume flow rate $Q_1$ in Section 1 to the volume flow rate $Q_2$ in Section 2 and the speed of the fluid $v_1$ in Section 1 to the speed of the fluid $v_2$ in Section 2?\n\n**Options:**\n\n| Flow Rate | Speed    |\n|---|---|\n| A    | $Q_1 = Q_2$    | $v_1 = v_2$    |\n| B    | $Q_1 = Q_2$    | $v_1 < v_2$    |\n| C    | $Q_1 > Q_2$    | $v_1 = v_2$    |\n| D    | $Q_1 > Q_2$    | $v_1 < v_2$    |",
  "image": "images/fluids_86.png",
  "step_by_step": [
    {
      "step": "Apply the continuity equation for incompressible fluids",
      "explanation": "For an incompressible fluid in steady flow, the volume flow rate $Q$ must be constant throughout the tube.\nThe continuity equation states: $Q = A_1 v_1 = A_2 v_2 = \\text{constant}$\nTherefore: $Q_1 = Q_2$\nThis immediately eliminates options C and D, which claim $Q_1 > Q_2$."
    },
    {
      "step": "Calculate the cross-sectional areas of both sections",
      "explanation": "For a circular cross-section with diameter $D$, the area is:\n$A = \\pi \\left(\\frac{D}{2}\\right)^2 = \\frac{\\pi D^2}{4}$\n\nSection 1: Diameter $2d$\n$A_1 = \\frac{\\pi (2d)^2}{4} = \\frac{\\pi (4d^2)}{4} = \\pi d^2$\n\nSection 2: Diameter $d$\n$A_2 = \\frac{\\pi d^2}{4}$\n\nThus: $A_1 = 4A_2$"
    },
    {
      "step": "Relate speeds to areas using the constant flow rate",
      "explanation": "Since $Q = A_1 v_1 = A_2 v_2$ and $Q_1 = Q_2$:\n$A_1 v_1 = A_2 v_2$\n\nSolve for the speed ratio:\n$\\frac{v_1}{v_2} = \\frac{A_2}{A_1} = \\frac{A_2}{4A_2} = \\frac{1}{4}$\n\nTherefore: $v_1 = \\frac{1}{4} v_2$, or equivalently $v_1 < v_2$"
    },
    {
      "step": "Match the results to the answer choices",
      "explanation": "From our analysis:\n- Flow rate: $Q_1 = Q_2$\n- Speed: $v_1 < v_2$\n\nThis corresponds exactly to option B."
    }
  ],
  "final_answer": "B. $Q_1 = Q_2$ and $v_1 < v_2$"
},
{
  "number": 33,
  "problem": "A cylindrical container has two small tubes of the same size, each with a valve that can be opened, as shown in the figure. The diameter of the container is very large compared to the diameter of the tubes. Tube 1 is at the bottom of the container. Tube 2 is a distance $d$ above the bottom of the container.\n\nWith the valves closed, the container is filled with a fluid to a depth $2d$. The valve on Tube 1 is opened, and the fluid initially exits the tube at a speed $v_1$. The valve on Tube 1 is then closed, and the container is refilled to a depth $2d$ with the same fluid. When the valve on Tube 2 is opened, the fluid initially exits with a speed $v_2$.\n\nWhich of the following correctly compares $v_1$ and $v_2$?\n\n**Options:**\nA. $v_1 < v_2$\nB. $v_1 = v_2$\nC. $v_1 > v_2$\nD. The speeds cannot be compared without knowing the density of the fluid.",
  "image": "images/fluids_87.png",
  "step_by_step": [
    {
      "step": "Apply Torricelli's law for fluid exit speed",
      "explanation": "For a small hole in a container where the container diameter is much larger than the hole diameter, the exit speed of fluid is given by Torricelli's law:\n$v = \\sqrt{2gh}$\nwhere $h$ is the height of the fluid column above the hole, and $g$ is gravitational acceleration."
    },
    {
      "step": "Determine the depth of fluid above each tube",
      "explanation": "The container is filled to depth $2d$:\n- Tube 1 is at the bottom, so the fluid column above it is: $h_1 = 2d$\n- Tube 2 is at height $d$ above the bottom, so the fluid column above it is: $h_2 = 2d - d = d$"
    },
    {
      "step": "Calculate the exit speeds for each tube",
      "explanation": "For Tube 1:\n$v_1 = \\sqrt{2g \\cdot h_1} = \\sqrt{2g \\cdot 2d} = \\sqrt{4gd} = 2\\sqrt{gd}$\n\nFor Tube 2:\n$v_2 = \\sqrt{2g \\cdot h_2} = \\sqrt{2g \\cdot d} = \\sqrt{2gd}$"
    },
    {
      "step": "Compare the two speeds",
      "explanation": "Compare the expressions:\n$v_1 = 2\\sqrt{gd}$\n$v_2 = \\sqrt{2gd}$\n\nSince $2\\sqrt{gd} > \\sqrt{2gd}$ (because $2 > \\sqrt{2} \\approx 1.414$), we have:\n$v_1 > v_2$"
    },
    {
      "step": "Verify independence from fluid density",
      "explanation": "Torricelli's law $v = \\sqrt{2gh}$ does not contain fluid density $\\rho$. The density cancels in the Bernoulli's equation derivation because both the fluid surface and the exit hole are at atmospheric pressure. Therefore, knowledge of density is not required to compare the speeds."
    },
    {
      "step": "Evaluate each option",
      "explanation": "A. $v_1 < v_2$ - Incorrect (our calculation shows $v_1 > v_2$)\nB. $v_1 = v_2$ - Incorrect (the depths are different, so speeds are different)\nC. $v_1 > v_2$ - Correct (matches our calculation)\nD. The speeds cannot be compared without knowing the density - Incorrect (speed is independent of density for this configuration)"
    }
  ],
  "final_answer": "C. $v_1 > v_2$"
},
{
  "number": 34,
  "problem": "A cylindrical water reservoir connected to a hose is used to fill a small cup, as shown in the figure. The diameter of the reservoir is $D$ and the diameter of the hose is $d$, where $D > d$. Point 1, inside the reservoir, and Point 2, inside the hose, are at the same height. Which of the following correctly compares $P_1$, the pressure at Point 1, to $P_2$, the pressure at Point 2?\n\n**Options:**\nA. $P_1 > P_2$\nB. $P_1 = P_2$\nC. $P_1 < P_2$\nD. The pressures cannot be compared without knowing the ratio of the diameters of the reservoir and tube",
  "image": "images/fluids_88.png",
  "step_by_step": [
    {
      "step": "Apply the continuity equation for incompressible flow",
      "explanation": "For steady, incompressible flow, the volume flow rate $Q$ is constant throughout the system:\n$Q = A_1 v_1 = A_2 v_2$\nwhere $A_1$ and $v_1$ are the cross-sectional area and speed at Point 1 (reservoir), and $A_2$ and $v_2$ are at Point 2 (hose)."
    },
    {
      "step": "Compare cross-sectional areas and speeds",
      "explanation": "Cross-sectional areas for circular sections:\n$A_1 = \\pi \\left(\\frac{D}{2}\\right)^2 = \\frac{\\pi D^2}{4}$\n$A_2 = \\pi \\left(\\frac{d}{2}\\right)^2 = \\frac{\\pi d^2}{4}$\n\nSince $D > d$, we have $A_1 > A_2$.\n\nFrom the continuity equation $A_1 v_1 = A_2 v_2$:\n$v_2 = \\frac{A_1}{A_2} v_1 > v_1$\nTherefore: $v_2 > v_1$"
    },
    {
      "step": "Apply Bernoulli's equation for points at the same height",
      "explanation": "Bernoulli's equation for two points at the same elevation ($y_1 = y_2$) simplifies to:\n$P_1 + \\frac{1}{2} \\rho v_1^2 = P_2 + \\frac{1}{2} \\rho v_2^2$\nwhere $\\rho$ is the fluid density, and $P_1$, $P_2$ are the pressures."
    },
    {
      "step": "Solve for the pressure difference",
      "explanation": "Rearrange Bernoulli's equation:\n$P_1 - P_2 = \\frac{1}{2} \\rho (v_2^2 - v_1^2)$\n\nSince $v_2 > v_1$, we have $v_2^2 > v_1^2$, so $v_2^2 - v_1^2 > 0$.\nTherefore: $P_1 - P_2 > 0$, or $P_1 > P_2$"
    },
    {
      "step": "Interpret the physical meaning",
      "explanation": "The pressure is higher in the wider section (reservoir) where the flow is slower, and lower in the narrower section (hose) where the flow is faster. This is a direct consequence of energy conservation: kinetic energy increases at the expense of pressure energy."
    },
    {
      "step": "Evaluate each option",
      "explanation": "A. $P_1 > P_2$ - Correct (derived from Bernoulli's principle)\nB. $P_1 = P_2$ - Incorrect (would require $v_1 = v_2$, which contradicts $A_1 > A_2$)\nC. $P_1 < P_2$ - Incorrect (would violate energy conservation for this flow)\nD. The pressures cannot be compared without knowing the ratio - Incorrect (we can determine the qualitative relationship $P_1 > P_2$ without specific numerical values)"
    }
  ],
  "final_answer": "A. $P_1 > P_2$"
},
{
  "number": 35,
  "problem": "Four tubes each have one section of radius $r$ and one section of radius $2r$, which are at different heights. Water flows in the tubes, passing point $X$ and then point $Y$, where both points are located in sections of the tube with constant radii. The vertical distance between $X$ and $Y$ is always $h$. Which of the following figures (A, B, C, or D) shows a configuration where the pressure at $Y$ must be greater than the pressure at $X$?",
  "image": "images/fluids_89.png",
  "step_by_step": [
    {
      "step": "Apply Bernoulli's equation for points X and Y",
      "explanation": "For incompressible, steady flow of water, Bernoulli's equation states:\n$P_X + \\frac{1}{2}\\rho v_X^2 + \\rho g h_X = P_Y + \\frac{1}{2}\\rho v_Y^2 + \\rho g h_Y$\nRearrange to find the pressure difference:\n$P_Y - P_X = \\rho g (h_X - h_Y) + \\frac{1}{2}\\rho (v_X^2 - v_Y^2)$"
    },
    {
      "step": "Apply the continuity equation for volume flow rate",
      "explanation": "Since the cross-sectional area changes between sections, the continuity equation gives:\n$A_X v_X = A_Y v_Y$\nFor circular tubes: $A = \\pi r^2$\nThus: $r_X^2 v_X = r_Y^2 v_Y$\nIf $X$ is in narrow section ($r$) and $Y$ is in wide section ($2r$): $v_Y = \\frac{v_X}{4}$\nIf $X$ is in wide section ($2r$) and $Y$ is in narrow section ($r$): $v_Y = 4v_X$"
    },
    {
      "step": "Analyze conditions for $P_Y > P_X$",
      "explanation": "For $P_Y > P_X$, we need:\n$\\rho g (h_X - h_Y) + \\frac{1}{2}\\rho (v_X^2 - v_Y^2) > 0$\nThis requires the sum of height and velocity terms to be positive.\n\nKey factors:\n1. Height term: Positive if $h_X > h_Y$ (Y is lower than X)\n2. Velocity term: Positive if $v_X > v_Y$"
    },
    {
      "step": "Evaluate configuration possibilities",
      "explanation": "Two main cases:\n\nCase 1: $X$ in narrow ($r$), $Y$ in wide ($2r$)\n- Velocity term: $v_X > v_Y$ (since $v_Y = v_X/4$) → positive\n- Height term: Need $h_X > h_Y$ (Y lower) to be positive\n- Both terms positive → $P_Y > P_X$ guaranteed\n\nCase 2: $X$ in wide ($2r$), $Y$ in narrow ($r$)\n- Velocity term: $v_X < v_Y$ (since $v_Y = 4v_X$) → negative\n- Height term: Could be positive if Y is lower\n- Terms oppose each other → not guaranteed $P_Y > P_X$"
    },
    {
      "step": "Identify the required configuration from the figures",
      "explanation": "We need a configuration where:\n1. $X$ is in the narrow section (radius $r$)\n2. $Y$ is in the wide section (radius $2r$)\n3. $Y$ is vertically below $X$ ($h_X > h_Y$)\n4. Flow direction is $X$ → $Y$\n\nThis ensures both terms in $P_Y - P_X$ are positive, guaranteeing $P_Y > P_X$ regardless of specific numerical values."
    },
    {
      "step": "Match to the correct figure",
      "explanation": "Based on the analysis, the correct figure (from the image) shows:\n- $X$ in the upper, narrow section\n- $Y$ in the lower, wide section\n- Flow from $X$ to $Y$\nThis corresponds to Option C in the provided figure."
    }
  ],
  "final_answer": "C"
},
{
  "number": 36,
  "problem": "A large, empty plastic jug with mass $m_j$ and volume $V_j$ floats in a pool of water, as shown in the figure. If the density of water is $\\rho_w$, which of the following expressions is equal to the volume of water $V_w$, that must be added to the jug so that the top of the jug will be at the level of the water?\n\n**Options:**\n\nA. $\\frac{m_j}{\\rho_w}$\nB. $\\frac{m_j}{\\rho_w} - V_j$\nC. $V_j$\nD. $V_j - \\frac{m_j}{\\rho_w}$",
  "image": "images/fluids_90.png",
  "step_by_step": [
    {
      "step": "Identify the equilibrium condition",
      "explanation": "For the jug to float with its top exactly at the water level, it must be fully submerged (just barely floating). In this state, the buoyant force equals the total weight of the jug plus the added water."
    },
    {
      "step": "Express the total weight of the system",
      "explanation": "Total weight = weight of empty jug + weight of added water\n$W_{\\text{total}} = m_j g + \\rho_w V_w g$\nwhere $\\rho_w$ is water density, $V_w$ is volume of added water, and $g$ is gravitational acceleration."
    },
    {
      "step": "Express the buoyant force",
      "explanation": "When fully submerged, the jug displaces a volume of water equal to its own volume $V_j$.\nBuoyant force = weight of displaced water\n$F_B = \\rho_w V_j g$"
    },
    {
      "step": "Set up the equilibrium equation",
      "explanation": "For floating equilibrium:\nBuoyant force = Total weight\n$\\rho_w V_j g = m_j g + \\rho_w V_w g$"
    },
    {
      "step": "Simplify and solve for $V_w$",
      "explanation": "Cancel $g$ from all terms:\n$\\rho_w V_j = m_j + \\rho_w V_w$\n\nRearrange to isolate $V_w$:\n$\\rho_w V_w = \\rho_w V_j - m_j$\n\nDivide both sides by $\\rho_w$:\n$V_w = V_j - \\frac{m_j}{\\rho_w}$"
    },
    {
      "step": "Interpret the result",
      "explanation": "The expression $\\frac{m_j}{\\rho_w}$ represents the volume of water that has the same mass as the empty jug. This is the volume of water displaced by the jug alone if it were completely submerged without any added water.\n\n$V_j - \\frac{m_j}{\\rho_w}$ represents how much additional volume needs to be filled with water to make the total mass sufficient to just submerge the jug."
    },
    {
      "step": "Check each option",
      "explanation": "A. $\\frac{m_j}{\\rho_w}$ - This is only the volume equivalent to the jug's mass, not the water to add\nB. $\\frac{m_j}{\\rho_w} - V_j$ - This is negative since $V_j > \\frac{m_j}{\\rho_w}$ (jug floats when empty)\nC. $V_j$ - This would fill the entire jug, but some air might remain; not correct for equilibrium\nD. $V_j - \\frac{m_j}{\\rho_w}$ - Matches our derived expression"
    }
  ],
  "final_answer": "D. $V_j - \\frac{m_j}{\\rho_w}$"
},
{
  "number": 37,
  "problem": "A cylindrical tank of height $H$ and cross-sectional area $A$ is filled with water to a depth $h$. A small hole of area $a$ ($a \\ll A$) is drilled at the bottom of the tank. The water exits the hole with speed $v$. Which of the following expressions gives the time $t$ required for the tank to completely drain?\n\n**Options:**\n\nA) $t = \\frac{A}{a} \\sqrt{\\frac{2h}{g}}$\nB) $t = \\frac{A}{a} \\sqrt{\\frac{h}{2g}}$\nC) $t = \\frac{AH}{a\\sqrt{2gh}}$\nD) $t = \\frac{A\\sqrt{h}}{a\\sqrt{g}}$",
  "image": null,
  "step_by_step": [
    {
      "step": "Establish the relationship between water height and exit speed",
      "explanation": "From Torricelli's law, the speed of water exiting a small hole at the bottom of a tank is:\n$v = \\sqrt{2gh}$\nwhere $h$ is the instantaneous height of water above the hole.\nAs the tank drains, $h$ decreases, so $v$ also decreases."
    },
    {
      "step": "Set up the differential equation for drainage",
      "explanation": "The volume flow rate out of the hole is:\n$Q = a v = a \\sqrt{2gh}$\n\nThe rate of change of water volume in the tank is:\n$\\frac{dV}{dt} = -Q = -a \\sqrt{2gh}$\n\nSince $V = A h$ (for constant cross-sectional area):\n$\\frac{dV}{dt} = A \\frac{dh}{dt}$\n\nThus: $A \\frac{dh}{dt} = -a \\sqrt{2gh}$"
    },
    {
      "step": "Separate variables and integrate",
      "explanation": "Rearrange the differential equation:\n$\\frac{dh}{\\sqrt{h}} = -\\frac{a \\sqrt{2g}}{A} dt$\n\nIntegrate from initial height $h$ to final height $0$:\n$\\int_h^0 h^{-1/2} dh = -\\frac{a \\sqrt{2g}}{A} \\int_0^t dt$\n\nEvaluate the integrals:\n$\\left[ 2\\sqrt{h} \\right]_h^0 = -\\frac{a \\sqrt{2g}}{A} t$\n\n$-2\\sqrt{h} = -\\frac{a \\sqrt{2g}}{A} t$"
    },
    {
      "step": "Solve for time $t$",
      "explanation": "Simplify the equation:\n$2\\sqrt{h} = \\frac{a \\sqrt{2g}}{A} t$\n\nRearrange for $t$:\n$t = \\frac{2A\\sqrt{h}}{a \\sqrt{2g}}$\n\nSimplify the expression:\n$t = \\frac{2A\\sqrt{h}}{a \\sqrt{2g}} = \\frac{A}{a} \\cdot \\frac{2\\sqrt{h}}{\\sqrt{2g}} = \\frac{A}{a} \\cdot \\frac{\\sqrt{4h}}{\\sqrt{2g}} = \\frac{A}{a} \\sqrt{\\frac{2h}{g}}$"
    },
    {
      "step": "Verify using average velocity method",
      "explanation": "Alternative approach: The exit velocity decreases linearly with $\\sqrt{h}$, so the average velocity is:\n$v_{\\text{avg}} = \\frac{\\sqrt{2gh} + 0}{2} = \\frac{\\sqrt{2gh}}{2}$\n\nTotal volume to drain: $V = A h$\nAverage flow rate: $Q_{\\text{avg}} = a v_{\\text{avg}} = a \\cdot \\frac{\\sqrt{2gh}}{2}$\n\nTime: $t = \\frac{V}{Q_{\\text{avg}}} = \\frac{A h}{a \\cdot \\frac{\\sqrt{2gh}}{2}} = \\frac{2A h}{a \\sqrt{2gh}} = \\frac{A}{a} \\sqrt{\\frac{2h}{g}}$\nSame result."
    },
    {
      "step": "Compare with answer choices",
      "explanation": "A) $t = \\frac{A}{a} \\sqrt{\\frac{2h}{g}}$ - Matches our derived expression ✓\nB) $t = \\frac{A}{a} \\sqrt{\\frac{h}{2g}}$ - Factor of 2 in wrong place ✗\nC) $t = \\frac{AH}{a\\sqrt{2gh}}$ - Includes $H$ (tank height) instead of $h$ (water depth) ✗\nD) $t = \\frac{A\\sqrt{h}}{a\\sqrt{g}}$ - Missing factor of $\\sqrt{2}$ ✗"
    }
  ],
  "final_answer": "A) $t = \\frac{A}{a} \\sqrt{\\frac{2h}{g}}$"
},
{
  "number": 38,
  "problem": "A large container holds a volume $V_w$ of water that has a density $\\rho_w$. A cube with volume $V_c$ and density $\\rho_c$ floats partially submerged in the water. Which of the following expressions is equal to the buoyant force on the cube?\n\n**Options:**\n\nA. $\\rho_c V_c g$\nB. $\\rho_w V_c g$\nC. $\\rho_c V_w g$\nD. $\\rho_w V_w g$",
  "image": "images/fluids_92.png",
  "step_by_step": [
    {
      "step": "Recall Archimedes' principle for buoyant force",
      "explanation": "Archimedes' principle states: The buoyant force on an object immersed in a fluid equals the weight of the fluid displaced by the object.\nMathematically: $F_B = \\rho_{\\text{fluid}} V_{\\text{displaced}} g$"
    },
    {
      "step": "Identify the relevant quantities for this problem",
      "explanation": "In this case:\n- The fluid is water with density $\\rho_w$\n- The cube is floating partially submerged, so it displaces a volume of water $V_{\\text{sub}}$ (submerged volume)\nThus: $F_B = \\rho_w V_{\\text{sub}} g$"
    },
    {
      "step": "Apply the floating condition",
      "explanation": "For an object floating in equilibrium:\nBuoyant force = Weight of the object\n$F_B = W_{\\text{cube}} = \\rho_c V_c g$\nThis is true regardless of how much of the cube is submerged."
    },
    {
      "step": "Relate the submerged volume to the cube's properties",
      "explanation": "From the floating condition and Archimedes' principle:\n$\\rho_w V_{\\text{sub}} g = \\rho_c V_c g$\nTherefore: $V_{\\text{sub}} = \\frac{\\rho_c}{\\rho_w} V_c$\nThe submerged volume depends on the density ratio."
    },
    {
      "step": "Evaluate each option",
      "explanation": "A. $\\rho_c V_c g$ - This is the weight of the cube. For a floating object, buoyant force equals weight, so this is correct. ✓\n\nB. $\\rho_w V_c g$ - This would be the weight of water that would fill the entire cube volume. But the cube is only partially submerged ($V_{\\text{sub}} < V_c$), so this overestimates the buoyant force. ✗\n\nC. $\\rho_c V_w g$ - This uses the wrong density (cube's density instead of water's) and the wrong volume (container's water volume instead of displaced volume). ✗\n\nD. $\\rho_w V_w g$ - This is the total weight of all water in the container, not the weight of water displaced by the cube. ✗"
    },
    {
      "step": "Explain why option A is correct despite not containing $\\rho_w$",
      "explanation": "Option A gives the cube's weight. Since the cube is floating, the buoyant force exactly balances the cube's weight. Therefore, $F_B = \\rho_c V_c g$.\n\nWhile the expression $\\rho_w V_{\\text{sub}} g$ also equals the buoyant force, it contains $V_{\\text{sub}}$ which is not given. Among the provided options, only option A correctly represents the buoyant force for a floating object."
    }
  ],
  "final_answer": "A. $\\rho_c V_c g$"
},
{
  "number": 39,
  "problem": "An inflated spherical balloon is fully submerged just below the surface of a pool. The radius of the balloon is $3r$, and the buoyant force on the balloon is $F_{B,1}$. The balloon is then pushed further beneath the surface to a point where the water pressure has caused the radius of the balloon to be reduced to $2r$, and the buoyant force on the balloon is $F_{B,2}$. What is the ratio $F_{B,1} : F_{B,2}$?\n\n**Options:**\n\nA. 1 : 1\nB. 3 : 2\nC. 9 : 4\nD. 27 : 8",
  "image": "images/fluids_93.png",
  "step_by_step": [
    {
      "step": "Recall Archimedes' principle for buoyant force",
      "explanation": "The buoyant force on a fully submerged object equals the weight of the fluid it displaces:\n$F_B = \\rho_{\\text{fluid}} V_{\\text{displaced}} g$\nwhere $\\rho_{\\text{fluid}}$ is the fluid density, $V_{\\text{displaced}}$ is the volume of fluid displaced, and $g$ is gravitational acceleration."
    },
    {
      "step": "Identify the displaced volume for a fully submerged balloon",
      "explanation": "When the balloon is fully submerged, it displaces a volume of water equal to its own volume. Since the balloon is spherical:\nVolume of sphere = $\\frac{4}{3} \\pi R^3$\nwhere $R$ is the radius of the balloon."
    },
    {
      "step": "Calculate the volume at each radius",
      "explanation": "At the surface (initial state): Radius = $3r$\n$V_1 = \\frac{4}{3} \\pi (3r)^3 = \\frac{4}{3} \\pi (27r^3) = 36\\pi r^3$\n\nAt depth (compressed state): Radius = $2r$\n$V_2 = \\frac{4}{3} \\pi (2r)^3 = \\frac{4}{3} \\pi (8r^3) = \\frac{32}{3} \\pi r^3$"
    },
    {
      "step": "Express the buoyant forces in terms of volumes",
      "explanation": "Since the balloon is fully submerged in both cases and in the same fluid (water), the buoyant forces are:\n$F_{B,1} = \\rho_w V_1 g$\n$F_{B,2} = \\rho_w V_2 g$\nwhere $\\rho_w$ is water density (constant)."
    },
    {
      "step": "Calculate the ratio of buoyant forces",
      "explanation": "The ratio is:\n$\\frac{F_{B,1}}{F_{B,2}} = \\frac{\\rho_w V_1 g}{\\rho_w V_2 g} = \\frac{V_1}{V_2}$\n\nSubstitute the volumes:\n$\\frac{F_{B,1}}{F_{B,2}} = \\frac{36\\pi r^3}{\\frac{32}{3}\\pi r^3} = \\frac{36}{\\frac{32}{3}} = 36 \\times \\frac{3}{32} = \\frac{108}{32} = \\frac{27}{8}$"
    },
    {
      "step": "Simplify the ratio",
      "explanation": "$\\frac{27}{8}$ expressed as a ratio is 27 : 8"
    },
    {
      "step": "Check each option",
      "explanation": "A. 1 : 1 - Would require equal volumes, but radii are different\nB. 3 : 2 - This is the ratio of radii (3:2), but volume ratio is cube of radius ratio\nC. 9 : 4 - This is the ratio of surface areas or square of radius ratio\nD. 27 : 8 - Correct, since $(3:2)^3 = 27:8$"
    },
    {
      "step": "General relationship",
      "explanation": "For spherical objects, volume is proportional to $R^3$, so the buoyant force ratio is:\n$\\frac{F_{B,1}}{F_{B,2}} = \\left(\\frac{R_1}{R_2}\\right)^3 = \\left(\\frac{3r}{2r}\\right)^3 = \\left(\\frac{3}{2}\\right)^3 = \\frac{27}{8}$"
    }
  ],
  "final_answer": "D. 27 : 8"
},
{
  "number": 40,
  "problem": "A spherical balloon is inflated while it is under water, as shown. The balloon is inflated so that the diameter of the balloon increases linearly with time. Which of the following graphs best represents the buoyant force exerted on the balloon as a function of the balloon's radius?",
  "image": "images/fluids_94.png",
  "step_by_step": [
    {
      "step": "Recall the formula for buoyant force",
      "explanation": "According to Archimedes' principle, the buoyant force on a fully submerged object is:\n$F_B = \\rho_{\\text{fluid}} V_{\\text{displaced}} g$\nwhere $\\rho_{\\text{fluid}}$ is the fluid density (water), $V_{\\text{displaced}}$ is the volume of fluid displaced, and $g$ is gravitational acceleration."
    },
    {
      "step": "Determine the displaced volume",
      "explanation": "Since the balloon is fully submerged underwater, it displaces a volume of water equal to its own volume. For a spherical balloon with radius $r$:\nVolume $V = \\frac{4}{3} \\pi r^3$"
    },
    {
      "step": "Express buoyant force as a function of radius",
      "explanation": "Substitute the volume into the buoyant force formula:\n$F_B = \\rho_w g \\cdot \\frac{4}{3} \\pi r^3$\nwhere $\\rho_w$ is water density.\n\nSince $\\rho_w$, $g$, and $\\frac{4}{3}\\pi$ are constants:\n$F_B \\propto r^3$\nThe buoyant force is proportional to the cube of the radius."
    },
    {
      "step": "Analyze the functional relationship",
      "explanation": "For a cubic relationship $F_B \\propto r^3$:\n- When $r = 0$, $F_B = 0$\n- As $r$ increases, $F_B$ increases rapidly (cubically)\n- The graph should be a curve that gets steeper as $r$ increases\n- It is not linear (straight line), quadratic (parabola), or inversely proportional"
    },
    {
      "step": "Consider the diameter-time relationship",
      "explanation": "The problem states the diameter increases linearly with time. Since diameter $D = 2r$, this means radius also increases linearly with time:\n$r \\propto t$\n\nTherefore, $F_B \\propto r^3 \\propto t^3$\nThe buoyant force increases with the cube of time, but the question asks for buoyant force vs. radius, not vs. time."
    },
    {
      "step": "Identify the correct graph type",
      "explanation": "Among the graphs shown in the image:\n- A linear graph would represent $F_B \\propto r$\n- A quadratic graph would represent $F_B \\propto r^2$\n- A cubic graph would represent $F_B \\propto r^3$\n- An inverse relationship would represent $F_B \\propto 1/r$ or similar\n\nThe correct graph should show $F_B$ increasing as $r^3$, which is a curve that becomes progressively steeper as $r$ increases."
    }
  ],
  "final_answer": "C (The graph showing a cubic relationship where buoyant force increases as the cube of the radius)"
},
{
  "number": 41,
  "problem": "A solid cylinder of density $\\rho_c = 800 \\, \\text{kg/m}^3$, height $h = 0.5 \\, \\text{m}$, and cross-sectional area $A = 0.1 \\, \\text{m}^2$ floats vertically in a liquid of density $\\rho_l = 1200 \\, \\text{kg/m}^3$. What is the distance $d$ from the bottom of the cylinder to the liquid surface when the cylinder is in equilibrium?\n\n**Options:**\n\nA. 0.20 m\nB. 0.33 m\nC. 0.40 m\nD. 0.25 m",
  "image": null,
  "step_by_step": [
    {
      "step": "Set up the equilibrium condition",
      "explanation": "When the cylinder floats in equilibrium, the buoyant force equals the weight of the cylinder:\n$F_B = W_{\\text{cylinder}}$"
    },
    {
      "step": "Express the weight of the cylinder",
      "explanation": "Weight = density × volume × g\n$W = \\rho_c V_c g = \\rho_c (A h) g$\nwhere $V_c = A h$ is the total volume of the cylinder."
    },
    {
      "step": "Express the buoyant force",
      "explanation": "Buoyant force = weight of displaced liquid\n$F_B = \\rho_l V_{\\text{sub}} g$\nwhere $V_{\\text{sub}}$ is the submerged volume.\n\nSince the cylinder floats vertically, the submerged volume is:\n$V_{\\text{sub}} = A h_{\\text{sub}}$\nwhere $h_{\\text{sub}}$ is the submerged height."
    },
    {
      "step": "Apply the equilibrium condition",
      "explanation": "Set buoyant force equal to weight:\n$\\rho_l (A h_{\\text{sub}}) g = \\rho_c (A h) g$"
    },
    {
      "step": "Simplify and solve for submerged height",
      "explanation": "Cancel common factors $A$ and $g$:\n$\\rho_l h_{\\text{sub}} = \\rho_c h$\n\nSolve for $h_{\\text{sub}}$:\n$h_{\\text{sub}} = \\frac{\\rho_c}{\\rho_l} h$"
    },
    {
      "step": "Substitute numerical values",
      "explanation": "Given:\n$\\rho_c = 800 \\, \\text{kg/m}^3$\n$\\rho_l = 1200 \\, \\text{kg/m}^3$\n$h = 0.5 \\, \\text{m}$\n\n$h_{\\text{sub}} = \\frac{800}{1200} \\times 0.5 = \\frac{2}{3} \\times 0.5 = 0.3333 \\, \\text{m}$"
    },
    {
      "step": "Interpret the result",
      "explanation": "The submerged height $h_{\\text{sub}} = 0.333 \\, \\text{m}$ is the portion of the cylinder that is underwater. The distance $d$ from the bottom of the cylinder to the liquid surface is exactly this submerged height, since the cylinder floats vertically.\nTherefore: $d = h_{\\text{sub}} = 0.33 \\, \\text{m}$"
    },
    {
      "step": "Check each option",
      "explanation": "A. 0.20 m - Too small (would require $\\rho_c/\\rho_l = 0.4$, not $2/3$)\nB. 0.33 m - Correct (matches our calculation)\nC. 0.40 m - Too large (would require $\\rho_c/\\rho_l = 0.8$, not $2/3$)\nD. 0.25 m - Too small (would require $\\rho_c/\\rho_l = 0.5$, not $2/3$)"
    }
  ],
  "final_answer": "B. 0.33 m"
},
{
  "number": 42,
  "problem": "A cylindrical wooden log of density $\\rho_l$, radius $r$, and length $L$ floats vertically in water (density $\\rho_w$). A weight of mass $m$ is placed on top of the log, causing it to sink further until a new equilibrium is reached.\n\nDerive an equation for the additional submerged length $\\Delta h$ of the log when the weight is added. Express your answer in terms of $\\rho_l$, $\\rho_w$, $r$, $L$, $m$, and fundamental constants.",
  "image": null,
  "step_by_step": [
    {
      "step": "Analyze initial equilibrium (without weight)",
      "explanation": "Initially, the log floats vertically. Let $h$ be the submerged length.\nThe submerged volume is: $V_{\\text{sub}} = \\pi r^2 h$\nBuoyant force: $F_B = \\rho_w V_{\\text{sub}} g = \\rho_w \\pi r^2 h g$\nWeight of log: $W_l = \\rho_l V_{\\text{log}} g = \\rho_l \\pi r^2 L g$\n\nEquilibrium: $F_B = W_l$\n$\\rho_w \\pi r^2 h g = \\rho_l \\pi r^2 L g$"
    },
    {
      "step": "Solve for initial submerged length $h$",
      "explanation": "Cancel common factors $\\pi r^2 g$:\n$\\rho_w h = \\rho_l L$\n$h = \\frac{\\rho_l}{\\rho_w} L$"
    },
    {
      "step": "Analyze new equilibrium (with added weight)",
      "explanation": "After adding mass $m$, the log sinks further by $\\Delta h$.\nNew submerged length = $h + \\Delta h$\nNew submerged volume = $\\pi r^2 (h + \\Delta h)$\nNew buoyant force: $F_B' = \\rho_w \\pi r^2 (h + \\Delta h) g$\n\nTotal weight now: $W_{\\text{total}} = W_l + mg = \\rho_l \\pi r^2 L g + mg$"
    },
    {
      "step": "Set up new equilibrium equation",
      "explanation": "New equilibrium: $F_B' = W_{\\text{total}}$\n$\\rho_w \\pi r^2 (h + \\Delta h) g = \\rho_l \\pi r^2 L g + mg$"
    },
    {
      "step": "Substitute expression for $h$ from step 2",
      "explanation": "Replace $h$ with $\\frac{\\rho_l}{\\rho_w} L$:\n$\\rho_w \\pi r^2 \\left( \\frac{\\rho_l}{\\rho_w} L + \\Delta h \\right) g = \\rho_l \\pi r^2 L g + mg$"
    },
    {
      "step": "Simplify the equation",
      "explanation": "Expand left side:\n$\\rho_w \\pi r^2 \\left( \\frac{\\rho_l}{\\rho_w} L \\right) g + \\rho_w \\pi r^2 \\Delta h g = \\rho_l \\pi r^2 L g + mg$\n\nFirst term on left: $\\rho_w \\pi r^2 \\cdot \\frac{\\rho_l}{\\rho_w} L g = \\rho_l \\pi r^2 L g$\n\nThis cancels with first term on right:\n$\\rho_l \\pi r^2 L g + \\rho_w \\pi r^2 \\Delta h g = \\rho_l \\pi r^2 L g + mg$"
    },
    {
      "step": "Solve for $\\Delta h$",
      "explanation": "Cancel $\\rho_l \\pi r^2 L g$ from both sides:\n$\\rho_w \\pi r^2 \\Delta h g = mg$\n\nSolve for $\\Delta h$:\n$\\Delta h = \\frac{mg}{\\rho_w \\pi r^2 g}$\n\nCancel $g$:\n$\\Delta h = \\frac{m}{\\rho_w \\pi r^2}$"
    },
    {
      "step": "Interpret the result",
      "explanation": "The additional submerged length depends only on:\n- The added mass $m$\n- Water density $\\rho_w$\n- Cross-sectional area of the log $\\pi r^2$\n\nIt does not depend on the log's density $\\rho_l$ or length $L$, because these determine the initial submerged depth but not how much additional sinking occurs when extra weight is added."
    }
  ],
  "final_answer": "$\\Delta h = \\frac{m}{\\rho_w \\pi r^2}$"
},
{
  "number": 43,
  "problem": "Water flows steadily through a horizontal pipe that narrows from a cross-sectional area of $A_1$ to $A_2$. The height remains constant, and the flow is incompressible and non-viscous.\n\nUsing the continuity equation and Bernoulli's equation, derive an expression for the pressure difference $P_1 - P_2$ between the wider section and the narrower section of the pipe in terms of $\\rho, A_1, A_2$, and the fluid speed $v_1$ at the wider section.",
  "image": null,
  "step_by_step": [
    {
      "step": "Apply the continuity equation for incompressible flow",
      "explanation": "For steady, incompressible flow, the volume flow rate is constant:\n$Q = A_1 v_1 = A_2 v_2$\nwhere $v_1$ is speed at wider section (area $A_1$) and $v_2$ is speed at narrower section (area $A_2$)."
    },
    {
      "step": "Solve for $v_2$ in terms of $v_1$",
      "explanation": "From the continuity equation:\n$v_2 = \\frac{A_1}{A_2} v_1$"
    },
    {
      "step": "Apply Bernoulli's equation for horizontal flow",
      "explanation": "Since the pipe is horizontal, the height terms cancel. Bernoulli's equation simplifies to:\n$P_1 + \\frac{1}{2} \\rho v_1^2 = P_2 + \\frac{1}{2} \\rho v_2^2$\nwhere $\\rho$ is fluid density, $P_1$ and $P_2$ are pressures."
    },
    {
      "step": "Rearrange to find pressure difference",
      "explanation": "Solve for $P_1 - P_2$:\n$P_1 - P_2 = \\frac{1}{2} \\rho v_2^2 - \\frac{1}{2} \\rho v_1^2$\n$P_1 - P_2 = \\frac{1}{2} \\rho (v_2^2 - v_1^2)$"
    },
    {
      "step": "Substitute expression for $v_2$",
      "explanation": "Replace $v_2$ with $\\frac{A_1}{A_2} v_1$:\n$P_1 - P_2 = \\frac{1}{2} \\rho \\left[ \\left( \\frac{A_1}{A_2} v_1 \\right)^2 - v_1^2 \\right]$"
    },
    {
      "step": "Simplify the expression",
      "explanation": "$P_1 - P_2 = \\frac{1}{2} \\rho \\left[ \\left( \\frac{A_1^2}{A_2^2} \\right) v_1^2 - v_1^2 \\right]$\n$P_1 - P_2 = \\frac{1}{2} \\rho v_1^2 \\left( \\frac{A_1^2}{A_2^2} - 1 \\right)$\n$P_1 - P_2 = \\frac{1}{2} \\rho v_1^2 \\left[ \\left( \\frac{A_1}{A_2} \\right)^2 - 1 \\right]$"
    },
    {
      "step": "Interpret the result",
      "explanation": "Since $A_1 > A_2$ (pipe narrows), $\\frac{A_1}{A_2} > 1$, so $\\left( \\frac{A_1}{A_2} \\right)^2 - 1 > 0$.\nThus $P_1 - P_2 > 0$, meaning pressure is higher in the wider section where flow is slower. This is consistent with Bernoulli's principle."
    }
  ],
  "final_answer": "$P_1 - P_2 = \\frac{1}{2} \\rho v_1^2 \\left[ \\left( \\frac{A_1}{A_2} \\right)^2 - 1 \\right]$"
},
{
  "number": 44,
  "problem": "A spherical balloon of radius $R$ is filled with a gas of negligible mass and tethered to the ground in air of density $\\rho_{\\text{air}}$. The total mass of the balloon's envelope and payload is $m$.\n\nDerive an equation for the tension $T$ in the tether when the balloon is in equilibrium.",
  "image": null,
  "step_by_step": [
    {
      "step": "Identify forces acting on the balloon",
      "explanation": "When the balloon is in equilibrium and tethered:\n1. Buoyant force $F_B$ (upward)\n2. Weight $W$ (downward)\n3. Tension $T$ in the tether (downward, since the tether holds the balloon down)"
    },
    {
      "step": "Apply Archimedes' principle for buoyant force",
      "explanation": "The buoyant force equals the weight of air displaced by the balloon:\n$F_B = \\rho_{\\text{air}} V g$\nwhere $V$ is the volume of the balloon."
    },
    {
      "step": "Calculate the volume of the spherical balloon",
      "explanation": "Volume of a sphere with radius $R$:\n$V = \\frac{4}{3} \\pi R^3$"
    },
    {
      "step": "Express the weight of the balloon",
      "explanation": "Weight = mass × gravitational acceleration:\n$W = m g$"
    },
    {
      "step": "Set up the equilibrium condition",
      "explanation": "For vertical equilibrium, upward forces = downward forces:\n$F_B = W + T$"
    },
    {
      "step": "Substitute expressions for $F_B$ and $W$",
      "explanation": "$\\rho_{\\text{air}} \\left( \\frac{4}{3} \\pi R^3 \\right) g = m g + T$"
    },
    {
      "step": "Solve for tension $T$",
      "explanation": "Rearrange the equation:\n$T = \\rho_{\\text{air}} \\left( \\frac{4}{3} \\pi R^3 \\right) g - m g$"
    },
    {
      "step": "Factor out $g$",
      "explanation": "$T = g \\left( \\rho_{\\text{air}} \\cdot \\frac{4}{3} \\pi R^3 - m \\right)$"
    },
    {
      "step": "Interpret the result",
      "explanation": "Tension is positive ($T > 0$) when buoyant force exceeds weight, meaning the balloon would rise if not tethered.\nTension is zero when buoyant force exactly equals weight (balloon neutrally buoyant).\nTension would be negative (impossible for a tether) if weight exceeded buoyant force (balloon would sink)."
    }
  ],
  "final_answer": "$T = g \\left( \\rho_{\\text{air}} \\cdot \\frac{4}{3} \\pi R^3 - m \\right)$"
},
{
  "number": 45,
  "problem": "A volume of water is contained in a cylinder below a piston as shown in the figure above. The diameter of the circular piston is 0.2 m. A force of 20 N is then applied to the piston. What is the change in pressure at the point shown, 0.3 m below the piston, when the 20 N force is applied? The density of the water is 1,000 kg/m³.\n\n(A) 159 Pa\n(B) 3,000 Pa\n(C) 637 Pa\n(D) 3,637 Pa",
  "image": "images/fluids_45.png",
  "step_by_step": [
    {
      "step": "Recall Pascal's principle for fluids",
      "explanation": "Pascal's principle states that pressure applied to an enclosed fluid is transmitted undiminished to every portion of the fluid and to the walls of the containing vessel. This means any additional pressure applied at one point in the fluid appears equally at all other points in the fluid."
    },
    {
      "step": "Identify what the question asks",
      "explanation": "The question asks for the CHANGE in pressure at a point 0.3 m below the piston when the force is applied. According to Pascal's principle, this change should equal the additional pressure applied by the piston, regardless of depth."
    },
    {
      "step": "Calculate the piston area",
      "explanation": "Diameter = 0.2 m, so radius = 0.1 m\nArea of circular piston: $A = \\pi r^2 = \\pi (0.1 \\, \\text{m})^2 = 0.01\\pi \\, \\text{m}^2 \\approx 0.031416 \\, \\text{m}^2$"
    },
    {
      "step": "Calculate the pressure applied by the piston",
      "explanation": "Pressure = Force / Area\n$\\Delta P = \\frac{F}{A} = \\frac{20 \\, \\text{N}}{\\pi (0.1 \\, \\text{m})^2} = \\frac{20}{0.01\\pi} = \\frac{2000}{\\pi} \\, \\text{Pa}$"
    },
    {
      "step": "Compute numerical value",
      "explanation": "$\\Delta P = \\frac{2000}{\\pi} \\approx \\frac{2000}{3.1416} \\approx 636.6 \\, \\text{Pa} \\approx 637 \\, \\text{Pa}$"
    },
    {
      "step": "Explain why depth doesn't matter",
      "explanation": "The depth of 0.3 m and water density of 1000 kg/m³ are irrelevant for the CHANGE in pressure. They would determine the absolute pressure at that point (which includes hydrostatic pressure $\\rho g h$), but the question asks specifically for the change when the force is applied, which is transmitted equally throughout the fluid."
    },
    {
      "step": "Evaluate each option",
      "explanation": "A. 159 Pa - Incorrect. This might come from using diameter instead of radius in area calculation: $\\frac{20}{\\pi(0.2)^2} = \\frac{20}{0.04\\pi} = 159 \\, \\text{Pa}$.\n\nB. 3,000 Pa - Incorrect. This is the hydrostatic pressure at depth 0.3 m: $\\rho g h = 1000 \\times 10 \\times 0.3 = 3000 \\, \\text{Pa}$, but this is not the CHANGE in pressure.\n\nC. 637 Pa - Correct. This is the pressure applied by the piston, transmitted throughout the fluid.\n\nD. 3,637 Pa - Incorrect. This is the sum of hydrostatic pressure and piston pressure, but the question asks for the CHANGE, not the total absolute pressure."
    }
  ],
  "final_answer": "(C) 637 Pa"
},
{
  "number": 46,
  "problem": "Two solid blocks are floating at rest in a liquid as shown in the figure. The blocks have the same thickness (the dimension into/out of the page). Which of the two blocks has a greater mass?\n\n(A) Block A\n(B) Block B\n(C) They have the same mass\n(D) Cannot be determined",
  "image": "images/fluids_46.png",
  "step_by_step": [
    {
      "step": "Recall Archimedes' principle",
      "explanation": "For a floating object, the buoyant force equals the weight of the fluid displaced. Since the blocks are at rest, the net force is zero, so the buoyant force equals the weight of the block."
    },
    {
      "step": "Write the force balance for each block",
      "explanation": "For each block, sum of vertical forces: $F_B - F_g = 0$. Thus, $mg = \\rho_f V_f g$, where $V_f$ is the volume of fluid displaced."
    },
    {
      "step": "Express mass in terms of displaced volume",
      "explanation": "Cancelling $g$, we get $m = \\rho_f V_f$. Since $\\rho_f$ is the same for both blocks, the block with the larger displaced volume has the greater mass."
    },
    {
      "step": "Determine displaced volume for each block",
      "explanation": "Displaced volume is the volume of the part of the block submerged (since fluid is displaced by the submerged portion). Given thickness $t$ is the same, volume = (submerged area in front view) × $t$.\n- Block A: Submerged dimensions are width 4 m and height 3 m. Volume $V_A = (4 \\text{ m} × 3 \\text{ m}) t = 12 t \\text{ m}^2$.\n- Block B: Submerged dimensions are width 7 m and height 2 m. Volume $V_B = (7 \\text{ m} × 2 \\text{ m}) t = 14 t \\text{ m}^2$."
    },
    {
      "step": "Compare masses",
      "explanation": "$m_A = \\rho_f × 12 t$, $m_B = \\rho_f × 14 t$. Since $14 > 12$, $m_B > m_A$. Block B displaces more fluid and therefore has greater mass."
    },
    {
      "step": "Check for possible misinterpretations",
      "explanation": "One might think mass depends on total volume of the block, but only the submerged portion matters for buoyant force when floating. The blocks could have different densities or total volumes, but the given submerged dimensions directly determine displaced fluid volume, and hence mass, under static equilibrium."
    },
    {
      "step": "Evaluate answer choices",
      "explanation": "(A) Block A – Incorrect; it displaces less fluid.\n(B) Block B – Correct; it displaces more fluid.\n(C) They have the same mass – Incorrect; displaced volumes differ.\n(D) Cannot be determined – Incorrect; we have enough information."
    }
  ],
  "final_answer": "(B) Block B"
},
{
  "number": 47,
  "problem": "Water is flowing through the tube shown in the figure. What is the pressure $P$ at the point shown in the figure?\nThe density of the water is 1,000 kg/m³.\n\n(A) 1,040 Pa\n(B) 2,320 Pa\n(C) 2,000 Pa\n(D) 3,000 Pa",
  "image": "images/fluids_47.png",
  "step_by_step": [
    {
      "step": "Identify given values",
      "explanation": "$A_1 = 0.2 \\, \\text{m}^2$, $v_1 = 0.8 \\, \\text{m/s}$, $P_1 = 5,\\!000 \\, \\text{Pa}$, $y_1 = 0 \\, \\text{m}$ (reference level).\n$A_2 = 0.1 \\, \\text{m}^2$, $P_2 = P$ (unknown), $y_2 = 0.3 \\, \\text{m}$, $\\rho = 1,\\!000 \\, \\text{kg/m}^3$."
    },
    {
      "step": "Apply continuity equation to find $v_2$",
      "explanation": "For incompressible flow: $A_1 v_1 = A_2 v_2$.\n$(0.2)(0.8) = (0.1) v_2$ → $v_2 = \\frac{0.16}{0.1} = 1.6 \\, \\text{m/s}$."
    },
    {
      "step": "Apply Bernoulli's equation",
      "explanation": "$P_1 + \\rho g y_1 + \\frac{1}{2} \\rho v_1^2 = P_2 + \\rho g y_2 + \\frac{1}{2} \\rho v_2^2$.\nSubstitute known values:\n$5,\\!000 + 0 + \\frac{1}{2}(1000)(0.8)^2 = P + (1000)(9.8)(0.3) + \\frac{1}{2}(1000)(1.6)^2$."
    },
    {
      "step": "Calculate kinetic energy terms",
      "explanation": "$\\frac{1}{2}(1000)(0.64) = 320 \\, \\text{Pa}$ (dynamic pressure at point 1).\n$\\frac{1}{2}(1000)(2.56) = 1,\\!280 \\, \\text{Pa}$ (dynamic pressure at point 2)."
    },
    {
      "step": "Calculate gravitational potential term",
      "explanation": "$\\rho g y_2 = 1000 \\times 9.8 \\times 0.3 = 2,\\!940 \\, \\text{Pa}$."
    },
    {
      "step": "Solve for $P$",
      "explanation": "Left side: $5,\\!000 + 320 = 5,\\!320$.\nRight side: $P + 2,\\!940 + 1,\\!280 = P + 4,\\!220$.\nThus, $5,\\!320 = P + 4,\\!220$ → $P = 1,\\!100 \\, \\text{Pa}$.\nNote: Slight discrepancy from given answer 1,040 Pa due to using $g = 10 \\, \\text{m/s}^2$ in original solution. If $g = 10$: $\\rho g y_2 = 1000 \\times 10 \\times 0.3 = 3,\\!000$, then $P = 5,\\!320 - (3,\\!000 + 1,\\!280) = 1,\\!040 \\, \\text{Pa}$."
    },
    {
      "step": "Explain why other options are incorrect",
      "explanation": "(B) 2,320 Pa – Possibly neglects change in kinetic energy or miscalculates.\n(C) 2,000 Pa – Only considers static pressure difference due to height.\n(D) 3,000 Pa – Only hydrostatic pressure $\\rho g h$ at depth 0.3 m, ignoring flow effects."
    }
  ],
  "final_answer": "(A) 1,040 Pa"
},
{
  "number": 48,
  "problem": "A. Indicate whether $a_1$ is greater than, less than, or equal to $a_2$. Justify your answer in terms of ALL forces exerted on the block in each scenario. Use qualitative reasoning beyond referencing equations.\n\nB. Consider the general case where a block of mass $m$ and volume $V$ is completely submerged in a fluid of density $\\rho$. Starting with Newton’s second law, derive an expression for the initial upward acceleration $a$ of the block when the block is released from rest. Express your answer in terms of $m$, $V$, $\\rho$, and physical constants, as appropriate. Begin your derivation by writing a fundamental physics principle or an equation from the reference information.\n\nC. Indicate whether the expression for the acceleration $a$ you derived in part B is or is not consistent with the claim made in part A. Briefly justify your answer by referencing your derivation in part B.",
  "image": "images/fluids_48.png",
  "step_by_step": [
    {
      "step": "A. Qualitative reasoning",
      "explanation": "The block experiences two vertical forces: its weight ($mg$, downward) and the buoyant force ($F_b$, upward). The buoyant force equals the weight of the displaced fluid: $F_b = \\rho_{\\text{fluid}} V g$, where $V$ is the volume of the block.\n\nSince the block is the same in both scenarios, $V$ is constant. Salt water has a higher density than fresh water: $\\rho_2 > \\rho_1$. Thus, the buoyant force in salt water is greater: $F_{b2} > F_{b1}$.\n\nWhen released, the net upward force is $F_{\\text{net}} = F_b - mg$. A larger buoyant force results in a larger net upward force.\n\nBy Newton’s second law ($F_{\\text{net}} = m a$), a larger net force produces a larger initial upward acceleration. Therefore, $a_2 > a_1$, or $a_1 < a_2$."
    },
    {
      "step": "B. Derivation",
      "explanation": "Start with Newton’s second law: $\\Sigma F = m a$.\n\nThe forces on the block are:\n- Buoyant force (upward): $F_b = \\rho V g$\n- Weight (downward): $F_g = m g$\n\nTaking upward as positive, the net force is:\n$\\Sigma F = \\rho V g - m g$\n\nSubstitute into Newton’s second law:\n$m a = \\rho V g - m g$\n\nSolve for $a$:\n$a = \\frac{\\rho V g - m g}{m} = g\\left(\\frac{\\rho V}{m} - 1\\right)$\n\nThus, the expression for the initial upward acceleration is:\n$a = g\\left(\\frac{\\rho V}{m} - 1\\right)$"
    },
    {
      "step": "C. Consistency check",
      "explanation": "The derived expression is $a = g\\left(\\frac{\\rho V}{m} - 1\\right)$.\n\nFor a given block, $m$, $V$, and $g$ are constants. The acceleration $a$ depends linearly on the fluid density $\\rho$: as $\\rho$ increases, $a$ increases.\n\nIn part A, we concluded that $a_2 > a_1$ because $\\rho_2 > \\rho_1$. The derived expression explicitly shows this relationship: larger $\\rho$ yields larger $a$.\n\nTherefore, the expression is fully consistent with the qualitative claim from part A."
    }
  ],
  "final_answer": "A. $a_1 < a_2$\n\nB. $a = g\\left(\\frac{\\rho V}{m} - 1\\right)$\n\nC. The expression is consistent because acceleration $a$ increases with fluid density $\\rho$."
},
{
  "number": 49,
  "problem": "Blood flows through an artery with speed 30 cm/s. The artery narrows to 70% of its original cross-sectional area due to plaque buildup. By what factor does the dynamic pressure ($\\frac{1}{2}\\rho v^2$) change in the narrowed region?\n\n(A) Increases by a factor of 1.43\n(B) Decreases by a factor of 0.70\n(C) Increases by a factor of 2.04\n(D) Increases by a factor of 4.08",
  "image": "images/fluids_49.png",
  "step_by_step": [
    {
      "step": "Recall continuity equation",
      "explanation": "For an incompressible fluid (like blood), the volume flow rate is constant: $A_1 v_1 = A_2 v_2$, where $A$ is cross-sectional area and $v$ is speed."
    },
    {
      "step": "Assign variables",
      "explanation": "Let original area = $A_1$, original speed = $v_1 = 30\\,\\text{cm/s}$.\nNarrowed area = $A_2 = 0.70 A_1$.\nWe need $v_2$."
    },
    {
      "step": "Find speed in narrowed region",
      "explanation": "$A_1 v_1 = A_2 v_2 \\quad \\Rightarrow \\quad v_2 = \\frac{A_1}{A_2} v_1 = \\frac{A_1}{0.70 A_1} v_1 = \\frac{1}{0.70} v_1 \\approx 1.4286 v_1$.\nSo $v_2 \\approx 1.4286 v_1$."
    },
    {
      "step": "Dynamic pressure ratio",
      "explanation": "Dynamic pressure = $\\frac{1}{2}\\rho v^2$. The ratio in the narrowed region to the original region is:\n$\\frac{\\frac{1}{2}\\rho v_2^2}{\\frac{1}{2}\\rho v_1^2} = \\left(\\frac{v_2}{v_1}\\right)^2 = \\left(\\frac{1}{0.70}\\right)^2 = \\left(\\frac{1}{0.49}\\right) \\approx 2.0408$."
    },
    {
      "step": "Interpret factor",
      "explanation": "The dynamic pressure increases by a factor of about 2.04.\nChecking options:\n(A) Increases by a factor of 1.43 → That's $v_2/v_1$, not squared.\n(B) Decreases by a factor of 0.70 → Incorrect.\n(C) Increases by a factor of 2.04 → Correct.\n(D) Increases by a factor of 4.08 → That would be $(1/0.70)^2$ if mis-squared or mis-calculated."
    }
  ],
  "final_answer": "(C) Increases by a factor of 2.04"
},
{
  "number": 50,
  "problem": "A fluid at rest in a container exerts a pressure P at a certain depth. If the container is accelerating horizontally at 2.0 m/s², how does the pressure distribution in the fluid change?\n\n(A) The pressure gradient becomes tilted relative to vertical\n(B) The pressure remains unchanged at all points\n(C) The pressure increases uniformly throughout the fluid\n(D) The pressure becomes zero at the leading edge",
  "image": "images/fluids_50.png",
  "step_by_step": [
    {
      "step": "Identify key physics concept",
      "explanation": "For a fluid in a container accelerating horizontally with constant acceleration, the fluid is in hydrostatic equilibrium relative to the container (i.e., there are no relative motions within the fluid). However, the effective gravity vector is now the vector sum of gravitational acceleration and the inertial acceleration due to the container's motion."
    },
    {
      "step": "Determine the effective gravity",
      "explanation": "Gravity acts downward ($g \\approx 9.8 \\,\\text{m/s}^2$). The container's horizontal acceleration $a_x = 2.0 \\,\\text{m/s}^2$ acts opposite to the direction of motion relative to an inertial frame. Within the accelerating reference frame of the container, there is a pseudo-force per unit mass acting horizontally backward with magnitude $a_x$.\n\nThe effective acceleration vector $\\vec{g}_{\\text{eff}}$ is the vector sum: $\\vec{g}_{\\text{eff}} = -a_x \\,\\hat{x} - g \\,\\hat{y}$, where $\\hat{x}$ is horizontal (opposite to acceleration direction) and $\\hat{y}$ is vertical downward."
    },
    {
      "step": "Pressure gradient relation",
      "explanation": "In a fluid at rest relative to its container (even if accelerating), the pressure gradient $\\nabla P$ satisfies $\\nabla P = \\rho \\, \\vec{g}_{\\text{eff}}$.\nHere, $\\vec{g}_{\\text{eff}}$ is not purely vertical but has both horizontal and vertical components. Therefore, $\\nabla P$ is also not vertical; it points in the direction of $\\vec{g}_{\\text{eff}}$."
    },
    {
      "step": "Interpret effect on pressure distribution",
      "explanation": "Because $\\nabla P$ is tilted, surfaces of constant pressure (isobars) are perpendicular to $\\vec{g}_{\\text{eff}}$, meaning they are tilted relative to the horizontal. The pressure still increases in the direction of $\\vec{g}_{\\text{eff}}$, so the pressure gradient is no longer purely vertical—it becomes tilted."
    },
    {
      "step": "Evaluate each option",
      "explanation": "(A) Correct — The pressure gradient (and thus the direction of steepest pressure increase) tilts because $\\vec{g}_{\\text{eff}}$ is tilted.\n(B) Incorrect — The pressure changes because the effective gravity changes direction and magnitude relative to the fluid.\n(C) Incorrect — The pressure does not increase uniformly; the gradient changes direction.\n(D) Incorrect — The pressure does not become zero at the leading edge; it simply varies along a tilted gradient, and may be lower there but not zero unless the fluid is weightless or accelerating infinitely."
    }
  ],
  "final_answer": "(A) The pressure gradient becomes tilted relative to vertical"
}
 ]
}
