{
  "topic": "Gravity and Orbits",
  "unit_title": "Gravitational Fields",
  "unit_number": "Unit 3.6",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics 1",
  "duration": "3-4 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "Comprehensive study of gravitational fields as a fundamental concept in physics, including field strength calculations, field line representations, equipotential surfaces, and applications to planetary systems and orbital mechanics.",

  "learning_objectives": [
    "Define gravitational field as force per unit mass",
    "Calculate gravitational field strength for various mass distributions",
    "Understand and draw gravitational field lines",
    "Relate gravitational field to potential energy",
    "Solve problems involving gravitational fields of multiple masses",
    "Apply field concepts to orbital and planetary systems"
  ],

  "prerequisites": [
    "Newton's Law of Universal Gravitation",
    "Vector concepts and components",
    "Basic calculus concepts (for advanced sections)",
    "Energy conservation principles",
    "Circular motion mathematics",
    "Scientific notation and unit conversions"
  ],

  "core_concept": {
    "principle": "Gravitational Fields: Force field concept, Field strength $g = \\frac{F_g}{m}$, Inverse square law for point masses, Vector field nature, Superposition principle, Relationship to potential energy, Field line representations.",
    "explanation": "A gravitational field is a region of space surrounding a mass where another mass experiences a gravitational force. The field strength at any point is defined as the gravitational force per unit mass that would be experienced by a test mass placed at that point.",
    "image": {
      "url": "images/gravitational-fields-core.png",
      "alt": "Gravitational fields core concepts",
      "caption": "Fundamental principles of gravitational fields"
    }
  },

  "sections": [
    {
      "section_title": "1. Gravitational Field Concept and Calculations",
      "introduction": "Understanding the gravitational field as a fundamental physical concept and performing calculations for various mass distributions and configurations.",

      "key_concept": {
        "definition": "Field strength definition, Point mass fields, Spherical mass fields, Field superposition, Vector nature of fields, Gravitational constant.",
        "context": "The gravitational field concept provides a powerful way to describe how mass influences the space around it, allowing prediction of gravitational forces without direct reference to the source mass.",
        "image": {
          "url": "images/field-concept.png",
          "alt": "Gravitational field concept",
          "caption": "Gravitational field concept and calculations"
        }
      },

      "classifications": [
        {
          "type": "Gravitational Field Configurations",
          "value": "Classification based on source mass distribution and field characteristics",
          "characteristics": [
            "Point mass fields",
            "Spherical symmetric fields",
            "Multiple point masses",
            "Line and plane mass distributions",
            "Planetary surface fields",
            "Orbital field variations"
          ],
          "behavior": "Different field configurations exhibit characteristic patterns: point masses produce radial inverse-square fields, spherical masses have simple external fields, and multiple masses create complex field patterns through superposition",
          "examples": [
            {
              "process": "Point Mass Field Derivation",
              "explanation": "Deriving gravitational field strength for a point mass",
              "image": {
                "url": "images/point-mass-field-derivation.png",
                "alt": "Point mass field derivation",
                "caption": "Derivation of gravitational field for point mass"
              }
            },
            {
              "process": "Spherical Mass Field Application",
              "explanation": "Applying the spherical mass theorem to planetary fields",
              "image": {
                "url": "images/spherical-field-application.png",
                "alt": "Spherical field application",
                "caption": "Gravitational field applications for spherical masses"
              }
            }
          ],
          "note": "Key formulas: $\\vec{g} = \\frac{\\vec{F_g}}{m}$, point mass: $g = \\frac{GM}{r^2}$, spherical mass: external field same as point mass, superposition: $\\vec{g}_{total} = \\sum \\vec{g}_i$"
        }
      ],

      "principles": [
        {
          "principle": "Gravitational Field Concept and Calculations",
          "statement": "Gravitational fields provide a comprehensive framework for understanding gravitational interactions: Field Definition and Units: Gravitational field strength: $\\vec{g} = \\frac{\\vec{F_g}}{m_{test}}$; Physical meaning: acceleration due to gravity; Units: $N/kg$ or $m/s^2$ (equivalent); Direction: always toward source mass. Point Mass Field: $g = \\frac{GM}{r^2}$; Inverse-square relationship: field strength decreases with square of distance; Radial field lines directed toward mass; Magnitude depends only on source mass and distance. Spherical Mass Fields: Shell theorem: uniform spherical shell exerts no net gravitational force inside; Solid sphere: external field identical to point mass at center ($g = \\frac{GM}{r^2}$); Internal field: $g = \\frac{GM_{inside}}{r^2}$ where $M_{inside}$ is mass within radius r. Field Superposition: Multiple masses: $\\vec{g}_{total} = \\vec{g}_1 + \\vec{g}_2 + \\vec{g}_3 + \\cdots$; Vector addition of individual field contributions; Essential for non-symmetric mass distributions; Can result in complex field patterns. Gravitational Field Lines: Visual representation of field; Direction: tangent to field line shows field direction; Density: number of lines per unit area indicates field strength; Never cross; Begin at infinity (theoretically) and end on masses. Applications: Planetary science: surface gravity variations; Satellite dynamics: field strength at orbital altitudes; Astrophysics: galactic gravitational fields; Geophysics: Earth's gravitational field mapping.",
          "application": "Calculate gravitational field strength for point masses. Determine field strength at planetary surfaces. Solve superposition problems with multiple masses. Analyze field variations with altitude. Calculate net gravitational fields in complex systems. Apply field concepts to orbital mechanics.",
          "example": "Calculate g at International Space Station altitude. Find net field between Earth and Moon. Determine field inside Earth. Analyze field of multiple celestial bodies.",
          "analogy": "Like a celebrity surrounded by fans - the celebrity (mass) creates an 'attention field' around themselves, with the intensity of attention (field strength) being strongest close by and fading with distance, and if multiple celebrities are together, you feel the combined attention from all of them at your location",
          "image": {
            "url": "images/field-concept-principles.png",
            "alt": "Field concept principles",
            "caption": "Principles of gravitational field concept and calculations"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Gravitational Field at Different Altitudes",
          "problem": "Calculate the gravitational field strength at: (a) Earth's surface, (b) 1000 km altitude, (c) 10,000 km altitude. Earth mass = $5.97 \\times 10^{24}\\,kg$, Earth radius = $6370\\,km$.",
          "step_by_step": [
            {
              "step": "General field strength formula",
              "explanation": "$g = \\frac{GM}{r^2}$ where $r$ is distance from Earth's center"
            },
            {
              "step": "Calculate GM",
              "explanation": "$GM = (6.674 \\times 10^{-11})(5.97 \\times 10^{24}) = 3.986 \\times 10^{14}\\,m^3/s^2$"
            },
            {
              "step": "Part (a): Earth's surface",
              "explanation": "$r = 6.37 \\times 10^6\\,m$; $g = \\frac{3.986 \\times 10^{14}}{(6.37 \\times 10^6)^2} = \\frac{3.986 \\times 10^{14}}{4.058 \\times 10^{13}} = 9.82\\,m/s^2$"
            },
            {
              "step": "Part (b): 1000 km altitude",
              "explanation": "$r = 6370 + 1000 = 7370\\,km = 7.37 \\times 10^6\\,m$; $g = \\frac{3.986 \\times 10^{14}}{(7.37 \\times 10^6)^2} = \\frac{3.986 \\times 10^{14}}{5.432 \\times 10^{13}} = 7.34\\,m/s^2$"
            },
            {
              "step": "Part (c): 10,000 km altitude",
              "explanation": "$r = 6370 + 10000 = 16370\\,km = 1.637 \\times 10^7\\,m$; $g = \\frac{3.986 \\times 10^{14}}{(1.637 \\times 10^7)^2} = \\frac{3.986 \\times 10^{14}}{2.680 \\times 10^{14}} = 1.487\\,m/s^2$"
            },
            {
              "step": "Percentage of surface gravity",
              "explanation": "1000 km: $\\frac{7.34}{9.82} = 0.748$ (74.8%); 10000 km: $\\frac{1.487}{9.82} = 0.151$ (15.1%)"
            },
            {
              "step": "Interpretation",
              "explanation": "Gravitational field decreases significantly with altitude but remains measurable even at high orbits"
            }
          ],
          "final_answer": "(a) Surface: $9.82\\,m/s^2$, (b) 1000 km: $7.34\\,m/s^2$ (74.8% of surface), (c) 10000 km: $1.49\\,m/s^2$ (15.1% of surface); Demonstrates inverse-square law behavior",
          "concept_applied": "Gravitational field variation with altitude",
          "image": {
            "url": "images/altitude-field-variation.png",
            "alt": "Altitude field variation example",
            "caption": "Gravitational field strength at different altitudes"
          }
        },
        {
          "title": "Net Gravitational Field of Three Masses",
          "problem": "Three identical masses $M$ are placed at vertices of an equilateral triangle with side length $L$. Calculate the gravitational field at the center of the triangle.",
          "step_by_step": [
            {
              "step": "Geometry of equilateral triangle",
              "explanation": "Distance from vertex to center: $r = \\frac{L}{\\sqrt{3}}$; All three masses equidistant from center"
            },
            {
              "step": "Field magnitude from one mass",
              "explanation": "$g_1 = \\frac{GM}{r^2} = \\frac{GM}{(L/\\sqrt{3})^2} = \\frac{3GM}{L^2}$"
            },
            {
              "step": "Direction of fields",
              "explanation": "Each field points toward its respective vertex; Due to symmetry, fields are 120° apart"
            },
            {
              "step": "Vector addition setup",
              "explanation": "Place triangle in coordinate system; Masses at: (0,0), (L,0), (L/2, L√3/2); Center at (L/2, L√3/6)"
            },
            {
              "step": "Calculate field components",
              "explanation": "Due to symmetry, all x-components cancel; All y-components cancel"
            },
            {
              "step": "Alternative symmetry argument",
              "explanation": "For every field vector, there is an equal vector pointing in the opposite direction when considering the symmetric configuration"
            },
            {
              "step": "Net field conclusion",
              "explanation": "By symmetry, the vector sum of three equal magnitude vectors 120° apart is zero"
            },
            {
              "step": "Mathematical verification",
              "explanation": "$\\vec{g}_{net} = \\vec{g}_1 + \\vec{g}_2 + \\vec{g}_3 = 0$ due to perfect cancellation"
            },
            {
              "step": "Physical interpretation",
              "explanation": "At the center, gravitational pulls from all three masses balance perfectly"
            }
          ],
          "final_answer": "Net gravitational field at center = $0$; Perfect cancellation occurs due to symmetric configuration of three equal masses",
          "concept_applied": "Field superposition and symmetry",
          "image": {
            "url": "images/three-mass-field.png",
            "alt": "Three mass field example",
            "caption": "Net gravitational field calculation for three masses"
          }
        }
      ]
    },
    {
      "section_title": "2. Gravitational Field Lines and Representations",
      "introduction": "Visualizing gravitational fields through field lines, understanding their properties, and interpreting field strength from field line patterns.",

      "key_concept": {
        "definition": "Field line properties, Line density and field strength, Radial fields, Complex field patterns, Equipotential surfaces, Field mapping techniques.",
        "context": "Gravitational field lines provide a visual representation of gravitational fields, showing both the direction and relative strength of the field at different points in space.",
        "image": {
          "url": "images/field-lines.png",
          "alt": "Gravitational field lines",
          "caption": "Gravitational field line representations"
        }
      },

      "classifications": [
        {
          "type": "Field Line Patterns",
          "value": "Classification based on field line geometry and source configuration",
          "characteristics": [
            "Radial field lines (point mass)",
            "Uniform field lines (infinite plane)",
            "Dipole field patterns",
            "Multiple source fields",
            "Orbital field variations",
            "Complex asymmetric fields"
          ],
          "behavior": "Different field line patterns reveal field characteristics: radial lines indicate spherical symmetry, parallel lines suggest uniform fields, and complex patterns show field superposition from multiple sources",
          "examples": [
            {
              "process": "Field Line Drawing Rules",
              "explanation": "Understanding and applying the rules for drawing gravitational field lines",
              "image": {
                "url": "images/field-line-rules.png",
                "alt": "Field line rules",
                "caption": "Rules for drawing gravitational field lines"
              }
            },
            {
              "process": "Field Strength from Line Density",
              "explanation": "Interpreting field strength from field line spacing and density",
              "image": {
                "url": "images/line-density-strength.png",
                "alt": "Line density and strength",
                "caption": "Relating field line density to field strength"
              }
            }
          ],
          "note": "Field line properties: Direction shows field direction, Density shows field strength, Lines never cross, Begin at infinity and end on masses, Perpendicular to equipotential surfaces"
        }
      ],

      "principles": [
        {
          "principle": "Gravitational Field Lines and Representations",
          "statement": "Field lines provide powerful visual tools for understanding gravitational fields: Field Line Properties: Direction: tangent to field line gives field direction at each point; Density: number of lines per unit area indicates field strength; Never cross: unique direction at each point; Begin/End: theoretically begin at infinity and end on masses. Point Mass Field Lines: Radial lines directed toward mass; Equally spaced in angle (not distance); Density decreases as $1/r^2$ with distance; Perfect spherical symmetry. Multiple Mass Field Lines: Complex patterns from superposition; Lines curve toward masses; Null points where fields cancel; Asymmetric density patterns. Field Line Rules: Number of lines proportional to mass; Lines are continuous; Closer spacing indicates stronger field; Direction always toward masses. Equipotential Surfaces: Surfaces of constant gravitational potential; Perpendicular to field lines everywhere; No work done moving along equipotential; Spacing indicates field strength: closer spacing = stronger field. Field Mapping Techniques: Mathematical calculation for simple systems; Computer modeling for complex systems; Experimental mapping using test masses; Satellite measurements for planetary fields. Applications: Understanding orbital mechanics; Visualizing complex gravitational systems; Designing satellite trajectories; Analyzing stability of gravitational configurations; Teaching fundamental field concepts.",
          "application": "Draw field lines for point mass systems. Interpret field strength from line density. Identify null points in multiple mass systems. Relate field lines to equipotential surfaces. Analyze field patterns for various mass distributions. Use field lines to understand orbital paths.",
          "example": "Draw field lines for Earth-Moon system. Identify Lagrange points from field patterns. Analyze field near binary star system. Interpret gravitational field maps of Earth.",
          "analogy": "Like iron filings around a magnet - the filings (field lines) naturally align to show the invisible magnetic field pattern, with dense clusters (close spacing) indicating strong fields and the pattern clearly showing how the field direction changes throughout space, though gravitational field lines always point toward masses rather than having poles",
          "image": {
            "url": "images/field-lines-principles.png",
            "alt": "Field lines principles",
            "caption": "Principles of gravitational field lines and representations"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Field Lines for Earth-Moon System",
          "problem": "Describe and sketch the gravitational field lines for the Earth-Moon system, identifying key features and the neutral point where fields cancel.",
          "step_by_step": [
            {
              "step": "System parameters",
              "explanation": "Earth mass $M_E = 5.97 \\times 10^{24}\\,kg$, Moon mass $M_M = 7.35 \\times 10^{22}\\,kg$, distance $d = 3.84 \\times 10^8\\,m$"
            },
            {
              "step": "Neutral point location",
              "explanation": "From earlier calculation: $x = 3.457 \\times 10^8\\,m$ from Earth, $3.83 \\times 10^7\\,m$ from Moon (90.1% of distance)"
            },
            {
              "step": "Field line characteristics near Earth",
              "explanation": "Close to Earth: nearly radial field lines pointing toward Earth's center; High density indicates strong field"
            },
            {
              "step": "Field line characteristics near Moon",
              "explanation": "Close to Moon: radial field lines toward Moon; Lower density than near Earth (Moon has less mass)"
            },
            {
              "step": "Field lines between bodies",
              "explanation": "Curved field lines connecting the two bodies; Lines curve more strongly toward Earth (larger mass)"
            },
            {
              "step": "Neutral point field behavior",
              "explanation": "At neutral point: field strength = 0; Field lines cannot pass through this point; Creates a 'saddle point' in field pattern"
            },
            {
              "step": "Far from system",
              "explanation": "At large distances: field appears approximately as single point mass at center of mass; Nearly radial field lines"
            },
            {
              "step": "Center of mass location",
              "explanation": "$r_{cm} = \\frac{M_M}{M_E + M_M}d = \\frac{7.35 \\times 10^{22}}{6.0435 \\times 10^{24}}(3.84 \\times 10^8) = 4.67 \\times 10^6\\,m$ from Earth's center (within Earth)"
            },
            {
              "step": "Sketch description",
              "explanation": "Draw Earth (left) and Moon (right) with curved field lines connecting them; Show neutral point closer to Moon; Indicate higher line density near Earth"
            }
          ],
          "final_answer": "Earth-Moon field lines: radial near each body, curved between them, neutral point at 90.1% of distance from Earth; Field strength zero at neutral point creating saddle point in field pattern",
          "concept_applied": "Field line patterns for two masses",
          "image": {
            "url": "images/earth-moon-field-lines.png",
            "alt": "Earth-Moon field lines example",
            "caption": "Gravitational field lines for Earth-Moon system"
          }
        },
        {
          "title": "Field Strength from Line Density",
          "problem": "A gravitational field map shows field lines around a planet. At distance R, there are 8 lines crossing a sphere of radius R. At distance 2R, the same sphere has 2 lines crossing. Verify if this matches the inverse-square law and calculate the ratio of field strengths.",
          "step_by_step": [
            {
              "step": "Field line density concept",
              "explanation": "Number of field lines crossing unit area is proportional to field strength"
            },
            {
              "step": "Surface area calculation",
              "explanation": "Sphere surface area: $A = 4\\pi r^2$; At distance r: $A(r) = 4\\pi r^2$"
            },
            {
              "step": "Line density at distance R",
              "explanation": "Total lines = 8; Area = $4\\pi R^2$; Line density = $\\frac{8}{4\\pi R^2} = \\frac{2}{\\pi R^2}$"
            },
            {
              "step": "Line density at distance 2R",
              "explanation": "Total lines = 2; Area = $4\\pi (2R)^2 = 16\\pi R^2$; Line density = $\\frac{2}{16\\pi R^2} = \\frac{1}{8\\pi R^2}$"
            },
            {
              "step": "Field strength ratio from line density",
              "explanation": "$\\frac{g(2R)}{g(R)} = \\frac{\\text{line density at 2R}}{\\text{line density at R}} = \\frac{1/(8\\pi R^2)}{2/(\\pi R^2)} = \\frac{1}{16}$"
            },
            {
              "step": "Inverse-square law prediction",
              "explanation": "$g \\propto \\frac{1}{r^2}$; $\\frac{g(2R)}{g(R)} = \\left(\\frac{R}{2R}\\right)^2 = \\frac{1}{4}$"
            },
            {
              "step": "Comparison",
              "explanation": "Line density gives $\\frac{1}{16}$, inverse-square law gives $\\frac{1}{4}$ - they don't match"
            },
            {
              "step": "Interpretation",
              "explanation": "The field line drawing is incorrect; Number of lines should be constant with distance for inverse-square field"
            },
            {
              "step": "Correct field line representation",
              "explanation": "For inverse-square field, same number of lines should cross spheres at different distances; Density changes due to area change"
            }
          ],
          "final_answer": "Field line pattern is incorrect; For inverse-square field, same number of lines (8) should cross spheres at both R and 2R; Density ratio should be $\\frac{1}{4}$ but line count gives $\\frac{1}{16}$",
          "concept_applied": "Field strength from line density",
          "image": {
            "url": "images/line-density-analysis.png",
            "alt": "Line density analysis example",
            "caption": "Analysis of field strength from field line density"
          }
        }
      ]
    },
    {
      "section_title": "3. Gravitational Potential and Energy in Fields",
      "introduction": "Understanding gravitational potential energy in the context of fields, calculating work done in gravitational fields, and applying these concepts to orbital systems.",

      "key_concept": {
        "definition": "Gravitational potential energy, Potential $V = \\frac{U_g}{m}$, Equipotential surfaces, Work in gravitational fields, Conservation of energy, Escape energy calculations.",
        "context": "Gravitational potential provides an energy-based perspective on gravitational fields, relating field strength to energy changes and enabling powerful problem-solving approaches using conservation of energy.",
        "image": {
          "url": "images/gravitational-potential.png",
          "alt": "Gravitational potential",
          "caption": "Gravitational potential and energy concepts"
        }
      },

      "classifications": [
        {
          "type": "Potential Energy Scenarios",
          "value": "Classification based on energy configurations and applications",
          "characteristics": [
            "Point mass potential energy",
            "Orbital energy calculations",
            "Escape energy scenarios",
            "Multiple mass potentials",
            "Potential wells",
            "Energy conservation applications"
          ],
          "behavior": "Different potential energy scenarios exhibit characteristic energy relationships: bound orbits have negative total energy, escape requires zero or positive energy, and complex systems have multiple potential wells",
          "examples": [
            {
              "process": "Gravitational Potential Calculation",
              "explanation": "Calculating gravitational potential for various mass distributions",
              "image": {
                "url": "images/potential-calculation.png",
                "alt": "Potential calculation",
                "caption": "Gravitational potential calculations"
              }
            },
            {
              "process": "Orbital Energy Analysis",
              "explanation": "Analyzing energy relationships in orbital systems",
              "image": {
                "url": "images/orbital-energy-analysis.png",
                "alt": "Orbital energy analysis",
                "caption": "Energy analysis in orbital systems"
              }
            }
          ],
          "note": "Energy relationships: $U_g = -\\frac{GMm}{r}$, $V = -\\frac{GM}{r}$, circular orbit: $E = -\\frac{GMm}{2r}$, $K = -\\frac{1}{2}U$, escape: $E \\geq 0$"
        }
      ],

      "principles": [
        {
          "principle": "Gravitational Potential and Energy in Fields",
          "statement": "Gravitational potential energy and potential provide energy-based descriptions of gravitational interactions: Gravitational Potential Energy: Two point masses: $U_g = -\\frac{GMm}{r}$; Zero reference at infinite separation; Negative values indicate bound systems; Conservative force: path-independent. Gravitational Potential: $V = \\frac{U_g}{m} = -\\frac{GM}{r}$; Potential energy per unit mass; Units: $J/kg$; Related to field: $\\vec{g} = -\\nabla V$ (field is negative gradient of potential). Equipotential Surfaces: Surfaces where $V = constant$; No work done moving along equipotential; Perpendicular to field lines everywhere; Spacing indicates field strength. Work in Gravitational Fields: Work done = change in potential energy: $W = -\\Delta U_g$; Independent of path (conservative field); Moving against field requires positive work. Orbital Energy: Total mechanical energy: $E = K + U = \\frac{1}{2}mv^2 - \\frac{GMm}{r}$; Circular orbit: $E = -\\frac{GMm}{2r}$; Bound orbits: $E < 0$; Unbound orbits: $E \\geq 0$. Escape Energy: Minimum energy to reach infinity: $E_{escape} = 0$; From surface: $\\frac{1}{2}mv_{esc}^2 - \\frac{GMm}{R} = 0$; Escape velocity: $v_{esc} = \\sqrt{\\frac{2GM}{R}}$. Applications: Satellite mission planning; Spacecraft trajectory design; Astrophysics: galactic potential wells; Geophysics: Earth's gravitational potential.",
          "application": "Calculate gravitational potential energy changes. Determine work done moving in gravitational fields. Analyze orbital energy requirements. Calculate escape velocities. Solve energy conservation problems in gravity. Apply potential concepts to complex systems.",
          "example": "Calculate energy to lift satellite to orbit. Determine if comet has escape trajectory. Analyze energy in binary star system. Calculate work to move mass between points in field.",
          "analogy": "Like a ball in a valley - the ball naturally rolls to the bottom (minimum potential energy), and the effort needed to lift it out (work done) depends only on the height difference, not the path taken, with the steepness of the valley sides (field strength) determining how quickly the potential energy changes with position",
          "image": {
            "url": "images/gravitational-potential-principles.png",
            "alt": "Gravitational potential principles",
            "caption": "Principles of gravitational potential and energy"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Orbital Energy of Satellite",
          "problem": "A $500\\,kg$ satellite orbits Earth at altitude $400\\,km$. Calculate: (a) orbital energy, (b) kinetic energy, (c) potential energy. Earth mass = $5.97 \\times 10^{24}\\,kg$, Earth radius = $6370\\,km$.",
          "step_by_step": [
            {
              "step": "Orbital radius",
              "explanation": "$r = R + h = 6370 + 400 = 6770\\,km = 6.77 \\times 10^6\\,m$"
            },
            {
              "step": "Calculate GM",
              "explanation": "$GM = (6.674 \\times 10^{-11})(5.97 \\times 10^{24}) = 3.986 \\times 10^{14}\\,m^3/s^2$"
            },
            {
              "step": "Orbital speed",
              "explanation": "$v = \\sqrt{\\frac{GM}{r}} = \\sqrt{\\frac{3.986 \\times 10^{14}}{6.77 \\times 10^6}} = \\sqrt{5.887 \\times 10^7} = 7673\\,m/s$"
            },
            {
              "step": "Kinetic energy",
              "explanation": "$K = \\frac{1}{2}mv^2 = \\frac{1}{2}(500)(7673)^2 = 250(5.887 \\times 10^7) = 1.472 \\times 10^{10}\\,J$"
            },
            {
              "step": "Potential energy",
              "explanation": "$U = -\\frac{GMm}{r} = -\\frac{(3.986 \\times 10^{14})(500)}{6.77 \\times 10^6} = -\\frac{1.993 \\times 10^{17}}{6.77 \\times 10^6} = -2.944 \\times 10^{10}\\,J$"
            },
            {
              "step": "Total energy",
              "explanation": "$E = K + U = (1.472 \\times 10^{10}) + (-2.944 \\times 10^{10}) = -1.472 \\times 10^{10}\\,J$"
            },
            {
              "step": "Verify circular orbit relationship",
              "explanation": "Circular orbit: $E = -K = \\frac{1}{2}U$; Check: $-K = -1.472 \\times 10^{10}\\,J$ matches E; $\\frac{1}{2}U = -1.472 \\times 10^{10}\\,J$ matches E"
            },
            {
              "step": "Energy interpretation",
              "explanation": "Negative total energy confirms bound orbit; Magnitude represents energy needed to escape"
            }
          ],
          "final_answer": "(a) Total energy = $-1.47 \\times 10^{10}\\,J$, (b) Kinetic energy = $+1.47 \\times 10^{10}\\,J$, (c) Potential energy = $-2.94 \\times 10^{10}\\,J$; Satisfies $E = -K = \\frac{1}{2}U$ for circular orbit",
          "concept_applied": "Orbital energy calculations",
          "image": {
            "url": "images/satellite-energy.png",
            "alt": "Satellite energy example",
            "caption": "Orbital energy calculation for satellite"
          }
        },
        {
          "title": "Escape Velocity from Earth",
          "problem": "Calculate the escape velocity from Earth's surface and from the Moon's surface. Compare the results. Earth: $M_E = 5.97 \\times 10^{24}\\,kg$, $R_E = 6370\\,km$; Moon: $M_M = 7.35 \\times 10^{22}\\,kg$, $R_M = 1737\\,km$.",
          "step_by_step": [
            {
              "step": "Escape velocity formula",
              "explanation": "$v_{esc} = \\sqrt{\\frac{2GM}{R}}$"
            },
            {
              "step": "Earth escape velocity",
              "explanation": "$v_{esc,E} = \\sqrt{\\frac{2(6.674 \\times 10^{-11})(5.97 \\times 10^{24})}{6.37 \\times 10^6}}$"
            },
            {
              "step": "Calculate numerator for Earth",
              "explanation": "$2GM_E = 2(3.986 \\times 10^{14}) = 7.972 \\times 10^{14}$"
            },
            {
              "step": "Earth escape velocity calculation",
              "explanation": "$v_{esc,E} = \\sqrt{\\frac{7.972 \\times 10^{14}}{6.37 \\times 10^6}} = \\sqrt{1.251 \\times 10^8} = 11185\\,m/s$"
            },
            {
              "step": "Convert to km/s",
              "explanation": "$v_{esc,E} = 11.185\\,km/s$"
            },
            {
              "step": "Moon escape velocity",
              "explanation": "$v_{esc,M} = \\sqrt{\\frac{2(6.674 \\times 10^{-11})(7.35 \\times 10^{22})}{1.737 \\times 10^6}}$"
            },
            {
              "step": "Calculate GM for Moon",
              "explanation": "$GM_M = (6.674 \\times 10^{-11})(7.35 \\times 10^{22}) = 4.902 \\times 10^{12}$"
            },
            {
              "step": "Moon escape velocity calculation",
              "explanation": "$v_{esc,M} = \\sqrt{\\frac{2(4.902 \\times 10^{12})}{1.737 \\times 10^6}} = \\sqrt{\\frac{9.804 \\times 10^{12}}{1.737 \\times 10^6}} = \\sqrt{5.644 \\times 10^6} = 2376\\,m/s$"
            },
            {
              "step": "Convert to km/s",
              "explanation": "$v_{esc,M} = 2.376\\,km/s$"
            },
            {
              "step": "Comparison",
              "explanation": "Earth: $11.2\\,km/s$, Moon: $2.38\\,km/s$; Moon escape velocity is only 21% of Earth's"
            },
            {
              "step": "Physical reason",
              "explanation": "Moon has much smaller mass and smaller radius, resulting in much weaker gravity and lower escape velocity"
            }
          ],
          "final_answer": "Escape velocity: Earth = $11.2\\,km/s$, Moon = $2.38\\,km/s$; Moon's escape velocity is only 21% of Earth's due to Moon's smaller mass and size",
          "concept_applied": "Escape velocity calculations",
          "image": {
            "url": "images/escape-velocity-comparison.png",
            "alt": "Escape velocity comparison example",
            "caption": "Escape velocity comparison between Earth and Moon"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Gravitational field",
    "Field strength",
    "Field lines",
    "Line density",
    "Equipotential surfaces",
    "Gravitational potential",
    "Potential energy",
    "Superposition principle",
    "Inverse square law",
    "Orbital energy",
    "Escape velocity",
    "Conservative field"
  ],

  "common_misconceptions": [
    "Thinking field lines physically exist",
    "Believing no work is done in circular orbits",
    "Confusing field strength with potential",
    "Thinking gravitational potential can be positive",
    "Believing satellites experience no gravity",
    "Confusing mass and weight in field contexts"
  ],

  "real_world_applications": [
    "Satellite orbit planning and design",
    "Space mission trajectory calculations",
    "Planetary science and exploration",
    "GPS and global navigation systems",
    "Earth's gravitational field mapping",
    "Tidal force predictions",
    "Astrophysical system modeling",
    "Geophysical surveying techniques",
    "Spacecraft navigation systems",
    "Orbital debris tracking and avoidance"
  ],

  "summary": "Gravitational fields provide a fundamental framework for understanding gravitational interactions, defined as force per unit mass ($\\vec{g} = \\frac{\\vec{F_g}}{m}$). Field lines offer visual representations showing field direction and strength through their density. The gravitational potential ($V = -\\frac{GM}{r}$) and potential energy ($U_g = -\\frac{GMm}{r}$) provide energy-based perspectives, with equipotential surfaces perpendicular to field lines. Key applications include orbital energy calculations ($E = -\\frac{GMm}{2r}$ for circular orbits), escape velocity determinations ($v_{esc} = \\sqrt{\\frac{2GM}{R}}$), and complex field analysis through superposition. These concepts form the foundation for understanding planetary motion, satellite dynamics, and gravitational systems across all scales from laboratory measurements to galactic structures."
}
