{
  "expanded_description": "This section introduces orbital motion—the movement of objects around larger bodies due to gravity. Students will learn how gravity provides the centripetal force that keeps planets orbiting the Sun, moons orbiting planets, and satellites circling Earth, and discover the relationship between orbital speed, radius, and period.",
  "core_concept": {
    "principle": "Orbital motion occurs when gravity provides exactly the centripetal force needed to keep an object moving in a circular path around a larger body.",
    "explanation": "Newton imagined a cannonball fired from a mountaintop. The faster it's fired, the farther it travels before hitting Earth. At just the right speed, it falls around Earth rather than into it—continuously falling but never hitting, because Earth's curvature matches its curved path. This is orbit: continuous free fall with gravity as the centripetal force.",
    "image": {
      "src": "images/unit6/newtons_cannon.png",
      "alt": "Newton's cannonball thought experiment showing trajectories at different speeds, with one going into orbit",
      "caption": "Newton's cannonball: at the right speed, the object orbits instead of hitting the ground"
    }
  },
  "sections": [
    {
      "section_title": "What is Orbital Motion?",
      "introduction": "Look up at the night sky and you'll see the Moon. Look around and you're standing on Earth, which is orbiting the Sun. Orbital motion is everywhere in the universe—objects moving in curved paths around larger bodies, with gravity pulling them inward as centripetal force.",
      "key_concept": {
        "definition": "Orbital motion is the movement of an object (like a planet, moon, or satellite) around a larger body due to the gravitational force providing the centripetal force needed for circular (or elliptical) motion.",
        "context": "Orbits can be circular (simpler to understand) or elliptical (more common in nature). For grade 9-10, we focus on circular orbits to apply our circular motion understanding."
      },
      "principles": [
        {
          "principle": "Gravity as Centripetal Force",
          "statement": "In orbital motion, the gravitational force between two objects provides exactly the centripetal force needed to keep the smaller object in circular motion around the larger one.",
          "application": "The same force that makes apples fall also keeps the Moon in orbit—gravity acts at a distance, constantly pulling the orbiting object toward the center.",
          "example": "Earth's gravity pulls on the Moon with a force of about $2 \\times 10^{20}$ N. This force is exactly what the Moon needs as centripetal force to stay in its orbit.",
          "analogy": "Orbit is like a never-ending game of catch between gravity and inertia—gravity pulls inward, inertia wants to go straight, and the balance creates a circular path."
        },
        {
          "principle": "Continuous Free Fall",
          "statement": "Objects in orbit are actually in continuous free fall toward the body they're orbiting—but they keep missing because of their forward speed.",
          "application": "Astronauts on the International Space Station appear weightless because they're in free fall along with their spacecraft. They're not "floating"—they're falling, but so is everything around them!",
          "example": "The ISS falls toward Earth constantly, but its forward speed (about 7.66 km/s) means Earth curves away beneath it at the same rate it falls."
        }
      ],
      "image": {
        "src": "images/unit6/orbit_diagram.png",
        "alt": "Diagram showing an orbiting object with gravity pulling inward and velocity tangent to the circle",
        "caption": "In orbit, gravity provides centripetal force while inertia wants to go straight—balance creates the circle"
      }
    },
    {
      "section_title": "Newton's Cannonball Thought Experiment",
      "introduction": "Isaac Newton imagined a brilliant thought experiment that explains orbital motion perfectly. Understanding this helps visualize how orbits work.",
      "key_concept": {
        "definition": "Newton imagined a cannon on a very tall mountain firing cannonballs horizontally at different speeds. At low speeds, they hit the ground nearby. At higher speeds, they travel farther. At one special speed, they fall completely around Earth and return to their starting point—they're in orbit.",
        "context": "This thought experiment shows that orbit is really just a special case of projectile motion—where the curvature of Earth matches the curved path of the projectile."
      },
      "classifications": [
        {
          "type": "Too Slow",
          "value": "Cannonball hits ground nearby",
          "characteristics": [
            "Path is a short arc",
            "Hits Earth's surface quickly",
            "Normal projectile motion"
          ],
          "behavior": "At low speeds, gravity pulls the cannonball down, and it hits the ground at some distance from the mountain.",
          "examples": [
            {
              "process": "Typical cannon shot",
              "explanation": "A normal cannonball follows a parabolic arc and lands relatively close."
            }
          ]
        },
        {
          "type": "Faster, but Still Too Slow",
          "value": "Cannonball travels farther, but still hits",
          "characteristics": [
            "Longer arc",
            "Travels significant distance",
            "Still hits Earth eventually"
          ],
          "behavior": "As speed increases, the cannonball travels farther before hitting—but it still hits because Earth's surface is curved, and the ball's path curves more steeply.",
          "examples": [
            {
              "process": "Intercontinental ballistic missile",
              "explanation": "Very fast projectiles can travel halfway around Earth before hitting."
            }
          ]
        },
        {
          "type": "Orbital Speed",
          "value": "Cannonball continuously falls but never hits",
          "characteristics": [
            "Path curvature matches Earth's curvature",
            "Never reaches the ground",
            "Completes full circle around Earth"
          ],
          "behavior": "At just the right speed (about 7.9 km/s for low Earth orbit), the cannonball's curved path matches Earth's curve. It falls exactly as fast as Earth curves away beneath it.",
          "examples": [
            {
              "process": "Satellites",
              "explanation": "All satellites are essentially Newton's cannonballs—fired fast enough to keep missing Earth."
            },
            {
              "process": "Space Station",
              "explanation": "The ISS is in continuous free fall around Earth at orbital speed."
            }
          ]
        },
        {
          "type": "Too Fast",
          "value": "Cannonball escapes Earth's gravity",
          "characteristics": [
            "Path is less curved than Earth",
            "Moves away from Earth",
            "Escapes orbit entirely"
          ],
          "behavior": "At speeds above about 11.2 km/s (escape velocity), the cannonball's path is too straight—gravity can't pull it into a closed loop. It escapes Earth's gravity and heads into space.",
          "examples": [
            {
              "process": "Space probes",
              "explanation": "Voyager, New Horizons, and other deep space probes were launched at escape velocity to leave Earth forever."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/newtons_cannon_detailed.png",
        "alt": "Newton's cannonball diagram showing trajectories at different speeds: A, B, C hitting at different distances, D in orbit, E escaping",
        "caption": "Different speeds produce different trajectories—only the right speed creates an orbit"
      }
    },
    {
      "section_title": "The Orbital Speed Formula",
      "introduction": "We can use our circular motion understanding to find the speed needed for a circular orbit. Since gravity provides centripetal force, we can set the gravitational force equal to the centripetal force formula.",
      "key_concept": {
        "definition": "For a circular orbit, the gravitational force ($F_g = G\\frac{Mm}{r^2}$) equals the required centripetal force ($F_c = \\frac{mv^2}{r}$). Solving for v gives $v = \\sqrt{\\frac{GM}{r}}$.",
        "context": "This formula tells us that orbital speed depends only on the mass of the central body (M) and the orbital radius (r)—not on the mass of the orbiting object (which cancels out)!"
      },
      "principles": [
        {
          "principle": "Setting Forces Equal",
          "statement": "For a stable circular orbit: $G\\frac{Mm}{r^2} = \\frac{mv^2}{r}$",
          "application": "The mass of the orbiting object (m) cancels out—amazingly, all objects at the same distance from a body orbit at the same speed regardless of their mass!",
          "example": "A tiny satellite and a massive space station at the same altitude need the same orbital speed—about 7.8 km/s for low Earth orbit.",
          "analogy": "Think of it like this: heavier objects need more force to orbit, but gravity pulls harder on heavier objects. It balances perfectly—like the mass cancellation we saw with friction on curves!"
        },
        {
          "principle": "The Orbital Speed Equation",
          "statement": "Solving the force equality gives: $v = \\sqrt{\\frac{GM}{r}}$",
          "application": "This is the speed needed for a circular orbit at radius r around a body of mass M.",
          "example": "For Earth, $M = 5.97 \\times 10^{24}$ kg, $G = 6.67 \\times 10^{-11}$. For a satellite at $r = 7,000$ km ($7 \\times 10^6$ m), $v = \\sqrt{(6.67 \\times 10^{-11} \\times 5.97 \\times 10^{24}) / (7 \\times 10^6)}$"
        },
        {
          "principle": "Key Relationships",
          "statement": "From $v = \\sqrt{GM/r}$, we see: farther orbits = slower speeds.",
          "application": "Objects in higher orbits (larger r) move more slowly than those in low orbits. This seems counterintuitive—but it's true!",
          "example": "The ISS orbits at about 400 km altitude (r ≈ 6,770 km) at 7.66 km/s. The Moon orbits at 384,000 km at only about 1 km/s—much slower!"
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Orbital Speed",
          "problem": "Calculate the orbital speed for a satellite at 400 km above Earth's surface. Earth's radius is 6,370 km, and Earth's mass is $5.97 \\times 10^{24}$ kg. $G = 6.67 \\times 10^{-11}$.",
          "step_by_step": [
            {
              "step": "Find orbital radius",
              "explanation": "r = Earth's radius + altitude = 6,370 km + 400 km = 6,770 km = $6.77 \\times 10^6$ m"
            },
            {
              "step": "Write the formula",
              "explanation": "$v = \\sqrt{\\frac{GM}{r}}$"
            },
            {
              "step": "Insert values",
              "explanation": "$v = \\sqrt{\\frac{(6.67 \\times 10^{-11})(5.97 \\times 10^{24})}{6.77 \\times 10^6}}$"
            },
            {
              "step": "Calculate numerator",
              "explanation": "$6.67 \\times 10^{-11} \\times 5.97 \\times 10^{24} = 3.98 \\times 10^{14}$"
            },
            {
              "step": "Divide by r",
              "explanation": "$\\frac{3.98 \\times 10^{14}}{6.77 \\times 10^6} = 5.88 \\times 10^7$"
            },
            {
              "step": "Square root",
              "explanation": "$v = \\sqrt{5.88 \\times 10^7} \\approx 7,670$ m/s = 7.67 km/s"
            }
          ],
          "final_answer": "The orbital speed is approximately 7.67 km/s.",
          "concept_applied": "Orbital speed depends on mass of central body and radius."
        },
        {
          "title": "Comparing Orbital Speeds",
          "problem": "Compare the orbital speed of a satellite at 400 km altitude to one at 36,000 km altitude (geostationary orbit). Earth's mass is $5.97 \\times 10^{24}$ kg, radius 6,370 km.",
          "step_by_step": [
            {
              "step": "Find r₁",
              "explanation": "r₁ = 6,370 + 400 = 6,770 km = $6.77 \\times 10^6$ m"
            },
            {
              "step": "Find r₂",
              "explanation": "r₂ = 6,370 + 36,000 = 42,370 km = $4.237 \\times 10^7$ m"
            },
            {
              "step": "Notice relationship",
              "explanation": "$v \\propto 1/\\sqrt{r}$, so $\\frac{v_2}{v_1} = \\sqrt{\\frac{r_1}{r_2}}$"
            },
            {
              "step": "Calculate ratio",
              "explanation": "$\\frac{v_2}{v_1} = \\sqrt{\\frac{6.77 \\times 10^6}{4.237 \\times 10^7}} = \\sqrt{0.16} = 0.4$"
            }
          ],
          "final_answer": "The geostationary satellite moves at only 40% of the speed of the low-Earth orbit satellite—about 3.1 km/s compared to 7.7 km/s.",
          "concept_applied": "Higher orbits = slower speeds."
        }
      ]
    },
    {
      "section_title": "Orbital Period",
      "introduction": "We can also find how long an orbit takes—the orbital period. This is important for satellites that need to stay over the same spot or pass over regularly.",
      "key_concept": {
        "definition": "The orbital period T is the time to complete one full orbit. Using $v = \\frac{2\\pi r}{T}$ and $v = \\sqrt{\\frac{GM}{r}}$, we get $T = 2\\pi \\sqrt{\\frac{r^3}{GM}}$.",
        "context": "This is Kepler's Third Law of planetary motion! It shows that the square of the period is proportional to the cube of the orbital radius."
      },
      "principles": [
        {
          "principle": "Period Formula",
          "statement": "$T = 2\\pi \\sqrt{\\frac{r^3}{GM}}$",
          "application": "This formula tells us that farther orbits take much longer—period increases faster than radius because of the $r^3$ term.",
          "example": "The ISS (r ≈ 6,770 km) takes about 90 minutes. The Moon (r ≈ 384,000 km) takes about 27.3 days—much longer because radius is 57 times larger!"
        },
        {
          "principle": "Geostationary Orbits",
          "statement": "A special orbit exists where the period equals Earth's rotation period (24 hours).",
          "application": "Satellites in this geostationary orbit appear fixed in the sky—perfect for communications and weather satellites.",
          "example": "To have T = 24 hours, we can solve for r: $r = \\sqrt[3]{\\frac{GMT^2}{4\\pi^2}}$. This gives r ≈ 42,000 km from Earth's center (about 36,000 km altitude)."
        }
      ],
      "worked_examples": [
        {
          "title": "Finding Orbital Period",
          "problem": "Calculate the period of the ISS orbiting at r = 6,770 km from Earth's center. $M = 5.97 \\times 10^{24}$ kg, $G = 6.67 \\times 10^{-11}$.",
          "step_by_step": [
            {
              "step": "Write formula",
              "explanation": "$T = 2\\pi \\sqrt{\\frac{r^3}{GM}}$"
            },
            {
              "step": "Convert r to meters",
              "explanation": "$r = 6.77 \\times 10^6$ m"
            },
            {
              "step": "Calculate r³",
              "explanation": "$r^3 = (6.77 \\times 10^6)^3 = 3.10 \\times 10^{20}$"
            },
            {
              "step": "Calculate GM",
              "explanation": "$GM = (6.67 \\times 10^{-11})(5.97 \\times 10^{24}) = 3.98 \\times 10^{14}$"
            },
            {
              "step": "Divide r³ by GM",
              "explanation": "$\\frac{3.10 \\times 10^{20}}{3.98 \\times 10^{14}} = 7.79 \\times 10^5$"
            },
            {
              "step": "Square root",
              "explanation": "$\\sqrt{7.79 \\times 10^5} = 882.5$ seconds"
            },
            {
              "step": "Multiply by 2π",
              "explanation": "$T = 2\\pi \\times 882.5 \\approx 5,545$ seconds"
            },
            {
              "step": "Convert to minutes",
              "explanation": "$5,545 \\div 60 \\approx 92.4$ minutes"
            }
          ],
          "final_answer": "The ISS orbital period is approximately 92.4 minutes.",
          "concept_applied": "Period depends on orbital radius and central mass."
        }
      ]
    },
    {
      "section_title": "Real-World Orbits",
      "introduction": "Different orbits serve different purposes. Understanding orbital motion helps explain why satellites are placed at specific altitudes.",
      "classifications": [
        {
          "type": "Low Earth Orbit (LEO)",
          "value": "160 km to 2,000 km altitude",
          "characteristics": [
            "Short period: 90-120 minutes",
            "Fast speed: ~7.8 km/s",
            "Close to Earth"
          ],
          "behavior": "Satellites in LEO move quickly and see different parts of Earth each orbit. Good for imaging, science, and the ISS.",
          "examples": [
            {
              "process": "International Space Station",
              "explanation": "Orbits at ~400 km, period ~90 minutes. Astronauts see 16 sunrises/sunsets per day!"
            },
            {
              "process": "Earth observation satellites",
              "explanation": "Take high-resolution images as they pass over different locations."
            },
            {
              "process": "Hubble Space Telescope",
              "explanation": "Orbits at ~540 km to get clear views above atmosphere."
            }
          ]
        },
        {
          "type": "Medium Earth Orbit (MEO)",
          "value": "2,000 km to 35,000 km altitude",
          "characteristics": [
            "Period: 2-24 hours",
            "Moderate speed",
            "GPS satellites here"
          ],
          "behavior": "Satellites at this altitude have longer periods and cover larger areas.",
          "examples": [
            {
              "process": "GPS satellites",
              "explanation": "Orbit at about 20,000 km altitude with period ~12 hours. This allows good coverage with fewer satellites."
            }
          ]
        },
        {
          "type": "Geostationary Orbit (GEO)",
          "value": "~36,000 km altitude",
          "characteristics": [
            "Period exactly 24 hours",
            "Matches Earth's rotation",
            "Appears fixed in sky"
          ],
          "behavior": "Satellites here stay over the same spot on Earth continuously. Perfect for communications and weather monitoring.",
          "examples": [
            {
              "process": "Weather satellites",
              "explanation": "Constantly watch the same hemisphere, providing continuous weather images."
            },
            {
              "process": "Communications satellites",
              "explanation": "TV and phone satellites in GEO allow dishes to point at fixed positions."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/orbit_types.png",
        "alt": "Diagram showing LEO, MEO, and GEO orbits around Earth with altitude labels",
        "caption": "Different orbits serve different purposes—LEO is fast and close, GEO is slow and fixed"
      }
    },
    {
      "section_title": "Why Don't Satellites Fall?",
      "introduction": "This is the most common question about orbits. The answer lies in understanding that satellites ARE falling—they're just falling around Earth instead of into it.",
      "key_concept": {
        "definition": "Satellites don't fall to Earth because their forward speed is so high that as they fall, Earth curves away beneath them at the same rate.",
        "context": "Imagine throwing a ball horizontally. It falls to the ground because Earth is flat (locally). But Earth is round—if you throw it fast enough, it falls all the way around and comes back to you."
      },
      "principles": [
        {
          "principle": "Forward Motion + Gravity = Orbit",
          "statement": "A satellite has two motions simultaneously: it's moving forward at high speed, and it's falling toward Earth due to gravity.",
          "application": "These combine to create a curved path. If the forward speed is just right, the curve matches Earth's curve.",
          "example": "The ISS moves forward at 7.66 km/s and falls toward Earth at the same rate Earth curves away. Result: it stays at constant altitude."
        },
        {
          "principle": "No Forward Speed = Direct Fall",
          "statement": "If a satellite stopped moving forward, it would fall straight down like any dropped object.",
          "application": "This is why satellites need periodic boosts—atmospheric drag (even tiny) slows them, reducing forward speed. Eventually they fall to Earth if not boosted.",
          "example": "The ISS gets regular boosts from visiting spacecraft to maintain its orbit against tiny atmospheric drag."
        }
      ],
      "worked_examples": [
        {
          "title": "Explaining Weightlessness",
          "problem": "Astronauts on the ISS appear weightless. Some people think this means there's no gravity. Explain what's really happening.",
          "step_by_step": [
            {
              "step": "State the facts about gravity",
              "explanation": "At ISS altitude (400 km), gravity is still about 90% as strong as on Earth's surface."
            },
            {
              "step": "Explain free fall",
              "explanation": "The ISS and astronauts are in continuous free fall toward Earth. They're falling together."
            },
            {
              "step": "Describe the feeling",
              "explanation": "Weightlessness happens because there's no support force—everything falls at the same rate. It's like being in a falling elevator, but permanently."
            }
          ],
          "final_answer": "Astronauts aren't weightless because gravity is absent—gravity is still strong! They're weightless because they're in continuous free fall, with no floor pushing up against them. Everything falls together, creating the sensation of weightlessness.",
          "concept_applied": "Orbit is free fall, and free fall creates apparent weightlessness."
        }
      ]
    },
    {
      "section_title": "Planetary Orbits",
      "introduction": "The same principles apply to planets orbiting the Sun and moons orbiting planets. Gravity governs motion on the largest scales.",
      "categories": [
        {
          "type": "Earth's Orbit",
          "description": "Earth orbits the Sun at about 150 million km distance.",
          "examples": [
            {
              "process": "Orbital speed",
              "explanation": "Earth moves at about 30 km/s (108,000 km/h!) in its orbit. That's fast enough to go from New York to Los Angeles in about 2 minutes."
            },
            {
              "process": "Orbital period",
              "explanation": "One year = 365 days. Using $T = 2\\pi \\sqrt{r^3/GM}$ with M = Sun's mass gives exactly this."
            },
            {
              "process": "Seasons",
              "explanation": "Seasons come from Earth's tilt, not distance—in fact, Earth is slightly closer to Sun in Northern Hemisphere winter!"
            }
          ]
        },
        {
          "type": "Moon's Orbit",
          "description": "The Moon orbits Earth at about 384,000 km.",
          "examples": [
            {
              "process": "Slow speed",
              "explanation": "The Moon moves at only about 1 km/s—much slower than low Earth satellites because it's much farther."
            },
            {
              "process": "Monthly cycle",
              "explanation": "The Moon's 27.3-day orbital period gives us our months and lunar phases."
            },
            {
              "process": "Tides",
              "explanation": "The Moon's gravity causes ocean tides—another example of gravity at work across space."
            }
          ]
        },
        {
          "type": "Other Planets",
          "description": "All planets follow Kepler's laws—farther planets orbit more slowly and take longer years.",
          "examples": [
            {
              "process": "Mercury",
              "explanation": "Closest to Sun, orbits in just 88 Earth days at about 48 km/s."
            },
            {
              "process": "Jupiter",
              "explanation": "5 times farther than Earth, takes 12 Earth years for one orbit at about 13 km/s."
            },
            {
              "process": "Neptune",
              "explanation": "30 times farther than Earth, takes 165 Earth years for one orbit at about 5 km/s."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/solar_system_orbits.png",
        "alt": "Diagram of solar system showing planetary orbits with relative sizes and speeds indicated",
        "caption": "Inner planets orbit faster; outer planets orbit slower—all obey $v = \\sqrt{GM/r}$"
      }
    },
    {
      "section_title": "Practice Problems",
      "introduction": "Apply your understanding of orbital motion.",
      "worked_examples": [
        {
          "title": "Problem 1: Orbital Speed",
          "problem": "A satellite orbits Mars at 500 km altitude. Mars' radius is 3,390 km, mass is $6.39 \\times 10^{23}$ kg. $G = 6.67 \\times 10^{-11}$. Find orbital speed.",
          "step_by_step": [
            {
              "step": "Find orbital radius",
              "explanation": "r = 3,390 + 500 = 3,890 km = $3.89 \\times 10^6$ m"
            },
            {
              "step": "Use formula",
              "explanation": "$v = \\sqrt{\\frac{GM}{r}}$"
            },
            {
              "step": "Calculate GM",
              "explanation": "$GM = (6.67 \\times 10^{-11})(6.39 \\times 10^{23}) = 4.26 \\times 10^{13}$"
            },
            {
              "step": "Divide by r",
              "explanation": "$\\frac{4.26 \\times 10^{13}}{3.89 \\times 10^6} = 1.10 \\times 10^7$"
            },
            {
              "step": "Square root",
              "explanation": "$v = \\sqrt{1.10 \\times 10^7} \\approx 3,317$ m/s = 3.32 km/s"
            }
          ],
          "final_answer": "The orbital speed is approximately 3.32 km/s.",
          "concept_applied": "Orbital speed depends on central body mass and radius."
        },
        {
          "title": "Problem 2: Orbital Period",
          "problem": "What is the orbital period for the Mars satellite in problem 1?",
          "step_by_step": [
            {
              "step": "Use period formula",
              "explanation": "$T = 2\\pi \\sqrt{\\frac{r^3}{GM}}$"
            },
            {
              "step": "We have r = $3.89 \\times 10^6$ m, $GM = 4.26 \\times 10^{13}$"
            },
            {
              "step": "Calculate r³",
              "explanation": "$r^3 = (3.89 \\times 10^6)^3 = 5.89 \\times 10^{19}$"
            },
            {
              "step": "Divide r³ by GM",
              "explanation": "$\\frac{5.89 \\times 10^{19}}{4.26 \\times 10^{13}} = 1.38 \\times 10^6$"
            },
            {
              "step": "Square root",
              "explanation": "$\\sqrt{1.38 \\times 10^6} = 1,175$ seconds"
            },
            {
              "step": "Multiply by 2π",
              "explanation": "$T = 2\\pi \\times 1,175 \\approx 7,380$ seconds"
            },
            {
              "step": "Convert to minutes",
              "explanation": "$7,380 \\div 60 = 123$ minutes"
            }
          ],
          "final_answer": "The orbital period is approximately 123 minutes (about 2 hours).",
          "concept_applied": "Period depends on orbital radius."
        },
        {
          "title": "Problem 3: Comparing Orbits",
          "problem": "Satellite A orbits Earth at 400 km altitude. Satellite B orbits at 800 km altitude. Which has higher speed? Which has longer period?",
          "step_by_step": [
            {
              "step": "Speed relationship",
              "explanation": "$v \\propto 1/\\sqrt{r}$, so larger r means smaller v"
            },
            {
              "step": "Compare speeds",
              "explanation": "Satellite B has larger r (800 vs 400 km), so it has LOWER speed"
            },
            {
              "step": "Period relationship",
              "explanation": "$T \\propto \\sqrt{r^3}$, so larger r means much larger T"
            },
            {
              "step": "Compare periods",
              "explanation": "Satellite B has larger r, so it has LONGER period"
            }
          ],
          "final_answer": "Satellite A (lower altitude) has higher speed. Satellite B (higher altitude) has longer period.",
          "concept_applied": "Higher orbit = slower speed, longer period."
        },
        {
          "title": "Problem 4: Geostationary Orbit",
          "problem": "A geostationary satellite must have period = 24 hours. Earth's mass is $5.97 \\times 10^{24}$ kg. Find its orbital radius.",
          "step_by_step": [
            {
              "step": "Convert period to seconds",
              "explanation": "$T = 24 \\times 60 \\times 60 = 86,400$ s"
            },
            {
              "step": "Use period formula rearranged",
              "explanation": "$r^3 = \\frac{GMT^2}{4\\pi^2}$"
            },
            {
              "step": "Calculate $GMT^2$",
              "explanation": "$GM = 3.98 \\times 10^{14}$, $T^2 = (8.64 \\times 10^4)^2 = 7.46 \\times 10^9$"
            },
            {
              "step": "Multiply",
              "explanation": "$GMT^2 = (3.98 \\times 10^{14})(7.46 \\times 10^9) = 2.97 \\times 10^{24}$"
            },
            {
              "step": "Divide by $4\\pi^2$",
              "explanation": "$4\\pi^2 \\approx 39.5$, so $r^3 = \\frac{2.97 \\times 10^{24}}{39.5} = 7.52 \\times 10^{22}$"
            },
            {
              "step": "Cube root",
              "explanation": "$r = \\sqrt[3]{7.52 \\times 10^{22}} \\approx 4.22 \\times 10^7$ m = 42,200 km"
            },
            {
              "step": "Find altitude",
              "explanation": "Altitude = r - Earth's radius = 42,200 - 6,370 = 35,830 km"
            }
          ],
          "final_answer": "Geostationary orbit radius is about 42,200 km from Earth's center, altitude about 35,800 km.",
          "concept_applied": "Period determines orbital radius for given central body."
        }
      ]
    },
    {
      "section_title": "Common Misconceptions",
      "introduction": "Here are frequent misunderstandings about orbital motion.",
      "principles": [
        {
          "principle": "Misconception: No gravity in orbit",
          "statement": "Many think astronauts float because there's no gravity in space.",
          "application": "Gravity is still strong in orbit—about 90% of surface gravity at ISS altitude. Weightlessness comes from free fall, not absence of gravity.",
          "example": "If gravity stopped, the ISS would fly off in a straight line, not continue orbiting."
        },
        {
          "principle": "Misconception: Satellites are above the atmosphere, so no forces act",
          "statement": "Some think satellites have no forces acting on them.",
          "application": "Gravity is constantly acting on satellites—that's what keeps them in orbit! Also, tiny atmospheric drag exists even at ISS altitude.",
          "example": "Satellites in LEO slowly lose altitude due to atmospheric drag and need boosts."
        },
        {
          "principle": "Misconception: Farther satellites move faster to cover larger distance",
          "statement": "Intuitively, some think farther orbits need higher speed to get around in reasonable time.",
          "application": "Actually, $v = \\sqrt{GM/r}$ shows farther orbits are SLOWER. The Moon orbits at ~1 km/s, much slower than LEO satellites.",
          "example": "This is why outer planets have longer years—they move slower AND have farther to go."
        },
        {
          "principle": "Misconception: Rockets need to reach orbit by going straight up",
          "statement": "Many think rockets go straight up to reach space.",
          "application": "Going to orbit requires going FAST sideways, not just up. Rockets go up first to get above thick atmosphere, then accelerate sideways to orbital speed.",
          "example": "The Space Shuttle launched almost vertically but ended up going 17,500 mph sideways—that's the orbital speed!"
        }
      ]
    },
    {
      "section_title": "Simple Demonstrations and Analogies",
      "introduction": "You can understand orbital motion through simple analogies and thought experiments.",
      "process_flow": [
        {
          "step": "1",
          "process": "The string and ball analogy",
          "description": "Imagine a ball on a string, swung in a circle. The string is like gravity—it pulls inward.",
          "mechanism": "If you let go (remove gravity), the ball flies off tangent. If you pull harder (stronger gravity), it moves in tighter circle.",
          "result": "This models how gravity keeps planets in orbit—the 'string' is invisible gravity."
        },
        {
          "step": "2",
          "process": "The curved Earth thought experiment",
          "description": "Draw a large circle representing Earth. Draw straight lines tangent to it at various points.",
          "mechanism": "Notice how the straight lines quickly move away from the circle. Orbital speed is when the curved path matches Earth's curve.",
          "result": "Visualizes why forward speed matters—too slow and path curves inside Earth (hit), too fast and path curves outside (escape)."
        },
        {
          "step": "3",
          "process": "Water whirlpool analogy",
          "description": "Water circling a drain moves faster near the center, slower farther out.",
          "mechanism": "This mimics orbital motion—objects closer to the central body orbit faster.",
          "result": "Analogous to inner planets moving faster than outer planets."
        }
      ]
    }
  ],
  "key_terms": [
    "Orbital motion",
    "Gravity",
    "Centripetal force",
    "Newton's cannonball",
    "Orbital speed",
    "Orbital period",
    "Free fall",
    "Weightlessness",
    "Low Earth Orbit (LEO)",
    "Geostationary orbit (GEO)",
    "Kepler's laws",
    "Escape velocity",
    "$v = \\sqrt{\\frac{GM}{r}}$",
    "$T = 2\\pi \\sqrt{\\frac{r^3}{GM}}$",
    "Gravitational constant (G)"
  ],
  "summary": "Orbital motion occurs when gravity provides exactly the centripetal force needed to keep an object moving in a circular path around a larger body. Newton's cannonball thought experiment shows that orbit is really continuous free fall—objects fall toward Earth, but their forward speed makes them 'miss' as Earth curves away. The orbital speed formula $v = \\sqrt{\\frac{GM}{r}}$ reveals that speed depends only on the mass of the central body and orbital radius—not on the mass of the orbiting object. Higher orbits are slower orbits. The orbital period formula $T = 2\\pi \\sqrt{\\frac{r^3}{GM}}$ shows that period increases dramatically with radius. Different orbits serve different purposes: Low Earth Orbit (LEO) for the ISS and imaging satellites, Medium Earth Orbit (MEO) for GPS, and Geostationary Orbit (GEO) for communications and weather satellites. Astronauts experience weightlessness not because gravity is absent, but because they're in continuous free fall. Understanding orbital motion connects our circular motion physics to the cosmos, explaining why planets move as they do and how we put satellites into precise orbits. This foundation prepares us for examining the apparent force called centrifugal force in the next section."
}
