{
  "expanded_description": "This section provides a comprehensive review of circular motion concepts covered in Unit 6, including foundational ideas, centripetal force, variables, friction, tension, vertical motion, orbital mechanics, and centrifugal effects. Questions range from conceptual understanding to quantitative problem-solving.",
  "core_concept": {
    "principle": "Review and reinforcement of circular motion concepts helps solidify understanding and prepares students for assessment.",
    "explanation": "Working through varied questions—conceptual, qualitative, and quantitative—builds confidence and reveals areas needing further study before the chapter test.",
    "image": {
      "src": "images/unit6/review_concepts.png",
      "alt": "Mind map showing connections between all circular motion topics: centripetal force, friction, tension, orbits, centrifugal effect",
      "caption": "Circular motion concepts connect and build upon each other"
    }
  },
  "sections": [
    {
      "section_title": "Conceptual Review Questions",
      "introduction": "These questions test your understanding of the fundamental ideas behind circular motion. Answer in complete sentences, explaining the physics principles involved.",
      "principles": [
        {
          "principle": "Question 1: Circular Motion Basics",
          "statement": "An object moves in a circle at constant speed. Is it accelerating? Explain why or why not.",
          "application": "This question checks understanding of velocity as a vector and acceleration as any change in velocity.",
          "example": "Answer: Yes, it is accelerating because acceleration includes changes in direction. Even though speed is constant, the direction is continuously changing, so velocity changes, which means acceleration occurs."
        },
        {
          "principle": "Question 2: Centripetal Force Necessity",
          "statement": "Explain why an object needs a centripetal force to move in a circular path. Reference Newton's first law in your answer.",
          "application": "Connects to Newton's first law—objects naturally move in straight lines without force.",
          "example": "Answer: Newton's first law states that objects in motion stay in motion with the same speed and direction unless acted upon by an unbalanced force. Circular motion involves constantly changing direction, so an unbalanced force (centripetal force) must act toward the center to cause this change."
        },
        {
          "principle": "Question 3: Centripetal Force Sources",
          "statement": "List four different forces that can provide centripetal force, and give a real-world example of each.",
          "application": "Tests ability to identify centripetal force sources in different contexts.",
          "example": "Answer: (1) Tension—ball on a string; (2) Friction—car turning on a flat road; (3) Gravity—Moon orbiting Earth; (4) Normal force—rider on a merry-go-round or car on a banked curve."
        },
        {
          "principle": "Question 4: Qualitative vs. Quantitative Observations",
          "statement": "Give an example of a qualitative observation and a quantitative observation you could make about a child on a merry-go-round.",
          "application": "Reviews observation types from Section 6.1.",
          "example": "Answer: Qualitative—'The child on the outside moves faster than the child near the center.' Quantitative—'The child at radius 3 m completes one revolution in 4 seconds, giving a speed of 4.7 m/s.'"
        },
        {
          "principle": "Question 5: Controlled Experiments",
          "statement": "You want to test how the length of a string affects the period of a swinging ball. Describe how you would set up a controlled experiment.",
          "application": "Reviews experimental design from Section 6.1.",
          "example": "Answer: Use the same mass for all trials. Change only the string length (independent variable). Measure time for 10 complete swings and divide by 10 to get period (dependent variable). Keep release angle and location constant. Repeat each length three times and average."
        }
      ]
    },
    {
      "section_title": "Variables and Relationships Questions",
      "introduction": "These questions focus on the relationships between radius, speed, period, and centripetal force. Use the formulas $v = \\frac{2\\pi r}{T}$ and $F_c = \\frac{mv^2}{r}$ where needed.",
      "principles": [
        {
          "principle": "Question 6: Speed-Period-Radius Relationship",
          "statement": "A merry-go-round of radius 4 m completes one rotation every 8 seconds. Calculate the speed of a horse on the edge.",
          "application": "Direct application of $v = 2\\pi r / T$.",
          "example": "Answer: $v = \\frac{2\\pi r}{T} = \\frac{2 \\times 3.14 \\times 4}{8} = \\frac{25.12}{8} = 3.14$ m/s."
        },
        {
          "principle": "Question 7: Finding Period",
          "statement": "A car travels at 25 m/s around a circular track of radius 200 m. How long does it take to complete one lap?",
          "application": "Rearrange $v = 2\\pi r / T$ to solve for T.",
          "example": "Answer: $T = \\frac{2\\pi r}{v} = \\frac{2 \\times 3.14 \\times 200}{25} = \\frac{1,256}{25} = 50.2$ seconds."
        },
        {
          "principle": "Question 8: Proportional Reasoning",
          "statement": "Two satellites orbit Earth at different altitudes. Satellite A has orbital radius r, Satellite B has orbital radius 2r. How do their orbital speeds compare? (Assume circular orbits around the same body.)",
          "application": "Tests understanding that $v \\propto 1/\\sqrt{r}$ from $v = \\sqrt{GM/r}$.",
          "example": "Answer: $v \\propto 1/\\sqrt{r}$, so doubling r means speed is divided by $\\sqrt{2} \\approx 1.414$. Satellite B's speed is about 0.707 times Satellite A's speed."
        },
        {
          "principle": "Question 9: Centripetal Force Calculation",
          "statement": "A 0.8 kg object is swung in a horizontal circle of radius 1.2 m at a speed of 5 m/s. Calculate the centripetal force acting on it.",
          "application": "Direct application of $F_c = mv^2/r$.",
          "example": "Answer: $F_c = \\frac{mv^2}{r} = \\frac{0.8 \\times 5^2}{1.2} = \\frac{0.8 \\times 25}{1.2} = \\frac{20}{1.2} = 16.7$ N."
        },
        {
          "principle": "Question 10: Effect of Changing Variables",
          "statement": "If you double the speed of an object in circular motion while keeping radius constant, what happens to the required centripetal force? Explain.",
          "application": "Tests understanding that $F_c \\propto v^2$.",
          "example": "Answer: Centripetal force quadruples because $F_c$ is proportional to $v^2$. Doubling speed means $(2)^2 = 4$ times the force."
        }
      ]
    },
    {
      "section_title": "Friction and Tension Questions",
      "introduction": "These questions apply circular motion concepts to situations involving friction and tension as centripetal forces.",
      "principles": [
        {
          "principle": "Question 11: Maximum Speed on a Curve",
          "statement": "A curve on a highway has radius 80 m. The coefficient of friction between tires and dry pavement is 0.7. Calculate the maximum safe speed in m/s and km/h. ($g = 9.8$ m/s²)",
          "application": "Use $v_{max} = \\sqrt{\\mu g r}$.",
          "example": "Answer: $v_{max} = \\sqrt{\\mu g r} = \\sqrt{0.7 \\times 9.8 \\times 80} = \\sqrt{548.8} \\approx 23.4$ m/s. In km/h: $23.4 \\times 3.6 \\approx 84.2$ km/h."
        },
        {
          "principle": "Question 12: Effect of Rain",
          "statement": "The same curve (r = 80 m) becomes wet, reducing the friction coefficient to 0.4. What is the new maximum safe speed? By what percentage has it decreased?",
          "application": "Compare speeds using $v \\propto \\sqrt{\\mu}$.",
          "example": "Answer: $v_{wet} = \\sqrt{0.4 \\times 9.8 \\times 80} = \\sqrt{313.6} \\approx 17.7$ m/s. Decrease from 23.4 to 17.7 m/s is a reduction of $(23.4 - 17.7)/23.4 \\times 100\\% \\approx 24\\%$."
        },
        {
          "principle": "Question 13: Tension in a String",
          "statement": "A 0.25 kg ball is swung in a horizontal circle on a 1.5 m string at a speed of 6 m/s. Calculate the tension in the string.",
          "application": "For horizontal circles, $T = mv^2/r$.",
          "example": "Answer: $T = \\frac{mv^2}{r} = \\frac{0.25 \\times 6^2}{1.5} = \\frac{0.25 \\times 36}{1.5} = \\frac{9}{1.5} = 6$ N."
        },
        {
          "principle": "Question 14: String Breaking",
          "statement": "A string can withstand a maximum tension of 25 N before breaking. If you attach a 0.4 kg mass to it and swing in a circle of radius 0.8 m, what is the maximum speed possible?",
          "application": "Rearrange $T = mv^2/r$ to solve for v: $v = \\sqrt{Tr/m}$.",
          "example": "Answer: $v = \\sqrt{\\frac{Tr}{m}} = \\sqrt{\\frac{25 \\times 0.8}{0.4}} = \\sqrt{\\frac{20}{0.4}} = \\sqrt{50} \\approx 7.07$ m/s."
        },
        {
          "principle": "Question 15: Friction vs. Banking",
          "statement": "Explain why banked curves allow higher safe speeds than flat curves. Include a force diagram in your explanation.",
          "application": "Reviews banking concept from Section 6.4.",
          "example": "Answer: On a banked curve, the normal force has a horizontal component pointing toward the center. This component provides additional centripetal force beyond what friction alone can supply. At the ideal banking angle, friction isn't even needed—the normal force component alone provides the required centripetal force. This allows higher speeds and safer turns, especially in poor traction conditions."
        }
      ]
    },
    {
      "section_title": "Vertical Circular Motion Questions",
      "introduction": "These questions test understanding of vertical circles, where gravity affects speed and tension.",
      "principles": [
        {
          "principle": "Question 16: Minimum Speed at Top",
          "statement": "A roller coaster loop has radius 10 m. What minimum speed is needed at the top for cars to stay on track? ($g = 9.8$ m/s²)",
          "application": "Use $v_{min} = \\sqrt{gr}$.",
          "example": "Answer: $v_{min} = \\sqrt{gr} = \\sqrt{9.8 \\times 10} = \\sqrt{98} \\approx 9.9$ m/s (about 35.6 km/h)."
        },
        {
          "principle": "Question 17: Tension at Bottom",
          "statement": "A 2 kg ball is swung in a vertical circle of radius 2 m. At the bottom, its speed is 8 m/s. Calculate the tension in the string at the bottom.",
          "application": "At bottom, $T = mv^2/r + mg$.",
          "example": "Answer: $T = \\frac{mv^2}{r} + mg = \\frac{2 \\times 8^2}{2} + (2 \\times 9.8) = \\frac{2 \\times 64}{2} + 19.6 = 64 + 19.6 = 83.6$ N."
        },
        {
          "principle": "Question 18: Tension at Top",
          "statement": "For the same ball (2 kg, r = 2 m), its speed at the top is 5 m/s. Calculate tension at the top. Is this safe?",
          "application": "At top, $T = mv^2/r - mg$. Compare to minimum speed.",
          "example": "Answer: $T = \\frac{2 \\times 5^2}{2} - 19.6 = \\frac{2 \\times 25}{2} - 19.6 = 25 - 19.6 = 5.4$ N. Minimum speed needed is $\\sqrt{gr} = \\sqrt{19.6} \\approx 4.43$ m/s. Since 5 m/s > 4.43 m/s, it is safe—tension is positive."
        },
        {
          "principle": "Question 19: Bucket of Water",
          "statement": "A student swings a bucket of water in a vertical circle of radius 0.9 m. What minimum speed at the top is needed to keep water in the bucket?",
          "application": "Same $v_{min} = \\sqrt{gr}$ applies.",
          "example": "Answer: $v_{min} = \\sqrt{9.8 \\times 0.9} = \\sqrt{8.82} \\approx 2.97$ m/s. Below this speed, the bucket wouldn't push inward hard enough on the water, and it would fall out."
        },
        {
          "principle": "Question 20: Comparing Top and Bottom",
          "statement": "Explain why tension is greater at the bottom of a vertical circle than at the top, even if speed were the same (which it isn't).",
          "application": "Conceptual understanding of gravity's role.",
          "example": "Answer: At the bottom, gravity pulls away from the center, so tension must overcome gravity AND provide centripetal force. At the top, gravity pulls toward the center, helping provide centripetal force, so less tension is needed. In real vertical motion, speed is also greater at bottom due to energy conservation, further increasing the tension difference."
        }
      ]
    },
    {
      "section_title": "Orbital Motion Questions",
      "introduction": "These questions apply circular motion concepts to orbital mechanics, using $v = \\sqrt{\\frac{GM}{r}}$ and $T = 2\\pi \\sqrt{\\frac{r^3}{GM}}$.",
      "principles": [
        {
          "principle": "Question 21: Orbital Speed",
          "statement": "Calculate the orbital speed of the International Space Station if it orbits at an altitude of 400 km above Earth's surface. Earth's radius is 6,370 km, mass is $5.97 \\times 10^{24}$ kg, and $G = 6.67 \\times 10^{-11}$.",
          "application": "Find r = R + altitude, then $v = \\sqrt{GM/r}$.",
          "example": "Answer: $r = 6.37 \\times 10^6 + 4.00 \\times 10^5 = 6.77 \\times 10^6$ m. $v = \\sqrt{\\frac{(6.67 \\times 10^{-11})(5.97 \\times 10^{24})}{6.77 \\times 10^6}} = \\sqrt{\\frac{3.98 \\times 10^{14}}{6.77 \\times 10^6}} = \\sqrt{5.88 \\times 10^7} \\approx 7,670$ m/s = 7.67 km/s."
        },
        {
          "principle": "Question 22: Orbital Period",
          "statement": "Using the same values, calculate the orbital period of the ISS in minutes.",
          "application": "$T = 2\\pi \\sqrt{r^3/GM}$.",
          "example": "Answer: $T = 2\\pi \\sqrt{\\frac{(6.77 \\times 10^6)^3}{3.98 \\times 10^{14}}} = 2\\pi \\sqrt{\\frac{3.10 \\times 10^{20}}{3.98 \\times 10^{14}}} = 2\\pi \\sqrt{7.79 \\times 10^5} = 2\\pi \\times 882.5 \\approx 5,545$ seconds. $5,545 \\div 60 \\approx 92.4$ minutes."
        },
        {
          "principle": "Question 23: Geostationary Orbit",
          "statement": "What is special about a geostationary orbit? Calculate its approximate altitude above Earth's surface.",
          "application": "Geostationary means T = 24 hours = 86,400 s. Use $r^3 = \\frac{GMT^2}{4\\pi^2}$.",
          "example": "Answer: Geostationary satellites have period exactly 24 hours, so they appear fixed in the sky. $r^3 = \\frac{(6.67 \\times 10^{-11})(5.97 \\times 10^{24})(86,400)^2}{4\\pi^2} \\approx \\frac{3.98 \\times 10^{14} \\times 7.46 \\times 10^9}{39.5} \\approx 7.52 \\times 10^{22}$. $r \\approx \\sqrt[3]{7.52 \\times 10^{22}} \\approx 4.22 \\times 10^7$ m = 42,200 km from center. Altitude = 42,200 - 6,370 = 35,830 km."
        },
        {
          "principle": "Question 24: Mass Cancellation",
          "statement": "Explain why the mass of a satellite does not appear in the formulas for orbital speed or period. What does this tell us?",
          "application": "Conceptual understanding of $v = \\sqrt{GM/r}$ and $T = 2\\pi \\sqrt{r^3/GM}$.",
          "example": "Answer: Mass cancels because both gravitational force ($F_g = GMm/r^2$) and centripetal force ($F_c = mv^2/r$) depend on the satellite's mass m. When we set them equal, m cancels out. This tells us that all objects at the same distance from a central body orbit at the same speed, regardless of their mass—a satellite and a massive space station at the same altitude need the same orbital velocity."
        },
        {
          "principle": "Question 25: Newton's Cannonball",
          "statement": "Explain Newton's cannonball thought experiment and what it demonstrates about orbital motion.",
          "application": "Reviews historical and conceptual foundation.",
          "example": "Answer: Newton imagined a cannon on a very tall mountain firing cannonballs horizontally. At low speeds, they hit the ground nearby. At higher speeds, they travel farther. At a critical speed (about 7.9 km/s for Earth), the cannonball falls completely around Earth and returns to its starting point—it's in orbit. This demonstrates that orbit is really continuous free fall: the object is falling toward Earth, but Earth curves away at the same rate, so it never hits."
        }
      ]
    },
    {
      "section_title": "Centrifugal Force Questions",
      "introduction": "These questions clarify the distinction between real centripetal force and apparent centrifugal effects.",
      "principles": [
        {
          "principle": "Question 26: Centrifugal vs. Centripetal",
          "statement": "Distinguish between centripetal force and centrifugal force. Which is real and which is fictitious? Explain.",
          "application": "Fundamental conceptual distinction.",
          "example": "Answer: Centripetal force is a real force that acts inward toward the center of circular motion, caused by physical interactions like tension, friction, gravity, or normal force. Centrifugal force is an apparent outward effect experienced in rotating reference frames due to inertia—it has no physical source and disappears in inertial frames. Centripetal force is real; centrifugal force is fictitious."
        },
        {
          "principle": "Question 27: Feeling in a Turning Car",
          "statement": "When a car turns left, you feel pressed against the right door. Many people call this centrifugal force. Explain what is really happening using physics principles.",
          "application": "Apply understanding of inertia and frames of reference.",
          "example": "Answer: Your body's inertia wants to continue moving in a straight line (Newton's first law). The car turns left because friction provides centripetal force on the tires. The door pushes left on you (real centripetal force) to make you turn with the car. The feeling of being pressed against the door is your body resisting this leftward push—you feel the door pushing you, not an outward force. From your perspective in the rotating frame of the car, it seems like centrifugal force pushes you outward, but no such force exists."
        },
        {
          "principle": "Question 28: Frames of Reference",
          "statement": "Describe how the same situation (a ball on a string being swung in a circle) appears from: a) an inertial frame outside, and b) the rotating frame of the ball.",
          "application": "Frame of reference comparison.",
          "example": "Answer: a) From an inertial frame outside, an observer sees tension in the string pulling the ball inward (centripetal force). The ball's path is a circle because of this continuous inward pull. b) From the ball's rotating frame, the ball appears stationary while the world spins around it. To explain why the ball doesn't move in this frame, we must introduce centrifugal force pulling outward, balancing the inward tension. The centrifugal force is fictitious—it only exists to make Newton's laws work in the accelerating frame."
        },
        {
          "principle": "Question 29: Water in a Bucket",
          "statement": "Some people say centrifugal force keeps water in a bucket when swung vertically. Is this correct? Explain.",
          "application": "Apply correct physics to classic demonstration.",
          "example": "Answer: No, this is incorrect. The water stays in because the bucket pushes inward on the water (normal force) providing centripetal force. At the top, if speed is sufficient, the bucket pushes down on the water—that's inward for the circle. The water's inertia wants it to go straight, but the bucket continuously redirects it. If centrifugal force were real, releasing the bucket would make water fly radially outward—but it actually flies off tangent, proving only inward force existed."
        },
        {
          "principle": "Question 30: Artificial Gravity",
          "statement": "Explain how a rotating space station could create artificial gravity. Is this centrifugal force or centripetal force?",
          "application": "Apply rotating frame concepts.",
          "example": "Answer: A rotating space station creates artificial gravity through the centrifugal effect in the rotating frame. Astronauts inside the rotating ring feel pressed against the outer wall—this feels like gravity. The real force is the wall pushing inward on the astronauts (centripetal force), causing them to move in a circle. From their rotating perspective, it feels like centrifugal force pushes them outward against the wall. The 'gravity' they experience is actually their inertia resisting the inward push, interpreted in the rotating frame as an outward centrifugal effect."
        }
      ]
    },
    {
      "section_title": "Mixed Practice Problems",
      "introduction": "These problems combine multiple concepts from the unit and require more complex problem-solving.",
      "principles": [
        {
          "principle": "Question 31: Comprehensive Problem",
          "statement": "A 1200 kg car approaches a curve of radius 50 m on a flat road. The coefficient of friction between tires and road is 0.8 on dry pavement. a) What is the maximum safe speed in m/s and km/h? b) If the same curve is banked at an angle that provides an additional centripetal force equal to 0.3 times the car's weight, what is the new maximum safe speed? c) Explain why the banked curve is safer even at speeds below the maximum.",
          "application": "Combines friction, banking, and conceptual understanding.",
          "example": "Answer: a) $v_{max} = \\sqrt{\\mu g r} = \\sqrt{0.8 \\times 9.8 \\times 50} = \\sqrt{392} \\approx 19.8$ m/s × 3.6 = 71.3 km/h. b) Total centripetal force available = friction ($\\mu mg$) + banking component ($0.3mg$) = $0.8mg + 0.3mg = 1.1mg$. $v_{max} = \\sqrt{1.1 \\times 9.8 \\times 50} = \\sqrt{539} \\approx 23.2$ m/s × 3.6 = 83.5 km/h. c) The banked curve provides centripetal force from the normal force's horizontal component, which doesn't depend on friction. This means even if friction is reduced (rain, ice), some centripetal force is still available. Also, at the ideal speed for the banking angle, no friction is needed at all, making the turn possible even on ice."
        },
        {
          "principle": "Question 32: Vertical Circle with Energy",
          "statement": "A 0.5 kg ball is swung in a vertical circle of radius 1.2 m. At the bottom, its speed is 7 m/s. a) Calculate tension at the bottom. b) Using energy conservation (ignoring friction), estimate its speed at the top. (Hint: height difference = 2r, use $v_{top}^2 = v_{bottom}^2 - 4gr$) c) Calculate tension at the top and determine if the string remains taut.",
          "application": "Combines vertical circle formulas with energy concepts.",
          "example": "Answer: a) $T_{bottom} = \\frac{mv^2}{r} + mg = \\frac{0.5 \\times 49}{1.2} + (0.5 \\times 9.8) = \\frac{24.5}{1.2} + 4.9 = 20.42 + 4.9 = 25.32$ N. b) $v_{top}^2 = v_{bottom}^2 - 4gr = 49 - 4 \\times 9.8 \\times 1.2 = 49 - 47.04 = 1.96$, so $v_{top} = \\sqrt{1.96} = 1.4$ m/s. c) $T_{top} = \\frac{mv^2}{r} - mg = \\frac{0.5 \\times 1.96}{1.2} - 4.9 = \\frac{0.98}{1.2} - 4.9 = 0.817 - 4.9 = -4.08$ N. Negative tension means the string would go slack—the ball cannot maintain circular motion at this speed. Minimum speed needed at top is $\\sqrt{gr} = \\sqrt{9.8 \\times 1.2} = \\sqrt{11.76} \\approx 3.43$ m/s, so 1.4 m/s is insufficient."
        },
        {
          "principle": "Question 33: Satellite Comparison",
          "statement": "Satellite X orbits Earth at radius r. Satellite Y orbits at radius 2r. Compare: a) their orbital speeds, b) their orbital periods, c) their centripetal accelerations.",
          "application": "Compares orbital relationships.",
          "example": "Answer: a) $v \\propto 1/\\sqrt{r}$, so $v_Y/v_X = \\sqrt{r_X/r_Y} = \\sqrt{1/2} \\approx 0.707$. Satellite Y has about 70.7% of X's speed. b) $T \\propto \\sqrt{r^3}$, so $T_Y/T_X = \\sqrt{(2r)^3/r^3} = \\sqrt{8} \\approx 2.83$. Satellite Y's period is about 2.83 times longer. c) $a_c = v^2/r = GM/r^2$, so $a_c \\propto 1/r^2$, giving $a_Y/a_X = (r_X/r_Y)^2 = (1/2)^2 = 1/4$. Satellite Y has one-quarter the centripetal acceleration of X."
        },
        {
          "principle": "Question 34: Design Problem",
          "statement": "An engineer is designing a highway curve with radius 120 m. The speed limit will be 90 km/h. a) What minimum friction coefficient is needed for vehicles to safely take this curve? b) If the road is built with a banking angle that provides centripetal force equal to 0.2mg, what friction coefficient is now needed? c) Discuss the safety advantages of the banked design.",
          "application": "Real-world engineering application.",
          "example": "Answer: a) Convert 90 km/h to m/s: $90 \\div 3.6 = 25$ m/s. From $v^2 = \\mu g r$, $\\mu = \\frac{v^2}{gr} = \\frac{25^2}{9.8 \\times 120} = \\frac{625}{1,176} \\approx 0.53$. b) With banking providing 0.2mg, total available centripetal force = friction + banking = $\\mu mg + 0.2mg = (\\mu + 0.2)mg$. Set equal to $mv^2/r$: $(\\mu + 0.2)g = v^2/r$, so $\\mu + 0.2 = \\frac{v^2}{gr} = 0.53$, thus $\\mu = 0.33$. c) The banked design reduces the friction requirement from 0.53 to 0.33. This means the curve is safer in wet conditions (where μ might drop to 0.4-0.5), and even if friction is completely lost (ice), the banking alone provides 0.2g of centripetal force, allowing some safe speed (about $v = \\sqrt{0.2gr} \\approx 15.3$ m/s or 55 km/h) rather than zero."
        },
        {
          "principle": "Question 35: Conceptual Synthesis",
          "statement": "Explain how all of the following concepts are connected: centripetal force, inertia, frames of reference, and the experience of weightlessness in orbit.",
          "application": "Synthesizes multiple unit concepts.",
          "example": "Answer: In orbit, gravity provides the centripetal force needed for circular motion. The orbiting object's inertia wants it to go straight, but gravity continuously pulls it inward. From an inertial frame outside, we see this as circular motion with real centripetal force. From the orbiting object's frame, it appears stationary while Earth moves—and objects inside appear weightless. This weightlessness occurs because everything is in free fall together; there's no support force pushing up. The feeling of weightlessness is the absence of normal force, not the absence of gravity. This connects to centrifugal force because if you were in a rotating space station, the wall would push inward (centripetal), and in that rotating frame you'd feel centrifugal 'gravity'—the opposite of orbit's free-fall weightlessness. Both situations demonstrate how frame of reference affects what forces we perceive."
        }
      ]
    }
  ],
  "key_terms": [
    "Review",
    "Practice problems",
    "Conceptual questions",
    "Quantitative problems",
    "Synthesis",
    "Application",
    "Problem-solving",
    "Unit review"
  ],
  "summary": "This review section covers all major topics from Unit 6: Circular Motion, including foundational concepts (6.1), centripetal force (6.2), variables and relationships (6.3), friction as centripetal force (6.4), tension as centripetal force (6.5), vertical circular motion (6.6), orbital motion (6.7), and centrifugal force (6.8). Questions range from conceptual explanations to quantitative problem-solving using formulas such as $v = 2\\pi r/T$, $F_c = mv^2/r$, $v_{max} = \\sqrt{\\mu g r}$, $v_{min} = \\sqrt{gr}$ for vertical circles, $v = \\sqrt{GM/r}$ for orbits, and $T = 2\\pi \\sqrt{r^3/GM}$ for orbital periods. Working through these questions reinforces understanding, identifies areas needing additional study, and prepares students for the chapter test. The final synthesis questions connect multiple concepts, demonstrating how circular motion principles unify diverse phenomena from car turns to satellite orbits."
}
