{
  "expanded_description": "This section explores vertical circular motion—objects moving in circles oriented perpendicular to the ground. Students will discover how gravity affects speed and tension at different points in the circle, and learn about minimum speeds needed to complete loops safely.",
  "core_concept": {
    "principle": "In vertical circular motion, gravity constantly changes both the speed of the object and the tension in the string (or normal force from the track), making it more complex than horizontal circular motion.",
    "explanation": "Unlike horizontal circles where gravity acts perpendicular to motion, in vertical circles gravity pulls downward throughout the rotation. This means the object slows down going up, speeds up coming down, and requires different amounts of centripetal force at different points—leading to varying tension or normal force.",
    "image": {
      "src": "images/unit6/vertical_circular_motion.png",
      "alt": "Diagram of a vertical circle showing an object at different positions with gravity arrows and varying speed indicators",
      "caption": "In vertical circular motion, speed and tension change continuously due to gravity"
    }
  },
  "sections": [
    {
      "section_title": "What is Vertical Circular Motion?",
      "introduction": "Think about a roller coaster loop, a ball on a string swung in a vertical circle, or a Ferris wheel. These are all examples of vertical circular motion—objects moving in circles that are perpendicular to the ground, where gravity plays a constant role.",
      "key_concept": {
        "definition": "Vertical circular motion is movement along a circular path that lies in a vertical plane, with gravity acting downward at all points.",
        "context": "Because gravity always pulls down, objects in vertical circular motion are constantly gaining and losing speed as they move up and down. This makes them examples of non-uniform circular motion."
      },
      "principles": [
        {
          "principle": "Gravity Affects Speed",
          "statement": "As an object rises in a vertical circle, gravity slows it down. As it falls, gravity speeds it up.",
          "application": "This means the object moves fastest at the bottom of the circle and slowest at the top—opposite of what you might expect!",
          "example": "A ball on a string swung vertically moves noticeably slower at the top than at the bottom. You can feel this if you try it.",
          "analogy": "Think of a swing: it's fastest at the bottom and slows to a stop at the top of each swing—same principle applies to full circles."
        },
        {
          "principle": "Gravity Affects Required Force",
          "statement": "At different points in the circle, gravity either helps or hinders the centripetal force.",
          "application": "At the top, gravity pulls toward the center (helping). At the bottom, gravity pulls away from the center (opposing).",
          "example": "A roller coaster at the top of a loop feels 'light' because gravity helps keep it on track. At the bottom, riders feel heavy because the track must push up extra hard."
        }
      ],
      "image": {
        "src": "images/unit6/vertical_circle_positions.png",
        "alt": "Vertical circle labeled with four key positions: top, bottom, left, right, with speed indicators",
        "caption": "Speed is minimum at the top, maximum at the bottom in vertical circular motion"
      }
    },
    {
      "section_title": "Forces at Different Positions",
      "introduction": "To understand vertical circular motion, we need to analyze the forces at key points around the circle. The balance between gravity and tension (or normal force) changes dramatically depending on where the object is.",
      "key_concept": {
        "definition": "The net force toward the center (centripetal force) equals the vector sum of tension and the radial component of gravity at each point.",
        "context": "This means the tension (or normal force) must adjust continuously to provide exactly the centripetal force needed—neither too much nor too little."
      },
      "classifications": [
        {
          "type": "At the Bottom",
          "value": "Maximum speed, maximum tension",
          "characteristics": [
            "Gravity pulls away from center (downward)",
            "Tension must overcome gravity AND provide centripetal force",
            "Tension is greatest here"
          ],
          "behavior": "At the bottom, the object is moving fastest and gravity is pulling opposite to the centripetal direction. The string or track must pull/push extra hard to provide enough inward force.",
          "examples": [
            {
              "process": "Roller coaster at bottom of loop",
              "explanation": "Riders feel heavy (increased apparent weight) because the track pushes up with force greater than gravity."
            },
            {
              "process": "Ball on string at bottom",
              "explanation": "The string tension is maximum here. You feel the strongest pull on your hand at the bottom of each swing."
            }
          ],
          "formula": "T_bottom - mg = mv²/r  or  T_bottom = mv²/r + mg"
        },
        {
          "type": "At the Top",
          "value": "Minimum speed, minimum tension",
          "characteristics": [
            "Gravity pulls toward center (downward)",
            "Gravity helps provide centripetal force",
            "Tension may become zero at minimum speed"
          ],
          "behavior": "At the top, the object is moving slowest and gravity pulls toward the center. This means less tension is needed—sometimes none at all if speed is just enough.",
          "examples": [
            {
              "process": "Roller coaster at top of loop",
              "explanation": "Riders feel weightless if speed is just right. Gravity alone provides the centripetal force."
            },
            {
              "process": "Ball on string at top",
              "explanation": "The string may go slack if speed is too low. At minimum speed, tension = 0 and gravity alone keeps it in circle."
            }
          ],
          "formula": "T_top + mg = mv²/r  or  T_top = mv²/r - mg"
        },
        {
          "type": "At the Sides",
          "value": "Intermediate speed and tension",
          "characteristics": [
            "Gravity pulls perpendicular to radial direction",
            "Gravity neither helps nor hinders centripetal force directly",
            "Tension equals mv²/r exactly"
          ],
          "behavior": "At the leftmost and rightmost points, gravity is tangent to the circle. It affects speed (slowing on way up, speeding on way down) but doesn't contribute to centripetal force.",
          "examples": [
            {
              "process": "Roller coaster at side of loop",
              "explanation": "The track pushes horizontally inward; gravity pulls straight down, perpendicular."
            },
            {
              "process": "Ball on string at side",
              "explanation": "The string is horizontal, tension provides all centripetal force. Gravity is changing the speed."
            }
          ],
          "formula": "T_side = mv²/r  (same as horizontal circle at that instant)"
        }
      ],
      "image": {
        "src": "images/unit6/vertical_circle_forces.png",
        "alt": "Vertical circle showing force diagrams at top, bottom, and sides with tension and gravity vectors",
        "caption": "Force analysis at different positions: tension varies, gravity direction relative to center changes"
      }
    },
    {
      "section_title": "Minimum Speed at the Top",
      "introduction": "One of the most important concepts in vertical circular motion is the minimum speed needed to make it all the way around without falling. This is critical for roller coaster design and understanding when a ball on a string will complete the circle.",
      "key_concept": {
        "definition": "The minimum speed at the top of a vertical circle occurs when tension (or normal force) becomes zero, and gravity alone provides the centripetal force: mg = mv²/r, so v_min = √(gr).",
        "context": "If speed at the top is less than √(gr), the object won't have enough centripetal force to stay in the circle—it will fall inward (for a roller coaster, that means coming off the track; for a string, it means going slack)."
      },
      "principles": [
        {
          "principle": "When Tension Goes to Zero",
          "statement": "At the top, if speed decreases, tension decreases. At the critical minimum speed, tension becomes zero.",
          "application": "This is the slowest possible speed to maintain circular motion. Any slower and the object cannot complete the circle.",
          "example": "Swing a ball on a string vertically too slowly and you'll feel the string go slack at the top—the ball drops instead of continuing in a circle.",
          "analogy": "Think of it like a car on a roller coaster loop: if it's going too slow at the top, it won't stay on the track—it will fall."
        },
        {
          "principle": "The Critical Speed Formula",
          "statement": "At minimum speed, gravity alone provides centripetal force: mg = mv²/r → v_min = √(gr).",
          "application": "This depends only on gravity and radius—not on mass! All objects need the same minimum speed for a given circle size.",
          "example": "For a loop of radius 5 m, minimum speed at top = √(9.8 × 5) = √49 = 7 m/s (about 25 km/h)."
        }
      ],
      "worked_examples": [
        {
          "title": "Finding Minimum Speed",
          "problem": "A roller coaster loop has a radius of 8 meters. What is the minimum speed the cars must have at the top of the loop to stay on the track?",
          "step_by_step": [
            {
              "step": "Recall the formula",
              "explanation": "v_min = √(gr) when tension/normal force = 0"
            },
            {
              "step": "Insert values",
              "explanation": "g = 9.8 m/s², r = 8 m"
            },
            {
              "step": "Calculate",
              "explanation": "v_min = √(9.8 × 8) = √78.4 ≈ 8.85 m/s"
            },
            {
              "step": "Convert to km/h (optional)",
              "explanation": "8.85 × 3.6 ≈ 31.9 km/h"
            }
          ],
          "final_answer": "The minimum speed at the top is approximately 8.9 m/s (about 32 km/h).",
          "concept_applied": "Minimum speed depends only on radius and gravity."
        },
        {
          "title": "Checking if a Loop is Safe",
          "problem": "A roller coaster designer creates a loop with radius 6 m. The cars are expected to have a speed of 7 m/s at the top. Is this safe?",
          "step_by_step": [
            {
              "step": "Calculate minimum safe speed",
              "explanation": "v_min = √(gr) = √(9.8 × 6) = √58.8 ≈ 7.67 m/s"
            },
            {
              "step": "Compare to actual speed",
              "explanation": "Actual speed = 7 m/s, which is LESS than 7.67 m/s"
            },
            {
              "step": "Determine safety",
              "explanation": "Since actual speed is below minimum, the cars would lose contact with the track at the top!"
            }
          ],
          "final_answer": "No, this design is NOT safe. The cars need at least 7.67 m/s at the top, but they only have 7 m/s. They would fall off the track.",
          "concept_applied": "Compare actual speed to minimum required speed."
        }
      ]
    },
    {
      "section_title": "Tension at Different Points",
      "introduction": "Using the relationships we've learned, we can calculate the tension at any point in a vertical circle—as long as we know the speed at that point.",
      "key_concept": {
        "definition": "At any point in vertical circular motion, tension is given by T = mv²/r ± mg × (cos θ), where θ is the angle from the vertical, with the sign depending on position.",
        "context": "For grade 9-10, we focus on the top, bottom, and sides, where the formula simplifies."
      },
      "principles": [
        {
          "principle": "Bottom: T = mv²/r + mg",
          "statement": "At the bottom, tension must provide centripetal force AND support the weight.",
          "application": "This is the maximum tension point. The string is under greatest stress here.",
          "example": "If a 0.5 kg ball on a 2 m string has speed 6 m/s at bottom: T = (0.5×36)/2 + 0.5×9.8 = 9 + 4.9 = 13.9 N."
        },
        {
          "principle": "Top: T = mv²/r - mg",
          "statement": "At the top, gravity helps, so tension is reduced—possibly to zero at minimum speed.",
          "application": "This is the minimum tension point. If calculated T is negative, that means the object would fall.",
          "example": "Same ball at top with speed 4 m/s: T = (0.5×16)/2 - 4.9 = 4 - 4.9 = -0.9 N (impossible—it would fall!)"
        },
        {
          "principle": "Sides: T = mv²/r",
          "statement": "At the sides, gravity is perpendicular, so tension equals the centripetal force.",
          "application": "This is the same as horizontal circular motion at that instant.",
          "example": "Same ball at side with speed 5 m/s: T = (0.5×25)/2 = 12.5/2 = 6.25 N."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Tension at Different Points",
          "problem": "A 0.3 kg ball is swung in a vertical circle of radius 1.5 m. At the bottom, its speed is 8 m/s. At the top, its speed is 4 m/s. Find tension at: a) bottom, b) top, c) side (assuming speed 6 m/s at the side).",
          "step_by_step": [
            {
              "step": "Bottom calculation",
              "explanation": "T_bottom = mv²/r + mg = (0.3 × 64)/1.5 + (0.3 × 9.8)"
            },
            {
              "step": "Compute bottom part 1",
              "explanation": "0.3 × 64 = 19.2, divided by 1.5 = 12.8 N"
            },
            {
              "step": "Compute bottom part 2",
              "explanation": "mg = 0.3 × 9.8 = 2.94 N"
            },
            {
              "step": "Bottom total",
              "explanation": "12.8 + 2.94 = 15.74 N"
            },
            {
              "step": "Top calculation",
              "explanation": "T_top = mv²/r - mg = (0.3 × 16)/1.5 - 2.94"
            },
            {
              "step": "Compute top part 1",
              "explanation": "0.3 × 16 = 4.8, divided by 1.5 = 3.2 N"
            },
            {
              "step": "Top total",
              "explanation": "3.2 - 2.94 = 0.26 N (positive, so it's safe)"
            },
            {
              "step": "Side calculation",
              "explanation": "T_side = mv²/r = (0.3 × 36)/1.5 = 10.8/1.5 = 7.2 N"
            }
          ],
          "final_answer": "Tension at bottom = 15.7 N, at top = 0.26 N, at side = 7.2 N.",
          "concept_applied": "Tension varies dramatically around the circle, maximum at bottom, minimum at top."
        }
      ]
    },
    {
      "section_title": "Real-World Examples",
      "introduction": "Vertical circular motion appears in many exciting real-world situations—especially in amusement parks.",
      "categories": [
        {
          "type": "Roller Coaster Loops",
          "description": "Modern roller coasters use the physics of vertical circles to create thrilling experiences safely.",
          "examples": [
            {
              "process": "Clothoid loops",
              "explanation": "Early roller coasters used perfect circles, which required dangerous speeds. Modern loops are teardrop-shaped (clothoid) with varying radius—larger at top, smaller at bottom—to keep forces comfortable."
            },
            {
              "process": "Feeling of weightlessness",
              "explanation": "At the top of a properly designed loop, riders experience a moment of near-weightlessness when normal force approaches zero—exactly at the minimum speed point."
            },
            {
              "process": "G-forces at bottom",
              "explanation": "At the bottom, riders experience high g-forces (up to 4-5 g's) because the track pushes up with force much greater than weight."
            }
          ]
        },
        {
          "type": "Amusement Park Rides",
          "description": "Many rides create vertical circular motion experiences.",
          "examples": [
            {
              "process": "Ferris wheels",
              "explanation": "A Ferris wheel is vertical circular motion at constant speed (usually). The force you feel on your seat changes: lighter at top, heavier at bottom."
            },
            {
              "process": "Enterprise or similar rides",
              "explanation": "A large wheel spins riders in a vertical circle. At the top, riders might feel held in only by restraints—gravity alone isn't enough to keep them in."
            },
            {
              "process": "Looping ship rides",
              "explanation": "Some rides swing back and forth in a vertical arc before completing full circles—demonstrating the need for minimum speed."
            }
          ]
        },
        {
          "type": "Sports and Recreation",
          "description": "Athletes perform vertical circular motion, often without thinking about the physics.",
          "examples": [
            {
              "process": "Gymnastics on high bar",
              "explanation": "Gymnasts swing around the bar in vertical circles. At the top, they must have enough speed to continue around—too slow and they'd fall."
            },
            {
              "process": "Basketball rim",
              "explanation": "A ball rolling around the rim is in partial vertical circular motion before dropping through."
            },
            {
              "process": "Ski jumping",
              "explanation": "Skiers follow curved paths that are parts of vertical circles, with varying forces throughout."
            }
          ]
        },
        {
          "type": "Classic Demonstrations",
          "description": "Physics classrooms use classic vertical circle demos.",
          "examples": [
            {
              "process": "Bucket of water",
              "explanation": "Swing a bucket of water in a vertical circle fast enough, and the water stays in—even at the top! This works because the bucket pushes inward on the water (normal force) providing centripetal force."
            },
            {
              "process": "Loop-the-loop toy",
              "explanation": "Small toy tracks with marbles demonstrate minimum speed concepts—too slow and the marble falls, too fast and it completes the loop."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/roller_coaster_loop.png",
        "alt": "Diagram of a roller coaster loop showing forces at top and bottom",
        "caption": "Roller coaster loops are designed using vertical circular motion physics"
      }
    },
    {
      "section_title": "The Bucket of Water Demonstration",
      "introduction": "One of the most famous physics demonstrations involves swinging a bucket of water in a vertical circle without getting wet. This perfectly illustrates vertical circular motion concepts.",
      "key_concept": {
        "definition": "When swung fast enough, water stays in the bucket even at the top because the bucket pushes inward on the water, providing centripetal force, and the water's inertia wants to keep it moving in a circle.",
        "context": "If swung too slowly, the water falls out because gravity overcomes the available centripetal force—the bucket isn't pushing hard enough inward."
      },
      "principles": [
        {
          "principle": "Why Water Stays In",
          "statement": "At the top, both gravity and the bucket's push provide centripetal force. As long as speed is sufficient, the bucket pushes inward enough to keep water in circular motion.",
          "application": "The water doesn't fall because it's constantly being redirected toward the center—it never gets a chance to fall straight down.",
          "example": "At minimum speed, the bucket barely touches the water—just enough push to keep it in circle. Any slower and the bucket can't push hard enough."
        },
        {
          "principle": "What Students Expect",
          "statement": "Most people expect water to fall out at the top, but it doesn't—because the water and bucket are both accelerating toward the center together.",
          "application": "The water isn't being held in by some magical force—it's following its circular path just like the bucket.",
          "analogy": "Think of it like you in a turning car: you press against the door, but you're not falling out. The water presses against the bucket similarly."
        }
      ],
      "worked_examples": [
        {
          "title": "Minimum Speed for Bucket of Water",
          "problem": "A student swings a bucket of water in a vertical circle of radius 0.8 m. What is the minimum speed at the top needed to keep water in the bucket?",
          "step_by_step": [
            {
              "step": "Recall condition",
              "explanation": "At minimum speed, normal force from bucket approaches zero—gravity alone provides centripetal force"
            },
            {
              "step": "Use v_min = √(gr)",
              "explanation": "v_min = √(9.8 × 0.8) = √7.84"
            },
            {
              "step": "Calculate",
              "explanation": "√7.84 ≈ 2.8 m/s"
            }
          ],
          "final_answer": "The minimum speed at the top is approximately 2.8 m/s (about 10 km/h). Below this, water will fall out.",
          "concept_applied": "Same minimum speed formula applies to any object in vertical circle."
        }
      ]
    },
    {
      "section_title": "Energy in Vertical Circular Motion",
      "introduction": "While we don't use energy formulas extensively in grade 9-10, understanding the energy story helps explain why speed changes around the circle.",
      "key_concept": {
        "definition": "As an object rises in a vertical circle, kinetic energy converts to gravitational potential energy. As it falls, potential energy converts back to kinetic energy.",
        "context": "This is why the object is fastest at the bottom (minimum height, maximum KE) and slowest at the top (maximum height, minimum KE)."
      },
      "principles": [
        {
          "principle": "Energy Conservation",
          "statement": "Total mechanical energy (KE + PE) remains constant (ignoring friction).",
          "application": "The gain in height at the top comes at the expense of speed—and vice versa.",
          "example": "If a ball has speed 8 m/s at bottom of a 2 m radius circle, its speed at top will be less because it has gained 4 m in height (diameter)."
        },
        {
          "principle": "Height Difference",
          "statement": "The top is 2r higher than the bottom in a vertical circle.",
          "application": "This height difference determines how much speed is lost going up and regained coming down.",
          "example": "For r = 2 m, height difference = 4 m. The potential energy gain = mgh = m × 9.8 × 4 = 39.2m joules, which comes from kinetic energy."
        }
      ],
      "note": "Energy calculations are typically covered in more detail in later units. For now, just understand that height change causes speed change."
    },
    {
      "section_title": "Practice Problems",
      "introduction": "Apply your understanding of vertical circular motion.",
      "worked_examples": [
        {
          "title": "Problem 1: Minimum Speed for Loop",
          "problem": "A roller coaster loop has radius 12 m. What minimum speed is needed at the top to stay on track?",
          "step_by_step": [
            {
              "step": "Formula",
              "explanation": "v_min = √(gr)"
            },
            {
              "step": "Insert values",
              "explanation": "g = 9.8 m/s², r = 12 m"
            },
            {
              "step": "Calculate",
              "explanation": "v_min = √(9.8 × 12) = √117.6 ≈ 10.8 m/s"
            }
          ],
          "final_answer": "Minimum speed at top = 10.8 m/s (about 39 km/h).",
          "concept_applied": "Minimum speed depends on radius."
        },
        {
          "title": "Problem 2: Tension at Bottom",
          "problem": "A 2 kg ball is swung in a vertical circle of radius 3 m. At the bottom, its speed is 10 m/s. Find tension in the string.",
          "step_by_step": [
            {
              "step": "Formula for bottom",
              "explanation": "T = mv²/r + mg"
            },
            {
              "step": "Insert values",
              "explanation": "m = 2 kg, v = 10 m/s, r = 3 m, g = 9.8"
            },
            {
              "step": "Calculate mv²/r",
              "explanation": "2 × 100 = 200, divided by 3 = 66.7 N"
            },
            {
              "step": "Calculate mg",
              "explanation": "2 × 9.8 = 19.6 N"
            },
            {
              "step": "Add",
              "explanation": "66.7 + 19.6 = 86.3 N"
            }
          ],
          "final_answer": "Tension at bottom = 86.3 N.",
          "concept_applied": "At bottom, tension = centripetal force + weight."
        },
        {
          "title": "Problem 3: Is It Safe?",
          "problem": "A loop has radius 5 m. A roller coaster car has speed 6 m/s at the top. Will it stay on track?",
          "step_by_step": [
            {
              "step": "Find minimum safe speed",
              "explanation": "v_min = √(9.8 × 5) = √49 = 7 m/s"
            },
            {
              "step": "Compare",
              "explanation": "Actual speed (6 m/s) is LESS than minimum (7 m/s)"
            }
          ],
          "final_answer": "No, it will NOT stay on track. Speed is too low—the car would fall off the loop at the top.",
          "concept_applied": "Compare actual speed to minimum required."
        },
        {
          "title": "Problem 4: Finding Speed at Top from Bottom Speed",
          "problem": "A ball on a string (r = 2 m) has speed 12 m/s at the bottom. Assuming energy conservation, what is its approximate speed at the top? (Hint: height difference = 4 m, g = 9.8, use v_top² = v_bottom² - 4gr)",
          "step_by_step": [
            {
              "step": "Recall relationship",
              "explanation": "Loss in KE = gain in PE: ½m(v_b² - v_t²) = mg(2r)"
            },
            {
              "step": "Simplify",
              "explanation": "v_b² - v_t² = 4gr"
            },
            {
              "step": "Insert values",
              "explanation": "12² - v_t² = 4 × 9.8 × 2"
            },
            {
              "step": "Calculate right side",
              "explanation": "4 × 9.8 × 2 = 78.4"
            },
            {
              "step": "Solve",
              "explanation": "144 - v_t² = 78.4 → v_t² = 144 - 78.4 = 65.6"
            },
            {
              "step": "Square root",
              "explanation": "v_t = √65.6 ≈ 8.1 m/s"
            }
          ],
          "final_answer": "The speed at the top is approximately 8.1 m/s.",
          "concept_applied": "Energy conservation relates speeds at top and bottom."
        }
      ]
    },
    {
      "section_title": "Common Misconceptions",
      "introduction": "Here are frequent misunderstandings about vertical circular motion.",
      "principles": [
        {
          "principle": "Misconception: Objects fall at the top of a loop",
          "statement": "Many think that at the top of a loop, objects should fall straight down.",
          "application": "Objects in circular motion are constantly being pulled toward the center—they don't fall straight down because their velocity is horizontal at the top.",
          "example": "A ball at the top of a vertical circle has horizontal velocity. Gravity pulls down, but that just changes direction, not causes immediate falling."
        },
        {
          "principle": "Misconception: Tension is constant in vertical circles",
          "statement": "Students often assume tension stays the same throughout.",
          "application": "Tension varies dramatically—maximum at bottom, minimum at top, as we've seen.",
          "example": "A string is most likely to break at the bottom, not the top, because tension is highest there."
        },
        {
          "principle": "Misconception: Heavier objects need higher minimum speed",
          "statement": "Some think heavier objects need to go faster at the top to stay in circle.",
          "application": "Minimum speed v_min = √(gr) doesn't depend on mass! All objects need same speed for given radius.",
          "example": "A heavy roller coaster car and a light one need the same minimum speed at the top of a loop (ignoring friction)."
        },
        {
          "principle": "Misconception: Water falls out if bucket is upside down",
          "statement": "People expect water to fall out when bucket is inverted at top.",
          "application": "It doesn't—because water and bucket are accelerating together toward center. The water isn't "above" the bucket in a way that allows falling.",
          "example": "The demonstration works precisely because vertical circular motion physics keeps water in."
        }
      ]
    },
    {
      "section_title": "Simple Demonstrations",
      "introduction": "You can observe vertical circular motion principles with simple experiments.",
      "process_flow": [
        {
          "step": "1",
          "process": "Ball on a string (vertical)",
          "description": "Swing a ball on a string in a vertical circle. Pay attention to the feeling in your hand.",
          "mechanism": "Feel the tension change—strongest at bottom, weakest at top.",
          "result": "You can actually feel the difference in pull. At top, string may go slightly slack at minimum speed.",
          "applications": [
            "Try to find the minimum speed where string just stays taut at top",
            "Notice ball slows visibly at top"
          ]
        },
        {
          "step": "2",
          "process": "Bucket of water",
          "description": "Fill a small bucket partly with water. Swing it in a vertical circle (OUTSIDE, with clearance!).",
          "mechanism": "If swung fast enough, water stays in. Too slow, and you get wet!",
          "result": "Demonstrates minimum speed concept vividly.",
          "applications": [
            "Start slow and increase speed until water stays in",
            "Notice the speed needed for given arm length (radius)"
          ]
        },
        {
          "step": "3",
          "process": "Marble in a bowl",
          "description": "Roll a marble around the inside of a mixing bowl—it can make vertical circles.",
          "mechanism": "The bowl's curved surface provides normal force.",
          "result": "Marble slows at top, speeds at bottom—same principle.",
          "applications": [
            "Observe that marble falls if too slow at top",
            "Different bowls (radii) require different speeds"
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Vertical circular motion",
    "Non-uniform circular motion",
    "Minimum speed",
    "Critical speed",
    "Top of loop",
    "Bottom of loop",
    "Apparent weight",
    "Weightlessness",
    "G-forces",
    "Tension variation",
    "Energy conversion",
    "Loop-the-loop",
    "Bucket of water demonstration",
    "v_min = √(gr)"
  ],
  "summary": "Vertical circular motion is more complex than horizontal because gravity constantly changes both the speed of the object and the tension (or normal force) required. Objects move fastest at the bottom of the circle and slowest at the top due to energy conversion between kinetic and potential energy. The forces also vary: at the bottom, tension must provide centripetal force PLUS overcome gravity (T = mv²/r + mg); at the top, gravity helps, so tension is reduced (T = mv²/r - mg). The minimum speed to complete a vertical circle occurs at the top when tension reaches zero and gravity alone provides centripetal force: v_min = √(gr). This critical speed depends only on radius and gravity—not on mass. Real-world applications include roller coaster loops, Ferris wheels, gymnastic routines, and the classic bucket-of-water demonstration. Understanding vertical circular motion helps explain why roller coasters are designed with teardrop-shaped loops rather than perfect circles, and why you feel heavy at the bottom and light at the top of a loop. This knowledge prepares us for exploring orbital motion in the next section, where gravity acts as centripetal force on a cosmic scale."
}
