{
  "expanded_description": "Free-body diagrams are essential visual tools for analyzing forces acting on objects. They simplify complex situations by isolating a single object and showing all forces acting on it, making force analysis systematic and preventing errors.",
  "core_concept": {
    "principle": "A free-body diagram (FBD) is a simplified sketch showing a single object (represented as a dot or simple shape) with all forces acting on that object drawn as arrows. Each arrow represents one force: arrow length indicates magnitude, arrow direction shows which way force acts, arrow label identifies the force type. Free-body diagrams isolate one object from its surroundings to focus analysis on forces acting on that object alone.",
    "explanation": "Complex physical situations involve multiple objects, multiple forces, and interactions between objects. Free-body diagrams cut through this complexity by isolating one object at a time and showing only the forces acting on that specific object. The process: (1) Choose which object to analyze (the 'body' in free-body diagram). (2) Draw simple representation of that object (dot, box, or simple outline)—details don't matter, only forces do. (3) Identify every force acting on the object—contact forces (normal, friction, tension, applied) and non-contact forces (gravity). (4) Draw each force as an arrow pointing in the direction the force acts, with length proportional to magnitude. (5) Label each arrow clearly. Critical rules: Include ONLY forces acting ON the chosen object. Do NOT include forces the object exerts on other things (those belong on different objects' FBDs). Do NOT include motion information (velocity, acceleration)—only forces. Free-body diagrams are powerful because they organize force information visually, make force analysis systematic, help identify all forces (nothing missed or double-counted), facilitate calculating net force (add vectors shown), connect to Newton's laws (particularly Second Law: sum of arrows = $ma$), and are essential for solving dynamics problems. Mastering free-body diagrams is crucial for physics success—they're used throughout mechanics and beyond.",
    "image": {
      "src": "images/unit4/fbd_concept.png",
      "alt": "Example showing complex situation and corresponding simplified free-body diagram with force arrows",
      "caption": "Free-body diagram: isolate object, show only forces acting ON it as labeled arrows"
    }
  },
  "sections": [
    {
      "section_title": "What Is a Free-Body Diagram?",
      "introduction": "Understanding the purpose, structure, and conventions of free-body diagrams.",
      "key_concept": {
        "definition": "A free-body diagram shows: (1) One object isolated from its environment, drawn simply (dot, box, or outline). (2) All forces acting ON that object, represented as arrows originating from the object. (3) Labels for each force identifying its type and magnitude (if known). Nothing else—no velocity, acceleration, other objects, or forces the object exerts on other things.",
        "context": "Free-body diagrams are abstraction tools. They strip away unnecessary details to focus exclusively on forces. A car on a road might be drawn as a simple box, with arrows showing weight, normal force, friction, and applied force—car's color, shape, interior details all irrelevant to force analysis."
      },
      "principles": [
        {
          "principle": "Isolate One Object",
          "statement": "Choose a single object to analyze. Draw it simply—dot for point mass, box for extended object. Everything else in the situation is 'environment' and not drawn.",
          "application": "If problem involves multiple objects, draw separate free-body diagram for each object.",
          "example": "Box being pulled by rope: one FBD for box (shows tension from rope, weight, normal, friction), separate FBD for rope (if analyzing rope's forces). Each object gets its own diagram."
        },
        {
          "principle": "Show Only Forces Acting ON Object",
          "statement": "Include every force that acts ON the chosen object. Do NOT include forces the object exerts ON other things (those belong on other objects' FBDs).",
          "application": "Ask: 'What forces act on this object?' not 'What forces does this object exert?'",
          "example": "Book on table: book's FBD shows gravity (Earth pulls book down) and normal force (table pushes book up). Do NOT show force book exerts on table (that's on table's FBD, not book's)."
        },
        {
          "principle": "Draw Forces as Arrows",
          "statement": "Each force is an arrow. Arrow direction = force direction. Arrow length ∝ force magnitude (use consistent scale). Arrow starts at object (or object's center).",
          "application": "Longer arrow = stronger force. Direction is critical—arrow must point the way force acts.",
          "example": "Weight 50 N down: draw arrow pointing downward, length representing 50 N. Normal 50 N up: draw arrow pointing upward, same length (equal magnitude)."
        },
        {
          "principle": "Label Every Force",
          "statement": "Write label on or near each arrow identifying force type: $\\vec{F}_g$ or 'Weight' or 'Gravity,' $\\vec{F}_N$ or 'Normal,' $\\vec{f}$ or 'Friction,' $\\vec{T}$ or 'Tension,' etc. Include magnitude if known.",
          "application": "Labels prevent confusion about which force is which.",
          "example": "Label: '$F_N = 49$ N' or 'Normal 49 N' on upward arrow. '$F_g = 49$ N' or 'Weight 49 N' on downward arrow."
        },
        {
          "principle": "No Motion Indicators",
          "statement": "Do NOT show velocity, acceleration, position, or trajectory on FBD. Forces only. Motion is determined FROM forces (via Newton's laws), not shown WITH forces.",
          "application": "FBD shows forces. Separate analysis uses forces to find motion.",
          "example": "Don't draw velocity arrow on FBD. Don't show 'moving right' or 'accelerating.' Just forces. After completing FBD, use net force to find acceleration direction."
        }
      ],
      "classifications": [
        {
          "type": "Components of a Free-Body Diagram",
          "value": "What to include and what to omit",
          "characteristics": [
            "INCLUDE: Object (simple representation)",
            "INCLUDE: All forces acting ON object (arrows)",
            "INCLUDE: Labels for each force",
            "OMIT: Other objects",
            "OMIT: Forces object exerts",
            "OMIT: Velocity, acceleration",
            "OMIT: Unnecessary details"
          ],
          "behavior": "Focused, minimal representation.",
          "examples": [
            {
              "process": "Object representation",
              "explanation": "Draw as dot (point mass) or simple box/circle. No need for realistic shape or details."
            },
            {
              "process": "Force arrows",
              "explanation": "One arrow per force. Length scaled to magnitude. Direction accurate. Starting from object."
            },
            {
              "process": "Labels",
              "explanation": "Identify each force: type (normal, friction, etc.) and magnitude (if known)."
            },
            {
              "process": "What NOT to draw",
              "explanation": "Don't draw ground, table, rope, other objects (unless as reference for understanding, but not part of formal FBD). Don't show motion. Don't show forces object exerts elsewhere."
            }
          ]
        },
        {
          "type": "Common Mistakes to Avoid",
          "value": "Errors in constructing FBDs",
          "characteristics": [
            "Including forces object exerts (wrong object)",
            "Missing forces",
            "Adding extra forces that don't exist",
            "Drawing velocity/acceleration arrows",
            "Inconsistent arrow lengths"
          ],
          "behavior": "Recognizing and avoiding errors.",
          "examples": [
            {
              "process": "Wrong object error",
              "explanation": "Book on table: showing both 'book pushes table down' AND 'table pushes book up' on book's FBD. WRONG. Book's FBD shows only forces ON book (normal from table up, gravity down). Book's push on table goes on TABLE's FBD."
            },
            {
              "process": "Missing forces",
              "explanation": "Forgetting gravity (always present on objects with mass), or forgetting friction when surfaces in contact and object moving/trying to move."
            },
            {
              "process": "Inventing forces",
              "explanation": "Adding 'force of motion' or 'force keeping it moving.' No such forces exist. Moving objects need no force to maintain motion (First Law)."
            },
            {
              "process": "Showing motion",
              "explanation": "Drawing arrow labeled 'velocity' or 'acceleration' alongside force arrows. These aren't forces—don't belong on FBD."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "FBD for Object at Rest on Surface",
          "problem": "A 5 kg book rests on a horizontal table. Draw the free-body diagram for the book.",
          "step_by_step": [
            {
              "step": "1. Choose object and draw simply",
              "explanation": "Object: book. Draw as simple box or rectangle."
            },
            {
              "step": "2. Identify forces ON book",
              "explanation": "Gravity (weight): Earth pulls book downward, $F_g = mg = 5 \\times 9.8 = 49$ N. Normal force: table pushes book upward (contact force perpendicular to surface)."
            },
            {
              "step": "3. Draw force arrows",
              "explanation": "Weight: arrow pointing downward from center of box, label '$F_g = 49$ N' or 'Weight 49 N.' Normal: arrow pointing upward from center, equal length to weight arrow (balanced forces—book at rest). Label '$F_N = 49$ N' or 'Normal 49 N.'"
            },
            {
              "step": "4. Verify completeness",
              "explanation": "Only forces ON book shown? Yes (gravity, normal). Forces book exerts (on table, on Earth) NOT shown? Correct—those are on other objects' FBDs. No motion arrows? Correct. Complete ✓"
            }
          ],
          "final_answer": "FBD shows simple box with two arrows: one pointing down labeled 'Weight 49 N' (or $F_g = 49$ N), one pointing up labeled 'Normal 49 N' (or $F_N = 49$ N), both starting from box center, equal length.",
          "concept_applied": "Object at rest on horizontal surface: two vertical forces (gravity down, normal up), balanced for stationary object."
        },
        {
          "title": "FBD for Sliding Object",
          "problem": "A 10 kg box is pushed to the right with 60 N across a rough floor (friction present). Draw free-body diagram.",
          "step_by_step": [
            {
              "step": "1. Draw object",
              "explanation": "Box drawn as simple rectangle."
            },
            {
              "step": "2. Identify forces",
              "explanation": "Applied force: 60 N to the right (push). Friction: opposes motion, acts to the left (contact, parallel to surface). Gravity: $F_g = mg = 10 \\times 9.8 = 98$ N downward. Normal: upward from surface."
            },
            {
              "step": "3. Draw arrows",
              "explanation": "Applied: arrow right, length for 60 N, label '$F_{app} = 60$ N.' Friction: arrow left, unknown magnitude, label '$f$' or 'Friction.' Weight: arrow down, length for 98 N, label '$F_g = 98$ N.' Normal: arrow up, equal length to weight (no vertical acceleration implies $F_N = F_g$), label '$F_N = 98$ N.'"
            },
            {
              "step": "4. Check",
              "explanation": "All forces ON box? Yes. No forces box exerts? Correct. No motion shown? Correct ✓"
            }
          ],
          "final_answer": "FBD shows box with four arrows: right (Applied 60 N), left (Friction f), down (Weight 98 N), up (Normal 98 N).",
          "concept_applied": "Sliding object: applied force (direction of push), friction (opposes motion, opposite direction), weight (down), normal (up). Four forces total."
        },
        {
          "title": "FBD for Hanging Object",
          "problem": "A 3 kg mass hangs motionless from a rope. Draw free-body diagram for the mass.",
          "step_by_step": [
            {
              "step": "1. Draw object",
              "explanation": "Mass drawn as dot or small circle (point mass)."
            },
            {
              "step": "2. Identify forces",
              "explanation": "Tension: rope pulls mass upward. Gravity: Earth pulls mass downward, $F_g = mg = 3 \\times 9.8 = 29.4$ N."
            },
            {
              "step": "3. Draw arrows",
              "explanation": "Tension: arrow pointing upward from mass, label '$T$' or 'Tension.' At rest, so $T = F_g = 29.4$ N—draw equal length to weight arrow. Weight: arrow pointing downward, label '$F_g = 29.4$ N' or 'Weight 29.4 N.'"
            },
            {
              "step": "4. Check",
              "explanation": "Only two forces on hanging mass: tension up, weight down. Balanced (at rest). Correct ✓ Do NOT include force mass exerts on rope (that's on rope's FBD)."
            }
          ],
          "final_answer": "FBD shows dot/circle with two arrows of equal length: upward (Tension T = 29.4 N), downward (Weight 29.4 N).",
          "concept_applied": "Hanging object at rest: tension upward (from rope), weight downward (gravity). Balanced forces."
        }
      ],
      "image": {
        "src": "images/unit4/fbd_examples_basic.png",
        "alt": "Three simple free-body diagrams: object on surface, sliding object, hanging mass",
        "caption": "Free-body diagram examples: show object simply, all forces as labeled arrows, nothing else"
      }
    },
    {
      "section_title": "Step-by-Step Process for Drawing Free-Body Diagrams",
      "introduction": "Systematic procedure ensures complete, accurate free-body diagrams every time.",
      "key_concept": {
        "definition": "Standard FBD process: (1) Identify and isolate the object of interest, (2) Draw object representation (dot or simple shape), (3) Identify all forces acting ON object, (4) Draw force arrow for each force with correct direction and relative magnitude, (5) Label each force clearly, (6) Verify completeness (all forces included, no extras, no motion).",
        "context": "Following consistent procedure prevents missing forces, adding non-existent forces, or including wrong forces. Makes force analysis systematic and reliable."
      },
      "process_flow": [
        {
          "step": "1",
          "process": "Identify the Object to Analyze",
          "description": "Choose which object you're analyzing. In multi-object situations, may need multiple FBDs (one per object).",
          "mechanism": "Clarifies what forces to include.",
          "result": "Clear focus on one object.",
          "applications": [
            "Single object problem: analyze that object",
            "Connected objects: choose one, draw its FBD",
            "Multiple independent objects: draw separate FBD for each"
          ]
        },
        {
          "step": "2",
          "process": "Draw Object Simply",
          "description": "Represent object as dot (point mass) or simple box/circle. Place in center of your work area, leaving room for arrows.",
          "mechanism": "Simplified representation focuses on forces, not geometry.",
          "result": "Clean starting point for force arrows.",
          "applications": [
            "Point mass: use dot",
            "Extended object: use box, circle, or simple outline",
            "Shape doesn't matter—forces do"
          ]
        },
        {
          "step": "3",
          "process": "Identify All Forces Acting ON Object",
          "description": "Systematically check for each force type: gravity (always present if mass), normal (if on surface), friction (if surface contact and motion/attempted motion), tension (if rope/string attached), applied forces (if pushed/pulled), air resistance (if moving through air at significant speed), spring force (if spring attached).",
          "mechanism": "Systematic checklist prevents missing forces.",
          "result": "Complete force inventory.",
          "applications": [
            "Check contact forces (touching what? → normal, friction, tension, applied)",
            "Check non-contact forces (gravity always, electric/magnetic if applicable)",
            "For each identified force, note direction and magnitude (if known)"
          ]
        },
        {
          "step": "4",
          "process": "Draw Force Arrows",
          "description": "For each identified force, draw arrow: starting from object (or center), pointing in direction force acts, with length proportional to force magnitude (use consistent scale).",
          "mechanism": "Visual representation of force vectors.",
          "result": "All forces shown graphically.",
          "applications": [
            "Choose scale: e.g., 1 cm = 10 N",
            "Measure/estimate relative magnitudes if values known",
            "Direction accuracy critical—use protractor if needed for angles"
          ]
        },
        {
          "step": "5",
          "process": "Label Each Force",
          "description": "Write label on or near each arrow: force type ($F_g$, $F_N$, $f$, $T$, $F_{app}$, etc.) and magnitude (if known). Be clear and consistent with notation.",
          "mechanism": "Identifies what each arrow represents.",
          "result": "Unambiguous force identification.",
          "applications": [
            "Standard symbols: $F_g$ or $W$ for weight, $F_N$ or $N$ for normal, $f$ for friction, $T$ for tension",
            "Include values: '$F_N = 50$ N' if known",
            "Be consistent throughout problem"
          ]
        },
        {
          "step": "6",
          "process": "Verify and Check",
          "description": "Review diagram: Are all forces acting ON this object included? Are forces object exerts on other things EXCLUDED? Is gravity included (if object has mass)? Are arrow directions correct? Are no motion indicators shown? Is each force labeled?",
          "mechanism": "Quality control catches errors.",
          "result": "Correct, complete FBD.",
          "applications": [
            "Count forces—typical: 2-5 forces for common situations",
            "Check directions—gravity down, normal perpendicular out from surface, etc.",
            "Verify no velocity/acceleration shown"
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Systematic FBD Construction",
          "problem": "A 8 kg sled is pulled by a rope with 40 N force at 30° above horizontal across a snowy surface (friction 15 N). Draw free-body diagram for sled.",
          "step_by_step": [
            {
              "step": "1. Identify object",
              "explanation": "Object: sled (8 kg)"
            },
            {
              "step": "2. Draw object",
              "explanation": "Draw simple box to represent sled, centered on page."
            },
            {
              "step": "3. Identify forces",
              "explanation": "Tension: rope pulls sled at 40 N at 30° above horizontal. Friction: 15 N opposing motion (horizontal, backward). Gravity: $F_g = mg = 8 \\times 9.8 = 78.4$ N downward. Normal: surface pushes up perpendicular to surface (upward)."
            },
            {
              "step": "4. Draw arrows",
              "explanation": "Tension: arrow at 30° above horizontal (forward and up), length for 40 N, labeled '$T = 40$ N.' Friction: horizontal arrow backward, length for 15 N, labeled '$f = 15$ N.' Weight: vertical arrow downward, length for 78.4 N, labeled '$F_g = 78.4$ N.' Normal: vertical arrow upward, unknown exact magnitude (not necessarily = weight because tension has vertical component), labeled '$F_N$.'"
            },
            {
              "step": "5. Labels complete",
              "explanation": "Each arrow labeled with symbol and value (if known)"
            },
            {
              "step": "6. Verify",
              "explanation": "Forces ON sled: tension (from rope), friction (from snow), weight (from Earth), normal (from snow). ✓ No forces sled exerts. ✓ No motion arrows. ✓ All directions correct. ✓ Complete."
            }
          ],
          "final_answer": "FBD shows box with four arrows: 30° above horizontal forward (T = 40 N), horizontal backward (f = 15 N), vertical down (Fg = 78.4 N), vertical up (FN).",
          "concept_applied": "Systematic process: identify object → draw simply → identify forces → draw arrows → label → verify. Angled force (tension) drawn at correct angle."
        }
      ],
      "image": {
        "src": "images/unit4/fbd_process.png",
        "alt": "Step-by-step visual guide showing FBD construction process",
        "caption": "FBD process: choose object → draw simply → identify forces → draw arrows → label → verify"
      }
    },
    {
      "section_title": "Using Free-Body Diagrams to Solve Problems",
      "introduction": "Free-body diagrams are tools for applying Newton's laws to find unknown forces or motion.",
      "key_concept": {
        "definition": "Problem-solving with FBDs: (1) Draw complete free-body diagram, (2) Choose coordinate system and establish sign convention, (3) Resolve angled forces into components, (4) Sum forces in each direction to get net force components, (5) Apply Newton's Second Law ($F_{\\text{net}} = ma$) to relate forces to acceleration, (6) Solve for unknowns.",
        "context": "FBD is starting point, not end point. It organizes force information so you can calculate net force and apply Newton's laws to predict motion or find unknown forces."
      },
      "principles": [
        {
          "principle": "FBD Before Equations",
          "statement": "Always draw free-body diagram BEFORE writing equations. FBD clarifies what forces exist and ensures you don't miss any in calculations.",
          "application": "Resist urge to jump to equations. FBD first, equations second.",
          "example": "Without FBD: might forget friction or normal force. With FBD: all forces visible, none missed."
        },
        {
          "principle": "Choose Coordinate System Based on Motion/Forces",
          "statement": "Align one axis with direction of motion or acceleration (simplifies calculations). For inclines, align one axis along slope, other perpendicular.",
          "application": "Horizontal motion: x = horizontal. Incline motion: x = along slope, y = perpendicular to slope.",
          "example": "Box sliding down ramp: choose x-axis along slope (down positive), y-axis perpendicular to slope (away from surface positive). Makes equations simpler."
        },
        {
          "principle": "Component Resolution for Angled Forces",
          "statement": "Forces not along axes must be resolved into components: $F_x = F \\cos \\theta$, $F_y = F \\sin \\theta$ where $\\theta$ is angle from x-axis.",
          "application": "Any angled force: find x and y components before summing forces.",
          "example": "Tension 50 N at 30° above horizontal: $T_x = 50 \\cos 30° = 43.3$ N (horizontal component), $T_y = 50 \\sin 30° = 25$ N (vertical component)."
        },
        {
          "principle": "Sum Forces by Components",
          "statement": "Add all x-components (with signs) to get $F_{\\text{net},x}$. Add all y-components (with signs) to get $F_{\\text{net},y}$.",
          "application": "$F_{\\text{net},x} = \\sum F_x$, $F_{\\text{net},y} = \\sum F_y$",
          "example": "Forces: $T_x = 43.3$ N right, $f = 15$ N left, weight $F_g = 78.4$ N down, normal $F_N$ up. $F_{\\text{net},x} = 43.3 - 15 = 28.3$ N."
        },
        {
          "principle": "Apply Second Law Per Direction",
          "statement": "Newton's Second Law applies component-wise: $F_{\\text{net},x} = ma_x$, $F_{\\text{net},y} = ma_y$. If no acceleration in direction, $F_{\\text{net}} = 0$ in that direction.",
          "application": "Horizontal motion only: $F_{\\text{net},x} = ma_x$, $F_{\\text{net},y} = 0$ (no vertical acceleration).",
          "example": "Box on horizontal surface accelerating right: $F_{\\text{net},x} = ma$ (horizontal), $F_{\\text{net},y} = 0$ so $F_N = F_g$ (vertical)."
        }
      ],
      "worked_examples": [
        {
          "title": "Finding Acceleration from FBD",
          "problem": "A 6 kg box on frictionless ice is pushed with 42 N to the right. (a) Draw FBD, (b) Find acceleration.",
          "step_by_step": [
            {
              "step": "(a) Draw FBD",
              "explanation": "Object: box. Forces: Applied 42 N right, Weight $F_g = 6 \\times 9.8 = 58.8$ N down, Normal $F_N$ up. Friction: 0 (frictionless). FBD: box with three arrows (right, down, up)."
            },
            {
              "step": "(b) Coordinate system",
              "explanation": "x = horizontal (right positive), y = vertical (up positive)"
            },
            {
              "step": "Sum x-forces",
              "explanation": "$F_{\\text{net},x} = F_{app} = +42$ N (only horizontal force)"
            },
            {
              "step": "Sum y-forces",
              "explanation": "$F_{\\text{net},y} = F_N - F_g$. No vertical acceleration, so $F_{\\text{net},y} = 0$: $F_N - 58.8 = 0$ → $F_N = 58.8$ N"
            },
            {
              "step": "Apply Second Law (horizontal)",
              "explanation": "$F_{\\text{net},x} = ma_x$. $42 = 6 \\times a_x$",
              "calculation": "$a_x = 42/6 = 7$ m/s² to the right"
            }
          ],
          "final_answer": "(a) FBD shows box with Applied 42 N right, Weight 58.8 N down, Normal 58.8 N up. (b) $a = 7$ m/s² to the right",
          "concept_applied": "FBD → identify forces → sum by direction → apply F=ma. Frictionless: only applied force horizontally. Vertical forces balanced (no vertical motion)."
        },
        {
          "title": "Finding Unknown Force from FBD",
          "problem": "A 12 kg crate accelerates at 2 m/s² to the right when pushed. Friction is 18 N to the left. (a) Draw FBD, (b) Find applied force.",
          "step_by_step": [
            {
              "step": "(a) Draw FBD",
              "explanation": "Forces: Applied $F_{app}$ right (unknown), Friction 18 N left, Weight $F_g = 12 \\times 9.8 = 117.6$ N down, Normal $F_N$ up. FBD shows four arrows."
            },
            {
              "step": "(b) Find net force needed",
              "explanation": "Know: $m = 12$ kg, $a = 2$ m/s² right. Use $F_{\\text{net}} = ma = 12 \\times 2 = 24$ N to the right"
            },
            {
              "step": "Sum horizontal forces",
              "explanation": "$F_{\\text{net}} = F_{app} - f$. $24 = F_{app} - 18$"
            },
            {
              "step": "Solve for applied force",
              "explanation": "$F_{app} = 24 + 18$",
              "calculation": "$F_{app} = 42$ N to the right"
            },
            {
              "step": "Interpret",
              "explanation": "Need 42 N push. This overcomes 18 N friction and provides 24 N net force for 2 m/s² acceleration."
            }
          ],
          "final_answer": "(a) FBD with Applied Fapp right, Friction 18 N left, Weight 117.6 N down, Normal up. (b) Applied force = 42 N to the right",
          "concept_applied": "Work backward: desired acceleration → required net force (F=ma) → required applied force (accounting for friction). FBD organizes force relationships."
        },
        {
          "title": "Angled Force Problem with Components",
          "problem": "A 5 kg box is pulled by rope exerting 30 N at 37° above horizontal. Friction is 10 N. (a) Draw FBD, (b) Find horizontal acceleration.",
          "step_by_step": [
            {
              "step": "(a) Draw FBD",
              "explanation": "Forces: Tension 30 N at 37° above horizontal, Friction 10 N horizontal left, Weight $F_g = 5 \\times 9.8 = 49$ N down, Normal $F_N$ up."
            },
            {
              "step": "(b) Resolve tension into components",
              "explanation": "$T_x = 30 \\cos 37° = 30 \\times 0.799 = 24$ N (horizontal, right). $T_y = 30 \\sin 37° = 30 \\times 0.602 = 18$ N (vertical, up)"
            },
            {
              "step": "Sum horizontal forces",
              "explanation": "$F_{\\text{net},x} = T_x - f = 24 - 10 = 14$ N to the right"
            },
            {
              "step": "Apply Second Law (horizontal)",
              "explanation": "$F_{\\text{net},x} = ma_x$. $14 = 5 \\times a_x$",
              "calculation": "$a_x = 14/5 = 2.8$ m/s² to the right"
            },
            {
              "step": "Note on vertical",
              "explanation": "Vertical: $F_{\\text{net},y} = 0$ (no vertical acceleration). $F_N + T_y - F_g = 0$ → $F_N = F_g - T_y = 49 - 18 = 31$ N. Normal less than weight because tension pulls up partially."
            }
          ],
          "final_answer": "(a) FBD with Tension 30 N at 37°, Friction 10 N left, Weight 49 N down, Normal 31 N up. (b) Horizontal acceleration = 2.8 m/s² to the right",
          "concept_applied": "Angled force: resolve into components first, then sum forces by direction. Vertical component of tension reduces normal force."
        }
      ],
      "image": {
        "src": "images/unit4/fbd_problem_solving.png",
        "alt": "Example showing FBD, force components, and equations leading to solution",
        "caption": "Problem solving with FBD: draw diagram → resolve components → sum forces → apply F=ma → solve"
      }
    },
    {
      "section_title": "Special Cases and Common Scenarios",
      "introduction": "Recognizing standard situations helps draw correct free-body diagrams quickly.",
      "categories": [
        {
          "type": "Object on Horizontal Surface",
          "description": "Most common scenario in introductory physics.",
          "examples": [
            {
              "process": "At rest",
              "explanation": "Forces: Weight $F_g = mg$ down, Normal $F_N = mg$ up (balanced). FBD: two vertical arrows, equal length, opposite directions."
            },
            {
              "process": "Constant velocity (no friction or friction balanced)",
              "explanation": "Forces: Weight down, Normal up (balanced). If pushed: Applied force = friction (horizontal forces balanced). FBD: four forces, horizontal and vertical both balanced."
            },
            {
              "process": "Accelerating horizontally",
              "explanation": "Forces: Applied forward, Friction backward (unbalanced horizontally), Weight down, Normal up (balanced vertically). FBD: four arrows, horizontal forces unequal (net force direction of acceleration)."
            }
          ]
        },
        {
          "type": "Hanging or Suspended Object",
          "description": "Object suspended by rope, string, or cable.",
          "examples": [
            {
              "process": "At rest",
              "explanation": "Forces: Tension $T$ upward, Weight $F_g = mg$ downward. Balanced: $T = mg$. FBD: two vertical arrows, equal length, opposite directions."
            },
            {
              "process": "Accelerating upward",
              "explanation": "Forces: Tension up, Weight down. Unbalanced: $T > mg$ to produce upward acceleration. FBD: tension arrow longer than weight arrow."
            },
            {
              "process": "Accelerating downward",
              "explanation": "Forces: Tension up, Weight down. Unbalanced: $T < mg$ to produce downward acceleration. FBD: weight arrow longer than tension arrow."
            }
          ]
        },
        {
          "type": "Object in Free Fall",
          "description": "No contact forces, only gravity (ignoring air resistance).",
          "examples": [
            {
              "process": "Dropped or thrown",
              "explanation": "Forces: Only gravity $F_g = mg$ downward. No normal force (not on surface), no air resistance (idealized). FBD: single arrow pointing down. Net force = weight → $a = g$ downward."
            }
          ]
        },
        {
          "type": "Two Connected Objects",
          "description": "Objects connected by rope or in contact.",
          "examples": [
            {
              "process": "Separate FBDs required",
              "explanation": "Each object gets its own free-body diagram. Tension in connecting rope appears on both FBDs (pulls each object toward the other). Forces between objects are action-reaction pairs (Newton's Third Law)."
            },
            {
              "process": "Example: Atwood machine",
              "explanation": "Two masses hanging from pulley. Each mass has two forces: tension up, weight down. Separate FBD for each mass. Tension same magnitude on both (ideal rope). Heavier mass accelerates down, lighter mass accelerates up."
            }
          ]
        },
        {
          "type": "Object on Inclined Plane",
          "description": "Tilted surface introduces components.",
          "examples": [
            {
              "process": "Coordinate choice",
              "explanation": "Align x-axis along slope (down slope often positive), y-axis perpendicular to slope (away from surface positive). Simplifies equations."
            },
            {
              "process": "Forces",
              "explanation": "Weight $F_g = mg$ points straight down (must resolve into components along and perpendicular to slope). Normal $F_N$ perpendicular to surface (along y-axis). Friction (if present) parallel to surface, opposes motion (along x-axis)."
            },
            {
              "process": "Weight components",
              "explanation": "Along slope: $F_{\\parallel} = mg \\sin \\theta$. Perpendicular: $F_{\\perp} = mg \\cos \\theta$ where $\\theta$ is incline angle."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit4/fbd_common_scenarios.png",
        "alt": "Collection of FBDs for typical situations: on surface, hanging, free fall, incline",
        "caption": "Common scenarios: horizontal surface (4 forces), hanging (2 forces), free fall (1 force), incline (3-4 forces with components)"
      }
    },
    {
      "section_title": "Common Errors and How to Avoid Them",
      "introduction": "Understanding frequent mistakes helps prevent them.",
      "categories": [
        {
          "type": "Error: Including Forces Object Exerts",
          "description": "Most common mistake—confusing forces ON object with forces BY object.",
          "examples": [
            {
              "process": "Wrong example",
              "explanation": "Book on table: showing both 'normal force on book from table' (correct—goes on book's FBD) AND 'force book exerts on table' (incorrect—goes on table's FBD, not book's). Action-reaction pairs appear on DIFFERENT objects' FBDs."
            },
            {
              "process": "How to avoid",
              "explanation": "Ask: 'Does this force act ON my chosen object?' If no, don't include it. Action-reaction pairs: put each force on the object it acts ON."
            }
          ]
        },
        {
          "type": "Error: Forgetting Gravity",
          "description": "Gravity always acts on objects with mass.",
          "examples": [
            {
              "process": "Wrong example",
              "explanation": "Drawing FBD with applied force, friction, normal force, but forgetting weight. Unless in deep space, gravity acts on every object."
            },
            {
              "process": "How to avoid",
              "explanation": "Always include $F_g = mg$ pointing downward on every object with mass (which is essentially all objects in typical problems)."
            }
          ]
        },
        {
          "type": "Error: Adding 'Force of Motion'",
          "description": "Inventing non-existent force to 'keep object moving.'",
          "examples": [
            {
              "process": "Wrong example",
              "explanation": "Object moving at constant velocity, adding arrow labeled 'force of motion' in direction of velocity. No such force exists—motion continues by inertia (First Law), not because of force."
            },
            {
              "process": "How to avoid",
              "explanation": "Remember: forces cause CHANGES in motion, not motion itself. Constant velocity requires zero net force."
            }
          ]
        },
        {
          "type": "Error: Showing Velocity or Acceleration",
          "description": "Including motion indicators on force diagram.",
          "examples": [
            {
              "process": "Wrong example",
              "explanation": "Drawing arrow labeled '$v$' for velocity or '$a$' for acceleration alongside force arrows. FBD shows forces only, not motion."
            },
            {
              "process": "How to avoid",
              "explanation": "FBD shows forces. Motion is calculated FROM forces afterward using Newton's laws. Don't mix forces and motion on same diagram."
            }
          ]
        },
        {
          "type": "Error: Incorrect Normal Force Direction",
          "description": "Normal force always perpendicular to surface, not always upward.",
          "examples": [
            {
              "process": "Wrong example",
              "explanation": "Object on incline: drawing normal force pointing upward (vertical). Correct: normal perpendicular to incline surface (at angle)."
            },
            {
              "process": "How to avoid",
              "explanation": "'Normal' means perpendicular. Always draw normal force perpendicular to contact surface, pointing away from surface."
            }
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Free-body diagram",
    "FBD",
    "Isolated object",
    "Force arrows",
    "Force labels",
    "Component resolution",
    "Net force",
    "Coordinate system",
    "Sign convention",
    "Action-reaction pairs",
    "System isolation"
  ],
  "summary": "Free-body diagrams (FBDs) are essential tools for force analysis, showing one isolated object with all forces acting ON that object as labeled arrows. Purpose: organize force information visually, ensure no forces missed or extra forces added, facilitate calculating net force, enable systematic application of Newton's laws. Components: (1) Object drawn simply (dot or box)—details irrelevant. (2) Force arrows—one per force, direction showing which way force acts, length proportional to magnitude. (3) Labels—identify each force type and magnitude. Critical rules: Include ONLY forces acting ON chosen object. Do NOT include forces object exerts on other things (those belong on different FBDs). Do NOT show velocity, acceleration, or motion—only forces. Always include gravity $F_g = mg$ on objects with mass. Standard procedure: (1) identify and isolate object, (2) draw object simply, (3) systematically identify all forces (contact: normal, friction, tension, applied; non-contact: gravity), (4) draw arrow for each force with correct direction and relative magnitude, (5) label each force clearly, (6) verify completeness. Using FBDs to solve problems: draw FBD first, choose coordinate system (align axis with motion), resolve angled forces into components ($F_x = F \\cos \\theta$, $F_y = F \\sin \\theta$), sum forces by direction to get net force components, apply Newton's Second Law component-wise ($F_{\\text{net},x} = ma_x$, $F_{\\text{net},y} = ma_y$), solve for unknowns. Common scenarios: horizontal surface (weight down, normal up, possibly applied/friction horizontally), hanging object (tension up, weight down), free fall (only weight), incline (weight has components, normal perpendicular to surface, friction along surface). Common errors to avoid: including forces object exerts (action-reaction confusion), forgetting gravity, inventing 'force of motion,' showing velocity/acceleration on FBD, incorrect normal force direction (must be perpendicular to surface). Free-body diagrams are fundamental skill for all mechanics problems—mastering them is essential for physics success."
}
