{
  "expanded_description": "Forces are pushes and pulls that cause objects to accelerate, deform, or change their motion. Understanding forces is essential for explaining why objects move the way they do, transitioning from kinematics (describing motion) to dynamics (explaining motion through forces).",
  "core_concept": {
    "principle": "A force is an interaction between objects that can cause acceleration, change in motion, or deformation. Forces are vector quantities with both magnitude (strength) and direction. Multiple forces can act on an object simultaneously, and their combined effect (net force) determines the object's motion according to Newton's laws.",
    "explanation": "In Unit 3, we described how objects move using position, velocity, and acceleration. Now we ask why—what causes motion to change? The answer is forces. A force is any push or pull exerted on an object. Forces come in many types: gravity pulls objects downward, friction opposes sliding motion, tension pulls through ropes, normal forces push perpendicular to surfaces, applied forces come from deliberate pushes or pulls. Every force has two essential characteristics: magnitude (how strong, measured in newtons) and direction (which way it acts). Because forces are vectors, we must consider direction when combining them—forces in opposite directions subtract, forces in the same direction add. The net force (vector sum of all forces) determines whether and how an object accelerates. Zero net force means no acceleration (Newton's First Law). Non-zero net force causes acceleration proportional to the force (Newton's Second Law). Understanding forces is the foundation of dynamics and essential for explaining everything from why objects fall to how rockets reach space.",
    "image": {
      "src": "images/unit4/force_concept.png",
      "alt": "Diagram showing various forces (push, pull, gravity, friction) acting on objects with arrows",
      "caption": "Forces are pushes and pulls that can change an object's motion. Forces are vectors with magnitude and direction."
    }
  },
  "sections": [
    {
      "section_title": "What Is a Force?",
      "introduction": "Understanding the fundamental nature of forces—what they are, how we represent them, and what effects they produce.",
      "key_concept": {
        "definition": "A force is an interaction between two objects that can cause acceleration (change in velocity), change in shape (deformation), or both. Forces are measured in newtons (N) in the SI system. One newton is the force required to accelerate a 1 kg mass at 1 m/s².",
        "context": "Forces are not properties of single objects—they always involve interactions between at least two objects. When you push a wall, you exert a force on the wall, and the wall exerts a force back on you. Forces cannot be seen directly, but we observe their effects: objects speed up, slow down, change direction, or deform."
      },
      "principles": [
        {
          "principle": "Forces Are Interactions",
          "statement": "A force always involves two objects: the object exerting the force and the object experiencing the force. Forces don't exist in isolation.",
          "application": "Identify both objects involved in any force interaction.",
          "example": "Gravity on a ball: Earth exerts gravitational force on ball (pulls ball downward), and ball exerts gravitational force on Earth (pulls Earth upward—though Earth's acceleration is negligible due to huge mass)."
        },
        {
          "principle": "Forces Have Magnitude and Direction",
          "statement": "Forces are vectors. Magnitude tells how strong the force is; direction tells which way it acts.",
          "application": "Always specify both magnitude and direction when describing forces.",
          "example": "Force of 50 N eastward. Force of 30 N downward. Force of 100 N at 45° above horizontal."
        },
        {
          "principle": "Forces Cause Changes, Not Motion Itself",
          "statement": "Forces don't directly cause motion—they cause changes in motion (acceleration). An object can move without any force acting on it (constant velocity) if no net force is present.",
          "application": "Force → acceleration (change in velocity), not force → velocity.",
          "example": "Puck sliding on ice at constant velocity experiences no net force (neglecting friction). Once you stop pushing, it continues moving at constant velocity until friction or another force slows it."
        },
        {
          "principle": "Units of Force",
          "statement": "SI unit: newton (N). 1 N = 1 kg⋅m/s². Other units: pound (lb) in imperial system, where 1 lb ≈ 4.45 N.",
          "application": "Use newtons for all force calculations in physics.",
          "example": "Weight of 1 kg mass: $F = mg = 1 \\times 9.8 = 9.8$ N. Weight of 10 kg mass: $F = 10 \\times 9.8 = 98$ N."
        }
      ],
      "classifications": [
        {
          "type": "Effects of Forces",
          "value": "What forces can do to objects",
          "characteristics": [
            "Change velocity (accelerate)",
            "Change direction",
            "Change shape (deform)",
            "Start motion from rest",
            "Stop motion",
            "Keep object moving in curve"
          ],
          "behavior": "Forces produce observable changes.",
          "examples": [
            {
              "process": "Acceleration",
              "explanation": "Push a shopping cart—it speeds up. Force causes acceleration in direction of force."
            },
            {
              "process": "Deceleration",
              "explanation": "Apply brakes—car slows down. Friction force opposes motion, causing negative acceleration."
            },
            {
              "process": "Direction change",
              "explanation": "Turn steering wheel—car changes direction even at constant speed. Force perpendicular to motion changes direction without changing speed magnitude."
            },
            {
              "process": "Deformation",
              "explanation": "Compress a spring—it changes shape. Squeeze a sponge—it deforms. Forces can change object shape without necessarily causing acceleration."
            },
            {
              "process": "Maintaining circular motion",
              "explanation": "Swing ball on string in circle—tension force constantly pulls inward, changing velocity direction to keep circular path."
            }
          ]
        },
        {
          "type": "Contact vs Non-Contact Forces",
          "value": "How forces are transmitted",
          "characteristics": [
            "Contact: objects touching",
            "Non-contact: action at distance"
          ],
          "behavior": "Different interaction mechanisms.",
          "examples": [
            {
              "process": "Contact forces",
              "explanation": "Require physical touch. Examples: friction (surfaces rubbing), normal force (surfaces pressing), tension (rope pulling), applied force (hand pushing), air resistance (air molecules colliding), spring force (compressed/stretched spring)."
            },
            {
              "process": "Non-contact (field) forces",
              "explanation": "Act at distance through fields. Examples: gravity (masses attract), electric force (charges attract/repel), magnetic force (magnets/currents attract/repel). No physical contact needed."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Forces and Their Effects",
          "problem": "A person pushes a box across a floor. The box speeds up initially, then moves at constant velocity when pushed steadily. Identify: (a) forces acting on the box, (b) what causes the box to speed up, (c) what allows constant velocity motion.",
          "step_by_step": [
            {
              "step": "(a) Forces on box",
              "explanation": "Applied force: person pushing (forward, contact). Friction: floor opposing motion (backward, contact). Weight: gravity pulling down (downward, non-contact). Normal force: floor pushing up (upward, contact)."
            },
            {
              "step": "(b) Speeding up phase",
              "explanation": "Box accelerates when applied force > friction force. Net force forward causes acceleration forward. Unbalanced forces → acceleration."
            },
            {
              "step": "(c) Constant velocity phase",
              "explanation": "At constant velocity: applied force = friction force. Forces balanced, net force = 0. Zero net force → zero acceleration → constant velocity (Newton's First Law preview)."
            }
          ],
          "final_answer": "(a) Applied (push), friction, weight, normal force. (b) Net forward force (push > friction) causes acceleration. (c) Balanced forces (push = friction) allow constant velocity.",
          "concept_applied": "Multiple forces act simultaneously. Net force (imbalance) causes acceleration. Balanced forces allow constant velocity."
        }
      ],
      "image": {
        "src": "images/unit4/what_is_force.png",
        "alt": "Diagram showing force as arrow with magnitude and direction, plus examples of force effects",
        "caption": "Force: interaction between objects, represented as vector (arrow), causes acceleration or deformation"
      }
    },
    {
      "section_title": "Representing Forces as Vectors",
      "introduction": "Since forces are vectors, we use arrows to represent them visually and mathematical notation to work with them quantitatively.",
      "key_concept": {
        "definition": "Forces are represented as arrows (vectors) where: arrow length represents magnitude (strength), arrow direction shows which way force acts, arrow placement shows where force is applied. In equations, forces are written with vector notation: $\\vec{F}$ or boldface $\\mathbf{F}$.",
        "context": "Vector representation makes force analysis visual and intuitive. Longer arrows mean stronger forces. Arrow direction immediately shows which way the force acts. Multiple force arrows on one diagram show all forces acting simultaneously."
      },
      "principles": [
        {
          "principle": "Arrow Length ∝ Force Magnitude",
          "statement": "In force diagrams, longer arrows represent stronger forces. Choose a scale and maintain consistency.",
          "application": "Use consistent scale when drawing multiple forces: if 1 cm = 10 N, then 50 N force draws as 5 cm arrow.",
          "example": "Gravity of 98 N on 10 kg mass: draw 9.8 cm arrow (if scale is 1 cm = 10 N). Applied force of 30 N: draw 3 cm arrow."
        },
        {
          "principle": "Arrow Direction Shows Force Direction",
          "statement": "Arrow points in the direction the force acts. Upward arrow for upward force, rightward for rightward force, etc.",
          "application": "Draw arrows pointing the way the force actually acts on the object.",
          "example": "Weight (gravity) always points downward toward Earth's center. Normal force from floor points perpendicular away from surface (upward if on horizontal floor). Friction opposes motion direction."
        },
        {
          "principle": "Point of Application",
          "statement": "For extended objects, where force is applied can matter (causes rotation/torque). For point mass approximation in Grade 9/10, forces typically drawn from object's center.",
          "application": "In simple problems, draw all force arrows from center of object. In advanced problems, actual contact points matter.",
          "example": "All forces on a box (weight, normal, friction, applied) shown as arrows originating from box's center in free-body diagrams."
        }
      ],
      "worked_examples": [
        {
          "title": "Drawing Force Vectors",
          "problem": "A 5 kg block on a table has: weight 49 N downward, normal force 49 N upward, applied force 20 N to the right, friction 8 N to the left. Draw these forces using scale 1 cm = 10 N.",
          "step_by_step": [
            {
              "step": "Draw object",
              "explanation": "Sketch simple box to represent block."
            },
            {
              "step": "Weight force",
              "explanation": "49 N downward. Length: 49/10 = 4.9 cm. Draw arrow pointing downward from center of box, length 4.9 cm. Label: $\\vec{F}_g = 49$ N or 'Weight 49 N'."
            },
            {
              "step": "Normal force",
              "explanation": "49 N upward. Length: 4.9 cm. Draw arrow pointing upward from center, length 4.9 cm. Label: $\\vec{F}_N = 49$ N or 'Normal 49 N'."
            },
            {
              "step": "Applied force",
              "explanation": "20 N right. Length: 20/10 = 2 cm. Draw arrow pointing right from center, length 2 cm. Label: $\\vec{F}_{app} = 20$ N or 'Applied 20 N'."
            },
            {
              "step": "Friction",
              "explanation": "8 N left (opposes applied force). Length: 0.8 cm. Draw arrow pointing left from center, length 0.8 cm. Label: $\\vec{f} = 8$ N or 'Friction 8 N'."
            }
          ],
          "final_answer": "Four arrows from center: 4.9 cm down (weight), 4.9 cm up (normal), 2 cm right (applied), 0.8 cm left (friction). Arrows scaled and labeled.",
          "concept_applied": "Force vectors: arrow length ∝ magnitude (using scale), direction shows which way force acts, all drawn from object center."
        }
      ],
      "image": {
        "src": "images/unit4/force_vectors.png",
        "alt": "Diagram showing force vectors as arrows with different lengths and directions on an object",
        "caption": "Force vectors: arrow length shows strength (magnitude), arrow direction shows which way force acts"
      }
    },
    {
      "section_title": "Common Types of Forces",
      "introduction": "Many different forces exist, but a few fundamental types account for most everyday situations. Recognizing these helps identify forces in problems.",
      "key_concept": {
        "definition": "Common forces in mechanics include: gravity (weight), normal force, friction, tension, applied force, air resistance, and spring force. Each has characteristic direction and behavior patterns.",
        "context": "Most mechanics problems involve combinations of these basic forces. Learning to recognize them by their characteristics allows systematic force analysis."
      },
      "classifications": [
        {
          "type": "Gravity (Weight)",
          "value": "Force of gravitational attraction",
          "characteristics": [
            "Always points downward (toward Earth's center)",
            "Acts on all objects with mass",
            "Magnitude: $F_g = mg$ where $m$ is mass, $g = 9.8$ m/s²",
            "Non-contact force"
          ],
          "behavior": "Constant for given mass at Earth's surface.",
          "examples": [
            {
              "process": "Symbol",
              "explanation": "$\\vec{F}_g$, $\\vec{W}$ (for weight), or $m\\vec{g}$"
            },
            {
              "process": "Direction",
              "explanation": "Always downward (vertically toward Earth)"
            },
            {
              "process": "Magnitude",
              "explanation": "10 kg mass: $W = mg = 10 \\times 9.8 = 98$ N. 2 kg mass: $W = 2 \\times 9.8 = 19.6$ N."
            },
            {
              "process": "Key feature",
              "explanation": "Acts on object at all times, whether moving or at rest, whether touching ground or in air"
            }
          ]
        },
        {
          "type": "Normal Force",
          "value": "Perpendicular support force from surface",
          "characteristics": [
            "Perpendicular to contact surface",
            "Acts when object presses against surface",
            "Magnitude adjusts to prevent object from passing through surface",
            "Contact force"
          ],
          "behavior": "Reaction to objects pressing on surfaces.",
          "examples": [
            {
              "process": "Symbol",
              "explanation": "$\\vec{F}_N$ or $\\vec{N}$"
            },
            {
              "process": "Direction",
              "explanation": "Perpendicular to surface, pointing away from surface. Horizontal floor: upward. Vertical wall: horizontal away from wall. Inclined plane: perpendicular to slope."
            },
            {
              "process": "Magnitude",
              "explanation": "On horizontal surface with no vertical acceleration: $F_N = mg$ (balances weight). On incline or with vertical acceleration: $F_N \\neq mg$ (depends on situation)."
            },
            {
              "process": "Key feature",
              "explanation": "'Normal' means perpendicular. Prevents object from sinking into surface. Adjusts automatically based on forces present."
            }
          ]
        },
        {
          "type": "Friction",
          "value": "Force opposing relative motion between surfaces",
          "characteristics": [
            "Parallel to contact surface",
            "Opposes motion or attempted motion",
            "Two types: static (prevents sliding), kinetic (opposes sliding)",
            "Contact force"
          ],
          "behavior": "Resists relative motion between touching surfaces.",
          "examples": [
            {
              "process": "Symbol",
              "explanation": "$\\vec{f}$ or $\\vec{F}_f$. Static: $\\vec{f}_s$. Kinetic: $\\vec{f}_k$"
            },
            {
              "process": "Direction",
              "explanation": "Opposite to motion direction (kinetic friction) or opposite to direction of attempted motion (static friction)"
            },
            {
              "process": "Magnitude",
              "explanation": "Kinetic friction: $f_k = \\mu_k F_N$ where $\\mu_k$ is kinetic friction coefficient. Static friction: $f_s \\leq \\mu_s F_N$ (can vary from zero up to maximum)."
            },
            {
              "process": "Key feature",
              "explanation": "Always opposes motion. Depends on surface properties (rough vs smooth) and normal force (heavier objects → more friction)"
            }
          ]
        },
        {
          "type": "Tension",
          "value": "Pulling force transmitted through rope, string, cable, or chain",
          "characteristics": [
            "Always pulls, never pushes",
            "Directed along rope/string/cable",
            "Same magnitude throughout ideal (massless, unstretchable) rope",
            "Contact force"
          ],
          "behavior": "Transmits pulling force through flexible connector.",
          "examples": [
            {
              "process": "Symbol",
              "explanation": "$\\vec{F}_T$ or $\\vec{T}$"
            },
            {
              "process": "Direction",
              "explanation": "Along rope, pulling on object (away from object toward attachment point)"
            },
            {
              "process": "Magnitude",
              "explanation": "Depends on situation—must be calculated using Newton's laws. For hanging mass at rest: $T = mg$"
            },
            {
              "process": "Key feature",
              "explanation": "Ropes pull but can't push. In ideal rope (massless), tension same everywhere. Pulling one end transmits force to other end."
            }
          ]
        },
        {
          "type": "Applied Force",
          "value": "Force deliberately exerted by person or machine",
          "characteristics": [
            "Direction and magnitude specified in problem",
            "Can be push or pull",
            "Often what causes motion or acceleration",
            "Contact force (usually)"
          ],
          "behavior": "External force intentionally applied.",
          "examples": [
            {
              "process": "Symbol",
              "explanation": "$\\vec{F}_{app}$ or $\\vec{F}_A$ or simply $\\vec{F}$"
            },
            {
              "process": "Direction",
              "explanation": "As stated in problem: 'push right,' 'pull upward at angle,' etc."
            },
            {
              "process": "Magnitude",
              "explanation": "Given in problem or to be calculated"
            },
            {
              "process": "Examples",
              "explanation": "Person pushing box, hand pulling wagon, engine force on car, rocket thrust"
            }
          ]
        },
        {
          "type": "Air Resistance (Drag)",
          "value": "Friction-like force from air opposing motion",
          "characteristics": [
            "Opposes velocity direction",
            "Increases with speed (faster → more drag)",
            "Depends on shape, size, surface properties",
            "Contact force (collisions with air molecules)"
          ],
          "behavior": "Opposes motion through air.",
          "examples": [
            {
              "process": "Symbol",
              "explanation": "$\\vec{F}_D$ or $\\vec{D}$ or $\\vec{F}_{air}$"
            },
            {
              "process": "Direction",
              "explanation": "Opposite to velocity. Moving right → drag left. Moving up → drag down."
            },
            {
              "process": "Magnitude",
              "explanation": "For simple models: $F_D \\propto v$ (proportional to speed) or $F_D \\propto v^2$ (proportional to speed squared). Increases as object goes faster."
            },
            {
              "process": "Key feature",
              "explanation": "Often negligible at low speeds (walking). Significant at high speeds (skydiving, cycling fast). Causes terminal velocity in free fall."
            }
          ]
        },
        {
          "type": "Spring Force",
          "value": "Restoring force from compressed or stretched spring",
          "characteristics": [
            "Opposes displacement from equilibrium",
            "Compressed spring pushes, stretched spring pulls",
            "Magnitude proportional to displacement: $F = kx$ (Hooke's Law)",
            "Contact force"
          ],
          "behavior": "Spring resists deformation.",
          "examples": [
            {
              "process": "Symbol",
              "explanation": "$\\vec{F}_s$ or $\\vec{F}_{spring}$"
            },
            {
              "process": "Direction",
              "explanation": "Toward equilibrium position. Compressed → pushes outward. Stretched → pulls inward."
            },
            {
              "process": "Magnitude",
              "explanation": "Hooke's Law: $F = kx$ where $k$ is spring constant (stiffness), $x$ is displacement from equilibrium"
            },
            {
              "process": "Examples",
              "explanation": "Bungee cord, car suspension, trampoline, spring scale"
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Forces in Situation",
          "problem": "A book rests on a table. A hand pushes the book to the right, and the book slides at increasing speed. Identify all forces acting on the book and their directions.",
          "step_by_step": [
            {
              "step": "Gravity (weight)",
              "explanation": "Earth pulls book downward. $\\vec{F}_g$ downward. Always present on any object with mass."
            },
            {
              "step": "Normal force",
              "explanation": "Table pushes book upward (perpendicular to horizontal surface). $\\vec{F}_N$ upward. Prevents book from falling through table."
            },
            {
              "step": "Applied force",
              "explanation": "Hand pushes book to the right. $\\vec{F}_{app}$ to the right. Stated in problem."
            },
            {
              "step": "Friction",
              "explanation": "Kinetic friction from table opposes sliding motion. $\\vec{f}_k$ to the left (opposite to motion). Contact between book and table."
            },
            {
              "step": "Air resistance",
              "explanation": "Technically present but negligible at low speeds of book sliding. Usually ignored in such problems unless mentioned."
            },
            {
              "step": "Motion interpretation",
              "explanation": "Book 'increasing speed' means accelerating to right. This requires applied force > friction (net force to right)."
            }
          ],
          "final_answer": "Forces on book: Weight (down), Normal force (up), Applied force (right), Kinetic friction (left). Book accelerates because applied > friction.",
          "concept_applied": "Systematic identification: check gravity (always), normal (if on surface), friction (if sliding), applied (if pushed/pulled), others as relevant."
        },
        {
          "title": "Calculating Force Magnitudes",
          "problem": "A 3 kg object hangs from a rope at rest. Find: (a) weight of object, (b) tension in rope.",
          "step_by_step": [
            {
              "step": "(a) Calculate weight",
              "explanation": "Weight = $mg$ where $m = 3$ kg, $g = 9.8$ m/s²",
              "calculation": "$F_g = 3 \\times 9.8 = 29.4$ N downward"
            },
            {
              "step": "(b) Determine tension",
              "explanation": "Object at rest → no acceleration → net force = 0. Two forces: weight (down) and tension (up). For net force = 0: $T - F_g = 0$ → $T = F_g$"
            },
            {
              "step": "Tension value",
              "explanation": "$T = 29.4$ N upward",
              "calculation": "Tension balances weight for stationary hanging object"
            }
          ],
          "final_answer": "(a) Weight = 29.4 N downward, (b) Tension = 29.4 N upward",
          "concept_applied": "Weight calculation: $F_g = mg$. At rest: forces balanced, tension = weight for hanging object."
        }
      ],
      "image": {
        "src": "images/unit4/common_forces.png",
        "alt": "Diagrams showing different force types with characteristic arrows and situations",
        "caption": "Common forces: gravity (down), normal (perpendicular to surface), friction (opposes motion), tension (along rope), applied (as specified)"
      }
    },
    {
      "section_title": "Force Measurement and Units",
      "introduction": "Understanding how forces are measured and the units used to quantify them.",
      "key_concept": {
        "definition": "Force is measured in newtons (N) in SI units. 1 newton is defined as the force required to accelerate a 1 kilogram mass at 1 meter per second squared: 1 N = 1 kg⋅m/s². Forces can be measured using spring scales, force sensors, or calculated using Newton's Second Law ($F = ma$).",
        "context": "The newton is a derived unit, defined in terms of fundamental units (kg, m, s). Understanding this connection helps relate forces to motion and mass."
      },
      "principles": [
        {
          "principle": "Definition of Newton",
          "statement": "1 N = 1 kg⋅m/s². This means a 1 N force causes a 1 kg mass to accelerate at 1 m/s².",
          "application": "Verify units in force calculations. N = kg × (m/s²)",
          "example": "Force to accelerate 5 kg at 2 m/s²: $F = ma = 5 \\times 2 = 10$ kg⋅m/s² = 10 N"
        },
        {
          "principle": "Typical Force Magnitudes",
          "statement": "Developing intuition for force sizes helps check reasonableness of calculations.",
          "application": "Compare calculated forces to familiar references.",
          "example": "Weight of small apple ≈ 1 N. Weight of 1 kg mass ≈ 10 N. Strong person can push ≈ 500 N. Car engine force ≈ 5000 N. Rocket thrust ≈ millions of N."
        },
        {
          "principle": "Measuring Forces",
          "statement": "Spring scales measure force by how much spring stretches/compresses (Hooke's Law: $F = kx$). Force sensors use electronic measurement. Calculations use $F = ma$ when mass and acceleration known.",
          "application": "Different methods for different situations.",
          "example": "Bathroom scale measures normal force (person's weight). Fishing scale measures tension. Physics lab force sensor measures any applied force electronically."
        }
      ],
      "worked_examples": [
        {
          "title": "Understanding Force Units",
          "problem": "A force of 50 N acts on an object. Express this force in terms of fundamental units (kg, m, s).",
          "step_by_step": [
            {
              "step": "Use definition of newton",
              "explanation": "1 N = 1 kg⋅m/s²"
            },
            {
              "step": "Convert",
              "explanation": "50 N = 50 kg⋅m/s²"
            },
            {
              "step": "Interpret",
              "explanation": "This 50 N force could accelerate a 1 kg mass at 50 m/s², or a 50 kg mass at 1 m/s², or a 25 kg mass at 2 m/s², etc."
            }
          ],
          "final_answer": "50 N = 50 kg⋅m/s²",
          "concept_applied": "Newton is derived unit defined as kg⋅m/s². Converting to fundamental units clarifies force-mass-acceleration relationship."
        }
      ]
    }
  ],
  "key_terms": [
    "Force",
    "Newton (N)",
    "Vector",
    "Magnitude",
    "Direction",
    "Interaction",
    "Contact force",
    "Non-contact force",
    "Gravity",
    "Weight",
    "Normal force",
    "Friction",
    "Tension",
    "Applied force",
    "Air resistance",
    "Spring force",
    "Acceleration",
    "Deformation"
  ],
  "summary": "Forces are pushes and pulls—interactions between objects that cause acceleration or deformation. Every force is a vector with both magnitude (strength in newtons) and direction (which way it acts). Forces are represented as arrows: arrow length shows magnitude, arrow direction shows which way force acts. Common force types include: gravity (weight $F_g = mg$, always downward), normal force (perpendicular to surface, prevents penetration), friction (opposes motion, parallel to surface), tension (pulling force through rope/cable, along rope direction), applied force (deliberate push/pull), air resistance (opposes motion through air), and spring force (restoring force, $F = kx$). Forces can be contact forces (require touching: friction, normal, tension, applied) or non-contact forces (act at distance: gravity, electric, magnetic). The SI unit of force is the newton (N), defined as 1 N = 1 kg⋅m/s²—the force needed to accelerate 1 kg at 1 m/s². Forces don't directly cause motion; they cause changes in motion (acceleration). An object can move at constant velocity with zero net force, but any change in velocity requires a net force. Understanding forces transitions physics from kinematics (describing motion) to dynamics (explaining motion). Multiple forces can act on an object simultaneously; their combined effect (net force) determines the object's acceleration according to Newton's laws, which form the foundation for analyzing force interactions and predicting motion."
}
