{
  "expanded_description": "Review questions consolidate understanding of forces and Newton's laws by testing both conceptual comprehension and problem-solving skills across all topics in Chapter 4, from identifying forces to applying Newton's three laws with friction and real-world scenarios.",
  "core_concept": {
    "principle": "Chapter 4 review integrates force identification, free-body diagrams, Newton's three laws, mass vs weight distinctions, and friction analysis. Success requires understanding force concepts (types, vectors, interactions), applying systematic problem-solving (FBDs, net force, F=ma), and recognizing how forces cause or prevent motion.",
    "explanation": "This review synthesizes all force topics: identifying common forces (gravity, normal, friction, tension, applied, air resistance), representing forces visually (free-body diagrams with proper arrows and labels), calculating net force (vector sum with attention to direction), applying Newton's First Law (zero net force → constant velocity including rest), applying Newton's Second Law ($F_{\\text{net}} = ma$ relating force to acceleration), applying Newton's Third Law (action-reaction pairs on different objects, equal magnitude, opposite direction), distinguishing mass (intrinsic, constant, kg) from weight (gravitational force, varies with $g$, N), analyzing friction (static vs kinetic, coefficients, dependence on normal force), and understanding air resistance (opposes velocity, increases with speed, terminal velocity). Success requires both conceptual understanding (why forces behave as they do, what laws predict) and procedural skill (drawing FBDs, calculating forces, solving for unknowns). Questions range from conceptual (explain, compare, predict) to computational (calculate, solve, find) to integrated (multi-step problems requiring multiple concepts).",
    "image": {
      "src": "images/unit4/review_concept.png",
      "alt": "Concept map showing connections between all force topics in Chapter 4",
      "caption": "Chapter 4 Review: Integrating forces, Newton's laws, mass/weight, friction, and applications"
    }
  },
  "sections": [
    {
      "section_title": "Conceptual Understanding Questions",
      "introduction": "These questions test fundamental understanding of force concepts, Newton's laws, and physical reasoning.",
      "worked_examples": [
        {
          "title": "Question 1: Force Identification",
          "problem": "A book slides across a table and gradually slows to a stop. (a) What forces act on the book while sliding? (b) Why does it slow down? (c) Draw a free-body diagram for the sliding book.",
          "step_by_step": [
            {
              "step": "(a) Forces on sliding book",
              "explanation": "Gravity (weight): $F_g = mg$ downward (from Earth). Normal force: $F_N$ upward (from table, perpendicular to surface). Kinetic friction: $f_k$ horizontal, opposing motion direction (from table, parallel to surface, backward if book moving forward). Applied force: none (sliding freely after initial push stopped)."
            },
            {
              "step": "(b) Why slows down",
              "explanation": "Kinetic friction opposes motion, provides backward force (if moving forward). No forward force to balance friction. Net force backward → acceleration backward (deceleration) → velocity decreases → eventually stops. Friction converts kinetic energy to heat, dissipating motion energy."
            },
            {
              "step": "(c) Free-body diagram",
              "explanation": "Draw simple rectangle (book). Four arrows from center: (1) Downward arrow labeled '$F_g$' or 'Weight' or '$mg$', (2) Upward arrow equal length labeled '$F_N$' or 'Normal' (vertical forces balanced—no vertical acceleration), (3) Horizontal arrow backward (opposite motion) labeled '$f_k$' or 'Friction', (4) No forward applied force (stopped pushing). Friction arrow only horizontal force → net force backward → deceleration."
            }
          ],
          "final_answer": "(a) Weight (down), Normal (up), Kinetic friction (backward). (b) Friction provides net backward force, causing deceleration until stopped. (c) FBD: rectangle with arrows for weight down, normal up (equal), friction backward (no forward force).",
          "concept_applied": "Sliding object: kinetic friction opposes motion, causes deceleration if no applied force. FBD shows all forces, reveals net force direction."
        },
        {
          "title": "Question 2: Newton's Laws Integration",
          "problem": "Explain how each of Newton's three laws applies to a person standing still on the ground.",
          "step_by_step": [
            {
              "step": "First Law application",
              "explanation": "Person at rest (zero velocity, constant). Net force on person must be zero (First Law: constant velocity requires zero net force). Forces on person: weight downward, normal upward. These balance ($F_N = W$) → net force = 0 → remains at rest ✓"
            },
            {
              "step": "Second Law application",
              "explanation": "Net force = 0. Second Law: $F_{\\text{net}} = ma$ gives $0 = ma$ → $a = 0$ (no acceleration, consistent with standing still). If forces didn't balance (e.g., $F_N < W$), would have net downward force → downward acceleration → would sink or fall."
            },
            {
              "step": "Third Law application",
              "explanation": "Action-reaction pairs: (1) Earth pulls person down (weight) ↔ person pulls Earth up (equal force). (2) Person pushes ground down (via feet) ↔ ground pushes person up (normal force, equal magnitude). Each interaction has paired forces on different objects. Person feels normal force from ground (pushes them up); ground feels person's push (presses it down). Equal and opposite on different objects."
            }
          ],
          "final_answer": "First Law: At rest requires net force = 0 (weight and normal balance). Second Law: Zero net force gives zero acceleration (F=ma). Third Law: Person-Earth gravity pair and person-ground normal pair (equal/opposite forces on different objects).",
          "concept_applied": "All three laws apply simultaneously. First: equilibrium. Second: quantifies zero acceleration. Third: identifies force pairs."
        },
        {
          "title": "Question 3: Mass vs Weight",
          "problem": "An astronaut has mass 70 kg. Compare the astronaut's mass and weight (a) on Earth ($g = 9.8$ m/s²), (b) on the Moon ($g = 1.6$ m/s²), (c) in deep space ($g \\approx 0$).",
          "step_by_step": [
            {
              "step": "(a) Earth",
              "explanation": "Mass: 70 kg (intrinsic, constant). Weight: $W = mg = 70 \\times 9.8 = 686$ N (gravitational force)."
            },
            {
              "step": "(b) Moon",
              "explanation": "Mass: 70 kg (unchanged—same matter). Weight: $W = mg = 70 \\times 1.6 = 112$ N (much less, weaker gravity)."
            },
            {
              "step": "(c) Deep space",
              "explanation": "Mass: 70 kg (still unchanged). Weight: $W = mg \\approx 70 \\times 0 = 0$ N (weightless, no significant gravitational field)."
            },
            {
              "step": "Summary",
              "explanation": "Mass constant everywhere (70 kg always). Weight varies with gravitational field strength: strong on Earth (686 N), weak on Moon (112 N), nearly zero in space (0 N). Mass ≠ weight!"
            }
          ],
          "final_answer": "(a) Earth: mass 70 kg, weight 686 N. (b) Moon: mass 70 kg, weight 112 N. (c) Space: mass 70 kg, weight ~0 N. Mass constant; weight varies with $g$.",
          "concept_applied": "Mass is intrinsic (kg, constant). Weight is force (N, varies with location's $g$). Same mass has different weights in different gravitational fields."
        },
        {
          "title": "Question 4: Action-Reaction Pairs",
          "problem": "A horse pulls a cart forward. The cart pulls the horse backward with equal force (Third Law). If forces are equal and opposite, why does the cart move forward?",
          "step_by_step": [
            {
              "step": "Identify action-reaction pair",
              "explanation": "Horse pulls cart forward (force on cart). Cart pulls horse backward (force on horse). Equal magnitude, opposite directions, different objects. This IS action-reaction pair ✓"
            },
            {
              "step": "Why forces don't cancel",
              "explanation": "These forces act on DIFFERENT objects (one on cart, one on horse). Forces only cancel if acting on SAME object. Cart's motion determined by forces ON cart, not forces cart exerts."
            },
            {
              "step": "Analyze cart's motion",
              "explanation": "Forces ON cart: Horse pulls cart forward (via harness/rope). Friction opposes motion (backward, on wheels/ground). If horse's pull > friction, net force forward on cart → cart accelerates forward. Cart's pull on horse is irrelevant to cart's motion (acts on horse, not cart)."
            },
            {
              "step": "Analyze horse's motion",
              "explanation": "Forces ON horse: Cart pulls horse backward. Ground friction on horse's hooves provides forward force (horse pushes ground backward, ground pushes horse forward via static friction). If ground friction on horse > cart's pull on horse, net force forward on horse → horse accelerates forward."
            },
            {
              "step": "Key insight",
              "explanation": "Equal and opposite action-reaction forces act on different objects. Each object responds to net force acting ON it, not forces it exerts. Both can move forward if ground provides sufficient friction on horse."
            }
          ],
          "final_answer": "Forces are equal and opposite, but act on different objects (horse vs cart). Cart moves forward because horse's pull on cart > friction on cart. Horse moves forward because ground friction on horse > cart's pull on horse. Action-reaction forces don't cancel (different objects).",
          "concept_applied": "Third Law: forces equal/opposite on different objects. Each object's motion determined by net force ON that object. Forces on different objects don't cancel each other."
        },
        {
          "title": "Question 5: Static vs Kinetic Friction",
          "problem": "Why is it harder to start pushing a heavy box across the floor than to keep it moving at constant speed?",
          "step_by_step": [
            {
              "step": "Starting motion",
              "explanation": "Box initially stationary → static friction prevents motion. Must overcome maximum static friction $f_{s,\\text{max}} = \\mu_s F_N$ to start sliding. Static friction coefficient $\\mu_s$ typically larger."
            },
            {
              "step": "Maintaining motion",
              "explanation": "Box sliding → kinetic friction opposes motion. Magnitude $f_k = \\mu_k F_N$. Kinetic coefficient $\\mu_k$ typically smaller than $\\mu_s$: $\\mu_k < \\mu_s$."
            },
            {
              "step": "Comparison",
              "explanation": "To start: must exceed $\\mu_s F_N$ (larger). To maintain constant velocity: must match $\\mu_k F_N$ (smaller). Same normal force, but $\\mu_s > \\mu_k$ → starting requires more force than maintaining."
            },
            {
              "step": "Physical reason",
              "explanation": "Static friction: surfaces interlocked at microscopic level, adhesion strong. Kinetic friction: surfaces sliding past each other, less interlocking, lower resistance. Once motion starts, friction decreases."
            }
          ],
          "final_answer": "Harder to start because static friction ($\\mu_s F_N$) typically greater than kinetic friction ($\\mu_k F_N$). Must overcome larger static friction to initiate motion, smaller kinetic friction to maintain motion. $\\mu_s > \\mu_k$ generally.",
          "concept_applied": "Static friction (before motion) usually greater than kinetic friction (during motion). Starting motion harder than maintaining motion."
        },
        {
          "title": "Question 6: Free Fall and Air Resistance",
          "problem": "A skydiver jumps from a plane. Describe how velocity and acceleration change during the fall until reaching terminal velocity.",
          "step_by_step": [
            {
              "step": "Initial jump (v ≈ 0)",
              "explanation": "Velocity near zero → air resistance near zero. Only significant force: weight (downward). Net force ≈ weight → acceleration ≈ $g = 9.8$ m/s² downward. Starts accelerating downward rapidly."
            },
            {
              "step": "Speeding up (increasing v)",
              "explanation": "As velocity increases, air resistance increases (drag ∝ speed). Air resistance upward opposes weight downward. Net force = weight - air resistance, decreasing as air resistance grows. Acceleration = (weight - air resistance) / mass, decreasing but still positive. Still speeding up, but at decreasing rate."
            },
            {
              "step": "Approaching terminal velocity",
              "explanation": "Velocity continues increasing, air resistance continues growing. Eventually air resistance = weight. Net force = 0. Acceleration = 0. Velocity stops increasing—terminal velocity reached."
            },
            {
              "step": "At terminal velocity",
              "explanation": "Air resistance = weight → net force = 0 → acceleration = 0. Velocity constant at terminal velocity (~53 m/s spread-eagle). Continues falling at constant speed, no longer accelerating. Balanced forces."
            },
            {
              "step": "Summary of changes",
              "explanation": "Velocity: 0 → increasing → constant at terminal velocity. Acceleration: ~9.8 m/s² → decreasing → 0 at terminal velocity. Transition from accelerated motion to constant velocity motion due to speed-dependent air resistance."
            }
          ],
          "final_answer": "Initially: high acceleration (~g), low velocity. As falls: velocity increases, air resistance increases, acceleration decreases. At terminal velocity: air resistance = weight, net force = 0, acceleration = 0, velocity constant. Transition from accelerating to constant-velocity motion.",
          "concept_applied": "Air resistance increases with speed. Eventually equals weight → terminal velocity (zero acceleration, constant velocity). Demonstrates transition from Second Law acceleration to First Law constant velocity."
        }
      ]
    },
    {
      "section_title": "Free-Body Diagram Practice",
      "introduction": "Drawing and interpreting free-body diagrams is essential for force analysis.",
      "worked_examples": [
        {
          "title": "Question 7: Multiple Forces FBD",
          "problem": "A 10 kg box is pushed to the right with 50 N across a rough horizontal floor (friction present). Draw a complete free-body diagram and label all forces with magnitudes.",
          "step_by_step": [
            {
              "step": "Identify all forces",
              "explanation": "Gravity: $F_g = mg = 10 \\times 9.8 = 98$ N downward. Normal: $F_N$ upward (from floor). Applied: 50 N to the right (given). Friction: $f$ to the left (opposes motion, kinetic if sliding)."
            },
            {
              "step": "Find normal force",
              "explanation": "No vertical acceleration → vertical forces balanced. $F_N - F_g = 0$ → $F_N = 98$ N upward."
            },
            {
              "step": "Draw FBD",
              "explanation": "Simple rectangle (box) at center. Four arrows: (1) Down: 'Weight 98 N' or '$F_g = 98$ N', (2) Up: 'Normal 98 N' or '$F_N = 98$ N' (equal length to weight), (3) Right: 'Applied 50 N' or '$F_{app} = 50$ N', (4) Left: 'Friction $f$' (magnitude unknown without friction coefficient—would need $\\mu_k$ to calculate $f = \\mu_k F_N$)."
            },
            {
              "step": "Verify completeness",
              "explanation": "All forces on box shown ✓. Only forces on box (not forces box exerts) ✓. No motion arrows ✓. All labeled ✓. Complete FBD."
            }
          ],
          "final_answer": "FBD: Rectangle with four arrows: Weight 98 N down, Normal 98 N up, Applied 50 N right, Friction f left. All forces labeled with magnitudes (friction magnitude depends on $\\mu_k$).",
          "concept_applied": "Complete FBD: all forces on object (gravity, normal, applied, friction), proper directions, labeled magnitudes. Vertical forces balanced for horizontal motion."
        },
        {
          "title": "Question 8: Incline FBD",
          "problem": "A 5 kg block rests on a 30° incline without sliding. Draw free-body diagram showing all forces. Calculate magnitudes.",
          "step_by_step": [
            {
              "step": "Identify forces",
              "explanation": "Weight: $F_g = mg = 5 \\times 9.8 = 49$ N straight down (toward Earth's center, not perpendicular to incline). Normal: $F_N$ perpendicular to incline surface (away from surface). Static friction: $f_s$ parallel to incline, up the slope (prevents sliding down)."
            },
            {
              "step": "Calculate weight components",
              "explanation": "Parallel to incline (down slope): $F_{\\parallel} = mg \\sin 30° = 49 \\times 0.5 = 24.5$ N. Perpendicular to incline: $F_{\\perp} = mg \\cos 30° = 49 \\times 0.866 = 42.4$ N."
            },
            {
              "step": "Find normal force",
              "explanation": "No acceleration perpendicular to surface → normal balances perpendicular component of weight. $F_N = F_{\\perp} = 42.4$ N perpendicular to incline (away from surface)."
            },
            {
              "step": "Find static friction",
              "explanation": "No sliding → static friction up slope balances parallel component of weight. $f_s = F_{\\parallel} = 24.5$ N up the slope."
            },
            {
              "step": "Draw FBD",
              "explanation": "Simple box on incline. Three arrows: (1) Straight down (vertical): 'Weight 49 N' or '$F_g = 49$ N', (2) Perpendicular to incline away from surface: 'Normal 42.4 N', (3) Parallel to incline up slope: 'Friction 24.5 N'. Note: Weight NOT perpendicular to incline—points straight down. Components shown with dashed lines if needed for clarity."
            }
          ],
          "final_answer": "FBD: Weight 49 N straight down, Normal 42.4 N perpendicular to surface, Static friction 24.5 N up slope. Forces balanced (no sliding).",
          "concept_applied": "Incline FBD: weight straight down (not perpendicular to surface), normal perpendicular to surface, friction parallel to surface. Weight resolved into components for analysis."
        }
      ]
    },
    {
      "section_title": "Newton's Second Law Calculations",
      "introduction": "Applying $F_{\\text{net}} = ma$ to find forces, masses, or accelerations.",
      "worked_examples": [
        {
          "title": "Question 9: Finding Acceleration",
          "problem": "A 15 kg object experiences three horizontal forces: 60 N east, 20 N east, and 35 N west. Find (a) net force, (b) acceleration.",
          "step_by_step": [
            {
              "step": "(a) Net force",
              "explanation": "Choose east = positive. Forces: +60 N, +20 N, -35 N. Net: $F_{\\text{net}} = 60 + 20 - 35 = 45$ N east (positive)."
            },
            {
              "step": "(b) Acceleration",
              "explanation": "Use $F_{\\text{net}} = ma$. $45 = 15 \\times a$",
              "calculation": "$a = 45/15 = 3$ m/s² east"
            }
          ],
          "final_answer": "(a) Net force = 45 N east, (b) Acceleration = 3 m/s² east",
          "concept_applied": "Net force: sum forces with signs (direction matters). Second Law: $a = F_{\\text{net}}/m$. Acceleration direction matches net force direction."
        },
        {
          "title": "Question 10: Finding Force to Produce Acceleration",
          "problem": "A 50 kg sled accelerates at 2.5 m/s² to the right. Friction opposes with 75 N to the left. What applied force is needed?",
          "step_by_step": [
            {
              "step": "Find required net force",
              "explanation": "Use Second Law: $F_{\\text{net}} = ma = 50 \\times 2.5 = 125$ N to the right"
            },
            {
              "step": "Set up force equation",
              "explanation": "Right = positive. $F_{\\text{net}} = F_{\\text{applied}} - f$. $125 = F_{\\text{applied}} - 75$"
            },
            {
              "step": "Solve for applied force",
              "explanation": "$F_{\\text{applied}} = 125 + 75 = 200$ N to the right"
            },
            {
              "step": "Interpret",
              "explanation": "Need 200 N applied force. 75 N overcomes friction, 125 N provides net force for acceleration."
            }
          ],
          "final_answer": "Applied force = 200 N to the right",
          "concept_applied": "Work backward: desired acceleration → required net force (F=ma) → required applied force (accounting for friction)."
        },
        {
          "title": "Question 11: Friction Problem",
          "problem": "A 20 kg box slides across a floor with $\\mu_k = 0.25$. (a) Find kinetic friction force. (b) If no other horizontal forces, find deceleration.",
          "step_by_step": [
            {
              "step": "(a) Find friction",
              "explanation": "Normal force: $F_N = mg = 20 \\times 9.8 = 196$ N. Kinetic friction: $f_k = \\mu_k F_N = 0.25 \\times 196$",
              "calculation": "$f_k = 49$ N (opposes motion)"
            },
            {
              "step": "(b) Find deceleration",
              "explanation": "Only horizontal force is friction (backward if moving forward). Net force: $F_{\\text{net}} = -f_k = -49$ N. Use Second Law: $a = F_{\\text{net}}/m = -49/20$",
              "calculation": "$a = -2.45$ m/s² (deceleration)"
            }
          ],
          "final_answer": "(a) Friction = 49 N opposing motion, (b) Deceleration = 2.45 m/s²",
          "concept_applied": "Kinetic friction: $f_k = \\mu_k F_N$. Friction alone causes deceleration: $a = -f_k/m$."
        },
        {
          "title": "Question 12: Two-Dimensional Forces",
          "problem": "Forces on object: 30 N north, 40 N east. Mass 5 kg. Find (a) net force magnitude and direction, (b) acceleration magnitude and direction.",
          "step_by_step": [
            {
              "step": "(a) Net force components",
              "explanation": "North = +y, East = +x. $F_{\\text{net},x} = 40$ N, $F_{\\text{net},y} = 30$ N."
            },
            {
              "step": "Magnitude",
              "explanation": "$F_{\\text{net}} = \\sqrt{F_x^2 + F_y^2} = \\sqrt{40^2 + 30^2} = \\sqrt{1600 + 900} = \\sqrt{2500}$",
              "calculation": "$F_{\\text{net}} = 50$ N"
            },
            {
              "step": "Direction",
              "explanation": "$\\theta = \\tan^{-1}(F_y/F_x) = \\tan^{-1}(30/40) = \\tan^{-1}(0.75)$",
              "calculation": "$\\theta = 36.9°$ north of east"
            },
            {
              "step": "(b) Acceleration",
              "explanation": "Same direction as net force (36.9° N of E). Magnitude: $a = F_{\\text{net}}/m = 50/5$",
              "calculation": "$a = 10$ m/s² at 36.9° N of E"
            }
          ],
          "final_answer": "(a) Net force = 50 N at 36.9° north of east, (b) Acceleration = 10 m/s² at 36.9° north of east",
          "concept_applied": "2D forces: find components, use Pythagorean theorem for magnitude, inverse tangent for direction. Acceleration parallel to net force."
        }
      ]
    },
    {
      "section_title": "Integrated Multi-Concept Problems",
      "introduction": "Complex problems requiring multiple concepts and steps.",
      "worked_examples": [
        {
          "title": "Question 13: Elevator Physics",
          "problem": "A 60 kg person stands on a scale in an elevator. Find scale reading (apparent weight) when: (a) elevator at rest, (b) accelerating upward at 2 m/s², (c) accelerating downward at 3 m/s².",
          "step_by_step": [
            {
              "step": "Actual weight (constant)",
              "explanation": "$W = mg = 60 \\times 9.8 = 588$ N"
            },
            {
              "step": "(a) At rest",
              "explanation": "No acceleration → net force = 0 → normal (scale reading) = weight. Scale reads 588 N."
            },
            {
              "step": "(b) Accelerating upward",
              "explanation": "Upward acceleration → net upward force needed. $F_N - W = ma$. $F_N = W + ma = 588 + 60 \\times 2 = 588 + 120$",
              "calculation": "$F_N = 708$ N. Scale reads 708 N (feels heavier, 20% increase)."
            },
            {
              "step": "(c) Accelerating downward",
              "explanation": "Downward acceleration → net downward force. $W - F_N = ma$. $F_N = W - ma = 588 - 60 \\times 3 = 588 - 180$",
              "calculation": "$F_N = 408$ N. Scale reads 408 N (feels lighter, 31% decrease)."
            }
          ],
          "final_answer": "(a) 588 N (normal), (b) 708 N (heavier), (c) 408 N (lighter)",
          "concept_applied": "Apparent weight = normal force. Changes with acceleration: $F_N = W ± ma$ (+ for upward, - for downward acceleration). Actual weight constant."
        },
        {
          "title": "Question 14: Starting and Maintaining Motion",
          "problem": "A 30 kg crate on a floor has $\\mu_s = 0.5$ and $\\mu_k = 0.3$. (a) What force starts it moving? (b) What force maintains constant velocity motion?",
          "step_by_step": [
            {
              "step": "Find normal force",
              "explanation": "$F_N = mg = 30 \\times 9.8 = 294$ N"
            },
            {
              "step": "(a) Force to start",
              "explanation": "Must overcome maximum static friction. $f_{s,\\text{max}} = \\mu_s F_N = 0.5 \\times 294 = 147$ N. Need applied force > 147 N to start motion. Minimum ≈ 147 N."
            },
            {
              "step": "(b) Force for constant velocity",
              "explanation": "Constant velocity → net force = 0 → applied force must equal kinetic friction. $f_k = \\mu_k F_N = 0.3 \\times 294 = 88.2$ N. Applied force = 88.2 N maintains constant velocity."
            },
            {
              "step": "Compare",
              "explanation": "Starting (147 N) > maintaining (88.2 N). Static friction greater than kinetic friction."
            }
          ],
          "final_answer": "(a) ≈147 N to start, (b) 88.2 N to maintain constant velocity",
          "concept_applied": "Starting: overcome static friction $\\mu_s F_N$. Maintaining: match kinetic friction $\\mu_k F_N$. $\\mu_s > \\mu_k$ → starting harder."
        },
        {
          "title": "Question 15: Connected Objects",
          "problem": "Two boxes are in contact on a frictionless surface. Box A (10 kg) is pushed from left with 60 N. Box B (15 kg) is to the right of A. (a) Find acceleration of system. (b) Find force A exerts on B.",
          "step_by_step": [
            {
              "step": "(a) System acceleration",
              "explanation": "Treat as single system: total mass = 10 + 15 = 25 kg. External force: 60 N. Frictionless → only 60 N acts on system. $F_{\\text{net}} = ma$. $60 = 25a$",
              "calculation": "$a = 60/25 = 2.4$ m/s²"
            },
            {
              "step": "(b) Force A exerts on B",
              "explanation": "Analyze box B separately. Box B accelerates at 2.4 m/s² (same as system). Mass of B: 15 kg. Force needed to accelerate B: $F = m_B a = 15 \\times 2.4 = 36$ N. This force comes from A pushing B. Force A on B = 36 N to the right."
            },
            {
              "step": "Check with Third Law",
              "explanation": "Force A on B = 36 N right. Third Law: B exerts 36 N left on A. Analyze A: applied 60 N right, B pushes 36 N left on A. Net on A: 60 - 36 = 24 N. A's acceleration: 24/10 = 2.4 m/s² ✓ Consistent."
            }
          ],
          "final_answer": "(a) Acceleration = 2.4 m/s² for both boxes, (b) A exerts 36 N on B (to the right)",
          "concept_applied": "Connected objects: find system acceleration (total force / total mass), then analyze individual objects to find interaction forces. Third Law: interaction forces equal/opposite."
        }
      ]
    }
  ],
  "key_terms": [
    "Force identification",
    "Free-body diagram",
    "Net force",
    "Newton's First Law",
    "Newton's Second Law",
    "Newton's Third Law",
    "Action-reaction pairs",
    "Mass vs weight",
    "Static friction",
    "Kinetic friction",
    "Air resistance",
    "Terminal velocity",
    "Apparent weight"
  ],
  "summary": "Chapter 4 review consolidates force concepts and Newton's laws through conceptual questions and calculations. Key topics: Force identification—recognizing common forces (gravity/weight always downward, normal perpendicular to surface, friction parallel to surface opposing motion, tension along rope, applied as specified, air resistance opposing velocity). Free-body diagrams—essential tool showing all forces ON one object as labeled arrows, never including forces object exerts, revealing net force direction and enabling systematic analysis. Net force—vector sum of all forces, determines acceleration via Second Law, zero for equilibrium (First Law). Newton's First Law—zero net force produces constant velocity (including rest), balanced forces produce no acceleration, inertia resists changes in motion. Newton's Second Law—$F_{\\text{net}} = ma$ quantifies force-acceleration relationship, acceleration directly proportional to net force, inversely proportional to mass, always in net force direction. Newton's Third Law—forces come in equal/opposite pairs acting on different objects (not canceling), explains locomotion (push ground back, ground pushes forward), propulsion (push gas back, gas pushes rocket forward), and interactions. Mass vs weight—mass intrinsic (kg, constant everywhere, measures inertia), weight is force (N, $W = mg$, varies with gravitational field strength). Static vs kinetic friction—static prevents motion starting ($f_s \\leq \\mu_s F_N$, variable), kinetic opposes sliding ($f_k = \\mu_k F_N$, constant), typically $\\mu_s > \\mu_k$ making starting harder than maintaining motion. Air resistance—opposes velocity, increases with speed, causes terminal velocity when equals weight (net force zero, constant falling speed). Apparent weight—normal force felt as 'weight,' changes in accelerating elevator ($F_N = W ± ma$), zero in free fall (weightlessness). Problem-solving strategy: draw FBD showing all forces, establish coordinate system and signs, calculate net force (sum with signs), apply appropriate Newton's law, solve for unknown, check reasonableness. Success requires understanding concepts (why laws work, what forces do), procedural skills (FBDs, calculations, equation selection), and integration (multi-step problems combining multiple topics)."
}
