{
  "expanded_description": "Newton's Third Law describes how forces always come in pairs—when one object exerts a force on another, the second object exerts an equal and opposite force back on the first. This law reveals the interactive nature of forces and explains phenomena from walking to rocket propulsion.",
  "core_concept": {
    "principle": "Newton's Third Law states: For every action force, there is an equal and opposite reaction force. More precisely: When object A exerts a force on object B, object B simultaneously exerts a force on object A that is equal in magnitude and opposite in direction. Mathematically: $\\vec{F}_{A \\text{ on } B} = -\\vec{F}_{B \\text{ on } A}$. These paired forces are called action-reaction pairs.",
    "explanation": "Forces never occur in isolation—they always come in pairs. When you push a wall, the wall pushes back on you with equal force. When Earth pulls you down (gravity), you pull Earth up with equal force. When rocket exhaust pushes backward, the exhaust pushes the rocket forward with equal force. Key characteristics of action-reaction pairs: (1) Equal magnitude—the forces have the same strength. (2) Opposite direction—they point in opposite directions. (3) Same type—both are contact forces or both are non-contact forces. (4) Different objects—one force acts on object A, the other acts on object B; they NEVER act on the same object. (5) Simultaneous—they occur at exactly the same time, not one after the other. Critical insight: action-reaction pairs act on different objects, so they don't cancel out. Net force on one object depends only on forces acting ON that object, not forces it exerts. Common confusion: If forces are equal and opposite, why does anything move? Answer: the paired forces act on different objects. When you push a cart, you push cart (cart moves), and cart pushes you (you might slide backward), but these are forces on different objects—they don't cancel each other. The Third Law explains: why we can walk (push ground backward, ground pushes us forward), how rockets work (expel gas backward, gas pushes rocket forward), why we can swim (push water backward, water pushes us forward), why recoil occurs (bullet goes forward, gun pushed backward). Understanding action-reaction pairs is essential for analyzing interactions between objects and solving problems involving multiple connected objects.",
    "image": {
      "src": "images/unit4/third_law_concept.png",
      "alt": "Diagram showing action-reaction pairs: person pushing wall, Earth and object gravitational forces",
      "caption": "Newton's Third Law: Forces come in equal and opposite pairs acting on different objects"
    }
  },
  "sections": [
    {
      "section_title": "Understanding Action-Reaction Pairs",
      "introduction": "The essence of Newton's Third Law is that forces always occur in pairs—action and reaction forces that are equal in magnitude, opposite in direction, and act on different objects.",
      "key_concept": {
        "definition": "An action-reaction pair consists of two forces: Force 1: Object A exerts force on object B (the 'action'). Force 2: Object B exerts force on object A (the 'reaction'). These forces have equal magnitude, opposite direction, same type, act on different objects, and occur simultaneously. Neither force is more fundamental—'action' and 'reaction' are interchangeable labels.",
        "context": "The terms 'action' and 'reaction' are somewhat misleading—they suggest one causes the other or happens first. In reality, both forces exist simultaneously and equally. You could call either one the 'action' and the other the 'reaction.'"
      },
      "principles": [
        {
          "principle": "Equal Magnitude",
          "statement": "Action and reaction forces have exactly the same strength: $|\\vec{F}_{A \\text{ on } B}| = |\\vec{F}_{B \\text{ on } A}|$",
          "application": "The forces are numerically equal, measured in newtons.",
          "example": "You push wall with 50 N. Wall pushes you with 50 N (not 49 N or 51 N—exactly 50 N). Earth pulls 70 kg person with 686 N. Person pulls Earth with 686 N."
        },
        {
          "principle": "Opposite Direction",
          "statement": "Action and reaction forces point in exactly opposite directions: $\\vec{F}_{A \\text{ on } B} = -\\vec{F}_{B \\text{ on } A}$ (the negative sign indicates opposite direction).",
          "application": "If action is to the right, reaction is to the left. If action is upward, reaction is downward.",
          "example": "You push cart to the right with 30 N. Cart pushes you to the left with 30 N. Rocket pushes gas downward and backward. Gas pushes rocket upward and forward."
        },
        {
          "principle": "Same Type of Force",
          "statement": "Action and reaction are the same kind of force. If action is gravitational, reaction is gravitational. If action is normal force, reaction is normal force. If action is friction, reaction is friction.",
          "application": "Both forces in pair have same physical origin.",
          "example": "Gravitational pair: Earth pulls Moon (gravity), Moon pulls Earth (gravity). Contact pair: Hand pushes wall (normal), wall pushes hand (normal). NOT a pair: gravity pulling book down, normal force pushing book up (different types, both act on book)."
        },
        {
          "principle": "Different Objects",
          "statement": "This is CRITICAL: Action acts on one object, reaction acts on the other object. They NEVER act on the same object. Therefore, they don't cancel each other in net force calculations.",
          "application": "Each force goes on different object's free-body diagram. They appear on separate FBDs.",
          "example": "Book on table: Book pushes table down (on table's FBD). Table pushes book up (on book's FBD). These are action-reaction pair, but they act on different objects, so they don't cancel when finding net force on book."
        },
        {
          "principle": "Simultaneous Occurrence",
          "statement": "Action and reaction occur at exactly the same time. Neither causes the other—they're mutually dependent.",
          "application": "Both forces exist as long as interaction exists. No time delay.",
          "example": "The instant you start pushing wall, wall starts pushing you. The instant you stop pushing wall, wall stops pushing you. Simultaneous."
        }
      ],
      "classifications": [
        {
          "type": "Identifying Action-Reaction Pairs",
          "value": "How to recognize paired forces",
          "characteristics": [
            "Equal magnitude",
            "Opposite direction",
            "Same type",
            "Different objects",
            "Simultaneous"
          ],
          "behavior": "All five characteristics must be satisfied.",
          "examples": [
            {
              "process": "Example pair: Gravity",
              "explanation": "Earth exerts gravitational force on Moon (pulls Moon toward Earth). Moon exerts gravitational force on Earth (pulls Earth toward Moon). Equal magnitude (same $G \\frac{m_1 m_2}{r^2}$), opposite directions, both gravity, different objects (one on Moon, one on Earth), simultaneous. ✓ Action-reaction pair."
            },
            {
              "process": "Example pair: Normal force",
              "explanation": "Person's feet push floor downward (normal force). Floor pushes person's feet upward (normal force). Equal magnitude, opposite directions, both normal force, different objects (one on floor, one on person), simultaneous. ✓ Action-reaction pair."
            },
            {
              "process": "NOT a pair: Book on table",
              "explanation": "Gravity pulls book down. Normal force pushes book up. Equal magnitude? Yes (book at rest). Opposite direction? Yes. But: Different types (gravity vs normal). Both act on SAME object (book). NOT action-reaction pair. These are two separate forces from two separate interactions, both acting on book."
            }
          ]
        },
        {
          "type": "Common Action-Reaction Pairs",
          "value": "Frequently encountered pairs in physics problems",
          "characteristics": [
            "Gravitational attraction",
            "Normal force pairs",
            "Friction pairs",
            "Tension pairs"
          ],
          "behavior": "Recognizing standard pairs.",
          "examples": [
            {
              "process": "Gravitational",
              "explanation": "Any two masses attract each other. Earth on object (weight down), object on Earth (up). Sun on planet, planet on Sun."
            },
            {
              "process": "Normal",
              "explanation": "Object on surface, surface on object. Book pushes table down, table pushes book up."
            },
            {
              "process": "Friction",
              "explanation": "Object sliding on surface. Surface exerts friction on object (opposes object's motion relative to surface). Object exerts friction on surface (opposes surface's motion relative to object—in opposite direction)."
            },
            {
              "process": "Tension",
              "explanation": "Rope pulling object. Object pulls rope. Both feel same tension magnitude."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Action-Reaction Pairs",
          "problem": "A book rests on a table. Identify all forces and determine which are action-reaction pairs.",
          "step_by_step": [
            {
              "step": "List forces on book",
              "explanation": "Force 1: Gravity—Earth pulls book downward ($F_{E \\text{ on } b}$). Force 2: Normal—Table pushes book upward ($F_{T \\text{ on } b}$)."
            },
            {
              "step": "List forces on table",
              "explanation": "Force 3: Normal—Book pushes table downward ($F_{b \\text{ on } T}$). Also: Earth pulls table down, floor pushes table up (not shown for simplicity)."
            },
            {
              "step": "Find action-reaction pairs",
              "explanation": "Pair 1: Earth pulls book down ($F_{E \\text{ on } b}$) ↔ Book pulls Earth up ($F_{b \\text{ on } E}$). Both gravity, equal magnitude, opposite directions, different objects. ✓ Pair 2: Book pushes table down ($F_{b \\text{ on } T}$) ↔ Table pushes book up ($F_{T \\text{ on } b}$). Both normal force, equal magnitude, opposite directions, different objects. ✓"
            },
            {
              "step": "What is NOT a pair",
              "explanation": "Earth pulls book down ($F_{E \\text{ on } b}$) and Table pushes book up ($F_{T \\text{ on } b}$) are NOT action-reaction pair. Why? Both act on same object (book). Different types (gravity vs normal). They're balanced forces on book, not action-reaction pair."
            }
          ],
          "final_answer": "Action-reaction pairs: (1) Earth pulls book ↔ Book pulls Earth. (2) Book pushes table ↔ Table pushes book. NOT a pair: Earth on book and Table on book (both act on book).",
          "concept_applied": "Action-reaction pairs act on different objects. Forces balanced on one object are NOT action-reaction pairs—they're different interactions both acting on that object."
        },
        {
          "title": "Third Law in Motion",
          "problem": "You push a 20 kg shopping cart forward with 60 N. (a) What force does cart exert on you? (b) If cart accelerates at 2 m/s², what is the friction force on the cart? (c) Why don't you and cart remain stationary despite equal and opposite forces?",
          "step_by_step": [
            {
              "step": "(a) Cart's force on you",
              "explanation": "Third Law: If you push cart with 60 N forward, cart pushes you with 60 N backward. Equal magnitude, opposite direction. This is action-reaction pair."
            },
            {
              "step": "(b) Find friction on cart",
              "explanation": "Cart accelerates at 2 m/s². Use Second Law on cart: $F_{\\text{net}} = ma = 20 \\times 2 = 40$ N forward. Net force is your push minus friction: $60 - f = 40$. Solve: $f = 20$ N."
            },
            {
              "step": "(c) Why motion occurs",
              "explanation": "The 60 N you exert on cart and 60 N cart exerts on you are equal and opposite, BUT they act on different objects. Cart experiences your 60 N push forward and friction 20 N backward → net 40 N forward → accelerates. You experience cart's 60 N push backward and ground's friction on your feet forward → may remain stationary if ground friction = 60 N. Forces on different objects don't cancel each other."
            }
          ],
          "final_answer": "(a) Cart pushes you with 60 N backward. (b) Friction on cart = 20 N. (c) Equal and opposite forces act on different objects (you vs cart), so they don't cancel—each object responds to forces acting on it.",
          "concept_applied": "Action-reaction forces are equal and opposite but act on different objects. Each object has its own net force and accelerates according to forces acting on it, not forces it exerts."
        },
        {
          "title": "Gravitational Action-Reaction",
          "problem": "Earth (mass $6 \\times 10^{24}$ kg) pulls a 70 kg person with 686 N. (a) What force does person exert on Earth? (b) Both forces equal, so why does person accelerate toward Earth much more than Earth accelerates toward person?",
          "step_by_step": [
            {
              "step": "(a) Force on Earth",
              "explanation": "Third Law: Person pulls Earth with 686 N upward (toward person). Equal magnitude to Earth's pull on person, opposite direction."
            },
            {
              "step": "(b) Why different motions",
              "explanation": "Forces equal (both 686 N), but masses vastly different. Person's acceleration: $a_p = F/m = 686/70 = 9.8$ m/s² downward (noticeable). Earth's acceleration: $a_E = F/m = 686/(6 \\times 10^{24}) = 1.1 \\times 10^{-22}$ m/s² upward (utterly negligible, unmeasurable)."
            },
            {
              "step": "Key insight",
              "explanation": "Equal forces, but Second Law $F = ma$ means acceleration inversely proportional to mass. Enormous Earth mass → tiny acceleration. Small person mass → large acceleration. Both feel same force, but respond very differently."
            }
          ],
          "final_answer": "(a) Person pulls Earth with 686 N upward. (b) Equal forces but vastly different masses. Person (small mass) has large acceleration (9.8 m/s²). Earth (huge mass) has imperceptible acceleration (~10⁻²² m/s²).",
          "concept_applied": "Third Law: forces equal. Second Law: acceleration depends on mass ($a = F/m$). Equal forces on objects with different masses produce different accelerations."
        }
      ],
      "image": {
        "src": "images/unit4/action_reaction_examples.png",
        "alt": "Multiple diagrams showing action-reaction pairs with force arrows on different objects",
        "caption": "Action-reaction pairs: equal magnitude, opposite direction, acting on different objects"
      }
    },
    {
      "section_title": "Why Don't Action-Reaction Forces Cancel?",
      "introduction": "A common confusion: if action and reaction are equal and opposite, why doesn't everything remain stationary? The answer lies in understanding that paired forces act on different objects.",
      "key_concept": {
        "definition": "Action-reaction forces don't cancel because they act on different objects. Net force on an object depends only on forces acting ON that object. Forces the object exerts on other things don't affect its own motion—they affect the motion of those other things.",
        "context": "When calculating net force for one object's motion (to use $F_{\\text{net}} = ma$), you sum all forces acting ON that object only. The action-reaction partner forces act on different objects, so they're never summed together."
      },
      "principles": [
        {
          "principle": "Forces on Different Objects Don't Cancel",
          "statement": "To cancel, forces must act on the same object. Action-reaction forces act on different objects, so they can't cancel each other in any single object's net force calculation.",
          "application": "When finding net force on object A, include only forces acting ON object A. Ignore forces object A exerts on other objects (those affect other objects' motion).",
          "example": "You push cart with 50 N. Cart pushes you with 50 N. These don't cancel because they act on different objects. Cart experiences your 50 N (plus friction, etc.)—that determines cart's acceleration. You experience cart's 50 N (plus ground friction on you)—that determines your acceleration."
        },
        {
          "principle": "Each Object Analyzes Separately",
          "statement": "To understand a system of interacting objects, analyze each object individually using its own free-body diagram showing forces acting ON that object.",
          "application": "Multiple objects: draw separate FBD for each. Each FBD shows forces on that object only.",
          "example": "Two objects connected by rope: FBD for object 1 shows tension pulling it (from rope). FBD for object 2 shows tension pulling it (from rope). Tensions are action-reaction pair (equal magnitude, opposite directions), but they appear on different FBDs, analyzed separately."
        },
        {
          "principle": "When Objects DO Remain Stationary",
          "statement": "Objects can remain at rest despite action-reaction forces if all forces ON each object are balanced. This is coincidence of balancing, not because action-reaction forces cancel.",
          "application": "Check forces on each object separately.",
          "example": "Book on table: Book at rest because forces ON book (gravity down, normal up) balance. Table at rest because forces ON table (book pushing down, floor pushing up, table's weight) balance. Not because book-on-table and table-on-book forces cancel (those act on different objects)."
        }
      ],
      "worked_examples": [
        {
          "title": "Explaining Motion Despite Equal and Opposite Forces",
          "problem": "When you walk, your foot pushes ground backward with 100 N, and ground pushes your foot forward with 100 N. These are equal and opposite. Why do you move forward instead of staying still?",
          "step_by_step": [
            {
              "step": "Identify action-reaction pair",
              "explanation": "Foot on ground: 100 N backward (you exert on ground). Ground on foot: 100 N forward (ground exerts on you). Action-reaction pair—equal, opposite, different objects."
            },
            {
              "step": "Analyze YOUR motion",
              "explanation": "You move because of forces acting ON you. Relevant force: ground pushes you forward with 100 N. This acts on YOU. (The 100 N you push on ground acts on GROUND, not you—doesn't affect your motion.)"
            },
            {
              "step": "Net force on you",
              "explanation": "Horizontal forces on you: ground friction forward 100 N, air resistance backward ~small. Net force forward → you accelerate forward. You move!"
            },
            {
              "step": "What about ground?",
              "explanation": "Your 100 N backward push acts on ground. If ground free to move, it would accelerate backward. But ground connected to massive Earth—acceleration negligible. Ground effectively stationary."
            },
            {
              "step": "Key insight",
              "explanation": "The 100 N forces are equal and opposite, but they act on different objects (you vs ground). You respond to ground's 100 N push on you (accelerate forward). Ground responds to your 100 N push on it (would accelerate backward but too massive to notice). Each object's motion determined by forces acting ON it."
            }
          ],
          "final_answer": "You move forward because ground pushes YOU forward with 100 N. The equal and opposite 100 N you push on ground acts on the GROUND (not you), so it doesn't cancel the ground's push on you. Forces on different objects don't cancel.",
          "concept_applied": "Walking explained by Third Law: push ground back, ground pushes you forward. You accelerate from ground's push on you. Equal and opposite forces act on different objects."
        },
        {
          "title": "Two Ice Skaters Pushing Apart",
          "problem": "Two ice skaters (masses: Alice 50 kg, Bob 75 kg) push off each other. Alice exerts 120 N on Bob. (a) What force does Bob exert on Alice? (b) Find each skater's acceleration. (c) Who accelerates more?",
          "step_by_step": [
            {
              "step": "(a) Bob's force on Alice",
              "explanation": "Third Law: Bob exerts 120 N on Alice (opposite direction from Alice's push). Equal magnitude, opposite direction. Action-reaction pair."
            },
            {
              "step": "(b) Alice's acceleration",
              "explanation": "Force on Alice: Bob pushes her with 120 N (say, to the left). $a_A = F/m = 120/50 = 2.4$ m/s² to the left"
            },
            {
              "step": "Bob's acceleration",
              "explanation": "Force on Bob: Alice pushes him with 120 N (to the right, opposite Alice's direction). $a_B = F/m = 120/75 = 1.6$ m/s² to the right"
            },
            {
              "step": "(c) Who accelerates more",
              "explanation": "Alice: 2.4 m/s². Bob: 1.6 m/s². Alice accelerates more (50% greater acceleration) despite equal forces because she has smaller mass. $a = F/m$: smaller mass → larger acceleration for same force."
            }
          ],
          "final_answer": "(a) Bob exerts 120 N on Alice (opposite direction). (b) Alice: 2.4 m/s², Bob: 1.6 m/s² (opposite directions). (c) Alice accelerates more (lighter mass).",
          "concept_applied": "Third Law: equal forces. Second Law: acceleration inversely proportional to mass. Same force, different masses → different accelerations. Both skaters move apart."
        }
      ],
      "image": {
        "src": "images/unit4/why_forces_dont_cancel.png",
        "alt": "Diagram showing two objects with action-reaction forces acting on each, with separate FBDs",
        "caption": "Forces don't cancel because they act on different objects. Each object responds to forces acting ON it."
      }
    },
    {
      "section_title": "Applications of Newton's Third Law",
      "introduction": "The Third Law explains many everyday phenomena and is essential for technologies from walking to rocket propulsion.",
      "categories": [
        {
          "type": "Walking and Running",
          "description": "Locomotion depends on Third Law.",
          "examples": [
            {
              "process": "Mechanism",
              "explanation": "Foot pushes ground backward (friction between foot and ground). Ground pushes foot (and person) forward with equal force (Third Law). Forward force on person from ground causes acceleration forward. Without friction (on ice), can't push ground backward effectively → ground doesn't push you forward → can't walk easily."
            },
            {
              "process": "Running faster",
              "explanation": "Push ground backward harder → ground pushes you forward harder → greater acceleration → faster running. Sprinters push ground with hundreds of newtons."
            },
            {
              "process": "Why slippery surfaces difficult",
              "explanation": "Low friction means you can't exert large backward force on ground → ground can't exert large forward force on you → difficult to accelerate. Ice, oil spills make walking/running hard."
            }
          ]
        },
        {
          "type": "Swimming",
          "description": "Moving through water uses Third Law.",
          "examples": [
            {
              "process": "Mechanism",
              "explanation": "Hands/feet push water backward. Water pushes hands/feet (and swimmer) forward with equal force (Third Law). Forward force from water propels swimmer. Better push water (stronger stroke) → larger forward force → faster swimming."
            },
            {
              "process": "Treading water",
              "explanation": "Push water downward. Water pushes you upward. Upward force keeps you from sinking (counteracts weight partially)."
            }
          ]
        },
        {
          "type": "Rocket Propulsion",
          "description": "Rockets in space exemplify Third Law.",
          "examples": [
            {
              "process": "How rockets work",
              "explanation": "Rocket engine expels gas backward at high speed (rocket pushes gas backward with huge force). Gas pushes rocket forward with equal force (Third Law). Forward force accelerates rocket. Works in space (no air, no ground to push against) because rocket pushes gas, gas pushes rocket—internal interaction."
            },
            {
              "process": "Momentum perspective",
              "explanation": "Gas gains backward momentum. Rocket gains equal forward momentum (momentum conservation, related to Third Law). The faster the expelled gas and the more gas expelled, the greater the rocket's acceleration."
            },
            {
              "process": "Why rockets work in vacuum",
              "explanation": "Don't need external medium. Rocket carries its own reaction mass (fuel). Pushes that mass out → mass pushes rocket. Third Law internal to rocket-gas system."
            }
          ]
        },
        {
          "type": "Recoil",
          "description": "Guns, cannons experience recoil due to Third Law.",
          "examples": [
            {
              "process": "Mechanism",
              "explanation": "Exploding gunpowder pushes bullet forward (gun exerts force on bullet). Bullet pushes gun backward with equal force (Third Law). Gun recoils backward. Heavier gun → smaller recoil acceleration ($a = F/m$, larger $m$ gives smaller $a$). Same principle as rocket: forward projectile, backward launcher."
            }
          ]
        },
        {
          "type": "Tension in Ropes",
          "description": "Pulling on rope demonstrates Third Law.",
          "examples": [
            {
              "process": "Tug-of-war",
              "explanation": "Team A pulls rope with force $F_A$. Rope pulls Team A back with force $F_A$ (Third Law pair). Team B pulls rope with force $F_B$. Rope pulls Team B back with force $F_B$ (Third Law pair). Winning team: exerts larger force on rope? No! Both teams feel equal tension from rope. Winner: team that has better friction with ground, so ground pushes them forward more strongly, preventing them from being pulled backward."
            },
            {
              "process": "Hanging from rope",
              "explanation": "You pull rope down (your weight). Rope pulls you up (tension, equal to your weight if stationary). Action-reaction pair."
            }
          ]
        },
        {
          "type": "Sitting and Standing",
          "description": "Contact forces between you and chair/ground.",
          "examples": [
            {
              "process": "Sitting on chair",
              "explanation": "Your weight pushes chair down. Chair pushes you up (normal force). Equal forces, opposite directions, different objects (you vs chair). You don't fall through chair because chair's upward push on you balances your weight."
            },
            {
              "process": "Standing on ground",
              "explanation": "You push ground down (your weight transferred through legs). Ground pushes you up (normal force). If ground couldn't push back (quicksand, thin ice), you'd sink."
            }
          ]
        },
        {
          "type": "Jumping",
          "description": "Leaving ground requires Third Law.",
          "examples": [
            {
              "process": "Mechanism",
              "explanation": "Legs push ground downward with force greater than your weight. Ground pushes you upward with equal force (Third Law). Net upward force (ground push minus weight) accelerates you upward. Stronger push → larger net force → higher jump."
            },
            {
              "process": "Why can't jump on frictionless surface",
              "explanation": "On ice, legs slip when trying to push down—can't exert large downward force on ice → ice doesn't exert large upward force on you → can't jump effectively."
            }
          ]
        },
        {
          "type": "Car Acceleration",
          "description": "Engine doesn't directly push car forward.",
          "examples": [
            {
              "process": "Actual mechanism",
              "explanation": "Engine rotates wheels. Wheels (via friction) push road backward. Road (via friction) pushes wheels forward (Third Law). Forward friction force from road accelerates car. Common misconception: engine pushes car forward. Actually: engine makes wheels push road, road pushes car."
            },
            {
              "process": "Why wheels spin on ice",
              "explanation": "Low friction on ice means wheels can't push road backward effectively → road doesn't push wheels forward effectively → poor acceleration, wheels spin in place."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit4/third_law_applications.png",
        "alt": "Multiple diagrams: walking, swimming, rocket, recoil, each showing action-reaction forces",
        "caption": "Third Law applications: walking (push ground back), swimming (push water back), rockets (push gas back), recoil (push bullet forward)"
      }
    },
    {
      "section_title": "Common Misconceptions About the Third Law",
      "introduction": "Several misunderstandings about Newton's Third Law are widespread. Clarifying these strengthens understanding.",
      "categories": [
        {
          "type": "Misconception: Action Causes Reaction",
          "description": "'Action' happens first, then 'reaction' responds.",
          "examples": [
            {
              "process": "Why it's wrong",
              "explanation": "Action and reaction are simultaneous. Neither causes the other—they're mutually dependent. The instant one exists, the other exists. The instant one stops, the other stops. No time delay, no causation—just simultaneous paired forces."
            },
            {
              "process": "Better terminology",
              "explanation": "'Interaction forces' or 'paired forces' better than 'action-reaction' because it doesn't imply causation or sequence. Either force could be called 'action'—labels are arbitrary."
            }
          ]
        },
        {
          "type": "Misconception: Forces Cancel So Nothing Moves",
          "description": "If forces equal and opposite, objects stay still.",
          "examples": [
            {
              "process": "Why it's wrong",
              "explanation": "Forces only cancel if they act on the SAME object. Action-reaction forces act on DIFFERENT objects, so they never cancel. Each object responds to forces acting ON it, not forces it exerts."
            },
            {
              "process": "Correct understanding",
              "explanation": "Objects can accelerate despite action-reaction pairs. Each object's acceleration determined by net force ON that object. Example: Push wall with 100 N, wall pushes you 100 N back. You might slide backward (if floor friction < 100 N). Wall doesn't move (connected to building, Earth). Different objects, different motions."
            }
          ]
        },
        {
          "type": "Misconception: Bigger Object Exerts Bigger Force",
          "description": "In collision, massive truck exerts larger force on small car than car exerts on truck.",
          "examples": [
            {
              "process": "Why it's wrong",
              "explanation": "Third Law guarantees equal magnitude forces always. Truck on car = car on truck (exactly equal). Masses irrelevant to force equality."
            },
            {
              "process": "Why damages differ",
              "explanation": "Equal forces, but different masses → different accelerations ($a = F/m$). Small car (light) undergoes huge deceleration → severe damage. Large truck (massive) undergoes small deceleration → less damage. Equal forces, unequal consequences due to mass difference."
            }
          ]
        },
        {
          "type": "Misconception: Only Contact Forces Have Pairs",
          "description": "Third Law applies only when objects touch.",
          "examples": [
            {
              "process": "Why it's wrong",
              "explanation": "ALL forces come in action-reaction pairs—contact and non-contact. Gravity: Earth pulls Moon, Moon pulls Earth (no contact needed). Magnetic: magnet attracts iron, iron attracts magnet. Electric: proton repels proton, both feel equal repulsion."
            }
          ]
        },
        {
          "type": "Misconception: Balanced Forces Are Action-Reaction Pairs",
          "description": "Book on table: gravity down and normal up are action-reaction pair.",
          "examples": [
            {
              "process": "Why it's wrong",
              "explanation": "Action-reaction pairs act on DIFFERENT objects. Gravity on book and normal on book both act on SAME object (book)—can't be action-reaction pair. They're balanced forces on book (equilibrium), not action-reaction pair. Actual action-reaction pairs: (1) Earth pulls book ↔ book pulls Earth. (2) Book pushes table ↔ table pushes book."
            },
            {
              "process": "Key distinction",
              "explanation": "Balanced forces: two or more forces acting on ONE object that sum to zero (equilibrium, First Law). Action-reaction pairs: two forces acting on DIFFERENT objects that are equal and opposite (Third Law). Different concepts!"
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit4/third_law_misconceptions.png",
        "alt": "Diagrams correcting common misconceptions with proper force representations",
        "caption": "Common mistakes: Forces cancel (NO—different objects). Bigger object exerts bigger force (NO—always equal). Balanced forces = action-reaction (NO—different concepts)."
      }
    },
    {
      "section_title": "Third Law and Free-Body Diagrams",
      "introduction": "Understanding how action-reaction pairs relate to free-body diagrams prevents confusion and errors.",
      "key_concept": {
        "definition": "Action-reaction pairs appear on different free-body diagrams—one force on object A's FBD, the other force on object B's FBD. Never show both forces of an action-reaction pair on the same FBD (they act on different objects). When analyzing multi-object systems, draw separate FBD for each object; action-reaction pairs visible across different diagrams.",
        "context": "FBD shows forces acting ON one object. Action-reaction partner forces act ON different objects, so they go on different FBDs. This organization prevents mistakenly canceling action-reaction forces when calculating net force."
      },
      "principles": [
        {
          "principle": "One Force per FBD from Each Pair",
          "statement": "Each FBD shows only one member of each action-reaction pair—the force acting on that object. The partner force (acting on different object) appears on that other object's FBD.",
          "application": "When drawing FBD, include forces acting ON object. The forces object exerts (reaction partners) go on other objects' FBDs.",
          "example": "Box on table: Box's FBD shows normal from table (upward). Table's FBD shows push from box (downward). These are action-reaction pair, appearing on different FBDs."
        },
        {
          "principle": "Identifying Pairs Across FBDs",
          "statement": "When analyzing multiple connected objects, draw all FBDs. Action-reaction pairs appear as forces of equal magnitude, opposite direction, on different FBDs.",
          "application": "Look across FBDs to identify action-reaction pairs connecting objects.",
          "example": "Two boxes connected by rope: Box A's FBD shows tension pulling right. Box B's FBD shows tension pulling left. Equal magnitude tensions, opposite directions, different FBDs—action-reaction pair."
        },
        {
          "principle": "Don't Mix Up Balanced Forces and Action-Reaction",
          "statement": "On single FBD, forces may balance (equilibrium). These balanced forces are NOT action-reaction pairs (all act on same object). Action-reaction pairs always span two different FBDs.",
          "application": "Single FBD: balanced forces (if equilibrium). Multiple FBDs: action-reaction pairs connecting objects.",
          "example": "Book at rest: FBD shows gravity down, normal up (balanced, both on book). Separately: gravity on book (book's FBD) and gravity on Earth (Earth's FBD) are action-reaction pair across two FBDs."
        }
      ],
      "worked_examples": [
        {
          "title": "FBDs and Third Law for Connected Objects",
          "problem": "A 10 kg box (A) sits on a 15 kg box (B), which sits on the floor. Draw FBDs for both boxes and identify action-reaction pairs.",
          "step_by_step": [
            {
              "step": "FBD for Box A (top box)",
              "explanation": "Forces ON box A: (1) Gravity from Earth: $F_{g,A} = 10 \\times 9.8 = 98$ N downward. (2) Normal from box B pushing A up: $F_{B \\text{ on } A}$ upward. At rest, so $F_{B \\text{ on } A} = 98$ N (balances weight). FBD shows: two vertical arrows on box A, down (98 N gravity) and up (98 N normal from B)."
            },
            {
              "step": "FBD for Box B (bottom box)",
              "explanation": "Forces ON box B: (1) Gravity from Earth: $F_{g,B} = 15 \\times 9.8 = 147$ N downward. (2) Push from box A (on top): $F_{A \\text{ on } B}$ downward, magnitude 98 N (action-reaction partner to $F_{B \\text{ on } A}$). (3) Normal from floor: $F_{floor \\text{ on } B}$ upward. At rest: $F_{floor \\text{ on } B} = F_{g,B} + F_{A \\text{ on } B} = 147 + 98 = 245$ N. FBD shows: three arrows on box B, down (147 N gravity), down (98 N from A), up (245 N from floor)."
            },
            {
              "step": "Identify action-reaction pairs",
              "explanation": "Pair 1: Box B pushes A up with 98 N (on A's FBD) ↔ Box A pushes B down with 98 N (on B's FBD). Pair 2: Earth pulls A down with 98 N (on A's FBD) ↔ A pulls Earth up with 98 N (on Earth's FBD, not shown). Pair 3: Earth pulls B down with 147 N (on B's FBD) ↔ B pulls Earth up with 147 N (on Earth's FBD). Pair 4: Floor pushes B up with 245 N (on B's FBD) ↔ B pushes floor down with 245 N (on floor's FBD, not shown)."
            },
            {
              "step": "What's NOT an action-reaction pair",
              "explanation": "On box A's FBD: gravity (98 N down) and normal from B (98 N up) are balanced, but NOT action-reaction pair (both act on A, different types). On box B's FBD: all three forces act on B—none are action-reaction pairs with each other."
            }
          ],
          "final_answer": "Box A FBD: gravity 98 N down, normal 98 N up. Box B FBD: gravity 147 N down, push from A 98 N down, normal from floor 245 N up. Action-reaction pairs: B on A ↔ A on B (98 N), Earth on A ↔ A on Earth (98 N), Earth on B ↔ B on Earth (147 N), Floor on B ↔ B on floor (245 N). Pairs span different FBDs.",
          "concept_applied": "Each object's FBD shows forces ON that object. Action-reaction pairs identified across different FBDs (equal magnitude, opposite direction, acting on different objects)."
        }
      ],
      "image": {
        "src": "images/unit4/third_law_and_fbds.png",
        "alt": "Two side-by-side FBDs showing action-reaction pairs connecting the objects",
        "caption": "Action-reaction pairs span different FBDs. One force on object A's FBD, partner force on object B's FBD."
      }
    }
  ],
  "key_terms": [
    "Newton's Third Law",
    "Action-reaction pair",
    "Equal and opposite",
    "Different objects",
    "Simultaneous forces",
    "Interaction forces",
    "$\\vec{F}_{A \\text{ on } B} = -\\vec{F}_{B \\text{ on } A}$",
    "Propulsion",
    "Recoil",
    "Tension pair",
    "Normal force pair",
    "Gravitational pair"
  ],
  "summary": "Newton's Third Law states: For every action force, there is an equal and opposite reaction force. Precisely: When object A exerts force on object B, object B simultaneously exerts force on object A equal in magnitude and opposite in direction: $\\vec{F}_{A \\text{ on } B} = -\\vec{F}_{B \\text{ on } A}$. Characteristics of action-reaction pairs: (1) Equal magnitude—forces have exactly the same strength. (2) Opposite direction—forces point in exactly opposite directions. (3) Same type—both gravity, both normal force, both friction, etc. (4) Different objects—one force acts on object A, other acts on object B; they NEVER act on same object. (5) Simultaneous—both forces exist at exactly the same time, neither causes the other. Critical insight: action-reaction forces don't cancel because they act on different objects. Each object responds only to forces acting ON it, not forces it exerts. Net force on object A depends only on forces acting on A; forces A exerts on other objects don't affect A's motion (they affect those other objects' motion). Common action-reaction pairs: gravitational (Earth pulls object, object pulls Earth), normal (object pushes surface, surface pushes object), friction (surfaces exert friction on each other), tension (rope pulls object, object pulls rope). Applications: Walking (push ground back, ground pushes you forward), swimming (push water back, water pushes you forward), rocket propulsion (push gas backward, gas pushes rocket forward—works in vacuum), recoil (gun pushes bullet forward, bullet pushes gun backward), jumping (push ground down harder than weight, ground pushes you up harder than weight, net upward force accelerates you upward). Common misconceptions corrected: (1) Action and reaction are simultaneous, not sequential—neither causes the other. (2) Equal and opposite forces act on different objects, so they don't cancel—each object accelerates according to forces acting ON it. (3) Forces always equal regardless of object masses—truck on car equals car on truck in collision; unequal damage results from different masses giving different accelerations ($a = F/m$). (4) All forces come in pairs, including non-contact forces like gravity. (5) Balanced forces on one object are NOT action-reaction pairs—action-reaction pairs always act on different objects. Free-body diagrams: action-reaction pairs appear on different FBDs. Each FBD shows one member of each pair (force acting on that object); partner force appears on different object's FBD. Never show both members of action-reaction pair on same FBD. Third Law essential for understanding force interactions, solving multi-object problems, and explaining propulsion and locomotion."
}
