{
  "expanded_description": "Binomial probability is a discrete probability distribution that models the number of successes in a fixed number of independent trials, each with the same probability of success. This distribution appears throughout statistics, quality control, medicine, and everyday life. From coin flips to election polls to defect rates in manufacturing, understanding binomial probability allows us to calculate the likelihood of observing exactly k successes in n trials. The binomial probability formula combines the number of ways to achieve k successes (combinations) with the probability of success raised to the k power and the probability of failure raised to the n-k power.",
  "core_concept": {
    "principle": "For a binomial experiment with n independent trials, each having probability p of success and q = 1-p of failure, the probability of exactly k successes is: $P(X = k) = \\binom{n}{k} p^k q^{n-k}$, where $\\binom{n}{k} = \\frac{n!}{k!(n-k)!}$ counts the number of ways to arrange k successes among n trials.",
    "explanation": "Think of binomial probability as answering the question: 'What's the chance of getting exactly k heads when flipping n coins?' The formula has three parts working together. First, $\\binom{n}{k}$ counts all the different ways you could get those k successes (like which specific coins come up heads). Second, $p^k$ is the probability that the k success trials actually succeed. Third, $q^{n-k}$ is the probability that the remaining n-k trials fail. Multiplying these together gives the probability for any specific arrangement, and multiplying by the number of arrangements gives the total probability.",
    "image": {
      "src": "images/unit9/binomial_formula_visual.png",
      "alt": "Tree diagram showing binomial outcomes with branches for success and failure, highlighting one path with k successes. Formula displayed: P(X=k) = C(n,k) p^k q^(n-k).",
      "caption": "Binomial Probability Formula: $P(X = k) = \\binom{n}{k} p^k (1-p)^{n-k}$."
    }
  },
  "sections": [
    {
      "section_title": "Characteristics of a Binomial Experiment",
      "introduction": "Before applying the binomial formula, we must verify that the situation meets the four conditions of a binomial experiment. Understanding these conditions prevents misapplication of the formula to situations that don't fit.",
      "key_concept": {
        "definition": "A binomial experiment has four defining characteristics: (1) There is a fixed number of trials, n. (2) Each trial has only two possible outcomes: success or failure. (3) The probability of success, p, is the same for every trial. (4) The trials are independent, meaning the outcome of one trial does not affect the outcome of any other trial.",
        "context": "These conditions ensure that the binomial formula applies. When trials are not independent (like drawing cards without replacement) or when the probability changes between trials, other distributions like the hypergeometric distribution must be used instead."
      },
      "classifications": [
        {
          "type": "Fixed Number of Trials",
          "value": "n is predetermined",
          "characteristics": [
            "The experiment is repeated a specific number of times",
            "You know in advance how many trials will occur",
            "Example: flipping a coin 10 times (n=10 is fixed beforehand)"
          ],
          "image": {
            "src": "images/unit9/binomial_fixed_trials.png",
            "alt": "Calendar showing 10 scheduled coin flips.",
            "caption": "Fixed number of trials: n is set before the experiment begins."
          },
          "examples": [
            {
              "process": "Testing 20 light bulbs from a production line",
              "explanation": "You decide ahead of time to test exactly 20 bulbs. This fixes n=20 regardless of how many are defective."
            },
            {
              "process": "Surveying 100 randomly selected voters",
              "explanation": "You plan to interview exactly 100 people. The sample size n=100 is fixed before data collection."
            }
          ]
        },
        {
          "type": "Two Possible Outcomes",
          "value": "Each trial is binary",
          "characteristics": [
            "Each trial results in either success or failure",
            "Success and failure are mutually exclusive and exhaustive",
            "Example: coin flip yields heads (success) or tails (failure)"
          ],
          "image": {
            "src": "images/unit9/binomial_two_outcomes.png",
            "alt": "Light bulb that either works or doesn't work.",
            "caption": "Two outcomes: each trial is a success or failure."
          },
          "examples": [
            {
              "process": "Quality control testing",
              "explanation": "A product either passes inspection (success) or fails inspection (failure). There is no third outcome."
            },
            {
              "process": "Medical treatment",
              "explanation": "A patient either responds to treatment (success) or does not respond (failure)."
            }
          ]
        },
        {
          "type": "Constant Probability of Success",
          "value": "p remains the same for all trials",
          "characteristics": [
            "The chance of success doesn't change from trial to trial",
            "This is often ensured by identical conditions or sampling with replacement",
            "Example: probability of heads on a fair coin is always 0.5"
          ],
          "image": {
            "src": "images/unit9/binomial_constant_p.png",
            "alt": "Graph showing constant probability line across trials.",
            "caption": "Constant probability: p is the same for every trial."
          },
          "examples": [
            {
              "process": "Rolling a die repeatedly",
              "explanation": "The probability of rolling a 6 is always $\\frac{1}{6}$ on every roll, assuming the die is fair."
            },
            {
              "process": "Drawing cards with replacement",
              "explanation": "When you replace the card after each draw, the probability of drawing an ace remains $\\frac{4}{52}$ for every draw."
            }
          ]
        },
        {
          "type": "Independent Trials",
          "value": "Outcomes do not influence each other",
          "characteristics": [
            "What happens in one trial has no effect on other trials",
            "Independence is often ensured by random sampling with replacement or by the nature of the process",
            "Example: coin flips are independent"
          ],
          "image": {
            "src": "images/unit9/binomial_independent.png",
            "alt": "Separate coin flips with arrows showing no connection between them.",
            "caption": "Independent trials: each outcome stands alone."
          },
          "examples": [
            {
              "process": "Surveying different people",
              "explanation": "One person's opinion does not influence another person's opinion when respondents are randomly selected."
            },
            {
              "process": "Testing items from a large population",
              "explanation": "When sampling from a very large population without replacement, the trials are approximately independent because removing one item barely changes the population."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Binomial Experiments",
          "problem": "Determine whether each situation describes a binomial experiment. If not, explain which condition is violated. a) Rolling a fair die 10 times and counting the number of times a 6 appears. b) Drawing 5 cards without replacement from a deck and counting the number of aces. c) Asking 50 randomly selected people whether they support a political candidate, where support is recorded as yes or no. d) Flipping a coin until you get 3 heads and recording the total number of flips.",
          "step_by_step": [
            {
              "step": "Part a: Rolling a die 10 times",
              "explanation": "This IS a binomial experiment. There is a fixed number of trials (n=10). Each trial has two outcomes (6 or not 6). The probability of success is constant ($p=\\frac{1}{6}$ for each roll). The trials are independent because each die roll does not affect the next."
            },
            {
              "step": "Part b: Drawing 5 cards without replacement",
              "explanation": "This is NOT a binomial experiment. The trials are not independent because drawing a card without replacement changes the composition of the deck. Also, the probability of success changes after each draw. For example, the probability of drawing an ace on the first draw is $\\frac{4}{52}$, but if the first card is an ace, the probability on the second draw becomes $\\frac{3}{51}$. This violates both the independence and constant probability conditions."
            },
            {
              "step": "Part c: Surveying 50 people",
              "explanation": "This IS a binomial experiment (approximately). There is a fixed number of trials (n=50). Each trial has two outcomes (support or not support). The probability of support is assumed constant for all respondents. The trials are independent if respondents are randomly selected and their opinions do not influence each other."
            },
            {
              "step": "Part d: Flipping until 3 heads",
              "explanation": "This is NOT a binomial experiment because the number of trials is not fixed. You continue flipping until a condition is met, so n is random. This is actually a negative binomial or geometric situation, not binomial."
            }
          ],
          "image": {
            "src": "images/unit9/binomial_identification.png",
            "alt": "Four scenarios with checkmarks and X marks showing binomial vs non-binomial.",
            "caption": "Identifying Binomial Experiments: Check all four conditions."
          },
          "final_answer": "a) Binomial, b) Not binomial (dependent trials, changing probability), c) Binomial (approximately), d) Not binomial (n not fixed)",
          "concept_applied": "Always verify the four conditions before using the binomial formula."
        }
      ],
      "image": {
        "src": "images/unit9/binomial_conditions.png",
        "alt": "Four icons representing fixed n, two outcomes, constant p, independent trials.",
        "caption": "The Four Conditions for a Binomial Experiment."
      }
    },
    {
      "section_title": "The Binomial Probability Formula",
      "introduction": "Once we have confirmed that a situation meets the binomial conditions, we can calculate exact probabilities using the binomial formula. This formula combines counting with probability multiplication.",
      "key_concept": {
        "definition": "For a binomial random variable X representing the number of successes in n trials, with success probability p and failure probability q = 1-p, the probability of exactly k successes is: $P(X = k) = \\binom{n}{k} p^k q^{n-k}$ for k = 0, 1, 2, ..., n.",
        "context": "The formula works because there are $\\binom{n}{k}$ different sequences that contain exactly k successes. Each specific sequence has probability $p^k q^{n-k}$ because the k successes each contribute factor p and the n-k failures each contribute factor q. Since these sequences are mutually exclusive, we add their probabilities, which is equivalent to multiplying the number of sequences by the probability of any one sequence."
      },
      "process_flow": [
        {
          "step": "1",
          "process": "Identify n, p, and k",
          "description": "Determine the number of trials (n), the probability of success on a single trial (p), and the number of successes you are interested in (k).",
          "mechanism": "Read the problem carefully. n is usually given as the sample size or number of trials. p may be given as a fraction, decimal, or percentage. k is the specific number of successes you want the probability for.",
          "result": "Values for n, p, and k.",
          "applications": [
            "Flipping a coin 10 times, probability of exactly 6 heads: n=10, p=0.5, k=6",
            "Testing 20 light bulbs with 5% defect rate, probability of exactly 2 defects: n=20, p=0.05, k=2",
            "Surveying 100 voters with 60% support, probability of exactly 70 supporters: n=100, p=0.6, k=70"
          ]
        },
        {
          "step": "2",
          "process": "Calculate the binomial coefficient",
          "description": "Compute $\\binom{n}{k} = \\frac{n!}{k!(n-k)!}$, which counts the number of ways to arrange k successes among n trials.",
          "mechanism": "Use factorial calculations or a calculator's nCr function. For large n, calculators are essential.",
          "result": "$\\binom{n}{k}$ as a number.",
          "applications": [
            "$\\binom{10}{6} = 210$ ways to get 6 heads in 10 flips",
            "$\\binom{20}{2} = 190$ ways to have exactly 2 defective bulbs",
            "$\\binom{100}{70}$ is a very large number best left to calculators"
          ]
        },
        {
          "step": "3",
          "process": "Calculate $p^k$",
          "description": "Raise the success probability to the kth power.",
          "mechanism": "Multiply p by itself k times, or use the power function on a calculator.",
          "result": "$p^k$.",
          "applications": [
            "$0.5^6 = 0.015625$ for 6 heads",
            "$0.05^2 = 0.0025$ for 2 defects",
            "$0.6^{70}$ is extremely small and requires a calculator"
          ]
        },
        {
          "step": "4",
          "process": "Calculate $q^{n-k}$",
          "description": "Compute $q = 1-p$, then raise it to the power of the number of failures, $n-k$.",
          "mechanism": "First find q, then use the power function.",
          "result": "$q^{n-k}$.",
          "applications": [
            "$q = 0.5$, $0.5^{4} = 0.0625$ for the 4 tails when getting 6 heads",
            "$q = 0.95$, $0.95^{18} \\approx 0.397$ for the 18 non-defective bulbs when getting 2 defects",
            "$q = 0.4$, $0.4^{30}$ is very small"
          ]
        },
        {
          "step": "5",
          "process": "Multiply everything together",
          "description": "$P(X = k) = \\binom{n}{k} \\times p^k \\times q^{n-k}$",
          "mechanism": "Multiply the three numbers you computed.",
          "result": "The probability of exactly k successes.",
          "applications": [
            "$P(6\\text{ heads}) = 210 \\times 0.015625 \\times 0.0625 = 210 \\times 0.0009765625 = 0.205078125$",
            "$P(2\\text{ defects}) = 190 \\times 0.0025 \\times 0.397 \\approx 190 \\times 0.0009925 = 0.188575$",
            "$P(70\\text{ supporters})$ requires calculator for full precision"
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Basic Binomial Probability Calculation",
          "problem": "A fair coin is flipped 8 times. What is the probability of getting exactly 5 heads?",
          "step_by_step": [
            {
              "step": "Identify n, p, and k",
              "explanation": "n = 8 (8 flips), p = 0.5 (fair coin), k = 5 (exactly 5 heads)"
            },
            {
              "step": "Calculate the binomial coefficient",
              "explanation": "$\\binom{8}{5} = \\frac{8!}{5!3!} = \\frac{8 \\times 7 \\times 6}{3 \\times 2 \\times 1} = \\frac{336}{6} = 56$"
            },
            {
              "step": "Calculate $p^k$",
              "explanation": "$0.5^5 = 0.03125$"
            },
            {
              "step": "Calculate $q^{n-k}$",
              "explanation": "$q = 1 - 0.5 = 0.5$, and $n-k = 3$, so $0.5^3 = 0.125$"
            },
            {
              "step": "Multiply",
              "explanation": "$P(X = 5) = 56 \\times 0.03125 \\times 0.125 = 56 \\times 0.00390625 = 0.21875$"
            }
          ],
          "image": {
            "src": "images/unit9/binomial_coin_flips.png",
            "alt": "Tree diagram for 8 coin flips with 5 heads path highlighted.",
            "caption": "Probability of exactly 5 heads in 8 flips: 0.21875."
          },
          "final_answer": "$0.21875$ or $\\frac{7}{32}$",
          "concept_applied": "The binomial formula combines counting with probability multiplication."
        },
        {
          "title": "Binomial Probability with Small p",
          "problem": "A manufacturing process produces defective items at a rate of 3%. If 15 items are randomly selected, what is the probability that exactly 2 are defective?",
          "step_by_step": [
            {
              "step": "Identify n, p, and k",
              "explanation": "n = 15, p = 0.03, k = 2"
            },
            {
              "step": "Calculate the binomial coefficient",
              "explanation": "$\\binom{15}{2} = \\frac{15!}{2!13!} = \\frac{15 \\times 14}{2 \\times 1} = \\frac{210}{2} = 105$"
            },
            {
              "step": "Calculate $p^k$",
              "explanation": "$0.03^2 = 0.0009$"
            },
            {
              "step": "Calculate $q^{n-k}$",
              "explanation": "$q = 1 - 0.03 = 0.97$, and $n-k = 13$, so $0.97^{13}$ needs a calculator. $0.97^{13} \\approx 0.6730$"
            },
            {
              "step": "Multiply",
              "explanation": "$P(X = 2) = 105 \\times 0.0009 \\times 0.6730 = 105 \\times 0.0006057 = 0.0636$"
            }
          ],
          "image": {
            "src": "images/unit9/binomial_defects.png",
            "alt": "15 items with 2 defective ones highlighted.",
            "caption": "Probability of exactly 2 defects in 15 items with 3% defect rate: 0.0636."
          },
          "final_answer": "$0.0636$",
          "concept_applied": "When p is small, the probability of many successes becomes very small."
        },
        {
          "title": "Binomial Probability with Large n",
          "problem": "According to a poll, 60% of voters support a particular candidate. If 20 voters are randomly selected, what is the probability that exactly 12 support the candidate?",
          "step_by_step": [
            {
              "step": "Identify n, p, and k",
              "explanation": "n = 20, p = 0.6, k = 12"
            },
            {
              "step": "Calculate the binomial coefficient",
              "explanation": "$\\binom{20}{12} = \\binom{20}{8} = \\frac{20!}{12!8!}$. Using calculator: $\\binom{20}{12} = 125,970$"
            },
            {
              "step": "Calculate $p^k$",
              "explanation": "$0.6^{12}$ using calculator: $0.6^{12} \\approx 0.002176$"
            },
            {
              "step": "Calculate $q^{n-k}$",
              "explanation": "$q = 1 - 0.6 = 0.4$, and $n-k = 8$, so $0.4^8 = 0.00065536$"
            },
            {
              "step": "Multiply",
              "explanation": "$P(X = 12) = 125,970 \\times 0.002176 \\times 0.00065536$ <br> First: $125,970 \\times 0.002176 \\approx 274.1$ <br> Then: $274.1 \\times 0.00065536 \\approx 0.1797$"
            }
          ],
          "image": {
            "src": "images/unit9/binomial_poll.png",
            "alt": "20 voters with 12 supporting the candidate.",
            "caption": "Probability of exactly 12 supporters in 20 voters with 60% support: 0.1797."
          },
          "final_answer": "$0.1797$",
          "concept_applied": "For large n, calculators are essential for accurate computation."
        }
      ],
      "image": {
        "src": "images/unit9/binomial_formula_breakdown.png",
        "alt": "Binomial formula broken into three parts: combinations, p^k, q^(n-k).",
        "caption": "Binomial Formula Components: $\\binom{n}{k}$, $p^k$, and $(1-p)^{n-k}$."
      }
    },
    {
      "section_title": "Cumulative Binomial Probabilities",
      "introduction": "Often we need probabilities like at most k successes or at least k successes. These cumulative probabilities can be found by summing individual binomial probabilities for the relevant values of k.",
      "key_concept": {
        "definition": "The cumulative distribution function gives $P(X \\leq k) = \\sum_{i=0}^{k} \\binom{n}{i} p^i (1-p)^{n-i}$. Probabilities like $P(X \\geq k)$ can be found as $1 - P(X \\leq k-1)$ or by direct summation.",
        "context": "Cumulative probabilities are essential in hypothesis testing, quality control limits, and determining whether observed results are unusual. Many calculators have built-in functions for binomial cumulative probabilities."
      },
      "process_flow": [
        {
          "step": "1",
          "process": "Identify the type of cumulative probability needed",
          "description": "Determine whether you need $P(X \\leq k)$, $P(X < k)$, $P(X \\geq k)$, or $P(X > k)$.",
          "mechanism": "Read the problem carefully. At most k means $P(X \\leq k)$. Less than k means $P(X \\leq k-1)$. At least k means $P(X \\geq k)$. More than k means $P(X \\geq k+1)$.",
          "result": "Clear statement of what to compute.",
          "applications": [
            "At most 3 defective items: $P(X \\leq 3)$",
            "At least 8 correct answers: $P(X \\geq 8)$",
            "Fewer than 5 successes: $P(X \\leq 4)$"
          ]
        },
        {
          "step": "2",
          "process": "For $P(X \\leq k)$",
          "description": "Sum the binomial probabilities for i = 0 to k.",
          "mechanism": "$P(X \\leq k) = \\sum_{i=0}^{k} \\binom{n}{i} p^i (1-p)^{n-i}$",
          "result": "Cumulative probability.",
          "applications": [
            "For n=10, p=0.5, $P(X \\leq 3) = P(0) + P(1) + P(2) + P(3)$"
          ]
        },
        {
          "step": "3",
          "process": "For $P(X \\geq k)$",
          "description": "Use $P(X \\geq k) = 1 - P(X \\leq k-1)$ or sum from i=k to n.",
          "mechanism": "The complement method is often easier when k is small.",
          "result": "Cumulative probability.",
          "applications": [
            "$P(X \\geq 8) = 1 - P(X \\leq 7)$"
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "At Most Probability",
          "problem": "A multiple-choice test has 10 questions, each with 4 options. If a student guesses randomly on every question, what is the probability of getting at most 2 correct answers?",
          "step_by_step": [
            {
              "step": "Identify parameters",
              "explanation": "n = 10, p = 0.25 (1 correct out of 4 options), we need $P(X \\leq 2)$"
            },
            {
              "step": "Calculate $P(X = 0)$",
              "explanation": "$\\binom{10}{0} (0.25)^0 (0.75)^{10} = 1 \\times 1 \\times 0.75^{10} = 0.0563$"
            },
            {
              "step": "Calculate $P(X = 1)$",
              "explanation": "$\\binom{10}{1} (0.25)^1 (0.75)^9 = 10 \\times 0.25 \\times 0.75^9$ <br> $0.75^9 \\approx 0.0751$, so $10 \\times 0.25 \\times 0.0751 = 10 \\times 0.018775 = 0.18775$"
            },
            {
              "step": "Calculate $P(X = 2)$",
              "explanation": "$\\binom{10}{2} = 45$, $0.25^2 = 0.0625$, $0.75^8 \\approx 0.1001$ <br> $45 \\times 0.0625 \\times 0.1001 = 45 \\times 0.00625625 = 0.2815$"
            },
            {
              "step": "Sum",
              "explanation": "$P(X \\leq 2) = 0.0563 + 0.1878 + 0.2815 = 0.5256$"
            }
          ],
          "image": {
            "src": "images/unit9/binomial_at_most.png",
            "alt": "Probability bars for k=0,1,2 summed to show cumulative.",
            "caption": "Probability of at most 2 correct answers when guessing: 0.5256."
          },
          "final_answer": "$0.5256$",
          "concept_applied": "At most k means sum probabilities from 0 to k."
        },
        {
          "title": "At Least Probability",
          "problem": "A drug is effective 80% of the time. If 15 patients are treated, what is the probability that at least 12 experience improvement?",
          "step_by_step": [
            {
              "step": "Identify parameters",
              "explanation": "n = 15, p = 0.8, we need $P(X \\geq 12)$"
            },
            {
              "step": "Use complement",
              "explanation": "$P(X \\geq 12) = 1 - P(X \\leq 11)$"
            },
            {
              "step": "Calculate $P(X \\leq 11)$",
              "explanation": "This requires summing probabilities for k = 0 to 11. Using a calculator or binomial tables, $P(X \\leq 11) \\approx 0.3518$"
            },
            {
              "step": "Compute final probability",
              "explanation": "$P(X \\geq 12) = 1 - 0.3518 = 0.6482$"
            }
          ],
          "image": {
            "src": "images/unit9/binomial_at_least.png",
            "alt": "Shaded region for k >= 12, with complement region for k <= 11.",
            "caption": "At least 12 successes: use complement of 0 to 11."
          },
          "final_answer": "$0.6482$",
          "concept_applied": "At least k can be found using complement when k is large."
        }
      ],
      "image": {
        "src": "images/unit9/binomial_cumulative.png",
        "alt": "Binomial probability histogram with cumulative region shaded.",
        "caption": "Cumulative Probabilities: Summing individual probabilities."
      }
    },
    {
      "section_title": "Mean and Standard Deviation of Binomial Distribution",
      "introduction": "The binomial distribution has simple formulas for its mean (expected value) and standard deviation, which describe the center and spread of the distribution.",
      "key_concept": {
        "definition": "For a binomial random variable X with parameters n and p, the mean (expected value) is $\\mu = np$, and the standard deviation is $\\sigma = \\sqrt{np(1-p)}$.",
        "context": "These formulas tell us what to expect on average and how much variation to expect around that average. For example, if you flip a fair coin 100 times, you expect 50 heads on average, with a standard deviation of $\\sqrt{100 \\times 0.5 \\times 0.5} = \\sqrt{25} = 5$ heads."
      },
      "process_flow": [
        {
          "step": "1",
          "process": "Calculate the mean",
          "description": "$\\mu = n \\times p$",
          "mechanism": "Multiply the number of trials by the probability of success.",
          "result": "Expected number of successes.",
          "applications": [
            "100 coin flips: $\\mu = 100 \\times 0.5 = 50$ expected heads",
            "20 items with 5% defect rate: $\\mu = 20 \\times 0.05 = 1$ expected defect"
          ]
        },
        {
          "step": "2",
          "process": "Calculate the standard deviation",
          "description": "$\\sigma = \\sqrt{n \\times p \\times (1-p)}$",
          "mechanism": "Multiply n, p, and (1-p), then take the square root.",
          "result": "Measure of spread around the mean.",
          "applications": [
            "100 coin flips: $\\sigma = \\sqrt{100 \\times 0.5 \\times 0.5} = \\sqrt{25} = 5$",
            "20 items with 5% defect rate: $\\sigma = \\sqrt{20 \\times 0.05 \\times 0.95} = \\sqrt{0.95} \\approx 0.975$"
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Mean and Standard Deviation",
          "problem": "A basketball player makes 70% of her free throws. If she takes 12 free throws in a game, find the mean and standard deviation of the number of shots she makes.",
          "step_by_step": [
            {
              "step": "Identify parameters",
              "explanation": "n = 12, p = 0.7"
            },
            {
              "step": "Calculate the mean",
              "explanation": "$\\mu = 12 \\times 0.7 = 8.4$ shots"
            },
            {
              "step": "Calculate the standard deviation",
              "explanation": "$\\sigma = \\sqrt{12 \\times 0.7 \\times 0.3} = \\sqrt{12 \\times 0.21} = \\sqrt{2.52} \\approx 1.587$ shots"
            }
          ],
          "image": {
            "src": "images/unit9/binomial_mean_sd.png",
            "alt": "Normal curve overlaid on binomial distribution showing mean and spread.",
            "caption": "Mean = 8.4, Standard Deviation ≈ 1.587."
          },
          "final_answer": "$\\mu = 8.4$, $\\sigma \\approx 1.587$",
          "concept_applied": "The mean tells us the expected number of successes; the standard deviation tells us how much variation to expect."
        }
      ],
      "image": {
        "src": "images/unit9/binomial_mean_sd_formulas.png",
        "alt": "Formulas: μ = np, σ = √(np(1-p)).",
        "caption": "Mean and Standard Deviation of Binomial Distribution."
      }
    },
    {
      "section_title": "Common Mistakes and How to Avoid Them",
      "introduction": "Binomial probability problems have several common pitfalls. Understanding these will help you apply the formula correctly.",
      "classifications": [
        {
          "type": "Confusing p and q",
          "value": "Using the wrong probability for success or failure",
          "characteristics": [
            "Using p when the problem asks for probability of failure",
            "Swapping p and q in the exponents"
          ],
          "behavior": "The probability calculation is completely wrong, often giving very different results.",
          "image": {
            "src": "images/unit9/mistake_p_vs_q.png",
            "alt": "Correct: P(success) uses p, P(failure) uses q. Incorrect: mixing them up.",
            "caption": "Clearly identify which outcome is success and which is failure."
          },
          "examples": [
            {
              "process": "Probability of exactly 2 defective items when defect rate is 5%",
              "explanation": "Mistake: Using p=0.95 for success. Correct: p=0.05 for defective (success if counting defects), q=0.95."
            }
          ],
          "note": "Solution: Define success clearly before starting. Write down: 'Success = [event we're counting]' and record p accordingly."
        },
        {
          "type": "Forgetting the Binomial Coefficient",
          "value": "Using $p^k q^{n-k}$ without multiplying by $\\binom{n}{k}$",
          "characteristics": [
            "Calculating $0.5^5 \\times 0.5^3 = 0.0039$ for 5 heads in 8 flips",
            "Not accounting for the different arrangements of successes"
          ],
          "behavior": "Probability is too small by a factor of $\\binom{n}{k}$; you're only calculating the probability of one specific sequence.",
          "image": {
            "src": "images/unit9/mistake_no_combination.png",
            "alt": "Correct: multiply by number of arrangements. Incorrect: only one sequence.",
            "caption": "The binomial coefficient counts all the different ways to get k successes."
          },
          "examples": [
            {
              "process": "5 heads in 8 coin flips",
              "explanation": "Mistake: $0.5^5 \\times 0.5^3 = 0.0039$. Correct: $\\binom{8}{5} \\times 0.5^5 \\times 0.5^3 = 56 \\times 0.0039 = 0.21875$."
            }
          ],
          "note": "Solution: Always include $\\binom{n}{k}$. Remember that there are many ways to arrange the successes, and the formula accounts for all of them."
        },
        {
          "type": "Misidentifying n in Cumulative Problems",
          "value": "Using the wrong upper or lower limit in cumulative sums",
          "characteristics": [
            "For at most 5, summing k=0 to 5 is correct; mistake would be summing 0 to 4 or 1 to 5",
            "For at least 8, using $1 - P(X \\leq 7)$ is correct; mistake would be $1 - P(X \\leq 8)$"
          ],
          "behavior": "The probability is off by one term, which can significantly affect the result.",
          "image": {
            "src": "images/unit9/mistake_cumulative_limits.png",
            "alt": "At most 5 includes 5; less than 5 does not include 5.",
            "caption": "Pay attention to whether the boundary value is included."
          },
          "examples": [
            {
              "process": "At least 3 successes",
              "explanation": "Mistake: $1 - P(X \\leq 2)$ is correct. Mistake would be $1 - P(X \\leq 3)$ which gives at least 4."
            }
          ],
          "note": "Solution: Write
