{
  "topic": "Electrostatics",
  "unit_title": "Gauss' Law with Dielectrics: Electric Displacement and Bound Charges",
  "unit_number": "Unit 2.7",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Electricity & Magnetism",
  "duration": "3-4 hours",
  "difficulty_level": "advanced",
  "expanded_description": "This unit develops the modified form of Gauss's law for dielectric materials, introducing the electric displacement field D and accounting for bound charges arising from polarization. Students will learn to apply Gauss's law in dielectric systems, calculate bound charge distributions, and solve complex problems involving dielectric interfaces and multiple materials.",

  "learning_objectives": [
    "Apply Gauss's law with dielectrics using the electric displacement field D",
    "Calculate bound charge distributions in polarized dielectrics",
    "Solve for electric fields in systems with dielectric interfaces",
    "Relate D, E, and P fields through constitutive relations",
    "Analyze symmetric systems containing dielectric materials",
    "Solve boundary value problems with dielectric boundaries"
  ],

  "prerequisites": [
    "Mastery of standard Gauss's law in vacuum",
    "Understanding of dielectric polarization mechanisms",
    "Knowledge of bound vs free charge concepts",
    "Ability to calculate electric fields in symmetric systems",
    "Familiarity with vector calculus operations"
  ],

  "core_concept": {
    "principle": "Electric Displacement, Bound Charges, Modified Gauss's Law, Dielectric Interfaces, Boundary Conditions",
    "explanation": "In dielectric materials, Gauss's law must be modified to account for both free charges (which can move) and bound charges (arising from polarization). The electric displacement field D = ε₀E + P depends only on free charges, providing a powerful tool for solving field problems in dielectric systems. The relationship between D, E, and P, along with boundary conditions at dielectric interfaces, enables complete analysis of complex dielectric configurations.",
    "image": {
      "url": "images/gauss-dielectrics-core.png",
      "alt": "Gauss dielectrics core concept",
      "caption": "Modified Gauss's law and field relationships in dielectric materials"
    }
  },

  "sections": [
    {
      "section_title": "1. Fundamental Concepts: D Field and Bound Charges",
      "introduction": "This section establishes the theoretical foundation for Gauss's law in dielectrics, introducing the electric displacement field D and developing methods to calculate bound charge distributions arising from polarization.",

      "key_concept": {
        "definition": "Electric Displacement D, Bound Charge Calculation, Polarization Charge, Modified Gauss Law, Free vs Bound Charge",
        "context": "The presence of dielectric materials requires extending electrostatic theory to account for polarization effects. The electric displacement field D provides a mathematical tool that depends only on free charges, while bound charges must be calculated from the polarization field P. Understanding these concepts enables systematic analysis of dielectric systems.",
        "image": {
          "url": "images/d-field-concepts.png",
          "alt": "D field concepts",
          "caption": "Electric displacement field and bound charge relationships"
        }
      },

      "classifications": [
        {
          "type": "Charge Types in Dielectrics",
          "value": "Different categories of charges in dielectric systems",
          "characteristics": [
            "Free charges: Mobile charges that can be added or removed",
            "Bound surface charges: Polarization charges at dielectric interfaces",
            "Bound volume charges: Non-uniform polarization within dielectrics",
            "External charges: Charges not part of the dielectric material",
            "Induced charges: On conductors adjacent to dielectrics",
            "Space charges: Trapped charges within dielectric bulk"
          ],
          "behavior": "Different charge types play distinct roles in dielectric systems. Free charges are controlled externally. Bound charges arise from polarization and depend on the electric field. The total electric field depends on all charge types, while D field depends only on free charges.",
          "examples": [
            {
              "process": "Surface Bound Charges",
              "explanation": "Polarization charges appearing at dielectric interfaces",
              "image": {
                "url": "images/surface-bound-charges.png",
                "alt": "Surface bound charges",
                "caption": "Bound surface charge formation at dielectric boundaries"
              }
            },
            {
              "process": "Volume Bound Charges",
              "explanation": "Bound charges arising from non-uniform polarization within dielectrics",
              "image": {
                "url": "images/volume-bound-charges.png",
                "alt": "Volume bound charges",
                "caption": "Volume bound charge density from polarization divergence"
              }
            }
          ],
          "note": "In uniformly polarized dielectrics, bound charges appear only at surfaces, not in the volume"
        }
      ],

      "principles": [
        {
          "principle": "Fundamental Concepts: D Field and Bound Charges",
          "statement": "Electric Displacement Field: D = ε₀E + P. Units: C/m² (same as polarization). For linear dielectrics: D = εE = κε₀E. Depends only on free charges. Modified Gauss's Law: ∮D·dA = Q_free,enc. Integral form emphasizes D depends only on free charge. Differential form: ∇·D = ρ_free. Bound Charge Calculations: Surface bound charge: σ_b = P·n̂. Volume bound charge: ρ_b = -∇·P. Total bound charge in volume: Q_b = -∮P·dA. For uniform P: ρ_b = 0, only surface charges. Field Relationships: E field depends on all charges: ∇·E = (ρ_free + ρ_b)/ε₀. P related to E by susceptibility: P = ε₀χ_eE. For linear dielectrics: χ_e = κ - 1. D field provides simplification: ∇·D = ρ_free independent of dielectric. Physical Interpretation: D field lines begin and end on free charges. E field lines begin and end on all charges. P field represents dipole moment density. Bound charges are manifestations of polarization.",
          "application": "Calculate D field using free charges only. Determine bound charge distributions from polarization. Solve for E field in dielectric systems. Analyze charge distributions in complex dielectric geometries. Apply modified Gauss's law to symmetric systems.",
          "example": "D field for point charge in dielectric. Bound charges on dielectric slab. Field in dielectric sphere with free charge. Interface problems with multiple dielectrics.",
          "analogy": "The D field is like tracking only the 'external water sources' (free charges) in a sponge system, while the E field accounts for all 'water' including what's 'absorbed in the sponge' (bound charges). The 'sponge's absorption' (polarization) creates 'internal water redistribution' (bound charges) that affects the actual 'water flow' (E field), but the 'external supply' (D field) only cares about what you put in from outside.",
          "image": {
            "url": "images/d-field-principles.png",
            "alt": "D field principles",
            "caption": "Fundamental principles of electric displacement and bound charges"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Point Charge in Infinite Dielectric",
          "problem": "A point charge Q is embedded in an infinite dielectric with constant κ. Find D, E, P fields and the bound charge distribution.",
          "step_by_step": [
            {
              "step": "D field from Gauss's law",
              "explanation": "By symmetry, D is radial. ∮D·dA = Q_free → D(4πr²) = Q → D = Q/(4πr²) r̂"
            },
            {
              "step": "E field from constitutive relation",
              "explanation": "D = εE = κε₀E → E = D/ε = Q/(4πκε₀r²) r̂"
            },
            {
              "step": "P field from relationship",
              "explanation": "P = D - ε₀E = Q/(4πr²) r̂ - ε₀[Q/(4πκε₀r²)] r̂ = Q/(4πr²)[1 - 1/κ] r̂"
            },
            {
              "step": "Bound volume charge",
              "explanation": "ρ_b = -∇·P = -∇·[Q(1-1/κ)/(4πr²) r̂] = 0 (since ∇·(r̂/r²) = 0 for r≠0)"
            },
            {
              "step": "Bound surface charge at origin",
              "explanation": "Total bound charge Q_b = -∮P·dA around charge = -lim(r→0) P(4πr²) = -Q(1-1/κ)"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Bound charge -Q(1-1/κ) surrounds point charge, reducing effective charge to Q/κ for E field calculation"
            }
          ],
          "final_answer": "D = Q/(4πr²) r̂, E = Q/(4πκε₀r²) r̂, P = Q(1-1/κ)/(4πr²) r̂. Total bound charge = -Q(1-1/κ) located around point charge.",
          "concept_applied": "Point charge in dielectric using modified Gauss's law",
          "image": {
            "url": "images/point-charge-dielectric.png",
            "alt": "Point charge dielectric",
            "caption": "Fields and bound charges for point charge in infinite dielectric"
          }
        },
        {
          "title": "Dielectric Slab in Uniform Field",
          "problem": "A dielectric slab with κ = 3 is placed in a uniform external field E₀ perpendicular to its faces. Find E, D, P inside the slab and the bound surface charges.",
          "step_by_step": [
            {
              "step": "D field continuity",
              "explanation": "At dielectric boundaries with no free surface charge, D_normal is continuous. Outside: D = ε₀E₀. Inside: D = ε₀E₀ (same as outside)"
            },
            {
              "step": "E field inside",
              "explanation": "D = εE inside → ε₀E₀ = κε₀E_inside → E_inside = E₀/κ = E₀/3"
            },
            {
              "step": "P field inside",
              "explanation": "P = ε₀(κ-1)E_inside = ε₀(2)(E₀/3) = (2/3)ε₀E₀"
            },
            {
              "step": "Bound surface charges",
              "explanation": "σ_b = P·n̂. On left face: n̂ points left, P points right → σ_b = -P = -(2/3)ε₀E₀. On right face: n̂ points right → σ_b = +P = +(2/3)ε₀E₀"
            },
            {
              "step": "Field reduction mechanism",
              "explanation": "Bound charges create opposing field E_bound = -σ_b/ε₀ = ∓(2/3)E₀, making net field E_inside = E₀ + E_bound = E₀ - (2/3)E₀ = E₀/3"
            },
            {
              "step": "Verification",
              "explanation": "Net field reduced by factor κ as expected for linear dielectric"
            }
          ],
          "final_answer": "Inside slab: D = ε₀E₀, E = E₀/3, P = (2/3)ε₀E₀. Bound charges: σ_b = ∓(2/3)ε₀E₀ on left/right faces.",
          "concept_applied": "Dielectric slab in uniform field with bound charge calculation",
          "image": {
            "url": "images/dielectric-slab-uniform-field.png",
            "alt": "Dielectric slab uniform field",
            "caption": "Field reduction and bound charges in dielectric slab"
          }
        },
        {
          "title": "Partially Filled Parallel Plate Capacitor",
          "problem": "A parallel plate capacitor has area A, plate separation d. A dielectric slab with κ and thickness t < d is inserted. Find capacitance and bound charges.",
          "step_by_step": [
            {
              "step": "Treat as series capacitors",
              "explanation": "Air gap: C_air = ε₀A/(d-t). Dielectric: C_diel = κε₀A/t"
            },
            {
              "step": "Equivalent capacitance",
              "explanation": "1/C = 1/C_air + 1/C_diel = (d-t)/(ε₀A) + t/(κε₀A) = [κ(d-t) + t]/(κε₀A) → C = κε₀A/[κ(d-t) + t]"
            },
            {
              "step": "D field from free charge",
              "explanation": "If free charge Q on plates, D = σ_free = Q/A (uniform throughout)"
            },
            {
              "step": "E fields in each region",
              "explanation": "In air: E_air = D/ε₀ = Q/(ε₀A). In dielectric: E_diel = D/ε = Q/(κε₀A)"
            },
            {
              "step": "Bound surface charges",
              "explanation": "At dielectric surfaces: σ_b = P = ε₀(κ-1)E_diel = ε₀(κ-1)Q/(κε₀A) = (κ-1)Q/(κA)"
            },
            {
              "step": "Voltage verification",
              "explanation": "V = E_air(d-t) + E_dielt = [Q/(ε₀A)](d-t) + [Q/(κε₀A)]t = Q/[ε₀A] × [d-t + t/κ] → C = Q/V = ε₀A/[d-t + t/κ] (matches above)"
            }
          ],
          "final_answer": "C = κε₀A/[κ(d-t) + t]. Bound surface charge density: σ_b = (κ-1)Q/(κA) on dielectric surfaces.",
          "concept_applied": "Partially filled capacitor with bound charge analysis",
          "image": {
            "url": "images/partially-filled-capacitor.png",
            "alt": "Partially filled capacitor",
            "caption": "Fields and bound charges in partially filled parallel plate capacitor"
          }
        }
      ]
    },
    {
      "section_title": "2. Advanced Applications and Boundary Value Problems",
      "introduction": "This section extends the application of Gauss's law with dielectrics to complex geometries, interface problems, and boundary value scenarios, developing systematic approaches for solving field problems in heterogeneous dielectric systems.",

      "key_concept": {
        "definition": "Dielectric Interfaces, Boundary Conditions, Spherical Symmetry, Cylindrical Symmetry, Multiple Regions, Interface Problems",
        "context": "Real-world dielectric systems often involve multiple materials with different dielectric constants, requiring careful application of boundary conditions at interfaces. The combination of Gauss's law for D with interface conditions provides a complete framework for solving field distributions in complex dielectric configurations with spherical, cylindrical, or planar symmetry.",
        "image": {
          "url": "images/advanced-dielectric-applications.png",
          "alt": "Advanced dielectric applications",
          "caption": "Complex dielectric systems and interface boundary conditions"
        }
      },

      "classifications": [
        {
          "type": "Dielectric System Symmetries",
          "value": "Different geometric symmetries in dielectric systems",
          "characteristics": [
            "Spherical symmetry: concentric dielectric shells or spheres",
            "Cylindrical symmetry: coaxial dielectric layers or cylinders",
            "Planar symmetry: parallel dielectric layers or slabs",
            "Azimuthal symmetry: dielectric objects with rotational symmetry",
            "Mixed symmetry: combinations of different symmetries",
            "No symmetry: requiring numerical solutions"
          ],
          "behavior": "Different symmetries enable different solution approaches. Spherical symmetry allows radial field solutions. Cylindrical symmetry gives 1/r field dependence. Planar symmetry yields constant fields in layers. Symmetry breaking requires more complex methods.",
          "examples": [
            {
              "process": "Spherical Dielectric Shell",
              "explanation": "Dielectric shell with point charge at center or free charge on surfaces",
              "image": {
                "url": "images/spherical-dielectric-shell.png",
                "alt": "Spherical dielectric shell",
                "caption": "Field distribution in spherical dielectric shell system"
              }
            },
            {
              "process": "Cylindrical Dielectric Interface",
              "explanation": "Coaxial cable with dielectric layers between conductors",
              "image": {
                "url": "images/cylindrical-dielectric.png",
                "alt": "Cylindrical dielectric",
                "caption": "Field solution in cylindrical dielectric system"
              }
            }
          ],
          "note": "At dielectric-dielectric interfaces with no free charge, D_normal is continuous while E_normal is discontinuous"
        }
      ],

      "principles": [
        {
          "principle": "Advanced Applications and Boundary Value Problems",
          "statement": "Boundary Conditions: Dielectric-dielectric interface: D₁_normal = D₂_normal (if no free surface charge). E₁_tangential = E₂_tangential (always). Dielectric-conductor interface: E_tangential = 0, D_normal = σ_free. Spherical Systems: Use spherical Gaussian surfaces. D radial for central symmetry. Fields: D ∝ 1/r², E = D/ε in each region. Bound charges at spherical interfaces. Cylindrical Systems: Use cylindrical Gaussian surfaces. D radial for axial symmetry. Fields: D ∝ 1/r, E = D/ε in each region. Bound charges at cylindrical interfaces. Planar Systems: Use pillbox Gaussian surfaces. D normal to interfaces constant in each region. E = D/ε in each region. Bound charges at planar interfaces. Multiple Regions: Solve sequentially using boundary conditions. Match solutions at each interface. Ensure field continuity conditions. Calculate bound charges from polarization. Numerical Approaches: Finite element methods for complex geometries. Boundary element methods for interface problems. Relaxation methods for nonlinear dielectrics.",
          "application": "Solve field problems in multi-dielectric systems. Apply boundary conditions at dielectric interfaces. Calculate bound charge distributions in complex geometries. Design dielectric systems for specific field distributions. Analyze capacitance in complex dielectric configurations.",
          "example": "Dielectric sphere in uniform field. Coaxial cable with dielectric layers. Multiple dielectric interfaces. Nonlinear dielectric problems.",
          "analogy": "Solving dielectric boundary problems is like analyzing water flow through different soil layers. Each 'soil type' (dielectric) has different 'permeability' (κ). The 'water flow rate' (D field) must be continuous across boundaries, but the 'water pressure gradient' (E field) changes according to each layer's properties. 'Surface effects' (bound charges) develop where different materials meet, affecting the local 'flow pattern' (field distribution).",
          "image": {
            "url": "images/advanced-applications-principles.png",
            "alt": "Advanced applications principles",
            "caption": "Principles for solving complex dielectric boundary value problems"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Dielectric Sphere in Uniform Field",
          "problem": "A dielectric sphere of radius R with dielectric constant κ is placed in a uniform electric field E₀. Find the field inside and outside the sphere.",
          "step_by_step": [
            {
              "step": "Outside field form",
              "explanation": "E_outside = E₀ + E_dipole (field due to polarized sphere)"
            },
            {
              "step": "Inside field",
              "explanation": "By symmetry, E_inside is uniform and parallel to E₀"
            },
            {
              "step": "Boundary conditions at r=R",
              "explanation": "D_r continuous: ε₀E_r,outside = κε₀E_r,inside. E_θ continuous: E_θ,outside = E_θ,inside"
            },
            {
              "step": "Field expressions",
              "explanation": "Outside: E_r = E₀cosθ + (2pcosθ)/(4πε₀r³), E_θ = -E₀sinθ + (psinθ)/(4πε₀r³). Inside: E_inside uniform"
            },
            {
              "step": "Apply boundary conditions",
              "explanation": "At r=R: ε₀[E₀cosθ + (2pcosθ)/(4πε₀R³)] = κε₀E_insidecosθ → E₀ + 2p/(4πε₀R³) = κE_inside. Also: -E₀ + p/(4πε₀R³) = -E_inside"
            },
            {
              "step": "Solve system",
              "explanation": "From second: p/(4πε₀R³) = E₀ - E_inside. Substitute into first: E₀ + 2(E₀ - E_inside) = κE_inside → 3E₀ - 2E_inside = κE_inside → E_inside = 3E₀/(κ+2)"
            },
            {
              "step": "Complete solution",
              "explanation": "E_inside = 3E₀/(κ+2), p = 4πε₀R³E₀(κ-1)/(κ+2), E_outside = E₀ + field of dipole p"
            }
          ],
          "final_answer": "Inside: uniform field E = 3E₀/(κ+2). Outside: E = E₀ + field of dipole with moment p = 4πε₀R³E₀(κ-1)/(κ+2).",
          "concept_applied": "Dielectric sphere in uniform field using boundary conditions",
          "image": {
            "url": "images/dielectric-sphere-uniform-field.png",
            "alt": "Dielectric sphere uniform field",
            "caption": "Field distribution for dielectric sphere in uniform external field"
          }
        },
        {
          "title": "Coaxial Cable with Dielectric Layers",
          "problem": "A coaxial cable has inner radius a, outer radius c, with two dielectric layers: κ₁ from a to b, κ₂ from b to c. Find capacitance per unit length and bound charges.",
          "step_by_step": [
            {
              "step": "D field from Gauss's law",
              "explanation": "By cylindrical symmetry, D = λ/(2πr) r̂, where λ is charge per unit length"
            },
            {
              "step": "E fields in each region",
              "explanation": "Region 1 (a<r<b): E₁ = D/(κ₁ε₀) = λ/(2πκ₁ε₀r). Region 2 (b<r<c): E₂ = λ/(2πκ₂ε₀r)"
            },
            {
              "step": "Voltage calculation",
              "explanation": "V = -∫_c^a E·dr = ∫_a^c E dr = ∫_a^b E₁ dr + ∫_b^c E₂ dr = [λ/(2πκ₁ε₀)]ln(b/a) + [λ/(2πκ₂ε₀)]ln(c/b)"
            },
            {
              "step": "Capacitance per unit length",
              "explanation": "C/L = λ/V = 2πε₀/[1/κ₁ ln(b/a) + 1/κ₂ ln(c/b)]"
            },
            {
              "step": "Bound charges at r=b",
              "explanation": "P₁ = ε₀(κ₁-1)E₁, P₂ = ε₀(κ₂-1)E₂. At interface: σ_b = P₁·n̂ - P₂·n̂ = P₁ - P₂ (since n̂ points outward from each dielectric)"
            },
            {
              "step": "Bound charge calculation",
              "explanation": "σ_b = ε₀(κ₁-1)λ/(2πκ₁ε₀b) - ε₀(κ₂-1)λ/(2πκ₂ε₀b) = λ/(2πb)[(κ₁-1)/κ₁ - (κ₂-1)/κ₂] = λ/(2πb)[1/κ₂ - 1/κ₁]"
            }
          ],
          "final_answer": "C/L = 2πε₀/[1/κ₁ ln(b/a) + 1/κ₂ ln(c/b)]. Bound charge at r=b: σ_b = λ/(2πb)(1/κ₂ - 1/κ₁) per unit length.",
          "concept_applied": "Coaxial cable with multiple dielectric layers",
          "image": {
            "url": "images/coaxial-dielectric-layers.png",
            "alt": "Coaxial dielectric layers",
            "caption": "Field and bound charge analysis in coaxial cable with dielectric layers"
          }
        },
        {
          "title": "Dielectric-Dielectric Interface with Free Charge",
          "problem": "Two dielectrics with κ₁ = 2 and κ₂ = 5 meet at a plane. A free surface charge density σ_free = 10 nC/m² exists at the interface. Find E and D fields on both sides.",
          "step_by_step": [
            {
              "step": "D field boundary condition",
              "explanation": "D₂_normal - D₁_normal = σ_free (discontinuous due to free charge)"
            },
            {
              "step": "E field tangential continuity",
              "explanation": "E₁_tangential = E₂_tangential"
            },
            {
              "step": "Assume normal incidence",
              "explanation": "If fields are perpendicular to interface, tangential components are zero"
            },
            {
              "step": "D field calculation",
              "explanation": "D₁ = D₂ = D (if no other information, but wait - boundary condition says D₂ - D₁ = σ_free)"
            },
            {
              "step": "Resolution",
              "explanation": "We need additional information. Most realistic: field is normal to interface. Then D₂ - D₁ = σ_free, but we don't know individual values."
            },
            {
              "step": "Additional constraint",
              "explanation": "If the system is symmetric or if we know potential difference, we could solve. With only given information, we can express relationship: D₂ = D₁ + σ_free, E₁ = D₁/κ₁ε₀, E₂ = (D₁ + σ_free)/κ₂ε₀"
            },
            {
              "step": "Typical scenario",
              "explanation": "In many problems, the free charge is on a conductor adjacent to dielectrics, which provides the missing constraint"
            }
          ],
          "final_answer": "With only given information: D₂ = D₁ + σ_free, E₁ = D₁/(2ε₀), E₂ = (D₁ + 10×10⁻⁹)/(5ε₀). Additional constraints needed for complete solution.",
          "concept_applied": "Dielectric interface with free surface charge",
          "image": {
            "url": "images/dielectric-interface-free-charge.png",
            "alt": "Dielectric interface free charge",
            "caption": "Fields at dielectric interface with free surface charge"
          }
        },
        {
          "title": "Spherical Capacitor with Dielectric Shell",
          "problem": "A spherical capacitor has inner radius a, outer radius c. A dielectric shell with κ from b to c (a < b < c) is inserted. Find capacitance and bound charges.",
          "step_by_step": [
            {
              "step": "D field from Gauss's law",
              "explanation": "D = Q/(4πr²) r̂ (by spherical symmetry)"
            },
            {
              "step": "E fields in each region",
              "explanation": "Air region (a<r<b): E_air = D/ε₀ = Q/(4πε₀r²). Dielectric region (b<r<c): E_diel = D/ε = Q/(4πκε₀r²)"
            },
            {
              "step": "Voltage calculation",
              "explanation": "V = ∫_a^c E·dr = ∫_a^b E_air dr + ∫_b^c E_diel dr = Q/(4πε₀)[1/a - 1/b] + Q/(4πκε₀)[1/b - 1/c]"
            },
            {
              "step": "Capacitance",
              "explanation": "C = Q/V = 4πε₀/[1/a - 1/b + 1/κ(1/b - 1/c)]"
            },
            {
              "step": "Bound charges",
              "explanation": "At r=b: σ_b = P·n̂ = ε₀(κ-1)E_diel = ε₀(κ-1)Q/(4πκε₀b²) = (κ-1)Q/(4πκb²). At r=c: σ_b = -P·n̂ = -(κ-1)Q/(4πκc²) (n̂ points outward)"
            },
            {
              "step": "Total bound charge",
              "explanation": "Q_b,total = σ_b(b)×4πb² + σ_b(c)×4πc² = (κ-1)Q/κ - (κ-1)Q/κ = 0 (as expected)"
            }
          ],
          "final_answer": "C = 4πε₀/[1/a - 1/b + (1/b - 1/c)/κ]. Bound charges: at r=b: σ_b = (κ-1)Q/(4πκb²), at r=c: σ_b = -(κ-1)Q/(4πκc²).",
          "concept_applied": "Spherical capacitor with dielectric shell using Gauss's law",
          "image": {
            "url": "images/spherical-capacitor-dielectric.png",
            "alt": "Spherical capacitor dielectric",
            "caption": "Spherical capacitor with dielectric shell and bound charges"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Electric displacement D",
    "Bound charges",
    "Free charges",
    "Modified Gauss's law",
    "Polarization charge",
    "Dielectric interface",
    "Boundary conditions",
    "Surface bound charge",
    "Volume bound charge",
    "Permittivity ε",
    "Susceptibility χ_e",
    "Interface conditions"
  ],

  "common_misconceptions": [
    "Thinking D field has physical reality like E field",
    "Believing bound charges can be measured directly",
    "Confusing free and bound charge boundary conditions",
    "Assuming D field is always continuous at interfaces",
    "Thinking polarization always creates volume bound charges",
    "Believing D field lines represent actual field lines",
    "Assuming all dielectric problems can be solved with D alone"
  ],

  "real_world_applications": [
    "Capacitor design with dielectric materials",
    "Coaxial cable insulation design",
    "Dielectric resonators in microwave circuits",
    "Insulation systems in high-voltage equipment",
    "Semiconductor device isolation",
    "Optical fiber cladding design",
    "Electromagnetic shielding materials",
    "Piezoelectric transducer design",
    "Dielectric waveguide systems",
    "Capacitive sensor design",
    "High-frequency circuit substrates",
    "Energy storage dielectric systems"
  ],

  "summary": "This unit has comprehensively developed the application of Gauss's law to dielectric systems, establishing the electric displacement field D as a powerful mathematical tool for solving field problems in the presence of dielectric materials. Through the analysis of bound charge distributions, interface boundary conditions, and complex multi-dielectric geometries, students have gained the ability to systematically solve electrostatic problems involving dielectric materials. The understanding of how to relate D, E, and P fields, apply boundary conditions at dielectric interfaces, and calculate bound charge effects provides essential foundation for work in electromagnetics, materials engineering, and electrical device design across numerous technological applications."
}
