{
  "expanded_description": "This section introduces explosions, which can be thought of as 'collisions in reverse.' In an explosion, an object initially at rest or in motion breaks apart into multiple fragments due to internal forces (such as a chemical reaction, spring release, or mechanical separation). The key physics principle is that momentum is conserved during an explosion because all forces involved are internal to the system. However, kinetic energy is not conserved; it increases dramatically as internal potential energy (chemical, elastic, etc.) is converted to kinetic energy of the fragments.",
  "core_concept": {
    "principle": "In an explosion, the total momentum of the system is conserved (in the absence of external forces). The total kinetic energy after the explosion is greater than before because internal potential energy is converted to kinetic energy. For an object initially at rest that explodes into fragments, the vector sum of the momenta of all fragments must be zero. For an object initially in motion, the total momentum after the explosion equals the initial momentum of the object.",
    "explanation": "Explosions are governed by the same physics as collisions, but the energy flow is reversed: instead of kinetic energy being lost to deformation and heat, internal energy is released, increasing the kinetic energy of the fragments. This is why explosions are often described as 'time‑reversed perfectly inelastic collisions.' The analysis relies on momentum conservation because the forces are internal; we do not need to know the details of the explosive force to determine the final motion of the fragments, only that momentum is conserved.",
    "image": {
      "src": "images/unit7/explosion_intro.png",
      "alt": "Diagram of an object at rest exploding into multiple fragments moving in different directions, with momentum vectors summing to zero",
      "caption": "In an explosion, the total momentum of the fragments equals the initial momentum of the object (zero if initially at rest)."
    }
  },
  "sections": [
    {
      "section_title": "Explosions",
      "introduction": "An explosion occurs when an object breaks apart into pieces due to internal forces. These forces can come from chemical reactions (like a firecracker), mechanical springs, or any other internal mechanism. Because all forces involved are internal to the system (the object and its fragments), the total momentum of the system is conserved during the explosion. However, the total kinetic energy increases dramatically as internal potential energy is converted to kinetic energy.",
      "key_concept": {
        "definition": "An explosion is a process in which an object separates into multiple fragments due to internal forces. In the absence of external forces, the total momentum of the system is conserved: $\\vec{P}_{\\text{initial}} = \\vec{P}_{\\text{final}}$. The total kinetic energy after the explosion is greater than before because internal energy (chemical, elastic, etc.) is converted to kinetic energy.",
        "context": "Explosions are common in both everyday life (firecrackers, airbags deploying) and physics problems (spring‑loaded devices, rocket propulsion, nuclear fission). The conservation of momentum principle allows us to relate the velocities of fragments without knowing the details of the explosive force."
      },
      "principles": [
        {
          "principle": "Momentum Conservation",
          "statement": "For an isolated system (no external forces), the total momentum before the explosion equals the total momentum after the explosion: $\\sum \\vec{p}_{\\text{initial}} = \\sum \\vec{p}_{\\text{final}}$.",
          "application": "If the object is initially at rest, the vector sum of the momenta of all fragments must be zero. If the object is initially moving, the total momentum of the fragments equals the initial momentum of the object.",
          "example": "A stationary firecracker explodes into several pieces. Since initial momentum is zero, the fragments must fly off in directions such that their vector momentum sum is zero."
        },
        {
          "principle": "Increase in Kinetic Energy",
          "statement": "The total kinetic energy after an explosion is greater than before. The increase comes from the conversion of internal potential energy (chemical, elastic, etc.) into kinetic energy. This is why explosions are dangerous – they release energy suddenly.",
          "application": "We cannot use energy conservation to find fragment velocities unless we know how much internal energy was released. Typically, we use momentum conservation and additional information (like the direction of one fragment or the energy released) to solve for unknowns.",
          "example": "A spring‑loaded device shoots two masses apart. The spring's potential energy converts to kinetic energy of the masses."
        },
        {
          "principle": "Relationship to Perfectly Inelastic Collisions",
          "statement": "An explosion is the reverse of a perfectly inelastic collision. In a perfectly inelastic collision, objects stick together and kinetic energy is lost. In an explosion, objects fly apart and kinetic energy is gained. Both processes conserve momentum.",
          "application": "If you run a perfectly inelastic collision backward in time, you get an explosion. This symmetry is often useful in problem‑solving.",
          "example": "A bullet embedding in a block (perfectly inelastic) run backward would show the bullet and block separating, with the block at rest and the bullet flying out – an explosion."
        }
      ],
      "classifications": [
        {
          "type": "Types of Explosion Problems",
          "value": "Common scenarios",
          "characteristics": [
            "Object initially at rest breaking into two or more fragments",
            "Object initially in motion breaking apart",
            "Spring‑loaded devices releasing stored energy",
            "Rockets expelling exhaust (continuous mini‑explosions)"
          ],
          "behavior": "In each case, momentum conservation provides the primary equation. Additional information (such as the direction of one fragment, the energy released, or the relative speeds) is needed to determine all unknowns.",
          "examples": [
            {
              "process": "Object at rest breaks into two pieces",
              "explanation": "$0 = m_1\\vec{v}_1 + m_2\\vec{v}_2$, so the pieces must move in opposite directions with momenta equal in magnitude."
            },
            {
              "process": "Object at rest breaks into three pieces",
              "explanation": "$0 = m_1\\vec{v}_1 + m_2\\vec{v}_2 + m_3\\vec{v}_3$; the vector sum of all momenta must be zero."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Explosion of a Stationary Object into Two Pieces",
          "problem": "A 5 kg object at rest explodes into two pieces. One piece of mass 2 kg flies off at 8 m/s to the east. What is the velocity of the other piece?",
          "step_by_step": [
            {
              "step": "Define positive direction",
              "explanation": "Let east be positive."
            },
            {
              "step": "Apply momentum conservation",
              "explanation": "Initial momentum = 0. After explosion: $m_1 v_1 + m_2 v_2 = 0$, where $m_1 = 2$ kg, $v_1 = +8$ m/s, $m_2 = 5 - 2 = 3$ kg, $v_2 = ?$"
            },
            {
              "step": "Solve for $v_2$",
              "explanation": "$2(8) + 3 v_2 = 0$ → $16 + 3v_2 = 0$ → $3v_2 = -16$ → $v_2 = -16/3 = -5.33$ m/s."
            },
            {
              "step": "Interpret",
              "explanation": "Negative means west. So the 3 kg piece moves at $5.33$ m/s west."
            }
          ],
          "final_answer": "$5.33$ m/s west",
          "concept_applied": "For an explosion from rest, the two fragments have equal and opposite momenta."
        },
        {
          "title": "Explosion of a Moving Object into Two Pieces",
          "problem": "A 10 kg object moving at 6 m/s east explodes into two pieces. A 4 kg piece continues east at 12 m/s. Find the velocity of the other piece.",
          "step_by_step": [
            {
              "step": "Define positive direction",
              "explanation": "Let east be positive. Initial momentum: $p_i = 10 \\times 6 = 60$ kg·m/s east."
            },
            {
              "step": "Mass of other piece",
              "explanation": "$m_2 = 10 - 4 = 6$ kg."
            },
            {
              "step": "Momentum conservation",
              "explanation": "$60 = 4(12) + 6 v_2 = 48 + 6v_2$ → $6v_2 = 60 - 48 = 12$ → $v_2 = 2$ m/s east."
            }
          ],
          "final_answer": "$2$ m/s east",
          "concept_applied": "For an explosion from a moving object, total momentum after equals initial momentum."
        },
        {
          "title": "Explosion into Three Pieces",
          "problem": "A 2 kg object at rest explodes into three pieces. A 0.5 kg piece flies off at 10 m/s at 30° north of east. A 0.8 kg piece flies off at 8 m/s at 60° south of east. Find the velocity (magnitude and direction) of the third piece.",
          "step_by_step": [
            {
              "step": "Set up coordinates",
              "explanation": "Let east be +x, north be +y."
            },
            {
              "step": "Momentum of first piece",
              "explanation": "$m_1 = 0.5$ kg, $v_1 = 10$ m/s at 30°: $p_{1x} = 0.5 \\times 10 \\cos30° = 5 \\times 0.8660 = 4.33$ kg·m/s\n$p_{1y} = 0.5 \\times 10 \\sin30° = 5 \\times 0.5 = 2.5$ kg·m/s"
            },
            {
              "step": "Momentum of second piece",
              "explanation": "$m_2 = 0.8$ kg, $v_2 = 8$ m/s at 60° south of east (so angle = -60°): $p_{2x} = 0.8 \\times 8 \\cos(-60°) = 6.4 \\times 0.5 = 3.2$ kg·m/s\n$p_{2y} = 0.8 \\times 8 \\sin(-60°) = 6.4 \\times (-0.8660) = -5.54$ kg·m/s"
            },
            {
              "step": "Mass of third piece",
              "explanation": "$m_3 = 2 - 0.5 - 0.8 = 0.7$ kg."
            },
            {
              "step": "Momentum conservation (total initial momentum = 0)",
              "explanation": "$p_{3x} + p_{1x} + p_{2x} = 0$ → $p_{3x} = - (4.33 + 3.2) = -7.53$ kg·m/s\n$p_{3y} + p_{1y} + p_{2y} = 0$ → $p_{3y} = - (2.5 - 5.54) = - (-3.04) = 3.04$ kg·m/s? Wait: $2.5 + (-5.54) = -3.04$, so $p_{3y} = -(-3.04) = 3.04$ kg·m/s."
            },
            {
              "step": "Velocity of third piece",
              "explanation": "$v_{3x} = p_{3x}/m_3 = -7.53 / 0.7 = -10.76$ m/s\n$v_{3y} = 3.04 / 0.7 = 4.34$ m/s"
            },
            {
              "step": "Magnitude and direction",
              "explanation": "$v_3 = \\sqrt{(-10.76)^2 + (4.34)^2} = \\sqrt{115.8 + 18.84} = \\sqrt{134.64} = 11.61$ m/s\n$\\theta = \\tan^{-1}(4.34 / 10.76) = \\tan^{-1}(0.403) = 22.0°$ north of west (since x negative, y positive)."
            }
          ],
          "final_answer": "$11.6$ m/s at $22.0°$ north of west",
          "concept_applied": "For a three‑piece explosion from rest, the vector sum of all momenta must be zero; solve component‑wise."
        },
        {
          "title": "Spring‑Loaded Explosion",
          "problem": "A 0.3 kg cart on a frictionless track is connected by a compressed spring to a 0.5 kg cart. The spring is released, and the carts fly apart. The 0.3 kg cart moves left at 2 m/s. What is the velocity of the 0.5 kg cart? How much elastic potential energy was stored in the spring?",
          "step_by_step": [
            {
              "step": "Momentum conservation",
              "explanation": "Initially at rest, total momentum = 0. After release: $0.3(-2) + 0.5 v_2 = 0$ → $-0.6 + 0.5 v_2 = 0$ → $0.5 v_2 = 0.6$ → $v_2 = 1.2$ m/s (right)."
            },
            {
              "step": "Find kinetic energies after release",
              "explanation": "$KE_1 = \\frac{1}{2}(0.3)(2^2) = 0.15 \\times 4 = 0.6$ J\n$KE_2 = \\frac{1}{2}(0.5)(1.2^2) = 0.25 \\times 1.44 = 0.36$ J\nTotal $KE_f = 0.96$ J."
            },
            {
              "step": "Initial energy was all spring potential energy",
              "explanation": "Initially, KE = 0, so spring PE = final KE = $0.96$ J."
            }
          ],
          "final_answer": "$v_2 = 1.2$ m/s right; spring energy = $0.96$ J",
          "concept_applied": "Spring potential energy converts to kinetic energy; momentum conservation gives velocities."
        }
      ],
      "image": {
        "src": "images/unit7/explosion_examples.png",
        "alt": "Diagrams of explosion scenarios: object breaking into two pieces, three pieces, spring‑loaded carts",
        "caption": "Explosion problems use momentum conservation to find fragment velocities; energy conservation (with initial potential energy) can supplement."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with explosions.",
      "classifications": [
        {
          "type": "Assuming Kinetic Energy is Conserved",
          "value": "Thinking that $KE_i = KE_f$ in an explosion",
          "characteristics": [
            "Writing energy conservation equations without accounting for internal energy release",
            "Not recognizing that KE increases"
          ],
          "behavior": "In an explosion, kinetic energy increases because internal potential energy is converted to kinetic energy. You cannot use $KE_i = KE_f$ unless you include the released energy as an initial term (e.g., $KE_i + PE_{\\text{internal}} = KE_f$).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student writes $0 = \\frac{1}{2}m_1v_1^2 + \\frac{1}{2}m_2v_2^2$ for an explosion from rest."
            },
            {
              "process": "Correct",
              "explanation": "Use momentum conservation to find velocities; the kinetic energy comes from internal energy."
            }
          ]
        },
        {
          "type": "Forgetting That Momentum is a Vector",
          "value": "Adding momenta as scalars, especially in 2D explosions",
          "characteristics": [
            "Using magnitudes in momentum sums",
            "Not breaking into components"
          ],
          "behavior": "Momentum conservation is a vector equation. For explosions from rest, the vector sum of all fragment momenta must be zero. Always work with components.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "For a three‑piece explosion from rest, student sets $m_1v_1 + m_2v_2 + m_3v_3 = 0$ using speeds, ignoring directions."
            },
            {
              "process": "Correct",
              "explanation": "Use $\\vec{p}_1 + \\vec{p}_2 + \\vec{p}_3 = 0$, so $p_{1x}+p_{2x}+p_{3x}=0$, $p_{1y}+p_{2y}+p_{3y}=0$."
            }
          ]
        },
        {
          "type": "Incorrectly Applying Signs in 1D",
          "value": "Not using correct signs for velocities in momentum equations",
          "characteristics": [
            "Plugging in speeds without signs for opposite directions",
            "Getting wrong velocity sign for unknown fragment"
          ],
          "behavior": "In 1D, assign a positive direction and use signed velocities. The unknown velocity's sign will indicate its direction.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "A 2 kg piece goes left at 3 m/s; student uses $+3$ in $m_1v_1 + m_2v_2 = 0$."
            },
            {
              "process": "Correct",
              "explanation": "Use $v_1 = -3$ m/s (if right positive)."
            }
          ]
        },
        {
          "type": "Neglecting External Forces",
          "value": "Applying momentum conservation when significant external forces act during the explosion",
          "characteristics": [
            "Ignoring gravity or friction that may affect the system during the explosion",
            "Not checking if the system is isolated"
          ],
          "behavior": "Momentum conservation requires zero net external force. If an explosion happens in mid‑air, gravity is external but its impulse during the brief explosion is usually negligible. However, if the explosion is over a longer time, or if other forces are significant, momentum may not be conserved.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses momentum conservation for a firecracker exploding on the ground, ignoring the normal force from the ground during the explosion."
            },
            {
              "process": "Correct",
              "explanation": "The ground exerts an external force; momentum of the firecracker alone is not conserved. Include Earth or choose a different system."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit7/explosion_mistakes.png",
        "alt": "Common mistakes: assuming KE conserved, vector addition errors, sign mistakes, external force neglect",
        "caption": "Avoid these common errors when analyzing explosions."
      }
    }
  ],
  "key_terms": [
    "Explosion",
    "Momentum Conservation",
    "Internal Forces",
    "Internal Energy",
    "Kinetic Energy Increase",
    "Fragment",
    "Vector Sum",
    "Spring‑Loaded",
    "Recoil",
    "Time‑Reversed Collision"
  ],
  "summary": "An explosion is a process where an object breaks into fragments due to internal forces. In the absence of external forces, the total momentum of the system is conserved. For an object initially at rest, the vector sum of the momenta of all fragments must be zero. For an object initially in motion, the total momentum after the explosion equals the initial momentum. Kinetic energy is not conserved; it increases because internal potential energy (chemical, elastic, etc.) is converted to kinetic energy. Explosions can be analyzed using momentum conservation alone if we know the masses and some fragment velocities; energy considerations can supplement if the internal energy released is known. Common applications include firecrackers, spring‑loaded devices, and rocket propulsion. Common mistakes include assuming kinetic energy is conserved, forgetting the vector nature of momentum, sign errors in 1D, and neglecting external forces. Understanding explosions is essential for analyzing any situation where objects are propelled apart by internal forces."
}
