{
  "expanded_description": "This section introduces impulse, a concept closely related to momentum. Impulse describes the effect of a force acting over a time interval. It is defined as the product of the average force and the time interval during which it acts. Impulse is a vector quantity, and it directly causes a change in an object's momentum. Understanding impulse is crucial for analyzing collisions, impacts, and any situation where forces act for short durations, such as in sports (batting, kicking) or safety devices (airbags, crumple zones).",
  "core_concept": {
    "principle": "Impulse ($\\vec{J}$) is a vector quantity defined as the product of the average net force $\\vec{F}_{\\text{avg}}$ and the time interval $\\Delta t$ during which it acts: $\\vec{J} = \\vec{F}_{\\text{avg}} \\Delta t$. Its SI unit is the newton‑second (N·s), which is equivalent to kg·m/s. Impulse is equal to the change in momentum of the object, a relationship known as the impulse‑momentum theorem.",
    "explanation": "When a large force acts over a very short time (like a bat hitting a ball), or a small force acts over a long time (like a constant push), both can produce the same change in momentum. Impulse quantifies this 'force × time' effect. The concept explains why bending your knees when landing reduces the force you feel: increasing the time over which the momentum change occurs reduces the average force. Similarly, airbags increase the time of impact, reducing the force on passengers.",
    "image": {
      "src": "images/unit7/impulse_intro.png",
      "alt": "Diagram showing a bat hitting a ball, with force over time graph illustrating impulse as area under curve",
      "caption": "Impulse is the product of force and time, equal to the area under a force‑time graph."
    }
  },
  "sections": [
    {
      "section_title": "What is Impulse?",
      "introduction": "When a force acts on an object, the effect depends not only on the magnitude of the force but also on how long it acts. Impulse combines these two factors into a single quantity.",
      "key_concept": {
        "definition": "Impulse $\\vec{J}$ is a vector quantity defined as $\\vec{J} = \\vec{F}_{\\text{avg}} \\Delta t$, where $\\vec{F}_{\\text{avg}}$ is the average net force acting during the time interval $\\Delta t$. If the force is constant, $\\vec{J} = \\vec{F} \\Delta t$. The SI unit of impulse is the newton‑second (N·s).",
        "context": "Impulse is a measure of how much the force and the duration of its application combine to change the motion of an object. A large force acting briefly can impart the same impulse as a small force acting over a long time. This concept is essential in designing safety features (airbags, crumple zones) and analyzing sports impacts."
      },
      "principles": [
        {
          "principle": "Impulse is a Vector",
          "statement": "Because force is a vector, impulse is also a vector. It has the same direction as the average force. When multiple forces act, the net impulse is the vector sum of individual impulses (or equivalently, impulse due to net force).",
          "application": "In 1D problems, direction is indicated by sign. In 2D, impulse components must be considered.",
          "example": "A force of 10 N east acting for 2 s gives an impulse of $20$ N·s east."
        },
        {
          "principle": "Impulse from Varying Forces",
          "statement": "If the force varies with time, the impulse is the area under the force‑time graph. For a varying force, the average force can be used to calculate impulse.",
          "application": "In collisions, forces often vary rapidly. The area under the $F(t)$ curve gives the impulse, which equals the momentum change.",
          "example": "A force‑time graph that is a triangle of height 100 N and base 0.1 s has area $\\frac{1}{2}(100)(0.1) = 5$ N·s, so impulse = 5 N·s."
        },
        {
          "principle": "Impulse and Momentum Change",
          "statement": "The impulse‑momentum theorem states that the impulse imparted to an object equals its change in momentum: $\\vec{J} = \\Delta \\vec{p} = \\vec{p}_f - \\vec{p}_i$.",
          "application": "This powerful relationship allows us to relate forces over time to changes in velocity without needing to know acceleration or displacement.",
          "example": "A 2 kg object initially at rest receives an impulse of 10 N·s east. Its final momentum is 10 kg·m/s east, so its final velocity is $v = p/m = 5$ m/s east."
        }
      ],
      "classifications": [
        {
          "type": "Impulse in Everyday Situations",
          "value": "Examples of impulse in action",
          "characteristics": [
            "Bat hitting a ball: large force, short time",
            "Landing from a jump: bending knees increases time, reduces force",
            "Airbag deployment: increases time of impact, reduces force on passengers",
            "Catching a egg: moving hands backward increases time, reduces force"
          ],
          "behavior": "In each case, the same momentum change occurs, but the force experienced can be reduced by increasing the time over which the change happens (or increased by decreasing the time).",
          "examples": [
            {
              "process": "Catching a ball",
              "explanation": "Pulling your hands back as you catch increases $\\Delta t$, reducing the force on your hands for the same $\\Delta p$."
            },
            {
              "process": "Airbag",
              "explanation": "An airbag provides a longer time for the passenger to come to rest, reducing the average force."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Impulse from Constant Force",
          "problem": "A constant force of 25 N east acts on an object for 3.0 s. What impulse is imparted to the object?",
          "step_by_step": [
            {
              "step": "Use $J = F \\Delta t$",
              "explanation": "$J = 25 \\times 3.0 = 75$ N·s east"
            }
          ],
          "final_answer": "$75$ N·s east",
          "concept_applied": "For constant force, impulse = force × time."
        },
        {
          "title": "Finding Average Force from Impulse",
          "problem": "A 0.5 kg ball moving at 10 m/s is stopped by a fielder's hand in 0.05 s. What is the average force exerted on the ball?",
          "step_by_step": [
            {
              "step": "Find initial and final momentum",
              "explanation": "$p_i = mv_i = 0.5 \\times 10 = 5$ kg·m/s (in direction of motion)\n$p_f = 0$"
            },
            {
              "step": "Change in momentum",
              "explanation": "$\\Delta p = 0 - 5 = -5$ kg·m/s (opposite to motion)"
            },
            {
              "step": "Impulse = change in momentum",
              "explanation": "$J = -5$ N·s"
            },
            {
              "step": "Use $J = F_{\\text{avg}} \\Delta t$",
              "explanation": "$F_{\\text{avg}} = J / \\Delta t = -5 / 0.05 = -100$ N"
            },
            {
              "step": "Interpret",
              "explanation": "The negative sign indicates the force is opposite to the initial velocity (stopping the ball). Magnitude = 100 N."
            }
          ],
          "final_answer": "$100$ N (opposite to motion)",
          "concept_applied": "Impulse = change in momentum; average force = impulse / time."
        },
        {
          "title": "Impulse from a Varying Force (Graph)",
          "problem": "A force‑time graph for a collision is a triangle with base 0.02 s and height 500 N. What impulse is delivered?",
          "step_by_step": [
            {
              "step": "Area under $F$‑$t$ graph = impulse",
              "explanation": "For a triangle, area = $\\frac{1}{2} \\times \\text{base} \\times \\text{height}$"
            },
            {
              "step": "Calculate",
              "explanation": "$J = \\frac{1}{2} \\times 0.02 \\times 500 = \\frac{1}{2} \\times 10 = 5$ N·s"
            }
          ],
          "final_answer": "$5$ N·s",
          "concept_applied": "Impulse is the area under the force‑time curve."
        },
        {
          "title": "Finding Time from Impulse and Force",
          "problem": "A force of 200 N is applied to an object, changing its momentum by 60 kg·m/s. How long was the force applied? (Assume force constant)",
          "step_by_step": [
            {
              "step": "Use $J = F \\Delta t = \\Delta p$",
              "explanation": "$\\Delta t = \\Delta p / F = 60 / 200 = 0.3$ s"
            }
          ],
          "final_answer": "$0.3$ s",
          "concept_applied": "Rearrange impulse formula to solve for time."
        }
      ],
      "image": {
        "src": "images/unit7/impulse_examples.png",
        "alt": "Examples of impulse: bat hitting ball, catching an egg, landing with bent knees, airbag deployment",
        "caption": "Increasing the time over which momentum changes reduces the average force experienced."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with impulse.",
      "classifications": [
        {
          "type": "Confusing Impulse with Work",
          "value": "Thinking impulse ($F\\Delta t$) is the same as work ($Fd$)",
          "characteristics": [
            "Using distance instead of time",
            "Mixing up units (J vs. N·s)"
          ],
          "behavior": "Impulse involves force × time; work involves force × displacement. They are different concepts with different units and physical meanings.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a force of 10 N acting for 2 s does 20 J of work."
            },
            {
              "process": "Correct",
              "explanation": "Impulse is 20 N·s; work depends on displacement, not time."
            }
          ]
        },
        {
          "type": "Forgetting That Impulse is a Vector",
          "value": "Treating impulse as a scalar when direction matters",
          "characteristics": [
            "Adding impulse magnitudes from opposite directions",
            "Not using signs in 1D problems"
          ],
          "behavior": "Impulse has direction. In 1D, use positive/negative signs consistently. In 2D, use components.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "A ball rebounds from a wall: student calculates impulse as $mv - (-mv) = 2mv$ but forgets that the impulse direction is perpendicular to wall."
            },
            {
              "process": "Correct",
              "explanation": "Impulse = change in momentum vector, so direction matters."
            }
          ]
        },
        {
          "type": "Using Average Force Incorrectly",
          "value": "Applying $J = F_{\\text{avg}} \\Delta t$ without ensuring $F_{\\text{avg}}$ is the average net force",
          "characteristics": [
            "Using peak force instead of average",
            "Forgetting that impulse comes from net force"
          ],
          "behavior": "Impulse is due to the net force. If multiple forces act, use the net average force or sum impulses from each force. The force in $J = F\\Delta t$ is the average net force over the interval.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "In a collision, student uses the maximum force from a graph instead of the average to calculate impulse."
            },
            {
              "process": "Correct",
              "explanation": "Impulse is the area under the curve, which is equivalent to average force times time."
            }
          ]
        },
        {
          "type": "Unit Confusion",
          "value": "Mixing up N·s and kg·m/s (they are equivalent, but some students think they are different)",
          "characteristics": [
            "Not realizing $1$ N·s = $1$ kg·m/s",
            "Failing to convert units consistently"
          ],
          "behavior": "The units of impulse (N·s) and momentum (kg·m/s) are equivalent because $1$ N = $1$ kg·m/s², so $1$ N·s = $1$ kg·m/s. They can be used interchangeably.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student calculates impulse in N·s and momentum change in kg·m/s and thinks they need to convert."
            },
            {
              "process": "Correct",
              "explanation": "They are the same; no conversion needed."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit7/impulse_mistakes.png",
        "alt": "Common mistakes: confusing impulse with work, vector errors, average force misuse",
        "caption": "Avoid these common errors when working with impulse."
      }
    }
  ],
  "key_terms": [
    "Impulse",
    "$\\vec{J} = \\vec{F}_{\\text{avg}} \\Delta t$",
    "Newton‑second (N·s)",
    "Average Force",
    "Impulse‑Momentum Theorem",
    "Force‑Time Graph",
    "Area Under Curve",
    "Change in Momentum"
  ],
  "summary": "Impulse is a vector quantity defined as the product of the average net force and the time interval during which it acts: $\\vec{J} = \\vec{F}_{\\text{avg}} \\Delta t$. Its SI unit is the newton‑second (N·s), equivalent to kg·m/s. Impulse is equal to the change in momentum of the object, a relationship known as the impulse‑momentum theorem: $\\vec{J} = \\Delta \\vec{p} = \\vec{p}_f - \\vec{p}_i$. For varying forces, impulse is the area under the force‑time graph. The concept explains how increasing the time over which a momentum change occurs reduces the average force (e.g., airbags, bending knees when landing). Common mistakes include confusing impulse with work, treating impulse as a scalar, using peak force instead of average, and unit confusion. Understanding impulse is essential for analyzing collisions, impacts, and safety devices."
}
