{
  "expanded_description": "This section focuses on inelastic collisions, where kinetic energy is not conserved during the interaction. Unlike elastic collisions, inelastic collisions involve some loss of kinetic energy to other forms such as heat, sound, or permanent deformation. However, momentum is still conserved in an isolated system. Inelastic collisions encompass a wide range of real‑world interactions, from car crashes to football tackles. Understanding them is essential for analyzing situations where objects collide and bounce apart, but with reduced speed or energy.",
  "core_concept": {
    "principle": "An inelastic collision is one in which the total kinetic energy of the system is not conserved. Some kinetic energy is converted into other forms of energy (heat, sound, deformation). However, in the absence of external forces, the total momentum of the system is still conserved. For a two‑object inelastic collision in one dimension, momentum conservation gives: $m_1 v_{1i} + m_2 v_{2i} = m_1 v_{1f} + m_2 v_{2f}$. The final velocities are not uniquely determined by momentum alone; additional information about the nature of the collision (e.g., coefficient of restitution) is needed.",
    "explanation": "Most real‑world collisions are inelastic to some degree. When two cars crash, their kinetic energy is transformed into the energy of deformation, heat, and sound. When a baseball is caught, the collision between ball and glove is inelastic. Even in seemingly bouncy collisions, some energy is always lost. Inelastic collisions are distinguished from perfectly inelastic collisions (where objects stick together) and elastic collisions (where kinetic energy is conserved). The coefficient of restitution, $e$, quantifies the elasticity of a collision, with $e=1$ for perfectly elastic, $e=0$ for perfectly inelastic, and $0<e<1$ for inelastic collisions.",
    "image": {
      "src": "images/unit7/inelastic_collision.png",
      "alt": "Diagram of two cars colliding and crumpling, showing before and after states with reduced kinetic energy",
      "caption": "In an inelastic collision, kinetic energy is lost to deformation, heat, and sound, but momentum is conserved."
    }
  },
  "sections": [
    {
      "section_title": "Inelastic Collisions",
      "introduction": "An inelastic collision is any collision that is not perfectly elastic. This means that some of the initial kinetic energy is transformed into other forms of energy. The objects may bounce apart, stick together (perfectly inelastic), or deform. Regardless of the details, momentum is always conserved if the system is isolated.",
      "key_concept": {
        "definition": "An inelastic collision is a collision in which the total kinetic energy of the system is not conserved. The objects may deform, generate heat, produce sound, or undergo other energy transformations. Momentum is still conserved for an isolated system. The coefficient of restitution $e$, defined as $e = \\frac{\\text{relative speed after collision}}{\\text{relative speed before collision}}$, characterizes the elasticity: $e=1$ for elastic, $e=0$ for perfectly inelastic, and $0<e<1$ for inelastic collisions.",
        "context": "Inelastic collisions are the norm in the macroscopic world. From a car accident to a ball of clay hitting the floor, energy is always dissipated. Understanding inelastic collisions allows us to analyze these situations using momentum conservation, even when we don't know the details of the energy loss."
      },
      "principles": [
        {
          "principle": "Momentum Conservation",
          "statement": "In the absence of external forces, the total momentum of the system is conserved in any inelastic collision: $\\sum \\vec{p}_i = \\sum \\vec{p}_f$.",
          "application": "This provides the primary equation for solving inelastic collision problems. Unlike elastic collisions, we do not have a second equation from energy conservation, so we need additional information (such as coefficient of restitution or a known final velocity) to determine the outcome.",
          "example": "Two cars colliding and bouncing apart: $m_1v_{1i} + m_2v_{2i} = m_1v_{1f} + m_2v_{2f}$."
        },
        {
          "principle": "Kinetic Energy Loss",
          "statement": "In an inelastic collision, the final kinetic energy is less than the initial kinetic energy: $KE_f < KE_i$. The lost energy appears in other forms (heat, sound, deformation).",
          "application": "We can calculate the amount of energy lost by comparing initial and final kinetic energies, even if we don't know where the energy went.",
          "example": "A 2 kg ball at 5 m/s hits a 3 kg ball at rest. After collision, they move at 2 m/s and 2.5 m/s. $KE_i = 25$ J, $KE_f = 4 + 9.375 = 13.375$ J, so $11.625$ J are lost."
        },
        {
          "principle": "Coefficient of Restitution",
          "statement": "For two objects colliding in one dimension, the coefficient of restitution $e$ is defined as $e = \\frac{v_{2f} - v_{1f}}{v_{1i} - v_{2i}}$. It is a measure of the 'bounciness' of the collision. For perfectly elastic collisions, $e=1$; for perfectly inelastic collisions, $e=0$; for inelastic collisions, $0<e<1$.",
          "application": "If the coefficient of restitution is given, it provides a second equation (along with momentum conservation) to solve for the final velocities in an inelastic collision.",
          "example": "A ball with $e=0.8$ hitting a stationary wall has $v_f = -e v_i$, so it rebounds with 80% of its speed."
        }
      ],
      "classifications": [
        {
          "type": "Types of Inelastic Collisions",
          "value": "Common categories",
          "characteristics": [
            "General inelastic: objects bounce apart but with energy loss; $0<e<1$",
            "Perfectly inelastic: objects stick together; $e=0$ (covered in next section)",
            "Partially elastic: often used interchangeably with 'inelastic'"
          ],
          "behavior": "In a general inelastic collision, objects separate after impact but with reduced speed compared to an elastic collision. The degree of energy loss is quantified by the coefficient of restitution.",
          "examples": [
            {
              "process": "Steel ball bearings",
              "explanation": "Steel balls bouncing off each other have $e \\approx 0.95$, close to elastic but still slightly inelastic."
            },
            {
              "process": "Football tackle",
              "explanation": "Players collide and bounce apart, losing energy to deformation and heat; $e$ is less than 1."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Inelastic Collision with Given Final Velocities",
          "problem": "A 4 kg object moving at 6 m/s collides with a 2 kg object moving at 3 m/s in the same direction. After the collision, the 4 kg object moves at 4 m/s. Find the final velocity of the 2 kg object and the kinetic energy lost.",
          "step_by_step": [
            {
              "step": "Apply momentum conservation",
              "explanation": "Let the direction of motion be positive. $p_i = 4(6) + 2(3) = 24 + 6 = 30$ kg·m/s.\n$p_f = 4(4) + 2 v_{2f} = 16 + 2v_{2f}$.\nSet equal: $16 + 2v_{2f} = 30$ → $2v_{2f} = 14$ → $v_{2f} = 7$ m/s."
            },
            {
              "step": "Calculate initial KE",
              "explanation": "$KE_i = \\frac{1}{2}(4)(6^2) + \\frac{1}{2}(2)(3^2) = 2(36) + 1(9) = 72 + 9 = 81$ J."
            },
            {
              "step": "Calculate final KE",
              "explanation": "$KE_f = \\frac{1}{2}(4)(4^2) + \\frac{1}{2}(2)(7^2) = 2(16) + 1(49) = 32 + 49 = 81$ J."
            },
            {
              "step": "Compare",
              "explanation": "$KE_f = KE_i$, so actually this is an elastic collision! The given numbers accidentally produced an elastic result. This highlights that not all inelastic collisions lose energy; the problem statement said inelastic, but the numbers tell a different story. Let's adjust: Suppose the 4 kg object moves at 3 m/s after collision instead of 4 m/s."
            }
          ],
          "final_answer": "With $v_{1f}=3$ m/s: $16 + 2v_{2f} = 30$ → $2v_{2f}=14$ → $v_{2f}=7$ m/s still? Wait recalc: $4(3)=12$, so $12+2v_{2f}=30$ → $2v_{2f}=18$ → $v_{2f}=9$ m/s. Then $KE_f = \\frac{1}{2}(4)(9) + \\frac{1}{2}(2)(81) = 18 + 81 = 99$ J? That's higher than initial 81 J – impossible. So need a consistent example. Let's create a proper inelastic example: A 3 kg object at 5 m/s collides with a 2 kg object at rest. After collision, the 3 kg object moves at 2 m/s. Find the 2 kg object's velocity and KE loss.",
          "step_by_step": [
            {
              "step": "Momentum conservation",
              "explanation": "$p_i = 3(5) + 2(0) = 15$ kg·m/s.\n$p_f = 3(2) + 2v_{2f} = 6 + 2v_{2f}$.\n$6 + 2v_{2f} = 15$ → $2v_{2f} = 9$ → $v_{2f} = 4.5$ m/s."
            },
            {
              "step": "Initial KE",
              "explanation": "$KE_i = \\frac{1}{2}(3)(25) + 0 = 37.5$ J."
            },
            {
              "step": "Final KE",
              "explanation": "$KE_f = \\frac{1}{2}(3)(4) + \\frac{1}{2}(2)(20.25) = 6 + 20.25 = 26.25$ J."
            },
            {
              "step": "Energy loss",
              "explanation": "$\\Delta KE = 37.5 - 26.25 = 11.25$ J lost."
            }
          ],
          "final_answer": "$v_{2f} = 4.5$ m/s, $\\Delta KE = -11.25$ J (lost)",
          "concept_applied": "Momentum gives final velocity; KE change shows inelasticity."
        },
        {
          "title": "Using Coefficient of Restitution",
          "problem": "A 0.2 kg ball moving at 8 m/s strikes a stationary 0.5 kg block. The coefficient of restitution between ball and block is 0.6. Find the velocities after collision.",
          "step_by_step": [
            {
              "step": "Momentum conservation",
              "explanation": "$0.2(8) + 0.5(0) = 0.2 v_{1f} + 0.5 v_{2f}$ → $1.6 = 0.2 v_{1f} + 0.5 v_{2f}$."
            },
            {
              "step": "Coefficient of restitution",
              "explanation": "$e = \\frac{v_{2f} - v_{1f}}{v_{1i} - v_{2i}} = \\frac{v_{2f} - v_{1f}}{8 - 0} = 0.6$ → $v_{2f} - v_{1f} = 4.8$."
            },
            {
              "step": "Solve system",
              "explanation": "From second, $v_{2f} = v_{1f} + 4.8$. Substitute: $1.6 = 0.2v_{1f} + 0.5(v_{1f} + 4.8) = 0.2v_{1f} + 0.5v_{1f} + 2.4 = 0.7v_{1f} + 2.4$ → $0.7v_{1f} = -0.8$ → $v_{1f} = -1.143$ m/s.\nThen $v_{2f} = -1.143 + 4.8 = 3.657$ m/s."
            }
          ],
          "final_answer": "$v_{1f} = -1.14$ m/s (rebounds), $v_{2f} = 3.66$ m/s forward",
          "concept_applied": "Coefficient of restitution provides second equation for inelastic collision."
        },
        {
          "title": "Inelastic Collision in Two Dimensions",
          "problem": "A 2 kg ball moving at 3 m/s east collides with a 3 kg ball moving at 2 m/s north. They collide and bounce apart. After collision, the 2 kg ball is observed moving at 1.5 m/s at 40° north of east. Find the velocity of the 3 kg ball after collision. (Assume no external forces, but note: this is likely inelastic; we don't assume energy conservation.)",
          "step_by_step": [
            {
              "step": "Set up coordinates and initial momenta",
              "explanation": "East = +x, north = +y.\n$\\vec{p}_{1i} = (2 \\times 3, 0) = (6, 0)$ kg·m/s\n$\\vec{p}_{2i} = (0, 3 \\times 2) = (0, 6)$ kg·m/s\nTotal $\\vec{P}_i = (6, 6)$ kg·m/s"
            },
            {
              "step": "Final momentum of ball 1",
              "explanation": "$v_{1f} = 1.5$ m/s at 40°, so $v_{1f,x} = 1.5\\cos40° = 1.5 \\times 0.7660 = 1.149$ m/s, $v_{1f,y} = 1.5\\sin40° = 1.5 \\times 0.6428 = 0.964$ m/s.\n$\\vec{p}_{1f} = 2(1.149, 0.964) = (2.298, 1.928)$ kg·m/s"
            },
            {
              "step": "Conservation of momentum",
              "explanation": "$\\vec{P}_f = \\vec{p}_{1f} + \\vec{p}_{2f} = \\vec{P}_i$ → $\\vec{p}_{2f} = \\vec{P}_i - \\vec{p}_{1f}$"
            },
            {
              "step": "Calculate $\\vec{p}_{2f}$",
              "explanation": "$p_{2f,x} = 6 - 2.298 = 3.702$ kg·m/s\n$p_{2f,y} = 6 - 1.928 = 4.072$ kg·m/s"
            },
            {
              "step": "Velocity of ball 2",
              "explanation": "$\\vec{v}_{2f} = \\vec{p}_{2f} / 3 = (1.234, 1.357)$ m/s"
            },
            {
              "step": "Magnitude and direction",
              "explanation": "$v_{2f} = \\sqrt{1.234^2 + 1.357^2} = \\sqrt{1.523 + 1.842} = \\sqrt{3.365} = 1.834$ m/s\n$\\theta = \\tan^{-1}(1.357/1.234) = \\tan^{-1}(1.099) = 47.7°$ north of east"
            }
          ],
          "final_answer": "$1.83$ m/s at $47.7°$ north of east",
          "concept_applied": "In 2D, momentum conservation applies component‑wise; no energy conservation used."
        }
      ],
      "image": {
        "src": "images/unit7/inelastic_collision_work.png",
        "alt": "Worked examples of inelastic collisions: 1D with restitution, 2D vector addition",
        "caption": "Inelastic collisions require momentum conservation and often additional information like coefficient of restitution."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with inelastic collisions.",
      "classifications": [
        {
          "type": "Assuming Kinetic Energy is Conserved",
          "value": "Using $KE_i = KE_f$ for inelastic collisions",
          "characteristics": [
            "Applying energy conservation when it's not valid",
            "Not recognizing that inelastic means energy loss"
          ],
          "behavior": "Only use both momentum and energy conservation for elastic collisions. For inelastic, momentum alone is the starting point; energy conservation does not hold.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student solves an inelastic collision using $\\frac{1}{2}m_1v_{1i}^2 + \\frac{1}{2}m_2v_{2i}^2 = \\frac{1}{2}m_1v_{1f}^2 + \\frac{1}{2}m_2v_{2f}^2$."
            },
            {
              "process": "Correct",
              "explanation": "Use only momentum conservation unless coefficient of restitution or other info is given."
            }
          ]
        },
        {
          "type": "Confusing Inelastic with Perfectly Inelastic",
          "value": "Assuming that 'inelastic' means the objects stick together",
          "characteristics": [
            "Using $v_{1f} = v_{2f}$ for any inelastic collision",
            "Not distinguishing between general inelastic and perfectly inelastic"
          ],
          "behavior": "Perfectly inelastic is a specific type of inelastic collision where objects stick together. General inelastic collisions may have objects bouncing apart with energy loss, but they do not stick.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student solves a problem where two balls bounce apart but uses $v_{1f}=v_{2f}$."
            },
            {
              "process": "Correct",
              "explanation": "Only use equal final velocities if explicitly stated as 'stick together' or 'perfectly inelastic'."
            }
          ]
        },
        {
          "type": "Misapplying Coefficient of Restitution Sign",
          "value": "Getting the signs wrong in the restitution formula",
          "characteristics": [
            "Using $e = \\frac{v_{1f} - v_{2f}}{v_{1i} - v_{2i}}$ instead of $\\frac{v_{2f} - v_{1f}}{v_{1i} - v_{2i}}$",
            "Forgetting that the numerator is separation speed, denominator is approach speed"
          ],
          "behavior": "The correct definition is $e = \\frac{\\text{relative speed after}}{\\text{relative speed before}} = \\frac{v_{2f} - v_{1f}}{v_{1i} - v_{2i}}$. The order matters to ensure $e$ is positive for normal collisions.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student writes $e = (v_{1f} - v_{2f})/(v_{1i} - v_{2i})$ and gets negative $e$."
            },
            {
              "process": "Correct",
              "explanation": "$e = (v_{2f} - v_{1f})/(v_{1i} - v_{2i})$ is positive for objects moving apart."
            }
          ]
        },
        {
          "type": "Forgetting That External Forces Can Be Neglected During Collision",
          "value": "Not applying momentum conservation because external forces exist, even though their impulse during the brief collision is negligible",
          "characteristics": [
            "Refusing to use momentum conservation for a car crash because friction acts",
            "Not recognizing that large internal forces dominate during impact"
          ],
          "behavior": "During the very short time of a collision, the impulse from external forces (like friction) is often negligible compared to the impulse from internal collision forces. Thus, momentum is approximately conserved during the collision itself.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says momentum is not conserved in a car crash because of road friction."
            },
            {
              "process": "Correct",
              "explanation": "During the brief collision, friction impulse is small; momentum is approximately conserved."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit7/inelastic_mistakes.png",
        "alt": "Common mistakes: assuming KE conserved, confusing inelastic types, restitution sign errors",
        "caption": "Avoid these common errors when analyzing inelastic collisions."
      }
    }
  ],
  "key_terms": [
    "Inelastic Collision",
    "Momentum Conservation",
    "Kinetic Energy Loss",
    "Coefficient of Restitution",
    "$e = \\frac{v_{2f} - v_{1f}}{v_{1i} - v_{2i}}$",
    "Deformation",
    "Heat Loss",
    "Sound Energy",
    "Partially Elastic"
  ],
  "summary": "Inelastic collisions are collisions in which kinetic energy is not conserved. Some initial kinetic energy is transformed into other forms such as heat, sound, or deformation energy. However, in the absence of external forces, the total momentum of the system is still conserved. Inelastic collisions are characterized by the coefficient of restitution $e$, with $0 < e < 1$ for general inelastic collisions ($e=1$ for elastic, $e=0$ for perfectly inelastic). The final velocities in an inelastic collision are not uniquely determined by momentum conservation alone; additional information (such as $e$ or a given final velocity) is needed. In one dimension, momentum conservation and the restitution equation can be solved together. In two dimensions, momentum components are conserved, but energy conservation does not apply. Common mistakes include assuming kinetic energy is conserved, confusing inelastic with perfectly inelastic collisions, sign errors in the restitution formula, and neglecting that external forces are often negligible during the brief collision time. Understanding inelastic collisions is essential for analyzing real‑world impacts and energy dissipation."
}
