{
  "expanded_description": "This section introduces the concept of momentum, a fundamental quantity in physics that describes the 'quantity of motion' an object possesses. Momentum is a vector quantity, defined as the product of an object's mass and its velocity. It plays a central role in analyzing collisions and interactions, where the total momentum of an isolated system remains constant. Understanding momentum is essential for predicting the outcomes of collisions, explosions, and other interactions where forces act over short time intervals.",
  "core_concept": {
    "principle": "Momentum ($\\vec{p}$) is a vector quantity defined as the product of an object's mass and its velocity: $\\vec{p} = m\\vec{v}$. Its SI units are kg·m/s. Momentum is directly proportional to both mass and velocity; a more massive object or a faster object has greater momentum. Because it is a vector, momentum has both magnitude and direction, and changes in momentum require a net external force acting over time.",
    "explanation": "Momentum captures how difficult it is to stop a moving object. A heavy truck moving slowly and a light bullet moving very fast can both have large momentum. In the absence of external forces, the total momentum of a system is conserved – a principle that is even more fundamental than Newton's laws. This section lays the groundwork for understanding impulse, collisions, and the conservation of momentum.",
    "image": {
      "src": "images/unit7/momentum_intro.png",
      "alt": "Illustration comparing momentum of different objects: a slow truck and a fast bullet both having significant momentum",
      "caption": "Momentum depends on both mass and velocity; different combinations can yield the same momentum."
    }
  },
  "sections": [
    {
      "section_title": "What is Momentum?",
      "introduction": "Momentum is a concept that quantifies the motion of an object. It combines an object's mass (how much matter) with its velocity (how fast and in what direction).",
      "key_concept": {
        "definition": "Momentum $\\vec{p}$ is a vector quantity defined as $\\vec{p} = m\\vec{v}$, where $m$ is the mass and $\\vec{v}$ is the velocity. The SI unit of momentum is the kilogram‑meter per second (kg·m/s).",
        "context": "Momentum is often described as 'mass in motion.' It is a conserved quantity in isolated systems, meaning that in the absence of external forces, the total momentum before an interaction equals the total momentum after. This conservation law is a powerful tool for analyzing collisions and explosions."
      },
      "principles": [
        {
          "principle": "Momentum is a Vector",
          "statement": "Because velocity is a vector, momentum is also a vector. It has the same direction as the velocity. When adding momenta, vector addition must be used.",
          "application": "In problems involving motion in two dimensions, momentum must be resolved into components, just like forces and velocities.",
          "example": "A 2 kg object moving east at 3 m/s has momentum $\\vec{p} = 6\\,\\text{kg·m/s}$ east. An object with the same mass moving west at 3 m/s has momentum $\\vec{p} = -6\\,\\text{kg·m/s}$ east (or 6 kg·m/s west)."
        },
        {
          "principle": "Momentum Depends on Mass and Velocity",
          "statement": "Momentum is directly proportional to both mass and velocity. Doubling either mass or velocity doubles the magnitude of momentum.",
          "application": "This relationship helps compare the 'difficulty' of stopping different objects.",
          "example": "A 1000 kg car moving at 20 m/s has momentum $p = 20,\\!000$ kg·m/s. A 2000 kg truck moving at 10 m/s has the same momentum: $p = 20,\\!000$ kg·m/s."
        },
        {
          "principle": "Momentum and Newton's Second Law",
          "statement": "Newton's original formulation of his second law stated that the net force equals the rate of change of momentum: $\\vec{F}_{\\text{net}} = \\frac{d\\vec{p}}{dt}$. For constant mass, this reduces to $\\vec{F}_{\\text{net}} = m\\vec{a}$.",
          "application": "This form of Newton's second law is more general and applies even when mass changes (e.g., rockets). It also directly leads to the impulse‑momentum theorem.",
          "example": "A constant net force of 10 N acting for 5 s changes an object's momentum by $\\Delta p = F \\Delta t = 50$ kg·m/s."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Momentum",
          "problem": "Calculate the momentum of: (a) a 0.15 kg baseball thrown at 40 m/s, (b) a 1200 kg car moving at 25 m/s.",
          "step_by_step": [
            {
              "step": "Use $p = mv$",
              "explanation": "Momentum is mass times velocity (magnitude only if direction not specified)."
            },
            {
              "step": "Baseball",
              "explanation": "$p = 0.15 \\times 40 = 6$ kg·m/s"
            },
            {
              "step": "Car",
              "explanation": "$p = 1200 \\times 25 = 30,\\!000$ kg·m/s"
            }
          ],
          "final_answer": "(a) $6$ kg·m/s, (b) $30,\\!000$ kg·m/s",
          "concept_applied": "Direct application of $p = mv$."
        },
        {
          "title": "Momentum in Two Dimensions",
          "problem": "A 3 kg object has velocity components $v_x = 4$ m/s and $v_y = 3$ m/s. Find the magnitude and direction of its momentum.",
          "step_by_step": [
            {
              "step": "Find momentum components",
              "explanation": "$p_x = mv_x = 3 \\times 4 = 12$ kg·m/s\n$p_y = mv_y = 3 \\times 3 = 9$ kg·m/s"
            },
            {
              "step": "Find magnitude",
              "explanation": "$p = \\sqrt{p_x^2 + p_y^2} = \\sqrt{12^2 + 9^2} = \\sqrt{144 + 81} = \\sqrt{225} = 15$ kg·m/s"
            },
            {
              "step": "Find direction",
              "explanation": "$\\theta = \\tan^{-1}(p_y/p_x) = \\tan^{-1}(9/12) = \\tan^{-1}(0.75) = 36.9°$ above the +x axis"
            }
          ],
          "final_answer": "$15$ kg·m/s at $36.9°$",
          "concept_applied": "Momentum components add vectorially, just like velocity."
        },
        {
          "title": "Comparing Momenta",
          "problem": "Which has greater momentum: a 0.02 kg bullet moving at 800 m/s, or a 60 kg person running at 5 m/s?",
          "step_by_step": [
            {
              "step": "Bullet momentum",
              "explanation": "$p_b = 0.02 \\times 800 = 16$ kg·m/s"
            },
            {
              "step": "Person momentum",
              "explanation": "$p_p = 60 \\times 5 = 300$ kg·m/s"
            },
            {
              "step": "Compare",
              "explanation": "$300 > 16$, so the person has greater momentum."
            }
          ],
          "final_answer": "The person has greater momentum (300 kg·m/s vs. 16 kg·m/s).",
          "concept_applied": "Mass can compensate for lower speed; a slow heavy object can have more momentum than a fast light object."
        }
      ],
      "image": {
        "src": "images/unit7/momentum_examples.png",
        "alt": "Examples of objects with their momenta: bullet, car, truck, person running",
        "caption": "Momentum depends on both mass and velocity; a slow truck can have more momentum than a fast car."
      }
    },
    {
      "section_title": "Momentum and Newton's Second Law",
      "introduction": "Newton's second law is often expressed in terms of momentum, which is particularly useful when mass is not constant or when dealing with impulse.",
      "key_concept": {
        "definition": "Newton's second law in its most general form states that the net force acting on an object equals the time rate of change of its momentum: $\\vec{F}_{\\text{net}} = \\frac{d\\vec{p}}{dt}$. For constant mass, this simplifies to $\\vec{F}_{\\text{net}} = m\\vec{a}$.",
        "context": "This formulation reveals that a force is required to change an object's momentum. The greater the force, or the longer it acts, the greater the momentum change. This directly leads to the impulse‑momentum theorem."
      },
      "principles": [
        {
          "principle": "Constant Mass Case",
          "statement": "If mass is constant, $\\frac{d\\vec{p}}{dt} = m\\frac{d\\vec{v}}{dt} = m\\vec{a}$, so $\\vec{F}_{\\text{net}} = m\\vec{a}$, the familiar form.",
          "application": "Most introductory problems involve constant mass, so this form is sufficient.",
          "example": "A 2 kg object accelerating at 3 m/s² experiences a net force of 6 N, which changes its momentum by 6 kg·m/s each second."
        },
        {
          "principle": "Variable Mass Case",
          "statement": "When mass changes (e.g., rockets ejecting fuel), the full form $\\vec{F}_{\\text{net}} = \\frac{d\\vec{p}}{dt}$ must be used.",
          "application": "Rocket propulsion is analyzed using momentum conservation and the variable mass form of Newton's second law.",
          "example": "A rocket ejects exhaust gases backward, gaining forward momentum even though the rocket's mass decreases."
        }
      ]
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with momentum.",
      "classifications": [
        {
          "type": "Confusing Momentum with Kinetic Energy",
          "value": "Thinking momentum and kinetic energy are the same, or using one in place of the other",
          "characteristics": [
            "Using $\\frac{1}{2}mv^2$ when $mv$ is needed",
            "Not recognizing that momentum is a vector, KE is a scalar"
          ],
          "behavior": "Momentum ($\\vec{p} = m\\vec{v}$) and kinetic energy ($KE = \\frac{1}{2}mv^2$) are different quantities. Momentum is a vector; KE is a scalar. They have different units and different conservation laws.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says two objects with the same speed but different masses have the same momentum (they have different momenta but same KE only if masses equal)."
            },
            {
              "process": "Correct",
              "explanation": "Momentum depends linearly on both mass and velocity; KE depends on mass and velocity squared."
            }
          ]
        },
        {
          "type": "Forgetting That Momentum is a Vector",
          "value": "Adding momenta as scalars without considering direction",
          "characteristics": [
            "Adding magnitudes of momenta in opposite directions",
            "Not using components in 2D problems"
          ],
          "behavior": "Momentum is a vector; direction matters. When adding momenta, use vector addition (components). Two objects moving toward each other have momenta that partially cancel.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Two 2 kg objects moving toward each other at 3 m/s: student says total momentum = $6 + 6 = 12$ kg·m/s."
            },
            {
              "process": "Correct",
              "explanation": "One has $+6$, other $-6$, total $0$ kg·m/s."
            }
          ]
        },
        {
          "type": "Using Velocity Instead of Speed",
          "value": "When magnitude of momentum is needed, using velocity components correctly is fine, but sometimes students forget that $p = m\\sqrt{v_x^2+v_y^2}$ for magnitude.",
          "characteristics": [
            "Adding $p_x$ and $p_y$ directly without Pythagorean theorem"
          ],
          "behavior": "For magnitude of total momentum, use $p = \\sqrt{p_x^2 + p_y^2}$.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "For $p_x = 3$, $p_y = 4$, student says $p = 7$ kg·m/s."
            },
            {
              "process": "Correct",
              "explanation": "$p = \\sqrt{3^2+4^2} = 5$ kg·m/s."
            }
          ]
        },
        {
          "type": "Units Confusion",
          "value": "Using incorrect units for momentum",
          "characteristics": [
            "Writing kg·m/s² (which is newton) instead of kg·m/s",
            "Mixing kg and g without conversion"
          ],
          "behavior": "Momentum has units of mass × velocity: kg·m/s in SI. Ensure mass is in kg, velocity in m/s.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "A 500 g object at 2 m/s: student uses $p = 500 \\times 2 = 1000$ kg·m/s."
            },
            {
              "process": "Correct",
              "explanation": "Convert 500 g = 0.5 kg, $p = 0.5 \\times 2 = 1$ kg·m/s."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit7/momentum_mistakes.png",
        "alt": "Common mistakes: confusing momentum with KE, vector addition errors, unit errors",
        "caption": "Avoid these common errors when working with momentum."
      }
    }
  ],
  "key_terms": [
    "Momentum",
    "$\\vec{p} = m\\vec{v}$",
    "Vector",
    "kg·m/s",
    "Newton's Second Law (momentum form)",
    "Conservation of Momentum (preview)"
  ],
  "summary": "Momentum is a vector quantity defined as the product of an object's mass and its velocity: $\\vec{p} = m\\vec{v}$. Its SI unit is the kilogram‑meter per second (kg·m/s). Momentum has both magnitude and direction, and changes in momentum require a net external force. Newton's second law can be written as $\\vec{F}_{\\text{net}} = d\\vec{p}/dt$, which is more general than $\\vec{F} = m\\vec{a}$. Momentum is distinct from kinetic energy: momentum is a vector and depends linearly on velocity, while kinetic energy is a scalar and depends on velocity squared. Common mistakes include confusing momentum with kinetic energy, adding momenta as scalars, and unit errors. Understanding momentum is essential for analyzing impulse, collisions, and the powerful principle of conservation of momentum in isolated systems."
}
