{
  "expanded_description": "All societies must answer three fundamental economic questions that arise directly from scarcity: What to produce? How to produce it? For whom to produce? How these questions are answered defines an economy's structure and determines how resources are allocated among competing uses.",
  "core_concept": {
    "principle": "Every economic system, regardless of its structure, must address three fundamental questions: (1) What goods and services should be produced and in what quantities? (2) How should these goods and services be produced? (3) For whom should goods and services be produced—who gets what is produced? The methods used to answer these questions define different economic systems.",
    "explanation": "These three questions arise inevitably from scarcity. Because resources are limited and wants are unlimited, societies cannot produce everything everyone desires. This forces choices about what to make (allocating resources among different goods), how to make it (choosing production methods and technologies), and who receives the output (distributing finished goods among population members). Different economic systems answer these questions differently. Market economies rely on prices, supply and demand, and individual choice. Command economies use central planning and government directives. Mixed economies combine both approaches. No matter the system, these three questions must be answered—explicitly through planning or implicitly through market forces. How a society answers these questions determines its economic efficiency, innovation, equity, and ultimately the standard of living its citizens enjoy. Understanding these questions helps explain why economies differ, why some perform better than others, and what trade-offs exist between different organizational approaches.",
    "image": {
      "src": "images/unit1/three_questions.png",
      "alt": "Triangle diagram with three points labeled What, How, and For Whom, connected by arrows",
      "caption": "The three fundamental economic questions that all societies must answer"
    }
  },
  "sections": [
    {
      "section_title": "Question 1: What to Produce?",
      "introduction": "The first fundamental question addresses which goods and services an economy should produce and in what quantities. This requires allocating scarce resources among countless possible products.",
      "key_concept": {
        "definition": "The 'What to produce?' question asks: Which goods and services should the economy create? In what quantities? Should resources go toward food, housing, healthcare, entertainment, military equipment, education, or something else? How much of each?",
        "context": "Scarcity makes this question unavoidable. Society cannot produce unlimited amounts of everything, so it must choose. Resources devoted to producing cars cannot simultaneously produce houses. Steel used in construction cannot also make appliances. Every production decision involves opportunity costs—producing more of one thing means producing less of another."
      },
      "categories": [
        {
          "type": "Consumer Goods vs. Capital Goods",
          "description": "Society must balance between goods for immediate consumption and goods that increase future production capacity.",
          "examples": [
            {
              "process": "Consumer goods focus",
              "explanation": "Producing more consumer goods (food, clothing, entertainment) provides immediate satisfaction but doesn't increase future productive capacity. Example: Economy producing lots of consumer electronics, restaurants, and entertainment but minimal factories and infrastructure."
            },
            {
              "process": "Capital goods focus",
              "explanation": "Producing more capital goods (factories, machinery, infrastructure) sacrifices current consumption but increases future production capacity. Example: China in the 2000s invested heavily in infrastructure and factories, sacrificing current consumption for future growth."
            },
            {
              "process": "Balance required",
              "explanation": "Economies must balance current needs with future growth. Too much current consumption leaves little for investment; too much investment means current deprivation. Example: Soviet Union over-invested in heavy industry while consumer goods remained scarce."
            }
          ]
        },
        {
          "type": "Necessities vs. Luxuries",
          "description": "Resources must be allocated between essential goods and optional luxury items.",
          "examples": [
            {
              "process": "Necessity emphasis",
              "explanation": "Poor societies must focus on necessities—food, basic shelter, healthcare, clean water. Luxury production comes only after basic needs are met. Example: Developing countries prioritize agriculture and basic infrastructure over luxury goods."
            },
            {
              "process": "Luxury expansion",
              "explanation": "Wealthier societies can devote more resources to luxuries—designer goods, entertainment, high-end restaurants, premium products. Example: Advanced economies with diverse luxury markets because basic needs are already satisfied."
            },
            {
              "process": "Changing priorities",
              "explanation": "As incomes rise, production mix shifts from necessities to luxuries. What was luxury becomes necessity, and new luxuries emerge. Example: Automobiles were luxuries in 1920, necessities by 1960; smartphones following similar path."
            }
          ]
        },
        {
          "type": "Private Goods vs. Public Goods",
          "description": "Society allocates resources between goods consumed individually and goods benefiting everyone.",
          "examples": [
            {
              "process": "Private goods",
              "explanation": "Individual consumption items—food, clothing, personal electronics, houses. Markets typically produce these efficiently. Example: Grocery stores stock food because people pay for it; profit motive ensures production."
            },
            {
              "process": "Public goods",
              "explanation": "Goods everyone can use simultaneously—national defense, street lighting, public parks, clean air. Markets under-produce these because non-payers can't be excluded (free-rider problem). Example: Military defense protects all citizens whether they pay taxes or not."
            },
            {
              "process": "Government role",
              "explanation": "Governments often produce public goods because markets won't. Resources devoted to public goods cannot produce private goods. Example: Tax dollars for military defense cannot simultaneously fund private consumption."
            }
          ]
        },
        {
          "type": "Industry and Sector Allocation",
          "description": "Resources must be distributed among different economic sectors.",
          "examples": [
            {
              "process": "Agriculture vs. manufacturing",
              "explanation": "Land, labor, and capital can go to farming or factories. Agricultural economies produce food but limited manufactured goods. Industrial economies produce manufactured goods but must import food. Example: US shifted from 90% agricultural (1800s) to under 2% today."
            },
            {
              "process": "Manufacturing vs. services",
              "explanation": "Manufacturing produces tangible goods; services produce intangibles (healthcare, education, entertainment). Modern economies shift toward services. Example: US economy is now 80% services, reflecting changed production priorities."
            },
            {
              "process": "Emerging industries",
              "explanation": "New technologies create new industries. Resources shift from declining to growing sectors. Example: Resources moving from fossil fuels to renewable energy, from retail stores to e-commerce."
            }
          ]
        },
        {
          "type": "Quantity Decisions for Specific Products",
          "description": "Even within categories, society must decide how much of each specific item to produce.",
          "examples": [
            {
              "process": "Product variety",
              "explanation": "Should factories make many types of shoes or focus on few standardized types? Variety pleases consumers but increases costs. Example: Market economies produce hundreds of shoe styles; command economies historically produced few standardized types."
            },
            {
              "process": "Quality vs. quantity",
              "explanation": "Resources can make many low-quality items or fewer high-quality ones. Example: Fast fashion produces cheap, disposable clothing versus premium brands making durable, expensive items."
            },
            {
              "process": "New vs. established products",
              "explanation": "Should resources develop new products or improve existing ones? Example: Pharmaceutical companies deciding between researching new drugs versus producing existing medications."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Consumer Preferences Should Guide Production in Market Economies",
          "statement": "In market systems, consumer demand signals what to produce. Producers make goods people want to buy because that's how they earn profit.",
          "application": "Prices and sales indicate consumer preferences, guiding resource allocation toward desired products.",
          "example": "When smartphones became popular, resources shifted from traditional phones to smartphones. Companies seeing high demand and profits in smartphones (Apple, Samsung) expanded production. Traditional phone makers (Nokia, Blackberry) either adapted or declined. Consumer preference signaled through purchases determined what got produced."
        },
        {
          "principle": "Central Planners Decide Production in Command Economies",
          "statement": "In command systems, government officials decide what to produce based on their assessment of society's needs and priorities.",
          "application": "Central plans specify production targets for each industry and product.",
          "example": "Soviet Union's Five-Year Plans specified how much steel, wheat, tractors, and housing to produce. Planners, not consumers, decided production priorities. This often resulted in producing what planners thought was needed rather than what people actually wanted."
        },
        {
          "principle": "Opportunity Costs Constrain What Can Be Produced",
          "statement": "Producing more of one good requires producing less of another when resources are limited. Every production choice involves trade-offs.",
          "application": "Resource allocation to any product has opportunity cost—the value of alternative products not produced.",
          "example": "During World War II, US automobile factories converted to aircraft and tank production. Producing more military equipment meant producing almost no civilian cars (only 139 cars made in 1943 vs. millions normally). The opportunity cost of military production was foregone civilian goods."
        },
        {
          "principle": "Production Should Reflect Both Current and Future Needs",
          "statement": "Economies must balance immediate consumption with investment for future capacity. Too much current consumption limits growth; too much investment causes current hardship.",
          "application": "Sustainable economies invest in capital goods and infrastructure while meeting current consumption needs.",
          "example": "South Korea in 1960s-1980s balanced investment and consumption, achieving rapid growth without extreme deprivation. Contrast with North Korea, which over-invested in military at expense of consumer goods, causing widespread poverty despite industrial capacity."
        }
      ],
      "worked_examples": [
        {
          "title": "Production Priorities: Developing vs. Developed Economy",
          "problem": "Compare how a poor developing country and a wealthy developed country might answer 'What to produce?' differently. Explain why their answers differ.",
          "step_by_step": [
            {
              "step": "Developing country priorities",
              "explanation": "Must focus on necessities: food production (agriculture is priority), basic shelter, clean water, basic healthcare, primary education. Little room for luxuries when people lack basics. Most resources to consumer goods meeting immediate needs, minimal capital goods investment due to limited resources."
            },
            {
              "step": "Developed country priorities",
              "explanation": "Basic needs met, so can produce: diverse consumer goods including luxuries (electronics, entertainment, premium products), extensive services (healthcare, education, tourism), significant capital goods (research, infrastructure, technology), public goods (environmental protection, culture)."
            },
            {
              "step": "Explain differences",
              "explanation": "Poor countries must prioritize survival and basic needs—no choice. They can't afford extensive capital investment when people are hungry. Rich countries have satisfied basic needs, so can diversify production toward quality-of-life improvements, innovation, and future growth."
            },
            {
              "step": "Show progression",
              "explanation": "As countries develop, production priorities shift: Agriculture → Manufacturing → Services. Necessities → Luxuries. Current consumption → Investment balance. This reflects changing needs as income rises."
            }
          ],
          "final_answer": "Developing countries must prioritize necessities (food, basic shelter, water) and current consumption because resources are extremely limited. Developed countries can produce diverse goods including luxuries, services, and significant capital investment because basic needs are already met. Production priorities reflect different scarcity levels and different stages of economic development.",
          "concept_applied": "What to produce depends on resource availability and existing satisfaction levels. The same resources answer the question differently based on whether basic needs are met. This explains why poor and rich countries have vastly different production mixes."
        },
        {
          "title": "Market Signals Determining Production",
          "problem": "In 2020, during COVID-19 pandemic, demand for hand sanitizer surged while demand for airline tickets collapsed. How did markets answer 'What to produce?' in response? What would have happened in a command economy?",
          "step_by_step": [
            {
              "step": "Market economy response",
              "explanation": "Hand sanitizer prices rose due to high demand and limited supply. High prices and profits attracted new producers. Distilleries, perfume makers, and others switched to sanitizer production. Resources (alcohol, bottles, labor) shifted to sanitizer. Airlines cut flights drastically as demand evaporated and losses mounted. Resources (planes, fuel, staff) were idled or reallocated."
            },
            {
              "step": "Speed of adjustment",
              "explanation": "Markets adjusted quickly (weeks). Price signals and profit motives drove rapid reallocation. No central coordinator needed—thousands of businesses independently responded to changing prices and demand. Hand sanitizer production increased massively within a month."
            },
            {
              "step": "Command economy response",
              "explanation": "Central planners would need to: recognize shortage, decide how much sanitizer to produce, order producers to make it, reallocate resources from other uses. This process is slower (months) because it requires bureaucratic decision-making and lacks price signals to guide resource allocation automatically."
            },
            {
              "step": "Compare effectiveness",
              "explanation": "Markets responded faster and more flexibly because price signals provided immediate information about changing needs. Decentralized decision-making (many companies independently responding) adapted better than centralized planning would have."
            }
          ],
          "final_answer": "Markets answered 'What to produce?' by allowing prices to signal changing needs. High sanitizer demand → high prices → profits attracted new producers → rapid production increase. Low airline demand → losses → capacity cuts. This decentralized, price-driven adjustment happened quickly. Command economies would respond slower due to bureaucratic planning requirements.",
          "concept_applied": "Market economies answer 'What to produce?' through price signals and profit motives. Changing consumer needs create price changes, which guide producers to shift resources toward high-demand items and away from low-demand ones. This happens automatically without central coordination."
        }
      ],
      "image": {
        "src": "images/unit1/what_to_produce.png",
        "alt": "Chart showing different categories of production choices: consumer vs capital, necessities vs luxuries, private vs public goods",
        "caption": "What to produce: allocating resources among consumer/capital goods, necessities/luxuries, and private/public goods"
      }
    },
    {
      "section_title": "Question 2: How to Produce?",
      "introduction": "Once society decides what to produce, it must determine how to produce it. This involves choosing production methods, technologies, and combinations of resources.",
      "key_concept": {
        "definition": "The 'How to produce?' question asks: Which production methods and technologies should be used? Should production be labor-intensive or capital-intensive? What techniques maximize efficiency? How should land, labor, capital, and entrepreneurship be combined?",
        "context": "Most goods can be produced multiple ways. Wheat can be harvested by hand or by combine harvester. Cars can be assembled by workers or robots. The 'how' question involves choosing among these alternatives based on resource availability, costs, technology, and goals like efficiency or employment."
      },
      "categories": [
        {
          "type": "Labor-Intensive vs. Capital-Intensive Production",
          "description": "Society must choose whether to use more labor (workers) or more capital (machinery) in production.",
          "examples": [
            {
              "process": "Labor-intensive methods",
              "explanation": "Using many workers and minimal machinery. Common where labor is abundant and cheap, capital is expensive or unavailable. Example: Agriculture in India and China uses many farm workers with basic tools due to large rural populations and limited capital."
            },
            {
              "process": "Capital-intensive methods",
              "explanation": "Using extensive machinery and automation with fewer workers. Common where labor is expensive, capital is available. Example: US agriculture uses massive machinery—one person with a combine harvester does work of hundreds of manual laborers."
            },
            {
              "process": "Factor price influence",
              "explanation": "Relative costs determine choice. Cheap labor → labor-intensive production. Expensive labor → capital-intensive production. Example: Clothing manufacturing moved from US (expensive labor) to Bangladesh (cheap labor). US automakers increased automation as wages rose."
            },
            {
              "process": "Intermediate approaches",
              "explanation": "Many operations use mixed methods, combining workers and machines optimally. Example: Modern factories use robots for repetitive tasks, humans for complex decisions and quality control."
            }
          ]
        },
        {
          "type": "Technology Choices",
          "description": "Selecting which technologies to employ in production.",
          "examples": [
            {
              "process": "Traditional vs. modern technology",
              "explanation": "Traditional methods are proven, low-cost, low-skill but less efficient. Modern technology is expensive, requires skills, but more productive. Example: Traditional brick-making by hand versus automated brick plants."
            },
            {
              "process": "Appropriate technology",
              "explanation": "Best technology depends on context—what's appropriate in rich countries may not suit poor countries. Example: Sophisticated medical imaging (MRI) appropriate in wealthy hospitals but simple diagnostic tools better for rural clinics in poor countries with limited electricity and trained technicians."
            },
            {
              "process": "Technological advancement",
              "explanation": "Economies must decide how much to invest in developing new technologies versus using existing ones. Example: Pharmaceutical companies choosing between researching new treatments (expensive, risky) or producing proven drugs (cheaper, certain)."
            },
            {
              "process": "Environmental technology",
              "explanation": "Clean production methods cost more but reduce pollution. Society must balance cost and environmental impact. Example: Coal power (cheap, dirty) versus solar/wind (expensive initially, clean). How to produce energy involves environmental trade-offs."
            }
          ]
        },
        {
          "type": "Organizational Methods",
          "description": "Choosing how to organize production activities and workers.",
          "examples": [
            {
              "process": "Small-scale vs. large-scale production",
              "explanation": "Large factories achieve economies of scale but require significant capital. Small workshops are flexible but less efficient. Example: Car manufacturing requires massive scale (Ford, Toyota plants). Artisan goods (custom furniture) produced in small workshops."
            },
            {
              "process": "Centralized vs. decentralized production",
              "explanation": "Centralized: production in one large facility. Decentralized: production distributed across many locations. Example: Amazon's many warehouses (decentralized) versus traditional single large warehouse approach."
            },
            {
              "process": "Vertical integration vs. specialization",
              "explanation": "Vertical integration: company produces everything in-house. Specialization: companies focus on one stage, buy from specialists. Example: Tesla builds many components in-house (batteries, software). Traditional automakers buy components from specialized suppliers."
            },
            {
              "process": "Assembly line vs. craft production",
              "explanation": "Assembly lines use division of labor and standardization for efficiency. Craft production allows customization but is slower. Example: Mass-market furniture (IKEA assembly line) versus custom furniture (individual craftsmen)."
            }
          ]
        },
        {
          "type": "Resource Combination Decisions",
          "description": "Determining the optimal mix of land, labor, capital, and entrepreneurship.",
          "examples": [
            {
              "process": "Substituting capital for labor",
              "explanation": "When wages rise, firms invest in machinery to replace workers. Example: Fast food restaurants installing self-service kiosks as minimum wages increase, reducing cashier positions."
            },
            {
              "process": "Substituting labor for capital",
              "explanation": "When capital is expensive or unavailable, use more labor. Example: Construction in developing countries uses many manual laborers instead of expensive equipment."
            },
            {
              "process": "Land-saving techniques",
              "explanation": "When land is scarce, use intensive methods to maximize output per acre. Example: Vertical farming in Japan and Singapore uses multi-story buildings to grow crops, saving land. Skyscrapers build up when land prices are high."
            },
            {
              "process": "Optimal factor combinations",
              "explanation": "Firms choose factor combinations that minimize cost for desired output. This varies by factor prices and technology. Example: Rice farming in Asia (abundant labor, scarce land) uses labor-intensive methods. Rice farming in US (scarce labor, abundant land) uses mechanization."
            }
          ]
        },
        {
          "type": "Location Decisions",
          "description": "Choosing where production occurs affects how resources are combined.",
          "examples": [
            {
              "process": "Domestic vs. foreign production",
              "explanation": "Produce domestically (higher labor costs, easier logistics) or offshore (lower labor costs, complex logistics). Example: Apple designs in US, manufactures in China—combining US technology/innovation with Chinese manufacturing capacity."
            },
            {
              "process": "Urban vs. rural location",
              "explanation": "Urban areas offer skilled labor, infrastructure but high costs. Rural areas offer space, lower costs but limited labor. Example: Tech companies in Silicon Valley (skilled labor) versus data centers in rural areas (cheap land, power)."
            },
            {
              "process": "Resource proximity",
              "explanation": "Locating near raw materials reduces transportation costs. Example: Steel mills near iron ore deposits and coal, lumber mills near forests, food processing near farms."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Firms Choose Cost-Minimizing Production Methods",
          "statement": "In market economies, businesses select production methods that minimize costs while achieving desired output quality. This maximizes profit.",
          "application": "Factor price ratios determine optimal production methods. Expensive factors get economized; cheap factors get used more intensively.",
          "example": "In Japan (expensive land, expensive labor), factories are highly automated (capital-intensive) and multi-story (land-saving). In Indonesia (cheap labor, expensive capital), factories use many workers and simple equipment (labor-intensive). Each country's method minimizes costs given their factor prices."
        },
        {
          "principle": "Governments May Mandate Production Methods",
          "statement": "In command economies or regulated industries, governments may specify how production occurs, overriding cost considerations for other goals.",
          "application": "Regulations can require certain methods for environmental, safety, or social reasons even if they increase costs.",
          "example": "Environmental regulations require factories to install pollution controls, increasing costs but reducing environmental damage. Labor laws mandate safety equipment and conditions. Coal power plants must install scrubbers. These regulations change 'how to produce' by legal requirement, not cost minimization."
        },
        {
          "principle": "Technology Availability Constrains Production Methods",
          "statement": "Economies can only use technologies they have access to. Technology level limits production efficiency.",
          "application": "Developing countries may lack advanced technology, forcing use of older, less efficient methods.",
          "example": "Advanced semiconductor manufacturing requires multi-billion dollar facilities and cutting-edge technology only available in few countries (Taiwan, South Korea, US). Poor countries cannot use this method for electronics production even if they wanted to—technology is unavailable. They must use assembly methods with imported chips."
        },
        {
          "principle": "Production Methods Evolve With Economic Development",
          "statement": "As countries develop, production methods shift from labor-intensive to capital-intensive as wages rise and capital becomes more available.",
          "application": "Economic development trajectory: manual labor → mechanization → automation → advanced technology.",
          "example": "China's manufacturing: 1990s relied on abundant cheap labor (labor-intensive). 2010s saw rising wages and increased automation. 2020s moving toward robotics and AI. As factor prices changed, optimal production methods evolved."
        }
      ],
      "worked_examples": [
        {
          "title": "How to Produce: Agriculture in Different Countries",
          "problem": "Compare how wheat is produced in the United States versus India. Explain why methods differ and what this reveals about 'how to produce' decisions.",
          "step_by_step": [
            {
              "step": "US wheat production method",
              "explanation": "Highly capital-intensive: massive combine harvesters, GPS-guided tractors, aerial crop monitoring. One farmer can manage thousands of acres. Very few workers per acre, extensive machinery. Reason: Labor is expensive ($15-25/hour), land is relatively abundant, capital is available."
            },
            {
              "step": "Indian wheat production method",
              "explanation": "More labor-intensive: smaller plots, basic tractors or animal power, more manual labor for planting and harvesting. Many workers per acre, less sophisticated machinery. Reason: Labor is cheap ($2-5/hour), farms are smaller, capital is less available for poor farmers."
            },
            {
              "step": "Compare factor combinations",
              "explanation": "US: High capital-to-labor ratio. Few workers, expensive equipment. India: Lower capital-to-labor ratio. Many workers, basic equipment. Both methods are rational given their factor prices."
            },
            {
              "step": "Productivity differences",
              "explanation": "US worker produces far more wheat per person (high productivity due to capital). Indian agriculture employs far more people but lower output per person. This explains income differences—high productivity enables high wages."
            },
            {
              "step": "Evolution over time",
              "explanation": "As Indian wages rise and capital becomes available, Indian agriculture is mechanizing—shifting toward US-style capital-intensive methods. This is normal development pattern."
            }
          ],
          "final_answer": "US produces wheat capital-intensively (machines, few workers) because labor is expensive and capital is available. India produces wheat more labor-intensively (many workers, basic equipment) because labor is cheap and capital is limited. Each method minimizes costs given their factor prices. As countries develop and wages rise, production methods shift toward capital intensity.",
          "concept_applied": "'How to produce' depends on relative factor prices. Expensive factors get economized through substitution. Countries at different development levels rationally use different production methods. There's no single 'correct' answer—optimal methods vary by context."
        },
        {
          "title": "Technology Choice: Appropriate Technology",
          "problem": "A rural health clinic in a poor country must decide how to produce medical diagnoses. They can install expensive advanced imaging equipment (MRI, CT scanner) or use basic examination and simple diagnostic tools. Which should they choose and why?",
          "step_by_step": [
            {
              "step": "Evaluate advanced technology option",
              "explanation": "MRI/CT scanner: Very expensive ($1-3 million), requires reliable electricity, needs trained technicians, requires regular maintenance and parts. Provides detailed diagnosis. Would absorb entire clinic budget."
            },
            {
              "step": "Evaluate appropriate technology option",
              "explanation": "Basic tools: Stethoscope, blood pressure monitor, basic lab equipment ($10,000-50,000 total). Minimal electricity needed, staff can be trained locally, maintenance is manageable. Can diagnose most common conditions."
            },
            {
              "step": "Consider context",
              "explanation": "Rural poor country: Unreliable electricity, limited budget, staff trained locally, most patients have basic health issues (infections, malnutrition, common diseases), limited specialists to interpret advanced imaging. Advanced equipment would sit unused or broken."
            },
            {
              "step": "Apply opportunity cost thinking",
              "explanation": "Money spent on MRI cannot be spent on: training more health workers, basic medicines, preventive care programs, multiple basic clinics. An MRI at one clinic serves fewer people than basic equipment at ten clinics."
            },
            {
              "step": "Determine appropriate choice",
              "explanation": "Basic technology is appropriate. It matches: available resources (limited budget), infrastructure (unreliable power), skills (local training), and needs (common diseases). Advanced technology would be inappropriate—wrong answer to 'how to produce' in this context."
            }
          ],
          "final_answer": "The clinic should choose basic diagnostic tools (appropriate technology) rather than advanced imaging. This matches available resources, infrastructure, local skills, and actual health needs. The 'best' technology isn't always the most advanced—it's what works effectively in the local context. How to produce medical services depends on circumstances.",
          "concept_applied": "'How to produce' requires matching technology to context. Advanced methods aren't always better if they don't fit infrastructure, skills, resources, or needs. Appropriate technology considers local conditions, not just technical sophistication."
        }
      ],
      "image": {
        "src": "images/unit1/how_to_produce.png",
        "alt": "Comparison showing labor-intensive vs capital-intensive production methods for the same product",
        "caption": "How to produce: choosing methods based on factor prices, technology, and efficiency goals"
      }
    },
    {
      "section_title": "Question 3: For Whom to Produce?",
      "introduction": "The final fundamental question addresses how to distribute produced goods and services among the population. This is about determining who gets what the economy produces.",
      "key_concept": {
        "definition": "The 'For whom to produce?' question asks: Who receives the goods and services produced? How should output be distributed among members of society? Should distribution be based on income, need, merit, equality, or some other principle?",
        "context": "Production creates goods and services, but they must be distributed somehow. Different systems use different distribution mechanisms. Market economies distribute based on ability to pay. Command economies may distribute by government decision. Mixed economies combine approaches. Distribution mechanisms determine inequality, living standards, and access to goods."
      },
      "categories": [
        {
          "type": "Market-Based Distribution",
          "description": "Goods distributed based on ability and willingness to pay in market systems.",
          "examples": [
            {
              "process": "Income determines consumption",
              "explanation": "Those with higher incomes can buy more and better goods. Markets distribute to highest bidders. Example: Luxury cars go to wealthy buyers who can afford $100,000+ prices. Budget cars go to middle-income buyers. Poor buyers may not afford cars at all."
            },
            {
              "process": "Price rationing",
              "explanation": "When demand exceeds supply, prices rise, allocating goods to those willing to pay more. Example: During shortages, high prices limit consumption to those who value items most (or have most money). Concert tickets for popular shows sell to fans willing to pay high prices."
            },
            {
              "process": "Factor income distribution",
              "explanation": "Income comes from providing factors of production: wages (labor), rent (land), interest (capital), profit (entrepreneurship). What you own determines income, which determines consumption. Example: Skilled worker earns $80,000 salary, can afford middle-class lifestyle. Owner of capital earns $500,000 in dividends, affords luxury lifestyle."
            },
            {
              "process": "Voluntary exchange",
              "explanation": "People get goods by trading money (earned from work or owned resources) for products. Both parties must agree. Example: You earn wages by working, use wages to buy food. Grocery store gets your money, you get food—voluntary exchange."
            }
          ]
        },
        {
          "type": "Government-Directed Distribution",
          "description": "Authorities decide who receives goods in command systems.",
          "examples": [
            {
              "process": "Rationing systems",
              "explanation": "Government allocates fixed quantities to each person regardless of income or preference. Example: Soviet Union rationed many goods—everyone got same amount of bread, sugar, etc. Long lines and shortages common because prices didn't balance supply and demand."
            },
            {
              "process": "Priority allocation",
              "explanation": "Government decides which groups get priority access. Example: Communist countries often gave party officials, military, and key workers priority access to scarce goods like cars, better housing. This created non-market inequality."
            },
            {
              "process": "Central planning decisions",
              "explanation": "Planners decide what each region or group needs. Example: Cuban government distributes housing, assigns people to apartments. No housing market—government decides who lives where."
            },
            {
              "process": "Coupon and ticket systems",
              "explanation": "Physical coupons or tickets entitle holders to goods at set prices. Example: Wartime rationing in US and UK—everyone got ration coupons for sugar, meat, gasoline. Coupons + money needed to buy rationed items."
            }
          ]
        },
        {
          "type": "Need-Based Distribution",
          "description": "Distributing goods according to assessed need rather than ability to pay.",
          "examples": [
            {
              "process": "Healthcare distribution",
              "explanation": "Many countries distribute healthcare based on medical need, not ability to pay. Sickest patients get priority regardless of income. Example: Universal healthcare systems (UK NHS, Canada) treat based on need. Emergency rooms in US must treat everyone regardless of ability to pay."
            },
            {
              "process": "Food assistance",
              "explanation": "Government food programs distribute to needy families. Example: SNAP (food stamps) in US provides food purchasing power to low-income households based on need, not market income."
            },
            {
              "process": "Housing assistance",
              "explanation": "Subsidized housing allocated to poor families who can't afford market-rate housing. Example: Public housing, Section 8 vouchers in US help low-income families access housing based on need."
            },
            {
              "process": "Education access",
              "explanation": "Public schools distribute education based on presence (all children), not ability to pay. Example: US public education provides schooling to all children regardless of family income—need-based distribution."
            }
          ]
        },
        {
          "type": "Merit-Based Distribution",
          "description": "Allocating goods based on achievement, contribution, or demonstrated merit.",
          "examples": [
            {
              "process": "Educational opportunities",
              "explanation": "Competitive universities admit students based on academic merit, not just ability to pay. Example: Scholarships to top students, admission to elite schools based on grades and test scores."
            },
            {
              "process": "Performance bonuses",
              "explanation": "Extra compensation awarded for superior performance. Example: Sales bonuses for top performers, teacher bonuses in some systems for student achievement gains."
            },
            {
              "process": "Awards and recognition",
              "explanation": "Society honors exceptional contributions with recognition and sometimes resources. Example: Nobel Prize winners get prize money, research grants often based on past research quality."
            },
            {
              "process": "Professional advancement",
              "explanation": "Promotions and better jobs go to most qualified/productive workers. Example: Meritocratic companies promote based on performance, giving high achievers better positions and pay."
            }
          ]
        },
        {
          "type": "Equality-Based Distribution",
          "description": "Everyone receives equal shares regardless of contribution, need, or ability to pay.",
          "examples": [
            {
              "process": "Equal division",
              "explanation": "Resources divided equally among all members. Example: In some intentional communities or communes, all members share output equally regardless of individual contribution."
            },
            {
              "process": "Basic income proposals",
              "explanation": "Universal basic income would give everyone equal payment. Example: Proposals for UBI where every citizen receives same monthly payment from government, creating equal baseline consumption capability."
            },
            {
              "process": "Public goods access",
              "explanation": "Everyone has equal access to public goods. Example: National parks, public libraries, roads open to all equally—everyone can use them regardless of income or status."
            },
            {
              "process": "Political equality",
              "explanation": "Democratic rights distributed equally—one person, one vote. Example: Voting rights in democracies don't depend on wealth or contribution; everyone gets equal political say."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Market Distribution Reflects Income Inequality",
          "statement": "In pure market systems, distribution mirrors income distribution. Those with more income consume more. This creates consumption inequality matching income inequality.",
          "application": "Market distribution is efficient (goods go to those valuing them most, measured by willingness to pay) but may be inequitable (poor people's needs may go unmet).",
          "example": "In market economy, wealthy family can afford large house, multiple cars, private schools, premium healthcare. Poor family struggles to afford basic housing, food, may lack healthcare. Income inequality becomes consumption inequality when markets determine distribution."
        },
        {
          "principle": "Command Distribution May Ignore Preferences",
          "statement": "When government decides distribution, individual preferences may not be satisfied. Central planners can't know everyone's wants.",
          "application": "Command distribution can ensure everyone gets minimums but often fails to match actual preferences.",
          "example": "Soviet consumers might want blue jeans and rock music, but planners produced work clothes and classical music. Everyone got clothing and music (equal distribution) but not what they wanted. Markets respond to preferences better through purchasing decisions."
        },
        {
          "principle": "Mixed Systems Combine Distribution Methods",
          "statement": "Most modern economies use multiple distribution mechanisms—markets for most goods, government provision for certain needs.",
          "application": "Basic needs often distributed by need; luxuries distributed by market; public goods distributed equally.",
          "example": "US uses markets for cars, entertainment, housing (mostly). Uses need-based distribution for emergency healthcare, food stamps, education (public schools). Uses equal distribution for voting rights, justice system access. Different goods, different distribution methods."
        },
        {
          "principle": "Distribution Methods Involve Equity-Efficiency Trade-offs",
          "statement": "More equal distribution may reduce production incentives (efficiency loss). Market distribution may create unfair outcomes (equity loss). Society must balance these goals.",
          "application": "Redistribution from rich to poor increases equity but may reduce work incentives and investment.",
          "example": "High taxes on wealthy to fund programs for poor increases equality but may discourage work and entrepreneurship. No redistribution maintains work incentives but leaves poor with unmet needs. All societies face this trade-off between equality and efficiency."
        }
      ],
      "worked_examples": [
        {
          "title": "Comparing Distribution Systems: Market vs. Need-Based",
          "problem": "Compare how healthcare is distributed in a pure market system versus a need-based system. What are the strengths and weaknesses of each approach?",
          "step_by_step": [
            {
              "step": "Market-based healthcare distribution",
              "explanation": "Healthcare goes to those who can afford it. Wealthy get excellent care, middle class get decent care, poor may get minimal care or none. Price rations scarce medical resources. Example: US (partially market-based) has excellent care for those with insurance/money, but many uninsured lack access."
            },
            {
              "step": "Market system strengths",
              "explanation": "Efficiency: Resources go to highest-value uses (those willing to pay most). Innovation: Profit motive drives medical research and new treatments. Choice: Consumers can choose providers and treatments. Quality: Competition for paying customers drives quality."
            },
            {
              "step": "Market system weaknesses",
              "explanation": "Inequity: Poor people can't afford needed care. Inability to pay ≠ low medical need. Emergency situations: People can't shop when dying. Incomplete information: Patients can't evaluate medical quality like market goods. Social costs: Untreated contagious diseases affect everyone."
            },
            {
              "step": "Need-based healthcare distribution",
              "explanation": "Healthcare allocated based on medical need regardless of ability to pay. Sickest get priority, everyone receives care. Example: UK NHS, Canadian system—free at point of use, based on medical assessment."
            },
            {
              "step": "Need-based system strengths",
              "explanation": "Equity: Everyone gets care regardless of income. Comprehensive: Preventive care prevents worse problems later. Social benefits: Treating contagious diseases protects everyone. No financial stress: Illness doesn't cause bankruptcy."
            },
            {
              "step": "Need-based system weaknesses",
              "explanation": "Possible inefficiency: No price signals to ration scarce resources. Waiting times: May have queues for non-emergency procedures. Tax burden: Requires high taxes to fund universal coverage. Innovation concerns: Less profit motive for new treatments (debated)."
            },
            {
              "step": "Compare trade-offs",
              "explanation": "Market system: More efficient allocation, more innovation, but inequitable access. Need-based: More equitable access, preventive care, but potential inefficiencies and wait times. Different societies weigh these trade-offs differently."
            }
          ],
          "final_answer": "Market distribution allocates healthcare based on ability to pay—efficient but inequitable. Need-based distribution allocates based on medical need—equitable but potentially less efficient. Each approach has strengths and weaknesses. Most countries use mixed systems trying to balance efficiency and equity. There's no perfect answer—only trade-offs.",
          "concept_applied": "'For whom to produce' involves fundamental trade-offs between efficiency (markets excel) and equity (need-based systems excel). Different distribution mechanisms serve different values. Societies must choose what they prioritize or create mixed systems attempting to balance competing goals."
        },
        {
          "title": "Factor Ownership and Distribution",
          "problem": "Explain how ownership of factors of production determines distribution in market economies. Why does this create income inequality?",
          "step_by_step": [
            {
              "step": "Identify factor ownership",
              "explanation": "Individuals own factors: Labor (everyone has their own labor), Land (owned unequally—some own property, most don't), Capital (owned very unequally—wealthy own stocks, bonds, businesses), Entrepreneurship (some start businesses, most don't)."
            },
            {
              "step": "Link ownership to income",
              "explanation": "Factor owners receive factor payments: Labor → wages, Land → rent, Capital → interest/dividends, Entrepreneurship → profit. Your income depends on which factors you own and how much."
            },
            {
              "step": "Explain distribution mechanism",
              "explanation": "Worker with only labor earns only wages ($40,000/year). Person owning labor + substantial capital earns wages + investment income ($40,000 wages + $60,000 dividends = $100,000). Person owning labor + land + capital + successful business earns wages + rent + interest + profit ($1 million+)."
            },
            {
              "step": "Show why inequality results",
              "explanation": "Factor ownership is very unequal. Labor is relatively equal (everyone has one person's labor). Capital and land are extremely unequal (top 10% own 70% of wealth in US). Since high incomes come from owning capital/land/businesses, and these are unequally owned, income inequality results."
            },
            {
              "step": "Connect to consumption distribution",
              "explanation": "In market economy, income determines consumption. Unequal factor ownership → unequal income → unequal consumption. Top 10% consume far more than bottom 50% because they own most income-producing factors beyond basic labor."
            },
            {
              "step": "Consider implications",
              "explanation": "This distribution system rewards factor ownership. It's efficient (factors go to productive uses) but creates inequality. Children born into wealthy families inherit factor ownership (capital, land), perpetuating inequality across generations. Those with only labor to sell face limited income potential."
            }
          ],
          "final_answer": "In market economies, distribution depends on factor ownership. Factor owners receive income (wages, rent, interest, profit) based on what they own. Since land, capital, and entrepreneurial opportunities are very unequally distributed, income is unequal. This creates unequal consumption—the wealthy (owning many factors) consume much more than workers (owning only labor). Distribution reflects factor ownership patterns.",
          "concept_applied": "'For whom to produce' in markets is answered by factor ownership and income. Those owning productive assets receive income from them and can buy more output. Unequal asset ownership creates unequal distribution. Understanding this explains both market distribution's efficiency (allocates to productive uses) and its inequality (reflects unequal factor ownership)."
        }
      ],
      "image": {
        "src": "images/unit1/for_whom_to_produce.png",
        "alt": "Diagram comparing different distribution mechanisms: market, need, merit, equality",
        "caption": "For whom to produce: different systems distribute output differently—by income, need, merit, or equality"
      }
    },
    {
      "section_title": "How Different Economic Systems Answer These Questions",
      "introduction": "The three fundamental questions are answered differently depending on whether an economy is market-based, command-based, or mixed. Understanding these differences explains economic system variety.",
      "key_concept": {
        "definition": "Economic systems differ primarily in how they answer the three fundamental questions. Market economies use prices, supply, demand, and individual choice. Command economies use central planning and government directives. Mixed economies combine both approaches.",
        "context": "No society leaves these questions unanswered—they must be addressed somehow. The mechanisms used define the economic system type. Each approach has advantages and disadvantages in efficiency, equity, innovation, and individual freedom."
      },
      "categories": [
        {
          "type": "Market Economy Answers",
          "description": "How free market systems address the fundamental questions.",
          "examples": [
            {
              "process": "What: Consumer sovereignty",
              "explanation": "Consumers vote with dollars. Businesses produce what sells profitably. High demand + high prices → more production. Low demand → less production. Example: Smartphone demand high → many companies make smartphones. Flip phone demand low → few produced."
            },
            {
              "process": "How: Cost minimization",
              "explanation": "Businesses choose production methods minimizing costs to maximize profits. Factor prices guide choices. Example: High-wage countries automate (substitute capital for labor). Low-wage countries use labor-intensive methods. Markets automatically push toward efficiency."
            },
            {
              "process": "For whom: Ability to pay",
              "explanation": "Income from factor ownership determines consumption. Markets distribute to highest bidders. Example: Luxury goods to wealthy, basic goods to all who can pay market prices, nothing to those who can't pay."
            },
            {
              "process": "Coordination mechanism: Prices",
              "explanation": "Prices coordinate decisions. No central planner needed—millions of independent decisions guided by price signals. Example: Oil shortage → higher oil prices → producers increase oil production, consumers reduce use → market equilibrates."
            }
          ]
        },
        {
          "type": "Command Economy Answers",
          "description": "How centrally planned systems address the fundamental questions.",
          "examples": [
            {
              "process": "What: Central planning",
              "explanation": "Government planners decide what to produce based on their assessment of needs and priorities. Example: Soviet Five-Year Plans specified steel production, wheat quotas, housing construction—planners decided, not consumers."
            },
            {
              "process": "How: Government directives",
              "explanation": "Planners specify production methods. State-owned enterprises follow instructions. Example: Government might mandate labor-intensive methods to maintain employment even if less efficient, or capital-intensive methods to industrialize rapidly."
            },
            {
              "process": "For whom: Government allocation",
              "explanation": "Central authorities decide distribution through rationing, quotas, or administrative assignment. Example: Soviet citizens assigned apartments, rationed food, received equal shares of some goods regardless of income or preference."
            },
            {
              "process": "Coordination mechanism: Plans and orders",
              "explanation": "Central plans coordinate economy. Bureaucrats issue production targets and allocate resources. Example: Gosplan (Soviet planning agency) created detailed plans for entire economy—what each factory should produce, where resources go."
            }
          ]
        },
        {
          "type": "Mixed Economy Answers",
          "description": "How combined systems address the fundamental questions.",
          "examples": [
            {
              "process": "What: Mostly markets, some government",
              "explanation": "Private sector produces most consumer goods (markets). Government produces some public goods and services. Example: US—private sector makes cars, food, electronics (market). Government provides defense, highways, schools (planning)."
            },
            {
              "process": "How: Market choice with regulations",
              "explanation": "Businesses choose production methods but must follow regulations. Example: Companies minimize costs (market) but must meet environmental standards, safety rules, labor laws (government intervention in 'how')."
            },
            {
              "process": "For whom: Markets with redistribution",
              "explanation": "Income primarily from markets, but government redistributes through taxes and transfers. Example: Most distribution through market earnings, but progressive taxes reduce inequality, welfare programs help poor, public education available to all."
            },
            {
              "process": "Coordination: Price signals and government policy",
              "explanation": "Prices coordinate most activity. Government intervenes for market failures, public goods, equity concerns. Example: Private markets allocate most goods, government steps in for defense, education, environmental protection, income support."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "No System Perfectly Answers All Three Questions",
          "statement": "Every economic system faces trade-offs. Market efficiency may sacrifice equity. Command equity may sacrifice efficiency. Mixed systems balance but satisfy no one completely.",
          "application": "Understanding that all systems have strengths and weaknesses prevents ideological extremism.",
          "example": "Pure market economy: Efficient allocation but significant inequality and market failures. Pure command economy: Can reduce inequality but inefficient, lacks innovation. Mixed economy: Balances trade-offs but criticized by both free-market advocates (too much government) and socialists (too much inequality)."
        },
        {
          "principle": "Most Modern Economies Are Mixed",
          "statement": "Virtually all developed countries use mixed systems, combining markets with varying degrees of government intervention. Pure systems are rare.",
          "application": "The real debate is about the balance—how much market, how much government—not whether to use one or the other exclusively.",
          "example": "US appears market-oriented but has Social Security, Medicare, public schools, highways, defense, regulations—substantial government role. Scandinavian countries appear more socialist but have vibrant private sectors, stock markets, private property—substantial market role. Difference is degree, not absolute type."
        },
        {
          "principle": "Systems Evolve Based on Performance and Values",
          "statement": "Economic systems change over time as societies evaluate performance and shift values. Failed approaches get reformed or abandoned.",
          "application": "Economic systems aren't static. They adapt to problems, new information, and changing societal preferences.",
          "example": "Communist countries (Soviet Union, China) had command economies, reformed toward markets when inefficiency became unbearable. US in 1930s added more government intervention (New Deal) after market failures. System evolution reflects learning from experience."
        }
      ],
      "image": {
        "src": "images/unit1/systems_comparison.png",
        "alt": "Table comparing how market, command, and mixed economies answer the three fundamental questions",
        "caption": "Different economic systems answer What, How, and For Whom differently based on their organizing principles"
      }
    }
  ],
  "key_terms": [
    "What to produce",
    "How to produce",
    "For whom to produce",
    "Consumer sovereignty",
    "Central planning",
    "Factor combinations",
    "Labor-intensive",
    "Capital-intensive",
    "Market distribution",
    "Rationing",
    "Need-based distribution",
    "Merit-based distribution",
    "Income inequality",
    "Economic efficiency",
    "Economic equity"
  ],
  "summary": "All economic systems must answer three fundamental questions arising from scarcity: What to produce, How to produce, and For whom to produce. The 'What' question asks which goods and services should be produced and in what quantities—requiring resource allocation among consumer vs. capital goods, necessities vs. luxuries, and private vs. public goods. Production priorities differ between developed and developing economies, reflecting different resource constraints and needs. The 'How' question asks which production methods and technologies should be used—requiring choices between labor-intensive and capital-intensive methods, traditional and modern technology, and different organizational approaches. Optimal production methods depend on factor prices (expensive labor encourages automation), technology availability, and context (appropriate technology for local conditions). Factor combinations vary across countries—rich countries use capital-intensive methods, poor countries use labor-intensive methods—because factor prices differ. The 'For whom' question asks who receives produced goods—requiring distribution decisions based on income, need, merit, or equality. Market systems distribute based on ability to pay, creating efficiency but potentially inequality. Command systems distribute by government decision, potentially creating equality but ignoring preferences. Need-based distribution serves those most requiring goods. Merit-based distribution rewards achievement. Most systems use mixed approaches. Market economies answer these questions through consumer sovereignty (what), cost minimization (how), and income-based distribution (for whom), coordinated by prices. Command economies use central planning (what), government directives (how), and administrative allocation (for whom), coordinated by plans. Mixed economies combine approaches—mostly markets with government intervention for public goods, regulations, and redistribution. Each system involves trade-offs between efficiency and equity, innovation and stability, individual freedom and collective provision. No system perfectly answers all three questions. Virtually all modern economies are mixed, differing in degree of market versus government rather than using pure systems. Understanding these fundamental questions and alternative answers explains economic system diversity, performance differences, and ongoing policy debates about appropriate balances between market and government."
}
