{
  "expanded_description": "Economic activity involves three main groups of decision-makers: households, firms (businesses), and government. Understanding their distinct roles, objectives, and interactions is essential for comprehending how economies function. Each group makes different types of decisions and pursues different goals, yet their choices are interconnected through markets and policy.",
  "core_concept": {
    "principle": "Economic activity is organized around three primary decision-makers: households (individuals and families), firms (businesses), and government (public sector). Households supply labor and capital, demand goods and services, and make consumption-saving decisions to maximize utility. Firms demand labor and capital, supply goods and services, and make production decisions to maximize profit. Government establishes rules, provides public goods, regulates markets, and pursues objectives like economic stability, equity, and growth. These three groups interact through markets and policy, creating the circular flow of economic activity.",
    "explanation": "Understanding who makes economic decisions and what motivates them is fundamental to economic analysis. Households own the factors of production (labor, land, capital) and make choices about consumption, saving, and labor supply to maximize their well-being (utility). A household decides how many hours to work, what to purchase with earned income, and how much to save for the future—all based on preferences and constraints. Firms organize production by hiring labor, renting capital, and combining resources to produce goods and services. They decide what to produce, how to produce it, and what prices to charge, typically aiming to maximize profit. A business chooses its product mix, production technology, employment level, and pricing strategy based on costs and market demand. Government serves multiple roles: enforcing property rights and contracts (legal framework), providing public goods (defense, infrastructure), correcting market failures (regulation, taxes on externalities), redistributing income (taxes and transfers), and stabilizing the economy (fiscal and monetary policy). Government decisions affect both households and firms through taxation, spending, regulation, and macroeconomic management. These three groups are interdependent: Households supply labor to firms, receive wages, and use income to buy goods from firms. Firms produce goods for households, hire household labor, and pay taxes to government. Government collects taxes from households and firms, provides services to both, and regulates market interactions. This circular flow of income, spending, resources, and goods creates the interconnected economic system. Understanding each decision-maker's objectives, constraints, and choices—and how they interact—is essential for analyzing economic outcomes, predicting responses to policy changes, and comprehending both microeconomic behavior and macroeconomic patterns. Different decision-makers face different incentives and make different choices, yet their actions collectively determine employment, production, prices, growth, and distribution of resources throughout the economy.",
    "image": {
      "src": "images/unit1/economic_decision_makers.png",
      "alt": "Triangle diagram showing households, firms, and government with arrows indicating their interactions",
      "caption": "Three main economic decision-makers: households, firms, and government interact through markets and policy"
    }
  },
  "sections": [
    {
      "section_title": "Households as Economic Decision-Makers",
      "introduction": "Households are the fundamental economic units consisting of individuals or families living together and making joint economic decisions. They play dual roles as suppliers of resources and demanders of goods and services.",
      "key_concept": {
        "definition": "Households are individuals or groups of people living together who make unified economic decisions about consumption, saving, and labor supply. They own factors of production (labor, land, capital), supply these to firms in exchange for income (wages, rent, interest, profit), and use that income to demand goods and services to maximize their utility (satisfaction or well-being).",
        "context": "In economic models, households are the ultimate owners of all resources. Even when corporations own factories or land, households ultimately own the corporations (through stock ownership). Household decisions drive the economy: Their labor supply decisions determine employment, their consumption decisions determine demand for goods, their saving decisions determine capital accumulation. Understanding household objectives and constraints is fundamental to microeconomics."
      },
      "categories": [
        {
          "type": "Household Economic Roles",
          "description": "The multiple functions households serve in the economy.",
          "examples": [
            {
              "process": "Suppliers of labor",
              "explanation": "Households decide how much to work and what occupations to pursue, supplying labor to firms in exchange for wages. Example: Individual chooses to work 40 hours per week as a nurse, earning \\$60,000 annually. Household supplies 2,080 hours of skilled labor to healthcare market, receiving wage income."
            },
            {
              "process": "Owners of capital",
              "explanation": "Households own financial and physical capital, supplying it to businesses in exchange for interest, dividends, or profit. Example: Household owns \\$100,000 in stocks and bonds, earning \\$5,000 annually in dividends and interest. Household supplies capital to firms, receiving capital income."
            },
            {
              "process": "Landowners",
              "explanation": "Households own land and natural resources, supplying these to others for rent or profit. Example: Household owns apartment building, rents units to tenants for \\$30,000 annually. Or household owns farmland, leases to farmer for \\$10,000. Household supplies land, receives rent income."
            },
            {
              "process": "Consumers of goods and services",
              "explanation": "Households use income to purchase goods and services for consumption. Example: Household with \\$75,000 income spends: \\$20,000 on housing, \\$12,000 on food, \\$8,000 on transportation, \\$6,000 on healthcare, \\$15,000 on other goods. Households are primary demanders of consumer goods."
            },
            {
              "process": "Savers and investors",
              "explanation": "Households decide how much income to save versus consume, providing funds for investment. Example: Household earns \\$80,000, consumes \\$68,000, saves \\$12,000 in retirement account. Household saving becomes available for firms to borrow for investment or government to borrow for spending."
            },
            {
              "process": "Taxpayers",
              "explanation": "Households pay taxes to government on income, property, and consumption. Example: Household pays: \\$15,000 income tax, \\$3,000 property tax, \\$2,000 sales tax. Total \\$20,000 to government. Taxes transfer resources from households to government."
            }
          ]
        },
        {
          "type": "Household Objectives and Decision-Making",
          "description": "What households try to achieve and how they make choices.",
          "examples": [
            {
              "process": "Utility maximization",
              "explanation": "Households seek to maximize utility (satisfaction, well-being, happiness) subject to budget constraints. Example: Household allocates \\$5,000 monthly income across housing, food, entertainment, savings to get maximum satisfaction. Chooses combination providing greatest utility given income limitation."
            },
            {
              "process": "Budget constraints",
              "explanation": "Households face limits—cannot spend more than income (plus savings/borrowing). Must prioritize. Example: Household wants \\$80,000 worth of goods but earns only \\$60,000. Must choose which wants to satisfy. Budget constraint forces trade-offs—more spending on housing means less for travel."
            },
            {
              "process": "Time constraints",
              "explanation": "Households have only 24 hours daily. Must allocate between work (earning income) and leisure (consuming free time). Example: Person works 8 hours, sleeps 8 hours, has 8 hours for leisure, household tasks, personal care. More work hours mean more income but less leisure—trade-off household must balance."
            },
            {
              "process": "Consumption-saving trade-off",
              "explanation": "Households decide how much to consume now versus save for future. Example: Household earns \\$70,000. Option A: Consume all \\$70,000 now, nothing saved for retirement. Option B: Consume \\$60,000, save \\$10,000 for future. Choice reflects time preferences—how much household values present versus future consumption."
            },
            {
              "process": "Risk and uncertainty",
              "explanation": "Households face uncertain income, health, life expectancy. Must make choices without perfect information. Example: Household buys health insurance even when healthy (risk management). Saves emergency fund for unexpected job loss. Diversifies investments to reduce risk. Uncertainty affects all household decisions."
            },
            {
              "process": "Family and social considerations",
              "explanation": "Household decisions involve multiple people with different preferences, requiring negotiation and compromise. Example: Spouses disagree on spending priorities—one wants new car, other wants home renovation. Children's needs affect household budget. Extended family obligations influence decisions. Households optimize for multiple people's welfare."
            }
          ]
        },
        {
          "type": "Types of Household Decisions",
          "description": "Major categories of choices households make.",
          "examples": [
            {
              "process": "Labor supply decisions",
              "explanation": "How much to work, which occupation, whether multiple household members work. Example: Decisions include: Work full-time (40 hours) or part-time (20 hours)? Pursue high-paying but stressful career or lower-paying but flexible job? Should both spouses work or one stay home with children? Retire at 62 or work until 67? Labor supply decisions determine household income."
            },
            {
              "process": "Consumption allocation",
              "explanation": "How to divide budget among different goods and services. Example: From \\$6,000 monthly income, allocate: \\$1,800 housing, \\$800 food, \\$600 transportation, \\$400 utilities, \\$300 entertainment, \\$200 clothing, \\$1,900 other. Consumption choices reflect priorities and prices."
            },
            {
              "process": "Saving and investment",
              "explanation": "How much to save, where to invest (stocks, bonds, real estate, retirement accounts). Example: Household saves 15% of income (\\$9,000 annually from \\$60,000). Allocates: \\$5,000 to 401(k), \\$3,000 to emergency fund, \\$1,000 to college savings. Investment choices involve risk-return trade-offs."
            },
            {
              "process": "Human capital investment",
              "explanation": "Whether to pursue education, training, skill development to increase future earning potential. Example: Decisions include: Attend college (cost \\$100,000, potential earning increase \\$20,000/year)? Learn programming to change careers? Get MBA to advance at work? Human capital investments have costs (tuition, time, foregone earnings) and benefits (higher future income)."
            },
            {
              "process": "Major purchases",
              "explanation": "Decisions about large, infrequent purchases like housing, vehicles, appliances. Example: Buy \\$300,000 house with 30-year mortgage? New car (\\$35,000) or used (\\$18,000)? These decisions involve large commitments of household resources and long-term implications."
            },
            {
              "process": "Family planning",
              "explanation": "Number of children, timing, childcare arrangements have enormous economic implications. Example: Having two children involves costs: Housing (larger home), food, clothing, education (\\$250,000+ per child to age 18), childcare (\\$12,000/year), lost wages if parent reduces work. Family size is partly economic decision with massive financial consequences."
            }
          ]
        },
        {
          "type": "Factors Influencing Household Decisions",
          "description": "What affects household choices and behavior.",
          "examples": [
            {
              "process": "Income level",
              "explanation": "Higher income relaxes budget constraint, enabling more consumption and saving. Example: Household earning \\$40,000 struggles to save, consumes mostly necessities. Household earning \\$150,000 saves substantial amount, can afford luxuries. Income is primary constraint on household choices."
            },
            {
              "process": "Prices",
              "explanation": "Relative prices affect consumption choices. Households substitute toward relatively cheaper goods. Example: Gas price rises 50%: Household drives less, buys more fuel-efficient car, uses public transit more. Price changes alter consumption patterns as households respond to price signals."
            },
            {
              "process": "Preferences and tastes",
              "explanation": "Individual values, cultural background, personal history shape what households want. Example: Some households prioritize experiences (travel, dining out), others prioritize possessions (house, cars). Some value security, others adventure. Preferences vary enormously, creating diverse consumption patterns."
            },
            {
              "process": "Life cycle stage",
              "explanation": "Household needs and priorities change with age. Example: Young singles: Low income, few assets, spend on education and entertainment. Young families: Higher expenses (children, housing), save for education. Middle-aged: Peak earnings, save for retirement. Retirees: Fixed income, spend down savings. Life stage dramatically affects household decisions."
            },
            {
              "process": "Expectations",
              "explanation": "Beliefs about future income, prices, economy affect current decisions. Example: Expecting job loss soon: Household reduces spending, increases saving (precautionary). Expecting promotion and raise: Household increases spending, may take on debt. Expecting inflation: Household buys durable goods now before prices rise. Expectations shape behavior."
            },
            {
              "process": "Economic conditions",
              "explanation": "Recession, boom, unemployment rate, interest rates affect household confidence and opportunities. Example: During recession: Households worry about job security, reduce spending, increase saving even if not directly affected. During boom: Households feel confident, spend more, save less. Macroeconomic conditions influence microeconomic household decisions."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Households Face Trade-Offs in All Decisions",
          "statement": "Every household choice involves sacrificing one alternative for another due to limited income and time. More of one thing means less of another.",
          "application": "Understanding household behavior requires recognizing these trade-offs and how they're resolved.",
          "example": "Household with \\$500 discretionary income faces trade-offs: Spend on new phone (\\$500) OR weekend trip (\\$400) plus dinner out (\\$100). Work extra 10 hours (\\$300 more income) OR leisure time with family. Save \\$500 for retirement OR enjoy now. Every choice involves opportunity cost—value of next best alternative foregone."
        },
        {
          "principle": "Households Respond to Incentives",
          "statement": "Changes in prices, wages, taxes, or other incentives alter household behavior predictably. Households react to make themselves better off given new conditions.",
          "application": "Policy affects household decisions through incentive changes.",
          "example": "Tax deduction for mortgage interest: Households more likely to buy homes rather than rent—incentive favors ownership. Higher gas taxes: Households drive less, buy fuel-efficient cars—price incentive changes behavior. Earned Income Tax Credit: Low-wage households work more—income subsidy increases labor supply incentive."
        },
        {
          "principle": "Households Are Heterogeneous",
          "statement": "Households differ enormously in income, wealth, preferences, constraints, and circumstances. Economic analysis must account for this diversity.",
          "application": "One-size-fits-all policies affect different households very differently.",
          "example": "\\$1,000 tax rebate: For household earning \\$30,000, this is 3.3% of income—significant. For household earning \\$300,000, this is 0.33% of income—negligible. Same policy, vastly different impact. Carbon tax affects rural households (must drive) more than urban households (public transit available). Policy effects depend on household characteristics."
        },
        {
          "principle": "Households Supply Factors, Demand Products",
          "statement": "Households play dual role: Supply side of factor markets (labor, capital, land), demand side of product markets (goods, services). This dual role is fundamental to circular flow.",
          "application": "Household income depends on factor market participation; household spending depends on income and product prices.",
          "example": "Household supplies: Labor (40 hours/week as accountant) earning \\$75,000, Capital (\\$50,000 invested in stocks) earning \\$3,000 dividends. Total income: \\$78,000. Household demands: Housing, food, transportation, healthcare, etc., spending \\$65,000. Remainder saved. Dual role connects factor and product markets."
        }
      ],
      "worked_examples": [
        {
          "title": "Household Budget Constraint and Trade-offs",
          "problem": "A household earns \\$5,000 monthly (after taxes). Essential expenses are: Rent \\$1,500, Food \\$600, Utilities \\$200, Transportation \\$400, Insurance \\$300. This leaves \\$2,000 discretionary. Household wants: Emergency fund (\\$500/month), Retirement savings (\\$500/month), Vacation fund (\\$400/month), Entertainment (\\$300/month), Dining out (\\$200/month), New furniture (\\$300/month). Total wants: \\$2,200. Explain the household's economic problem and how it must make choices.",
          "step_by_step": [
            {
              "step": "Identify the scarcity",
              "explanation": "Household has \\$2,000 discretionary income but wants to allocate \\$2,200. Wants exceed resources by \\$200. Scarcity forces choice—cannot satisfy all wants simultaneously."
            },
            {
              "step": "Recognize the budget constraint",
              "explanation": "Cannot spend more than \\$2,000 without borrowing or reducing essential expenses. Budget constraint: Total discretionary spending ≤ \\$2,000. This is fundamental limitation household faces."
            },
            {
              "step": "Identify trade-offs",
              "explanation": "Every dollar allocated to one category cannot be spent on another. Trade-offs: More emergency savings → less for vacation or entertainment. More dining out → less for retirement or furniture. Each choice involves sacrifice."
            },
            {
              "step": "Consider priorities",
              "explanation": "Household must rank priorities. Likely ranking (varies by household): Emergency fund (high priority—financial security), Retirement savings (high—long-term security), Essential consumption needs, Vacation, entertainment (medium—quality of life), Furniture (lower—can delay). Priorities guide allocation."
            },
            {
              "step": "Make allocation decision",
              "explanation": "Possible allocation: Emergency fund \\$500 (essential for security), Retirement \\$500 (high priority), Entertainment \\$300, Vacation \\$400, Dining \\$200, Furniture \\$100 (reduced from \\$300 want). Total: \\$2,000. Trade-off: Delayed furniture purchase to fit budget while maintaining priorities."
            },
            {
              "step": "Recognize opportunity cost",
              "explanation": "Choosing this allocation means: Opportunity cost of emergency fund (\\$500) is \\$500 less for other uses. Opportunity cost of cutting furniture to \\$100 is \\$200 worth of furniture enjoyment foregone. Every choice has opportunity cost—value of next best alternative."
            }
          ],
          "final_answer": "Household faces fundamental economic problem: Scarcity (wants \\$2,200, has \\$2,000). Must make choices given budget constraint. Trade-offs required—more of one thing means less of another. Solution requires prioritizing based on values and circumstances. Likely: Maintain high-priority items (emergency fund, retirement), reduce low-priority items (furniture). Every choice involves opportunity cost. This illustrates how all households face scarcity, constraints, trade-offs, and opportunity costs in resource allocation.",
          "concept_applied": "Households exemplify fundamental economic concepts: Scarcity (limited income vs. unlimited wants), Budget constraints (cannot spend more than income), Trade-offs (every dollar allocated to X cannot be spent on Y), Opportunity cost (value of best alternative foregone), Prioritization (ranking wants to guide allocation). These concepts apply to all household decisions, from daily choices to major life decisions."
        }
      ],
      "image": {
        "src": "images/unit1/household_circular_flow.png",
        "alt": "Diagram showing households supplying factors to firms, receiving income, and demanding goods",
        "caption": "Households supply labor and capital to firms, receive income, and use income to demand goods and services"
      }
    },
    {
      "section_title": "Firms as Economic Decision-Makers",
      "introduction": "Firms (businesses) are organizations that combine resources to produce goods and services for sale. They make production, pricing, and employment decisions to achieve their objectives.",
      "key_concept": {
        "definition": "Firms are business organizations that demand factors of production (labor, capital, land) from households, combine these inputs to produce goods and services, and supply these products to households and other firms. The primary objective of most firms is profit maximization—achieving the largest possible difference between total revenue and total cost.",
        "context": "Firms are the productive engines of market economies. They organize resources, coordinate production, introduce innovations, and create employment. Understanding firm behavior is central to microeconomics: How do firms decide what to produce and how much? How do they choose production methods and employment levels? How do they set prices? These decisions determine economy-wide production, employment, and efficiency."
      },
      "categories": [
        {
          "type": "Firm Economic Roles",
          "description": "The functions firms serve in the economy.",
          "examples": [
            {
              "process": "Producers of goods and services",
              "explanation": "Firms transform inputs into outputs that satisfy consumer needs and wants. Example: Automobile manufacturer combines: Labor (assembly workers, engineers, managers), Capital (factories, robots, tools), Materials (steel, glass, electronics) to produce cars. Creates value by transforming raw materials and components into finished products consumers want."
            },
            {
              "process": "Employers of labor",
              "explanation": "Firms demand labor from households, providing employment and wage income. Example: Restaurant employs: 10 servers, 5 cooks, 2 managers, 3 support staff. Pays \\$600,000 annually in wages. Firm's labor demand creates employment and income for 20 households."
            },
            {
              "process": "Users of capital",
              "explanation": "Firms borrow funds, rent equipment, invest in machinery and buildings. Example: Manufacturing company: Borrows \\$5 million for new factory (pays \\$300,000 annual interest to lenders), Leases delivery trucks (pays \\$50,000 annually), Owns machinery. Firm demands capital from household savers and investors."
            },
            {
              "process": "Innovators",
              "explanation": "Firms develop new products, technologies, and production methods seeking competitive advantage and profit. Example: Pharmaceutical company invests \\$2 billion in research and development, discovers new drug, patents it, earns billions in revenue. Innovation drive creates technological progress and economic growth."
            },
            {
              "process": "Taxpayers",
              "explanation": "Firms pay various taxes to government on profits, property, sales. Example: Corporation pays: \\$2 million corporate income tax, \\$500,000 property tax, collects and remits \\$1 million sales tax. Contributes \\$3.5 million to government revenue."
            },
            {
              "process": "Risk bearers",
              "explanation": "Firms (and their owners) accept uncertainty and potential losses in pursuit of profit. Example: Startup invests \\$10 million in new product. Might succeed (profit) or fail (loss). Entrepreneurs and investors bear this risk. Risk-bearing enables innovation and dynamism but creates potential for failure."
            }
          ]
        },
        {
          "type": "Firm Objectives and Decision-Making",
          "description": "What firms try to achieve and how they make choices.",
          "examples": [
            {
              "process": "Profit maximization",
              "explanation": "Most firms seek to maximize profit: Total Revenue - Total Cost. This drives production, pricing, and employment decisions. Example: Firm produces widgets. Revenue: \\$10 per widget × 10,000 widgets = \\$100,000. Costs: \\$60,000 (labor, materials, overhead). Profit: \\$100,000 - \\$60,000 = \\$40,000. Firm chooses output level and price maximizing this profit."
            },
            {
              "process": "Cost minimization",
              "explanation": "For any output level, firms choose production methods minimizing costs. Example: Producing 1,000 units. Method A: \\$30,000 cost. Method B: \\$25,000 cost (same output, lower cost). Rational firm chooses Method B. Cost minimization increases profit for any given revenue."
            },
            {
              "process": "Market share and growth",
              "explanation": "Some firms prioritize sales growth or market dominance over short-term profit. Example: Amazon sacrificed profits for years to gain market share, investing heavily in logistics, technology, customer base. Long-term strategy: Dominate e-commerce, then profit from scale and position. Short-term profit sacrificed for long-term value."
            },
            {
              "process": "Revenue maximization",
              "explanation": "Some firms (especially managerial capitalism) may prioritize sales revenue over profit. Example: Firm managers compensated based on company size (revenue) rather than profit. May expand beyond profit-maximizing point to increase revenue and personal compensation. Agency problem: Manager objectives differ from owner objectives."
            },
            {
              "process": "Survival and stability",
              "explanation": "In uncertain environments, firms may prioritize survival and risk reduction over maximum profit. Example: During recession, firm reduces risky investments, builds cash reserves, focuses on core business even if this means lower profit potential. Survival becomes primary goal when viability is threatened."
            },
            {
              "process": "Social and environmental objectives",
              "explanation": "Some firms pursue social missions alongside or instead of pure profit. Example: Benefit corporations (B-corps) legally required to consider social and environmental impact, not just shareholder profit. Patagonia prioritizes environmental sustainability even when it reduces profit. These represent alternative objectives to pure profit maximization."
            }
          ]
        },
        {
          "type": "Types of Firm Decisions",
          "description": "Major categories of choices firms make.",
          "examples": [
            {
              "process": "What to produce",
              "explanation": "Product mix decisions based on profitability and capabilities. Example: Farmer chooses between: Corn (expected profit \\$600/acre), Soybeans (\\$800/acre), Wheat (\\$500/acre). Rational choice: Soybeans. Firm allocates resources to most profitable products given market conditions."
            },
            {
              "process": "How much to produce",
              "explanation": "Output level balancing revenue and cost. Example: Bakery considers producing 100, 200, or 300 loaves daily. Analysis: At 100: Profit \\$200. At 200: Profit \\$500 (maximum). At 300: Profit \\$400 (costs rise faster than revenue). Optimal output: 200 loaves—where marginal revenue equals marginal cost."
            },
            {
              "process": "Production methods",
              "explanation": "Technology and factor combinations (capital-intensive vs. labor-intensive). Example: Warehouse automation decision: Option A: Manual system—50 workers at \\$30,000 each = \\$1.5M/year, low capital cost. Option B: Robotic system—10 workers at \\$50,000 = \\$500K, plus \\$800K/year capital cost = \\$1.3M total. Choose Option B: Lower total cost. Factor prices and technology determine production method."
            },
            {
              "process": "Employment decisions",
              "explanation": "How many workers to hire at what wages. Example: Construction firm expanding. Hire additional worker: Produces \\$60,000 value, Costs \\$45,000 (wage + benefits). Net benefit: \\$15,000. Hire until additional worker's value equals cost (marginal revenue product = wage). Determines employment level."
            },
            {
              "process": "Pricing strategies",
              "explanation": "Setting prices based on costs, demand, and competition. Example: Competitive firm: Takes market price (\\$50/unit)—no pricing power. Monopolist: Sets price (chooses \\$80/unit) to maximize profit. Oligopolist: Strategic pricing considering competitor reactions. Market structure determines pricing approach."
            },
            {
              "process": "Investment in capital",
              "explanation": "Whether to expand capacity, upgrade technology, enter new markets. Example: Company considers \\$10 million factory expansion. Expected return: \\$1.5 million annually. Interest rate: 8% (cost of capital = \\$800,000). Net benefit: \\$700,000 annually. Positive return → invest. Investment decisions drive economic growth."
            },
            {
              "process": "Innovation and R&D",
              "explanation": "How much to invest in research, development, and innovation. Example: Pharmaceutical company invests \\$200 million in drug development. Expected: 10% chance of success, potential \\$5 billion revenue. Expected value: \\$500 million. Exceeds cost → worthwhile investment. Innovation involves risk but creates competitive advantage."
            }
          ]
        },
        {
          "type": "Factors Influencing Firm Decisions",
          "description": "What affects firm choices and behavior.",
          "examples": [
            {
              "process": "Market demand",
              "explanation": "Consumer willingness to buy at different prices determines firm revenue potential. Example: High demand for electric vehicles → Tesla expands production, invests in new factories. Low demand for landline phones → firms exit industry, reduce production. Demand conditions fundamentally shape firm decisions."
            },
            {
              "process": "Input costs",
              "explanation": "Wages, material prices, rent, energy costs affect profitability and production choices. Example: Steel prices double → automakers: Reduce production (expensive inputs), Substitute aluminum where possible, Pass costs to consumers through higher prices, Some firms exit industry. Input costs constrain firm choices."
            },
            {
              "process": "Technology",
              "explanation": "Available production methods and efficiency determine what's possible and profitable. Example: E-commerce technology enables Amazon to operate with fewer physical stores, lower costs than traditional retailers. Automation technology allows manufacturing with fewer workers. Technology determines production possibilities."
            },
            {
              "process": "Competition",
              "explanation": "Number of competitors, their actions, and market power affect pricing and profit. Example: Many competitors (perfect competition): Firms are price-takers, earn zero economic profit long-run. Few competitors (oligopoly): Strategic interaction, potential for above-normal profit. No competitors (monopoly): Price-setter, can earn sustained profit. Competition level fundamentally changes firm behavior."
            },
            {
              "process": "Regulation",
              "explanation": "Government rules constrain production methods, pricing, employment practices. Example: Environmental regulations require pollution controls (increases costs). Labor laws mandate minimum wage, safety standards. Antitrust laws prevent monopolistic practices. Regulation affects feasible strategies and profitability."
            },
            {
              "process": "Expectations",
              "explanation": "Beliefs about future demand, costs, competition, economy influence current decisions. Example: Expecting recession: Firms reduce hiring, delay expansion, build cash reserves. Expecting growth: Firms expand capacity, hire aggressively, invest heavily. Expectations drive investment and employment decisions."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Firms Produce Where Marginal Revenue Equals Marginal Cost",
          "statement": "Profit-maximizing firms expand output until the revenue from producing one more unit (marginal revenue) equals the cost of producing it (marginal cost). This determines optimal output level.",
          "application": "Understanding MR = MC principle explains firm production decisions and responses to cost or demand changes.",
          "example": "Firm producing software licenses. 1000th license: Marginal revenue \\$50, marginal cost \\$30 → produce (adds \\$20 profit). 2000th license: MR \\$50, MC \\$50 → indifferent (breakeven). 3000th license: MR \\$50, MC \\$70 → don't produce (loses \\$20). Profit maximized at ~2000 licenses where MR = MC."
        },
        {
          "principle": "Firms Face Different Market Structures with Different Constraints",
          "statement": "Firm behavior depends on market structure: Perfect competition (price takers, no market power), Monopolistic competition (some differentiation), Oligopoly (strategic interaction), Monopoly (price setters). Structure determines pricing power and profit potential.",
          "application": "Market structure analysis predicts firm behavior and outcomes.",
          "example": "Wheat farmer (perfect competition): Takes market price \\$6/bushel, cannot charge more or less—no pricing power. Apple (oligopoly): Sets iPhone price considering competitor reactions—strategic pricing. Local utility (monopoly): Sets price to maximize profit—substantial pricing power. Different structures, different behaviors."
        },
        {
          "principle": "Firms Respond to Incentives",
          "statement": "Changes in prices, costs, taxes, subsidies, regulations alter firm behavior predictably. Firms adjust to maximize profit under new conditions.",
          "application": "Policy affects firm decisions through incentive changes.",
          "example": "Carbon tax imposed: Firms reduce emissions (now costly), Invest in clean technology, Pass costs to consumers, Some firms exit high-emission industries. Tax creates incentive to reduce emissions. Alternatively, R&D tax credit: Firms increase research spending (now cheaper), Develop more innovations. Subsidy creates incentive to innovate."
        },
        {
          "principle": "Entry and Exit Respond to Profit",
          "statement": "Positive economic profit attracts new firms into industry (entry). Economic losses cause firms to leave (exit). This process drives long-run competitive markets toward zero economic profit.",
          "application": "Explains industry dynamics and long-run market equilibrium.",
          "example": "Industry earning high profits (returns exceed opportunity cost): New firms enter attracted by profit → supply increases → prices fall → profit decreases → entry slows. Eventually: Free entry/exit drives economic profit to zero in competitive markets. Profit serves as signal guiding resource allocation across industries."
        }
      ],
      "image": {
        "src": "images/unit1/firm_circular_flow.png",
        "alt": "Diagram showing firms demanding factors from households, producing goods, and selling to households",
        "caption": "Firms demand labor and capital from households, produce goods and services, and sell output to households and other firms"
      }
    },
    {
      "section_title": "Government as Economic Decision-Maker",
      "introduction": "Government (public sector) plays multiple economic roles distinct from households and firms. It establishes legal framework, provides public goods, corrects market failures, redistributes income, and manages macroeconomic performance.",
      "key_concept": {
        "definition": "Government is the public sector authority that makes collective decisions about resource allocation, establishes and enforces rules for economic activity, provides goods and services that markets under-provide, corrects market failures through regulation and policy, redistributes income through taxes and transfers, and pursues macroeconomic objectives like full employment, price stability, and economic growth.",
        "context": "Government's economic role differs fundamentally from households (which maximize utility) and firms (which maximize profit). Government pursues multiple, sometimes competing objectives: Economic efficiency, Equity and fairness, Stability and growth, National security, Environmental protection, Social welfare. These objectives require collective decision-making through political processes, not market mechanisms. Government decisions affect all economic actors through laws, regulations, spending, and taxation."
      },
      "categories": [
        {
          "type": "Government Economic Roles",
          "description": "The major functions government serves in the economy.",
          "examples": [
            {
              "process": "Establishing legal and institutional framework",
              "explanation": "Defining and enforcing property rights, contracts, laws enabling market economy to function. Example: Government: Defines ownership (who owns what), Enforces contracts (courts resolve disputes), Protects property (police, legal system), Establishes currency (legal tender, central bank). Without these institutions, markets cannot function—no one would trade without enforceable contracts or secure property rights."
            },
            {
              "process": "Providing public goods",
              "explanation": "Supplying goods that markets under-provide due to non-excludability and non-rivalry. Example: National defense: Protects all citizens, cannot exclude non-payers, one person's protection doesn't reduce others'. Markets won't provide adequately (free-rider problem). Government funds through taxes. Other public goods: Street lighting, basic research, clean air, public parks."
            },
            {
              "process": "Correcting externalities",
              "explanation": "Addressing costs or benefits that affect third parties not involved in transactions. Example: Pollution (negative externality): Factory imposes costs on others through pollution. Government: Regulates emissions, taxes pollution, requires cleanup. Forces firms to internalize external costs. Education (positive externality): Benefits society beyond individual student. Government: Subsidizes education to encourage more than market would provide."
            },
            {
              "process": "Regulating markets",
              "explanation": "Preventing monopoly power, ensuring competition, protecting consumers and workers. Example: Antitrust enforcement: Prevents monopolies, breaks up anti-competitive mergers. Consumer protection: Food and drug safety (FDA), product safety standards, fraud prevention. Labor protection: Minimum wage, workplace safety (OSHA), anti-discrimination laws. Financial regulation: Banking rules, securities oversight (SEC)."
            },
            {
              "process": "Redistributing income",
              "explanation": "Transferring resources from higher-income to lower-income groups for equity goals. Example: Progressive taxes: Higher earners pay larger percentage. Transfer programs: Social Security, unemployment insurance, food assistance, Medicaid. Effects: Reduces inequality, provides safety net, but may reduce work incentives. Redistribution reflects societal values about fairness."
            },
            {
              "process": "Stabilizing the economy",
              "explanation": "Using fiscal and monetary policy to manage business cycles, unemployment, and inflation. Example: Recession response: Increase government spending (fiscal stimulus), Cut taxes, Lower interest rates (monetary stimulus) → boost aggregate demand, reduce unemployment. Inflation response: Reduce spending, Raise taxes, Increase interest rates → cool economy, control prices. Macroeconomic management aims for stable growth."
            },
            {
              "process": "Promoting economic growth",
              "explanation": "Investing in infrastructure, education, research to increase long-term productive capacity. Example: Infrastructure: Highways, ports, broadband enabling commerce. Education: Public schools, universities developing human capital. Research: Funding basic science, technology development. These investments have positive externalities and long time horizons, justifying government role."
            }
          ]
        },
        {
          "type": "Government Decision-Making Processes",
          "description": "How government makes economic choices—distinct from household and firm decision-making.",
          "examples": [
            {
              "process": "Political process",
              "explanation": "Government decisions made through voting, representation, political negotiation—not market prices. Example: Highway funding: Decided by legislature through voting, not consumer purchasing decisions. Reflects political coalitions, lobbying, constituent pressures, ideology. Different from market where dollars determine allocation. Political process aggregates diverse preferences but may not reflect economic efficiency."
            },
            {
              "process": "Competing objectives",
              "explanation": "Government balances multiple goals that may conflict. Example: Efficiency vs. equity: Efficient markets create inequality; redistribution reduces efficiency. Growth vs. environment: Economic growth may harm environment; environmental protection may slow growth. Freedom vs. security: Regulation limits freedom but protects from harm. Government must weigh competing values that markets don't consider."
            },
            {
              "process": "Interest group influence",
              "explanation": "Organized groups lobby for policies benefiting them, affecting government decisions. Example: Agricultural subsidies: Farm lobbies push for support despite economic inefficiency. Trade protection: Domestic industries lobby for tariffs despite consumer harm. Concentrated benefits (to lobbying group) and diffuse costs (to general public) create incentive for inefficient policies favoring special interests."
            },
            {
              "process": "Voter preferences",
              "explanation": "Democratic governments responsive to voter demands and electoral incentives. Example: Politicians favor policies with visible benefits before elections (spending increases, tax cuts) and delay costs until after (tax increases, spending cuts). Creates political business cycle. Short-term voter focus may conflict with long-term policy needs."
            },
            {
              "process": "Information and expertise",
              "explanation": "Government must make complex decisions with incomplete information and varying expertise. Example: Climate policy: Requires scientific understanding, economic analysis, technological assessment, political feasibility. Government officials may lack expertise, rely on advisors, face disagreement among experts. Information problems affect policy quality."
            },
            {
              "process": "Implementation challenges",
              "explanation": "Government policies require bureaucratic administration, enforcement, monitoring. Example: Tax system: Requires IRS to collect, monitor compliance, enforce penalties. Complex tax code creates administrative burden, compliance costs, opportunities for evasion. Implementation difficulties mean actual policy outcomes may differ from intended effects."
            }
          ]
        },
        {
          "type": "Government Revenue Sources",
          "description": "How government finances its activities.",
          "examples": [
            {
              "process": "Income taxes",
              "explanation": "Taxes on individual and corporate income. Usually progressive (higher rates for higher income). Example: US federal income tax: Individual rates 10%-37% (progressive brackets). Corporate rate 21%. Largest federal revenue source (~50%). Affects work incentives, investment decisions, income distribution."
            },
            {
              "process": "Payroll taxes",
              "explanation": "Taxes on wages funding Social Security and Medicare. Example: Social Security: 12.4% of wages (split employer/employee), Medicare: 2.9%. Total 15.3% on wages. Second-largest federal revenue source (~35%). Affects labor costs and employment decisions."
            },
            {
              "process": "Sales and excise taxes",
              "explanation": "Taxes on purchases of goods and services. Example: State sales taxes (0-10% varying by state), Excise taxes on specific goods (gas, cigarettes, alcohol). Regressive impact (hit lower-income households harder as percentage of income). Affect consumption patterns."
            },
            {
              "process": "Property taxes",
              "explanation": "Taxes on real estate value. Primary local government revenue. Example: Residential property tax: 1% of home value annually (varies widely). On \\$300,000 home: \\$3,000 annually. Funds local schools, services. Affects housing costs and location decisions."
            },
            {
              "process": "Borrowing (deficits)",
              "explanation": "Government spending exceeds revenue, borrows difference by issuing bonds. Example: Federal deficit \\$1.7 trillion (2023): Spending \\$6.1 trillion, Revenue \\$4.4 trillion, Difference borrowed through Treasury bonds. Allows spending beyond current revenue but creates debt that must be repaid with future taxes or inflation."
            }
          ]
        },
        {
          "type": "Government Spending Categories",
          "description": "How government uses resources.",
          "examples": [
            {
              "process": "Transfer payments",
              "explanation": "Money distributed to individuals without requiring goods or services in return. Example: Social Security (\\$1.2 trillion), Medicare/Medicaid (\\$1.5 trillion), Unemployment insurance, Food assistance. Largest spending category. Redistributes income from taxpayers to beneficiaries."
            },
            {
              "process": "Public goods and services",
              "explanation": "Direct provision of goods and services government produces. Example: National defense (\\$800 billion), Education (schools, universities), Infrastructure (roads, bridges), Public safety (police, fire, courts), Parks and recreation. Government employs workers, purchases materials, provides services."
            },
            {
              "process": "Interest on debt",
              "explanation": "Payments to bondholders who lent to government. Example: Federal interest payments: ~\\$640 billion annually (2023), Growing due to increasing debt (~\\$34 trillion). Interest consumes budget resources without providing current services. Rising interest rates increase this burden."
            },
            {
              "process": "Subsidies and grants",
              "explanation": "Financial support to firms, industries, or lower governments. Example: Agricultural subsidies (\\$20 billion), Energy subsidies (fossil fuels, renewables), State and local grants (education, highways, healthcare). Affects resource allocation and supports policy objectives."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Government Addresses Market Failures",
          "statement": "Government intervention justified when markets fail to allocate resources efficiently: Public goods, Externalities, Monopoly power, Information asymmetries, Coordination problems. Government action can improve outcomes when markets fail.",
          "application": "Identify market failures to determine appropriate government role.",
          "example": "Market failure: Pollution—firms don't account for environmental costs, overproduce dirty goods. Government solution: Carbon tax forces firms to internalize costs, reduces pollution efficiently. Market failure: Public goods—private markets under-provide national defense. Government solution: Tax-funded military provides defense for all."
        },
        {
          "principle": "Government Decisions Involve Political as Well as Economic Considerations",
          "statement": "Unlike households (utility) or firms (profit), government pursues multiple objectives through political processes. Economic efficiency is one goal among several (equity, stability, security, etc.).",
          "application": "Government policies reflect political compromises, not just economic optimization.",
          "example": "Agricultural subsidies are economically inefficient (cost exceeds benefits, distorts markets) but politically popular in farming states. Persist because: Concentrated benefits to farmers (strong lobby), Diffuse costs to taxpayers (weak opposition), Electoral importance of farm states. Political logic differs from economic logic."
        },
        {
          "principle": "Government Intervention Has Costs and Unintended Consequences",
          "statement": "Government action to correct market failures or pursue objectives creates its own costs: Deadweight loss from taxes, Unintended behavioral responses, Administrative costs, Rent-seeking (lobbying for favorable policies). Government failure can replace market failure.",
          "application": "Evaluate government intervention against realistic alternative, not perfect ideal.",
          "example": "Minimum wage: Intended to help low-wage workers. Unintended effect: Reduces employment for some workers (those whose productivity is below minimum). Administrative cost: Monitoring and enforcement. Political effect: Lobbying over wage level. Net effect ambiguous—helps some workers, hurts others. Government intervention involves trade-offs, not pure solutions."
        },
        {
          "principle": "Fiscal and Monetary Policy Affect Macroeconomic Outcomes",
          "statement": "Government (fiscal policy) and central bank (monetary policy) influence aggregate demand, output, employment, and inflation through spending, taxes, and interest rates.",
          "application": "Macroeconomic policy is powerful tool for stabilization but faces trade-offs and limitations.",
          "example": "Recession response: Government increases spending \\$500 billion (fiscal stimulus), Federal Reserve cuts interest rates to near zero (monetary stimulus). Effect: Aggregate demand increases, GDP grows faster, unemployment falls. But: Budget deficit increases, potential future inflation, debt burden rises. Policy involves trade-offs between current stimulus and future costs."
        }
      ],
      "image": {
        "src": "images/unit1/government_economic_roles.png",
        "alt": "Diagram showing government's multiple economic roles: rules, public goods, regulation, redistribution, stabilization",
        "caption": "Government serves multiple economic roles: legal framework, public goods, market correction, redistribution, macroeconomic management"
      }
    },
    {
      "section_title": "Interactions Among Decision-Makers",
      "introduction": "Households, firms, and government interact continuously through markets and policy, creating the circular flow of economic activity. Understanding these interactions reveals how individual decisions aggregate into economy-wide outcomes.",
      "key_concept": {
        "definition": "The three decision-makers interact through: Product markets (households buy goods from firms), Factor markets (firms hire labor and capital from households), Government intervention (taxes, spending, regulation affecting both households and firms), Financial markets (saving and investment connecting households, firms, and government). These interactions create interdependence—each group's decisions affect others.",
        "context": "Economic activity is fundamentally about interaction. No decision-maker operates in isolation. Households supply labor that firms demand. Firms produce goods that households demand. Government taxes both and provides services to both. Changes anywhere ripple throughout the system. Understanding these linkages is essential for predicting economic outcomes and policy effects."
      },
      "worked_examples": [
        {
          "title": "Tracing Interactions Through the Circular Flow",
          "problem": "Trace the economic interactions when a household member gets a job at a local business: (a) Describe the immediate transaction between household and firm. (b) Show how this creates additional economic activity. (c) Explain government's role in these interactions. (d) Identify how all three decision-makers are affected.",
          "step_by_step": [
            {
              "step": "Initial transaction—Factor market",
              "explanation": "Household supplies labor to firm in exchange for wages. Example: Person works 40 hours/week at restaurant, earns \\$600/week (\\$15/hour). Household-firm interaction in labor market. Household supplies labor factor, firm demands labor, wage is the price."
            },
            {
              "step": "Income effect—Household consumption",
              "explanation": "Household uses wage income to purchase goods and services. Example: With \\$600 weekly income (\\$2,400/month), household buys: \\$800 rent, \\$400 food, \\$300 transportation, \\$200 utilities, \\$700 other goods. Household-firm interaction in product markets. Household demands goods, firms supply, prices determine exchanges."
            },
            {
              "step": "Production chain—Firm-to-firm interactions",
              "explanation": "Restaurant (firm 1) purchases from suppliers (firms 2, 3, 4). Example: Restaurant buys: \\$1,000 food from wholesaler, \\$500 beverages from distributor, \\$200 supplies from vendor. Original employment creates demand throughout supply chain. Multiple firms interact through product markets."
            },
            {
              "step": "Government taxation",
              "explanation": "Government collects taxes from household and firm. Example: Employee: \\$600 gross wages - \\$100 payroll and income taxes = \\$500 net. Employer: Pays \\$50 payroll tax, \\$200 corporate income tax monthly. Government extracts resources from both through taxation."
            },
            {
              "step": "Government spending",
              "explanation": "Government uses tax revenue to provide services benefiting household and firm. Example: Tax revenue funds: Roads employee uses to commute, Public education that trained employee, Police protecting restaurant, Courts enforcing contracts. Government provides public goods and services to both."
            },
            {
              "step": "Complete circular flow",
              "explanation": "Trace complete cycle: Household supplies labor → Firm pays wages → Household buys goods → Firm has revenue → Firm pays suppliers and workers → Creates more income and spending. Money and goods flow continuously. Government intersects flow through taxes (extraction) and spending (injection). System is interconnected and ongoing."
            }
          ],
          "final_answer": "Single employment relationship creates complex interactions: Household supplies labor to firm (factor market), receives wages, uses income to buy goods (product market). This spending generates revenue for multiple firms who buy from suppliers, creating employment and income for other households. Government taxes transactions (payroll, income, sales taxes) and provides services (infrastructure, education, legal system) enabling and supporting economic activity. All three decision-makers are interconnected—household decisions affect firms through spending and labor supply, firm decisions affect households through employment and prices, government decisions affect both through taxes and services. The circular flow shows mutual dependence.",
          "concept_applied": "Economic interactions create interdependence among decision-makers. Changes propagate through the system: More employment → more income → more spending → more firm revenue → more employment (multiplier). Policy affects all participants: Taxes reduce household and firm resources, spending provides benefits to both. Understanding interactions reveals how microeconomic decisions aggregate to macroeconomic outcomes and how policy changes ripple through the economy."
        }
      ],
      "image": {
        "src": "images/unit1/three_sector_circular_flow.png",
        "alt": "Circular flow diagram showing households, firms, and government interconnected through markets and policy",
        "caption": "Circular flow: households, firms, and government interact through product markets, factor markets, taxes, and spending"
      }
    }
  ],
  "key_terms": [
    "Households",
    "Firms",
    "Government",
    "Utility maximization",
    "Profit maximization",
    "Factor markets",
    "Product markets",
    "Circular flow",
    "Public goods",
    "Externalities",
    "Market failures",
    "Fiscal policy",
    "Monetary policy",
    "Redistribution",
    "Regulation",
    "Budget constraint",
    "Marginal analysis",
    "Economic interdependence"
  ],
  "summary": "Economic activity involves three main decision-makers: households, firms, and government. Households are individuals or families making unified economic decisions about consumption, saving, and labor supply to maximize utility (satisfaction). They play dual roles: Supplying factors of production (labor, capital, land) to firms in factor markets, receiving income (wages, interest, rent, profit). Demanding goods and services from firms in product markets, spending income. Household decisions involve trade-offs due to budget constraints (limited income) and time constraints (24 hours daily). They choose consumption allocation, labor supply (work vs. leisure), saving vs. consumption, human capital investment, and major purchases. Factors influencing household decisions include income level, prices, preferences, life cycle stage, expectations, and economic conditions. Households face fundamental economic concepts: scarcity, constraints, trade-offs, and opportunity costs in all decisions. Firms are business organizations that demand factors from households, combine inputs to produce goods and services, and supply products to households and other firms. The primary objective is profit maximization (total revenue minus total cost). Firms serve multiple roles: producing goods and services, employing labor, using capital, innovating, paying taxes, and bearing risk. Firm decisions include what to produce, how much to produce, production methods (labor-intensive vs. capital-intensive), employment levels, pricing strategies, capital investment, and R&D spending. Profit-maximizing firms produce where marginal revenue equals marginal cost. Factors influencing firm decisions include market demand, input costs, technology, competition level, regulation, and expectations. Market structure (perfect competition, oligopoly, monopoly) fundamentally affects firm behavior and pricing power. Government is the public sector authority pursuing multiple objectives through political processes. Government roles include: establishing legal framework (property rights, contracts), providing public goods (defense, infrastructure), correcting externalities (pollution taxes, education subsidies), regulating markets (antitrust, consumer protection), redistributing income (progressive taxes, transfer programs), stabilizing economy (fiscal and monetary policy), and promoting growth (infrastructure, education, research investment). Government decision-making differs from households and firms—it involves political processes, balances competing objectives (efficiency vs. equity), responds to interest groups and voters, and addresses market failures. Government finances activities through income taxes, payroll taxes, sales taxes, property taxes, and borrowing (deficits). Spending includes transfer payments, public goods and services, interest on debt, and subsidies. Government intervention addresses market failures but creates costs (deadweight loss, unintended consequences, administration) and potential government failures (inefficiency, capture by special interests). The three decision-makers interact continuously: Households and firms interact through product markets (households buy goods) and factor markets (firms hire labor and capital). Government affects both through taxation, spending, and regulation. Financial markets connect saving (by households) with investment (by firms and government). These interactions create the circular flow of economic activity—money and resources flowing between groups, creating interdependence. Changes propagate through the system: Employment creates income, income creates spending, spending creates revenue, revenue creates more employment (multiplier effect). Policy affects all participants: Taxes extract resources, spending provides benefits, regulation alters behavior. Understanding these three decision-makers—their objectives, constraints, choices, and interactions—is essential for analyzing economic outcomes, predicting responses to changes, and comprehending how individual decisions aggregate into economy-wide patterns of production, employment, income, and growth."
}
