{
  "expanded_description": "Economics is divided into two main branches: microeconomics, which studies individual decision-makers and specific markets, and macroeconomics, which studies the economy as a whole. Understanding this distinction helps organize economic thinking and reveals how individual behaviors aggregate into economy-wide outcomes.",
  "core_concept": {
    "principle": "Microeconomics examines individual economic units—households, firms, and specific markets—focusing on how they make decisions, interact, and allocate scarce resources. Macroeconomics examines the economy as an aggregate whole—total output, employment, inflation, and growth—focusing on economy-wide phenomena and government policies affecting overall economic performance.",
    "explanation": "The prefix 'micro' means small; microeconomics studies small-scale economic units and their interactions. The prefix 'macro' means large; macroeconomics studies large-scale economic aggregates and overall performance. Microeconomics asks questions like: How does a consumer decide what to buy? How does a firm set prices? What determines the wage for nurses? How does the market for wheat function? Macroeconomics asks questions like: What determines total production in the economy? Why does unemployment rise and fall? What causes inflation? How can government promote economic growth? While distinct, these branches are interconnected—macroeconomic outcomes emerge from millions of microeconomic decisions, and macroeconomic conditions affect individual choices. A complete understanding of economics requires both perspectives: microeconomics provides the foundation by explaining individual behavior, while macroeconomics reveals system-level patterns and aggregate outcomes. The distinction helps economists specialize (labor economists focus micro, monetary economists focus macro) and helps students organize vast economic knowledge into manageable categories.",
    "image": {
      "src": "images/unit1/micro_vs_macro.png",
      "alt": "Split diagram showing microeconomics focusing on individuals and firms, macroeconomics focusing on national economy",
      "caption": "Microeconomics studies individual units; macroeconomics studies aggregate economy"
    }
  },
  "sections": [
    {
      "section_title": "Understanding Microeconomics",
      "introduction": "Microeconomics focuses on individual decision-makers—consumers, workers, firms, and industries—and how they interact in specific markets. It's the study of trees in the economic forest.",
      "key_concept": {
        "definition": "Microeconomics is the branch of economics studying individual economic units and their decision-making. It analyzes how households choose what to consume, how firms decide what to produce and what prices to charge, how workers and employers determine wages, and how supply and demand interact in specific markets.",
        "context": "Microeconomics provides the foundation for understanding economic behavior. It explains the 'building blocks' of the economy—individual choices that aggregate into larger patterns. Microeconomic analysis uses models of rational decision-making, supply and demand, market structures, and strategic interaction to explain and predict behavior in specific contexts."
      },
      "categories": [
        {
          "type": "Consumer Behavior and Demand",
          "description": "How individuals and households make consumption decisions.",
          "examples": [
            {
              "process": "Consumer choice",
              "explanation": "How consumers allocate limited budgets among different goods to maximize satisfaction. Trade-offs between products. Example: Student with \\$100 decides between textbooks (\\$60), entertainment (\\$30), food (\\$10). Microeconomics analyzes these choices—what determines the selection? How do price changes affect decisions?"
            },
            {
              "process": "Demand analysis",
              "explanation": "What determines quantity demanded of specific goods? How do price changes, income changes, and preferences affect demand? Example: How does smartphone demand respond to price cuts? How does income growth affect demand for restaurant meals? Microeconomics models these relationships."
            },
            {
              "process": "Utility and preferences",
              "explanation": "Why do people want what they want? How do individuals rank alternatives? How does satisfaction from consumption work? Example: Why does someone prefer coffee over tea? How much would they pay for coffee? Microeconomics analyzes preference structures."
            },
            {
              "process": "Elasticity",
              "explanation": "How sensitive is demand to price changes? Do consumers dramatically reduce purchases when prices rise (elastic) or barely change behavior (inelastic)? Example: Gasoline demand relatively inelastic (people still drive when gas prices rise). Luxury vacation demand elastic (people postpone trips when prices rise)."
            }
          ]
        },
        {
          "type": "Firm Behavior and Supply",
          "description": "How businesses make production, pricing, and employment decisions.",
          "examples": [
            {
              "process": "Production decisions",
              "explanation": "How much should a firm produce? What combination of inputs (labor, capital, materials) minimizes costs? Example: Restaurant deciding how many meals to prepare, how many chefs to employ, whether to buy pre-made sauces or make from scratch. Microeconomics analyzes optimal production choices."
            },
            {
              "process": "Cost analysis",
              "explanation": "What are fixed vs. variable costs? How do costs change with production level? What is the cost of producing one more unit? Example: Factory with \\$100,000 monthly rent (fixed cost) and \\$10 materials per unit (variable cost). Microeconomics studies cost structures and their implications."
            },
            {
              "process": "Pricing strategies",
              "explanation": "How should firms set prices to maximize profit? Does market structure affect pricing power? Example: Competitive farmer takes market price (\\$5/bushel). Monopolist pharmaceutical company sets high prices for patented drug. Microeconomics explains different pricing behaviors."
            },
            {
              "process": "Profit maximization",
              "explanation": "What output level and price combination maximize profit? How do firms respond to competition? Example: Coffee shop determining optimal number of lattes to sell daily, considering costs, demand, and competition. Microeconomics models profit-maximizing decisions."
            }
          ]
        },
        {
          "type": "Markets and Prices",
          "description": "How supply and demand interact to determine prices and quantities in specific markets.",
          "examples": [
            {
              "process": "Market equilibrium",
              "explanation": "How do markets reach balance between quantity supplied and demanded? What determines the market price? Example: Wheat market: Farmers supply 100 million bushels at \\$6/bushel. Consumers demand 100 million bushels at \\$6/bushel. Market equilibrium: price \\$6, quantity 100 million. Microeconomics analyzes equilibrium determination."
            },
            {
              "process": "Supply and demand shifts",
              "explanation": "What causes market conditions to change? How do markets adjust to shocks? Example: Hurricane destroys oil refineries → oil supply decreases → oil prices rise → consumers buy less, producers increase output elsewhere → new equilibrium at higher price, lower quantity. Microeconomics traces market adjustments."
            },
            {
              "process": "Price controls",
              "explanation": "What happens when government sets prices above or below equilibrium? Example: Rent control sets maximum rent at \\$1,000 when equilibrium is \\$1,500. Result: Housing shortage (quantity demanded exceeds quantity supplied). Microeconomics predicts consequences of price interventions."
            },
            {
              "process": "Market efficiency",
              "explanation": "Do markets allocate resources optimally? When do markets fail? Example: Competitive markets generally efficient—resources go to highest-value uses. Monopoly markets inefficient—under-production and high prices. Microeconomics evaluates market performance."
            }
          ]
        },
        {
          "type": "Labor Markets",
          "description": "How wages are determined and how individuals choose between work and leisure.",
          "examples": [
            {
              "process": "Wage determination",
              "explanation": "What determines wages for different occupations? Why do doctors earn more than cashiers? Example: Doctor wages high because: Limited supply (years of training required), high demand (healthcare needs), specialized skills. Cashier wages low because: Abundant supply (minimal training), lower skill requirements. Microeconomics explains wage differences."
            },
            {
              "process": "Labor supply decisions",
              "explanation": "How do individuals decide how much to work? What is work-leisure trade-off? Example: Worker choosing between full-time job (\\$50,000/year, 40 hours/week) and part-time (\\$25,000/year, 20 hours/week with more free time). Microeconomics models labor supply choices."
            },
            {
              "process": "Labor demand by firms",
              "explanation": "How many workers should firms hire? What determines employment levels? Example: Factory deciding whether to hire 50 or 60 workers. Hires additional worker only if their production value exceeds wage cost. Microeconomics analyzes employment decisions."
            },
            {
              "process": "Minimum wage effects",
              "explanation": "How does minimum wage affect employment in specific labor markets? Example: Raising minimum wage from \\$10 to \\$15 in fast food industry. Microeconomics predicts: Some workers get raises, some lose jobs as employers automate or cut positions, depends on demand elasticity."
            }
          ]
        },
        {
          "type": "Market Structures",
          "description": "How the number of competitors affects market outcomes.",
          "examples": [
            {
              "process": "Perfect competition",
              "explanation": "Many firms selling identical products, no individual control over price. Example: Agricultural markets—thousands of wheat farmers, identical product, each takes market price. Microeconomics shows competitive markets are efficient."
            },
            {
              "process": "Monopoly",
              "explanation": "Single seller controls entire market, can set prices above competitive level. Example: Local utility company (only electricity provider in area). Microeconomics shows monopolies reduce output and raise prices, creating inefficiency."
            },
            {
              "process": "Oligopoly",
              "explanation": "Few large firms dominate market, strategic interaction among competitors. Example: Automobile industry (Toyota, VW, GM, Ford dominate). Airlines (American, Delta, United). Microeconomics analyzes strategic competition."
            },
            {
              "process": "Monopolistic competition",
              "explanation": "Many firms selling differentiated products, some pricing power. Example: Restaurants—many competitors but each offers unique menu, location, atmosphere. Can charge different prices. Microeconomics explains differentiation strategies."
            }
          ]
        },
        {
          "type": "Market Failures and Government Intervention",
          "description": "When markets fail to allocate efficiently and how policy can address problems.",
          "examples": [
            {
              "process": "Externalities",
              "explanation": "Costs or benefits affecting third parties not involved in transaction. Example: Factory pollution (negative externality) harms neighbors who aren't compensated. Education (positive externality) benefits society beyond just the student. Microeconomics analyzes externality problems and solutions (taxes, subsidies, regulation)."
            },
            {
              "process": "Public goods",
              "explanation": "Goods where consumption is non-rival and non-excludable. Markets under-provide. Example: National defense protects everyone, can't exclude non-payers, no one has incentive to pay. Private markets won't provide adequate defense. Microeconomics explains why government must provide public goods."
            },
            {
              "process": "Information asymmetry",
              "explanation": "When one party has more information than another, enabling exploitation. Example: Used car seller knows car quality, buyer doesn't. Can lead to 'lemons problem'—good cars driven from market. Microeconomics analyzes information problems and solutions (warranties, certification)."
            },
            {
              "process": "Income inequality",
              "explanation": "Market outcomes may be efficient but unfair. Example: Market wages create large income gaps. Top 1% earns vastly more than bottom 50%. Microeconomics studies inequality and redistribution policies (progressive taxes, transfers)."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Microeconomics Assumes Rational Decision-Making",
          "statement": "Individuals and firms make choices to maximize their objectives—consumers maximize utility, firms maximize profit—given constraints.",
          "application": "Rational choice models predict behavior based on incentives and constraints.",
          "example": "Consumer with \\$100 budget allocates spending to maximize satisfaction. Firm chooses output level maximizing profit. Worker decides hours to work based on wage and preferences. Microeconomics assumes people respond predictably to incentives."
        },
        {
          "principle": "Supply and Demand Determine Market Outcomes",
          "statement": "In competitive markets, interaction of supply (sellers' willingness to sell) and demand (buyers' willingness to buy) determines prices and quantities.",
          "application": "Market analysis uses supply-demand framework to predict price and quantity changes.",
          "example": "Increased demand for electric vehicles (Tesla popularity) with limited supply → EV prices rise. More companies produce EVs, increasing supply → prices moderate. Supply-demand framework explains market evolution."
        },
        {
          "principle": "Marginal Analysis Guides Decisions",
          "statement": "Rational actors compare marginal benefit (additional benefit from one more unit) to marginal cost (additional cost of one more unit). Choose action if marginal benefit exceeds marginal cost.",
          "application": "Optimal decisions made at the margin—where marginal benefit equals marginal cost.",
          "example": "Firm deciding whether to produce one more unit: Marginal revenue \\$50, marginal cost \\$40 → produce it (profit increases \\$10). Marginal revenue \\$50, marginal cost \\$60 → don't produce (would lose \\$10). Profit maximization occurs where marginal revenue equals marginal cost."
        },
        {
          "principle": "Markets Tend Toward Equilibrium",
          "statement": "When quantity demanded doesn't equal quantity supplied, prices adjust. Shortages push prices up; surpluses push prices down. Markets move toward equilibrium where quantity demanded equals quantity supplied.",
          "application": "Understanding market dynamics and predicting price movements.",
          "example": "Concert tickets: 20,000 available, 50,000 people want tickets at \\$50 (shortage). Scalpers charge \\$200—market price rises to balance supply and demand. Eventually reaches equilibrium where quantity demanded equals quantity supplied."
        }
      ],
      "image": {
        "src": "images/unit1/microeconomics_scope.png",
        "alt": "Diagram showing microeconomic topics: consumer choice, firm decisions, market equilibrium, labor markets",
        "caption": "Microeconomics studies individual units: consumers, firms, workers, and specific markets"
      }
    },
    {
      "section_title": "Understanding Macroeconomics",
      "introduction": "Macroeconomics focuses on the economy as a whole—aggregate production, employment, inflation, and growth. It's the study of the entire economic forest, not individual trees.",
      "key_concept": {
        "definition": "Macroeconomics is the branch of economics studying economy-wide phenomena. It analyzes total output (GDP), aggregate employment and unemployment, inflation and price levels, economic growth, international trade, and government policies affecting overall economic performance.",
        "context": "Macroeconomics emerged as distinct field during the Great Depression when massive unemployment couldn't be explained by microeconomic supply-demand in individual markets. John Maynard Keynes developed macroeconomic theory explaining how aggregate demand determines overall economic activity. Macroeconomics addresses questions vital to societal welfare: What causes recessions? How can government reduce unemployment? What determines living standards? Why do some countries grow rapidly while others stagnate?"
      },
      "categories": [
        {
          "type": "National Income and Output",
          "description": "Measuring and understanding total economic production.",
          "examples": [
            {
              "process": "Gross Domestic Product (GDP)",
              "explanation": "Total value of all final goods and services produced in economy during period. Primary measure of economic size and performance. Example: US GDP ~\\$27 trillion (2024). China ~\\$18 trillion. India ~\\$4 trillion. GDP measures total production, indicating economic size and comparing countries."
            },
            {
              "process": "GDP growth",
              "explanation": "How fast is economy expanding? Percentage increase in GDP over time. Example: US typically grows 2-3% annually. China historically grew 8-10% (recently slower ~5%). Negative growth = recession. Macroeconomics studies what determines growth rates."
            },
            {
              "process": "GDP components",
              "explanation": "GDP = Consumption + Investment + Government Spending + Net Exports. Breaking down total output. Example: US GDP composition: Consumption ~68% (households buying goods/services), Investment ~17% (business capital, housing), Government ~17% (public spending), Net exports -2% (imports exceed exports). Macroeconomics analyzes these components."
            },
            {
              "process": "GDP per capita",
              "explanation": "GDP divided by population—average output per person. Measures living standards. Example: US GDP per capita ~\\$80,000. China ~\\$13,000. India ~\\$2,500. Wide variation in living standards. Macroeconomics studies why some countries are rich, others poor."
            }
          ]
        },
        {
          "type": "Unemployment",
          "description": "Analyzing joblessness and labor market conditions economy-wide.",
          "examples": [
            {
              "process": "Unemployment rate",
              "explanation": "Percentage of labor force actively seeking work but unable to find jobs. Key indicator of economic health. Example: US unemployment: Normal ~4-5%, recession can reach 10%+ (2020 COVID: 14.7%, 2009 financial crisis: 10%). High unemployment indicates weak economy."
            },
            {
              "process": "Types of unemployment",
              "explanation": "Frictional (temporary between jobs), structural (skills mismatch), cyclical (recession-related). Example: Frictional: Recent college graduate searching for first job. Structural: Coal miner can't find work because industry declining. Cyclical: Construction worker laid off during recession. Macroeconomics analyzes each type's causes and solutions."
            },
            {
              "process": "Full employment",
              "explanation": "Doesn't mean zero unemployment—some frictional and structural unemployment always exists. 'Natural rate' ~4-5% in US. Example: Even healthy economy has ~4% unemployment (people between jobs, skills mismatches). Below this, economy 'overheats' with inflation pressure. Macroeconomics identifies sustainable employment levels."
            },
            {
              "process": "Labor force participation",
              "explanation": "Percentage of working-age population employed or seeking work. Complements unemployment rate. Example: US labor force participation ~63%—not everyone works or seeks work (students, retirees, stay-at-home parents, discouraged workers). Participation rate affects available labor supply."
            }
          ]
        },
        {
          "type": "Inflation and Price Levels",
          "description": "Studying overall price changes and purchasing power.",
          "examples": [
            {
              "process": "Inflation rate",
              "explanation": "Percentage increase in overall price level. Measures how much prices rise annually. Example: US inflation: Target ~2%, 2022-2023 reached 8-9% (highest in 40 years), 1970s reached 13%. High inflation erodes purchasing power—your money buys less."
            },
            {
              "process": "Consumer Price Index (CPI)",
              "explanation": "Measures average price change for basket of goods consumers buy. Tracks living costs. Example: CPI includes: Food, housing, transportation, healthcare, entertainment. If CPI rises 3%, means average consumer faces 3% cost increase. Used for cost-of-living adjustments."
            },
            {
              "process": "Causes of inflation",
              "explanation": "Demand-pull (too much money chasing goods), cost-push (rising production costs), monetary (too much money supply growth). Example: 2021-2023 inflation caused by: Supply chain disruptions (cost-push), massive government spending (demand-pull), low interest rates (monetary). Macroeconomics analyzes inflation causes."
            },
            {
              "process": "Effects of inflation",
              "explanation": "Erodes purchasing power, creates uncertainty, redistributes wealth from savers to borrowers. Example: 5% inflation means \\$100 buys only \\$95 worth of goods next year. Retirees on fixed income suffer. Borrowers benefit (repay with cheaper dollars). Macroeconomics studies inflation consequences."
            }
          ]
        },
        {
          "type": "Economic Growth and Development",
          "description": "Understanding what drives long-term increases in living standards.",
          "examples": [
            {
              "process": "Long-run growth",
              "explanation": "Sustained increases in GDP per capita over decades. Determines rising living standards. Example: US GDP per capita: 1950: ~\\$15,000 (inflation-adjusted). 2024: ~\\$80,000. 5x increase in living standards over 74 years. Average ~2% annual growth compounds dramatically."
            },
            {
              "process": "Growth determinants",
              "explanation": "What makes economies grow? Capital accumulation, technological progress, human capital (education), institutions. Example: South Korea 1960: Poor (~\\$1,500 per capita). 2024: Rich (~\\$35,000). Rapid growth from: Investment in education, infrastructure, technology adoption, good institutions. Macroeconomics studies growth drivers."
            },
            {
              "process": "Productivity",
              "explanation": "Output per worker or per hour worked. Key to living standards. Example: US worker produces ~\\$75/hour of output. Mexican worker ~\\$20/hour. Productivity gap explains wage gap. Higher productivity (through technology, capital, skills) enables higher wages and living standards."
            },
            {
              "process": "Development economics",
              "explanation": "Why are some countries rich and others poor? How can poor countries develop? Example: US GDP per capita ~\\$80,000. Nigeria ~\\$2,200. 36x difference. Macroeconomics studies: Why this gap exists, How poor countries can close it, Role of institutions, education, investment."
            }
          ]
        },
        {
          "type": "Business Cycles",
          "description": "Analyzing economic fluctuations—booms and recessions.",
          "examples": [
            {
              "process": "Expansion and contraction",
              "explanation": "Economy doesn't grow steadily—alternates between growth (expansion) and decline (recession). Example: US since 1950: Mostly expansion with periodic recessions (1980-82, 1990-91, 2001, 2007-09, 2020). Recessions cause unemployment spikes and hardship. Macroeconomics studies cycle causes."
            },
            {
              "process": "Recession",
              "explanation": "Period of negative GDP growth, rising unemployment, falling incomes. Officially: two consecutive quarters of negative growth. Example: 2008-2009 Great Recession: GDP fell 4%, unemployment rose to 10%, millions lost homes. Severe economic hardship. Macroeconomics analyzes recession causes and solutions."
            },
            {
              "process": "Depression",
              "explanation": "Severe, prolonged recession. Rare but devastating. Example: Great Depression (1929-1939): GDP fell 30%, unemployment reached 25%, decade-long hardship. Worst economic crisis in modern history. Led to development of macroeconomic theory and policy."
            },
            {
              "process": "Business cycle indicators",
              "explanation": "Variables signaling economic state: Leading indicators (predict future), coincident (current state), lagging (confirm trends). Example: Leading: Stock prices, building permits. Coincident: GDP, employment. Lagging: Unemployment duration. Macroeconomists use indicators to forecast cycles."
            }
          ]
        },
        {
          "type": "Fiscal and Monetary Policy",
          "description": "Government and central bank actions to influence economy-wide performance.",
          "examples": [
            {
              "process": "Fiscal policy",
              "explanation": "Government spending and taxation decisions affecting aggregate demand. Example: Recession hits → government increases spending (infrastructure projects), cuts taxes (stimulus checks) → aggregate demand increases → GDP grows, unemployment falls. Expansionary fiscal policy fights recessions."
            },
            {
              "process": "Monetary policy",
              "explanation": "Central bank (Federal Reserve in US) controls money supply and interest rates. Example: Inflation rising → Fed raises interest rates → borrowing becomes expensive → spending decreases → inflation moderates. Contractionary monetary policy fights inflation."
            },
            {
              "process": "Policy trade-offs",
              "explanation": "Policies face trade-offs: Fighting unemployment may increase inflation. Reducing inflation may increase unemployment. Example: 1970s: High inflation and high unemployment ('stagflation'). Fed raised rates to fight inflation → recession and higher unemployment. Macroeconomics analyzes policy trade-offs."
            },
            {
              "process": "Government debt",
              "explanation": "Accumulated deficits—when government spending exceeds revenue. Example: US national debt ~\\$34 trillion (~120% of GDP). Large debts create concerns: Interest payments consume budget, potential future tax increases, inflation risk. Macroeconomics debates sustainable debt levels."
            }
          ]
        },
        {
          "type": "International Economics",
          "description": "Studying international trade, exchange rates, and global economic interactions.",
          "examples": [
            {
              "process": "Exchange rates",
              "explanation": "Value of one currency in terms of another. Affects trade competitiveness. Example: \\$1 = 0.85 euros. Strong dollar makes US exports expensive (hurts exporters), imports cheap (helps consumers). Weak dollar has opposite effects. Macroeconomics studies exchange rate determination."
            },
            {
              "process": "Trade balance",
              "explanation": "Exports minus imports. Trade deficit = imports exceed exports. Trade surplus = exports exceed imports. Example: US runs trade deficit (~\\$1 trillion annually)—imports more than exports. China runs trade surplus—exports more than imports. Macroeconomics analyzes trade imbalances."
            },
            {
              "process": "Globalization effects",
              "explanation": "Increased international trade and capital flows affect domestic economy. Example: Manufacturing jobs moved overseas (China, Mexico) due to lower wages → US manufacturing employment fell → some regions economically hurt. Also: Lower consumer prices, economic efficiency. Macroeconomics studies globalization impacts."
            },
            {
              "process": "International capital flows",
              "explanation": "Money flows across borders for investment. Affects exchange rates, interest rates, growth. Example: Foreign investors buy US Treasury bonds → demand for dollars increases → dollar strengthens → affects trade. Macroeconomics analyzes capital flow effects."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Aggregate Demand Determines Short-Run Output",
          "statement": "In short run, total spending (aggregate demand) determines production level. If spending falls, output and employment fall.",
          "application": "Keynesian principle: Demand drives production in short run, explaining recessions as demand deficiencies.",
          "example": "2008 Financial Crisis: Consumers and businesses stopped spending (fear, credit freeze) → aggregate demand collapsed → GDP fell 4% → unemployment spiked to 10%. Insufficient demand caused recession. Government stimulus increased demand, promoting recovery."
        },
        {
          "principle": "Long-Run Growth Depends on Supply Factors",
          "statement": "Over long periods, growth depends on increasing productive capacity—capital, technology, labor, productivity—not just demand.",
          "application": "Supply-side factors determine potential GDP and living standards growth.",
          "example": "US long-run growth ~2% annually from: Technological progress (computers, internet, automation), capital investment (factories, equipment), education (skilled workforce), innovation. These supply factors determine how much economy can produce sustainably."
        },
        {
          "principle": "There's a Trade-Off Between Inflation and Unemployment (Short Run)",
          "statement": "Policies reducing unemployment may increase inflation. Policies reducing inflation may increase unemployment. The Phillips Curve relationship.",
          "application": "Policymakers face short-run trade-off when setting monetary and fiscal policy.",
          "example": "Fed lowering interest rates: Stimulates spending → GDP grows, unemployment falls → but inflation risk increases as economy heats up. Fed raising rates: Cools economy, reduces inflation → but unemployment may rise. Short-run trade-off forces difficult choices."
        },
        {
          "principle": "Government Policy Affects Aggregate Economy",
          "statement": "Fiscal policy (government spending, taxes) and monetary policy (interest rates, money supply) influence total output, employment, inflation.",
          "application": "Government can and should intervene to stabilize economy during recessions and control inflation.",
          "example": "COVID-19 recession (2020): Government passed massive stimulus (\\$2+ trillion spending, unemployment benefits, business loans) + Fed cut rates to zero and bought bonds. Result: Quick recovery—shortest recession in history. Policy intervention prevented depression."
        }
      ],
      "image": {
        "src": "images/unit1/macroeconomics_scope.png",
        "alt": "Diagram showing macroeconomic topics: GDP, unemployment, inflation, growth, policy",
        "caption": "Macroeconomics studies aggregate economy: total output, employment, prices, growth, and policy"
      }
    },
    {
      "section_title": "Comparing Microeconomics and Macroeconomics",
      "introduction": "While distinct, microeconomics and macroeconomics are complementary perspectives on the economy. Understanding their relationship reveals how individual decisions aggregate into economy-wide outcomes.",
      "key_concept": {
        "definition": "Microeconomics and macroeconomics differ in focus (individual vs. aggregate), questions asked (specific markets vs. economy-wide), and tools used (supply-demand in markets vs. aggregate demand-supply). Yet they're interconnected—macro outcomes emerge from micro behaviors, and macro conditions affect micro decisions.",
        "context": "The distinction helps organize economic knowledge but isn't absolute. Some topics bridge both (labor economics has micro and macro dimensions). Good economic thinking requires both perspectives—micro foundations explain behavior, macro frameworks reveal system-level patterns."
      },
      "categories": [
        {
          "type": "Key Differences",
          "description": "How the two branches differ in approach and focus.",
          "examples": [
            {
              "process": "Scale and scope",
              "explanation": "Microeconomics: Individual units (consumers, firms, markets). Macroeconomics: Aggregate economy (total output, overall employment). Example: Micro studies Apple's pricing decisions. Macro studies total technology sector contribution to GDP growth."
            },
            {
              "process": "Questions asked",
              "explanation": "Microeconomics: How does this market work? What determines this price? How does this firm decide? Macroeconomics: What determines total production? Why does unemployment change? What causes inflation? Example: Micro: Why did coffee prices rise? Macro: Why is overall inflation 5%?"
            },
            {
              "process": "Price focus",
              "explanation": "Microeconomics: Relative prices (coffee vs. tea, labor vs. capital). Macroeconomics: Overall price level (inflation, CPI). Example: Micro: Coffee price increased 20% relative to tea. Macro: All prices increased 3% (inflation)."
            },
            {
              "process": "Policy implications",
              "explanation": "Microeconomics: Specific regulations, taxes on particular industries, antitrust, minimum wage. Macroeconomics: Economy-wide fiscal and monetary policy, managing recessions, controlling inflation. Example: Micro: Should government regulate tech monopolies? Macro: Should Fed raise interest rates to fight inflation?"
            },
            {
              "process": "Time horizon emphasis",
              "explanation": "Microeconomics: Focus on equilibrium in specific markets (can be short or long run). Macroeconomics: Distinguishes short run (demand determines output) vs. long run (supply capacity determines growth). Example: Micro: How does wheat market reach equilibrium? Macro: Short run—recession caused by demand fall. Long run—growth from productivity increases."
            }
          ]
        },
        {
          "type": "Interconnections",
          "description": "How microeconomics and macroeconomics relate and inform each other.",
          "examples": [
            {
              "process": "Micro foundations of macro",
              "explanation": "Macroeconomic aggregates emerge from microeconomic decisions. Total consumption is sum of individual household decisions. Example: Each household decides consumption based on income, preferences (microeconomics). Summing all households gives aggregate consumption (macroeconomics). Macro patterns emerge from micro choices."
            },
            {
              "process": "Macro conditions affect micro decisions",
              "explanation": "Economy-wide conditions (recession, inflation) influence individual choices. Example: Recession (macro): High unemployment, low confidence → Individuals postpone big purchases, firms delay investment (micro) → aggregate demand falls further (macro). Feedback between levels."
            },
            {
              "process": "Labor market example",
              "explanation": "Can be studied from both perspectives. Example: Microeconomics: Why do software engineers earn \\$120,000 while cashiers earn \\$25,000? (Supply-demand in specific occupations). Macroeconomics: Why is unemployment rate 4%? (Aggregate labor market conditions, cyclical factors)."
            },
            {
              "process": "Inflation example",
              "explanation": "Both perspectives apply. Example: Microeconomics: Why did gas prices rise 50%? (Specific market—oil supply disruption, demand increase). Macroeconomics: Why are all prices rising 5%? (Economy-wide—money supply growth, demand-pull inflation). Related but different questions."
            },
            {
              "process": "Policy example",
              "explanation": "Policies have both micro and macro effects. Example: Minimum wage increase (microeconomic policy affecting specific labor markets) → affects overall inflation and unemployment (macroeconomic outcomes). Carbon tax (micro—specific market intervention) → affects GDP growth and inflation (macro outcomes)."
            }
          ]
        },
        {
          "type": "Complementary Nature",
          "description": "Why both perspectives are necessary for complete economic understanding.",
          "examples": [
            {
              "process": "Neither complete alone",
              "explanation": "Microeconomics explains individual behavior but can't predict economy-wide outcomes. Macroeconomics describes aggregate patterns but needs micro foundations. Example: Can't understand recession by studying one firm (micro insufficient). Can't predict individual firm decisions from aggregate GDP (macro insufficient). Need both."
            },
            {
              "process": "Different tools for different questions",
              "explanation": "Use microeconomics for: Market analysis, business decisions, specific policy impacts. Use macroeconomics for: Economic forecasting, understanding recessions, inflation management. Example: Business setting price (micro). Government managing recession (macro). Right tool for right problem."
            },
            {
              "process": "Career specialization",
              "explanation": "Economists specialize but need both foundations. Example: Labor economist (micro focus) studies wage determination, discrimination, education returns. Monetary economist (macro focus) studies interest rates, inflation, central banking. Both use economic principles but different applications."
            },
            {
              "process": "Policy analysis requires both",
              "explanation": "Good policy considers micro incentives and macro impacts. Example: Universal basic income: Micro analysis—how it affects work incentives, individual welfare. Macro analysis—how it affects aggregate demand, inflation, government debt. Need both perspectives for complete evaluation."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Classifying Economic Questions",
          "problem": "For each question, identify whether it's primarily microeconomic or macroeconomic and explain why: (a) Why did Apple's stock price rise 20%? (b) Why is US unemployment rate 4%? (c) How will a carbon tax affect gasoline consumption? (d) What causes economic growth? (e) Should Amazon be broken up for monopoly practices?",
          "step_by_step": [
            {
              "step": "Question (a)—Microeconomic",
              "explanation": "Apple stock price involves specific company and market. Why: Micro focuses on individual firms and asset markets. Stock price determined by company performance, investor expectations, specific market conditions. This is micro analysis even though stock market has macro dimensions."
            },
            {
              "step": "Question (b)—Macroeconomic",
              "explanation": "Unemployment rate is aggregate, economy-wide measure. Why: Macro studies total employment/unemployment. Questions about overall jobless rate, labor force participation, cyclical unemployment are macro. Would be micro if asking about unemployment in specific industry or occupation."
            },
            {
              "step": "Question (c)—Microeconomic",
              "explanation": "Carbon tax effect on gasoline consumption involves specific market. Why: Micro analyzes how taxes affect specific goods' demand. Studies consumer response to price changes in particular market. Though carbon tax has macro implications (GDP, inflation), question about gasoline consumption is micro."
            },
            {
              "step": "Question (d)—Macroeconomic",
              "explanation": "Economic growth is aggregate concept—total output increasing. Why: Macro studies what determines GDP growth over time, productivity trends, technological progress affecting whole economy. Growth is inherently economy-wide, not specific market phenomenon."
            },
            {
              "step": "Question (e)—Microeconomic",
              "explanation": "Amazon breakup involves specific company's market power. Why: Micro analyzes market structure, monopoly, competition policy for individual firms and industries. Antitrust is microeconomic even though Amazon is huge—it's about specific market conditions, not aggregate economy."
            }
          ],
          "final_answer": "(a) Micro—specific company stock price. (b) Macro—aggregate unemployment. (c) Micro—specific market response to tax. (d) Macro—economy-wide growth. (e) Micro—specific firm's market structure. The distinction depends on whether focus is individual unit/market (micro) or aggregate economy (macro).",
          "concept_applied": "Microeconomics studies individual economic units and specific markets. Macroeconomics studies aggregate, economy-wide phenomena. Classification depends on whether question concerns particular actors/markets or overall economic performance."
        },
        {
          "title": "Micro-Macro Connections",
          "problem": "Explain how a microeconomic decision—households deciding to save more money—creates macroeconomic effects. Trace the connection from micro to macro.",
          "step_by_step": [
            {
              "step": "Microeconomic decision",
              "explanation": "Individual households decide to increase saving rate from 5% to 10% of income. Reason: Economic uncertainty, planning for retirement, general caution. This is microeconomic—individual household consumption-saving choice."
            },
            {
              "step": "Aggregate to macro level",
              "explanation": "If millions of households simultaneously increase saving, aggregate consumption falls. Example: If all US households save extra 5% of \\$20 trillion total income = \\$1 trillion less consumption spending. Individual micro decisions aggregate to macro impact."
            },
            {
              "step": "Macroeconomic effect—Aggregate demand falls",
              "explanation": "Consumption is ~68% of GDP. \\$1 trillion consumption decrease → aggregate demand falls \\$1 trillion. Macroeconomic consequence: Total spending in economy declines significantly."
            },
            {
              "step": "Further macro impacts",
              "explanation": "Lower aggregate demand → Businesses reduce production (seeing lower sales), Businesses lay off workers (unemployment rises), GDP falls (recession possible). Paradox of thrift: Individual saving (rational micro decision) collectively reduces income (harmful macro outcome)."
            },
            {
              "step": "Feedback to micro level",
              "explanation": "Rising unemployment and falling incomes (macro conditions) → Individual households become more pessimistic, save even more (micro response) → aggregate demand falls further (macro) → deeper recession. Micro and macro reinforce each other."
            },
            {
              "step": "Policy response—Macro",
              "explanation": "Government responds with macroeconomic policy: Cut interest rates (monetary policy) to encourage borrowing and spending, Increase government spending (fiscal policy) to offset consumption decline. Macro policy attempts to stabilize aggregate demand despite micro saving decisions."
            }
          ],
          "final_answer": "Microeconomic decision (households save more) aggregates to macroeconomic effect (consumption falls, aggregate demand declines, recession risk). Shows micro-macro connection: Individual rational choices can create problematic aggregate outcomes. Also shows feedback: Macro conditions (recession) influence micro decisions (more saving from fear), creating cycles. Understanding economics requires both micro and macro perspectives.",
          "concept_applied": "Macroeconomic outcomes emerge from aggregating microeconomic decisions. Individual choices that make sense (saving for security) can collectively harm economy (paradox of thrift). Macro analysis reveals system-level patterns not visible in individual decision-making. Both perspectives needed—micro explains behavior, macro reveals aggregate consequences."
        },
        {
          "title": "When Both Perspectives Apply",
          "problem": "A sharp increase in oil prices affects the economy. Explain how this event can be analyzed from both microeconomic and macroeconomic perspectives. What insights does each provide?",
          "step_by_step": [
            {
              "step": "Microeconomic analysis—Specific markets",
              "explanation": "Focus on individual markets affected: Gasoline market: Price rises from \\$3 to \\$5/gallon → quantity demanded falls (consumers drive less, buy efficient cars). SUV market: Demand falls for gas-guzzlers, rises for hybrids. Airline industry: Higher fuel costs → some airlines raise ticket prices, others cut routes. Analyzes supply-demand changes in specific affected markets."
            },
            {
              "step": "Microeconomic analysis—Consumer behavior",
              "explanation": "Household budget effects: Family spending \\$200/month on gas now spends \\$333 → \\$133 less for other goods. Substitution: Consumers switch to public transit, carpooling. Income effects: Real income falls (same dollars buy less due to higher gas prices). Micro examines individual adaptation strategies."
            },
            {
              "step": "Macroeconomic analysis—Aggregate effects",
              "explanation": "Overall inflation: Oil prices affect many goods (transportation, plastics, manufacturing) → general price level rises → inflation increases from 2% to 5%. Aggregate demand: Higher oil prices act like tax on consumers → reduced purchasing power → consumption falls → GDP growth slows. Macro examines economy-wide impacts."
            },
            {
              "step": "Macroeconomic analysis—Policy response",
              "explanation": "Central bank faces dilemma: Higher oil prices → inflation rises (should raise interest rates to fight inflation), But also → spending falls, recession risk (should lower rates to stimulate). Macro policy must balance competing concerns. This is macro problem—managing aggregate economy."
            },
            {
              "step": "Macroeconomic analysis—International",
              "explanation": "Trade balance effects: US imports oil → higher oil prices → larger trade deficit → dollar weakens → affects all international transactions. Global implications: Oil shock affects all countries, creating worldwide inflation and growth slowdown. Macro examines system-wide, international ramifications."
            },
            {
              "step": "Complementary insights",
              "explanation": "Microeconomics shows: How specific markets adjust (gas, cars, airlines), How consumers adapt individual behavior, Winners and losers from price change. Macroeconomics shows: Overall inflation impact, GDP and employment effects, Policy challenges and responses, International implications. Both perspectives necessary for complete understanding."
            }
          ],
          "final_answer": "Microeconomic analysis focuses on specific markets (gasoline, cars, airlines), individual consumer responses, and market-level adjustments. Macroeconomic analysis focuses on aggregate inflation, GDP impacts, policy responses, and international effects. Same event (oil price increase) analyzed through different lenses provides complementary insights. Micro shows granular market and individual impacts; macro shows system-wide and policy dimensions. Complete understanding requires both perspectives.",
          "concept_applied": "Many economic events can be analyzed from both micro and macro perspectives. Microeconomics provides detail on specific markets and individual responses. Macroeconomics reveals aggregate impacts and policy implications. Both perspectives are valuable and complementary—neither alone gives complete picture. Good economic thinking uses appropriate framework for each question while recognizing connections between levels."
        }
      ],
      "image": {
        "src": "images/unit1/micro_macro_comparison.png",
        "alt": "Table comparing microeconomics and macroeconomics across multiple dimensions",
        "caption": "Microeconomics vs. Macroeconomics: Different scales, questions, and tools, but interconnected perspectives"
      }
    }
  ],
  "key_terms": [
    "Microeconomics",
    "Macroeconomics",
    "Individual economic units",
    "Aggregate economy",
    "Supply and demand",
    "Market equilibrium",
    "Consumer behavior",
    "Firm behavior",
    "Market structures",
    "GDP (Gross Domestic Product)",
    "Unemployment rate",
    "Inflation",
    "Economic growth",
    "Business cycles",
    "Fiscal policy",
    "Monetary policy",
    "Aggregate demand",
    "Aggregate supply",
    "Phillips Curve",
    "Paradox of thrift"
  ],
  "summary": "Economics divides into two main branches: microeconomics and macroeconomics. Microeconomics studies individual economic units—consumers, firms, workers, and specific markets—focusing on how they make decisions and interact. It analyzes consumer choice and demand, firm production and pricing decisions, market equilibrium through supply and demand, labor markets and wage determination, different market structures (competition, monopoly, oligopoly), and market failures (externalities, public goods, information problems). Microeconomics assumes rational decision-making, uses supply-demand framework for market analysis, applies marginal analysis (comparing marginal benefits and costs), and shows markets tend toward equilibrium. It's the foundation explaining individual economic behavior. Macroeconomics studies the economy as a whole, focusing on aggregate phenomena: total output (GDP and GDP growth), unemployment rates and labor market conditions, inflation and overall price levels, long-run economic growth and development, business cycles (expansions and recessions), fiscal policy (government spending and taxes), monetary policy (interest rates and money supply), and international economics (trade, exchange rates). Macroeconomics shows aggregate demand determines short-run output, supply factors determine long-run growth, there's a short-run trade-off between inflation and unemployment, and government policy affects aggregate performance. The branches differ in scale (individual vs. aggregate), questions asked (specific markets vs. economy-wide), price focus (relative vs. overall level), and policy implications (targeted vs. economy-wide). Yet they're deeply interconnected: Macroeconomic aggregates emerge from microeconomic decisions (micro foundations of macro), macroeconomic conditions affect microeconomic choices (feedback effects), many topics bridge both (labor markets, inflation, policy impacts), and complete economic understanding requires both perspectives. Neither branch alone is sufficient—microeconomics explains behavioral foundations and market-level details, while macroeconomics reveals system-level patterns and aggregate outcomes. Examples demonstrate connections: Household saving decisions (micro) aggregate to affect consumption and GDP (macro); oil price shocks affect specific markets (micro) and overall inflation and growth (macro); policies have both micro incentive effects and macro aggregate impacts. Good economic thinking uses the appropriate framework for each question while recognizing how individual behaviors aggregate into economy-wide outcomes and how aggregate conditions influence individual choices. Both perspectives are essential tools for understanding how economies function, why economic outcomes vary, and how policy can improve economic performance."
}
