{
  "expanded_description": "Opportunity cost is one of the most fundamental concepts in economics. It represents the true cost of any choice—not just the money spent, but the value of the next best alternative that must be forgone. Understanding opportunity cost is essential for making rational economic decisions.",
  "core_concept": {
    "principle": "The opportunity cost of any choice is the value of the next best alternative that must be given up as a result of that decision. Every choice involves trade-offs, and opportunity cost measures what you sacrifice when you choose one option over another.",
    "explanation": "Because resources are scarce, choosing to use them one way means giving up the chance to use them another way. Opportunity cost captures this trade-off by measuring what you lose when you make a choice. It's not just about money—opportunity cost includes time, experiences, and other foregone benefits. The true cost of going to college, for example, isn't just tuition and books, but also the income you could have earned by working instead. Understanding opportunity cost helps individuals and societies make better decisions by forcing consideration of what's being sacrificed, not just what's being gained. Rational decision-making requires comparing the benefits of your choice against its opportunity cost—the value of what you're giving up. This concept explains why the same choice can be rational for one person but not another (different opportunity costs), why 'free' things aren't really free (you sacrifice time or other opportunities), and why efficiency matters (minimizing opportunity costs maximizes overall benefit).",
    "image": {
      "src": "images/unit1/opportunity_cost_concept.png",
      "alt": "Fork in road diagram showing choice between two paths, with opportunity cost being the value of the path not taken",
      "caption": "Opportunity cost: the value of the best alternative you give up when making a choice"
    }
  },
  "sections": [
    {
      "section_title": "Understanding Opportunity Cost",
      "introduction": "Opportunity cost is what you give up, not what you gain. It's the foundation of economic thinking because it forces us to consider trade-offs inherent in every decision.",
      "key_concept": {
        "definition": "Opportunity cost is the value of the next best alternative foregone when making a choice. It represents what you could have had instead, measuring the true sacrifice involved in any decision.",
        "context": "Every decision involves opportunity cost because scarcity forces trade-offs. Choosing one thing means not choosing something else. Opportunity cost makes the sacrifice explicit and measurable, enabling better decision-making. It's forward-looking—what matters is the best alternative given up, not what was spent or done in the past."
      },
      "principles": [
        {
          "principle": "Opportunity Cost is About Alternatives Foregone",
          "statement": "The cost of any choice is not what you pay, but what you give up. It's measured by the value of the best alternative you didn't choose.",
          "application": "To find opportunity cost, identify what you would have done instead if you hadn't made this choice.",
          "example": "You spend Saturday afternoon studying (3 hours). The money cost is \\$0, but the opportunity cost is the value of your next best alternative for those 3 hours. If you would have worked and earned \\$45, that's the opportunity cost. If you would have enjoyed a concert you value at \\$50, that's the opportunity cost. The opportunity cost is whatever you valued most among the alternatives you gave up."
        },
        {
          "principle": "Only the Next Best Alternative Matters",
          "statement": "Opportunity cost is the value of the single best alternative you didn't choose, not all alternatives combined.",
          "application": "Don't add up everything you could have done instead—identify only the one thing you would have actually chosen.",
          "example": "Saturday afternoon options: work (\\$45), concert (\\$50 value), sleep (worth \\$30 to you), visit friend (\\$40 value). You choose to study. The opportunity cost is \\$50 (concert—the best alternative), NOT \\$165 (sum of all alternatives). You could only do one thing anyway, so only the best foregone option counts."
        },
        {
          "principle": "Opportunity Cost Includes Non-Monetary Values",
          "statement": "Many opportunity costs aren't monetary. Time, experiences, satisfaction, and other non-financial values count.",
          "application": "Consider all forms of value, not just dollars, when evaluating opportunity costs.",
          "example": "Parent choosing to stay home with children rather than work faces opportunity cost measured partly in lost income, but also in foregone career advancement, professional satisfaction, and adult social interaction. Conversely, working parent faces opportunity cost of missed time with children, which has value even though it doesn't have a price tag."
        },
        {
          "principle": "Opportunity Cost Varies by Person and Situation",
          "statement": "The same choice has different opportunity costs for different people because they have different alternatives and values.",
          "application": "What's costly for one person may be cheap for another based on their specific circumstances and alternatives.",
          "example": "Attending a weekday afternoon movie has low opportunity cost for a retiree (alternative: watching TV at home) but high opportunity cost for a business consultant who bills \\$300/hour (alternative: earning \\$600 during those 2 hours). Same choice, very different opportunity costs based on different alternatives available."
        },
        {
          "principle": "Sunk Costs Are Not Opportunity Costs",
          "statement": "Opportunity cost is forward-looking. Past expenditures (sunk costs) that cannot be recovered are not opportunity costs and should not influence future decisions.",
          "application": "Ignore what you've already spent; focus only on current alternatives going forward.",
          "example": "You bought a non-refundable \\$100 concert ticket but now feel sick on concert day. The \\$100 is gone regardless of what you do now (sunk cost). The opportunity cost of attending is feeling worse (health cost) versus staying home to rest. The \\$100 already spent should not factor into this decision—it's not part of the opportunity cost of either choice going forward."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Opportunity Cost: College Decision",
          "problem": "Maria is deciding whether to attend college for four years or start working immediately after high school. College tuition and books cost \\$15,000/year. She could earn \\$30,000/year working full-time. She could also earn \\$8,000/year working part-time while attending college. What is the total opportunity cost of attending college for four years?",
          "step_by_step": [
            {
              "step": "Identify explicit (out-of-pocket) costs",
              "explanation": "Tuition and books: \\$15,000/year × 4 years = \\$60,000. These are direct payments."
            },
            {
              "step": "Identify implicit (opportunity) costs",
              "explanation": "If attending college, she gives up full-time work (\\$30,000/year) but can work part-time (\\$8,000/year). Net foregone earnings: \\$30,000 - \\$8,000 = \\$22,000/year lost income."
            },
            {
              "step": "Calculate total opportunity cost per year",
              "explanation": "Explicit costs: \\$15,000. Implicit costs: \\$22,000. Total: \\$37,000/year"
            },
            {
              "step": "Calculate four-year opportunity cost",
              "explanation": "\\$37,000/year × 4 years = \\$148,000 total opportunity cost"
            },
            {
              "step": "Interpret the result",
              "explanation": "The true cost of college is \\$148,000—much more than just the \\$60,000 tuition. The largest cost component (\\$88,000 over four years) is the foregone income. This is why opportunity cost of college is higher for someone who could earn a high salary without a degree."
            }
          ],
          "final_answer": "The total opportunity cost of attending college for four years is \\$148,000, consisting of \\$60,000 in explicit costs (tuition/books) and \\$88,000 in implicit costs (foregone income after accounting for part-time work).",
          "concept_applied": "Opportunity cost includes both explicit out-of-pocket expenses and implicit costs (what you give up). The foregone income is often the largest component of college's opportunity cost, which is why college is more 'expensive' for those with high earning potential without a degree."
        },
        {
          "title": "Identifying the Next Best Alternative",
          "problem": "James has a free evening and is considering: (A) Working overtime for \\$80, (B) Attending a concert he values at \\$100 (ticket costs \\$50), (C) Having dinner with friends he values at \\$70 (meal costs \\$40), or (D) Staying home and relaxing, which he values at \\$30. What is the opportunity cost if James chooses to work overtime?",
          "step_by_step": [
            {
              "step": "Calculate net value of each alternative",
              "explanation": "Work: +\\$80. Concert: \\$100 value - \\$50 cost = \\$50 net. Dinner: \\$70 value - \\$40 cost = \\$30 net. Home: \\$30 value, \\$0 cost = \\$30 net."
            },
            {
              "step": "Rank alternatives by net value",
              "explanation": "1st: Work (\\$80), 2nd: Concert (\\$50), 3rd: Home or Dinner (tied at \\$30)"
            },
            {
              "step": "Identify choice and next best alternative",
              "explanation": "James chooses work (1st). The next best alternative is the concert (\\$50 net value)."
            },
            {
              "step": "State opportunity cost",
              "explanation": "Opportunity cost of working = value of next best alternative = \\$50 (concert). NOT \\$80 (what he earns) and NOT \\$110 (sum of concert + dinner + home)."
            }
          ],
          "final_answer": "The opportunity cost of James working overtime is \\$50—the net value of attending the concert, which is his next best alternative.",
          "concept_applied": "Opportunity cost is the value of the single next best alternative foregone, not all alternatives and not the benefit received from the choice made."
        },
        {
          "title": "Recognizing Sunk Costs vs. Opportunity Costs",
          "problem": "Keisha bought a non-refundable airline ticket to Miami for \\$400. The day before the trip, a friend invites her on a free trip to the mountains that she would enjoy more than Miami. Should the \\$400 ticket price factor into Keisha's decision? What is the opportunity cost of each choice?",
          "step_by_step": [
            {
              "step": "Identify the sunk cost",
              "explanation": "The \\$400 ticket is paid and non-refundable. This cost is incurred regardless of what Keisha does now. It's a sunk cost—already spent, cannot be recovered."
            },
            {
              "step": "Identify current alternatives going forward",
              "explanation": "Option A: Go to Miami (using already-purchased ticket). Option B: Go to mountains (free). The \\$400 is gone either way, so it shouldn't influence the choice."
            },
            {
              "step": "Calculate opportunity cost of Miami trip",
              "explanation": "If she goes to Miami, she gives up the mountain trip. Opportunity cost = value of mountain trip to her (let's say she values it at \\$500 worth of enjoyment)."
            },
            {
              "step": "Calculate opportunity cost of mountain trip",
              "explanation": "If she goes to mountains, she gives up Miami. Opportunity cost = value of Miami trip to her (let's say \\$300 worth of enjoyment—less than mountains)."
            },
            {
              "step": "Make rational decision",
              "explanation": "She should choose mountains if she prefers it, even though she spent \\$400 on Miami. The \\$400 is sunk and irrelevant. Going to Miami just because she paid for it is the 'sunk cost fallacy'—letting past costs that can't be recovered dictate current decisions."
            }
          ],
          "final_answer": "The \\$400 should NOT factor into Keisha's decision—it's a sunk cost. The opportunity cost of going to Miami is the foregone mountain trip (which she values more). She should choose the mountains. The opportunity cost of going to the mountains is the foregone Miami trip (which she values less).",
          "concept_applied": "Sunk costs are irrelevant to opportunity cost and rational decision-making. Opportunity cost is forward-looking—what you give up by making this choice now, not what you've already spent. Letting sunk costs influence decisions leads to poor choices."
        },
        {
          "title": "Opportunity Cost Varies by Person",
          "problem": "A retired millionaire and a struggling college student both consider spending 2 hours volunteering at a food bank. Explain how the opportunity cost differs for each person and why this matters.",
          "step_by_step": [
            {
              "step": "Identify millionaire's alternatives",
              "explanation": "Retiree has free time, no income to earn. Best alternative to volunteering might be: leisure activities (golf, reading, socializing) valued at, say, \\$20 worth of enjoyment to them."
            },
            {
              "step": "Identify student's alternatives",
              "explanation": "Student could work those 2 hours at part-time job earning \\$20/hour = \\$40. Or study for exam worth significant grade improvement. Best alternative: probably working for \\$40 they desperately need."
            },
            {
              "step": "Compare opportunity costs",
              "explanation": "Millionaire's opportunity cost: ~\\$20 (foregone leisure). Student's opportunity cost: \\$40 (foregone income) or potentially more if studying for critical exam."
            },
            {
              "step": "Explain implications",
              "explanation": "Same activity (2 hours volunteering), vastly different opportunity costs based on different circumstances and alternatives. For the millionaire, volunteering is 'cheap' (low opportunity cost). For the student, it's 'expensive' (high opportunity cost—giving up needed income or study time)."
            },
            {
              "step": "Why this matters",
              "explanation": "This explains why wealthy people volunteer more—lower opportunity cost. It doesn't mean students are less generous; they face higher costs from the same action. Understanding this prevents judging others' choices without knowing their opportunity costs."
            }
          ],
          "final_answer": "The millionaire faces low opportunity cost (foregone leisure worth ~\\$20), while the student faces high opportunity cost (foregone income of \\$40 or critical study time). Same action, different costs based on different alternatives available. This explains different behavior patterns without moral judgments.",
          "concept_applied": "Opportunity cost is personal and situational—it depends on individual circumstances and available alternatives. The same choice can be rational for one person (low opportunity cost) and irrational for another (high opportunity cost). This explains diverse behavior without assuming different values or preferences."
        }
      ],
      "image": {
        "src": "images/unit1/opportunity_cost_calculation.png",
        "alt": "Flowchart showing how to calculate opportunity cost: identify alternatives → rank by value → next best = opportunity cost",
        "caption": "Finding opportunity cost: identify all alternatives, rank them, select the next best after your choice"
      }
    },
    {
      "section_title": "Opportunity Cost in Everyday Decisions",
      "introduction": "Opportunity cost appears in every decision, from small daily choices to major life decisions. Recognizing these hidden costs improves decision-making quality.",
      "key_concept": {
        "definition": "Everyday decisions all involve opportunity costs, though we often don't explicitly calculate them. Being aware of opportunity costs helps prioritize time, money, and effort more effectively.",
        "context": "Most people focus on what they gain from choices, ignoring what they give up. This can lead to poor decisions—saying yes to too many commitments, spending on low-value items, or pursuing activities that aren't worth their true cost. Explicitly considering opportunity costs improves choices."
      },
      "categories": [
        {
          "type": "Time Allocation Decisions",
          "description": "How you spend your limited time involves constant opportunity cost trade-offs.",
          "examples": [
            {
              "process": "Social media browsing",
              "explanation": "Spending 2 hours daily on social media has near-zero money cost but high opportunity cost: foregone exercise, reading, skill development, sleep, socializing in person, or productive work. If those 2 hours could be used for side business earning \\$30/hour, annual opportunity cost is \\$21,900."
            },
            {
              "process": "Commuting decisions",
              "explanation": "Living far from work to save \\$500/month on rent but adding 2 hours daily commute has opportunity cost. Those 10 hours/week could be worth: family time, exercise, hobbies, sleep, or extra work. If your time is worth \\$25/hour, 40 hours/month = \\$1,000 opportunity cost, exceeding the \\$500 rent savings."
            },
            {
              "process": "Meeting attendance",
              "explanation": "Attending a 1-hour meeting that accomplishes little has opportunity cost of whatever you could have done instead. If you could have completed \\$200 worth of productive work, that's the opportunity cost—even though the meeting itself is 'free.'"
            },
            {
              "process": "Entertainment choices",
              "explanation": "Watching a mediocre movie you're not enjoying (2 hours) has opportunity cost of a better movie, reading, exercise, or sleep. Staying just because you started (sunk time fallacy) ignores opportunity cost of the remaining time."
            }
          ]
        },
        {
          "type": "Financial Decisions",
          "description": "Money spent one way cannot be spent another way—every purchase has opportunity cost.",
          "examples": [
            {
              "process": "Daily coffee purchases",
              "explanation": "\\$5 daily latte = \\$1,825/year. Opportunity cost: what else \\$1,825 could buy (vacation, invest for retirement, pay down debt, emergency fund). If invested at 7% return for 30 years, that \\$1,825/year becomes \\$173,000—that's the long-term opportunity cost."
            },
            {
              "process": "Car purchase decision",
              "explanation": "Buying a new \\$40,000 car versus reliable used \\$20,000 car. The \\$20,000 difference has opportunity cost: down payment on house, retirement investment, paying off student loans. If invested at 7% for 30 years, that \\$20,000 grows to \\$152,000."
            },
            {
              "process": "Subscription services",
              "explanation": "Multiple streaming services (\\$15 each × 4 services = \\$60/month = \\$720/year) have opportunity cost of what else that money could buy. Many people subscribe to services they rarely use, ignoring the opportunity cost."
            },
            {
              "process": "Eating out vs. cooking",
              "explanation": "Eating out regularly (\\$15/meal) versus cooking (\\$5/meal) has \\$10 opportunity cost per meal. If eating out 20 times/month, that's \\$200/month = \\$2,400/year opportunity cost, which could fund significant savings or other purchases."
            }
          ]
        },
        {
          "type": "Career and Education Decisions",
          "description": "Major life choices involve substantial opportunity costs that significantly impact long-term outcomes.",
          "examples": [
            {
              "process": "Graduate school decision",
              "explanation": "Two years of graduate school: explicit costs (tuition ~\\$50,000) plus opportunity cost of foregone salary (\\$60,000/year × 2 = \\$120,000) and delayed career advancement. Total opportunity cost: \\$170,000+. This investment only makes sense if career benefits exceed this cost."
            },
            {
              "process": "Career change",
              "explanation": "Switching careers often means starting at lower salary. If current job pays \\$80,000 and new career starts at \\$50,000, there's \\$30,000/year opportunity cost during the transition. Must weigh against long-term benefits and satisfaction gains."
            },
            {
              "process": "Job offer comparison",
              "explanation": "Comparing two jobs, don't just look at salary. Consider commute time (opportunity cost of time), benefits, growth potential, work-life balance. A \\$5,000 higher salary might have higher opportunity cost if it requires 10 more hours weekly (500 hours/year—what's your time worth?)."
            },
            {
              "process": "Entrepreneurship",
              "explanation": "Starting a business has massive opportunity cost: foregone salary from secure employment, foregone career advancement, risk of losing invested capital. A person earning \\$100,000 leaving to start business faces at least \\$100,000/year opportunity cost during startup phase."
            }
          ]
        },
        {
          "type": "Relationship and Family Decisions",
          "description": "Personal life choices involve opportunity costs, though harder to quantify in dollars.",
          "examples": [
            {
              "process": "Having children",
              "explanation": "Raising children involves enormous opportunity costs: direct expenses (\\$250,000+ to age 18), foregone income if parent reduces work, foregone career advancement, foregone leisure and freedom. People choose children because benefits exceed these costs, but costs are real."
            },
            {
              "process": "Relocating for family",
              "explanation": "Moving to be near family often has career opportunity cost (fewer job options in smaller market, leaving good position). Must weigh family proximity benefits against career and income sacrifices."
            },
            {
              "process": "Social commitments",
              "explanation": "Saying yes to every social invitation has opportunity cost of rest, productive work, quality time with close friends/family, or solitude. Recognizing this helps prioritize which invitations to accept."
            },
            {
              "process": "Long-distance relationships",
              "explanation": "Maintaining long-distance relationship involves opportunity cost: travel time and money, foregone local social connections, stress and effort. Couples must decide if relationship benefits exceed these costs."
            }
          ]
        },
        {
          "type": "Health and Lifestyle Decisions",
          "description": "Choices about health involve opportunity costs that affect long-term well-being.",
          "examples": [
            {
              "process": "Exercise vs. work",
              "explanation": "Hour at gym has opportunity cost of extra work hour (income), leisure, or sleep. But sedentary lifestyle has higher long-term opportunity cost: poor health, medical expenses, reduced longevity, lower quality of life."
            },
            {
              "process": "Sleep deprivation",
              "explanation": "Sleeping 5 hours instead of 8 to work more seems to 'gain' 3 hours daily. But opportunity cost: reduced productivity due to fatigue, worse health, lower cognitive function. The 3 'extra' hours may produce less value than the 3 hours of sleep."
            },
            {
              "process": "Meal choices",
              "explanation": "Fast food (\\$8, 10 minutes) versus healthy cooking (\\$6, 45 minutes). Money cost is similar, but time differs. If time is worth \\$20/hour, 35 extra minutes = \\$12 opportunity cost. Total opportunity cost of cooking: \\$18 vs. \\$8 for fast food. But long-term health opportunity cost favors cooking."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit1/everyday_opportunity_costs.png",
        "alt": "Infographic showing hidden opportunity costs in common daily decisions",
        "caption": "Opportunity costs hide in everyday choices: time use, spending, career, relationships, and health decisions"
      }
    },
    {
      "section_title": "Opportunity Cost for Businesses and Governments",
      "introduction": "Opportunity cost isn't just an individual concept—businesses and governments face the same trade-offs when allocating scarce resources.",
      "key_concept": {
        "definition": "Businesses face opportunity costs when choosing which products to make, which markets to enter, and how to allocate budgets. Governments face opportunity costs when deciding how to spend tax revenue and allocate resources among competing public needs.",
        "context": "Just as individuals can't do everything, businesses can't pursue every opportunity and governments can't fund every program. Resources devoted to one use cannot be used elsewhere. Effective businesses and governments explicitly consider opportunity costs when making strategic decisions."
      },
      "categories": [
        {
          "type": "Business Production Decisions",
          "description": "Firms must choose which products to make with limited production capacity.",
          "examples": [
            {
              "process": "Product mix decisions",
              "explanation": "A factory with limited capacity must choose what to produce. Making more of Product A means making less of Product B. If Product A earns \\$50 profit each and Product B earns \\$80, the opportunity cost of making Product A is \\$80 (foregone profit from Product B)."
            },
            {
              "process": "Seasonal production",
              "explanation": "A farm must decide which crops to plant. Land used for corn cannot grow soybeans that season. If corn profits are \\$600/acre and soybeans profit \\$800/acre, the opportunity cost of planting corn is \\$200/acre in foregone soybean profits."
            },
            {
              "process": "Service business capacity",
              "explanation": "A lawyer's time is limited. Taking on a low-value client (\\$100/hour) means foregoing a high-value client (\\$400/hour). The opportunity cost is \\$300/hour. Rational lawyers should only accept low-value clients when high-value clients aren't available."
            }
          ]
        },
        {
          "type": "Business Investment Decisions",
          "description": "Capital is limited—investing in one opportunity means foregoing others.",
          "examples": [
            {
              "process": "Capital budgeting",
              "explanation": "Company has \\$1 million to invest. Project A might return 15%, Project B might return 20%. Choosing Project A has opportunity cost of Project B's higher return. Smart businesses rank projects by return and fund highest-return projects first."
            },
            {
              "process": "Marketing vs. R&D spending",
              "explanation": "Budget allocated to marketing cannot be spent on research and development. A tech company spending heavily on current product marketing has opportunity cost of foregone innovation that could create future products."
            },
            {
              "process": "Geographic expansion",
              "explanation": "Resources spent opening stores in Region A cannot be used for Region B. If Region B has better demographics and less competition, the opportunity cost of choosing Region A is the higher profits available in Region B."
            },
            {
              "process": "Hiring decisions",
              "explanation": "Hiring budget is limited. Hiring an average candidate at \\$60,000 when an excellent candidate at \\$80,000 is available has opportunity cost: the superior performance the excellent candidate would deliver. Sometimes paying more minimizes opportunity cost."
            }
          ]
        },
        {
          "type": "Government Budget Decisions",
          "description": "Tax revenue is limited—spending on one program means less for others.",
          "examples": [
            {
              "process": "Defense vs. social programs",
              "explanation": "Money spent on military (\\$700 billion in US) cannot be spent on healthcare, education, or infrastructure. The opportunity cost of defense spending is the foregone benefits from those alternative uses. This is the classic 'guns versus butter' trade-off."
            },
            {
              "process": "Infrastructure priorities",
              "explanation": "City has \\$100 million for infrastructure. Spending on new sports stadium means less for roads, schools, or water systems. Opportunity cost is the foregone public benefit from the next best infrastructure investment."
            },
            {
              "process": "Education spending",
              "explanation": "State spending on higher education (colleges) versus K-12 education. Money for university subsidies reduces funding for elementary schools. Opportunity cost is the foregone benefit to younger students. Must weigh which investment yields greater societal benefit."
            },
            {
              "process": "Tax cut decisions",
              "explanation": "Tax cuts reduce government revenue, creating opportunity cost. A \\$50 billion tax cut means \\$50 billion less for spending programs. The opportunity cost of the tax cut is the foregone public services that money would have funded."
            }
          ]
        },
        {
          "type": "Government Policy Trade-offs",
          "description": "Policies involve opportunity costs even beyond direct spending.",
          "examples": [
            {
              "process": "Environmental regulations",
              "explanation": "Strict environmental rules reduce pollution (benefit) but may slow economic growth and reduce jobs (opportunity cost). Policymakers must weigh cleaner environment against economic costs."
            },
            {
              "process": "Immigration policy",
              "explanation": "Restrictive immigration reduces labor supply, potentially raising wages for current workers (benefit) but also reducing economic growth and innovation (opportunity cost). Open immigration has opposite trade-offs."
            },
            {
              "process": "Minimum wage laws",
              "explanation": "Higher minimum wage increases income for employed workers (benefit) but may reduce employment as some businesses hire fewer workers (opportunity cost). The trade-off depends on magnitude of each effect."
            },
            {
              "process": "Licensing requirements",
              "explanation": "Professional licenses (doctors, lawyers, beauticians) ensure quality (benefit) but also limit competition and raise prices for consumers (opportunity cost). More stringent licensing has higher opportunity costs."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Businesses Should Maximize Profit, Considering Opportunity Costs",
          "statement": "Rational businesses pursue projects and strategies where benefits exceed opportunity costs, allocating resources to highest-value uses.",
          "application": "Evaluate each decision by comparing its return against the return from the next best alternative use of resources.",
          "example": "Amazon constantly evaluates opportunity costs. Investing in AWS cloud services had opportunity cost of investing more in retail operations. They chose AWS because potential returns exceeded retail expansion returns—correct decision as AWS is now highly profitable."
        },
        {
          "principle": "Governments Should Maximize Social Benefit, Considering Opportunity Costs",
          "statement": "Public policy should allocate resources where they generate greatest benefit to society, compared to alternative uses.",
          "application": "Cost-benefit analysis should include opportunity costs—what else could resources accomplish?",
          "example": "A city choosing between \\$50M projects: new library or road repairs. Library might serve 10,000 residents; road repairs benefit 100,000+ commuters and businesses. Opportunity cost of library is the foregone benefit to the larger group using roads. This doesn't mean libraries are bad, but opportunity cost analysis helps prioritize limited budgets."
        },
        {
          "principle": "Comparative Advantage Reflects Opportunity Costs",
          "statement": "Businesses and countries should specialize in activities where they have lowest opportunity cost (comparative advantage), not just where they're best (absolute advantage).",
          "application": "Even if you're better at everything, specialize in what you're relatively best at and trade for the rest.",
          "example": "A lawyer who types 120 wpm is better at typing than their secretary (80 wpm). But the lawyer's opportunity cost of typing is \\$400/hour of foregone legal work; the secretary's is \\$20/hour. Despite being a better typist, the lawyer's opportunity cost of typing is higher, so the secretary should type while the lawyer practices law. Specialization based on opportunity cost (comparative advantage) maximizes total output."
        }
      ],
      "image": {
        "src": "images/unit1/business_government_tradeoffs.png",
        "alt": "Diagram showing business and government resource allocation decisions with opportunity costs",
        "caption": "Businesses and governments face opportunity costs when allocating limited resources among competing uses"
      }
    },
    {
      "section_title": "Making Better Decisions Using Opportunity Cost",
      "introduction": "Understanding opportunity cost is valuable only if it improves decision-making. Here are practical strategies for applying opportunity cost thinking.",
      "key_concept": {
        "definition": "Rational decision-making requires comparing benefits against opportunity costs. A choice is worthwhile only if what you gain exceeds what you give up.",
        "context": "Most poor decisions stem from ignoring opportunity costs—saying yes to too many things, spending without considering alternatives, or pursuing activities that aren't worth their true cost. Explicit opportunity cost analysis leads to better choices and fewer regrets."
      },
      "process_flow": [
        {
          "step": "1",
          "process": "Identify Your Alternatives",
          "description": "List realistic alternatives for your time, money, or other resources.",
          "result": "Clear picture of what you're choosing among.",
          "applications": [
            "Weekend plans: work overtime, study, socialize, rest, exercise, hobbies",
            "Bonus money: save, invest, pay debt, spend on experience, buy something",
            "Career choice: stay current job, take new job, start business, go back to school"
          ]
        },
        {
          "step": "2",
          "process": "Estimate Value of Each Alternative",
          "description": "Assign rough values to each option—monetary or subjective satisfaction.",
          "result": "Comparable values for ranking options.",
          "applications": [
            "Work overtime: \\$120 income",
            "Study: potential better grade worth \\$200 (better GPA → better job prospects)",
            "Exercise: health benefits worth \\$100",
            "Rest: recovery worth \\$80"
          ]
        },
        {
          "step": "3",
          "process": "Rank Alternatives by Value",
          "description": "Order options from most to least valuable to you.",
          "result": "Clear identification of best and next-best alternatives.",
          "applications": [
            "1st: Study (\\$200 value)",
            "2nd: Work (\\$120)",
            "3rd: Exercise (\\$100)",
            "4th: Rest (\\$80)"
          ]
        },
        {
          "step": "4",
          "process": "Identify Opportunity Cost of Top Choice",
          "description": "The opportunity cost of your preferred choice is the value of the next best alternative.",
          "result": "Explicit measure of what you're giving up.",
          "applications": [
            "If you choose to study (1st), opportunity cost is \\$120 (work, the 2nd choice)",
            "Studying is worth it if you value the studying benefit at more than \\$120"
          ]
        },
        {
          "step": "5",
          "process": "Compare Benefit to Opportunity Cost",
          "description": "Choose the option only if its benefit exceeds its opportunity cost.",
          "result": "Rational decision based on full cost-benefit analysis.",
          "applications": [
            "Study benefit: \\$200. Opportunity cost: \\$120. Net benefit: \\$80. Good choice!",
            "If studying only worth \\$100, opportunity cost of \\$120 exceeds benefit. Choose work instead."
          ]
        },
        {
          "step": "6",
          "process": "Ignore Sunk Costs",
          "description": "Don't let past expenditures influence current decisions.",
          "result": "Forward-looking decisions based on current alternatives.",
          "applications": [
            "Already paid for gym membership? Irrelevant. Go only if today's benefit exceeds today's opportunity cost.",
            "Invested time in a project that isn't working? Sunk time. Continue only if future benefits exceed future opportunity costs."
          ]
        },
        {
          "step": "7",
          "process": "Reassess Periodically",
          "description": "Opportunity costs change as circumstances change. Reevaluate major decisions periodically.",
          "result": "Adaptability and willingness to change course when opportunity costs shift.",
          "applications": [
            "Career opportunity cost changes over time—reevaluate every few years",
            "Living situation opportunity cost changes with family, job location, finances"
          ]
        }
      ],
      "classifications": [
        {
          "type": "Common Decision-Making Errors",
          "value": "Mistakes that result from ignoring opportunity cost",
          "characteristics": [
            "Focusing only on explicit costs, ignoring implicit opportunity costs",
            "Not considering what else resources could accomplish",
            "Letting sunk costs influence decisions",
            "Saying yes to too many low-value commitments"
          ],
          "behavior": "Leads to suboptimal choices, wasted resources, regret.",
          "examples": [
            {
              "process": "The 'it's free' fallacy",
              "explanation": "Attending a free event you don't value just because it's free ignores the opportunity cost of your time. Free in money ≠ free in opportunity cost."
            },
            {
              "process": "The sunk cost fallacy",
              "explanation": "Continuing to watch a boring movie because you paid for the ticket, even though the money is gone regardless. Past cost shouldn't influence whether the remaining time is worth the opportunity cost."
            },
            {
              "process": "The 'I'm already good at it' trap",
              "explanation": "Continuing in a career because you've invested years developing skills, even though better opportunities exist. Past investment is sunk; only future opportunity costs matter."
            },
            {
              "process": "Overcommitment",
              "explanation": "Saying yes to every request without considering opportunity cost of time. Results in being too busy for high-value activities. Successful people say no to good opportunities to save time for great opportunities."
            }
          ],
          "note": "Most decision-making errors involve ignoring or underestimating opportunity costs. Explicit opportunity cost thinking prevents these mistakes."
        }
      ]
    },
    {
      "section_title": "Opportunity Cost and Comparative Advantage",
      "introduction": "The concept of opportunity cost explains why specialization and trade benefit everyone—even when some people or countries are better at everything.",
      "key_concept": {
        "definition": "Comparative advantage means having a lower opportunity cost in producing something compared to others. Even if you're not the best at anything in absolute terms, you have comparative advantage in whatever you're relatively best at (lowest opportunity cost).",
        "context": "Comparative advantage, based on opportunity costs, explains why countries trade and why individuals specialize. It shows that everyone can benefit from specialization and trade, even when abilities are unequal. This is one of economics' most powerful insights."
      },
      "worked_examples": [
        {
          "title": "Comparative Advantage: Attorney and Secretary",
          "problem": "An attorney can prepare legal documents in 1 hour or type documents in 1 hour (typing 120 wpm). A secretary can prepare legal documents in 5 hours or type documents in 2 hours (typing 60 wpm). The attorney is better at both tasks. Should the attorney do their own typing or hire the secretary? Use opportunity cost to explain.",
          "step_by_step": [
            {
              "step": "Calculate attorney's opportunity costs",
              "explanation": "Attorney's opportunity cost of typing (1 hour): 1 hour of foregone legal document preparation. Attorney's opportunity cost of legal prep (1 hour): 1 hour of foregone typing."
            },
            {
              "step": "Calculate secretary's opportunity costs",
              "explanation": "Secretary's opportunity cost of typing (2 hours): 2/5 = 0.4 hours of foregone legal prep. Secretary's opportunity cost of legal prep (5 hours): 5/2 = 2.5 hours of foregone typing."
            },
            {
              "step": "Identify comparative advantages",
              "explanation": "Attorney has lower opportunity cost in legal prep (1 hour typing foregone vs. secretary's 2.5 hours typing foregone). Secretary has lower opportunity cost in typing (0.4 hours legal prep foregone vs. attorney's 1 hour legal prep foregone)."
            },
            {
              "step": "Determine specialization",
              "explanation": "Attorney should specialize in legal prep (comparative advantage—lower opportunity cost). Secretary should specialize in typing (comparative advantage—lower opportunity cost). This is true even though the attorney is absolutely better at both tasks."
            },
            {
              "step": "Show gains from specialization",
              "explanation": "If attorney does 8 hours legal prep and secretary does 4 hours typing: 8 legal docs prepared, 4 hours of typing done. If attorney did everything: only 4 legal docs and 4 hours typing (spending 4 hours on each). Specialization produces more total output."
            }
          ],
          "final_answer": "Despite being better at both tasks (absolute advantage in both), the attorney should specialize in legal work and hire the secretary for typing. The attorney's opportunity cost of typing (\\$400/hour of foregone legal work) exceeds the secretary's opportunity cost of typing. Specialization based on comparative advantage (opportunity cost) maximizes total output.",
          "concept_applied": "Comparative advantage depends on opportunity costs, not absolute ability. You should specialize in what you're relatively best at (lowest opportunity cost), even if others can do it better in absolute terms. This applies to individuals, businesses, and countries."
        },
        {
          "title": "International Trade and Opportunity Cost",
          "problem": "Country A can produce 1 car using 10 hours of labor or 5 tons of wheat using 10 hours of labor. Country B can produce 1 car using 20 hours of labor or 4 tons of wheat using 10 hours of labor. Which country has comparative advantage in each product? Should they trade?",
          "step_by_step": [
            {
              "step": "Calculate Country A's opportunity costs",
              "explanation": "Making 1 car (10 hours) costs 5 tons of wheat (what could be made in those 10 hours). Making 5 tons of wheat (10 hours) costs 1 car. Per unit: 1 car costs 5 wheat; 1 wheat costs 0.2 cars."
            },
            {
              "step": "Calculate Country B's opportunity costs",
              "explanation": "Making 1 car (20 hours) costs 8 tons of wheat (20 hours could make 8 tons at 4 tons/10 hours). Making 4 tons wheat (10 hours) costs 0.5 cars. Per unit: 1 car costs 8 wheat; 1 wheat costs 0.125 cars."
            },
            {
              "step": "Compare opportunity costs for cars",
              "explanation": "Country A: 1 car costs 5 wheat. Country B: 1 car costs 8 wheat. Country A has lower opportunity cost in cars—comparative advantage in car production."
            },
            {
              "step": "Compare opportunity costs for wheat",
              "explanation": "Country A: 1 wheat costs 0.2 cars. Country B: 1 wheat costs 0.125 cars. Country B has lower opportunity cost in wheat—comparative advantage in wheat production."
            },
            {
              "step": "Determine trade pattern",
              "explanation": "Country A should specialize in cars (lower opportunity cost: 5 wheat vs. 8 wheat). Country B should specialize in wheat (lower opportunity cost: 0.125 cars vs. 0.2 cars). They should trade cars for wheat."
            },
            {
              "step": "Show gains from trade",
              "explanation": "If they trade at, say, 1 car = 6 wheat: Country A gives up 5 wheat to make car, trades for 6 wheat—gains 1 wheat. Country B gives up 8 wheat to make car, instead trades 6 wheat for car—saves 2 wheat. Both benefit from trade based on comparative advantage."
            }
          ],
          "final_answer": "Country A has comparative advantage in cars (lower opportunity cost: 5 wheat vs. 8 wheat). Country B has comparative advantage in wheat (lower opportunity cost: 0.125 cars vs. 0.2 cars). Both countries benefit from specializing in their comparative advantage and trading.",
          "concept_applied": "Countries should specialize in producing goods where they have comparative advantage (lowest opportunity cost) and trade for others. This increases total production and allows both countries to consume more than they could in isolation. Comparative advantage, not absolute advantage, determines beneficial trade patterns."
        }
      ],
      "image": {
        "src": "images/unit1/comparative_advantage.png",
        "alt": "Diagram showing how two parties with different opportunity costs both gain from specialization and trade",
        "caption": "Comparative advantage: specialize where opportunity cost is lowest, trade for the rest, both parties gain"
      }
    }
  ],
  "key_terms": [
    "Opportunity cost",
    "Trade-offs",
    "Next best alternative",
    "Explicit costs",
    "Implicit costs",
    "Sunk costs",
    "Sunk cost fallacy",
    "Rational decision-making",
    "Comparative advantage",
    "Absolute advantage",
    "Marginal analysis",
    "Cost-benefit analysis"
  ],
  "summary": "Opportunity cost is the value of the next best alternative foregone when making a choice. It represents the true cost of any decision—not just money spent, but what you give up. Because resources are scarce, using them one way means sacrificing alternative uses. Opportunity cost makes these trade-offs explicit and measurable. Only the single next best alternative counts—not all alternatives combined. Opportunity costs include both explicit costs (out-of-pocket expenditures) and implicit costs (value of foregone alternatives like time, income, or experiences). Sunk costs—past expenditures that cannot be recovered—are not opportunity costs and should not influence rational decisions. Opportunity cost varies by person and situation because people face different alternatives and value them differently. The same choice can have low opportunity cost for one person and high opportunity cost for another. Opportunity costs appear in all decisions: time allocation (every hour spent one way cannot be spent another), financial choices (money spent here cannot be spent elsewhere), career decisions (pursuing one path closes others), and policy decisions (resources devoted to one program cannot fund another). Businesses face opportunity costs when choosing which products to make, where to invest, and which markets to enter. Governments face opportunity costs when allocating limited budgets among competing public needs. Rational decision-making requires comparing benefits against opportunity costs—choose an option only if its benefit exceeds what you give up. Common errors include ignoring implicit costs, falling for the sunk cost fallacy, saying yes to too many low-value commitments, and treating 'free' things as costless when they consume valuable time. Comparative advantage—having lower opportunity cost in producing something—explains specialization and trade. Even if you're not absolutely best at anything, you have comparative advantage where your opportunity cost is lowest. Specialization based on comparative advantage and trading for other needs maximizes total output and benefits all parties. This applies to individuals (attorney and secretary), businesses, and countries (international trade). Understanding and applying opportunity cost improves decision quality, helps prioritize limited resources, and explains why specialization and trade create mutual benefits even among unequal partners."
}
