{
  "expanded_description": "Sometimes markets fail to produce the best outcomes for society. The invisible hand works well in many situations, but not all. When a factory pollutes a river, when your neighbor's beautiful garden increases your property value, or when someone benefits from national defense without paying, markets may not allocate resources efficiently. These situations involve externalities—spillover effects on third parties—or public goods that markets struggle to provide. Understanding these market failures is essential for analyzing when government intervention might improve outcomes and for evaluating real-world policies like pollution taxes, education subsidies, and public provision of goods.",
  
  "core_concept": {
    "principle": "Market failures occur when the unregulated market fails to achieve efficiency (maximize total surplus). Two important types are externalities and public goods. (1) Externality: A cost or benefit that affects a third party who is not directly involved in a transaction. Externalities cause a divergence between private and social costs/benefits, leading to inefficiency. (2) Negative externality (external cost): When a transaction imposes costs on others (e.g., pollution). The market overproduces because private costs understate true social costs. Solution: taxes, regulations, or cap-and-trade. (3) Positive externality (external benefit): When a transaction confers benefits on others (e.g., education, vaccination). The market underproduces because private benefits understate social benefits. Solution: subsidies, public provision, or mandates. (4) Public goods: Goods that are non-excludable (cannot prevent people from using them) and non-rival (one person's use does not reduce availability for others). Examples: national defense, lighthouses, clean air. Private markets underprovide public goods due to the free rider problem—people can benefit without paying. (5) Free rider problem: When people can enjoy a good without paying, they have no incentive to pay, leading to underprovision. Solutions: government provision, compulsory payment (taxes), or creating excludability.",
    
    "explanation": "Think of a factory that pollutes a river. The factory and its customers benefit, but people downstream bear a cost not reflected in the price of the factory's product. The market produces too much because it ignores this cost. That's a negative externality. Now think of education. When you get educated, you benefit, but so does society—more productive workers, less crime, better civic participation. The market produces too little education because you don't capture all these benefits. That's a positive externality. Finally, think of a lighthouse. Once it's built, every ship can use its light without paying. No private firm will build it because they can't charge for it. That's a public good with a free rider problem.",
    
    "image": {
      "src": "images/unit10/market_failures_overview.png",
      "alt": "Three panels: pollution (negative externality), education (positive externality), lighthouse (public good)",
      "caption": "Figure 10.0.1: Market failures include externalities and public goods."
    }
  },

  "sections": [
    {
      "section_title": "10.1 Externalities Defined",
      "introduction": "What happens when a market transaction affects people who aren't buying or selling? These spillover effects—externalities—are everywhere. A factory's pollution affects nearby residents. A neighbor's beautiful garden increases your property value. Your vaccination protects others from disease. When externalities exist, the market price no longer reflects the full costs or benefits to society, leading to inefficient outcomes. In this section, we'll define externalities and introduce the concepts of private vs. social costs and benefits.",
      
      "introduction_image": {
        "src": "images/unit10/externality_intro.png",
        "alt": "Factory with smoke affecting nearby homes; beautiful garden increasing neighbor's property value",
        "caption": "Figure 10.1.1: Externalities are spillover effects on third parties."
      },
      
      "key_concept": {
        "definition": "An externality is a cost or benefit from an economic transaction that affects a third party not directly involved in the transaction. (1) Private costs and benefits: The costs and benefits directly experienced by the buyers and sellers in a market. These are reflected in market prices and determine market outcomes. (2) External costs and benefits: Costs or benefits that spill over to third parties. They are not reflected in market prices. (3) Social costs and benefits: The sum of private and external costs/benefits. Social cost = private cost + external cost. Social benefit = private benefit + external benefit. (4) Types of externalities: (a) Negative externality (external cost): When a transaction imposes costs on others. Examples: pollution, noise, second-hand smoke. (b) Positive externality (external benefit): When a transaction confers benefits on others. Examples: education, vaccination, research and development, beautiful gardens. (5) Inefficiency from externalities: When externalities exist, the market equilibrium does not maximize total surplus because private decisions ignore external effects. Negative externalities lead to overproduction (too much of the good). Positive externalities lead to underproduction (too little of the good). (6) Correcting externalities: Government can use taxes, subsidies, regulations, or property rights to align private and social incentives.",
        
        "context": "The concept of externalities was developed by Arthur Pigou in the early 20th century. It is central to environmental economics, education policy, and many other areas. Understanding externalities is essential for analyzing when markets fail and for evaluating policy responses. In AP Microeconomics, you'll need to identify externalities, analyze their effects, and evaluate corrective policies.",
        
        "image": {
          "src": "images/unit10/externality_diagram.png",
          "alt": "Diagram showing private and social costs/benefits",
          "caption": "Figure 10.1.2: Externalities create a divergence between private and social costs/benefits."
        }
      },

      "classifications": [
        {
          "type": "Negative Externality",
          "value": "External cost imposed on others",
          "characteristics": ["Social cost > private cost", "Market overproduces", "Deadweight loss from overproduction", "Examples: pollution, noise", "Correct with tax or regulation"],
          "behavior": "A negative externality occurs when a transaction imposes costs on third parties. The classic example is pollution from a factory. The factory's private costs include labor, materials, and capital, but not the health and environmental costs borne by others. Therefore, social cost exceeds private cost. In a market, firms produce where private marginal cost equals price, but efficiency requires production where social marginal cost equals price. This leads to overproduction—the market quantity exceeds the socially optimal quantity. The overproduction creates deadweight loss equal to the area between social cost and private benefit from the efficient quantity to the market quantity. Negative externalities are ubiquitous in environmental issues and are a major justification for government intervention.",
          
          "image": {
            "src": "images/unit10/negative_ext.png",
            "alt": "Graph showing social cost above private cost, overproduction, DWL",
            "caption": "Figure 10.1.3: Negative externalities lead to overproduction."
          },
          
          "examples": [
            {
              "process": "Air pollution",
              "explanation": "A coal plant emits pollutants that cause respiratory illness in nearby communities. These health costs are external to the plant's decisions."
            },
            {
              "process": "Second-hand smoke",
              "explanation": "Smoking in public places imposes health costs on non-smokers."
            }
          ]
        },
        {
          "type": "Positive Externality",
          "value": "External benefit conferred on others",
          "characteristics": ["Social benefit > private benefit", "Market underproduces", "Deadweight loss from underproduction", "Examples: education, vaccination", "Correct with subsidy or provision"],
          "behavior": "A positive externality occurs when a transaction confers benefits on third parties. The classic example is education. When you get educated, you benefit through higher wages, but society also benefits through a more productive workforce, lower crime rates, and better civic participation. These social benefits are not reflected in your private decision to pursue education. Therefore, social benefit exceeds private benefit. In a market, individuals consume where private marginal benefit equals price (or marginal cost), but efficiency requires consumption where social marginal benefit equals price. This leads to underproduction—the market quantity is less than the socially optimal quantity. The underproduction creates deadweight loss equal to the area between private benefit and social cost from the market quantity to the efficient quantity. Positive externalities justify subsidies, public provision, or mandates.",
          
          "image": {
            "src": "images/unit10/positive_ext.png",
            "alt": "Graph showing social benefit above private benefit, underproduction, DWL",
            "caption": "Figure 10.1.4: Positive externalities lead to underproduction."
          },
          
          "examples": [
            {
              "process": "Education",
              "explanation": "A college graduate earns higher wages (private benefit), but society also gains from higher productivity, lower crime, and better civic engagement (external benefits)."
            },
            {
              "process": "Vaccination",
              "explanation": "Getting vaccinated protects you from disease (private benefit) and also helps achieve herd immunity, protecting others who cannot be vaccinated (external benefit)."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Externalities Create a Divergence Between Private and Social Incentives",
          "statement": "The fundamental problem with externalities is that the private costs and benefits faced by decision-makers differ from the true social costs and benefits. When a factory decides how much to produce, it considers its private costs but ignores the pollution costs imposed on others. When a student decides how much education to get, they consider their private benefits but ignore the broader social benefits. This divergence leads to inefficiency because decision-makers do not have the right incentives. The market outcome will not maximize total surplus. Understanding this divergence is key to designing corrective policies: taxes to make private costs reflect social costs, subsidies to make private benefits reflect social benefits.",
          "application": "To analyze an externality, compare private and social costs/benefits. Identify the divergence. Determine whether the market overproduces or underproduces relative to the social optimum.",
          "example": "A paper mill's private cost is $\\$100$ per ton. Pollution imposes $\\$20$ per ton external cost. Social cost = $\\$120$. The market produces where $P = \\$100$, but efficiency requires $P = \\$120$, so the market overproduces.",
          
          "image": {
            "src": "images/unit10/private_vs_social.png",
            "alt": "Divergence between private and social curves",
            "caption": "Figure 10.1.5: Externalities create a gap between private and social incentives."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Externalities",
          
          "image": {
            "src": "images/unit10/ext_example1.png",
            "alt": "Scenarios with potential externalities",
            "caption": "Figure 10.1.6: Identify the externality in each scenario."
          },
          
          "problem": "For each scenario, identify whether there is a positive externality, negative externality, or no externality. Explain.<br>a) A factory releases chemical waste into a river, harming downstream fisheries.<br>b) You plant a beautiful garden that your neighbors enjoy.<br>c) You buy a new car for personal use.<br>d) A research university publishes a breakthrough study that other companies use to develop new products.<br>e) Someone plays loud music late at night in an apartment building.",
          
          "step_by_step": [
            {
              "step": "Scenario a",
              "explanation": "Negative externality. The factory imposes costs (harm to fisheries) on third parties not involved in the transaction."
            },
            {
              "step": "Scenario b",
              "explanation": "Positive externality. Your garden provides enjoyment to neighbors—a benefit they didn't pay for."
            },
            {
              "step": "Scenario c",
              "explanation": "No externality (assuming no pollution beyond normal). The transaction affects only buyer and seller."
            },
            {
              "step": "Scenario d",
              "explanation": "Positive externality. The research benefits other companies who didn't pay for it."
            },
            {
              "step": "Scenario e",
              "explanation": "Negative externality. Loud music imposes costs (disturbance) on neighbors."
            }
          ],
          
          "final_answer": "a) Negative. b) Positive. c) None. d) Positive. e) Negative.",
          "concept_applied": "Externalities are spillover effects on third parties. They can be positive (benefits) or negative (costs)."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Transaction",
          "description": "Determine who is directly involved in the market transaction.",
          "mechanism": "Buyers and sellers are the direct participants.",
          "result": "Direct participants identified.",
          
          "image": {
            "src": "images/unit10/ext_step1.png",
            "alt": "Buyer and seller",
            "caption": "Figure 10.1.7: Step 1 - Identify the direct participants."
          }
        },
        {
          "step": 2,
          "process": "Identify Third-Party Effects",
          "description": "Determine if anyone not involved in the transaction is affected.",
          "mechanism": "Look for spillover costs or benefits to others.",
          "result": "Third-party effects identified.",
          
          "image": {
            "src": "images/unit10/ext_step2.png",
            "alt": "Third parties affected",
            "caption": "Figure 10.1.8: Step 2 - Identify effects on third parties."
          }
        },
        {
          "step": 3,
          "process": "Classify Externality Type",
          "description": "Determine if the third-party effect is a cost (negative) or benefit (positive).",
          "mechanism": "If third parties are harmed → negative externality. If helped → positive externality.",
          "result": "Externality classification.",
          
          "image": {
            "src": "images/unit10/ext_step3.png",
            "alt": "Negative or positive",
            "caption": "Figure 10.1.9: Step 3 - Classify as negative or positive."
          }
        }
      ],

      "image": {
        "src": "images/unit10/externality_summary.png",
        "alt": "Comprehensive summary: externalities defined, private vs social costs/benefits, types",
        "caption": "Figure 10.1.10: Externalities defined summary."
      }
    }
  ],

  "key_terms": [
    "Externality",
    "Spillover effect",
    "Third party",
    "Private cost",
    "Private benefit",
    "External cost",
    "External benefit",
    "Social cost",
    "Social benefit",
    "Negative externality",
    "Positive externality",
    "Overproduction",
    "Underproduction",
    "Deadweight loss",
    "Market failure",
    "Pigouvian tax",
    "Pigouvian subsidy",
    "Internalizing the externality"
  ],

  "summary": "An externality is a cost or benefit from an economic transaction that affects a third party not directly involved. Externalities cause a divergence between private and social costs/benefits, leading to market failure. Private costs and benefits are those experienced by the direct participants; social costs and benefits are the sum of private and external effects. Negative externalities (external costs) occur when a transaction imposes costs on others, such as pollution. The market overproduces because private costs understate social costs, creating deadweight loss from overproduction. Positive externalities (external benefits) occur when a transaction confers benefits on others, such as education or vaccination. The market underproduces because private benefits understate social benefits, creating deadweight loss from underproduction. Understanding externalities is essential for analyzing when markets fail and for evaluating corrective policies like taxes (to discourage negative externalities) and subsidies (to encourage positive externalities)."
}
