{
  "expanded_description": "What happens when a factory's production imposes costs on others—like pollution, noise, or congestion? These negative externalities are everywhere, from industrial pollution to second-hand smoke to traffic congestion. When negative externalities exist, the market produces too much because the price doesn't reflect the true cost to society. Understanding negative externalities is essential for analyzing environmental problems, designing policies like pollution taxes and cap-and-trade systems, and evaluating regulations.",
  
  "core_concept": {
    "principle": "A negative externality (external cost) occurs when a transaction imposes costs on third parties. This leads to overproduction and deadweight loss because private costs understate social costs. (1) Private marginal cost (PMC): The cost borne by the producer. (2) External marginal cost (EMC): The cost imposed on third parties. (3) Social marginal cost (SMC) = PMC + EMC. (4) Market equilibrium: Occurs where price = PMC (demand = supply). (5) Social optimum: Occurs where price = SMC. Because SMC > PMC, the market quantity exceeds the socially optimal quantity. (6) Deadweight loss: The reduction in total surplus from overproduction—the area between SMC and demand from the social optimum to the market quantity. (7) Corrective policies: (a) Pigouvian tax: A tax equal to the external cost, which shifts the supply curve up by the tax, aligning private and social costs. (b) Regulation: Limiting quantity directly (emissions standards). (c) Cap-and-trade: Creating a market for pollution permits.",
    
    "explanation": "Think of a factory that pollutes a river. The factory's cost of production doesn't include the harm to downstream fisheries and communities. So the market price of the factory's product is too low, and too much is produced. The socially optimal amount would be lower, reflecting the true cost including pollution. A tax on the factory equal to the damage per unit makes the factory face the true cost, leading to the right amount of production.",
    
    "image": {
      "src": "images/unit10/negative_ext_graph.png",
      "alt": "Graph showing PMC, SMC, demand, with overproduction and DWL",
      "caption": "Figure 10.2.1: Negative externalities lead to overproduction and deadweight loss."
    }
  },

  "sections": [
    {
      "section_title": "10.2 Negative Externalities",
      "introduction": "What happens when a factory's production imposes costs on others—like pollution, noise, or congestion? These negative externalities are everywhere, from industrial pollution to second-hand smoke to traffic congestion. When negative externalities exist, the market produces too much because the price doesn't reflect the true cost to society. Understanding negative externalities is essential for analyzing environmental problems, designing policies like pollution taxes and cap-and-trade systems, and evaluating regulations.",
      
      "introduction_image": {
        "src": "images/unit10/negative_intro.png",
        "alt": "Factory emitting smoke affecting nearby community",
        "caption": "Figure 10.2.2: Negative externalities impose costs on third parties."
      },
      
      "key_concept": {
        "definition": "A negative externality (or external cost) exists when a transaction imposes costs on third parties not involved in the transaction. (1) Private marginal cost (PMC): The cost borne directly by the producer. This determines the supply curve. (2) External marginal cost (EMC): The cost imposed on others per unit. (3) Social marginal cost (SMC) = PMC + EMC. This represents the true cost to society of producing an additional unit. (4) Market equilibrium: In an unregulated market, equilibrium occurs where price equals PMC (demand = supply). Quantity is $Q_m$. (5) Social optimum: The efficient quantity occurs where price equals SMC. Quantity is $Q_s < Q_m$. (6) Overproduction: The market produces too much ($Q_m > Q_s$). The units between $Q_s$ and $Q_m$ have social cost greater than consumer value, creating deadweight loss. (7) Deadweight loss: The area between SMC and demand from $Q_s$ to $Q_m$. (8) Corrective policies: (a) Pigouvian tax: A tax equal to the external cost per unit. This shifts the supply curve up by the tax, making producers face SMC. The market then produces at $Q_s$. (b) Regulation: Directly limiting output or emissions to $Q_s$. (c) Cap-and-trade: Setting a total cap on emissions and allowing firms to trade permits.",
        
        "context": "Negative externalities are central to environmental economics and public policy. The concept of a Pigouvian tax (named after economist Arthur Pigou) provides a market-based solution to pollution problems. In recent decades, cap-and-trade systems (like the one for sulfur dioxide) have been used successfully. In AP Microeconomics, understanding negative externalities is essential for analyzing environmental issues and evaluating policy responses.",
        
        "image": {
          "src": "images/unit10/negative_detailed.png",
          "alt": "Detailed graph with PMC, SMC, demand, showing market quantity, social optimum, and DWL",
          "caption": "Figure 10.2.3: Negative externalities cause overproduction and deadweight loss."
        }
      },

      "classifications": [
        {
          "type": "Market Outcome with Negative Externality",
          "value": "$Q_m > Q_s$, overproduction",
          "characteristics": ["Price based on PMC only", "External costs ignored", "Too much produced", "DWL from overproduction", "Inefficient"],
          "behavior": "In a market with a negative externality, firms produce where price equals their private marginal cost. They have no incentive to consider the external costs imposed on others. As a result, the market quantity exceeds the socially optimal quantity. For each unit between $Q_s$ and $Q_m$, the social cost of production exceeds the value consumers place on the unit (as measured by the demand curve). These units should not be produced from society's perspective, but they are because the external cost is ignored. This overproduction creates deadweight loss, which measures the inefficiency. The size of the deadweight loss depends on the magnitude of the external cost and the elasticities of supply and demand.",
          
          "image": {
            "src": "images/unit10/market_outcome_negative.png",
            "alt": "Market outcome with overproduction",
            "caption": "Figure 10.2.4: The market produces too much when there are negative externalities."
          },
          
          "examples": [
            {
              "process": "Coal plant",
              "explanation": "A coal plant produces electricity where its private cost equals the price, ignoring the health and environmental costs of pollution. Too much coal-fired electricity is produced."
            }
          ]
        },
        {
          "type": "Social Optimum",
          "value": "$Q_s$ where $P = SMC$",
          "characteristics": ["Accounts for external costs", "Efficient quantity", "Maximizes total surplus", "Lower than market quantity", "Requires intervention to achieve"],
          "behavior": "The socially optimal quantity is where the price (which reflects the marginal benefit to consumers) equals the social marginal cost, including both private and external costs. At this quantity, total surplus is maximized—all units where social benefit exceeds social cost are produced, and no units where social cost exceeds social benefit are produced. The social optimum cannot be achieved by an unregulated market because firms ignore external costs. Reaching the social optimum requires some form of intervention, such as a Pigouvian tax, regulation, or a cap-and-trade system. The choice among these policy tools involves considerations of efficiency, administrative cost, and political feasibility.",
          
          "image": {
            "src": "images/unit10/social_optimum_negative.png",
            "alt": "Social optimum at intersection of demand and SMC",
            "caption": "Figure 10.2.5: The social optimum is where price equals social marginal cost."
          },
          
          "examples": [
            {
              "process": "Efficient pollution level",
              "explanation": "The socially optimal level of pollution is not zero—it's where the marginal benefit of reducing pollution equals the marginal cost. This is typically achieved through taxes or permits."
            }
          ]
        },
        {
          "type": "Pigouvian Tax",
          "value": "Tax equal to external cost",
          "characteristics": ["Tax = EMC per unit", "Shifts supply up", "Aligns private and social costs", "Achieves social optimum", "Raises revenue"],
          "behavior": "A Pigouvian tax is a tax set equal to the external marginal cost. By imposing this tax on producers, the private cost increases to match the social cost. The supply curve shifts up by the amount of the tax. The new market equilibrium occurs where the new supply (which now reflects social cost) intersects demand, which is exactly the social optimum. The tax \"internalizes the externality\"—makes producers face the true cost of their actions. Pigouvian taxes have several advantages: they achieve efficiency, raise revenue that can be used to reduce other taxes or compensate those harmed, and provide continuous incentives for firms to reduce their external costs (since they pay the tax on every unit). They are a key tool in environmental policy.",
          
          "image": {
            "src": "images/unit10/pigouvian_tax.png",
            "alt": "Pigouvian tax shifting supply to SMC, achieving social optimum",
            "caption": "Figure 10.2.6: A Pigouvian tax equal to external cost achieves the social optimum."
          },
          
          "examples": [
            {
              "process": "Carbon tax",
              "explanation": "A tax on carbon emissions equal to the estimated social cost of carbon makes polluters pay for the damage they cause, leading to efficient reduction in emissions."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Negative Externalities Lead to Overproduction and Deadweight Loss",
          "statement": "The key result of negative externalities is that markets produce too much of the good. The quantity is higher than the socially optimal level, and the price is too low. The overproduction creates deadweight loss—a reduction in total surplus below what could be achieved. The deadweight loss is the area between the social marginal cost curve and the demand curve from the social optimum to the market quantity. It represents the net loss to society from the units that should not have been produced. This is the fundamental inefficiency caused by negative externalities. Understanding this helps explain why pollution is a problem and why corrective policies can improve outcomes.",
          "application": "To analyze a negative externality, compare the market quantity to the social optimum. The gap between them, combined with the size of the external cost, determines the deadweight loss. This quantifies the inefficiency.",
          "example": "If the social cost exceeds private cost by $\\$10$ per unit, and the market overproduces by 100 units, the deadweight loss is approximately $\\frac{1}{2} × 10 × 100 = 500$ (if demand and SMC are linear).",
          
          "image": {
            "src": "images/unit10/negative_dwl_principle.png",
            "alt": "Deadweight loss from negative externality",
            "caption": "Figure 10.2.7: Negative externalities create deadweight loss from overproduction."
          }
        },
        {
          "principle": "Pigouvian Taxes Correct Negative Externalities by Aligning Private and Social Costs",
          "statement": "The Pigouvian tax is the classic solution to negative externalities. By setting a tax equal to the external cost per unit, the government makes private decision-makers face the full social cost of their actions. The tax shifts the supply curve upward, leading to a new equilibrium at the socially optimal quantity. The tax revenue can be used for public purposes or to compensate those harmed. Pigouvian taxes have the additional advantage of providing continuous incentives for innovation—firms that can reduce their external costs pay less tax, encouraging them to develop cleaner technologies. This is why many economists prefer taxes to direct regulation.",
          "application": "To design a Pigouvian tax, estimate the external marginal cost per unit. Set the tax equal to that amount. The tax can be imposed on producers (shifting supply) or consumers, but the effect is the same.",
          "example": "If the external cost of pollution is $\\$50$ per ton, a $\\$50$ per ton tax on emissions will lead firms to reduce pollution to the efficient level.",
          
          "image": {
            "src": "images/unit10/pigouvian_principle.png",
            "alt": "Pigouvian tax aligning private and social costs",
            "caption": "Figure 10.2.8: A Pigouvian tax internalizes the externality."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing a Negative Externality",
          
          "image": {
            "src": "images/unit10/negative_example1.png",
            "alt": "Market with pollution externality",
            "caption": "Figure 10.2.9: Calculate market outcome, social optimum, and DWL."
          },
          
          "problem": "A factory produces steel. Demand for steel is $P = 100 - Q$. Private marginal cost is $PMC = 20 + Q$. Production creates pollution that imposes an external cost of $\\$20$ per unit (constant).<br>a) Find the market equilibrium quantity and price.<br>b) Find the social marginal cost function.<br>c) Find the socially optimal quantity and price.<br>d) Calculate the deadweight loss from the externality.<br>e) What Pigouvian tax would achieve the social optimum?",
          
          "step_by_step": [
            {
              "step": "Market equilibrium",
              "explanation": "Set $P = PMC$: $100 - Q = 20 + Q$ → $80 = 2Q$ → $Q_m = 40$, $P_m = 100 - 40 = 60$."
            },
            {
              "step": "Social marginal cost",
              "explanation": "$SMC = PMC + MEC = 20 + Q + 20 = 40 + Q$."
            },
            {
              "step": "Social optimum",
              "explanation": "Set $P = SMC$: $100 - Q = 40 + Q$ → $60 = 2Q$ → $Q_s = 30$, $P_s = 100 - 30 = 70$."
            },
            {
              "step": "Deadweight loss",
              "explanation": "DWL is triangle between SMC and demand from $Q_s$ to $Q_m$. At $Q=30$, $SMC = 70$, demand = 70. At $Q=40$, $SMC = 80$, demand = 60. Height at $Q=40$ = $80 - 60 = 20$. Base = $40 - 30 = 10$. DWL = $\\frac{1}{2} × 20 × 10 = 100$."
            },
            {
              "step": "Pigouvian tax",
              "explanation": "Tax should equal external cost = $\\$20$ per unit. This would shift private MC to $20 + Q + 20 = 40 + Q = SMC$, achieving $Q_s=30$."
            }
          ],
          
          "final_answer": "a) $Q_m=40$, $P_m=60$. b) $SMC = 40 + Q$. c) $Q_s=30$, $P_s=70$. d) $DWL=100$. e) Tax = $20$ per unit.",
          "concept_applied": "Negative externality causes overproduction; Pigouvian tax corrects it."
        },
        {
          "title": "Comparing Policy Options",
          
          "image": {
            "src": "images/unit10/negative_example2.png",
            "alt": "Policy options for pollution",
            "caption": "Figure 10.2.10: Compare tax and regulation."
          },
          
          "problem": "In the steel market from the previous example, compare a Pigouvian tax of $\\$20$ to a regulation that simply limits production to 30 units.<br>a) Show that both achieve the same quantity.<br>b) What are the effects on consumer surplus, producer surplus, and government revenue under each policy?<br>c) Which policy gives firms an incentive to develop cleaner technology? Explain.",
          
          "step_by_step": [
            {
              "step": "Quantity under both",
              "explanation": "Both policies achieve $Q=30$. Tax does it by shifting supply; regulation does it by mandate."
            },
            {
              "step": "Tax effects",
              "explanation": "With tax, consumer price = $70$, producer price = $50$ (since $70 - 20 = 50$). Consumer surplus = $\\frac{1}{2} × (100-70) × 30 = \\frac{1}{2} × 30 × 30 = 450$. Producer surplus = area above supply (private MC) up to $Q=30$ at price $50$. Need to calculate: producer surplus = revenue - variable cost. Revenue = $50 × 30 = 1500$. Variable cost = area under PMC from 0 to 30 = $∫_0^{30} (20+Q)dQ = 20×30 + (30^2)/2 = 600 + 450 = 1050$. PS = $1500 - 1050 = 450$. Tax revenue = $20 × 30 = 600$. Total surplus = $450 + 450 + 600 = 1500$."
            },
            {
              "step": "Regulation effects",
              "explanation": "With regulation limiting Q to 30, price is determined by demand: $P=70$. Firms receive $70$. Producer surplus = revenue - variable cost = $70×30 - 1050 = 2100 - 1050 = 1050$. Consumer surplus = $450$ (same as before). No tax revenue. Total surplus = $450 + 1050 = 1500$—same total! But distribution differs: under regulation, producers get $1050$ instead of $450$, and there's no tax revenue."
            },
            {
              "step": "Incentives for innovation",
              "explanation": "Under the tax, firms have an incentive to develop cleaner technology because reducing pollution reduces the tax they pay. Under regulation, once they meet the limit, there's no further incentive to reduce pollution further. The tax provides dynamic incentives for innovation."
            }
          ],
          
          "final_answer": "a) Both achieve Q=30. b) Tax: CS=450, PS=450, revenue=600. Regulation: CS=450, PS=1050, revenue=0. Total surplus same. c) Tax gives innovation incentive; regulation does not.",
          "concept_applied": "Pigouvian taxes and regulations can both achieve efficient quantity, but taxes provide better incentives for innovation."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Private and Social Costs",
          "description": "Determine private marginal cost and external marginal cost.",
          "mechanism": "$SMC = PMC + MEC$",
          "result": "Cost functions.",
          
          "image": {
            "src": "images/unit10/negative_step1.png",
            "alt": "Private and social cost",
            "caption": "Figure 10.2.11: Step 1 - Identify private and social costs."
          }
        },
        {
          "step": 2,
          "process": "Find Market Equilibrium",
          "description": "Determine where price equals private marginal cost.",
          "mechanism": "Set $P = PMC$, solve for $Q_m$, $P_m$.",
          "result": "Market quantity and price.",
          
          "image": {
            "src": "images/unit10/negative_step2.png",
            "alt": "Market equilibrium",
            "caption": "Figure 10.2.12: Step 2 - Find market equilibrium."
          }
        },
        {
          "step": 3,
          "process": "Find Social Optimum",
          "description": "Determine where price equals social marginal cost.",
          "mechanism": "Set $P = SMC$, solve for $Q_s$, $P_s$.",
          "result": "Socially optimal quantity and price.",
          
          "image": {
            "src": "images/unit10/negative_step3.png",
            "alt": "Social optimum",
            "caption": "Figure 10.2.13: Step 3 - Find social optimum."
          }
        },
        {
          "step": 4,
          "process": "Calculate Deadweight Loss",
          "description": "Find the area between SMC and demand from $Q_s$ to $Q_m$.",
          "mechanism": "$DWL = \\frac{1}{2} × (MEC \\text{ at } Q_m) × (Q_m - Q_s)$ for linear curves.",
          "result": "Deadweight loss.",
          
          "image": {
            "src": "images/unit10/negative_step4.png",
            "alt": "Deadweight loss triangle",
            "caption": "Figure 10.2.14: Step 4 - Calculate deadweight loss."
          }
        },
        {
          "step": 5,
          "process": "Design Corrective Policy",
          "description": "Determine tax or regulation to achieve social optimum.",
          "mechanism": "Pigouvian tax = $MEC$ per unit.",
          "result": "Policy recommendation.",
          
          "image": {
            "src": "images/unit10/negative_step5.png",
            "alt": "Pigouvian tax",
            "caption": "Figure 10.2.15: Step 5 - Design corrective policy."
          }
        }
      ],

      "image": {
        "src": "images/unit10/negative_summary.png",
        "alt": "Comprehensive summary: negative externalities, overproduction, DWL, Pigouvian tax",
        "caption": "Figure 10.2.16: Negative externalities summary."
      }
    }
  ],

  "key_terms": [
    "Negative externality",
    "External cost",
    "Private marginal cost (PMC)",
    "External marginal cost (EMC)",
    "Social marginal cost (SMC)",
    "Overproduction",
    "Deadweight loss",
    "Social optimum",
    "Pigouvian tax",
    "Internalizing the externality",
    "Pollution tax",
    "Carbon tax",
    "Cap-and-trade",
    "Emissions trading",
    "Regulation",
    "Command and control",
    "Marginal damage",
    "Coase theorem"
  ],

  "summary": "A negative externality (external cost) exists when a transaction imposes costs on third parties not involved in the transaction. This leads to a divergence between private marginal cost (borne by producers) and social marginal cost (including external costs). In an unregulated market, firms produce where price equals private marginal cost, resulting in overproduction—the market quantity exceeds the socially optimal quantity where price equals social marginal cost. The overproduction creates deadweight loss equal to the area between social marginal cost and demand from the social optimum to the market quantity. The size of the deadweight loss depends on the magnitude of the external cost and the elasticities of supply and demand. Corrective policies include: (1) Pigouvian tax: A tax equal to the external cost per unit, which shifts the supply curve upward, aligning private and social costs and achieving the social optimum. (2) Regulation: Directly limiting output or emissions to the socially optimal level. (3) Cap-and-trade: Setting a total cap on emissions and allowing firms to trade permits. Pigouvian taxes have the advantage of providing continuous incentives for innovation in pollution reduction. Understanding negative externalities is essential for analyzing environmental problems and evaluating policy responses."
}
