{
  "expanded_description": "Some goods don't fit the standard market model. National defense, lighthouses, clean air, and basic research are all examples of public goods—goods that are non-excludable and non-rival. These characteristics create unique challenges for private markets. Because people cannot be excluded from consuming them, they have no incentive to pay. And because one person's consumption doesn't reduce availability for others, the efficient price is zero. Understanding public goods is essential for analyzing why markets fail to provide them and for evaluating government's role in their provision.",
  
  "core_concept": {
    "principle": "Public goods are goods that are non-excludable and non-rival. (1) Non-excludable: It is impossible (or extremely costly) to prevent people from consuming the good, even if they don't pay. Examples: national defense, clean air, street lighting. (2) Non-rival: One person's consumption does not reduce the amount available for others. My enjoyment of national defense doesn't diminish yours. (3) Pure public goods have both characteristics. (4) Private goods are excludable and rival (most goods we buy). (5) Common resources are rival but non-excludable (fish in the ocean, grazing land). (6) Club goods are excludable but non-rival (cable TV, subscription services). (7) Public goods lead to market failure because private firms cannot charge for them (non-excludable) and the efficient price is zero (non-rival). Private markets will underprovide public goods, often providing none at all. (8) Government often provides public goods, funded through compulsory taxation.",
    
    "explanation": "Think of a lighthouse. Once it's built, every ship can use its light. You can't exclude ships that didn't pay (non-excludable). And one ship using the light doesn't prevent others from using it (non-rival). No private firm will build a lighthouse because they can't charge for it. This is why lighthouses are often provided by government. The same logic applies to national defense, basic research, and many other goods that benefit everyone but can't be sold in markets.",
    
    "image": {
      "src": "images/unit10/public_goods_overview.png",
      "alt": "Lighthouse, national defense, clean air—examples of public goods",
      "caption": "Figure 10.4.1: Public goods are non-excludable and non-rival."
    }
  },

  "sections": [
    {
      "section_title": "10.4 Public Goods",
      "introduction": "Some goods don't fit the standard market model. National defense, lighthouses, clean air, and basic research are all examples of public goods—goods that are non-excludable and non-rival. These characteristics create unique challenges for private markets. Because people cannot be excluded from consuming them, they have no incentive to pay. And because one person's consumption doesn't reduce availability for others, the efficient price is zero. Understanding public goods is essential for analyzing why markets fail to provide them and for evaluating government's role in their provision.",
      
      "introduction_image": {
        "src": "images/unit10/public_goods_intro.png",
        "alt": "Lighthouse shining light on multiple ships, everyone benefiting",
        "caption": "Figure 10.4.2: Public goods benefit everyone; one person's use doesn't reduce availability for others."
      },
      
      "key_concept": {
        "definition": "Public goods are defined by two characteristics: non-excludability and non-rivalry. (1) Non-excludable: It is impossible or prohibitively costly to prevent people from consuming the good, even if they do not pay. Once the good is provided, everyone can benefit. Examples: national defense, lighthouses, street lighting, clean air. (2) Non-rival: One person's consumption of the good does not reduce the amount available for others. My enjoyment of national defense does not diminish yours. The marginal cost of an additional user is zero. (3) Pure public goods have both characteristics. (4) Classification of goods by characteristics: (a) Private goods: Excludable and rival (most goods—food, clothing, cars). (b) Public goods: Non-excludable and non-rival (national defense, knowledge). (c) Common resources: Rival but non-excludable (fish in the ocean, grazing land, clean water). These lead to the tragedy of the commons. (d) Club goods: Excludable but non-rival (cable TV, subscription services, bridges with low congestion). (5) Market failure: Private markets fail to provide public goods efficiently because of the free rider problem. Since people cannot be excluded, they have no incentive to pay. Firms cannot charge for the good, so they will not produce it. (6) Efficient provision: For a public good, the efficient quantity is where the sum of individuals' marginal benefits equals the marginal cost of provision. The demand curve for a public good is the vertical sum of individual demand curves (since everyone consumes the same quantity).",
        
        "context": "The theory of public goods was developed by Paul Samuelson in the 1950s. It provides a rigorous foundation for understanding why some goods must be provided collectively. Public goods are everywhere in modern economies—from basic research to national defense to public health. Understanding public goods is essential for analyzing government spending, taxation, and the proper role of the public sector.",
        
        "image": {
          "src": "images/unit10/goods_classification.png",
          "alt": "2x2 matrix classifying goods: private, public, common resources, club goods",
          "caption": "Figure 10.4.3: Goods can be classified by excludability and rivalry."
        }
      },

      "classifications": [
        {
          "type": "Non-Excludability",
          "value": "Cannot prevent consumption",
          "characteristics": ["No way to charge users", "Free riders possible", "Private firms can't profit", "Leads to underprovision", "Requires collective action"],
          "behavior": "Non-excludability means that once a good is provided, it is impossible or extremely costly to prevent people from consuming it, even if they haven't paid. This creates the free rider problem: individuals have an incentive to enjoy the benefits without contributing to the cost. Since firms cannot charge for the good, they have no profit incentive to produce it. Private markets will therefore underprovide non-excludable goods, often providing none at all. Non-excludability is the key reason why public goods must be provided collectively, typically through government funded by compulsory taxation. Examples of non-excludable goods include national defense (protects everyone regardless of payment), lighthouses (ships can't be excluded from using the light), and basic research (knowledge cannot be kept secret once published).",
          
          "image": {
            "src": "images/unit10/non_excludable.png",
            "alt": "Lighthouse with ships benefiting without paying",
            "caption": "Figure 10.4.4: Non-excludable goods cannot prevent free riders."
          },
          
          "examples": [
            {
              "process": "National defense",
              "explanation": "Once the military protects the country, everyone within the borders is protected—you can't exclude non-payers."
            },
            {
              "process": "Clean air",
              "explanation": "Improving air quality benefits everyone in the area; you can't make people breathe only the air they paid for."
            }
          ]
        },
        {
          "type": "Non-Rivalry",
          "value": "Consumption doesn't reduce availability",
          "characteristics": ["Zero marginal cost for additional user", "Efficient price = 0", "No congestion up to capacity", "Can have congestion at high use", "Creates pricing challenges"],
          "behavior": "Non-rivalry means that one person's consumption of the good does not reduce the amount available for others. The marginal cost of providing the good to an additional person is zero (at least until congestion sets in). This has important implications for efficiency: the efficient price for a non-rival good is zero, because charging a positive price would exclude some people even though their consumption costs nothing. However, if the price is zero, how will the good be funded? This is the fundamental tension with non-rival goods. Examples include a lighthouse (one ship's use doesn't diminish the light), a bridge with low traffic (an additional car doesn't slow others), and digital goods (software, music downloads). At high levels of use, some non-rival goods become congested (a bridge can become rival during rush hour).",
          
          "image": {
            "src": "images/unit10/non_rival.png",
            "alt": "Multiple ships using same lighthouse beam",
            "caption": "Figure 10.4.5: Non-rival goods can be consumed by many without depletion."
          },
          
          "examples": [
            {
              "process": "Lighthouse",
              "explanation": "One ship using the lighthouse beam doesn't prevent another ship from also using it."
            },
            {
              "process": "Knowledge",
              "explanation": "When you learn something, that knowledge isn't used up—others can also learn it."
            }
          ]
        },
        {
          "type": "Pure Public Goods",
          "value": "Non-excludable and non-rival",
          "characteristics": ["Both characteristics present", "Market fails completely", "Free rider problem", "Efficient price = 0", "Government provision typical"],
          "behavior": "Pure public goods have both non-excludability and non-rivalry. These goods present the most extreme case of market failure. Because they are non-excludable, private firms cannot charge for them. Because they are non-rival, the efficient price is zero, making any positive price inefficient. The private market will provide none of these goods, or far too little. Society must therefore provide them collectively, typically through government funded by taxes. The efficient quantity of a pure public good is where the sum of individuals' marginal benefits equals the marginal cost of provision. Determining this quantity is difficult because people have incentives to understate their true benefits (free riding). Examples include national defense, lighthouses, and basic research. In practice, many goods are not pure public goods but have elements of these characteristics.",
          
          "image": {
            "src": "images/unit10/pure_public.png",
            "alt": "National defense protecting everyone",
            "caption": "Figure 10.4.6: Pure public goods like national defense require collective provision."
          },
          
          "examples": [
            {
              "process": "National defense",
              "explanation": "Protects everyone, non-excludable and non-rival. No private firm could sell national defense."
            },
            {
              "process": "Basic research",
              "explanation": "Discoveries benefit everyone and can't be kept secret (non-excludable) and don't get used up (non-rival)."
            }
          ]
        },
        {
          "type": "Other Good Types",
          "value": "Private goods, common resources, club goods",
          "characteristics": ["Private: excludable, rival", "Common: rival, non-excludable", "Club: excludable, non-rival", "Each has different issues"],
          "behavior": "Not all goods are public goods. The 2x2 matrix helps classify: (1) Private goods (excludable and rival): Most goods we buy. Markets work well for these. (2) Common resources (rival but non-excludable): Fish in the ocean, grazing land, clean water. These suffer from the tragedy of the commons—overuse because no one can be excluded. (3) Club goods (excludable but non-rival): Cable TV, subscription services, bridges with low congestion. These can be provided by markets through pricing, but there is tension between efficiency (price should be zero) and cost recovery. Each type requires different policy responses.",
          
          "image": {
            "src": "images/unit10/goods_matrix.png",
            "alt": "2x2 matrix with examples",
            "caption": "Figure 10.4.7: Four types of goods based on excludability and rivalry."
          },
          
          "examples": [
            {
              "process": "Common resource: ocean fisheries",
              "explanation": "Fish are rival (one caught reduces others' catch) but non-excludable (can't stop others from fishing), leading to overfishing."
            },
            {
              "process": "Club good: cable TV",
              "explanation": "Excludable (need subscription) but non-rival (one subscriber doesn't reduce signal for others)."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Public Goods Lead to Market Failure Due to Non-Excludability",
          "statement": "The key reason markets fail to provide public goods is non-excludability. Because people cannot be prevented from consuming the good even if they don't pay, they have no incentive to pay. This is the free rider problem. Everyone hopes others will pay, and they can enjoy the good for free. As a result, private firms cannot charge for the good and will not produce it. The market may provide none of the good, or far too little. This is a market failure because the good has value—people would benefit from it—but the market cannot capture that value. Government intervention, typically through taxation and public provision, is the standard solution. Understanding this failure is essential for analyzing the role of government in the economy.",
          "application": "To determine if a good might be underprovided by markets, ask: Is it non-excludable? If yes, private firms will struggle to charge for it, and government provision may be necessary.",
          "example": "A private company could not successfully sell national defense because once the military is in place, everyone is protected whether they pay or not. Everyone would free ride, and the company would fail.",
          
          "image": {
            "src": "images/unit10/free_rider_principle.png",
            "alt": "People benefiting without paying",
            "caption": "Figure 10.4.8: Non-excludability creates the free rider problem."
          }
        },
        {
          "principle": "The Efficient Quantity of a Public Good Is Where Sum of Marginal Benefits Equals Marginal Cost",
          "statement": "For a private good, the efficient quantity is where each individual's marginal benefit equals the market price (which equals marginal cost). For a public good, the analysis is different because everyone consumes the same quantity. The social marginal benefit of an additional unit is the sum of the marginal benefits of all individuals. The efficient quantity is where this sum equals the marginal cost of providing the good. Graphically, the demand curve for a public good is the vertical sum of individual demand curves (adding willingness to pay at each quantity), not the horizontal sum as for private goods. Determining this efficient quantity is challenging in practice because individuals have incentives to understate their true willingness to pay (free riding).",
          "application": "To find the efficient quantity of a public good, survey individuals' willingness to pay, sum them vertically, and find where total willingness to pay equals marginal cost. This is the theoretical benchmark, though difficult to implement in practice.",
          "example": "For a public project that benefits three people with marginal benefits \\$10, \\$20, and \\$30 at a given quantity, the social marginal benefit is \\$60. If marginal cost is \\$50, the project should be expanded.",
          
          "image": {
            "src": "images/unit10/public_demand.png",
            "alt": "Vertical summation of individual demand curves for public good",
            "caption": "Figure 10.4.9: Demand for a public good is the vertical sum of individual marginal benefits."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Classifying Goods",
          
          "image": {
            "src": "images/unit10/public_example1.png",
            "alt": "List of goods to classify",
            "caption": "Figure 10.4.10: Classify each good by excludability and rivalry."
          },
          
          "problem": "For each good, determine if it is excludable or non-excludable, rival or non-rival, and classify as private good, public good, common resource, or club good:<br>a) A slice of pizza<br>b) National defense<br>c) Fish in the ocean<br>d) Cable television<br>e) A lighthouse<br>f) Clean air in a city",
          
          "step_by_step": [
            {
              "step": "Slice of pizza",
              "explanation": "Excludable (can prevent someone from eating it), rival (once eaten, it's gone). Private good."
            },
            {
              "step": "National defense",
              "explanation": "Non-excludable (protects everyone), non-rival (my protection doesn't reduce yours). Public good."
            },
            {
              "step": "Fish in the ocean",
              "explanation": "Non-excludable (can't stop people from fishing), rival (fish caught reduce available fish). Common resource."
            },
            {
              "step": "Cable television",
              "explanation": "Excludable (need subscription), non-rival (one viewer doesn't reduce signal for others). Club good."
            },
            {
              "step": "Lighthouse",
              "explanation": "Non-excludable (can't exclude ships), non-rival (one ship's use doesn't diminish light). Public good."
            },
            {
              "step": "Clean air in a city",
              "explanation": "Non-excludable (everyone breathes), rival? At low levels, non-rival; at high pollution, becomes rival (one person's pollution affects others). Typically considered a common resource or public good depending on context."
            }
          ],
          
          "final_answer": "a) Private. b) Public. c) Common resource. d) Club. e) Public. f) Common resource/public good.",
          "concept_applied": "Goods classification depends on excludability and rivalry."
        },
        {
          "title": "Efficient Provision of a Public Good",
          
          "image": {
            "src": "images/unit10/public_example2.png",
            "alt": "Individual marginal benefit schedules",
            "caption": "Figure 10.4.11: Find efficient quantity of a public good."
          },
          
          "problem": "A public good benefits three individuals with the following marginal benefit schedules:<br>Person A: $MB_A = 100 - 2Q$<br>Person B: $MB_B = 80 - Q$<br>Person C: $MB_C = 60 - 0.5Q$<br>The marginal cost of providing the public good is $MC = 120$.<br>a) Derive the social marginal benefit function (sum of individual MBs).<br>b) Find the efficient quantity of the public good.<br>c) What is the total willingness to pay at the efficient quantity?<br>d) How much would each person pay if they paid their marginal benefit?",
          
          "step_by_step": [
            {
              "step": "Sum individual MBs",
              "explanation": "$SMB = (100 - 2Q) + (80 - Q) + (60 - 0.5Q) = 240 - 3.5Q$."
            },
            {
              "step": "Efficient quantity",
              "explanation": "Set $SMB = MC$: $240 - 3.5Q = 120$ → $3.5Q = 120$ → $Q = 120/3.5 = 34.29$ (approximately 34)."
            },
            {
              "step": "Total willingness to pay",
              "explanation": "At $Q=34.29$, $SMB = 120$, so total willingness to pay for that unit = 120. Over all units, total willingness to pay = area under SMB from 0 to 34.29 = $∫_0^{34.29} (240 - 3.5Q)dQ = 240Q - 1.75Q^2 = 240(34.29) - 1.75(34.29^2) ≈ 8229.6 - 1.75(1175.8) = 8229.6 - 2057.7 = 6171.9$."
            },
            {
              "step": "Payments by marginal benefit",
              "explanation": "At $Q=34.29$, $MB_A = 100 - 2(34.29) = 100 - 68.58 = 31.42$, $MB_B = 80 - 34.29 = 45.71$, $MB_C = 60 - 0.5(34.29) = 60 - 17.145 = 42.855$. Sum = $31.42 + 45.71 + 42.86 = 120$, matching MC. If they paid these amounts: Person A pays \\$31.42, Person B pays \\$45.71, Person C pays \\$42.86."
            }
          ],
          
          "final_answer": "a) $SMB = 240 - 3.5Q$. b) $Q ≈ 34.29$. c) Total WTP ≈ 6172. d) A: \\$31.42, B: \\$45.71, C: \\$42.86.",
          "concept_applied": "Efficient quantity of public good is where sum of marginal benefits equals marginal cost."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Assess Excludability",
          "description": "Determine if it's possible to prevent people from consuming the good.",
          "mechanism": "Can you charge a price and exclude non-payers? If yes, excludable. If no, non-excludable.",
          "result": "Excludability classification.",
          
          "image": {
            "src": "images/unit10/public_step1.png",
            "alt": "Gate with fence (excludable) vs. open field (non-excludable)",
            "caption": "Figure 10.4.12: Step 1 - Assess excludability."
          }
        },
        {
          "step": 2,
          "process": "Assess Rivalry",
          "description": "Determine if one person's consumption reduces availability for others.",
          "mechanism": "Does using the good use it up? If yes, rival. If no, non-rival.",
          "result": "Rivalry classification.",
          
          "image": {
            "src": "images/unit10/public_step2.png",
            "alt": "One pizza being eaten (rival) vs. lighthouse beam (non-rival)",
            "caption": "Figure 10.4.13: Step 2 - Assess rivalry."
          }
        },
        {
          "step": 3,
          "process": "Classify Good",
          "description": "Place good in 2x2 matrix.",
          "mechanism": "Excludable + rival = private. Excludable + non-rival = club. Non-excludable + rival = common. Non-excludable + non-rival = public.",
          "result": "Good type.",
          
          "image": {
            "src": "images/unit10/public_step3.png",
            "alt": "2x2 matrix",
            "caption": "Figure 10.4.14: Step 3 - Classify good."
          }
        },
        {
          "step": 4,
          "process": "Identify Market Implications",
          "description": "Determine likely market outcome based on type.",
          "mechanism": "Private: markets work well. Public: market failure, free riders. Common: overuse (tragedy of commons). Club: possible private provision with pricing.",
          "result": "Market assessment.",
          
          "image": {
            "src": "images/unit10/public_step4.png",
            "alt": "Market outcomes for each type",
            "caption": "Figure 10.4.15: Step 4 - Identify market implications."
          }
        },
        {
          "step": 5,
          "process": "Consider Policy Responses",
          "description": "If market failure, consider appropriate government intervention.",
          "mechanism": "Public goods: government provision, taxation. Common resources: regulation, property rights, taxes. Club goods: may need pricing or regulation.",
          "result": "Policy implications.",
          
          "image": {
            "src": "images/unit10/public_step5.png",
            "alt": "Policy tools for each type",
            "caption": "Figure 10.4.16: Step 5 - Consider policy responses."
          }
        }
      ],

      "image": {
        "src": "images/unit10/public_goods_summary.png",
        "alt": "Comprehensive summary: characteristics, classification matrix, public goods analysis",
        "caption": "Figure 10.4.17: Public goods summary."
      }
    }
  ],

  "key_terms": [
    "Public goods",
    "Non-excludable",
    "Non-rival",
    "Free rider problem",
    "Private goods",
    "Common resources",
    "Club goods",
    "Tragedy of the commons",
    "Excludability",
    "Rivalry",
    "Pure public goods",
    "Collective action",
    "Social marginal benefit",
    "Vertical summation",
    "Government provision",
    "Taxation",
    "Congestion",
    "Marginal cost of additional user",
    "Efficient price",
    "Market failure"
  ],

  "summary": "Public goods are defined by two characteristics: non-excludability (impossible to prevent people from consuming) and non-rivalry (one person's consumption does not reduce availability for others). Pure public goods have both characteristics, leading to market failure. Because they are non-excludable, private firms cannot charge for them, leading to the free rider problem where individuals have no incentive to pay. Because they are non-rival, the efficient price is zero, making any positive price inefficient. Private markets will underprovide public goods, often providing none at all. Goods can be classified by these characteristics into four types: (1) Private goods (excludable and rival): markets work well. (2) Public goods (non-excludable and non-rival): market failure, require collective provision. (3) Common resources (rival but non-excludable): suffer from overuse (tragedy of the commons). (4) Club goods (excludable but non-rival): can be provided by markets but pricing is inefficient. The efficient quantity of a public good is where the sum of individuals' marginal benefits equals the marginal cost of provision—the demand curve is the vertical sum of individual demands. Understanding public goods is essential for analyzing government's role in providing national defense, basic research, infrastructure, and other collectively consumed goods."
}
