{
  "expanded_description": "Where does a perfectly competitive firm's supply curve come from? Unlike a monopolist who chooses both price and quantity, a competitive firm only decides how much to produce at the market price. The relationship between price and the firm's quantity supplied is derived directly from its marginal cost curve. But not the entire MC curve—only the portion above average variable cost. This relationship, aggregated across all firms in the market, gives us the market supply curve. Understanding how to derive and interpret the firm's short-run supply curve is essential for analyzing how individual firms respond to price changes and how market supply is determined.",
  
  "core_concept": {
    "principle": "A perfectly competitive firm's short-run supply curve is the portion of its marginal cost curve that lies above its average variable cost curve. (1) Rationale: The firm maximizes profit by producing where $P = MC$ (on the rising portion), but only if $P \\geq AVC$. For any price above minimum AVC, the firm finds the quantity where $P = MC$ and produces that amount. Thus, the $MC$ curve traces out the price-quantity relationship. (2) Below minimum AVC, the firm supplies zero—the supply curve is vertical at $Q=0$ along the price axis. (3) The market supply curve in the short run is the horizontal sum of all individual firms' supply curves. At each price, we add up the quantities supplied by all firms. (4) The firm's supply curve is upward-sloping because $MC$ is upward-sloping in the relevant range (due to diminishing returns). (5) Shifts in the firm's supply curve occur when something changes marginal cost—changes in input prices, technology, or taxes. (6) The supply curve embodies the profit-maximizing behavior of the firm: at each price, it shows the quantity that maximizes profit (or minimizes loss).",
    
    "explanation": "Think of a farmer's decision: at different wheat prices, they'll plant different amounts. At $\\$5$ per bushel, they might plant 100 acres; at $\\$6$, they might plant 120 acres. This relationship between price and quantity supplied is their supply curve. It's essentially their marginal cost curve because they'll keep planting until the cost of the last bushel equals the price. But if price falls below the cost of seed and fertilizer (variable costs), they won't plant at all—that's the shutdown point.",
    
    "image": {
      "src": "images/unit5/firm_supply.png",
      "alt": "MC curve with AVC, highlighting portion above AVC as supply curve",
      "caption": "Figure 5.4.1: The firm's short-run supply curve is the MC curve above AVC."
    }
  },

  "sections": [
    {
      "section_title": "5.4 Firm Short Run Supply Curve",
      "introduction": "Where does a perfectly competitive firm's supply curve come from? Unlike a monopolist who chooses both price and quantity, a competitive firm only decides how much to produce at the market price. The relationship between price and the firm's quantity supplied is derived directly from its marginal cost curve. But not the entire MC curve—only the portion above average variable cost. This relationship, aggregated across all firms in the market, gives us the market supply curve. Understanding how to derive and interpret the firm's short-run supply curve is essential for analyzing how individual firms respond to price changes and how market supply is determined.",
      
      "introduction_image": {
        "src": "images/unit5/supply_curve_intro.png",
        "alt": "Graph showing MC curve with supply portion highlighted",
        "caption": "Figure 5.4.2: The firm's supply curve is derived from its marginal cost curve."
      },
      
      "key_concept": {
        "definition": "A perfectly competitive firm's short-run supply curve shows the quantity of output the firm will supply at each possible market price, assuming it maximizes profit (or minimizes loss). (1) Derivation: For any price $P$ above minimum average variable cost, the firm maximizes profit by producing where $P = MC$. Since $MC$ is a function of quantity, this relationship defines a unique quantity for each price. Thus, the $MC$ curve (above $AVC$) becomes the supply curve. (2) Mathematical form: If $MC = f(Q)$, the supply curve is the inverse function $Q = f^{-1}(P)$ for $P \\geq min AVC$. (3) Below minimum $AVC$, the firm supplies zero. So the supply curve has two parts: a vertical segment at $Q=0$ for $P < min AVC$, and the upward-sloping $MC$ curve for $P \\geq min AVC$. (4) Properties: The supply curve is upward-sloping because $MC$ rises with output due to diminishing returns. It starts at the shutdown point (minimum $AVC$). (5) Market supply: The short-run market supply curve is the horizontal sum of all individual firms' supply curves. At each price, we add up the quantities supplied by each firm. (6) Shifts: The firm's supply curve shifts when anything changes marginal cost: changes in input prices, technology, taxes, or anything that affects production costs.",
        
        "context": "The concept of the firm's supply curve is fundamental to understanding market outcomes. It connects the firm's cost structure to its production decisions and, through aggregation, to market supply. In AP Microeconomics, you'll be expected to derive supply curves from cost data, explain why the supply curve is the MC curve above AVC, and use this to analyze how firms respond to price changes. Understanding the firm's supply curve also helps explain why supply curves slope upward at the market level.",
        
        "image": {
          "src": "images/unit5/supply_derivation.png",
          "alt": "Step-by-step derivation of supply curve from MC and AVC",
          "caption": "Figure 5.4.3: The supply curve is derived from MC above AVC."
        }
      },

      "classifications": [
        {
          "type": "Supply Curve Derivation",
          "value": "MC above AVC becomes supply curve",
          "characteristics": ["$P = MC$ relationship", "Only rising portion of MC", "Above shutdown point", "Upward-sloping", "Reflects profit maximization"],
          "behavior": "The firm's supply curve is derived from its profit-maximizing behavior. At any price above minimum AVC, the firm solves $P = MC$ for quantity. Since MC is increasing (due to diminishing returns), higher prices lead to higher quantities supplied. This creates an upward-sloping relationship. The supply curve is essentially the firm's MC curve, but only the portion that is economically relevant. Below the shutdown point, the firm supplies nothing, so the supply curve is vertical along the price axis. The supply curve embodies all the information about the firm's cost structure—its slope reflects how quickly marginal costs rise, and its position reflects the firm's efficiency. A firm with lower costs will have a supply curve shifted to the right (more supplied at each price).",
          
          "image": {
            "src": "images/unit5/supply_derivation_detail.png",
            "alt": "MC curve with arrows showing mapping from price to quantity",
            "caption": "Figure 5.4.4: For each price, the firm supplies where P = MC."
          },
          
          "examples": [
            {
              "process": "Farmer's supply response",
              "explanation": "A farmer has $MC = 2Q$. At $P=10$, they supply $Q=5$. At $P=20$, they supply $Q=10$. This price-quantity relationship is their supply curve."
            }
          ]
        },
        {
          "type": "Shutdown Point",
          "value": "Minimum point of AVC",
          "characteristics": ["Where $P = MC = AVC$", "Lowest price for positive supply", "Supply curve starts here", "Below this, supply = 0", "Firm indifferent at this point"],
          "behavior": "The shutdown point is the minimum point of the average variable cost curve, where $MC = AVC$. At this price, the firm is indifferent between producing and shutting down—loss equals fixed costs either way. Below this price, the firm supplies zero. Above this price, the firm supplies along its MC curve. The shutdown point is therefore the starting point of the firm's supply curve. Graphically, the supply curve begins at the shutdown point and follows the MC curve upward. Understanding the shutdown point is crucial because it defines the range of prices over which the firm operates and explains why supply curves don't extend indefinitely downward.",
          
          "image": {
            "src": "images/unit5/shutdown_supply.png",
            "alt": "MC and AVC curves with shutdown point marked, supply starting there",
            "caption": "Figure 5.4.5: The supply curve starts at the shutdown point."
          },
          
          "examples": [
            {
              "process": "Shutdown price",
              "explanation": "A firm's minimum AVC is $\\$8$ at Q=50. For any price below $\\$8$, supply = 0. At $P=8$, firm may produce 50 or shut down. At $P=9$, firm produces where $MC=9$ (say Q=55)."
            }
          ]
        },
        {
          "type": "Market Supply Curve",
          "value": "Horizontal sum of individual firm supply",
          "characteristics": ["Add quantities at each price", "More firms → flatter supply", "Reflects industry cost structure", "Upward-sloping in short run", "Shifts with entry/exit"],
          "behavior": "The short-run market supply curve is obtained by horizontally summing all individual firms' supply curves. At each price, we add up the quantities that each firm is willing to supply. If all firms have identical cost structures, the market supply curve has the same shape as the individual curves but scaled horizontally by the number of firms. The market supply curve slopes upward because each firm's supply curve slopes upward and because entry/exit is not possible in the short run. The market supply curve is essential for determining market equilibrium price and quantity. It shifts when the number of firms changes, when firms' costs change (due to input prices or technology), or when firms' expectations change.",
          
          "image": {
            "src": "images/unit5/market_supply.png",
            "alt": "Individual firm supply curves adding horizontally to market supply",
            "caption": "Figure 5.4.6: Market supply is the horizontal sum of individual firm supply curves."
          },
          
          "examples": [
            {
              "process": "Wheat market",
              "explanation": "If 1,000 identical wheat farmers each supply 100 bushels at $P=5$, market supply is 100,000 bushels at that price."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Firm's Supply Curve Is Its Marginal Cost Curve Above Average Variable Cost",
          "statement": "This is one of the most important relationships in microeconomics: a perfectly competitive firm's short-run supply curve is exactly the portion of its marginal cost curve that lies above its average variable cost curve. Why? Because for any price above minimum AVC, the profit-maximizing quantity is found where $P = MC$. As price changes, we trace out different points on the MC curve, each giving the quantity supplied at that price. This creates a direct mapping from price to quantity—the definition of a supply curve. Below minimum AVC, the firm supplies zero, so the supply curve is vertical at $Q=0$ along the price axis. This relationship explains why supply curves slope upward (MC slopes upward) and why firms don't supply at very low prices (below AVC).",
          "application": "Given a firm's cost curves, its supply curve can be drawn by highlighting the MC curve from the shutdown point upward. To find quantity supplied at any price above shutdown, find where that price hits the MC curve and read down to the quantity axis.",
          "example": "A firm's MC curve is $MC = 10 + 2Q$ and minimum AVC is $15$ at $Q=2.5$. The supply curve is $Q = (P-10)/2$ for $P \\geq 15$, and $Q=0$ for $P < 15$.",
          
          "image": {
            "src": "images/unit5/mc_as_supply.png",
            "alt": "MC curve with AVC, highlighting supply portion",
            "caption": "Figure 5.4.7: The supply curve is the MC curve above AVC."
          }
        },
        {
          "principle": "The Market Supply Curve Is the Horizontal Sum of Individual Supply Curves",
          "statement": "The short-run market supply curve shows the total quantity all firms in the industry are willing to supply at each price. It is obtained by adding horizontally the supply curves of all individual firms. At a given price, we sum the quantities each firm supplies. If there are $n$ identical firms, the market supply curve is $n$ times the individual firm supply curve at each price. If firms have different cost structures, the market supply curve is constructed by ordering firms from lowest to highest costs—it becomes a step function that approximates a smooth curve as the number of firms increases. The market supply curve slopes upward because individual supply curves slope upward and because firms with different costs enter at different prices.",
          "application": "To construct market supply, identify all firms' supply curves. At each price, add up the quantities. For identical firms, simply multiply individual supply by the number of firms. For different firms, add contributions from each.",
          "example": "With 100 identical firms each supplying $Q = 10 + 0.5P$, market supply is $Q_m = 1000 + 50P$.",
          
          "image": {
            "src": "images/unit5/horizontal_sum.png",
            "alt": "Adding two supply curves horizontally",
            "caption": "Figure 5.4.8: Market supply is the horizontal sum of individual supplies."
          }
        },
        {
          "principle": "The Supply Curve Shifts When Marginal Cost Changes",
          "statement": "Anything that changes the firm's marginal cost curve will shift its supply curve. Factors that shift supply include: (1) Changes in input prices: Higher input prices increase MC, shifting supply left (less supplied at each price). (2) Technological change: Improvements that lower MC shift supply right. (3) Taxes: Per-unit taxes increase MC, shifting supply left. (4) Changes in the prices of other products the firm could produce (if multi-product). At the market level, supply also shifts with changes in the number of firms. Understanding these shifts is essential for analyzing how markets respond to external changes. When the firm's supply curve shifts, the market supply curve also shifts, leading to changes in equilibrium price and quantity.",
          "application": "To analyze a market change, first determine whether it affects firms' costs. If so, individual supply curves shift, which aggregates to a market supply shift. Trace through to new equilibrium.",
          "example": "An increase in electricity prices raises MC for all manufacturers. Each firm's supply curve shifts left, so market supply shifts left, increasing price and decreasing quantity.",
          
          "image": {
            "src": "images/unit5/supply_shifts.png",
            "alt": "Supply curve shifting right and left",
            "caption": "Figure 5.4.9: Supply shifts when marginal cost changes."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Deriving the Firm's Supply Curve from Cost Data",
          
          "image": {
            "src": "images/unit5/supply_example1.png",
            "alt": "Table with MC and AVC data",
            "caption": "Figure 5.4.10: Derive supply schedule from cost data."
          },
          
          "problem": "A perfectly competitive firm has the following cost data:<br>Q: 0, 10, 20, 30, 40, 50, 60<br>MC: -, 5, 4, 6, 8, 11, 15<br>AVC: -, 6, 5, 5.5, 6.5, 8, 10<br>a) Identify the shutdown point (minimum AVC).<br>b) For prices $P = 4, 6, 8, 10, 12$, determine the quantity supplied.<br>c) Write the supply schedule (price and quantity supplied).<br>d) Graph the firm's supply curve.",
          
          "step_by_step": [
            {
              "step": "Find shutdown point",
              "explanation": "Minimum AVC is $5$ at Q=20. So shutdown price = $5$. Below this, firm supplies zero."
            },
            {
              "step": "Price = $4$",
              "explanation": "$P = 4$ is below shutdown price ($5$). Firm supplies $Q = 0$."
            },
            {
              "step": "Price = $6$",
              "explanation": "Find where $P = MC$ (on rising portion). MC values: 5,4,6,8,11,15. MC is falling then rising. At $P=6$, MC = 6 at Q=30. Check that MC is rising at Q=30: previous MC=4, next MC=8, so yes rising. Supply = 30."
            },
            {
              "step": "Price = $8$",
              "explanation": "Find where $P = MC = 8$. MC=8 at Q=40. Check rising: previous MC=6, next MC=11. Supply = 40."
            },
            {
              "step": "Price = $10$",
              "explanation": "MC=10? Not in table. Between MC=8 at Q=40 and MC=11 at Q=50. Interpolate: at $P=10$, approximate Q ≈ 40 + (10-8)/(11-8) × 10 = 40 + (2/3)×10 ≈ 46.7."
            },
            {
              "step": "Price = $12$",
              "explanation": "MC=12? Between 11 at Q=50 and 15 at Q=60. Interpolate: Q ≈ 50 + (12-11)/(15-11) × 10 = 50 + (1/4)×10 = 52.5."
            }
          ],
          
          "final_answer": "a) Shutdown at P=$5$, Q=20. b) P=4:0, P=6:30, P=8:40, P=10:≈46.7, P=12:≈52.5. c) Supply schedule: (4,0), (6,30), (8,40), (10,46.7), (12,52.5). d) Graph: vertical at Q=0 up to P=5, then upward-sloping from (20,5) through points.",
          "concept_applied": "Supply curve derived from MC above minimum AVC. Below shutdown, supply = 0."
        },
        {
          "title": "Deriving Supply from Cost Functions",
          
          "image": {
            "src": "images/unit5/supply_example2.png",
            "alt": "Cost functions",
            "caption": "Figure 5.4.11: Derive supply function from equations."
          },
          
          "problem": "A firm has $MC = 20 + 4Q$ and $AVC = 20 + 2Q$.<br>a) Find the shutdown price and quantity.<br>b) Derive the firm's supply function $Q_s = f(P)$.<br>c) What quantity is supplied at $P = 40$? At $P = 60$?<br>d) If there are 100 identical firms, what is market supply at each price?",
          
          "step_by_step": [
            {
              "step": "Find shutdown point",
              "explanation": "Shutdown where $P = MC = AVC$. Set $20 + 4Q = 20 + 2Q$ → $4Q = 2Q$ → $2Q = 0$ → $Q = 0$. Then $P = 20 + 4(0) = 20$. Shutdown price = $20$, shutdown quantity = $0$ (firm shuts down at any price below 20). Actually, this suggests the firm always has $MC > AVC$ for Q>0, so minimum AVC is at Q→0, P→20. So shutdown price = $20$."
            },
            {
              "step": "Derive supply function",
              "explanation": "For $P \\geq 20$, set $P = MC = 20 + 4Q$ → $4Q = P - 20$ → $Q = (P - 20)/4$. This is the supply function for $P \\geq 20$. For $P < 20$, $Q = 0$."
            },
            {
              "step": "Quantity at $P = 40$",
              "explanation": "$Q = (40 - 20)/4 = 20/4 = 5$ units."
            },
            {
              "step": "Quantity at $P = 60$",
              "explanation": "$Q = (60 - 20)/4 = 40/4 = 10$ units."
            },
            {
              "step": "Market supply with 100 firms",
              "explanation": "Market supply $Q_m = 100 \\times Q = 100 \\times (P - 20)/4 = 25(P - 20)$ for $P \\geq 20$, and $0$ for $P < 20$."
            }
          ],
          
          "final_answer": "a) Shutdown at $P=20$, $Q=0$. b) $Q = (P-20)/4$ for $P \\geq 20$, else 0. c) At P=40, Q=5; at P=60, Q=10. d) Market supply $Q_m = 25(P-20)$ for $P \\geq 20$.",
          "concept_applied": "Supply function derived from $P = MC$. Market supply is horizontal sum."
        },
        {
          "title": "Analyzing a Supply Shift",
          
          "image": {
            "src": "images/unit5/supply_example3.png",
            "alt": "Supply shift scenario",
            "caption": "Figure 5.4.12: Analyze effect of input price increase on supply."
          },
          
          "problem": "A firm's original marginal cost is $MC_1 = 10 + 2Q$. A new environmental regulation requires the firm to install pollution control equipment, increasing marginal cost to $MC_2 = 15 + 2Q$.<br>a) Derive the original supply function.<br>b) Derive the new supply function.<br>c) How much does quantity supplied change at $P = 30$?<br>d) If there are 50 firms in the industry, how does market supply shift?",
          
          "step_by_step": [
            {
              "step": "Original supply",
              "explanation": "Set $P = 10 + 2Q$ → $2Q = P - 10$ → $Q = (P - 10)/2$ for $P \\geq$ minimum price. Need shutdown price: find minimum AVC. With linear MC, AVC is also linear. $AVC = 10 + Q$ (since $VC = 10Q + Q^2$, $AVC = 10 + Q$). Minimum AVC at Q→0 is $10$. So supply: $Q = (P-10)/2$ for $P \\geq 10$, else 0."
            },
            {
              "step": "New supply",
              "explanation": "Set $P = 15 + 2Q$ → $2Q = P - 15$ → $Q = (P - 15)/2$. New minimum price = $15$. Supply: $Q = (P-15)/2$ for $P \\geq 15$, else 0."
            },
            {
              "step": "Change at $P = 30$",
              "explanation": "Original: $Q = (30-10)/2 = 20/2 = 10$. New: $Q = (30-15)/2 = 15/2 = 7.5$. Quantity supplied decreases by 2.5 units."
            },
            {
              "step": "Market supply shift",
              "explanation": "Original market supply: $Q_m = 50 \\times (P-10)/2 = 25(P-10)$ for $P \\geq 10$. New market supply: $Q_m = 50 \\times (P-15)/2 = 25(P-15)$ for $P \\geq 15$. Market supply shifts left—at any price above 15, quantity supplied is reduced by $25 \\times 5 = 125$ units."
            }
          ],
          
          "final_answer": "a) $Q = (P-10)/2$ for $P \\geq 10$. b) $Q = (P-15)/2$ for $P \\geq 15$. c) Decrease of 2.5 units. d) Market supply shifts left by 125 units at each price.",
          "concept_applied": "Changes in marginal cost shift the firm's supply curve, which aggregates to market supply shifts."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify MC and AVC Curves",
          "description": "Obtain the firm's marginal cost and average variable cost curves.",
          "mechanism": "From cost data or functions, determine $MC$ and $AVC$ for each output level.",
          "result": "Cost curves.",
          
          "image": {
            "src": "images/unit5/supply_step1.png",
            "alt": "MC and AVC curves",
            "caption": "Figure 5.4.13: Step 1 - Identify MC and AVC."
          }
        },
        {
          "step": 2,
          "process": "Find Shutdown Point",
          "description": "Locate the minimum point of the AVC curve.",
          "mechanism": "Find where $MC = AVC$ and AVC is at its minimum. This gives shutdown price and quantity.",
          "result": "Shutdown point $(P_{min}, Q_{min})$.",
          
          "image": {
            "src": "images/unit5/supply_step2.png",
            "alt": "Minimum AVC marked as shutdown point",
            "caption": "Figure 5.4.14: Step 2 - Find shutdown point."
          }
        },
        {
          "step": 3,
          "process": "Identify Supply Portion of MC",
          "description": "The supply curve is the MC curve above the shutdown point.",
          "mechanism": "For all prices above minimum AVC, the firm produces where $P = MC$ on the rising portion.",
          "result": "Individual firm supply curve.",
          
          "image": {
            "src": "images/unit5/supply_step3.png",
            "alt": "MC curve above AVC highlighted as supply",
            "caption": "Figure 5.4.15: Step 3 - Supply is MC above AVC."
          }
        },
        {
          "step": 4,
          "process": "Write Supply Function",
          "description": "Express quantity supplied as a function of price.",
          "mechanism": "Solve $P = MC(Q)$ for $Q$ in terms of $P$ for $P \\geq$ shutdown price. For lower prices, $Q = 0$.",
          "result": "Supply function $Q_s = f(P)$.",
          
          "image": {
            "src": "images/unit5/supply_step4.png",
            "alt": "Supply function equation",
            "caption": "Figure 5.4.16: Step 4 - Write supply function."
          }
        },
        {
          "step": 5,
          "process": "Aggregate to Market Supply",
          "description": "Sum individual supply curves horizontally to get market supply.",
          "mechanism": "At each price, add quantities from all firms. For identical firms, multiply individual supply by number of firms.",
          "result": "Market supply curve.",
          
          "image": {
            "src": "images/unit5/supply_step5.png",
            "alt": "Horizontal summation to market supply",
            "caption": "Figure 5.4.17: Step 5 - Aggregate to market supply."
          }
        }
      ],

      "image": {
        "src": "images/unit5/supply_summary.png",
        "alt": "Comprehensive summary: firm supply derivation, shutdown point, market supply aggregation",
        "caption": "Figure 5.4.18: Firm short-run supply curve summary."
      }
    }
  ],

  "key_terms": [
    "Short-run supply curve",
    "Marginal cost curve",
    "Average variable cost",
    "Shutdown point",
    "Supply function",
    "Price taker",
    "Profit maximization",
    "Horizontal summation",
    "Market supply",
    "Individual firm supply",
    "Supply elasticity",
    "Supply shifters",
    "Input prices",
    "Technology",
    "Per-unit tax",
    "Rising portion of MC",
    "Zero supply",
    "Aggregation",
    "Industry supply",
    "Producer behavior"
  ],

  "summary": "A perfectly competitive firm's short-run supply curve is the portion of its marginal cost curve that lies above its average variable cost curve. For any price above the shutdown point (minimum AVC), the firm maximizes profit by producing where $P = MC$, creating a direct mapping from price to quantity supplied. Below the shutdown point, the firm supplies zero. The supply curve is upward-sloping because MC rises with output due to diminishing returns. The shutdown point is where $P = MC = AVC$ at the minimum of AVC. The market supply curve in the short run is obtained by horizontally summing all individual firms' supply curves—at each price, adding up the quantities each firm supplies. The firm's supply curve shifts when anything changes its marginal cost: input prices, technology, taxes, or other cost factors. These shifts aggregate to changes in market supply, affecting equilibrium price and quantity. Understanding the derivation of the firm's supply curve is essential for analyzing how individual firms respond to price changes and how market supply is determined."
}
