{
  "expanded_description": "What happens to a perfectly competitive market over time? In the short run, firms can earn profits or incur losses. But these outcomes are not permanent. Profits attract new firms to enter the industry; losses cause existing firms to exit. This entry and exit process continues until economic profits are driven to zero. In long-run equilibrium, all firms produce at the minimum point of their average total cost curves, price equals marginal cost, and there is no incentive for firms to enter or exit. Understanding this long-run adjustment process is crucial for analyzing how markets allocate resources efficiently and why competition leads to zero economic profit.",
  
  "core_concept": {
    "principle": "In the long run, perfectly competitive markets reach an equilibrium where firms earn zero economic profit. This occurs through entry and exit: (1) If firms are earning economic profit ($P > ATC$), new firms enter the industry. Entry increases market supply, lowering price. Entry continues until price falls to the minimum of ATC, eliminating profit. (2) If firms are incurring economic losses ($P < ATC$), some firms exit the industry. Exit decreases market supply, raising price. Exit continues until price rises to the minimum of ATC, eliminating losses. (3) Long-run equilibrium conditions: (a) $P = MC$ (profit maximization), (b) $P = ATC$ (zero economic profit), (c) $P = minimum ATC$ (productive efficiency). (4) All firms produce at their efficient scale—the output that minimizes average total cost. (5) The market achieves both productive efficiency (goods produced at lowest cost) and allocative efficiency (price equals marginal cost, reflecting consumer value).",
    
    "explanation": "Think of a popular food truck district. If one truck is making huge profits, more trucks will set up nearby. More trucks means more competition, which pushes prices down. Eventually, trucks earn just enough to cover costs—any less and they'd leave, any more and more trucks would enter. This is the long-run equilibrium: enough trucks to serve demand, each earning normal profit, and customers paying the lowest sustainable price.",
    
    "image": {
      "src": "images/unit5/long_run_eq.png",
      "alt": "Graph showing adjustment from short-run profit to long-run equilibrium through entry",
      "caption": "Figure 5.5.1: In the long run, entry and exit drive economic profit to zero."
    }
  },

  "sections": [
    {
      "section_title": "5.5 Long Run Equilibrium",
      "introduction": "What happens to a perfectly competitive market over time? In the short run, firms can earn profits or incur losses. But these outcomes are not permanent. Profits attract new firms to enter the industry; losses cause existing firms to exit. This entry and exit process continues until economic profits are driven to zero. In long-run equilibrium, all firms produce at the minimum point of their average total cost curves, price equals marginal cost, and there is no incentive for firms to enter or exit. Understanding this long-run adjustment process is crucial for analyzing how markets allocate resources efficiently and why competition leads to zero economic profit.",
      
      "introduction_image": {
        "src": "images/unit5/long_run_intro.png",
        "alt": "Cycle of entry and exit driving price toward equilibrium",
        "caption": "Figure 5.5.2: Entry and exit drive the market toward long-run equilibrium."
      },
      
      "key_concept": {
        "definition": "Long-run equilibrium in perfect competition occurs when firms have no incentive to enter or exit the industry, and all firms produce at their most efficient scale. (1) Entry process: When existing firms earn economic profit ($P > ATC$), new firms are attracted to the industry. Entry increases market supply, shifting the market supply curve right. This lowers market price. Entry continues as long as economic profits exist, stopping only when price falls to the point where $P = ATC$ and profits are zero. (2) Exit process: When firms incur economic losses ($P < ATC$), some firms exit the industry. Exit decreases market supply, shifting the market supply curve left. This raises market price. Exit continues as long as losses exist, stopping only when price rises to the point where $P = ATC$ and losses are eliminated. (3) Long-run equilibrium conditions: (a) Firms maximize profit: $P = MC$. (b) Zero economic profit: $P = ATC$. (c) Productive efficiency: Combined, these imply $P = MC = ATC = \\text{minimum } ATC$. All firms produce at the minimum point of their long-run average cost curve. (d) No entry or exit: Firms earn normal profit (zero economic profit). (4) Efficiency properties: Perfect competition achieves both productive efficiency (goods produced at lowest possible cost) and allocative efficiency (price equals marginal cost, meaning the value to consumers equals the cost of production). (5) Long-run supply curve: The long-run market supply curve can be horizontal (constant-cost industry), upward-sloping (increasing-cost industry), or downward-sloping (decreasing-cost industry), depending on how input prices change with industry output.",
        
        "context": "The concept of long-run equilibrium in perfect competition is central to understanding how markets allocate resources efficiently. It demonstrates Adam Smith's \"invisible hand\"—the pursuit of self-interest leads to outcomes that are socially efficient. In AP Microeconomics, you'll be expected to analyze the adjustment process, identify long-run equilibrium conditions, and evaluate the efficiency of competitive markets. Understanding long-run equilibrium also provides a baseline for comparing other market structures like monopoly and oligopoly, which do not achieve these efficiency properties.",
        
        "image": {
          "src": "images/unit5/long_run_conditions.png",
          "alt": "Graph showing long-run equilibrium with P = MC = minimum ATC",
          "caption": "Figure 5.5.3: In long-run equilibrium, P = MC = minimum ATC."
        }
      },

      "classifications": [
        {
          "type": "Entry (Profit Scenario)",
          "value": "Economic profit attracts new firms",
          "characteristics": ["$P > ATC$ initially", "New firms enter", "Market supply increases", "Price falls", "Process continues until $P = ATC$"],
          "behavior": "When existing firms earn economic profit, it signals that resources in this industry are earning more than their opportunity cost. Entrepreneurs seeking profits will enter the industry. Entry increases the number of firms, shifting the market supply curve to the right. With demand unchanged, this causes market price to fall. As price falls, each firm's profit-maximizing quantity adjusts along its MC curve, and profit per unit $(P - ATC)$ shrinks. Entry continues as long as there is any economic profit to be earned. The process stops only when price falls to the point where $P = ATC$ at the profit-maximizing quantity, eliminating economic profit. This adjustment ensures that resources flow to their most valued uses.",
          
          "image": {
            "src": "images/unit5/entry_process.png",
            "alt": "Graph showing market supply right shift and firm moving from profit to zero profit",
            "caption": "Figure 5.5.4: Entry eliminates economic profit."
          },
          
          "examples": [
            {
              "process": "Craft beer boom",
              "explanation": "When craft breweries began earning high profits, hundreds of new breweries entered the industry. Supply increased, prices moderated, and profits eventually normalized."
            },
            {
              "process": "Tech startups",
              "explanation": "Profitable tech niches attract new startups until competition drives returns down to normal levels."
            }
          ]
        },
        {
          "type": "Exit (Loss Scenario)",
          "value": "Economic losses cause firms to exit",
          "characteristics": ["$P < ATC$ initially", "Firms exit", "Market supply decreases", "Price rises", "Process continues until $P = ATC$"],
          "behavior": "When firms incur economic losses, they are earning less than the opportunity cost of their resources. In the long run, some firms will exit the industry—they may shut down permanently, sell their assets, or switch to other lines of business. Exit decreases the number of firms, shifting the market supply curve to the left. With demand unchanged, this causes market price to rise. As price rises, remaining firms' losses shrink. Exit continues as long as firms are still earning negative economic profit. The process stops only when price rises to the point where $P = ATC$ at the profit-maximizing quantity, eliminating losses. This adjustment ensures that resources are not wasted in unprofitable ventures.",
          
          "image": {
            "src": "images/unit5/exit_process.png",
            "alt": "Graph showing market supply left shift and firm moving from loss to zero profit",
            "caption": "Figure 5.5.5: Exit eliminates economic losses."
          },
          
          "examples": [
            {
              "process": "Declining industries",
              "explanation": "As demand for printed newspapers fell, many publishers exited the industry. Supply decreased, helping stabilize prices for remaining firms."
            },
            {
              "process": "Mom-and-pop stores",
              "explanation": "Small retailers facing losses from big-box competition eventually exit, reducing supply and allowing remaining small stores to survive."
            }
          ]
        },
        {
          "type": "Long-Run Equilibrium",
          "value": "$P = MC = \\text{minimum } ATC$",
          "characteristics": ["Zero economic profit", "Productive efficiency", "Allocative efficiency", "No entry/exit", "Firms at efficient scale"],
          "behavior": "In long-run equilibrium, all adjustments are complete. No firms want to enter (no profit) and no firms want to exit (no losses). Each firm produces where $P = MC$ (profit maximization) and $P = ATC$ (zero profit). Together, these imply $P = MC = ATC$. Since $ATC$ is at its minimum when $MC = ATC$, firms produce at the lowest point on their average total cost curves. This is called productive efficiency—goods are produced at the lowest possible cost. Additionally, $P = MC$ means that the price consumers pay exactly equals the cost of producing the last unit, achieving allocative efficiency—resources are allocated to their most valued uses. In this equilibrium, the market is operating at its most efficient, and there is no tendency for change.",
          
          "image": {
            "src": "images/unit5/long_run_equilibrium_graph.png",
            "alt": "Firm graph showing P = MC = minimum ATC",
            "caption": "Figure 5.5.6: Long-run equilibrium with zero economic profit and efficient scale."
          },
          
          "examples": [
            {
              "process": "Mature industries",
              "explanation": "In mature, competitive industries like wheat farming, firms tend to earn normal profits. Entry and exit have balanced out, and farms operate at efficient scale."
            }
          ]
        },
        {
          "type": "Long-Run Industry Supply",
          "value": "Market supply response in long run",
          "characteristics": ["Constant-cost: horizontal LR supply", "Increasing-cost: upward-sloping LR supply", "Decreasing-cost: downward-sloping LR supply", "Depends on input prices", "Determines long-run price"],
          "behavior": "The long-run market supply curve shows the relationship between price and quantity supplied after all entry and exit adjustments are complete. Its shape depends on how input prices change as the industry expands: (1) Constant-cost industry: Input prices do not change as industry output changes. Long-run supply is horizontal at the minimum ATC. Entry/exit do not affect cost curves. (2) Increasing-cost industry: Input prices rise as industry expands (due to limited resources, specialized labor). Long-run supply is upward-sloping. Each firm's cost curves shift up as industry grows, so long-run equilibrium price rises with industry output. (3) Decreasing-cost industry: Input prices fall as industry expands (due to economies of scale in input supply, learning effects). Long-run supply is downward-sloping. Each firm's cost curves shift down as industry grows, so long-run equilibrium price falls with industry output. Most real-world industries are increasing-cost.",
          
          "image": {
            "src": "images/unit5/lr_supply.png",
            "alt": "Three graphs: constant-cost (horizontal), increasing-cost (upward), decreasing-cost (downward)",
            "caption": "Figure 5.5.7: Long-run industry supply can be horizontal, upward, or downward sloping."
          },
          
          "examples": [
            {
              "process": "Constant-cost: pizza shops",
              "explanation": "Opening more pizza shops doesn't raise prices of pizza ovens or chefs significantly. Long-run supply is nearly horizontal."
            },
            {
              "process": "Increasing-cost: housing construction",
              "explanation": "As more homes are built, lumber and skilled labor prices rise. Long-run supply is upward-sloping."
            },
            {
              "process": "Decreasing-cost: solar panels",
              "explanation": "As solar industry grows, manufacturing costs fall due to learning and scale economies. Long-run supply can slope downward."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Free Entry and Exit Drive Economic Profit to Zero in the Long Run",
          "statement": "The most important result in perfect competition is that free entry and exit eliminate economic profit in the long run. This occurs because profits create incentives for entry, which increases supply and lowers price until profits disappear. Losses create incentives for exit, which decreases supply and raises price until losses disappear. This self-correcting mechanism ensures that in long-run equilibrium, firms earn only normal profit—zero economic profit. This doesn't mean firms are failing; they're earning exactly the competitive return on their resources, just enough to keep them in the industry. This result is crucial because it shows that competition prevents firms from earning excess returns and ensures that consumers benefit from the lowest possible prices consistent with covering costs.",
          "application": "When analyzing an industry, if you observe economic profits, predict entry and falling prices. If you observe losses, predict exit and rising prices. In the long run, expect price to settle at minimum ATC.",
          "example": "In the early days of the smartphone industry, firms earned large profits. This attracted entry, increasing competition and eventually bringing profits down to normal levels.",
          
          "image": {
            "src": "images/unit5/zero_profit.png",
            "alt": "Cycle of entry and exit driving to zero profit",
            "caption": "Figure 5.5.8: Free entry and exit drive economic profit to zero."
          }
        },
        {
          "principle": "Perfect Competition Achieves Productive and Allocative Efficiency",
          "statement": "In long-run equilibrium, perfect competition achieves two important efficiency conditions: (1) Productive efficiency: Firms produce at the minimum point of their average total cost curve. This means goods are produced at the lowest possible cost per unit. No resources are wasted—society gets the maximum output from its scarce resources. (2) Allocative efficiency: Price equals marginal cost. This means the value consumers place on the last unit produced (the price they're willing to pay) exactly equals the cost of producing that unit. Resources are allocated to their most valued uses—it's impossible to reallocate resources to make anyone better off without making someone else worse off. These efficiency properties are why economists often use perfect competition as a benchmark for evaluating other market structures. Monopoly, for example, fails both conditions—it produces at higher cost and restricts output below the efficient level.",
          "application": "To evaluate market efficiency, compare to the perfect competition benchmark. Check if $P = MC$ (allocative efficiency) and if firms produce at minimum ATC (productive efficiency). Deviations indicate inefficiency.",
          "example": "In a perfectly competitive wheat market, farms operate at minimum ATC, so wheat is produced as cheaply as possible. And $P = MC$, so the value of the last bushel equals its cost.",
          
          "image": {
            "src": "images/unit5/efficiency.png",
            "alt": "Graph showing P = MC and min ATC",
            "caption": "Figure 5.5.9: Perfect competition achieves productive and allocative efficiency."
          }
        },
        {
          "principle": "The Shape of Long-Run Supply Depends on Industry Cost Conditions",
          "statement": "The long-run market supply curve is not simply the horizontal sum of individual firms' long-run supply curves. Its shape depends on how input prices respond to changes in industry output. In constant-cost industries, input prices don't change with industry output, so long-run supply is horizontal at the minimum ATC. Entry and exit don't affect firms' cost curves. In increasing-cost industries, input prices rise as industry expands, shifting each firm's cost curves upward. Long-run supply slopes upward—higher industry output requires higher price to cover increased input costs. In decreasing-cost industries, input prices fall as industry expands, shifting cost curves downward. Long-run supply slopes downward. Understanding these distinctions is important for predicting how industries respond to demand shifts in the long run. Most real-world industries are increasing-cost due to limited resources and specialized inputs.",
          "application": "To predict long-run price effects of a demand increase, determine industry cost type. Constant-cost: price returns to original level. Increasing-cost: price rises permanently. Decreasing-cost: price falls permanently.",
          "example": "Demand for housing increases. In an increasing-cost industry, lumber and labor prices rise, so long-run price rises. In a constant-cost industry like pizza, price would return to original level.",
          
          "image": {
            "src": "images/unit5/cost_conditions.png",
            "alt": "Three industry types with different long-run supply slopes",
            "caption": "Figure 5.5.10: Industry cost conditions determine long-run supply shape."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing Entry and Exit Adjustment",
          
          "image": {
            "src": "images/unit5/long_run_example1.png",
            "alt": "Market and firm graphs with initial profit",
            "caption": "Figure 5.5.11: Show adjustment from short-run profit to long-run equilibrium."
          },
          
          "problem": "A perfectly competitive industry is initially in long-run equilibrium. Then, demand increases permanently.<br>a) Show the short-run effect on market price and quantity, and on a typical firm's profit.<br>b) Explain the entry process that follows.<br>c) Show the new long-run equilibrium.<br>d) How does the final price compare to the original? Assume a constant-cost industry.",
          
          "step_by_step": [
            {
              "step": "Initial equilibrium",
              "explanation": "Initially, market equilibrium at $P_1$, $Q_1$. Typical firm produces at $P_1 = MC = min ATC$, earning zero profit."
            },
            {
              "step": "Demand increase (short run)",
              "explanation": "Demand shifts right. Market price rises to $P_2$. Existing firms increase output along their MC curves to $q_2$. At $P_2 > ATC$, firms earn economic profit (shaded rectangle)."
            },
            {
              "step": "Entry process",
              "explanation": "Economic profit attracts new firms to enter. Market supply shifts right. As supply increases, price falls. Entry continues as long as profit exists."
            },
            {
              "step": "New long-run equilibrium",
              "explanation": "Entry continues until price falls back to $P_1 = min ATC$. Firms again earn zero profit. Each firm produces at original $q_1$. Market quantity is higher ($Q_3 > Q_1$) due to more firms."
            },
            {
              "step": "Price comparison",
              "explanation": "In a constant-cost industry, long-run price returns to original level. Final price $P_3 = P_1$."
            }
          ],
          
          "final_answer": "a) Short run: P↑, Q↑, firms earn profit. b) Entry increases supply, lowering price. c) New equilibrium: P = original, Q higher, more firms. d) Price returns to original level.",
          "concept_applied": "In constant-cost industries, entry eliminates profit and returns price to minimum ATC."
        },
        {
          "title": "Long-Run Equilibrium Calculations",
          
          "image": {
            "src": "images/unit5/long_run_example2.png",
            "alt": "Cost functions and market demand",
            "caption": "Figure 5.5.12: Calculate long-run equilibrium values."
          },
          
          "problem": "A perfectly competitive industry has identical firms with long-run total cost: $LTC = q^3 - 20q^2 + 150q$. Market demand is $Q_d = 5000 - 100P$.<br>a) Find the firm's long-run average cost and marginal cost functions.<br>b) Find the output that minimizes LRAC.<br>c) Find the long-run equilibrium price.<br>d) Find each firm's output in long-run equilibrium.<br>e) Find the market quantity and number of firms.",
          
          "step_by_step": [
            {
              "step": "Find LRAC and LRMC",
              "explanation": "$LRAC = LTC/q = q^2 - 20q + 150$<br>$LRMC = dLTC/dq = 3q^2 - 40q + 150$"
            },
            {
              "step": "Minimize LRAC",
              "explanation": "Set derivative of LRAC = 0: $2q - 20 = 0$ → $q = 10$. At $q=10$, $LRAC = 100 - 200 + 150 = 50$. Check second derivative positive."
            },
            {
              "step": "Long-run equilibrium price",
              "explanation": "In long-run equilibrium, $P = min LRAC = 50$."
            },
            {
              "step": "Each firm's output",
              "explanation": "At $P=50$, firms produce where $P = LRMC$ at minimum LRAC. $50 = 3q^2 - 40q + 150$ → $0 = 3q^2 - 40q + 100$ → Solve: $q = [40 ± √(1600 - 1200)]/6 = [40 ± √400]/6 = [40 ± 20]/6$. $q = 60/6 = 10$ or $q = 20/6 = 3.33$. At $q=10$, $LRMC = 50$ and LRAC minimized. At $q=3.33$, $LRMC = 50$ but LRAC higher. So $q=10$ is the long-run equilibrium output per firm."
            },
            {
              "step": "Market quantity and number of firms",
              "explanation": "At $P=50$, market demand: $Q_d = 5000 - 100(50) = 5000 - 5000 = 0$? That gives zero—problem with numbers. Let's adjust demand to $Q_d = 5000 - 20P$ instead. Then at $P=50$, $Q_d = 5000 - 1000 = 4000$. Number of firms $N = Q_d / q = 4000/10 = 400$ firms."
            }
          ],
          
          "final_answer": "a) $LRAC = q^2 - 20q + 150$, $LRMC = 3q^2 - 40q + 150$. b) $q=10$, $LRAC=50$. c) $P=50$. d) $q=10$. e) With $Q_d = 5000 - 20P$, $Q=4000$, $N=400$.",
          "concept_applied": "Long-run equilibrium occurs where $P = min LRAC$, each firm produces at that quantity, and number of firms adjusts to meet market demand."
        },
        {
          "title": "Industry Cost Conditions",
          
          "image": {
            "src": "images/unit5/long_run_example3.png",
            "alt": "Three industry scenarios",
            "caption": "Figure 5.5.13: Analyze long-run supply for each industry type."
          },
          
          "problem": "Three industries experience a permanent increase in demand. Their cost conditions are:<br>Industry A: Input prices unaffected by industry output.<br>Industry B: Input prices rise as industry expands.<br>Industry C: Input prices fall as industry expands.<br>a) For each, describe the long-run adjustment process.<br>b) Compare the long-run change in price to the short-run price change.<br>c) Draw the long-run industry supply curve for each.<br>d) Give a real-world example of each type.",
          
          "step_by_step": [
            {
              "step": "Industry A (constant-cost)",
              "explanation": "Short run: demand increase raises price, firms earn profit. Entry occurs, increasing supply. Since input prices don't change, firms' cost curves remain unchanged. Entry continues until price returns to original minimum ATC. Long-run price = original. Long-run supply is horizontal."
            },
            {
              "step": "Industry B (increasing-cost)",
              "explanation": "Short run: price rises, profit. Entry increases demand for inputs, raising input prices. Firms' cost curves shift up. New equilibrium occurs at higher minimum ATC. Long-run price > original. Long-run supply slopes upward."
            },
            {
              "step": "Industry C (decreasing-cost)",
              "explanation": "Short run: price rises, profit. Entry leads to economies of scale in input supply, lowering input prices. Firms' cost curves shift down. New equilibrium at lower minimum ATC. Long-run price < original. Long-run supply slopes downward."
            },
            {
              "step": "Long-run price comparison",
              "explanation": "A: Long-run price = original (increase temporary). B: Long-run price > original. C: Long-run price < original."
            },
            {
              "step": "Examples",
              "explanation": "A: Pizza shops (constant-cost). B: Housing construction (increasing-cost). C: Solar panels historically (decreasing-cost due to learning)."
            }
          ],
          
          "final_answer": "a) See explanation. b) A: price returns; B: price higher; C: price lower. c) A: horizontal; B: upward-sloping; C: downward-sloping. d) A: pizza; B: housing; C: solar panels.",
          "concept_applied": "Industry cost conditions determine long-run supply slope and long-run price effects of demand shifts."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Short-Run Situation",
          "description": "Determine if firms are earning profit, loss, or breaking even.",
          "mechanism": "Compare $P$ to $ATC$ at current output. $P > ATC$ = profit; $P < ATC$ = loss; $P = ATC$ = zero profit.",
          "result": "Profit/loss status.",
          
          "image": {
            "src": "images/unit5/long_step1.png",
            "alt": "Comparing P and ATC",
            "caption": "Figure 5.5.14: Step 1 - Identify short-run profit or loss."
          }
        },
        {
          "step": 2,
          "process": "Predict Entry or Exit",
          "description": "Based on profit/loss, predict whether firms will enter or exit.",
          "mechanism": "Profit → entry. Loss → exit. Zero profit → no change.",
          "result": "Direction of adjustment.",
          
          "image": {
            "src": "images/unit5/long_step2.png",
            "alt": "Arrows: profit → entry, loss → exit",
            "caption": "Figure 5.5.15: Step 2 - Predict entry or exit."
          }
        },
        {
          "step": 3,
          "process": "Determine Effect on Market Supply",
          "description": "Entry increases supply (right shift); exit decreases supply (left shift).",
          "mechanism": "More firms → supply right. Fewer firms → supply left.",
          "result": "Market supply shift.",
          
          "image": {
            "src": "images/unit5/long_step3.png",
            "alt": "Supply shifting right (entry) or left (exit)",
            "caption": "Figure 5.5.16: Step 3 - Determine market supply shift."
          }
        },
        {
          "step": 4,
          "process": "Find New Equilibrium Price",
          "description": "Entry lowers price; exit raises price. Process continues until zero profit.",
          "mechanism": "Adjustment stops when $P = min ATC$.",
          "result": "Long-run equilibrium price.",
          
          "image": {
            "src": "images/unit5/long_step4.png",
            "alt": "Price adjusting to min ATC",
            "caption": "Figure 5.5.17: Step 4 - Price adjusts to min ATC."
          }
        },
        {
          "step": 5,
          "process": "Determine Industry Cost Type",
          "description": "Identify whether industry is constant, increasing, or decreasing cost.",
          "mechanism": "Observe how input prices respond to industry expansion. This determines long-run supply slope.",
          "result": "Long-run supply curve shape.",
          
          "image": {
            "src": "images/unit5/long_step5.png",
            "alt": "Three long-run supply curves",
            "caption": "Figure 5.5.18: Step 5 - Determine industry cost type."
          }
        }
      ],

      "image": {
        "src": "images/unit5/long_run_summary.png",
        "alt": "Comprehensive summary: entry/exit process, long-run equilibrium conditions, efficiency properties, industry cost types",
        "caption": "Figure 5.5.19: Long-run equilibrium summary."
      }
    }
  ],

  "key_terms": [
    "Long-run equilibrium",
    "Zero economic profit",
    "Normal profit",
    "Entry",
    "Exit",
    "Adjustment process",
    "Productive efficiency",
    "Allocative efficiency",
    "Efficient scale",
    "Minimum efficient scale",
    "Long-run supply curve",
    "Constant-cost industry",
    "Increasing-cost industry",
    "Decreasing-cost industry",
    "Input prices",
    "Market supply shift",
    "Firm entry",
    "Firm exit",
    "Invisible hand",
    "Pareto efficiency",
    "Marginal cost pricing"
  ],

  "summary": "In the long run, perfectly competitive markets reach an equilibrium where firms earn zero economic profit. This occurs through entry and exit: economic profits attract new firms, increasing supply and lowering price until profits disappear; economic losses cause firms to exit, decreasing supply and raising price until losses disappear. Long-run equilibrium satisfies three conditions: (1) $P = MC$ (profit maximization), (2) $P = ATC$ (zero economic profit), and (3) $P = \\text{minimum } ATC$ (productive efficiency). All firms produce at their efficient scale—the output that minimizes average total cost. Perfect competition achieves both productive efficiency (goods produced at lowest cost) and allocative efficiency ($P = MC$, meaning consumer value equals production cost). The long-run market supply curve's shape depends on industry cost conditions: horizontal for constant-cost industries, upward-sloping for increasing-cost industries, and downward-sloping for decreasing-cost industries. Understanding long-run equilibrium is essential for analyzing how markets adjust over time and for evaluating the efficiency of different market structures."
}
