{
  "expanded_description": "How does a firm decide how much to produce? The answer lies in a simple but powerful rule: produce where marginal revenue equals marginal cost, or $MR = MC$. This rule applies to all profit-maximizing firms, regardless of market structure. For perfectly competitive firms, it takes a special form because $MR = P$, so the rule becomes $P = MC$. In this section, we'll explore why this rule maximizes profit, how to apply it, and what it tells us about firm behavior. Understanding this rule is essential for analyzing supply decisions and market outcomes.",
  
  "core_concept": {
    "principle": "The profit maximization rule states that any firm seeking to maximize economic profit should produce the quantity where marginal revenue equals marginal cost: $MR = MC$. (1) Rationale: If $MR > MC$, producing an additional unit adds more to revenue than to cost, so profit increases. The firm should increase output. If $MR < MC$, the last unit cost more to produce than it brought in, reducing profit. The firm should decrease output. Only when $MR = MC$ is profit maximized—no further adjustments can increase profit. (2) For perfectly competitive firms: Because they are price takers, $MR = P$. The rule becomes $P = MC$. The firm produces where the market price equals its marginal cost. (3) Second-order condition: The $MC$ curve must be rising at the profit-maximizing quantity. If $MC$ is falling, the intersection might represent a profit minimum, not maximum. (4) Shutdown consideration: The firm will only produce if price is at least as high as average variable cost ($P \\geq AVC$). Otherwise, it minimizes losses by shutting down temporarily. (5) Application: Given price and cost curves, find the quantity where $P = MC$ on the rising portion of $MC$, then check that $P \\geq AVC$.",
    
    "explanation": "Think of a lemonade stand. If making one more cup costs $\\$0.50$ and you can sell it for $\\$1.00$, you should make it—profit increases. If it costs $\\$1.20$ to make and sells for $\\$1.00$, you'd lose money on that cup—don't make it. The profit-maximizing quantity is where the cost of the last cup exactly equals what you get for it. That's $MR = MC$.",
    
    "image": {
      "src": "images/unit5/mr_mc_rule.png",
      "alt": "Graph showing MC and MR curves intersecting at profit-maximizing quantity",
      "caption": "Figure 5.2.1: Profit is maximized where marginal revenue equals marginal cost."
    }
  },

  "sections": [
    {
      "section_title": "5.2 Profit Maximization Rule",
      "introduction": "How does a firm decide how much to produce? The answer lies in a simple but powerful rule: produce where marginal revenue equals marginal cost, or $MR = MC$. This rule applies to all profit-maximizing firms, regardless of market structure. For perfectly competitive firms, it takes a special form because $MR = P$, so the rule becomes $P = MC$. In this section, we'll explore why this rule maximizes profit, how to apply it, and what it tells us about firm behavior. Understanding this rule is essential for analyzing supply decisions and market outcomes.",
      
      "introduction_image": {
        "src": "images/unit5/profit_rule_intro.png",
        "alt": "Business owner at whiteboard with MR = MC equation",
        "caption": "Figure 5.2.2: The profit-maximizing firm produces where marginal revenue equals marginal cost."
      },
      
      "key_concept": {
        "definition": "The profit maximization rule is a fundamental principle of firm behavior: to maximize economic profit, a firm should produce the quantity at which marginal revenue equals marginal cost: $MR = MC$. (1) Derivation: Profit ($\\pi$) = Total Revenue ($TR$) - Total Cost ($TC$). To maximize profit, take the derivative with respect to quantity and set equal to zero: $d\\pi/dQ = dTR/dQ - dTC/dQ = MR - MC = 0$, so $MR = MC$. (2) Intuition: If $MR > MC$, the next unit adds more to revenue than to cost, increasing profit. The firm should produce more. If $MR < MC$, the last unit cost more than it brought in, reducing profit. The firm should produce less. Only at $MR = MC$ is profit maximized. (3) For perfectly competitive firms: Since the firm is a price taker, $MR = P$. The rule simplifies to $P = MC$. The firm produces where price equals its marginal cost. (4) Second-order condition: The profit-maximizing point must be on the rising portion of the $MC$ curve. If $MC$ is falling, the intersection could represent a profit minimum. (5) Shutdown condition: The firm will only produce if $P \\geq AVC$ at the profit-maximizing quantity. If $P < AVC$, the firm minimizes losses by shutting down (producing zero) in the short run. (6) Graphical interpretation: Find the intersection of the $MR$ curve (horizontal at $P$) with the $MC$ curve. Drop down to the quantity axis to find profit-maximizing $Q$. Then use $ATC$ to determine profit or loss.",
        
        "context": "The marginal revenue equals marginal cost rule is one of the most important ideas in microeconomics. It was developed in the late 19th and early 20th centuries as economists formalized the theory of the firm. The rule applies to all firms, from perfect competitors to monopolists—only the shape of the $MR$ curve differs. In AP Microeconomics, mastering this rule is essential for analyzing firm behavior in all market structures. It's the foundation for deriving supply curves, determining equilibrium, and evaluating efficiency.",
        
        "image": {
          "src": "images/unit5/mr_mc_graph.png",
          "alt": "Graph showing MR horizontal at P, MC upward-sloping, intersection at Q*",
          "caption": "Figure 5.2.3: For a perfectly competitive firm, profit is maximized where P = MC."
        }
      },

      "classifications": [
        {
          "type": "When MR > MC",
          "value": "Increase output to maximize profit",
          "characteristics": ["$MR > MC$", "Additional unit adds to profit", "Current output too low", "Should produce more", "Profit not yet maximized"],
          "behavior": "When marginal revenue exceeds marginal cost, producing one more unit adds more to revenue than to cost, increasing total profit. The firm should expand production. This situation occurs when the firm is producing less than the profit-maximizing quantity. In a perfectly competitive market, this means $P > MC$. The firm can increase profit by hiring more workers, using more materials, and increasing output. As output increases, marginal cost typically rises (due to diminishing returns), moving the firm toward the $MR = MC$ point. Firms in this situation are leaving money on the table—they could increase profit by producing more.",
          
          "image": {
            "src": "images/unit5/mr_gt_mc.png",
            "alt": "Graph showing MR above MC, with arrow pointing right to increase Q",
            "caption": "Figure 5.2.4: When MR > MC, increasing output increases profit."
          },
          
          "examples": [
            {
              "process": "Bakery decision",
              "explanation": "A bakery finds that producing the 100th loaf adds $\\$5$ to revenue but only $\\$3$ to cost ($MR > MC$). They should bake more loaves—profit increases by $\\$2$ per additional loaf until equality."
            }
          ]
        },
        {
          "type": "When MR < MC",
          "value": "Decrease output to maximize profit",
          "characteristics": ["$MR < MC$", "Last unit reduced profit", "Current output too high", "Should produce less", "Profit not yet maximized"],
          "behavior": "When marginal revenue is less than marginal cost, the last unit produced added more to cost than to revenue, reducing total profit. The firm should reduce production. This situation occurs when the firm is producing more than the profit-maximizing quantity. In a perfectly competitive market, this means $P < MC$. By reducing output, the firm avoids producing units that lose money, increasing overall profit. As output decreases, marginal cost typically falls (moving back along the MC curve), bringing the firm toward the $MR = MC$ point. Firms in this situation are destroying value with their last units—they should cut back.",
          
          "image": {
            "src": "images/unit5/mr_lt_mc.png",
            "alt": "Graph showing MR below MC, with arrow pointing left to decrease Q",
            "caption": "Figure 5.2.5: When MR < MC, decreasing output increases profit."
          },
          
          "examples": [
            {
              "process": "Factory overproduction",
              "explanation": "A factory finds that the 500th unit adds $\\$10$ to revenue but costs $\\$12$ to produce ($MR < MC$). They should reduce production—each unit beyond the optimal point loses money."
            }
          ]
        },
        {
          "type": "When MR = MC",
          "value": "Profit-maximizing output",
          "characteristics": ["$MR = MC$", "No further adjustments increase profit", "Optimal quantity", "Second-order condition: MC rising", "Must check shutdown condition"],
          "behavior": "When marginal revenue equals marginal cost, the firm has found the profit-maximizing quantity. No further adjustments can increase profit—any change would either add a unit with $MR < MC$ (reducing profit) or remove a unit where $MR > MC$ (also reducing profit). This is the optimal output level. For a perfectly competitive firm, this means $P = MC$. However, the firm must also verify two things: (1) The intersection must be on the rising portion of the MC curve (if MC is falling at the intersection, it's actually a profit minimum). (2) At this quantity, price must be at least as high as average variable cost ($P \\geq AVC$). If $P < AVC$, the firm minimizes losses by shutting down temporarily, even though $P = MC$.",
          
          "image": {
            "src": "images/unit5/mr_eq_mc.png",
            "alt": "Graph showing MR = MC at intersection, with Q* marked",
            "caption": "Figure 5.2.6: At MR = MC, profit is maximized."
          },
          
          "examples": [
            {
              "process": "Optimal production",
              "explanation": "A farm finds that at 1,000 bushels, the cost of producing one more bushel exactly equals the market price. This is their profit-maximizing output."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The MR = MC Rule Applies to All Profit-Maximizing Firms",
          "statement": "The principle that firms maximize profit by producing where marginal revenue equals marginal cost is universal—it applies to perfect competitors, monopolists, oligopolists, and monopolistic competitors. The only difference across market structures is the shape of the marginal revenue curve. For perfect competitors, $MR = P$ (horizontal). For firms with market power, $MR$ is downward-sloping and less than price. But in all cases, the firm finds its optimal quantity where $MR$ intersects $MC$ from above. This universality makes the $MR = MC$ rule one of the most powerful tools in microeconomics. It allows us to analyze firm behavior across different market structures using a common framework.",
          "application": "When analyzing any firm, first determine its marginal revenue curve. For perfect competition, it's horizontal at $P$. Then find where $MR = MC$. This gives the profit-maximizing quantity. The same approach works for monopoly—just use the downward-sloping $MR$ curve.",
          "example": "A perfectly competitive wheat farmer uses $P = MC$. A monopolist like a pharmaceutical company uses $MR = MC$, where $MR$ is below demand. Both follow the same rule—only the $MR$ curve differs.",
          
          "image": {
            "src": "images/unit5/universal_rule.png",
            "alt": "Side-by-side: perfect competition MR horizontal, monopoly MR downward-sloping, both intersecting MC",
            "caption": "Figure 5.2.7: The MR = MC rule applies to all firms—only MR differs."
          }
        },
        {
          "principle": "The Profit-Maximizing Point Must Be on the Rising Portion of MC",
          "statement": "The $MR = MC$ condition is necessary but not sufficient for profit maximization. The intersection must occur on the rising portion of the marginal cost curve. This is the second-order condition. If $MC$ is falling at the intersection, that point actually represents a profit minimum—producing slightly more would increase profit (since $MR > MC$ after the intersection). In practice, with typical U-shaped marginal cost curves, the rising portion is where firms operate. The falling portion corresponds to increasing returns, where firms would want to expand. This condition ensures that the $MR = MC$ point is a maximum, not a minimum. When drawing graphs or analyzing data, always check that the intersection is on the upward-sloping part of $MC$.",
          "application": "When finding the profit-maximizing quantity, ensure that $MC$ is increasing at that point. If $MC$ is decreasing, the firm could increase profit by expanding output further, so that's not the true maximum.",
          "example": "A firm's $MC$ falls from $Q=1$ to $Q=5$, then rises. If $P = MC$ at $Q=3$ (falling portion), this is not profit-maximizing—the firm should expand to where $MC$ rises and equals $P$ again at a higher quantity.",
          
          "image": {
            "src": "images/unit5/rising_mc.png",
            "alt": "MC curve with falling and rising portions, profit max marked on rising portion",
            "caption": "Figure 5.2.8: Profit maximization occurs on the rising portion of MC."
          }
        },
        {
          "principle": "The Shutdown Condition Overrides MR = MC",
          "statement": "Even if a firm finds a quantity where $MR = MC$, it may still choose to produce nothing in the short run. This happens when the price is below average variable cost at all output levels. The shutdown rule states: if $P < AVC$ at the profit-maximizing quantity, the firm minimizes losses by producing zero. Why? Because if price is below average variable cost, the firm loses more on each unit than it would lose by shutting down (where losses equal fixed costs only). By producing, it adds variable costs that exceed revenue, increasing losses above fixed costs. So the final step in profit maximization is to compare price to $AVC$ at the $MR = MC$ quantity. If $P \\geq AVC$, produce at that quantity. If $P < AVC$, shut down and produce zero. This is why the firm's supply curve is only the portion of $MC$ above $AVC$.",
          "application": "After finding $Q$ where $P = MC$, check $AVC$ at that $Q$. If $P \\geq AVC$, produce. If $P < AVC$, shut down (produce zero). The firm's short-run supply curve is $MC$ above $AVC$.",
          "example": "A farmer finds that at $P = \\$3$, $MC = \\$3$ at $Q=500$, but $AVC$ at $Q=500$ is $\\$3.50$. Since $P < AVC$, the farmer loses more by producing than by shutting down. They should produce nothing, losing only fixed costs.",
          
          "image": {
            "src": "images/unit5/shutdown_condition.png",
            "alt": "MC and AVC curves with shutdown point where MC = AVC",
            "caption": "Figure 5.2.9: The firm shuts down if price is below minimum AVC."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Applying the MR = MC Rule",
          
          "image": {
            "src": "images/unit5/profit_example1.png",
            "alt": "Table with quantity, price, MR, MC data",
            "caption": "Figure 5.2.10: Find profit-maximizing quantity from data."
          },
          
          "problem": "A perfectly competitive firm faces a market price of $\\$12$. Its cost data shows:<br>Q: 0, 1, 2, 3, 4, 5, 6, 7<br>MC: -, 8, 6, 5, 8, 12, 18, 25<br>AVC: -, 10, 8, 7, 7.5, 8.4, 10, 12.3<br>a) What is marginal revenue at each quantity?<br>b) Find the profit-maximizing quantity using the $MR = MC$ rule.<br>c) Verify that this is on the rising portion of MC.<br>d) Check the shutdown condition.<br>e) Calculate total profit or loss at this quantity if fixed costs are $\\$20$.",
          
          "step_by_step": [
            {
              "step": "Determine MR",
              "explanation": "In perfect competition, $MR = P = \\$12$ at all quantities."
            },
            {
              "step": "Find where MR = MC",
              "explanation": "Compare $MR = 12$ to MC values:<br>Q=1: MC=8 < 12 → MR > MC, increase Q<br>Q=2: MC=6 < 12 → increase<br>Q=3: MC=5 < 12 → increase<br>Q=4: MC=8 < 12 → increase<br>Q=5: MC=12 = MR → potential optimum<br>Q=6: MC=18 > MR → too high<br>So Q=5 is where MR = MC."
            },
            {
              "step": "Check rising portion",
              "explanation": "MC values: 8,6,5,8,12,18,25. MC was falling (8→6→5) then rising (5→8→12→18→25). Q=5 is on rising portion (after the minimum at Q=3). Good."
            },
            {
              "step": "Check shutdown condition",
              "explanation": "At Q=5, $AVC = 8.4$. $P = 12 > AVC$, so produce. Shutdown not triggered."
            },
            {
              "step": "Calculate profit",
              "explanation": "Need total revenue and total cost. $TR = P \\times Q = 12 \\times 5 = 60$.<br>$TC = TVC + TFC$. Need $TVC$: $AVC \\times Q = 8.4 \\times 5 = 42$. $TFC = 20$. So $TC = 42 + 20 = 62$.<br>Profit = $60 - 62 = -2$ (a loss of $\\$2$)."
            }
          ],
          
          "final_answer": "a) $MR = 12$ for all Q. b) Q=5. c) Yes, MC rising. d) $P > AVC$, so produce. e) Loss of $\\$2$.",
          "concept_applied": "Profit-maximizing quantity is where $MR = MC$ on rising portion, provided $P \\geq AVC$."
        },
        {
          "title": "Graphical Profit Maximization",
          
          "image": {
            "src": "images/unit5/profit_example2.png",
            "alt": "Graph with MC, ATC, AVC curves and price line",
            "caption": "Figure 5.2.11: Identify profit-maximizing quantity and profit area."
          },
          
          "problem": "A perfectly competitive firm has the cost curves shown in the graph. The market price is $P_1$.<br>a) Identify the profit-maximizing quantity.<br>b) Shade the area representing total revenue.<br>c) Shade the area representing total cost.<br>d) Shade the area representing profit or loss.<br>e) If price fell to $P_2$ where $P_2$ is below AVC at all quantities, what should the firm do?",
          
          "step_by_step": [
            {
              "step": "Find profit-maximizing Q",
              "explanation": "Find where the price line ($P_1$) intersects the MC curve on its rising portion. Drop down to quantity axis—that's Q*."
            },
            {
              "step": "Total revenue area",
              "explanation": "Total revenue = $P \\times Q$. On the graph, this is a rectangle with height $P_1$ and width Q*. Shade this entire rectangle."
            },
            {
              "step": "Total cost area",
              "explanation": "Total cost = $ATC \\times Q$. At Q*, find $ATC$ on the ATC curve. Total cost is a rectangle with height $ATC$ and width Q*. Shade this rectangle, which will be inside the TR rectangle if profit >0, or extend above if loss."
            },
            {
              "step": "Profit or loss area",
              "explanation": "Profit is the difference between TR and TC. If $P_1 > ATC$, profit is the rectangle between $P_1$ and $ATC$ over Q*. If $P_1 < ATC$, loss is the rectangle between $ATC$ and $P_1$."
            },
            {
              "step": "Price below AVC",
              "explanation": "If price falls to $P_2$ below minimum AVC, the firm should shut down temporarily, producing zero. Losses equal fixed costs only."
            }
          ],
          
          "final_answer": "a) Q* at intersection of P and MC. b) TR = P × Q rectangle. c) TC = ATC × Q rectangle. d) Profit = difference between TR and TC rectangles. e) Shut down (produce zero).",
          "concept_applied": "Graphically, profit is the area between price and ATC at the profit-maximizing quantity. Shutdown occurs when P < min AVC."
        },
        {
          "title": "Profit Maximization with Different Prices",
          
          "image": {
            "src": "images/unit5/profit_example3.png",
            "alt": "MC, ATC, AVC curves with multiple price lines",
            "caption": "Figure 5.2.12: Analyze firm's response to different prices."
          },
          
          "problem": "A perfectly competitive firm has the following cost structure:<br>$MC = 2Q$, $AVC = Q$, $ATC = Q + 10/Q$, where Q is in thousands.<br>a) If market price is $\\$20$, find profit-maximizing Q, check shutdown, and calculate profit.<br>b) If price falls to $\\$8$, find profit-maximizing Q and calculate profit/loss.<br>c) If price falls to $\\$2$, what should the firm do?<br>d) At what price would the firm shut down?",
          
          "step_by_step": [
            {
              "step": "Price = $20$",
              "explanation": "Set $P = MC$: $20 = 2Q$ → $Q = 10$ thousand units.<br>Check shutdown: At Q=10, $AVC = Q = 10$. $P = 20 > 10$, so produce.<br>Calculate profit: $TR = 20 × 10 = 200$. $ATC = Q + 10/Q = 10 + 10/10 = 10 + 1 = 11$. $TC = ATC × Q = 11 × 10 = 110$. Profit = $200 - 110 = 90$ (thousand)."
            },
            {
              "step": "Price = $8$",
              "explanation": "Set $8 = 2Q$ → $Q = 4$ thousand.<br>Check shutdown: At Q=4, $AVC = 4$. $P = 8 > 4$, so produce.<br>$ATC = 4 + 10/4 = 4 + 2.5 = 6.5$. $TC = 6.5 × 4 = 26$. $TR = 8 × 4 = 32$. Profit = $32 - 26 = 6$ (thousand)."
            },
            {
              "step": "Price = $2$",
              "explanation": "Set $2 = 2Q$ → $Q = 1$ thousand.<br>Check shutdown: At Q=1, $AVC = 1$. $P = 2 > 1$, so produce? Wait, need to check if P is above minimum AVC. Minimum AVC occurs where? $AVC = Q$, so minimum is at Q=0 (approaches 0). Actually, $AVC$ increases with Q, so minimum is at smallest Q. But we must consider: at very low Q, does the rule still apply? With these linear functions, $P > AVC$ for any Q as long as $P > 0$? Actually $AVC = Q$, so at Q=1, $AVC=1$, $P=2>1$. But is this the profit-maximizing? Let's check if producing at Q=1 is better than shutting down. At Q=1, $TR=2$, $TC = ATC × Q = (1 + 10/1) × 1 = 11 × 1 = 11$. Loss = $2 - 11 = -9$. If shut down, loss = fixed costs. Fixed costs = $TFC = TC - TVC = 11 - 1 = 10$. So loss = -10 if shut down. Producing loses 9, which is better than losing 10. So produce at Q=1."
            },
            {
              "step": "Shutdown price",
              "explanation": "Shutdown occurs when $P < min AVC$. Here $AVC = Q$, which increases from 0, so minimum AVC is 0 (approached as Q→0). But in practice, the firm would shut down when $P$ is less than the minimum point of the AVC curve. With $AVC = Q$, the minimum is at Q→0, AVC→0. So any positive price is above minimum AVC. This firm would never shut down? That's unrealistic—the linear AVC with intercept zero means variable costs are very low at low output. In reality, AVC curves are U-shaped. For this problem, with $ATC = Q + 10/Q$, the minimum AVC is at Q=0, so shutdown price is 0. That's a limitation of the linear example."
            }
          ],
          
          "final_answer": "a) Q=10, profit = $90,000. b) Q=4, profit = $6,000. c) Produce at Q=1 (loss $9,000 < fixed cost $10,000). d) Shutdown price = $0$ (due to linear AVC).",
          "concept_applied": "Profit-maximizing quantity changes with price. Firm produces as long as $P \\geq AVC$, even if making losses, as long as losses are less than fixed costs."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Determine Marginal Revenue",
          "description": "For a perfectly competitive firm, $MR = P$ (constant).",
          "mechanism": "Market price is given. The firm's MR curve is horizontal at that price.",
          "result": "$MR = P$.",
          
          "image": {
            "src": "images/unit5/profit_step1.png",
            "alt": "Horizontal MR line at price P",
            "caption": "Figure 5.2.13: Step 1 - For perfect competition, MR = P."
          }
        },
        {
          "step": 2,
          "process": "Find Where MR = MC",
          "description": "Locate the quantity where marginal revenue equals marginal cost.",
          "mechanism": "Set $P = MC$ and solve for Q, or find intersection on graph.",
          "result": "Candidate profit-maximizing Q.",
          
          "image": {
            "src": "images/unit5/profit_step2.png",
            "alt": "Finding intersection of MR and MC",
            "caption": "Figure 5.2.14: Step 2 - Find where MR = MC."
          }
        },
        {
          "step": 3,
          "process": "Verify Rising MC",
          "description": "Ensure the intersection is on the rising portion of the MC curve.",
          "mechanism": "Check that MC is increasing at that Q. If MC is falling, this is not the profit maximum.",
          "result": "Confirmation of correct intersection.",
          
          "image": {
            "src": "images/unit5/profit_step3.png",
            "alt": "Checking that MC is rising at intersection",
            "caption": "Figure 5.2.15: Step 3 - Verify MC is rising at the intersection."
          }
        },
        {
          "step": 4,
          "process": "Check Shutdown Condition",
          "description": "Compare price to average variable cost at the candidate quantity.",
          "mechanism": "If $P \\geq AVC$, produce at Q*. If $P < AVC$, shut down (produce zero).",
          "result": "Final production decision.",
          
          "image": {
            "src": "images/unit5/profit_step4.png",
            "alt": "Comparing P to AVC",
            "caption": "Figure 5.2.16: Step 4 - Check if P ≥ AVC."
          }
        },
        {
          "step": 5,
          "process": "Calculate Profit or Loss",
          "description": "Determine economic profit at the chosen quantity.",
          "mechanism": "Profit = $(P - ATC) \\times Q$. If positive, firm earns economic profit; if negative, economic loss.",
          "result": "Profit/loss amount.",
          
          "image": {
            "src": "images/unit5/profit_step5.png",
            "alt": "Calculating profit as (P - ATC) × Q",
            "caption": "Figure 5.2.17: Step 5 - Calculate profit or loss."
          }
        }
      ],

      "image": {
        "src": "images/unit5/profit_rule_summary.png",
        "alt": "Comprehensive summary: MR = MC rule, comparisons, shutdown condition, profit calculation",
        "caption": "Figure 5.2.18: Profit maximization rule summary."
      }
    }
  ],

  "key_terms": [
    "Profit maximization",
    "Marginal revenue (MR)",
    "Marginal cost (MC)",
    "MR = MC rule",
    "P = MC",
    "Price taker",
    "Second-order condition",
    "Rising portion of MC",
    "Shutdown condition",
    "Shutdown point",
    "Average variable cost (AVC)",
    "Economic profit",
    "Economic loss",
    "Total revenue",
    "Total cost",
    "Optimal quantity",
    "Production decision",
    "Loss minimization",
    "Break-even point",
    "Firm behavior"
  ],

  "summary": "The profit maximization rule states that any firm seeking to maximize economic profit should produce the quantity where marginal revenue equals marginal cost: $MR = MC$. If $MR > MC$, producing more increases profit; if $MR < MC$, producing less increases profit. For perfectly competitive firms, $MR = P$, so the rule becomes $P = MC$. The firm finds the quantity where price equals its marginal cost on the rising portion of the MC curve. However, two additional conditions apply: (1) The intersection must be on the rising portion of MC (if MC is falling, it's a profit minimum). (2) The firm will only produce if price is at least as high as average variable cost ($P \\geq AVC$) at that quantity; otherwise, it minimizes losses by shutting down temporarily. Profit (or loss) can be calculated as $(P - ATC) \\times Q$. If $P > ATC$, the firm earns economic profit; if $P < ATC$, it incurs economic loss; if $P = ATC$, it breaks even. The $MR = MC$ rule is universal—it applies to all profit-maximizing firms across all market structures, with only the shape of the MR curve differing. Understanding this rule is essential for analyzing firm supply decisions and market outcomes."
}
