{
  "expanded_description": "What happens when a perfectly competitive firm faces a price that is above its average total cost? It earns economic profit. What happens when price is below average total cost? It incurs losses. But in perfect competition, these profits and losses are not permanent—they trigger entry and exit that drive the market toward long-run equilibrium. In the short run, however, firms can experience a range of outcomes: profits, losses, or breaking even. Understanding these short-run scenarios is essential for predicting firm behavior and market adjustments. In this section, we'll explore how to determine whether a firm is making a profit or loss, how to calculate the amount, and what these outcomes imply for the firm's decisions.",
  
  "core_concept": {
    "principle": "In the short run, a perfectly competitive firm can earn economic profit, incur economic loss, or break even, depending on the relationship between market price and its cost curves. (1) Economic profit occurs when $P > ATC$ at the profit-maximizing quantity. The firm earns more than its opportunity cost. Profit per unit = $P - ATC$, and total profit = $(P - ATC) \\times Q$. (2) Economic loss occurs when $P < ATC$ at the profit-maximizing quantity. The firm earns less than its opportunity cost. Loss per unit = $ATC - P$, and total loss = $(ATC - P) \\times Q$. The firm will still produce in the short run if $P \\geq AVC$, because producing reduces losses below fixed costs. (3) Break-even occurs when $P = ATC$ at the profit-maximizing quantity. The firm earns exactly its opportunity cost, so economic profit is zero. (4) The shutdown case: If $P < AVC$ at all quantities, the firm minimizes losses by producing zero. Losses then equal fixed costs. (5) These outcomes are temporary in perfect competition—profits attract entry, losses cause exit, driving price toward the break-even point in the long run.",
    
    "explanation": "Think of a food truck. If the price of tacos is high enough that each taco covers all costs and leaves extra, the owner makes profit. If price only covers variable costs but not all fixed costs, the owner still operates—they lose less than if they shut down. If price doesn't even cover the cost of ingredients, they shut down. These short-run outcomes determine whether the food truck stays in business or not, and whether more trucks will enter the market.",
    
    "image": {
      "src": "images/unit5/short_run_profit.png",
      "alt": "Three graphs showing profit, loss, and shutdown scenarios",
      "caption": "Figure 5.3.1: In the short run, firms can earn profits, incur losses, or shut down."
    }
  },

  "sections": [
    {
      "section_title": "5.3 Short Run Profit and Loss",
      "introduction": "What happens when a perfectly competitive firm faces a price that is above its average total cost? It earns economic profit. What happens when price is below average total cost? It incurs losses. But in perfect competition, these profits and losses are not permanent—they trigger entry and exit that drive the market toward long-run equilibrium. In the short run, however, firms can experience a range of outcomes: profits, losses, or breaking even. Understanding these short-run scenarios is essential for predicting firm behavior and market adjustments. In this section, we'll explore how to determine whether a firm is making a profit or loss, how to calculate the amount, and what these outcomes imply for the firm's decisions.",
      
      "introduction_image": {
        "src": "images/unit5/short_run_intro.png",
        "alt": "Three businesses: one thriving (profit), one struggling (loss), one closed (shutdown)",
        "caption": "Figure 5.3.2: Short-run outcomes range from profit to loss to shutdown."
      },
      
      "key_concept": {
        "definition": "In the short run, a perfectly competitive firm's profitability is determined by comparing market price to its average total cost at the profit-maximizing quantity. (1) Economic profit: Occurs when $P > ATC$ at $Q^*$ (where $P = MC$). The firm earns revenue above all costs, including opportunity costs. Profit per unit = $P - ATC$. Total profit = $(P - ATC) \\times Q^*$. Graphically, profit is the rectangle between the price line and the ATC curve over the output range. (2) Economic loss: Occurs when $P < ATC$ at $Q^*$. The firm fails to cover all costs, including opportunity costs. Loss per unit = $ATC - P$. Total loss = $(ATC - P) \\times Q^*$. However, the firm will continue producing in the short run as long as $P \\geq AVC$, because producing reduces the loss below fixed costs. (3) Break-even: Occurs when $P = ATC$ at $Q^*$. The firm earns exactly zero economic profit—revenue covers all costs including opportunity cost. This is the break-even point. (4) Shutdown: Occurs when $P < AVC$ at all quantities. The firm cannot even cover variable costs, so producing would increase losses above fixed costs. The optimal short-run decision is to produce zero, with loss equal to total fixed costs. (5) The shutdown point is the minimum point of the AVC curve, where $P = MC = AVC$. Below this price, the firm shuts down. (6) These outcomes are not permanent—they trigger market adjustments that will be analyzed in the long-run equilibrium section.",
        
        "context": "Understanding short-run profit and loss is crucial for predicting firm behavior and market dynamics. Firms earning profits have incentives to expand; firms incurring losses may contract or exit. These individual decisions aggregate to market-level changes in supply, which ultimately drive price toward the break-even point. In AP Microeconomics, you'll be expected to calculate profit and loss from graphs or data, identify break-even and shutdown points, and explain how these outcomes affect firm and market behavior.",
        
        "image": {
          "src": "images/unit5/profit_loss_graphs.png",
          "alt": "Three graphs side by side: profit (P > ATC), loss (P between AVC and ATC), shutdown (P < AVC)",
          "caption": "Figure 5.3.3: Short-run scenarios compared."
        }
      },

      "classifications": [
        {
          "type": "Economic Profit",
          "value": "$P > ATC$ at $Q^*$",
          "characteristics": ["Firm earns above-normal returns", "Profit = $(P - ATC) \\times Q$", "Attracts entry in long run", "Indicates efficient resource allocation", "Positive producer surplus"],
          "behavior": "When market price exceeds average total cost at the profit-maximizing quantity, the firm earns economic profit. This means the firm's revenue covers all explicit costs plus provides a return above the opportunity cost of resources. In perfect competition, economic profit signals that resources are valued more highly in this industry than in alternative uses. This attracts new firms to enter the market in the long run. In the short run, the firm simply enjoys the profit and has no reason to change its scale (since it's already at $MR = MC$). Graphically, profit is the area of the rectangle with height $(P - ATC)$ and width $Q^*$. The firm is operating above its break-even point.",
          
          "image": {
            "src": "images/unit5/profit_scenario.png",
            "alt": "Graph with P above ATC, profit rectangle shaded",
            "caption": "Figure 5.3.4: Economic profit occurs when price exceeds average total cost."
          },
          
          "examples": [
            {
              "process": "Profitable farm",
              "explanation": "A wheat farmer finds that at the profit-maximizing quantity of 10,000 bushels, price is $\\$6$ and ATC is $\\$4.50$. Profit per bushel = $\\$1.50$, total profit = $\\$15,000$."
            },
            {
              "process": "Successful food truck",
              "explanation": "A food truck sells 200 tacos per day at $\\$4$ each. ATC is $\\$3$. Profit = $(4-3) \\times 200 = \\$200$ per day."
            }
          ]
        },
        {
          "type": "Economic Loss (Operating)",
          "value": "$AVC < P < ATC$ at $Q^*$",
          "characteristics": ["Firm earns below-normal returns", "Loss = $(ATC - P) \\times Q$", "Still operating (covers variable costs)", "Loss less than fixed costs", "May cause exit in long run"],
          "behavior": "When price is below average total cost but above average variable cost at the profit-maximizing quantity, the firm incurs an economic loss but continues to operate in the short run. Why? Because by producing, the firm covers all its variable costs and contributes something toward fixed costs. The loss is less than the fixed costs that would be lost if the firm shut down. The firm is minimizing losses by producing where $P = MC$ (on the rising portion). Graphically, the loss is the rectangle with height $(ATC - P)$ and width $Q^*$. This situation is unsustainable in the long run—if losses persist, firms will exit the industry. But in the short run, operating at a loss can be the rational choice.",
          
          "image": {
            "src": "images/unit5/loss_scenario.png",
            "alt": "Graph with P below ATC but above AVC, loss rectangle shaded",
            "caption": "Figure 5.3.5: Economic loss occurs when price is below ATC but above AVC—firm still operates."
          },
          
          "examples": [
            {
              "process": "Struggling farm",
              "explanation": "A farmer faces price $\\$4$, ATC = $\\$5$, AVC = $\\$3.50$ at Q=8,000. Loss per unit = $\\$1$, total loss = $\\$8,000$. If they shut down, they'd lose fixed costs of $\\$12,000$. Operating reduces loss by $\\$4,000$."
            },
            {
              "process": "Restaurant during slow season",
              "explanation": "A restaurant covers food costs and some staff (variable costs) but not rent and overhead (fixed costs). It operates at a loss but loses less than if it closed."
            }
          ]
        },
        {
          "type": "Shutdown",
          "value": "$P < AVC$ at all $Q$",
          "characteristics": ["Cannot cover variable costs", "Produce zero", "Loss = fixed costs", "Temporary cessation", "May resume if price rises"],
          "behavior": "When price falls below the minimum point of the average variable cost curve, the firm cannot cover its variable costs at any output level. Producing would increase losses above fixed costs because each unit sold adds more to cost than to revenue. The rational decision is to shut down temporarily—produce zero output. The firm still incurs fixed costs (rent, insurance, etc.), but these losses are smaller than if it continued operating. Shutdown is a short-run decision; the firm may resume production if price rises above minimum AVC. The shutdown point is the minimum point of the AVC curve, where $P = MC = AVC$. Below this price, the firm supplies zero. This is why the firm's short-run supply curve is only the portion of MC above AVC.",
          
          "image": {
            "src": "images/unit5/shutdown_scenario.png",
            "alt": "Graph with P below AVC, firm produces zero",
            "caption": "Figure 5.3.6: Shutdown occurs when price falls below minimum AVC."
          },
          
          "examples": [
            {
              "process": "Factory with low prices",
              "explanation": "A factory faces price $\\$5$ while minimum AVC is $\\$7$. Every unit produced loses at least $\\$2$ in variable costs alone. Better to shut down and lose only fixed costs."
            },
            {
              "process": "Seasonal business",
              "explanation": "A beachside ice cream shop may shut down in winter when prices (revenue per cone) don't cover variable costs of operating."
            }
          ]
        },
        {
          "type": "Break-Even",
          "value": "$P = ATC$ at $Q^*$",
          "characteristics": ["Zero economic profit", "Normal accounting profit", "Covers opportunity costs", "No incentive to enter/exit", "Minimum point of ATC"],
          "behavior": "Break-even occurs when price equals average total cost at the profit-maximizing quantity. The firm earns zero economic profit—revenue covers all explicit costs plus the opportunity cost of resources. This is also called normal profit. At break-even, the firm has no incentive to enter or exit the industry. In perfect competition, the long-run equilibrium occurs when all firms break even, with price equal to minimum ATC. The break-even point is the minimum point of the ATC curve. At this point, the firm is productively efficient—producing at the lowest possible cost per unit. Zero economic profit doesn't mean the firm is failing; it means it's earning exactly the competitive return on its resources.",
          
          "image": {
            "src": "images/unit5/breakeven_scenario.png",
            "alt": "Graph with P = ATC at minimum point, no profit rectangle",
            "caption": "Figure 5.3.7: Break-even occurs when price equals minimum ATC."
          },
          
          "examples": [
            {
              "process": "Competitive equilibrium",
              "explanation": "In a perfectly competitive market in long-run equilibrium, all firms produce at minimum ATC and earn zero economic profit."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Firms Produce Where P = MC, Then Compare P to ATC to Determine Profit",
          "statement": "The two-step process for analyzing short-run profitability is: First, find the profit-maximizing quantity where $P = MC$ (on the rising portion). Second, compare $P$ to $ATC$ at that quantity to determine profit or loss. If $P > ATC$, the firm earns economic profit. If $P < ATC$, it incurs economic loss. If $P = ATC$, it breaks even. This simple comparison tells us everything about the firm's short-run financial status. The magnitude of profit or loss is then $(P - ATC) \\times Q^*$. This approach works regardless of whether the firm is making profit or loss—the same formula gives profit (positive) or loss (negative). Understanding this two-step process is essential for analyzing firm behavior and market outcomes.",
          "application": "Given a firm's cost curves and market price, first find $Q^*$ from $P = MC$, then read $ATC$ at that $Q$, and compute profit as $(P - ATC) \\times Q^*$. This works for any perfectly competitive firm.",
          "example": "A firm has $MC = 2Q$, $ATC = Q + 10/Q$. Price = $\\$12$. $12 = 2Q$ → $Q=6$. $ATC = 6 + 10/6 = 6 + 1.67 = 7.67$. Profit = $(12 - 7.67) \\times 6 = 4.33 \\times 6 = 25.98$.",
          
          "image": {
            "src": "images/unit5/two_step.png",
            "alt": "Flowchart: Find Q from P=MC → Compare P to ATC → Calculate profit",
            "caption": "Figure 5.3.8: Two-step process for determining profit."
          }
        },
        {
          "principle": "Operating at a Loss Can Be Rational in the Short Run",
          "statement": "A common misconception is that firms should shut down whenever they're losing money. In fact, it's rational to continue operating at a loss in the short run as long as price exceeds average variable cost. Why? Because fixed costs are sunk in the short run—they must be paid regardless of whether the firm produces. By producing, the firm generates revenue that covers all variable costs and contributes something toward fixed costs, reducing the loss below the level of fixed costs. The firm's decision rule is: continue operating if $P \\geq AVC$; shut down if $P < AVC$. This is why we see firms operating at a loss during temporary downturns—they're minimizing losses, not maximizing profits. Understanding this helps explain why firms don't immediately exit when prices fall.",
          "application": "When analyzing a firm with losses, check if $P \\geq AVC$. If yes, the firm should continue operating despite losses. Only when $P < AVC$ should it shut down. This determines whether losses are temporary or terminal.",
          "example": "A firm has fixed costs of $\\$1,000$ and variable costs of $\\$800$ at its optimal output. Revenue is $\\$1,200$. Loss = $\\$600$ ($TC = 1800$, $TR = 1200$). If it shut down, loss = $\\$1,000$ (fixed costs). Operating reduces loss by $\\$400$—rational to operate.",
          
          "image": {
            "src": "images/unit5/rational_loss.png",
            "alt": "Comparison of loss from operating vs. loss from shutting down",
            "caption": "Figure 5.3.9: Operating at a loss can be rational if loss < fixed costs."
          }
        },
        {
          "principle": "The Shutdown Point Is Where P = Minimum AVC",
          "statement": "The shutdown point is the price and quantity where the firm is indifferent between producing and shutting down. At this point, $P = MC = AVC$, and the firm's loss equals its fixed costs whether it produces or not. Below this price, producing increases losses above fixed costs, so shutdown is preferable. The shutdown point occurs at the minimum of the average variable cost curve. This is a critical concept because it defines the lower bound of the firm's short-run supply curve. The firm supplies zero at any price below this point, and supplies along its MC curve above this point. Graphically, the shutdown point is where the MC curve intersects the AVC curve at its minimum.",
          "application": "To find a firm's shutdown price, locate the minimum point of its AVC curve. That price is the shutdown price. For any price above it, the firm produces along its MC curve; for any price below, it produces zero.",
          "example": "A firm's AVC is minimized at $Q=50$ with $AVC = \\$8$. At $P = \\$8$, the firm is indifferent—loss equals fixed costs. At $P = \\$7$, the firm shuts down.",
          
          "image": {
            "src": "images/unit5/shutdown_point.png",
            "alt": "MC and AVC curves intersecting at minimum AVC, marked as shutdown point",
            "caption": "Figure 5.3.10: The shutdown point is where P = minimum AVC."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Profit and Loss",
          
          "image": {
            "src": "images/unit5/short_run_example1.png",
            "alt": "Table with cost data and price",
            "caption": "Figure 5.3.11: Calculate profit or loss for each scenario."
          },
          
          "problem": "A perfectly competitive firm has the following cost data at its profit-maximizing quantity:<br>Scenario A: Q=100, P=$\\$15$, ATC=$\\$12$, AVC=$\\$8$<br>Scenario B: Q=200, P=$\\$10$, ATC=$\\$12$, AVC=$\\$9$<br>Scenario C: Q=150, P=$\\$7$, ATC=$\\$10$, AVC=$\\$8$<br>Scenario D: Q=0, P=$\\$5$, ATC=$\\$?$, AVC=$\\$6$ (at min AVC)<br>For each scenario:<br>a) Calculate total revenue, total cost, and profit/loss.<br>b) Determine if the firm should operate or shut down.<br>c) Classify the situation (profit, loss-operating, loss-shutdown).",
          
          "step_by_step": [
            {
              "step": "Scenario A",
              "explanation": "$TR = 15 \\times 100 = 1500$. $TC = ATC \\times Q = 12 \\times 100 = 1200$. Profit = $1500 - 1200 = 300$. $P = 15 > AVC = 8$, so operate. Classification: Economic profit."
            },
            {
              "step": "Scenario B",
              "explanation": "$TR = 10 \\times 200 = 2000$. $TC = 12 \\times 200 = 2400$. Loss = $2000 - 2400 = -400$. $P = 10 > AVC = 9$, so operate despite loss. Classification: Economic loss (operating)."
            },
            {
              "step": "Scenario C",
              "explanation": "$TR = 7 \\times 150 = 1050$. $TC = 10 \\times 150 = 1500$. Loss = $1050 - 1500 = -450$. $P = 7 < AVC = 8$, so should shut down. If they produce, loss = $450$. If shut down, loss = fixed costs. Need FC: $TC = FC + VC$, $VC = AVC \\times Q = 8 \\times 150 = 1200$, so $FC = 1500 - 1200 = 300$. Shutdown loss = $300$ (better than $450$). Classification: Should shut down."
            },
            {
              "step": "Scenario D",
              "explanation": "At Q=0, the firm has already shut down. Loss = fixed costs. Need to find FC from scenario C? Not given directly. At minimum AVC, $P=5$ is below $AVC=6$, so definitely shut down."
            }
          ],
          
          "final_answer": "A: Profit $300$, operate, profit. B: Loss $400$, operate, loss-operating. C: Loss $450$ if operate, better to shut down (loss $300$), should shut down. D: Shut down.",
          "concept_applied": "Profit = $(P - ATC) \\times Q$. Operate if $P \\geq AVC$, shut down if $P < AVC$."
        },
        {
          "title": "Graphical Profit Analysis",
          
          "image": {
            "src": "images/unit5/short_run_example2.png",
            "alt": "Cost curves graph with three different price lines",
            "caption": "Figure 5.3.12: Identify profit/loss for each price."
          },
          
          "problem": "The graph shows a firm's MC, ATC, and AVC curves. Three possible prices are shown: $P_1$, $P_2$, and $P_3$.<br>a) At $P_1$, is the firm making profit, loss, or breaking even? Shade the area.<br>b) At $P_2$, is the firm making profit, loss, or breaking even? Shade the area.<br>c) At $P_3$, what should the firm do? Explain.<br>d) Label the shutdown point and break-even point on the graph.",
          
          "step_by_step": [
            {
              "step": "At $P_1$",
              "explanation": "$P_1$ is above ATC at the profit-maximizing quantity (where $P_1 = MC$). The firm earns economic profit. The profit rectangle is between $P_1$ and ATC over Q*."
            },
            {
              "step": "At $P_2$",
              "explanation": "$P_2$ is below ATC but above AVC at the profit-maximizing quantity. The firm incurs an economic loss but continues operating. The loss rectangle is between ATC and $P_2$ over Q*."
            },
            {
              "step": "At $P_3$",
              "explanation": "$P_3$ is below the minimum point of AVC. The firm should shut down and produce zero. Producing would increase losses above fixed costs."
            },
            {
              "step": "Label points",
              "explanation": "Shutdown point is where MC intersects AVC at its minimum. Break-even point is where MC intersects ATC at its minimum."
            }
          ],
          
          "final_answer": "a) Profit at $P_1$. b) Loss (operating) at $P_2$. c) Shut down at $P_3$. d) Shutdown at min AVC, break-even at min ATC.",
          "concept_applied": "Graphical analysis: P > ATC = profit, AVC < P < ATC = loss-operating, P < AVC = shutdown."
        },
        {
          "title": "Finding Break-Even and Shutdown Prices",
          
          "image": {
            "src": "images/unit5/short_run_example3.png",
            "alt": "Cost functions",
            "caption": "Figure 5.3.13: Calculate break-even and shutdown prices from cost functions."
          },
          
          "problem": "A perfectly competitive firm has the following cost functions:<br>$TC = 100 + 10Q + Q^2$<br>$MC = 10 + 2Q$<br>a) Derive the ATC and AVC functions.<br>b) Find the break-even price and quantity.<br>c) Find the shutdown price and quantity.<br>d) If market price is $\\$30$, what is the firm's profit-maximizing quantity and profit?",
          
          "step_by_step": [
            {
              "step": "Derive ATC and AVC",
              "explanation": "$ATC = TC/Q = 100/Q + 10 + Q$<br>$AVC = VC/Q = (10Q + Q^2)/Q = 10 + Q$"
            },
            {
              "step": "Find break-even",
              "explanation": "Break-even occurs where $P = min ATC$. Minimum ATC where derivative = 0: $d(ATC)/dQ = -100/Q^2 + 1 = 0$ → $100/Q^2 = 1$ → $Q^2 = 100$ → $Q = 10$. At Q=10, $ATC = 100/10 + 10 + 10 = 10 + 10 + 10 = 30$. Break-even price = $\\$30$."
            },
            {
              "step": "Find shutdown",
              "explanation": "Shutdown occurs where $P = min AVC$. Minimum AVC where derivative = 0: $d(AVC)/dQ = 1$, so AVC is always increasing? Wait, $AVC = 10 + Q$ is linear increasing, so minimum is at smallest Q. But in reality, AVC should be U-shaped. This is a limitation of the quadratic TC. For this function, AVC is minimized as Q approaches 0, with $AVC \\to 10$. So shutdown price approaches $\\$10$ from above. More precisely, shutdown point is where $P = MC = AVC$: $10 + 2Q = 10 + Q$ → $2Q = Q$ → $Q=0$. So shutdown price = $\\$10$ at Q=0."
            },
            {
              "step": "Price = $30$",
              "explanation": "Set $P = MC$: $30 = 10 + 2Q$ → $2Q = 20$ → $Q = 10$. At Q=10, $ATC = 30$, so $P = ATC$, profit = $0$. The firm breaks even."
            }
          ],
          
          "final_answer": "a) $ATC = 100/Q + 10 + Q$, $AVC = 10 + Q$. b) Break-even: $Q=10$, $P=30$. c) Shutdown: $Q \\to 0$, $P \\to 10$. d) At $P=30$, $Q=10$, profit = $0$.",
          "concept_applied": "Break-even at min ATC, shutdown at min AVC. For linear AVC, shutdown price is the intercept."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Find Profit-Maximizing Quantity",
          "description": "Determine where $P = MC$ on the rising portion of MC.",
          "mechanism": "Set $P = MC$ and solve for Q, or find intersection on graph.",
          "result": "$Q^*$.",
          
          "image": {
            "src": "images/unit5/short_step1.png",
            "alt": "Finding Q* from P = MC",
            "caption": "Figure 5.3.14: Step 1 - Find profit-maximizing quantity."
          }
        },
        {
          "step": 2,
          "process": "Check Shutdown Condition",
          "description": "Compare price to average variable cost at $Q^*$.",
          "mechanism": "If $P \\geq AVC$, proceed. If $P < AVC$, shut down (Q=0).",
          "result": "Decision to produce or shut down.",
          
          "image": {
            "src": "images/unit5/short_step2.png",
            "alt": "Comparing P to AVC",
            "caption": "Figure 5.3.15: Step 2 - Check if P ≥ AVC."
          }
        },
        {
          "step": 3,
          "process": "Find Average Total Cost",
          "description": "Determine $ATC$ at the profit-maximizing quantity.",
          "mechanism": "Read $ATC$ from graph or calculate from cost function at $Q^*$.",
          "result": "$ATC$ at $Q^*$.",
          
          "image": {
            "src": "images/unit5/short_step3.png",
            "alt": "Finding ATC at Q*",
            "caption": "Figure 5.3.16: Step 3 - Find ATC at Q*."
          }
        },
        {
          "step": 4,
          "process": "Compare P to ATC",
          "description": "Determine relationship between price and average total cost.",
          "mechanism": "If $P > ATC$ → profit. If $P = ATC$ → break-even. If $P < ATC$ → loss.",
          "result": "Profitability classification.",
          
          "image": {
            "src": "images/unit5/short_step4.png",
            "alt": "Comparing P to ATC",
            "caption": "Figure 5.3.17: Step 4 - Compare P to ATC."
          }
        },
        {
          "step": 5,
          "process": "Calculate Profit or Loss",
          "description": "Compute the dollar amount of profit or loss.",
          "mechanism": "Profit = $(P - ATC) \\times Q^*$ (negative for loss).",
          "result": "Profit/loss amount.",
          
          "image": {
            "src": "images/unit5/short_step5.png",
            "alt": "Calculating profit as (P - ATC) × Q",
            "caption": "Figure 5.3.18: Step 5 - Calculate profit or loss."
          }
        }
      ],

      "image": {
        "src": "images/unit5/short_run_summary.png",
        "alt": "Comprehensive summary: profit, loss-operating, shutdown, break-even with graphs and formulas",
        "caption": "Figure 5.3.19: Short-run profit and loss summary."
      }
    }
  ],

  "key_terms": [
    "Economic profit",
    "Economic loss",
    "Normal profit",
    "Break-even point",
    "Shutdown point",
    "Shutdown condition",
    "Operating at a loss",
    "Loss minimization",
    "Fixed costs",
    "Variable costs",
    "Average total cost (ATC)",
    "Average variable cost (AVC)",
    "Marginal cost (MC)",
    "Price taker",
    "Short run",
    "Profit rectangle",
    "Loss rectangle",
    "Produce or shut down",
    "Zero economic profit",
    "Opportunity cost"
  ],

  "summary": "In the short run, a perfectly competitive firm can experience economic profit, economic loss, or break even, depending on the relationship between market price and its cost curves. The firm first finds its profit-maximizing quantity where $P = MC$ (on the rising portion). It then compares $P$ to $ATC$ at that quantity: if $P > ATC$, the firm earns economic profit of $(P - ATC) \\times Q$; if $P = ATC$, it breaks even (zero economic profit); if $P < ATC$, it incurs economic loss. However, even with losses, the firm will continue operating in the short run as long as $P \\geq AVC$, because operating reduces losses below fixed costs. If $P < AVC$ at all quantities, the firm shuts down temporarily, producing zero and losing only fixed costs. The shutdown point is where $P = MC = AVC$ at the minimum of $AVC$; the break-even point is where $P = MC = ATC$ at the minimum of $ATC$. These short-run outcomes are not permanent—they trigger entry and exit that drive the market toward long-run equilibrium where all firms earn zero economic profit."
}
