{
  "expanded_description": "Markets are constantly changing. Incomes rise, technology improves, weather affects crops, and consumer tastes evolve. Each of these changes shifts either the demand curve or the supply curve, leading to a new equilibrium. Understanding how to analyze these changes—predicting the direction of price and quantity adjustments—is an essential skill in microeconomics. Sometimes only one curve shifts, making the outcome straightforward. Other times, both curves shift simultaneously, and the effect on price or quantity may be ambiguous. In this section, we'll develop a systematic approach to analyzing market changes, considering single shifts and simultaneous shifts, and learning to handle ambiguous cases.",
  
  "core_concept": {
    "principle": "Analyzing market changes involves predicting how equilibrium price and quantity respond to shifts in supply or demand. (1) Single shift rules: (a) Demand increase (shift right): Price ↑, Quantity ↑. (b) Demand decrease (shift left): Price ↓, Quantity ↓. (c) Supply increase (shift right): Price ↓, Quantity ↑. (d) Supply decrease (shift left): Price ↑, Quantity ↓. (2) Simultaneous shifts: When both curves shift, one outcome (price or quantity) may be ambiguous, depending on the relative magnitudes of the shifts. (3) Step-by-step approach: (a) Identify which curve(s) shift and direction. (b) Determine effect on equilibrium using graph. (c) For simultaneous shifts, consider whether effects on price or quantity reinforce or oppose. (d) If opposing, the net effect depends on which shift dominates. (4) Common shifters review: Demand shifters—income, prices of related goods, tastes, expectations, number of buyers. Supply shifters—input prices, technology, expectations, number of sellers, taxes/subsidies, natural conditions.",
    
    "explanation": "Think of market analysis like a detective solving a case. First, you identify what changed—did something affect consumers (demand) or producers (supply)? Then you determine which direction the curve shifted. Finally, you trace the effects to see how price and quantity move. When two things change at once, you need to figure out whether they push price in the same direction or opposite directions—like two forces pulling on a rope.",
    
    "image": {
      "src": "images/unit2/market_changes_overview.png",
      "alt": "Four panels showing effects of demand increase, demand decrease, supply increase, supply decrease on equilibrium",
      "caption": "Figure 2.5.1: Summary of how single shifts affect equilibrium price and quantity."
    }
  },

  "sections": [
    {
      "section_title": "2.5 Analyzing Market Changes",
      "introduction": "Markets are constantly changing. Incomes rise, technology improves, weather affects crops, and consumer tastes evolve. Each of these changes shifts either the demand curve or the supply curve, leading to a new equilibrium. Understanding how to analyze these changes—predicting the direction of price and quantity adjustments—is an essential skill in microeconomics. Sometimes only one curve shifts, making the outcome straightforward. Other times, both curves shift simultaneously, and the effect on price or quantity may be ambiguous. In this section, we'll develop a systematic approach to analyzing market changes, considering single shifts and simultaneous shifts, and learning to handle ambiguous cases.",
      
      "introduction_image": {
        "src": "images/unit2/market_changes_intro.png",
        "alt": "Before and after graphs showing shifting curves and new equilibria",
        "caption": "Figure 2.5.2: Market changes shift curves and create new equilibria."
      },
      
      "key_concept": {
        "definition": "Analyzing market changes involves predicting how equilibrium price and quantity respond to shifts in supply or demand. This process is called comparative statics—comparing the old and new equilibrium after a change. (1) Single shift rules: When only one curve shifts, the effects on price and quantity are unambiguous. (a) Demand increase (shift right): Price ↑, Quantity ↑. (b) Demand decrease (shift left): Price ↓, Quantity ↓. (c) Supply increase (shift right): Price ↓, Quantity ↑. (d) Supply decrease (shift left): Price ↑, Quantity ↓. (2) Simultaneous shifts: When both curves shift, one outcome may be ambiguous. (a) Demand ↑ and Supply ↑: Quantity ↑ (both increase Q), Price ambiguous (D↑ pushes P up, S↑ pushes P down). (b) Demand ↑ and Supply ↓: Price ↑ (both push P up), Quantity ambiguous. (c) Demand ↓ and Supply ↑: Price ↓ (both push P down), Quantity ambiguous. (d) Demand ↓ and Supply ↓: Quantity ↓ (both decrease Q), Price ambiguous. (3) Systematic approach: (a) Identify the event and which curve(s) it affects. (b) Determine direction of each shift. (c) Apply single-shift rules to each shift separately. (d) Combine effects—if effects on price reinforce, price change is determinate; if they oppose, price is ambiguous. Same for quantity. (e) If ambiguous, the actual outcome depends on which shift is larger or the elasticities of the curves. (4) Importance: This analysis is used constantly in economics to predict the effects of news, policy changes, and economic developments.",
        
        "context": "Analyzing market changes is the heart of applied microeconomics. It's how economists predict the effects of events—a new tax, a technological breakthrough, a change in consumer preferences. This analysis appears throughout the AP curriculum and is essential for understanding real-world markets. Mastering the systematic approach will serve you well in exams and in interpreting economic news.",
        
        "image": {
          "src": "images/unit2/market_changes_rules.png",
          "alt": "Table summarizing effects of single and simultaneous shifts on P and Q",
          "caption": "Figure 2.5.3: Summary of how shifts affect equilibrium price and quantity."
        }
      },

      "classifications": [
        {
          "type": "Demand Shift Only",
          "value": "Change in demand with supply constant",
          "characteristics": ["Curve shifts right or left", "Movement along supply", "P and Q move same direction", "Predictable outcome"],
          "behavior": "When only demand changes, both equilibrium price and quantity move in the same direction as the demand shift. An increase in demand (right shift) raises both price and quantity. A decrease in demand (left shift) lowers both. This is because the supply curve is upward-sloping—higher demand means buyers compete for goods, pushing up price, and producers respond by supplying more along their supply curve. The magnitude of changes depends on the slopes of the curves (elasticities), but the direction is unambiguous. This pattern holds for any demand shifter: income increases (normal goods), price of substitutes increases, price of complements decreases, favorable taste changes, population growth, or expectations of future price increases.",
          
          "image": {
            "src": "images/unit2/demand_shift_only.png",
            "alt": "Two graphs: demand increase (right) with P↑ Q↑, demand decrease (left) with P↓ Q↓",
            "caption": "Figure 2.5.4: Demand shifts cause P and Q to move in same direction."
          },
          
          "examples": [
            {
              "process": "Health study increases demand for blueberries",
              "explanation": "News that blueberries improve health shifts demand right. Price rises, quantity rises as farmers supply more along their supply curve."
            },
            {
              "process": "Recession reduces demand for cars",
              "explanation": "Income falls (normal good), demand shifts left. Price falls, quantity falls as manufacturers reduce production."
            }
          ]
        },
        {
          "type": "Supply Shift Only",
          "value": "Change in supply with demand constant",
          "characteristics": ["Curve shifts right or left", "Movement along demand", "P and Q move opposite directions", "Predictable outcome"],
          "behavior": "When only supply changes, price and quantity move in opposite directions. An increase in supply (right shift) lowers price and increases quantity. A decrease in supply (left shift) raises price and decreases quantity. This is because the demand curve is downward-sloping—more supply means sellers compete for buyers, pushing price down, and buyers respond by purchasing more along their demand curve. The direction is unambiguous, though magnitude varies. This pattern holds for any supply shifter: lower input prices, technological progress, more sellers, favorable natural conditions, subsidies, or expectations of lower future prices (which increase current supply).",
          
          "image": {
            "src": "images/unit2/supply_shift_only.png",
            "alt": "Two graphs: supply increase (right) with P↓ Q↑, supply decrease (left) with P↑ Q↓",
            "caption": "Figure 2.5.5: Supply shifts cause P and Q to move in opposite directions."
          },
          
          "examples": [
            {
              "process": "New technology reduces solar panel costs",
              "explanation": "Supply shifts right. Price of solar panels falls, quantity installed increases."
            },
            {
              "process": "Hurricane destroys orange crops",
              "explanation": "Supply shifts left. Price of oranges rises, quantity sold falls."
            }
          ]
        },
        {
          "type": "Simultaneous Shifts: Demand and Supply Increase",
          "value": "Both curves shift right",
          "characteristics": ["D↑ → P↑ Q↑", "S↑ → P↓ Q↑", "Q definitely ↑", "P ambiguous", "Net P depends on relative shifts"],
          "behavior": "When both demand and supply increase (shift right), quantity definitely increases because both shifts push quantity up. Price, however, is ambiguous: demand increase pushes price up, while supply increase pushes price down. The net effect on price depends on which shift is larger. If demand shifts more than supply, price will rise. If supply shifts more than demand, price will fall. If they shift by exactly the right amounts, price could stay the same. This is a common real-world scenario—for example, in markets for technology products where incomes rise (demand ↑) and technology improves (supply ↑). Whether prices rise or fall depends on which force dominates.",
          
          "image": {
            "src": "images/unit2/both_increase.png",
            "alt": "Graph showing both curves shifting right, with quantity definitely up and price ambiguous",
            "caption": "Figure 2.5.6: Demand ↑ and Supply ↑ → Quantity ↑, Price ambiguous."
          },
          
          "examples": [
            {
              "process": "Smartphone market",
              "explanation": "Incomes rise (demand ↑) and technology improves (supply ↑). Quantity of smartphones definitely increases. Whether prices rise or fall depends on whether demand growth outpaces supply growth—in reality, smartphone prices have often fallen while quality improved."
            },
            {
              "process": "Electric vehicles",
              "explanation": "Environmental concerns increase demand (D↑) while battery technology improves (S↑). Quantity of EVs increases. Price direction depends on which effect dominates."
            }
          ]
        },
        {
          "type": "Simultaneous Shifts: Demand Increase, Supply Decrease",
          "value": "Demand right, supply left",
          "characteristics": ["D↑ → P↑ Q↑", "S↓ → P↑ Q↓", "P definitely ↑", "Q ambiguous", "Net Q depends on relative shifts"],
          "behavior": "When demand increases (right) and supply decreases (left), price definitely increases because both shifts push price up. Quantity, however, is ambiguous: demand increase pushes quantity up, while supply decrease pushes quantity down. The net effect on quantity depends on which shift is larger. If demand shifts more than supply, quantity will rise. If supply shifts more than demand, quantity will fall. This scenario often occurs when there's increased demand for a product facing supply constraints—like housing in a growing city with construction difficulties, or a popular product with production problems.",
          
          "image": {
            "src": "images/unit2/demand_up_supply_down.png",
            "alt": "Graph showing demand right, supply left, with price definitely up and quantity ambiguous",
            "caption": "Figure 2.5.7: Demand ↑ and Supply ↓ → Price ↑, Quantity ambiguous."
          },
          
          "examples": [
            {
              "process": "Housing market in growing city",
              "explanation": "Population increases (D↑) but construction costs rise (S↓). Price definitely rises. Quantity could rise, fall, or stay same depending on which effect dominates."
            },
            {
              "process": "Popular toy with supply shortage",
              "explanation": "Holiday season increases demand (D↑) while factory problems reduce supply (S↓). Price definitely rises. Quantity change depends on relative magnitudes."
            }
          ]
        },
        {
          "type": "Simultaneous Shifts: Demand Decrease, Supply Increase",
          "value": "Demand left, supply right",
          "characteristics": ["D↓ → P↓ Q↓", "S↑ → P↓ Q↑", "P definitely ↓", "Q ambiguous", "Net Q depends on relative shifts"],
          "behavior": "When demand decreases (left) and supply increases (right), price definitely decreases because both shifts push price down. Quantity, however, is ambiguous: demand decrease pushes quantity down, while supply increase pushes quantity up. The net effect on quantity depends on which shift is larger. If demand shifts more than supply, quantity will fall. If supply shifts more than demand, quantity will rise. This scenario might occur when a product falls out of fashion (demand ↓) but production technology improves (supply ↑).",
          
          "image": {
            "src": "images/unit2/demand_down_supply_up.png",
            "alt": "Graph showing demand left, supply right, with price definitely down and quantity ambiguous",
            "caption": "Figure 2.5.8: Demand ↓ and Supply ↑ → Price ↓, Quantity ambiguous."
          },
          
          "examples": [
            {
              "process": "DVD market",
              "explanation": "Streaming services reduce demand for DVDs (D↓) while manufacturing technology improves (S↑). Price definitely falls. Whether quantity falls or rises depends on relative shifts—in reality, DVD quantity has plummeted as demand drop dominated."
            },
            {
              "process": "Typewriter market",
              "explanation": "Computers reduce demand for typewriters (D↓) while production technology improves (S↑). Price falls. Quantity direction depends on which effect dominates."
            }
          ]
        },
        {
          "type": "Simultaneous Shifts: Demand and Supply Decrease",
          "value": "Both curves shift left",
          "characteristics": ["D↓ → P↓ Q↓", "S↓ → P↑ Q↓", "Q definitely ↓", "P ambiguous", "Net P depends on relative shifts"],
          "behavior": "When both demand and supply decrease (shift left), quantity definitely decreases because both shifts push quantity down. Price, however, is ambiguous: demand decrease pushes price down, while supply decrease pushes price up. The net effect on price depends on which shift is larger. If demand shifts more than supply, price will fall. If supply shifts more than demand, price will rise. This scenario might occur during a recession that reduces both consumer demand and producer capacity, or when a product becomes less popular while its production becomes more difficult.",
          
          "image": {
            "src": "images/unit2/both_decrease.png",
            "alt": "Graph showing both curves shifting left, with quantity definitely down and price ambiguous",
            "caption": "Figure 2.5.9: Demand ↓ and Supply ↓ → Quantity ↓, Price ambiguous."
          },
          
          "examples": [
            {
              "process": "Recession impact on luxury goods",
              "explanation": "Incomes fall (D↓) and some producers go out of business (S↓). Quantity definitely falls. Whether price rises or falls depends on which effect dominates."
            },
            {
              "process": "Fishery with overfishing",
              "explanation": "Consumer interest declines (D↓) and fish stocks are depleted (S↓). Quantity falls. Price direction depends on relative shifts."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Systematic Approach: Determine Which Curves Shift and How",
          "statement": "To analyze any market change, follow a systematic process: (1) Identify the event and which curve(s) it affects. Is it a demand shifter (income, related goods prices, tastes, expectations, number of buyers) or a supply shifter (input prices, technology, expectations, number of sellers, taxes, natural conditions)? (2) Determine the direction of the shift (right for increase, left for decrease). (3) Draw or visualize the shift and find the new equilibrium. (4) Compare new equilibrium to old to determine changes in price and quantity. (5) If both curves shift, determine which effects on price and quantity reinforce or oppose. For opposing effects, note ambiguity. This systematic approach prevents errors and provides a clear framework for answering exam questions and real-world analysis.",
          "application": "When given a market scenario, always ask: Which curve shifts? Which direction? Then apply the rules. Write out your reasoning step by step. For ambiguous cases, explain that the outcome depends on relative magnitudes.",
          "example": "Event: 'A drought reduces wheat harvest, and simultaneously, a new health study praises wheat's benefits.' Drought affects supply (left shift). Health study affects demand (right shift). Price definitely rises (both push price up). Quantity ambiguous—drought reduces Q, health study increases Q. Need more info to determine quantity direction.",
          
          "image": {
            "src": "images/unit2/systematic_approach.png",
            "alt": "Flowchart: Event → Which curve? → Direction → New equilibrium → Compare",
            "caption": "Figure 2.5.10: Systematic approach to analyzing market changes."
          }
        },
        {
          "principle": "Use Graphs to Visualize Changes",
          "statement": "Graphs are powerful tools for analyzing market changes. Drawing supply and demand diagrams helps visualize shifts and see the effects on price and quantity. Even a quick sketch can clarify whether price rises or falls, and whether quantity increases or decreases. For simultaneous shifts, graphs make it clear why one outcome is ambiguous—you can see the two opposing forces. When practicing, draw the original equilibrium, then draw the new curve(s) with arrows showing shifts. Label old and new equilibrium points. This visual approach reinforces understanding and is essential for exam success (many AP questions include graphs or require you to draw them).",
          "application": "On exams and in practice, always sketch a graph when analyzing market changes. Label axes, original curves, shift directions, and new equilibrium. This makes your reasoning clear and helps catch errors.",
          "example": "For an increase in demand, draw original D and S, then D2 to the right. New intersection is higher price and higher quantity. For simultaneous shifts, draw both new curves and note the range of possible new equilibria.",
          
          "image": {
            "src": "images/unit2/visualize_changes.png",
            "alt": "Step-by-step graph drawing: original, shift, new equilibrium",
            "caption": "Figure 2.5.11: Use graphs to visualize and analyze market changes."
          }
        },
        {
          "principle": "When Both Curves Shift, One Outcome Is Ambiguous",
          "statement": "A common exam question involves simultaneous shifts. The key insight is that when both curves shift in directions that have opposing effects on either price or quantity, that variable becomes ambiguous—it could increase, decrease, or stay the same depending on the relative sizes of the shifts. For example, if demand increases (pushes price up) and supply increases (pushes price down), the net effect on price is ambiguous. To determine the actual outcome, you need additional information: which shift was larger? how elastic are the curves? In multiple-choice questions, the correct answer often is 'price may increase, decrease, or stay the same' or 'quantity definitely increases but price is ambiguous.' Understanding which outcomes are determinate and which are ambiguous is crucial for correct analysis.",
          "application": "When analyzing simultaneous shifts, first determine which variable (P or Q) has reinforcing effects—that one is determinate. The other variable, with opposing effects, is ambiguous. State clearly that it depends on the relative magnitudes of the shifts.",
          "example": "Demand increases (P↑ Q↑) and supply decreases (P↑ Q↓). Price effects reinforce (both up) so P definitely rises. Quantity effects oppose, so Q is ambiguous. Without knowing which shift dominates, we cannot say whether Q rises or falls.",
          
          "image": {
            "src": "images/unit2/ambiguous.png",
            "alt": "Table showing four combinations of shifts and which outcomes are determinate vs ambiguous",
            "caption": "Figure 2.5.12: With simultaneous shifts, one outcome is determinate, the other ambiguous."
          }
        },
        {
          "principle": "The Magnitude of Shifts Determines Ambiguous Outcomes",
          "statement": "When simultaneous shifts create an ambiguous effect on price or quantity, the actual outcome depends on the relative magnitudes of the shifts. A larger shift in one direction will dominate the smaller shift in the opposite direction. For example, with demand increase and supply increase, if demand shifts right by a lot and supply shifts right by a little, price will rise. If supply shifts right by a lot and demand shifts right by a little, price will fall. If they shift by exactly the right amounts, price could stay the same. The same logic applies to other combinations. In real-world analysis, economists estimate the sizes of shifts using data and elasticities to determine the net effect. For exam purposes, you need to recognize when an outcome is ambiguous and explain that it depends on which shift is larger.",
          "application": "When explaining ambiguous outcomes, say: 'The effect on price depends on whether the demand shift or supply shift is larger. If demand shift dominates, price will rise; if supply shift dominates, price will fall; if they are equal, price may stay the same.'",
          "example": "In the smartphone market, both demand and supply have increased over time. The fact that prices have generally fallen suggests that supply increases have dominated demand increases—technology improvements outpaced income growth.",
          
          "image": {
            "src": "images/unit2/magnitude.png",
            "alt": "Two graphs showing same shifts but different magnitudes leading to different price outcomes",
            "caption": "Figure 2.5.13: The magnitude of shifts determines the direction of ambiguous outcomes."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Single Shift Analysis",
          
          "image": {
            "src": "images/unit2/market_example1.png",
            "alt": "List of events",
            "caption": "Figure 2.5.14: Analyze each event's effect on equilibrium P and Q."
          },
          
          "problem": "For each event, determine the effect on equilibrium price and quantity in the specified market:<br>a) Coffee market: Price of tea increases sharply.<br>b) New car market: Automobile workers' wages increase.<br>c) Air travel market: Fuel prices decrease.<br>d) Movie tickets market: Streaming services become more popular.<br>e) Housing market: Population of the city increases.",
          
          "step_by_step": [
            {
              "step": "Event a",
              "explanation": "Tea is a substitute for coffee. Tea price ↑ increases demand for coffee (shift right). Supply unchanged. Result: P ↑, Q ↑."
            },
            {
              "step": "Event b",
              "explanation": "Wages are an input price increase. This decreases supply of cars (shift left). Demand unchanged. Result: P ↑, Q ↓."
            },
            {
              "step": "Event c",
              "explanation": "Fuel is an input for air travel. Fuel price ↓ decreases costs, increasing supply (shift right). Demand unchanged. Result: P ↓, Q ↑."
            },
            {
              "step": "Event d",
              "explanation": "Streaming is a substitute for movies. Increased popularity reduces demand for movie tickets (shift left). Supply unchanged. Result: P ↓, Q ↓."
            },
            {
              "step": "Event e",
              "explanation": "Population increase means more buyers, increasing demand for housing (shift right). Supply unchanged (in short run). Result: P ↑, Q ↑."
            }
          ],
          
          "final_answer": "a) P↑ Q↑. b) P↑ Q↓. c) P↓ Q↑. d) P↓ Q↓. e) P↑ Q↑.",
          "concept_applied": "Single shifts have predictable effects: D shifts move P and Q same direction; S shifts move them opposite."
        },
        {
          "title": "Simultaneous Shifts Analysis",
          
          "image": {
            "src": "images/unit2/market_example2.png",
            "alt": "Events with multiple changes",
            "caption": "Figure 2.5.15: Analyze simultaneous shift effects."
          },
          
          "problem": "For each scenario, determine the effects on equilibrium price and quantity (↑, ↓, or ambiguous):<br>a) Smartphone market: Technology improves (S↑) and consumer incomes rise (D↑, normal good).<br>b) Beef market: Price of cattle feed increases (S↓) and price of chicken (substitute) increases (D↑).<br>c) Apartment market: New construction increases supply (S↑) and population decreases (D↓).<br>d) Gasoline market: Oil prices rise (S↓) and people buy more fuel-efficient cars (D↓).<br>e) Coffee market: Frost destroys crops (S↓) and a new study says coffee causes health problems (D↓).<br>f) Streaming services: New technology reduces bandwidth costs (S↑) and more people cut cable (D↑).",
          
          "step_by_step": [
            {
              "step": "Scenario a",
              "explanation": "S↑ → P↓ Q↑; D↑ → P↑ Q↑. Q effects reinforce (both ↑), so Q definitely ↑. P effects oppose (↑ and ↓), so P ambiguous."
            },
            {
              "step": "Scenario b",
              "explanation": "S↓ → P↑ Q↓; D↑ → P↑ Q↑. P effects reinforce (both ↑), so P definitely ↑. Q effects oppose (↓ and ↑), so Q ambiguous."
            },
            {
              "step": "Scenario c",
              "explanation": "S↑ → P↓ Q↑; D↓ → P↓ Q↓. P effects reinforce (both ↓), so P definitely ↓. Q effects oppose (↑ and ↓), so Q ambiguous."
            },
            {
              "step": "Scenario d",
              "explanation": "S↓ → P↑ Q↓; D↓ → P↓ Q↓. Q effects reinforce (both ↓), so Q definitely ↓. P effects oppose (↑ and ↓), so P ambiguous."
            },
            {
              "step": "Scenario e",
              "explanation": "S↓ → P↑ Q↓; D↓ → P↓ Q↓. Q effects reinforce (both ↓), so Q definitely ↓. P effects oppose (↑ and ↓), so P ambiguous."
            },
            {
              "step": "Scenario f",
              "explanation": "S↑ → P↓ Q↑; D↑ → P↑ Q↑. Q effects reinforce (both ↑), so Q definitely ↑. P effects oppose (↓ and ↑), so P ambiguous."
            }
          ],
          
          "final_answer": "a) P ambiguous, Q↑. b) P↑, Q ambiguous. c) P↓, Q ambiguous. d) P ambiguous, Q↓. e) P ambiguous, Q↓. f) P ambiguous, Q↑.",
          "concept_applied": "With simultaneous shifts, one variable is determinate (reinforcing effects), the other ambiguous (opposing effects)."
        },
        {
          "title": "Graphical Analysis of Simultaneous Shifts",
          
          "image": {
            "src": "images/unit2/market_example3.png",
            "alt": "Blank supply and demand axes",
            "caption": "Figure 2.5.16: Draw graphs showing how different magnitudes affect ambiguous outcomes."
          },
          
          "problem": "For scenario a from the previous problem (smartphones: S↑ and D↑), draw two graphs showing how the ambiguous price outcome depends on the relative sizes of the shifts. In the first graph, show the demand shift larger than the supply shift. In the second graph, show the supply shift larger than the demand shift. Label all curves and equilibrium points.",
          
          "step_by_step": [
            {
              "step": "Draw original equilibrium",
              "explanation": "Draw initial demand D and supply S intersecting at E0 with price P0 and quantity Q0."
            },
            {
              "step": "Graph 1 - Demand shift larger",
              "explanation": "Shift demand right to D2 (large shift). Shift supply right to S2 (small shift). New equilibrium E1 has higher price (P1 > P0) and higher quantity (Q1 > Q0)."
            },
            {
              "step": "Graph 2 - Supply shift larger",
              "explanation": "Shift demand right to D2 (small shift). Shift supply right to S2 (large shift). New equilibrium E2 has lower price (P2 < P0) and higher quantity (Q2 > Q0)."
            },
            {
              "step": "Label clearly",
              "explanation": "Label all curves: D, S, D2, S2. Label original equilibrium E0 and new equilibria E1 and E2. Show price and quantity axes."
            }
          ],
          
          "final_answer": "Graphs should show that with demand shift larger, price rises; with supply shift larger, price falls. Quantity rises in both cases, confirming Q is determinate (↑) while P is ambiguous.",
          "concept_applied": "Graphs make it clear why one outcome is ambiguous—the new equilibrium can be at different price levels depending on shift magnitudes."
        },
        {
          "title": "Real-World Application: Housing Market",
          
          "image": {
            "src": "images/unit2/market_example4.png",
            "alt": "Housing market scenario",
            "caption": "Figure 2.5.17: Analyze a real-world housing market scenario."
          },
          
          "problem": "A city experiences two simultaneous changes: (1) Population increases due to new jobs (demand shift). (2) Construction costs rise due to higher lumber prices (supply shift).<br>a) Which curve shifts and in what direction for each change?<br>b) What is the effect on equilibrium price? Determinant?<br>c) What is the effect on equilibrium quantity? Determinant or ambiguous?<br>d) If the population increase is large but the construction cost increase is small, what happens to price and quantity?<br>e) If the population increase is small but the construction cost increase is large, what happens?",
          
          "step_by_step": [
            {
              "step": "Identify shifts",
              "explanation": "Population increase shifts demand right (D↑). Higher construction costs shift supply left (S↓)."
            },
            {
              "step": "Effect on price",
              "explanation": "D↑ pushes price up. S↓ pushes price up. Effects reinforce, so price definitely increases. P ↑ is determinate."
            },
            {
              "step": "Effect on quantity",
              "explanation": "D↑ pushes quantity up. S↓ pushes quantity down. Effects oppose, so quantity is ambiguous."
            },
            {
              "step": "Large population increase, small cost increase",
              "explanation": "Demand shift dominates. Price rises significantly. Quantity increases because demand effect outweighs supply effect."
            },
            {
              "step": "Small population increase, large cost increase",
              "explanation": "Supply shift dominates. Price rises significantly. Quantity decreases because supply effect outweighs demand effect."
            }
          ],
          
          "final_answer": "a) D↑ (right), S↓ (left). b) P definitely ↑. c) Q ambiguous. d) P↑, Q↑ (demand dominates). e) P↑, Q↓ (supply dominates).",
          "concept_applied": "Real-world analysis requires considering both the direction and magnitude of shifts. Price is determinate (up), quantity depends on which effect dominates."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Event(s)",
          "description": "Clearly state what is changing in the market.",
          "mechanism": "Read scenario carefully. List all factors that might affect demand or supply.",
          "result": "Clear list of changes.",
          
          "image": {
            "src": "images/unit2/market_step1.png",
            "alt": "Magnifying glass over event description",
            "caption": "Figure 2.5.18: Step 1 - Identify all events affecting the market."
          }
        },
        {
          "step": 2,
          "process": "Determine Which Curve(s) Shift",
          "description": "For each event, decide whether it affects demand or supply.",
          "mechanism": "Use determinants of demand (income, related goods, tastes, expectations, buyers) and supply (input prices, technology, expectations, sellers, taxes, natural conditions).",
          "result": "Identification of affected curves.",
          
          "image": {
            "src": "images/unit2/market_step2.png",
            "alt": "Decision tree: Demand shifter? Supply shifter?",
            "caption": "Figure 2.5.19: Step 2 - Determine which curve(s) shift."
          }
        },
        {
          "step": 3,
          "process": "Determine Direction of Each Shift",
          "description": "For each shifting curve, decide whether it shifts right (increase) or left (decrease).",
          "mechanism": "Apply logic: income ↑ for normal good → D right. Input price ↑ → S left. Technology ↑ → S right. Etc.",
          "result": "Shift directions.",
          
          "image": {
            "src": "images/unit2/market_step3.png",
            "alt": "Arrows showing right or left shifts",
            "caption": "Figure 2.5.20: Step 3 - Determine direction of each shift."
          }
        },
        {
          "step": 4,
          "process": "Analyze Effects on P and Q",
          "description": "Combine shift effects to determine changes in equilibrium price and quantity.",
          "mechanism": "If one curve shifts, apply single-shift rules. If both shift, determine reinforcing and opposing effects. For opposing effects, outcome is ambiguous.",
          "result": "Predicted changes (↑, ↓, or ambiguous) for P and Q.",
          
          "image": {
            "src": "images/unit2/market_step4.png",
            "alt": "Combining effects with plus and minus signs",
            "caption": "Figure 2.5.21: Step 4 - Combine effects to determine P and Q changes."
          }
        },
        {
          "step": 5,
          "process": "Draw Graph to Verify",
          "description": "Sketch supply-demand diagram to visualize results.",
          "mechanism": "Draw original curves, shifted curves, new equilibria. Confirm verbal analysis. For ambiguous cases, show range of possibilities.",
          "result": "Visual confirmation and deeper understanding.",
          
          "image": {
            "src": "images/unit2/market_step5.png",
            "alt": "Graph with original and shifted curves",
            "caption": "Figure 2.5.22: Step 5 - Draw graph to verify analysis."
          }
        }
      ],

      "image": {
        "src": "images/unit2/market_changes_comprehensive.png",
        "alt": "Comprehensive summary: single shift rules, simultaneous shift table, systematic approach flowchart",
        "caption": "Figure 2.5.23: Market changes analysis - complete summary."
      }
    }
  ],

  "key_terms": [
    "Comparative statics",
    "Demand shift",
    "Supply shift",
    "Simultaneous shifts",
    "Ambiguous outcome",
    "Determinate outcome",
    "Reinforcing effects",
    "Opposing effects",
    "Magnitude of shift",
    "Demand increase",
    "Demand decrease",
    "Supply increase",
    "Supply decrease",
    "Market analysis",
    "Equilibrium change",
    "Price change",
    "Quantity change",
    "Shift dominance",
    "Relative shifts",
    "Demand shifter",
    "Supply shifter",
    "Ceteris paribus",
    "Systematic approach",
    "Graphical analysis",
    "Before and after analysis"
  ],

  "summary": "Analyzing market changes involves predicting how equilibrium price and quantity respond to shifts in supply or demand. Single shifts have unambiguous effects: demand increases raise both price and quantity; demand decreases lower both; supply increases lower price and raise quantity; supply decreases raise price and lower quantity. When both curves shift simultaneously, one outcome becomes ambiguous. With demand and supply both increasing, quantity definitely rises but price is ambiguous. With demand increasing and supply decreasing, price definitely rises but quantity is ambiguous. With demand decreasing and supply increasing, price definitely falls but quantity is ambiguous. With both decreasing, quantity definitely falls but price is ambiguous. The ambiguous outcome depends on the relative magnitudes of the shifts—the larger shift dominates. A systematic approach helps: identify events, determine which curves shift and in what direction, combine effects, and graph to verify. This analysis is essential for understanding real-world market responses to economic changes, policy interventions, and news events."
}
