{
  "expanded_description": "What happens when a market is not in equilibrium? Sometimes prices are temporarily out of balance; other times, government policies like price ceilings and price floors prevent prices from reaching equilibrium. In these situations, we observe shortages or surpluses that persist, leading to queues, black markets, or unsold goods. Understanding disequilibrium helps explain many real-world phenomena—from rent-controlled apartments with waiting lists to agricultural price supports creating government stockpiles. In this section, we'll explore shortages and surpluses, how markets naturally adjust toward equilibrium, and what happens when prices are prevented from adjusting.",
  
  "core_concept": {
    "principle": "Disequilibrium occurs when quantity demanded does not equal quantity supplied at the current price. This creates either a shortage or a surplus. (1) Shortage (excess demand): Occurs when price is below equilibrium. Qd > Qs. Some buyers cannot find the good. Characteristics: long lines, waiting lists, black markets, non-price rationing. (2) Surplus (excess supply): Occurs when price is above equilibrium. Qs > Qd. Sellers cannot sell all they produce. Characteristics: unsold inventory, price cutting, reduced production. (3) Market adjustment: In free markets, shortages push prices up, surpluses push prices down, moving toward equilibrium. (4) Price controls: Government-imposed maximum prices (price ceilings) or minimum prices (price floors) can prevent adjustment to equilibrium, causing persistent shortages or surpluses.",
    
    "explanation": "Imagine a popular concert where tickets are sold at a fixed price below what fans would pay. The result? Long lines, scalpers, and many disappointed fans—a classic shortage. Now imagine a farmer growing crops at a government-guaranteed price above what consumers will pay. The result? Unsold crops piling up in storage—a classic surplus. Both are examples of disequilibrium caused by prices that don't reflect true market conditions.",
    
    "image": {
      "src": "images/unit2/disequilibrium_overview.png",
      "alt": "Long line of customers outside a store (shortage) and farmers with unsold crops (surplus)",
      "caption": "Figure 2.4.1: Disequilibrium creates shortages (long lines) or surpluses (unsold goods)."
    }
  },

  "sections": [
    {
      "section_title": "2.4 Disequilibrium Analysis",
      "introduction": "What happens when a market is not in equilibrium? Sometimes prices are temporarily out of balance; other times, government policies like price ceilings and price floors prevent prices from reaching equilibrium. In these situations, we observe shortages or surpluses that persist, leading to queues, black markets, or unsold goods. Understanding disequilibrium helps explain many real-world phenomena—from rent-controlled apartments with waiting lists to agricultural price supports creating government stockpiles. In this section, we'll explore shortages and surpluses, how markets naturally adjust toward equilibrium, and what happens when prices are prevented from adjusting.",
      
      "introduction_image": {
        "src": "images/unit2/disequilibrium_intro.png",
        "alt": "Side-by-side images: long line of renters at an apartment building (shortage) and field of unsold crops (surplus)",
        "caption": "Figure 2.4.2: Disequilibrium appears as shortages or surpluses in real markets."
      },
      
      "key_concept": {
        "definition": "Disequilibrium is a situation where quantity demanded does not equal quantity supplied at the current price. This creates either a shortage or a surplus. (1) Shortage (excess demand): Occurs when price is below equilibrium. Qd > Qs. Some buyers cannot find the good. Characteristics: long lines, waiting lists, black markets, non-price rationing (first-come first-served, seller preferences, coupons). (2) Surplus (excess supply): Occurs when price is above equilibrium. Qs > Qd. Sellers cannot sell all they produce. Characteristics: unsold inventory, price cutting, reduced production, layoffs. (3) Market adjustment: In free markets, shortages push prices up, surpluses push prices down, moving toward equilibrium. (4) Price controls: Government-imposed maximum prices (price ceilings) or minimum prices (price floors) can prevent adjustment to equilibrium, causing persistent shortages or surpluses. (5) Price ceiling: A legal maximum price. If set below equilibrium, creates persistent shortage. Examples: rent control, price controls on gasoline. Consequences: reduced quantity supplied, increased quantity demanded, shortage, non-price rationing, black markets, reduced quality. (6) Price floor: A legal minimum price. If set above equilibrium, creates persistent surplus. Examples: minimum wage, agricultural price supports. Consequences: increased quantity supplied, reduced quantity demanded, surplus, government may need to buy excess, waste, inefficiency.",
        
        "context": "Disequilibrium analysis became particularly important during the 1970s when price controls were common, and during agricultural policy debates. The concepts of shortages and surpluses are intuitive but have subtle implications for efficiency and equity. Price controls often create unintended consequences—helping some but hurting others, and always creating inefficiency. Understanding disequilibrium helps evaluate policies and predict their side effects.",
        
        "image": {
          "src": "images/unit2/disequilibrium_graph.png",
          "alt": "Supply and demand graph showing shortage (gap where Qd > Qs at low price) and surplus (gap where Qs > Qd at high price)",
          "caption": "Figure 2.4.3: Shortage occurs below equilibrium; surplus above equilibrium."
        }
      },

      "classifications": [
        {
          "type": "Shortage (Excess Demand)",
          "value": "Quantity demanded exceeds quantity supplied",
          "characteristics": ["Price below equilibrium", "Qd > Qs", "Long lines", "Waiting lists", "Sellers ration", "Black markets possible", "Upward price pressure"],
          "behavior": "A shortage occurs when price is too low, causing consumers to want more than producers are willing to supply. In a free market, the shortage would be temporary—prices would rise, eliminating it. But if prices are prevented from rising (by price ceiling or sticky prices), the shortage persists. Persistent shortages lead to non-price rationing: who gets the limited goods? Methods include first-come, first-served (lines); seller preferences (discrimination); coupons or rationing systems; or black markets where goods sell at illegal higher prices. Shortages also reduce quality as sellers have no incentive to maintain standards when goods are scarce. The economic inefficiency is that some buyers who value the good more than its cost cannot get it, while others who value it less (but got in line first) do get it.",
          
          "image": {
            "src": "images/unit2/shortage.png",
            "alt": "Graph showing shortage area between demand and supply below equilibrium price",
            "caption": "Figure 2.4.4: Shortage occurs when price is below equilibrium—Qd exceeds Qs."
          },
          
          "examples": [
            {
              "process": "Rent control",
              "explanation": "In cities with rent control (price ceiling on apartments), below-equilibrium rents create housing shortages. Waiting lists, lotteries, and discrimination by landlords replace price rationing. Some people can't find apartments despite willingness to pay."
            },
            {
              "process": "1970s gasoline price controls",
              "explanation": "U.S. price controls on gasoline in the 1970s created long lines at gas stations. Drivers waited hours for fuel because price was below equilibrium, preventing market from clearing."
            },
            {
              "process": "Ticket scalping",
              "explanation": "When concert tickets are sold at below-equilibrium prices, shortages occur. Scalpers buy tickets and resell at higher prices—a black market response to the shortage."
            }
          ]
        },
        {
          "type": "Surplus (Excess Supply)",
          "value": "Quantity supplied exceeds quantity demanded",
          "characteristics": ["Price above equilibrium", "Qs > Qd", "Unsold inventory", "Price cutting", "Reduced production", "Downward price pressure", "Government may buy excess"],
          "behavior": "A surplus occurs when price is too high, causing producers to supply more than consumers are willing to buy. In free markets, surpluses are temporary—prices fall, eliminating them. But if prices are prevented from falling (by price floor or sticky prices), the surplus persists. Persistent surpluses lead to unsold goods, inventory accumulation, and pressure to cut production and lay off workers. For agricultural price supports, governments often buy the surplus to maintain prices, leading to stockpiles (butter mountains, wine lakes) and waste. Surpluses are inefficient because resources are used to produce goods that people don't value enough to buy at the supported price. The goods may eventually be destroyed, sold at a loss, or given away.",
          
          "image": {
            "src": "images/unit2/surplus.png",
            "alt": "Graph showing surplus area between supply and demand above equilibrium price",
            "caption": "Figure 2.4.5: Surplus occurs when price is above equilibrium—Qs exceeds Qd."
          },
          
          "examples": [
            {
              "process": "Agricultural price supports",
              "explanation": "The U.S. and EU have historically supported farm prices above equilibrium. This creates surpluses of crops like wheat and dairy, which governments sometimes buy and store, leading to massive stockpiles."
            },
            {
              "process": "Minimum wage",
              "explanation": "A minimum wage above equilibrium creates a surplus of labor—unemployment. More workers want jobs at the higher wage than firms want to hire, leading to job seekers unable to find work."
            },
            {
              "process": "Airline overcapacity",
              "explanation": "If airlines add too many flights (supply) relative to demand at current prices, they face surplus seats and must offer discounts to fill planes."
            }
          ]
        },
        {
          "type": "Price Ceiling",
          "value": "Legal maximum price",
          "characteristics": ["Government-imposed", "Maximum price", "If below equilibrium → shortage", "Non-price rationing", "Black markets", "Reduced quality"],
          "behavior": "A price ceiling is a legal maximum price that can be charged. To be binding (affect the market), it must be set below the equilibrium price. Binding price ceilings create persistent shortages because price cannot rise to eliminate excess demand. Consequences include: (1) Reduced quantity supplied: producers supply less at the lower price. (2) Increased quantity demanded: consumers want more at the lower price. (3) Shortage: the gap between Qd and Qs. (4) Non-price rationing: goods must be allocated by something other than price—lines, lotteries, seller preferences. (5) Black markets: illegal sales at prices above the ceiling. (6) Reduced quality: sellers cut quality since they can't raise price. (7) Discrimination: sellers may favor friends, family, or those who pay bribes. Price ceilings are often intended to help consumers, but they typically harm those they intend to help by creating shortages and reducing quality.",
          
          "image": {
            "src": "images/unit2/price_ceiling.png",
            "alt": "Graph with price ceiling below equilibrium, showing shortage",
            "caption": "Figure 2.4.6: A binding price ceiling below equilibrium creates persistent shortage."
          },
          
          "examples": [
            {
              "process": "Rent control in NYC",
              "explanation": "New York City's rent control laws keep rents below market for some apartments. Benefits sitting tenants but reduces supply of rental housing and creates shortages—waiting lists, discrimination, and deterioration of controlled units."
            },
            {
              "process": "Price controls on essential medicines",
              "explanation": "Some countries cap prices of life-saving drugs. While intended to make them affordable, this can create shortages as manufacturers supply less, and patients can't find medicines despite willingness to pay."
            },
            {
              "process": "Venezuela price controls",
              "explanation": "Venezuela's price controls on basic foods created massive shortages despite the intent to make food affordable. People spent hours in lines, and black markets flourished at much higher prices."
            }
          ]
        },
        {
          "type": "Price Floor",
          "value": "Legal minimum price",
          "characteristics": ["Government-imposed", "Minimum price", "If above equilibrium → surplus", "Unsold goods", "Government may buy excess", "Waste", "Reduced demand"],
          "behavior": "A price floor is a legal minimum price that can be charged. To be binding, it must be set above the equilibrium price. Binding price floors create persistent surpluses because price cannot fall to eliminate excess supply. Consequences include: (1) Increased quantity supplied: producers supply more at the higher price. (2) Reduced quantity demanded: consumers want less at the higher price. (3) Surplus: the gap between Qs and Qd. (4) Unsold goods: producers can't sell all they produce. (5) Government intervention: to maintain the floor, government may buy the surplus, subsidize exports, or pay producers not to produce. (6) Waste: surplus goods may be stored (costly) or destroyed. (7) Inefficiency: resources used to produce goods no one wants at that price. Price floors are often intended to help producers but create surpluses and waste, and consumers pay higher prices.",
          
          "image": {
            "src": "images/unit2/price_floor.png",
            "alt": "Graph with price floor above equilibrium, showing surplus",
            "caption": "Figure 2.4.7: A binding price floor above equilibrium creates persistent surplus."
          },
          
          "examples": [
            {
              "process": "Minimum wage",
              "explanation": "A minimum wage above the market-clearing wage creates unemployment (surplus of labor). More workers seek jobs than firms want to hire at that wage."
            },
            {
              "process": "Agricultural price supports",
              "explanation": "The U.S. government has historically set minimum prices for crops like corn and wheat. This creates surpluses, which the government buys and stores, costing taxpayers and creating inefficiency."
            },
            {
              "process": "EU butter mountains",
              "explanation": "European Union agricultural price supports created massive surpluses of butter and other dairy products, leading to 'butter mountains' in storage that sometimes spoiled or were sold at huge losses."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Shortages and Surpluses Create Pressure for Price Adjustment",
          "statement": "In free markets, shortages and surpluses are temporary because they create incentives for price adjustment. A shortage means buyers can't get as much as they want—they bid against each other, pushing prices up. Higher prices reduce quantity demanded and increase quantity supplied, eliminating the shortage. A surplus means sellers can't sell all they have—they cut prices to attract more buyers. Lower prices increase quantity demanded and decrease quantity supplied, eliminating the surplus. This self-correcting mechanism is why markets tend toward equilibrium. The speed of adjustment depends on market conditions—flexible prices adjust quickly; sticky prices (like wages or menu costs) adjust more slowly. But the tendency is always toward equilibrium unless prevented.",
          "application": "When you observe a shortage or surplus, predict that prices will adjust unless something blocks them. Shortage → price up. Surplus → price down. This helps forecast market direction.",
          "example": "When a new video game is released, initial shortage may lead to scalpers selling at high prices (price adjustment). When a fashion trend fades, stores have surplus and put items on sale (price down).",
          
          "image": {
            "src": "images/unit2/pressure.png",
            "alt": "Shortage with upward arrow, surplus with downward arrow, both pointing to equilibrium",
            "caption": "Figure 2.4.8: Shortages push prices up; surpluses push prices down."
          }
        },
        {
          "principle": "Price Ceilings Create Shortages and Non-Price Rationing",
          "statement": "When government imposes a price ceiling below equilibrium, it prevents the market from reaching equilibrium. The resulting persistent shortage must be rationed by some method other than price. Common non-price rationing mechanisms include: (1) First-come, first-served: lines and waiting lists. (2) Seller preferences: landlords may discriminate by race, gender, or family status. (3) Coupons or rationing tickets: government issues rights to buy. (4) Black markets: illegal sales at higher prices. These methods are generally less efficient than price rationing because goods don't necessarily go to those who value them most, but to those with time to wait, connections to sellers, or luck. Price ceilings also reduce quality and investment because sellers can't earn normal returns. While intended to help consumers, price ceilings often harm the very people they're meant to help by creating shortages and reducing quality.",
          "application": "When evaluating a proposed price ceiling, consider: Will it be below equilibrium? Who will get the goods instead of price? What are the unintended consequences (black markets, quality deterioration)?",
          "example": "Venezuela's price controls on basic foods created massive shortages despite the intent to make food affordable. People spent hours in lines, and black markets flourished at much higher prices.",
          
          "image": {
            "src": "images/unit2/ceiling_consequences.png",
            "alt": "Price ceiling graph with shortage, plus icons for lines, black markets, quality decline",
            "caption": "Figure 2.4.9: Price ceilings cause shortages and lead to non-price rationing."
          }
        },
        {
          "principle": "Price Floors Create Surpluses and Waste",
          "statement": "When government imposes a price floor above equilibrium, it creates a persistent surplus. For goods, this means unsold inventory. For labor (minimum wage), this means unemployment. To maintain the floor, government often must intervene further—buying surplus agricultural products, paying farmers not to plant, or subsidizing exports. These interventions are costly and create waste: surplus goods may spoil in storage or be destroyed while people elsewhere go hungry. Price floors also lead to inefficient allocation: resources are used to produce goods that consumers don't value enough to buy at the floor price. While intended to help producers (or workers), price floors create surpluses, waste, and higher prices for consumers, and may not even help the intended beneficiaries (e.g., minimum wage may help some workers but price others out of jobs).",
          "application": "When evaluating a proposed price floor, consider: Will it be above equilibrium? What will happen to the surplus? Will government need to buy it? Who bears the cost?",
          "example": "EU agricultural price supports created 'wine lakes' and 'butter mountains'—vast stockpiles of surplus goods that cost taxpayers billions and were sometimes destroyed while poor countries faced food shortages.",
          
          "image": {
            "src": "images/unit2/floor_consequences.png",
            "alt": "Price floor graph with surplus, plus icons for unsold goods, government buying, waste",
            "caption": "Figure 2.4.10: Price floors create surpluses and often lead to government purchases and waste."
          }
        },
        {
          "principle": "Price Controls Create Deadweight Loss",
          "statement": "Both price ceilings and price floors create deadweight loss—a measure of economic inefficiency representing mutually beneficial transactions that no longer occur. With a price ceiling below equilibrium, some transactions that would have occurred (where value to buyers exceeded cost to sellers) don't happen because quantity supplied is too low. With a price floor above equilibrium, some transactions don't happen because quantity demanded is too low. Deadweight loss measures the value of these foregone transactions—the loss to society from interference with market outcomes. This is why economists generally oppose price controls except in specific circumstances (like emergencies) where equity concerns may outweigh efficiency losses. Understanding deadweight loss is essential for evaluating the full cost of price controls.",
          "application": "When analyzing price controls, calculate or estimate deadweight loss. It represents the harm to society beyond the redistribution between buyers and sellers. Policies that create large deadweight losses are generally inefficient.",
          "example": "A rent control law may transfer wealth from landlords to some tenants, but it also creates deadweight loss because fewer apartments are supplied and some people who would have rented can't find apartments at all.",
          
          "image": {
            "src": "images/unit2/deadweight_loss.png",
            "alt": "Supply and demand graph with price ceiling showing deadweight loss triangle",
            "caption": "Figure 2.4.11: Price controls create deadweight loss—transactions that would have benefited both parties no longer occur."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing a Price Ceiling",
          
          "image": {
            "src": "images/unit2/disequilibrium_example1.png",
            "alt": "Apartment rental market data",
            "caption": "Figure 2.4.12: Analyze effects of rent control price ceiling."
          },
          
          "problem": "The apartment market in a city has demand Qd = 1000 - 2P and supply Qs = 200 + 2P, where P is monthly rent in dollars, Q is number of apartments. The government imposes a rent ceiling of \\$150 per month.<br>a) Find equilibrium price and quantity without rent control.<br>b) Is the price ceiling binding?<br>c) What is quantity demanded at the ceiling? Quantity supplied?<br>d) What is the shortage of apartments?<br>e) What problems will likely arise?",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "Set Qd = Qs: 1000 - 2P = 200 + 2P → 800 = 4P → P = \\$200. Q = 1000 - 2(200) = 600 apartments."
            },
            {
              "step": "Check if binding",
              "explanation": "Equilibrium price is \\$200. Ceiling is \\$150, which is below equilibrium. So the ceiling is binding."
            },
            {
              "step": "Calculate at ceiling",
              "explanation": "At P = \\$150: Qd = 1000 - 2(150) = 1000 - 300 = 700. Qs = 200 + 2(150) = 200 + 300 = 500."
            },
            {
              "step": "Shortage",
              "explanation": "Shortage = Qd - Qs = 700 - 500 = 200 apartments."
            },
            {
              "step": "Problems",
              "explanation": "Likely problems: long waiting lists, discrimination by landlords, black markets (illegal payments to get apartments), reduced quality and maintenance of existing apartments, reduced construction of new apartments."
            }
          ],
          
          "final_answer": "a) P=\\$200, Q=600. b) Yes, binding. c) Qd=700, Qs=500. d) Shortage of 200. e) Waiting lists, discrimination, black markets, quality decline.",
          "concept_applied": "Binding price ceilings create persistent shortages and various unintended consequences."
        },
        {
          "title": "Analyzing a Price Floor",
          
          "image": {
            "src": "images/unit2/disequilibrium_example2.png",
            "alt": "Agricultural market data",
            "caption": "Figure 2.4.13: Analyze effects of agricultural price support floor."
          },
          
          "problem": "The wheat market has demand Qd = 500 - 10P and supply Qs = 100 + 10P, where P is price per bushel, Q is millions of bushels. The government sets a price floor of \\$25 per bushel and agrees to buy any surplus.<br>a) Find equilibrium price and quantity.<br>b) Is the price floor binding?<br>c) What is quantity demanded at the floor? Quantity supplied?<br>d) What is the surplus? How much will the government need to buy?<br>e) What is the cost to the government if it pays the floor price for surplus?<br>f) What are the efficiency implications?",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "Set Qd = Qs: 500 - 10P = 100 + 10P → 400 = 20P → P = \\$20. Q = 500 - 10(20) = 300 million bushels."
            },
            {
              "step": "Check if binding",
              "explanation": "Equilibrium price is \\$20. Floor is \\$25, which is above equilibrium. So the floor is binding."
            },
            {
              "step": "Calculate at floor",
              "explanation": "At P = \\$25: Qd = 500 - 10(25) = 500 - 250 = 250. Qs = 100 + 10(25) = 100 + 250 = 350."
            },
            {
              "step": "Surplus and government purchase",
              "explanation": "Surplus = Qs - Qd = 350 - 250 = 100 million bushels. Government must buy this surplus to maintain the floor price."
            },
            {
              "step": "Government cost",
              "explanation": "Cost = surplus × floor price = 100 million × \\$25 = \\$2.5 billion."
            },
            {
              "step": "Efficiency implications",
              "explanation": "Resources are used to produce 100 million bushels that consumers don't want at that price. This is inefficient. Taxpayers bear \\$2.5 billion cost. Some of the surplus may spoil or be wasted. The policy transfers money from taxpayers to farmers."
            }
          ],
          
          "final_answer": "a) P=\\$20, Q=300. b) Yes, binding. c) Qd=250, Qs=350. d) Surplus=100 million, government buys that. e) \\$2.5 billion. f) Inefficient resource use, taxpayer cost, potential waste.",
          "concept_applied": "Binding price floors create surpluses that often require government purchases, costing taxpayers and creating inefficiency."
        },
        {
          "title": "Comparing Shortage and Surplus",
          
          "image": {
            "src": "images/unit2/disequilibrium_example3.png",
            "alt": "Market data table",
            "caption": "Figure 2.4.14: Calculate shortage or surplus at different prices."
          },
          
          "problem": "A market has the following demand and supply schedule:<br>Price: \\$4, \\$5, \\$6, \\$7, \\$8<br>Qd: 500, 450, 400, 350, 300<br>Qs: 200, 300, 400, 500, 600<br>a) What is equilibrium price and quantity?<br>b) At a price of \\$5, is there shortage or surplus? How much?<br>c) At a price of \\$7, is there shortage or surplus? How much?<br>d) If the government sets a price floor at \\$7, what happens?<br>e) If the government sets a price ceiling at \\$5, what happens?",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "At \\$6, Qd = 400 and Qs = 400. Equilibrium price = \\$6, quantity = 400."
            },
            {
              "step": "At \\$5",
              "explanation": "Qd = 450, Qs = 300. Qd > Qs by 150, so shortage of 150 units."
            },
            {
              "step": "At \\$7",
              "explanation": "Qd = 350, Qs = 500. Qs > Qd by 150, so surplus of 150 units."
            },
            {
              "step": "Price floor at \\$7",
              "explanation": "\\$7 is above equilibrium, so binding floor. Creates surplus of 150. Without government action, price would tend to fall, but floor prevents it. Unsold goods accumulate."
            },
            {
              "step": "Price ceiling at \\$5",
              "explanation": "\\$5 is below equilibrium, so binding ceiling. Creates shortage of 150. Without ceiling, price would rise, but prevented. Non-price rationing needed."
            }
          ],
          
          "final_answer": "a) \\$6, 400. b) Shortage 150. c) Surplus 150. d) Surplus of 150, unsold goods. e) Shortage of 150, non-price rationing.",
          "concept_applied": "Prices below equilibrium cause shortages; above cause surpluses. Price controls prevent adjustment and create persistent imbalances."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Determine Equilibrium",
          "description": "Find the equilibrium price and quantity where Qd = Qs.",
          "mechanism": "Use table, graph, or equations to find equilibrium.",
          "result": "Baseline equilibrium.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step1.png",
            "alt": "Finding equilibrium point",
            "caption": "Figure 2.4.15: Step 1 - Determine market equilibrium."
          }
        },
        {
          "step": 2,
          "process": "Compare Actual Price to Equilibrium",
          "description": "Determine if current price is above, below, or equal to equilibrium.",
          "mechanism": "If price = equilibrium → market clears. If price > equilibrium → potential surplus. If price < equilibrium → potential shortage.",
          "result": "Identification of disequilibrium type.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step2.png",
            "alt": "Comparing actual price to equilibrium price",
            "caption": "Figure 2.4.16: Step 2 - Compare actual price to equilibrium."
          }
        },
        {
          "step": 3,
          "process": "Calculate Qd and Qs at Actual Price",
          "description": "Find quantities demanded and supplied at the current price.",
          "mechanism": "Use demand and supply functions or tables to find Qd and Qs at the actual price.",
          "result": "Specific quantities.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step3.png",
            "alt": "Reading Qd and Qs from curves at given price",
            "caption": "Figure 2.4.17: Step 3 - Find Qd and Qs at actual price."
          }
        },
        {
          "step": 4,
          "process": "Determine Shortage or Surplus",
          "description": "Calculate the difference between Qd and Qs.",
          "mechanism": "If Qd > Qs, shortage = Qd - Qs. If Qs > Qd, surplus = Qs - Qd.",
          "result": "Magnitude of imbalance.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step4.png",
            "alt": "Calculating gap between Qd and Qs",
            "caption": "Figure 2.4.18: Step 4 - Calculate shortage or surplus."
          }
        },
        {
          "step": 5,
          "process": "Analyze Consequences and Adjustments",
          "description": "Predict market adjustment or effects of price controls.",
          "mechanism": "If free market, price will adjust toward equilibrium. If price controls prevent adjustment, analyze rationing, black markets, government purchases, etc.",
          "result": "Understanding of outcomes.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step5.png",
            "alt": "Arrows showing adjustment or icons showing consequences of controls",
            "caption": "Figure 2.4.19: Step 5 - Analyze adjustment or control consequences."
          }
        }
      ],

      "image": {
        "src": "images/unit2/disequilibrium_summary.png",
        "alt": "Comprehensive disequilibrium summary: shortage, surplus, price ceilings, price floors, consequences",
        "caption": "Figure 2.4.20: Disequilibrium summary - shortages, surpluses, and price controls."
      }
    }
  ],

  "key_terms": [
    "Disequilibrium",
    "Shortage",
    "Excess demand",
    "Surplus",
    "Excess supply",
    "Price ceiling",
    "Price floor",
    "Binding price control",
    "Non-price rationing",
    "First-come first-served",
    "Waiting lists",
    "Black market",
    "Rent control",
    "Minimum wage",
    "Price supports",
    "Agricultural price supports",
    "Deadweight loss",
    "Efficiency loss",
    "Market adjustment",
    "Price mechanism",
    "Rationing",
    "Discrimination",
    "Quality deterioration",
    "Government purchases",
    "Butter mountains",
    "Wine lakes",
    "Scalping",
    "Unemployment (as surplus)",
    "Invisible hand"
  ],

  "summary": "Disequilibrium occurs when quantity demanded does not equal quantity supplied at the current price. A shortage (excess demand) happens when price is below equilibrium, leading to long lines, waiting lists, and black markets. A surplus (excess supply) happens when price is above equilibrium, leading to unsold goods and price cutting. In free markets, shortages push prices up and surpluses push prices down, automatically moving toward equilibrium. Price controls prevent this adjustment. Price ceilings (legal maximums) set below equilibrium create persistent shortages, requiring non-price rationing and often leading to black markets and reduced quality. Price floors (legal minimums) set above equilibrium create persistent surpluses, often requiring government purchases and creating waste. Both types of price controls create deadweight loss—mutually beneficial transactions that no longer occur. Understanding disequilibrium helps explain real-world phenomena like rent control shortages, agricultural surpluses, and the effects of minimum wage laws."
}
