{
  "expanded_description": "How does a market actually determine the price you pay? In a free market, the price is not set by any single person or institution. Instead, it emerges from the interaction of buyers and sellers. The equilibrium price—the price that clears the market—is where the plans of consumers and producers align. At this price, the quantity consumers want to buy exactly equals the quantity producers want to sell. In this section, we'll explore how to find equilibrium using tables and graphs, why equilibrium is stable, and what equilibrium tells us about market outcomes.",
  
  "core_concept": {
    "principle": "Market equilibrium occurs at the price where quantity demanded equals quantity supplied. At this price, there is neither a shortage nor a surplus—the market clears. (1) Equilibrium price (market-clearing price): The price at which Qd = Qs. (2) Equilibrium quantity: The quantity bought and sold at the equilibrium price. (3) Finding equilibrium: Using a demand schedule and supply schedule, find the price where quantities match. Graphically, it's the intersection of demand and supply curves. (4) Properties: At equilibrium, all buyers who want to buy at that price can find sellers, and all sellers who want to sell at that price can find buyers. There is no pressure for price to change unless underlying conditions change. (5) Adjustment: If price is above equilibrium, surplus (excess supply) pushes price down. If price is below equilibrium, shortage (excess demand) pushes price up. This self-correcting mechanism is fundamental to market economies.",
    
    "explanation": "Think of market equilibrium like a dance where everyone finds a partner. At the right price, every buyer looking to buy finds a seller, and every seller looking to sell finds a buyer. No one is left waiting (shortage) and no one is left with unsold goods (surplus). The price adjusts until this balance is achieved—like a dance floor where people pair up perfectly.",
    
    "image": {
      "src": "images/unit2/equilibrium_overview.png",
      "alt": "Balance scale with consumers on one side and producers on the other, balanced at equilibrium",
      "caption": "Figure 2.3.1: Market equilibrium balances the plans of buyers and sellers."
    }
  },

  "sections": [
    {
      "section_title": "2.3 Finding Market Equilibrium",
      "introduction": "How does a market actually determine the price you pay? In a free market, the price is not set by any single person or institution. Instead, it emerges from the interaction of buyers and sellers. The equilibrium price—the price that clears the market—is where the plans of consumers and producers align. At this price, the quantity consumers want to buy exactly equals the quantity producers want to sell. In this section, we'll explore how to find equilibrium using tables and graphs, why equilibrium is stable, and what equilibrium tells us about market outcomes.",
      
      "introduction_image": {
        "src": "images/unit2/equilibrium_intro.png",
        "alt": "Market scene with buyers and sellers transacting at a price that balances supply and demand",
        "caption": "Figure 2.3.2: In a market, prices adjust until buyers and sellers are matched."
      },
      
      "key_concept": {
        "definition": "Market equilibrium is a state of balance where the quantity demanded by consumers exactly equals the quantity supplied by producers at the prevailing price. At the equilibrium price (also called the market-clearing price), there is no tendency for price to change unless underlying conditions shift. Key elements: (1) Equilibrium price (Pe): The price at which Qd = Qs. (2) Equilibrium quantity (Qe): The quantity bought and sold at that price. (3) Finding equilibrium: From a table, scan for the price where Qd and Qs match. From a graph, find the intersection of demand and supply curves. From equations, set Qd = Qs and solve. (4) Properties of equilibrium: All mutually beneficial transactions occur—anyone willing to pay the equilibrium price can buy, and anyone willing to sell at that price can sell. There are no frustrated buyers or sellers. (5) Stability: If price deviates from equilibrium, market forces push it back. Price above equilibrium creates surplus (excess supply), leading sellers to cut prices. Price below equilibrium creates shortage (excess demand), leading buyers to bid prices up. (6) Importance: Equilibrium analysis is the foundation for understanding how markets allocate resources and how they respond to changes in conditions.",
        
        "context": "The concept of equilibrium comes from physics and was applied to economics by Léon Walras and Alfred Marshall. Marshall's supply and demand diagram, published in 1890, remains the standard way to present equilibrium. Understanding equilibrium is essential for analyzing how markets allocate resources and how they respond to changes. In AP Microeconomics, equilibrium analysis is the foundation for studying price controls, taxes, subsidies, and market shocks.",
        
        "image": {
          "src": "images/unit2/equilibrium_graph.png",
          "alt": "Supply and demand curves intersecting at equilibrium point E, with equilibrium price and quantity labeled",
          "caption": "Figure 2.3.3: Market equilibrium occurs where supply and demand curves intersect."
        }
      },

      "classifications": [
        {
          "type": "Finding Equilibrium from Tables",
          "value": "Using demand and supply schedules to find matching quantities",
          "characteristics": ["Price column", "Qd column", "Qs column", "Compare Qd and Qs", "Find price where they match"],
          "behavior": "When given tables of quantity demanded and quantity supplied at various prices, find equilibrium by locating the price where Qd equals Qs. If no exact match exists, equilibrium lies between prices where Qd crosses from above to below Qs. This method is straightforward and helps build intuition before moving to graphs. The equilibrium price is where the market clears. At lower prices, Qd > Qs (shortage); at higher prices, Qs > Qd (surplus). Examining tables helps understand why prices tend toward equilibrium: at prices with shortages, buyers bid prices up; at prices with surpluses, sellers cut prices.",
          
          "image": {
            "src": "images/unit2/equilibrium_table.png",
            "alt": "Table with price, Qd, Qs columns, highlighting row where Qd = Qs",
            "caption": "Figure 2.3.4: Find equilibrium by comparing quantity demanded and supplied at each price."
          },
          
          "examples": [
            {
              "process": "Simple market table",
              "explanation": "Price: \\$1, Qd=100, Qs=20; \\$2, Qd=80, Qs=40; \\$3, Qd=60, Qs=60; \\$4, Qd=40, Qs=80; \\$5, Qd=20, Qs=100. Equilibrium at \\$3 where Qd=Qs=60."
            }
          ]
        },
        {
          "type": "Finding Equilibrium from Graphs",
          "value": "Locating intersection of supply and demand curves",
          "characteristics": ["Downward-sloping demand", "Upward-sloping supply", "Intersection point", "Read P and Q from axes", "Visual identification"],
          "behavior": "Graphically, equilibrium is the point where the demand curve and supply curve intersect. From this point, drop down to the quantity axis to find equilibrium quantity, and across to the price axis to find equilibrium price. Graphs provide an intuitive visual of market outcomes and make it easy to see how shifts affect equilibrium. They also show consumer surplus (area below demand and above price) and producer surplus (area above supply and below price), which are important for welfare analysis. Reading graphs accurately requires careful attention to axes and scales.",
          
          "image": {
            "src": "images/unit2/equilibrium_graph_find.png",
            "alt": "Supply and demand curves with dotted lines from intersection to axes showing Pe and Qe",
            "caption": "Figure 2.3.5: Graphically, equilibrium is the intersection of supply and demand."
          },
          
          "examples": [
            {
              "process": "Reading equilibrium from graph",
              "explanation": "On a correctly labeled graph, find where curves cross. Read horizontally to price axis for equilibrium price, vertically to quantity axis for equilibrium quantity."
            }
          ]
        },
        {
          "type": "Finding Equilibrium Algebraically",
          "value": "Solving equations to find exact equilibrium values",
          "characteristics": ["Demand equation", "Supply equation", "Set Qd = Qs", "Solve for P", "Substitute to find Q"],
          "behavior": "When demand and supply are given as linear equations, equilibrium can be found algebraically. Given Qd = a - bP and Qs = c + dP (where a,b,c,d are positive numbers), set a - bP = c + dP, solve for P, then substitute back to find Q. This method yields exact values and is useful for quantitative problems. It also allows sensitivity analysis—seeing how changes in parameters affect equilibrium. Understanding the algebraic approach is essential for more advanced economic analysis and for checking graphical solutions.",
          
          "image": {
            "src": "images/unit2/equilibrium_algebra.png",
            "alt": "Equations being solved step by step",
            "caption": "Figure 2.3.6: Algebraically solve for equilibrium by setting Qd = Qs."
          },
          
          "examples": [
            {
              "process": "Solving linear equations",
              "explanation": "Demand: Qd = 100 - 2P. Supply: Qs = 20 + 3P. Set equal: 100 - 2P = 20 + 3P → 80 = 5P → P = 16. Q = 100 - 2(16) = 68."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Equilibrium Is Where Buyers' and Sellers' Plans Align",
          "statement": "At the equilibrium price, the quantity consumers want to buy exactly equals the quantity producers want to sell. This alignment means that everyone who wants to buy at that price can find a seller, and everyone who wants to sell at that price can find a buyer. No one is frustrated—there's no line of disappointed buyers (shortage) and no pile of unsold goods (surplus). This coordination happens automatically through price adjustments in free markets. The equilibrium outcome is efficient in the sense that all mutually beneficial transactions occur—any unit where someone values it more than it costs to produce gets produced and sold. Understanding this alignment helps explain why markets are powerful coordination mechanisms.",
          "application": "When analyzing a market, always identify the equilibrium first. It's the baseline from which changes are measured. Compare actual prices to equilibrium to predict whether shortages or surpluses exist.",
          "example": "In the housing market, equilibrium rent aligns the number of apartments landlords want to rent with the number of apartments renters want to occupy. If rent is above equilibrium, vacancies appear (surplus); if below, waiting lists appear (shortage).",
          
          "image": {
            "src": "images/unit2/alignment.png",
            "alt": "Two arrows (buyers and sellers) meeting at equilibrium point",
            "caption": "Figure 2.3.7: Equilibrium aligns the plans of buyers and sellers."
          }
        },
        {
          "principle": "Markets Tend to Self-Correct Toward Equilibrium",
          "statement": "Markets have a natural tendency to move toward equilibrium. If price is above equilibrium, quantity supplied exceeds quantity demanded, creating a surplus. Sellers find themselves with unsold inventory and compete for customers by lowering prices. As price falls, quantity demanded increases and quantity supplied decreases, reducing the surplus until equilibrium is reached. If price is below equilibrium, quantity demanded exceeds quantity supplied, creating a shortage. Buyers compete for limited goods by bidding prices up. As price rises, quantity demanded decreases and quantity supplied increases, reducing the shortage. This self-correcting mechanism operates without any central direction—it's the invisible hand at work. The speed of adjustment depends on the market—some adjust quickly (financial markets), others slowly (housing markets).",
          "application": "When you observe a price that seems 'too high' or 'too low,' expect market forces to push it toward equilibrium unless something prevents adjustment (like price controls). Use surplus/shortage analysis to predict price direction.",
          "example": "After a good harvest, farmers bring more corn to market, creating a temporary surplus. Prices fall, encouraging consumers to buy more and farmers to plant less next season, moving toward equilibrium.",
          
          "image": {
            "src": "images/unit2/self_correct.png",
            "alt": "Diagram showing surplus pushing price down, shortage pushing price up, both toward equilibrium",
            "caption": "Figure 2.3.8: Markets self-correct—surpluses push prices down, shortages push prices up."
          }
        },
        {
          "principle": "Equilibrium Changes When Supply or Demand Shifts",
          "statement": "Equilibrium is not fixed—it changes when underlying conditions shift supply or demand. An increase in demand (shift right) raises both equilibrium price and quantity. A decrease in demand (shift left) lowers both. An increase in supply (shift right) lowers equilibrium price and raises quantity. A decrease in supply (shift left) raises equilibrium price and lowers quantity. When both curves shift simultaneously, the effect on price or quantity may be ambiguous, depending on the direction and magnitude of shifts. Understanding these patterns allows economists to predict how events like income changes, technological progress, or natural disasters will affect market outcomes.",
          "application": "When analyzing a market change, first determine whether supply shifts, demand shifts, or both. Then apply the rules: D↑ → P↑ Q↑; D↓ → P↓ Q↓; S↑ → P↓ Q↑; S↓ → P↑ Q↓. For simultaneous shifts, consider relative magnitudes.",
          "example": "If a new study shows coffee is healthy (demand ↑) and a frost damages coffee crops (supply ↓), price definitely rises, but quantity change is ambiguous—it depends on which shift is larger.",
          
          "image": {
            "src": "images/unit2/equilibrium_shifts.png",
            "alt": "Four panels showing effects of demand increase, demand decrease, supply increase, supply decrease on equilibrium",
            "caption": "Figure 2.3.9: Shifts in supply or demand change equilibrium price and quantity in predictable ways."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Finding Equilibrium from a Table",
          
          "image": {
            "src": "images/unit2/equilibrium_example1.png",
            "alt": "Table with price, Qd, Qs for pizza market",
            "caption": "Figure 2.3.10: Find equilibrium from the given data."
          },
          
          "problem": "The following table shows the demand and supply for pizza in a college town:<br>Price: \\$8, \\$10, \\$12, \\$14, \\$16<br>Qd: 400, 350, 300, 250, 200<br>Qs: 200, 250, 300, 350, 400<br>a) What is the equilibrium price and quantity?<br>b) At a price of \\$10, is there a shortage or surplus? How much?<br>c) At a price of \\$14, is there a shortage or surplus? How much?<br>d) If price is currently \\$8, what will happen to price? Why?",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "Look for price where Qd = Qs. At \\$12, Qd = 300 and Qs = 300. Equilibrium price = \\$12, quantity = 300."
            },
            {
              "step": "Analyze \\$10",
              "explanation": "At \\$10, Qd = 350, Qs = 250. Qd > Qs by 100, so shortage of 100 pizzas."
            },
            {
              "step": "Analyze \\$14",
              "explanation": "At \\$14, Qd = 250, Qs = 350. Qs > Qd by 100, so surplus of 100 pizzas."
            },
            {
              "step": "Price at \\$8",
              "explanation": "At \\$8, Qd = 400, Qs = 200. Shortage of 200 pizzas. With shortage, buyers compete for limited pizzas, bidding price up toward equilibrium \\$12."
            }
          ],
          
          "final_answer": "a) \\$12, 300 pizzas. b) Shortage of 100. c) Surplus of 100. d) Price will rise due to shortage.",
          "concept_applied": "Equilibrium is where Qd=Qs. Prices below cause shortages; above cause surpluses. Markets adjust toward equilibrium."
        },
        {
          "title": "Finding Equilibrium Algebraically",
          
          "image": {
            "src": "images/unit2/equilibrium_example2.png",
            "alt": "Demand and supply equations",
            "caption": "Figure 2.3.11: Solve for equilibrium using algebra."
          },
          
          "problem": "The market for smartphones is described by:<br>Demand: Qd = 500 - 2P<br>Supply: Qs = 100 + 3P<br>where P is price in dollars, Q in thousands.<br>a) Find equilibrium price and quantity.<br>b) If price is set at \\$60, is there shortage or surplus? How much?<br>c) If price is set at \\$100, is there shortage or surplus? How much?",
          
          "step_by_step": [
            {
              "step": "Set Qd = Qs",
              "explanation": "500 - 2P = 100 + 3P"
            },
            {
              "step": "Solve for P",
              "explanation": "500 - 100 = 3P + 2P → 400 = 5P → P = \\$80"
            },
            {
              "step": "Find Q",
              "explanation": "Q = 500 - 2(80) = 500 - 160 = 340 thousand, or Q = 100 + 3(80) = 100 + 240 = 340 thousand."
            },
            {
              "step": "Check P = \\$60",
              "explanation": "Qd = 500 - 2(60) = 500 - 120 = 380. Qs = 100 + 3(60) = 100 + 180 = 280. Qd > Qs by 100 thousand, so shortage."
            },
            {
              "step": "Check P = \\$100",
              "explanation": "Qd = 500 - 2(100) = 500 - 200 = 300. Qs = 100 + 3(100) = 100 + 300 = 400. Qs > Qd by 100 thousand, so surplus."
            }
          ],
          
          "final_answer": "a) P = \\$80, Q = 340,000. b) Shortage of 100,000. c) Surplus of 100,000.",
          "concept_applied": "Algebraic solution yields exact equilibrium. Compare actual price to equilibrium to determine shortage/surplus."
        },
        {
          "title": "Graphing Equilibrium",
          
          "image": {
            "src": "images/unit2/equilibrium_example3.png",
            "alt": "Blank supply and demand axes",
            "caption": "Figure 2.3.12: Draw and label equilibrium graph."
          },
          
          "problem": "Draw a correctly labeled supply and demand graph for the pizza market from the first example. Label axes, curves, equilibrium point, equilibrium price, and equilibrium quantity. Then show what happens if the price of hamburgers (a substitute) increases significantly.",
          
          "step_by_step": [
            {
              "step": "Draw axes",
              "explanation": "Vertical axis: Price. Horizontal axis: Quantity."
            },
            {
              "step": "Draw demand curve",
              "explanation": "Downward-sloping line from upper left to lower right. Label D."
            },
            {
              "step": "Draw supply curve",
              "explanation": "Upward-sloping line from lower left to upper right. Label S."
            },
            {
              "step": "Label equilibrium",
              "explanation": "Mark intersection as E. Draw dotted line to price axis for Pe, to quantity axis for Qe."
            },
            {
              "step": "Analyze price of hamburgers increase",
              "explanation": "Hamburgers are substitutes. Higher hamburger price increases demand for pizza (shift right). New demand curve D2 to the right of original. New equilibrium E2 has higher price and higher quantity."
            }
          ],
          
          "final_answer": "Graph should show original equilibrium with Pe, Qe, and new equilibrium after demand shift right with higher P and Q.",
          "concept_applied": "Graphs visually represent equilibrium and how shifts change market outcomes."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Obtain Demand and Supply Information",
          "description": "Gather data on quantities demanded and supplied at various prices.",
          "mechanism": "Use tables, equations, or graphs representing market conditions.",
          "result": "Demand and supply schedules or curves.",
          
          "image": {
            "src": "images/unit2/equilibrium_step1.png",
            "alt": "Table with demand and supply data",
            "caption": "Figure 2.3.13: Step 1 - Obtain demand and supply information."
          }
        },
        {
          "step": 2,
          "process": "Find Where Qd = Qs",
          "description": "Identify price where quantities match.",
          "mechanism": "From table: scan for matching Qd and Qs. From graph: find intersection. From equations: set equal and solve.",
          "result": "Equilibrium price and quantity.",
          
          "image": {
            "src": "images/unit2/equilibrium_step2.png",
            "alt": "Magnifying glass finding matching quantities",
            "caption": "Figure 2.3.14: Step 2 - Find where quantity demanded equals quantity supplied."
          }
        },
        {
          "step": 3,
          "process": "Verify at Adjacent Prices",
          "description": "Check prices above and below to confirm equilibrium.",
          "mechanism": "Above equilibrium: Qs > Qd (surplus). Below equilibrium: Qd > Qs (shortage). This confirms correct identification.",
          "result": "Confirmation of equilibrium.",
          
          "image": {
            "src": "images/unit2/equilibrium_step3.png",
            "alt": "Above equilibrium showing surplus, below showing shortage",
            "caption": "Figure 2.3.15: Step 3 - Verify that above equilibrium has surplus, below has shortage."
          }
        },
        {
          "step": 4,
          "process": "Analyze Disequilibrium if Price Differs",
          "description": "If actual price differs from equilibrium, determine surplus/shortage.",
          "mechanism": "Calculate Qd and Qs at actual price. Difference = surplus (if Qs > Qd) or shortage (if Qd > Qs).",
          "result": "Understanding of market imbalance.",
          
          "image": {
            "src": "images/unit2/equilibrium_step4.png",
            "alt": "Calculating difference between Qd and Qs at non-equilibrium price",
            "caption": "Figure 2.3.16: Step 4 - If price isn't equilibrium, calculate surplus or shortage."
          }
        },
        {
          "step": 5,
          "process": "Predict Price Adjustment",
          "description": "Determine direction of price movement toward equilibrium.",
          "mechanism": "Surplus → price falls. Shortage → price rises. Continue until equilibrium reached.",
          "result": "Prediction of market adjustment.",
          
          "image": {
            "src": "images/unit2/equilibrium_step5.png",
            "alt": "Arrows showing surplus pushing price down, shortage pushing price up",
            "caption": "Figure 2.3.17: Step 5 - Predict price movement toward equilibrium."
          }
        }
      ],

      "image": {
        "src": "images/unit2/equilibrium_summary.png",
        "alt": "Comprehensive equilibrium summary: finding from table, graph, algebra; surplus/shortage; adjustment",
        "caption": "Figure 2.3.18: Market equilibrium summary - how to find it and how markets adjust."
      }
    }
  ],

  "key_terms": [
    "Market equilibrium",
    "Equilibrium price",
    "Equilibrium quantity",
    "Market-clearing price",
    "Demand schedule",
    "Supply schedule",
    "Intersection",
    "Surplus",
    "Shortage",
    "Excess supply",
    "Excess demand",
    "Market adjustment",
    "Self-correcting mechanism",
    "Price mechanism",
    "Invisible hand",
    "Disequilibrium",
    "Comparative statics",
    "Demand curve",
    "Supply curve",
    "Graphical analysis",
    "Algebraic solution",
    "Linear equations",
    "Solving for equilibrium"
  ],

  "summary": "Market equilibrium occurs at the price where quantity demanded equals quantity supplied—the intersection of the demand and supply curves. At this equilibrium price (also called market-clearing price), the market clears with no shortage or surplus. Equilibrium can be found from tables by locating the price where Qd = Qs, from graphs by finding the intersection point, or from equations by setting Qd = Qs and solving. At prices below equilibrium, quantity demanded exceeds quantity supplied, creating a shortage that pushes prices up. At prices above equilibrium, quantity supplied exceeds quantity demanded, creating a surplus that pushes prices down. This self-correcting mechanism means markets naturally tend toward equilibrium unless prevented by price controls or other barriers. When demand or supply shifts, equilibrium changes in predictable ways: demand increases raise both price and quantity; demand decreases lower both; supply increases lower price and raise quantity; supply decreases raise price and lower quantity. Understanding equilibrium is fundamental to analyzing how markets allocate resources and respond to changes."
}
