{
  "expanded_description": "Why do people buy more strawberries when they're in season and cheap, and fewer when they're expensive? This everyday observation reflects the law of demand: when price goes up, quantity demanded goes down, and vice versa. But demand is more than just a simple relationship—it reflects consumer preferences, income, and the prices of related goods. In this section, we'll explore the law of demand, what shapes demand curves, the difference between demand and quantity demanded, and the factors that can cause demand to shift.",
  
  "core_concept": {
    "principle": "Demand refers to the entire relationship between price and quantity demanded, while quantity demanded is the specific amount consumers are willing to buy at a particular price. The law of demand states that, ceteris paribus (all else equal), there is an inverse relationship between price and quantity demanded. This occurs for two reasons: (1) Substitution effect: As price rises, consumers substitute toward relatively cheaper alternatives. (2) Income effect: As price rises, consumers' real income falls, reducing purchasing power and quantity demanded. The demand curve graphs this relationship with price on the vertical axis and quantity on the horizontal axis. It slopes downward. A change in price causes a movement along the demand curve—a change in quantity demanded. A change in any other factor affecting demand causes the entire curve to shift—a change in demand.",
    
    "explanation": "Think of demand like your personal shopping rule: when something gets cheaper, you're more likely to buy it; when it gets more expensive, you look for alternatives or do without. If pizza goes on sale, you might buy two instead of one. If pizza prices double, you might switch to pasta. This simple behavior, multiplied across millions of consumers, creates the demand curve.",
    
    "image": {
      "src": "images/unit2/demand_overview.png",
      "alt": "Shopper looking at price tags, with thought bubble showing more purchases at low prices, fewer at high prices",
      "caption": "Figure 2.1.1: The law of demand captures how consumers respond to price changes."
    }
  },

  "sections": [
    {
      "section_title": "2.1 Law of Demand",
      "introduction": "Why do people buy more strawberries when they're in season and cheap, and fewer when they're expensive? This everyday observation reflects the law of demand: when price goes up, quantity demanded goes down, and vice versa. But demand is more than just a simple relationship—it reflects consumer preferences, income, and the prices of related goods. In this section, we'll explore the law of demand, what shapes demand curves, the difference between demand and quantity demanded, and the factors that can cause demand to shift.",
      
      "introduction_image": {
        "src": "images/unit2/demand_intro.png",
        "alt": "Shopper comparing prices and deciding whether to buy",
        "caption": "Figure 2.1.2: Every purchase decision reflects the law of demand."
      },
      
      "key_concept": {
        "definition": "Demand is the relationship between the price of a good and the quantity consumers are willing and able to buy, ceteris paribus. The law of demand states that price and quantity demanded are inversely related: as price increases, quantity demanded decreases; as price decreases, quantity demanded increases. This inverse relationship is explained by: (1) The substitution effect: when a good's price rises, consumers substitute toward relatively cheaper alternatives. (2) The income effect: when a good's price rises, consumers' real income (purchasing power) falls, leading them to buy less. A demand schedule is a table showing quantities demanded at different prices. A demand curve graphs this relationship with price on the vertical axis and quantity on the horizontal axis. It slopes downward. Critical distinction: A change in the price of the good causes a change in quantity demanded—a movement along the demand curve. A change in any other factor affecting consumers' willingness or ability to buy causes a change in demand—a shift of the entire curve.",
        
        "context": "The concept of demand was formalized by Alfred Marshall in his 1890 book 'Principles of Economics.' The law of demand is one of the most robust empirical regularities in economics—it holds across virtually all goods and contexts. Understanding demand is essential for analyzing consumer behavior, pricing decisions, and the effects of taxes, subsidies, and regulations. In AP Microeconomics, demand analysis forms half of the supply and demand framework you'll use throughout the course.",
        
        "image": {
          "src": "images/unit2/demand_curve.png",
          "alt": "Downward-sloping demand curve with price on Y-axis and quantity on X-axis",
          "caption": "Figure 2.1.3: The demand curve slopes downward, showing inverse price-quantity relationship."
        }
      },

      "classifications": [
        {
          "type": "Normal Goods",
          "value": "Goods for which demand increases as income increases",
          "characteristics": ["Positive income elasticity", "Luxury goods", "Necessities", "Most goods", "Shift right with income growth"],
          "behavior": "Normal goods are what most people think of as typical goods: when consumers have more income, they buy more of them. This includes everything from restaurant meals to new cars to clothing. Normal goods can be further divided into necessities (goods we buy regardless of income, but buy slightly more as income rises—like basic food) and luxuries (goods we buy disproportionately more as income rises—like high-end electronics or vacations). For normal goods, the demand curve shifts to the right when income increases (more demanded at every price) and to the left when income decreases. The strength of the response depends on whether the good is a necessity or luxury.",
          
          "image": {
            "src": "images/unit2/normal_goods.png",
            "alt": "Graph showing demand curve shifting right as income increases",
            "caption": "Figure 2.1.4: Normal goods see increased demand when income rises."
          },
          
          "examples": [
            {
              "process": "Restaurant meals",
              "explanation": "When people get raises, they tend to eat out more often. Demand for restaurant meals increases with income—a normal good."
            },
            {
              "process": "New cars",
              "explanation": "As incomes rise, more households can afford new cars, increasing demand. During recessions (income falls), new car demand drops."
            }
          ]
        },
        {
          "type": "Inferior Goods",
          "value": "Goods for which demand decreases as income increases",
          "characteristics": ["Negative income elasticity", "Lower-quality alternatives", "Shift left with income growth", "Often basic staples", "Related to perceived quality"],
          "behavior": "Inferior goods are goods that consumers buy less of as their income rises. This doesn't mean the goods are low quality in an absolute sense—they're goods that people replace with better alternatives when they can afford to. Examples include generic brands, public transportation, and instant noodles. When a consumer's income increases, they might switch from generic cereal to name-brand, from bus to car, or from instant noodles to restaurant meals. For inferior goods, the demand curve shifts to the left when income increases (less demanded at every price) and to the right when income decreases. The term 'inferior' is an economic classification, not a value judgment—it simply describes how demand responds to income changes.",
          
          "image": {
            "src": "images/unit2/inferior_goods.png",
            "alt": "Graph showing demand curve shifting left as income increases",
            "caption": "Figure 2.1.5: Inferior goods see decreased demand when income rises."
          },
          
          "examples": [
            {
              "process": "Generic cereal",
              "explanation": "A budget-conscious consumer buys generic corn flakes. After a promotion and raise, they switch to a name brand. Demand for generic cereal falls as income rises—it's an inferior good."
            },
            {
              "process": "Public transit",
              "explanation": "Low-income workers rely on buses. As their incomes rise, many buy cars and use transit less. Public transit ridership often declines in prosperous times (inferior) and increases in recessions."
            }
          ]
        },
        {
          "type": "Substitutes",
          "value": "Goods used in place of each other",
          "characteristics": ["Cross-price elasticity positive", "Competing goods", "Price of one affects demand for other", "Examples: Coke/Pepsi, tea/coffee", "Shift same direction as other's price"],
          "behavior": "Substitutes are goods that can be used in place of each other. When the price of one good rises, consumers switch to the substitute, increasing demand for the substitute. For example, if the price of coffee rises significantly, some consumers will switch to tea, increasing the demand for tea. Graphically, an increase in the price of a substitute shifts the demand curve for the original good to the right. A decrease in the price of a substitute shifts demand to the left. The cross-price elasticity of demand (responsiveness of demand for one good to price changes in another) is positive for substitutes. The closer the substitutes, the stronger the effect.",
          
          "image": {
            "src": "images/unit2/substitutes.png",
            "alt": "Two products side by side with arrow showing switching when price changes",
            "caption": "Figure 2.1.6: Substitutes are goods used in place of each other—price changes in one affect demand for the other."
          },
          
          "examples": [
            {
              "process": "Coke and Pepsi",
              "explanation": "If Pepsi's price increases, Coke becomes relatively cheaper. Consumers buy more Coke, shifting Coke's demand curve right. If Pepsi's price decreases, Coke demand shifts left."
            },
            {
              "process": "Butter and margarine",
              "explanation": "When butter prices spike, bakers and households switch to margarine, increasing margarine demand. They're close substitutes."
            }
          ]
        },
        {
          "type": "Complements",
          "value": "Goods used together",
          "characteristics": ["Cross-price elasticity negative", "Used jointly", "Price of one affects demand for other inversely", "Examples: printers/ink, cars/gasoline", "Shift opposite direction of other's price"],
          "behavior": "Complements are goods that are typically used together. When the price of one good rises, the demand for its complement falls because the combined cost of using both increases. For example, if the price of printers rises significantly, fewer people buy printers, which reduces the demand for printer ink (even if ink prices haven't changed). Graphically, an increase in the price of a complement shifts the demand curve for the original good to the left. A decrease in the price of a complement shifts demand to the right. The cross-price elasticity of demand is negative for complements. The stronger the complementary relationship, the larger the effect.",
          
          "image": {
            "src": "images/unit2/complements.png",
            "alt": "Two products used together with arrow showing linked demand",
            "caption": "Figure 2.1.7: Complements are goods used together—price changes in one affect demand for the other."
          },
          
          "examples": [
            {
              "process": "Printers and ink cartridges",
              "explanation": "If printer prices fall, more people buy printers, increasing demand for ink cartridges (complement). If printer prices rise, ink demand falls."
            },
            {
              "process": "Cars and gasoline",
              "explanation": "Higher gas prices increase the cost of driving, reducing demand for cars. Cars and gasoline are complements."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Law of Demand: Inverse Price-Quantity Relationship",
          "statement": "The law of demand states that, ceteris paribus, as the price of a good increases, the quantity demanded decreases, and as price decreases, quantity demanded increases. This inverse relationship is one of the most robust findings in economics. It holds because: (1) Substitution effect: Higher price makes other goods relatively cheaper, leading consumers to substitute away. (2) Income effect: Higher price reduces purchasing power, effectively lowering real income and reducing quantity demanded. The law applies to virtually all goods, though the strength of the response varies (elasticity). Exceptions are rare (Giffen goods, Veblen goods) and mainly theoretical. Understanding this law is essential for predicting how consumers respond to price changes, taxes, and subsidies.",
          "application": "When analyzing a price change, predict that quantity demanded will move in the opposite direction. For policy analysis, consider how taxes (which raise prices) will reduce consumption, and subsidies (which lower prices) will increase consumption.",
          "example": "When a city imposes a congestion charge (price increase for driving in certain areas), the quantity of vehicles driven decreases. When a store has a sale (price decrease), quantity demanded increases.",
          
          "image": {
            "src": "images/unit2/law_of_demand.png",
            "alt": "Downward-sloping demand curve with arrows showing inverse relationship",
            "caption": "Figure 2.1.8: The law of demand: price up, quantity demanded down."
          }
        },
        {
          "principle": "Distinguish Between Change in Demand and Change in Quantity Demanded",
          "statement": "A common confusion in economics is the difference between a change in demand and a change in quantity demanded. A change in quantity demanded is a movement along a fixed demand curve, caused ONLY by a change in the price of the good itself. A change in demand is a shift of the entire demand curve, caused by a change in any other factor affecting demand—income, prices of related goods, tastes, expectations, or number of buyers. When the curve shifts, consumers buy different amounts at every price. This distinction is crucial for correctly analyzing market changes. In graphs, movements along are shown as arrows following the curve; shifts are shown as the curve moving to a new position.",
          "application": "When analyzing a market event, first identify whether price changed (causing movement) or something else changed (causing shift). For example, 'price of coffee increased' affects quantity demanded of coffee (movement). 'Income increased' affects demand for coffee (shift).",
          "example": "If the price of pizza rises, we move along the pizza demand curve—quantity demanded falls. If consumer incomes rise and pizza is normal, the entire pizza demand curve shifts right—more demanded at every price.",
          
          "image": {
            "src": "images/unit2/demand_vs_quantity.png",
            "alt": "Two graphs: one showing movement along demand curve, one showing shift of entire curve",
            "caption": "Figure 2.1.9: Change in quantity demanded (movement) vs. change in demand (shift)."
          }
        },
        {
          "principle": "Demand Curves Slope Downward Due to Substitution and Income Effects",
          "statement": "The downward slope of demand curves is explained by two complementary effects: (1) Substitution effect: When the price of a good rises, it becomes more expensive relative to other goods. Rational consumers substitute away from the now-more-expensive good toward relatively cheaper alternatives. For example, if the price of beef rises, consumers buy more chicken. This effect always leads consumers to buy less of a good when its price rises. (2) Income effect: When the price of a good rises, consumers' real income (purchasing power) falls because they must spend more to buy the same amount. With lower real income, they reduce consumption of normal goods (and may increase consumption of inferior goods, but the overall effect for normal goods is reduced consumption). For normal goods, both effects work in the same direction, reinforcing the law of demand. For inferior goods, the income effect works opposite, but the substitution effect dominates, so the law of demand still holds.",
          "application": "Understanding these effects helps explain consumer behavior beyond simple price responses. It also explains why demand for different goods responds differently to price changes based on their share of budget and availability of substitutes.",
          "example": "When gasoline prices spike, consumers substitute by carpooling or using public transit (substitution effect) and also have less real income to spend on other goods (income effect). Both reduce gasoline consumption.",
          
          "image": {
            "src": "images/unit2/substitution_income_effects.png",
            "alt": "Diagram showing substitution effect (switching to alternatives) and income effect (reduced purchasing power)",
            "caption": "Figure 2.1.10: Substitution and income effects explain why demand curves slope downward."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Movement vs. Shift Identification",
          
          "image": {
            "src": "images/unit2/demand_example1.png",
            "alt": "List of events affecting coffee market",
            "caption": "Figure 2.1.11: Identify whether each event changes demand or quantity demanded."
          },
          
          "problem": "For each event in the coffee market, identify whether it causes a change in demand (shift) or change in quantity demanded (movement):<br>a) The price of coffee increases by \\$1 per pound.<br>b) Consumer incomes decrease due to a recession.<br>c) The price of tea decreases significantly.<br>d) A new study finds that coffee reduces heart disease risk.<br>e) Coffee shops offer half-price lattes for one week.<br>f) The population increases due to immigration.",
          
          "step_by_step": [
            {
              "step": "Event a",
              "explanation": "Price of coffee itself changes. This causes a movement along the demand curve—change in quantity demanded, not demand."
            },
            {
              "step": "Event b",
              "explanation": "Income changes. Income is a demand shifter. Assuming coffee is normal, demand decreases (shifts left)."
            },
            {
              "step": "Event c",
              "explanation": "Price of a substitute (tea) changes. This shifts demand for coffee. Lower tea price makes tea more attractive, reducing coffee demand (shift left)."
            },
            {
              "step": "Event d",
              "explanation": "Tastes and preferences change due to health information. This shifts demand right (more coffee demanded at every price)."
            },
            {
              "step": "Event e",
              "explanation": "Price of coffee itself changes (temporary sale). This causes movement along demand—change in quantity demanded."
            },
            {
              "step": "Event f",
              "explanation": "Number of buyers increases. This shifts demand right."
            }
          ],
          
          "final_answer": "a) Movement, b) Shift, c) Shift, d) Shift, e) Movement, f) Shift",
          "concept_applied": "Only price changes cause movements along the demand curve. All other factors cause shifts."
        },
        {
          "title": "Constructing a Demand Schedule and Curve",
          
          "image": {
            "src": "images/unit2/demand_example2.png",
            "alt": "Table of prices and quantities",
            "caption": "Figure 2.1.12: Create demand schedule and graph from data."
          },
          
          "problem": "Market research provides the following data for monthly DVD demand:<br>At \\$20, quantity demanded = 100<br>At \\$18, quantity demanded = 150<br>At \\$16, quantity demanded = 200<br>At \\$14, quantity demanded = 250<br>At \\$12, quantity demanded = 300<br>a) Create a demand schedule (table).<br>b) Graph the demand curve.<br>c) What is the quantity demanded at \\$15?<br>d) If price increases from \\$14 to \\$16, what happens to quantity demanded?<br>e) If income increases and DVDs are normal, what happens to the curve?",
          
          "step_by_step": [
            {
              "step": "Create demand schedule",
              "explanation": "Table with two columns: Price and Quantity Demanded. List each price-quantity pair."
            },
            {
              "step": "Graph the demand curve",
              "explanation": "Plot points with price on Y-axis, quantity on X-axis. Connect with a downward-sloping line."
            },
            {
              "step": "Find quantity at \\$15",
              "explanation": "Between \\$14 (250) and \\$16 (200), linear interpolation gives about 225 units at \\$15."
            },
            {
              "step": "Price increase from \\$14 to \\$16",
              "explanation": "Quantity demanded falls from 250 to 200—a decrease of 50 units. This is a movement along the curve."
            },
            {
              "step": "Income increase effect",
              "explanation": "For normal goods, demand increases. The entire curve shifts right—more demanded at every price."
            }
          ],
          
          "final_answer": "c) Approximately 225 DVDs. d) Quantity demanded decreases by 50. e) Demand curve shifts right.",
          "concept_applied": "Demand schedules and curves organize price-quantity relationships. Shifts vs movements depend on the cause."
        },
        {
          "title": "Analyzing Normal vs. Inferior Goods",
          
          "image": {
            "src": "images/unit2/demand_example3.png",
            "alt": "Scenarios with income changes",
            "caption": "Figure 2.1.13: Determine how demand changes for different good types."
          },
          
          "problem": "For each scenario, determine whether demand increases, decreases, or is indeterminate, and identify the type of good:<br>a) Income rises by 10%. Good A consumption rises by 15%.<br>b) Income falls by 5%. Good B consumption falls by 2%.<br>c) Income rises by 20%. Good C consumption falls by 10%.<br>d) Income falls by 8%. Good D consumption rises by 5%.<br>e) Income doubles. Good E consumption stays the same.",
          
          "step_by_step": [
            {
              "step": "Scenario a",
              "explanation": "Income rises, consumption rises more than proportionally (15% > 10%). This is a normal good, specifically a luxury. Demand increases."
            },
            {
              "step": "Scenario b",
              "explanation": "Income falls, consumption falls less than proportionally (2% < 5%). This is a normal good, specifically a necessity. Demand decreases."
            },
            {
              "step": "Scenario c",
              "explanation": "Income rises, consumption falls. This is an inferior good. Demand decreases (shifts left)."
            },
            {
              "step": "Scenario d",
              "explanation": "Income falls, consumption rises. This is an inferior good. Demand increases (shifts right)."
            },
            {
              "step": "Scenario e",
              "explanation": "Income doubles, consumption unchanged. This is unusual—income elasticity of zero. The good is neither normal nor inferior in this range."
            }
          ],
          
          "final_answer": "a) Increase, normal luxury. b) Decrease, normal necessity. c) Decrease, inferior. d) Increase, inferior. e) No change, income elasticity zero.",
          "concept_applied": "Income changes affect normal and inferior goods differently. Normal goods increase with income; inferior goods decrease."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Good and Market",
          "description": "Clearly define the product and the geographic/temporal market.",
          "mechanism": "Specify what good, what time period, and what geographic area. Demand varies by context.",
          "result": "Clear market definition.",
          
          "image": {
            "src": "images/unit2/demand_step1.png",
            "alt": "Magnifying glass over product with location and time",
            "caption": "Figure 2.1.14: Step 1 - Define the good and market clearly."
          }
        },
        {
          "step": 2,
          "process": "Gather Price-Quantity Data",
          "description": "Collect information on how much consumers buy at different prices.",
          "mechanism": "Market research, historical data, surveys, or economic models provide demand information.",
          "result": "Demand schedule (table of prices and quantities).",
          
          "image": {
            "src": "images/unit2/demand_step2.png",
            "alt": "Table with prices and quantities",
            "caption": "Figure 2.1.15: Step 2 - Gather data on quantities demanded at various prices."
          }
        },
        {
          "step": 3,
          "process": "Graph the Demand Curve",
          "description": "Plot the relationship with price on vertical axis, quantity on horizontal.",
          "mechanism": "Plot each price-quantity point. Connect points to form curve (usually downward-sloping).",
          "result": "Visual demand curve.",
          
          "image": {
            "src": "images/unit2/demand_step3.png",
            "alt": "Points plotted and connected to form downward-sloping curve",
            "caption": "Figure 2.1.16: Step 3 - Plot points and draw the demand curve."
          }
        },
        {
          "step": 4,
          "process": "Identify Demand Shifters",
          "description": "Consider factors other than price that affect demand.",
          "mechanism": "List: income, related goods prices, tastes, expectations, number of buyers. Assess current values.",
          "result": "Understanding of factors that could shift demand.",
          
          "image": {
            "src": "images/unit2/demand_step4.png",
            "alt": "Icons for income, substitutes, complements, tastes, expectations, buyers",
            "caption": "Figure 2.1.17: Step 4 - Identify factors that could shift demand."
          }
        },
        {
          "step": 5,
          "process": "Analyze Changes",
          "description": "Determine whether events cause movements or shifts.",
          "mechanism": "If price changes → movement. If any shifter changes → shift (right for increase, left for decrease).",
          "result": "Correct prediction of demand response.",
          
          "image": {
            "src": "images/unit2/demand_step5.png",
            "alt": "Decision tree: price change? → movement; else → shift",
            "caption": "Figure 2.1.18: Step 5 - Analyze whether events cause movements or shifts."
          }
        }
      ],

      "image": {
        "src": "images/unit2/demand_summary.png",
        "alt": "Comprehensive demand summary: law of demand, curve, shifters, movements vs shifts, normal vs inferior, substitutes vs complements",
        "caption": "Figure 2.1.19: Demand summary - law, curve, shifters, and key distinctions."
      }
    }
  ],

  "key_terms": [
    "Demand",
    "Law of demand",
    "Quantity demanded",
    "Demand curve",
    "Demand schedule",
    "Change in demand",
    "Change in quantity demanded",
    "Demand shifters",
    "Normal good",
    "Inferior good",
    "Substitutes",
    "Complements",
    "Income effect",
    "Substitution effect",
    "Ceteris paribus",
    "Consumer sovereignty",
    "Market demand",
    "Individual demand",
    "Income elasticity",
    "Cross-price elasticity"
  ],

  "summary": "The law of demand states that, ceteris paribus, price and quantity demanded are inversely related: as price increases, quantity demanded decreases, and vice versa. This relationship is explained by the substitution effect (consumers switch to alternatives when price rises) and the income effect (higher prices reduce real income, reducing purchasing power). The demand curve slopes downward, showing this inverse relationship. A change in the price of the good causes a change in quantity demanded—a movement along the curve. A change in any other factor affecting demand—income, prices of related goods, tastes, expectations, or number of buyers—causes a change in demand—a shift of the entire curve. Normal goods see demand increase when income rises; inferior goods see demand decrease when income rises. Substitutes are goods used in place of each other (price increase in one increases demand for the other); complements are goods used together (price increase in one decreases demand for the other). Understanding demand is essential for analyzing consumer behavior and market outcomes."
}
