{
  "expanded_description": "Why do producers offer more for sale when prices are high? The answer lies in the law of supply: as price increases, quantity supplied increases, and as price decreases, quantity supplied decreases. Producers respond to higher prices because they make production more profitable, allowing them to cover higher costs and attracting new firms into the market. But supply, like demand, is influenced by many factors beyond just price—input costs, technology, expectations, and the number of sellers all play crucial roles. In this section, we'll explore the law of supply, what shapes supply curves, the difference between supply and quantity supplied, and the factors that shift supply.",
  
  "core_concept": {
    "principle": "Supply refers to the entire relationship between price and quantity supplied, while quantity supplied is the specific amount producers are willing to sell at a particular price. The law of supply states that, ceteris paribus, there is a direct relationship between price and quantity supplied. As price increases, quantity supplied increases; as price decreases, quantity supplied decreases. This occurs because: (1) Higher prices increase revenue per unit, making production more profitable, encouraging firms to produce more. (2) Higher prices allow firms to cover higher marginal costs that come from increasing production (due to diminishing returns). (3) In the long run, higher prices attract new firms into the market. The supply curve graphs this relationship with price on the vertical axis and quantity on the horizontal axis. It slopes upward. A change in price causes a movement along the supply curve—a change in quantity supplied. A change in any other factor affecting supply causes the entire curve to shift—a change in supply.",
    
    "explanation": "Think of supply like a farmer deciding how much to plant. When crop prices are high, the farmer plants every available acre, maybe even renting additional land. When prices are low, the farmer plants only the best fields and leaves marginal land fallow. This behavior—producing more when prices are high, less when they're low—is the law of supply in action.",
    
    "image": {
      "src": "images/unit2/supply_overview.png",
      "alt": "Farmer with fields, planting more when prices are high, less when prices are low",
      "caption": "Figure 2.2.1: The law of supply captures how producers respond to price changes."
    }
  },

  "sections": [
    {
      "section_title": "2.2 Law of Supply",
      "introduction": "Why do farmers plant more corn when prices are high? Why do oil companies drill more when oil prices rise? These behaviors reflect the law of supply: when price increases, quantity supplied increases. Producers respond to higher prices by increasing production because it becomes more profitable. But supply is more complex than just this relationship—it depends on production costs, technology, and expectations. In this section, we'll explore the law of supply, what shapes supply curves, the difference between supply and quantity supplied, and the factors that shift supply.",
      
      "introduction_image": {
        "src": "images/unit2/supply_intro.png",
        "alt": "Factory production line speeding up as demand increases",
        "caption": "Figure 2.2.2: The law of supply captures how producers respond to price changes."
      },
      
      "key_concept": {
        "definition": "Supply is the relationship between the price of a good and the quantity producers are willing and able to sell, ceteris paribus. The law of supply states that price and quantity supplied are directly related: as price increases, quantity supplied increases; as price decreases, quantity supplied decreases. This direct relationship is explained by: (1) Profit incentive: Higher prices increase revenue per unit, making production more profitable and encouraging firms to increase output. (2) Increasing marginal cost: Due to diminishing returns, producing more units raises cost per unit, so higher prices are needed to justify additional production. (3) New entrants: In the long run, higher prices attract new firms into the industry. A supply schedule is a table showing quantities supplied at different prices. A supply curve graphs this relationship with price on the vertical axis and quantity on the horizontal axis. It slopes upward. Critical distinction: A change in the price of the good causes a change in quantity supplied—a movement along the supply curve. A change in any other factor affecting producers' willingness or ability to sell causes a change in supply—a shift of the entire curve.",
        
        "context": "The law of supply was formalized alongside demand by Alfred Marshall. It reflects the profit-maximizing behavior of firms. In the short run, supply curves slope upward because of diminishing returns—as firms increase output, marginal costs rise, requiring higher prices to justify additional production. In the long run, supply may be more elastic as firms can adjust capacity. Understanding supply is essential for analyzing production decisions, industry dynamics, and the effects of taxes, regulations, and technological change.",
        
        "image": {
          "src": "images/unit2/supply_curve.png",
          "alt": "Upward-sloping supply curve with price on Y-axis and quantity on X-axis",
          "caption": "Figure 2.2.3: The supply curve slopes upward, showing direct price-quantity relationship."
        }
      },

      "classifications": [
        {
          "type": "Input Price Changes",
          "value": "Changes in cost of factors of production affect supply",
          "characteristics": ["Wages", "Raw materials", "Energy costs", "Capital costs", "Shift opposite direction of input price"],
          "behavior": "Input prices are a major determinant of supply. When the cost of labor, materials, energy, or other inputs rises, production becomes more expensive at every output level, reducing profitability. Firms respond by producing less at any given price—the supply curve shifts left. Conversely, when input prices fall, production becomes cheaper, increasing profitability and shifting supply right. For example, if steel prices rise, automobile supply decreases (shift left). If wages fall, supply increases (shift right). The size of the shift depends on how important the input is in production and how easily firms can substitute away from it.",
          
          "image": {
            "src": "images/unit2/input_prices.png",
            "alt": "Factory with input costs rising, supply curve shifting left",
            "caption": "Figure 2.2.4: Higher input prices decrease supply (shift left); lower input prices increase supply (shift right)."
          },
          
          "examples": [
            {
              "process": "Oil prices and gasoline",
              "explanation": "Crude oil is the main input for gasoline. When oil prices rise, gasoline supply decreases (shift left) because it's more expensive to produce gasoline at any given price."
            },
            {
              "process": "Minimum wage increase",
              "explanation": "A higher minimum wage increases labor costs for restaurants, reducing the supply of restaurant meals (shift left) as some restaurants may close or reduce hours."
            }
          ]
        },
        {
          "type": "Technology",
          "value": "Improvements in production methods increase supply",
          "characteristics": ["Innovation", "Better machinery", "Process improvements", "Automation", "Shift right"],
          "behavior": "Technological progress reduces production costs, allowing firms to produce more output with the same inputs or the same output with fewer inputs. This increases profitability and shifts the supply curve to the right—more is supplied at every price. Technology can take many forms: new machinery, better production processes, improved organization, or innovations that reduce waste. Technological change is a primary driver of economic growth and has dramatically increased supply in industries from agriculture to manufacturing to services. In the modern economy, rapid technological progress continuously shifts supply curves rightward, lowering prices and increasing quantities over time for many goods.",
          
          "image": {
            "src": "images/unit2/technology.png",
            "alt": "Factory with new technology, supply curve shifting right",
            "caption": "Figure 2.2.5: Technological improvements increase supply (shift right)."
          },
          
          "examples": [
            {
              "process": "Solar panel production",
              "explanation": "Advances in manufacturing have dramatically reduced the cost of producing solar panels. The supply curve for solar panels has shifted far right, lowering prices and increasing adoption."
            },
            {
              "process": "Fracking technology",
              "explanation": "Hydraulic fracturing technology made it profitable to extract oil and gas from previously inaccessible deposits. This shifted the supply of oil and gas rightward, lowering energy prices."
            }
          ]
        },
        {
          "type": "Taxes and Subsidies",
          "value": "Government policies affect production costs",
          "characteristics": ["Per-unit taxes increase costs", "Subsidies decrease costs", "Taxes shift left", "Subsidies shift right", "Regulatory costs"],
          "behavior": "Government policies significantly affect supply. Taxes on production (per-unit taxes, excise taxes, or taxes on inputs) increase the cost of production, reducing profitability and shifting supply left. For example, a tax on cigarettes reduces the supply of cigarettes. Subsidies (government payments to producers) reduce production costs, increasing profitability and shifting supply right. For example, agricultural subsidies increase the supply of corn. Regulations can also affect supply: environmental regulations, safety standards, and licensing requirements may increase production costs, shifting supply left. Deregulation may reduce costs and shift supply right. Understanding these effects is crucial for analyzing the impact of government policy on markets.",
          
          "image": {
            "src": "images/unit2/taxes_subsidies.png",
            "alt": "Tax icon causing left shift, subsidy icon causing right shift",
            "caption": "Figure 2.2.6: Taxes decrease supply (shift left); subsidies increase supply (shift right)."
          },
          
          "examples": [
            {
              "process": "Sugar tax",
              "explanation": "A tax on sugary drinks increases production costs for beverage companies, shifting the supply curve for sugary drinks left (higher price, lower quantity)."
            },
            {
              "process": "Renewable energy subsidies",
              "explanation": "Government subsidies for wind power reduce production costs for wind energy companies, shifting supply right and encouraging more renewable energy production."
            }
          ]
        },
        {
          "type": "Number of Sellers",
          "value": "More sellers increase market supply",
          "characteristics": ["Market entry", "Market exit", "Industry expansion", "Industry contraction", "Shift right with more sellers"],
          "behavior": "The number of sellers in a market directly affects market supply. When new firms enter an industry, market supply increases—the supply curve shifts right. When firms exit (due to bankruptcy, retirement, or moving to other industries), market supply decreases—the supply curve shifts left. Entry and exit are driven by profitability: in the long run, firms enter profitable industries and exit unprofitable ones. This adjustment is a key mechanism that drives markets toward long-run equilibrium. For example, the craft beer boom saw hundreds of new breweries enter, dramatically increasing the supply of craft beer. Conversely, the decline of video rental stores saw many firms exit, decreasing supply.",
          
          "image": {
            "src": "images/unit2/number_sellers.png",
            "alt": "Multiple factories appearing (entry) shifting supply right, factories closing (exit) shifting left",
            "caption": "Figure 2.2.7: More sellers increase supply (shift right); fewer sellers decrease supply (shift left)."
          },
          
          "examples": [
            {
              "process": "Craft beer industry",
              "explanation": "Hundreds of new breweries opened in the US over the past decade. This increased the supply of craft beer, shifting the supply curve right."
            },
            {
              "process": "Independent bookstores",
              "explanation": "Competition from Amazon and chains caused many independent bookstores to close, decreasing the supply of books from this channel (shift left)."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Law of Supply: Direct Price-Quantity Relationship",
          "statement": "The law of supply states that, ceteris paribus, as the price of a good increases, the quantity supplied increases, and as price decreases, quantity supplied decreases. This direct relationship holds because: (1) Higher prices increase revenue per unit, making production more profitable and encouraging firms to increase output. (2) Higher prices allow firms to cover the higher marginal costs that come from increasing production (due to diminishing returns). (3) In the long run, higher prices attract new firms into the industry, further increasing quantity supplied. The law applies to most goods and services, though the strength of the response varies (elasticity). Understanding this law is essential for predicting how producers respond to price changes, taxes, and market opportunities.",
          "application": "When analyzing a price change, predict that quantity supplied will move in the same direction. For policy analysis, consider how subsidies (which effectively increase price received by producers) will increase supply, and taxes (which reduce net price) will decrease supply.",
          "example": "When the price of corn rises due to increased demand for ethanol, farmers plant more corn, increasing quantity supplied. When hotel prices drop during off-season, hotels take rooms offline or reduce staff, decreasing quantity supplied.",
          
          "image": {
            "src": "images/unit2/law_of_supply.png",
            "alt": "Upward-sloping supply curve with arrows showing direct relationship",
            "caption": "Figure 2.2.8: The law of supply: price up, quantity supplied up."
          }
        },
        {
          "principle": "Distinguish Between Change in Supply and Change in Quantity Supplied",
          "statement": "Just as with demand, it's crucial to distinguish between a change in supply and a change in quantity supplied. A change in quantity supplied is a movement along a fixed supply curve, caused ONLY by a change in the price of the good itself. A change in supply is a shift of the entire supply curve, caused by a change in any other factor affecting supply—input prices, technology, expectations, number of sellers, or taxes/subsidies. When the curve shifts, producers offer different amounts at every price. This distinction is essential for correctly analyzing market events. In graphs, movements along are shown as arrows following the curve; shifts are shown as the curve moving to a new position.",
          "application": "When analyzing a market event, first identify whether price changed (causing movement) or something else changed (causing shift). For example, 'price of oil increased' affects quantity supplied of oil (movement). 'New drilling technology developed' affects supply of oil (shift).",
          "example": "If the price of wheat rises, we move along the wheat supply curve—quantity supplied increases. If a new drought-resistant seed is developed, the entire wheat supply curve shifts right—more supplied at every price.",
          
          "image": {
            "src": "images/unit2/supply_vs_quantity.png",
            "alt": "Two graphs: one showing movement along supply curve, one showing shift of entire curve",
            "caption": "Figure 2.2.9: Change in quantity supplied (movement) vs. change in supply (shift)."
          }
        },
        {
          "principle": "Supply Curves Slope Upward Due to Increasing Marginal Cost",
          "statement": "The upward slope of supply curves reflects increasing marginal cost. As firms produce more output, they typically face rising costs per unit. This occurs because: (1) In the short run, diminishing returns mean that adding more variable inputs (like labor) to fixed inputs (like factories) eventually yields smaller increases in output, raising cost per unit. (2) Firms may need to use less efficient resources as they expand—the best land, workers, and machines are used first; expanding requires using resources that are less productive. (3) In the long run, industry expansion may bid up input prices, increasing costs for all firms. For these reasons, higher prices are needed to induce firms to increase quantity supplied. The supply curve's slope reflects these increasing costs. In some cases, supply curves can be vertical (fixed supply, like land) or horizontal (constant costs), but upward slope is typical.",
          "application": "Understanding why supply slopes upward helps predict how much quantity will respond to price changes. Steeper supply curves mean quantity supplied is less responsive to price changes; flatter curves mean more responsive.",
          "example": "A small bakery can increase bread production by hiring an extra worker, but eventually kitchen space limits output. To produce even more, they'd need a larger kitchen (higher fixed costs), so they'll only expand if prices are high enough to justify the investment.",
          
          "image": {
            "src": "images/unit2/marginal_cost.png",
            "alt": "Graph showing rising marginal cost curve, which is the supply curve",
            "caption": "Figure 2.2.10: Supply curves slope upward because marginal cost increases with output."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Movement vs. Shift Identification - Supply",
          
          "image": {
            "src": "images/unit2/supply_example1.png",
            "alt": "List of events affecting gasoline market",
            "caption": "Figure 2.2.11: Identify whether each event changes supply or quantity supplied."
          },
          
          "problem": "For each event in the gasoline market, identify whether it causes a change in supply (shift) or change in quantity supplied (movement):<br>a) The price of gasoline increases by \\$0.50 per gallon.<br>b) The price of crude oil (an input) increases sharply.<br>c) A new refining technology reduces production costs.<br>d) Several oil refineries are closed due to a hurricane.<br>e) The government imposes a new tax on gasoline.<br>f) Gas stations expect prices to rise next week.",
          
          "step_by_step": [
            {
              "step": "Event a",
              "explanation": "Price of gasoline itself changes. This causes a movement along the supply curve—change in quantity supplied, not supply."
            },
            {
              "step": "Event b",
              "explanation": "Input price increases. This shifts supply left (decreases supply) because production costs rise."
            },
            {
              "step": "Event c",
              "explanation": "Technology improves. This reduces costs and shifts supply right (increases supply)."
            },
            {
              "step": "Event d",
              "explanation": "Number of sellers decreases (refineries close). This shifts supply left."
            },
            {
              "step": "Event e",
              "explanation": "Tax increases production costs. This shifts supply left."
            },
            {
              "step": "Event f",
              "explanation": "Expectations of future price increases. Sellers may hold back supply to sell later at higher prices, shifting current supply left."
            }
          ],
          
          "final_answer": "a) Movement, b) Shift, c) Shift, d) Shift, e) Shift, f) Shift",
          "concept_applied": "Only price changes cause movements along supply. All other factors cause shifts."
        },
        {
          "title": "Constructing a Supply Schedule and Curve",
          
          "image": {
            "src": "images/unit2/supply_example2.png",
            "alt": "Table of prices and quantities supplied",
            "caption": "Figure 2.2.12: Create supply schedule and graph from data."
          },
          
          "problem": "A study of wheat farmers provides the following data for monthly wheat supply:<br>At \\$4 per bushel, quantity supplied = 1000 bushels<br>At \\$5 per bushel, quantity supplied = 1500<br>At \\$6 per bushel, quantity supplied = 1900<br>At \\$7 per bushel, quantity supplied = 2200<br>At \\$8 per bushel, quantity supplied = 2400<br>a) Create a supply schedule (table).<br>b) Graph the supply curve.<br>c) What is the quantity supplied at \\$6.50?<br>d) If price decreases from \\$7 to \\$5, what happens to quantity supplied?<br>e) If new fertilizer increases yields, what happens to the curve?",
          
          "step_by_step": [
            {
              "step": "Create supply schedule",
              "explanation": "Table with two columns: Price and Quantity Supplied. List each price-quantity pair."
            },
            {
              "step": "Graph the supply curve",
              "explanation": "Plot points with price on Y-axis, quantity on X-axis. Connect with an upward-sloping line."
            },
            {
              "step": "Find quantity at \\$6.50",
              "explanation": "Between \\$6 (1900) and \\$7 (2200), linear interpolation gives about 2050 bushels at \\$6.50."
            },
            {
              "step": "Price decrease from \\$7 to \\$5",
              "explanation": "Quantity supplied falls from 2200 to 1500—a decrease of 700 bushels. This is a movement along the curve."
            },
            {
              "step": "New fertilizer effect",
              "explanation": "Technology improves (better input). Supply increases—the entire curve shifts right."
            }
          ],
          
          "final_answer": "c) Approximately 2050 bushels. d) Quantity supplied decreases by 700. e) Supply curve shifts right.",
          "concept_applied": "Supply schedules and curves organize price-quantity relationships. Shifts vs movements depend on the cause."
        },
        {
          "title": "Analyzing Supply Shifters",
          
          "image": {
            "src": "images/unit2/supply_example3.png",
            "alt": "Scenarios with various supply-changing events",
            "caption": "Figure 2.2.13: Determine how each event affects supply."
          },
          
          "problem": "For each event, determine whether supply increases (shifts right), decreases (shifts left), or remains unchanged (movement along):<br>a) The price of coffee beans falls.<br>b) A new machine halves production time for widgets.<br>c) The government reduces taxes on manufacturers.<br>d) The market price of the good increases by 10%.<br>e) A flood destroys several factories in the industry.<br>f) Wages for production workers increase significantly.",
          
          "step_by_step": [
            {
              "step": "Event a",
              "explanation": "Input price falls (coffee beans). This reduces costs, increasing supply—shift right."
            },
            {
              "step": "Event b",
              "explanation": "Technology improves. This reduces costs, increasing supply—shift right."
            },
            {
              "step": "Event c",
              "explanation": "Tax reduction decreases costs, increasing supply—shift right."
            },
            {
              "step": "Event d",
              "explanation": "Price of the good itself increases. This causes movement along supply—increase in quantity supplied, not supply shift."
            },
            {
              "step": "Event e",
              "explanation": "Number of sellers decreases (factories destroyed). This decreases supply—shift left."
            },
            {
              "step": "Event f",
              "explanation": "Input price (wages) increases. This increases costs, decreasing supply—shift left."
            }
          ],
          
          "final_answer": "a) Right shift, b) Right shift, c) Right shift, d) No shift (movement), e) Left shift, f) Left shift",
          "concept_applied": "Supply shifters include input prices, technology, taxes/subsidies, number of sellers, expectations, and natural conditions."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Good and Market",
          "description": "Clearly define the product and market scope.",
          "mechanism": "Specify what good, time period, and geographic area. Supply varies by context.",
          "result": "Clear market definition.",
          
          "image": {
            "src": "images/unit2/supply_step1.png",
            "alt": "Factory icon with location and product",
            "caption": "Figure 2.2.14: Step 1 - Define the good and market clearly."
          }
        },
        {
          "step": 2,
          "process": "Gather Price-Quantity Data",
          "description": "Collect information on how much producers supply at different prices.",
          "mechanism": "Industry data, surveys, or economic models provide supply information.",
          "result": "Supply schedule (table of prices and quantities).",
          
          "image": {
            "src": "images/unit2/supply_step2.png",
            "alt": "Table with prices and quantities supplied",
            "caption": "Figure 2.2.15: Step 2 - Gather data on quantities supplied at various prices."
          }
        },
        {
          "step": 3,
          "process": "Graph the Supply Curve",
          "description": "Plot the relationship with price on vertical axis, quantity on horizontal.",
          "mechanism": "Plot each price-quantity point. Connect points to form curve (usually upward-sloping).",
          "result": "Visual supply curve.",
          
          "image": {
            "src": "images/unit2/supply_step3.png",
            "alt": "Points plotted and connected to form upward-sloping curve",
            "caption": "Figure 2.2.16: Step 3 - Plot points and draw the supply curve."
          }
        },
        {
          "step": 4,
          "process": "Identify Supply Shifters",
          "description": "Consider factors other than price that affect supply.",
          "mechanism": "List: input prices, technology, expectations, number of sellers, taxes/subsidies, natural conditions. Assess current values.",
          "result": "Understanding of factors that could shift supply.",
          
          "image": {
            "src": "images/unit2/supply_step4.png",
            "alt": "Icons for input prices, technology, taxes, sellers, expectations, natural factors",
            "caption": "Figure 2.2.17: Step 4 - Identify factors that could shift supply."
          }
        },
        {
          "step": 5,
          "process": "Analyze Changes",
          "description": "Determine whether events cause movements or shifts.",
          "mechanism": "If price changes → movement. If any shifter changes → shift (right for increase, left for decrease).",
          "result": "Correct prediction of supply response.",
          
          "image": {
            "src": "images/unit2/supply_step5.png",
            "alt": "Decision tree: price change? → movement; else → shift",
            "caption": "Figure 2.2.18: Step 5 - Analyze whether events cause movements or shifts."
          }
        }
      ],

      "image": {
        "src": "images/unit2/supply_summary.png",
        "alt": "Comprehensive supply summary: law of supply, curve, shifters, movements vs shifts",
        "caption": "Figure 2.2.19: Supply summary - law, curve, shifters, and key distinctions."
      }
    }
  ],

  "key_terms": [
    "Supply",
    "Law of supply",
    "Quantity supplied",
    "Supply curve",
    "Supply schedule",
    "Change in supply",
    "Change in quantity supplied",
    "Supply shifters",
    "Input prices",
    "Technology",
    "Expectations",
    "Number of sellers",
    "Taxes",
    "Subsidies",
    "Natural conditions",
    "Marginal cost",
    "Increasing marginal cost",
    "Diminishing returns",
    "Profit motive",
    "Market supply",
    "Individual supply",
    "Short run",
    "Long run",
    "Entry",
    "Exit"
  ],

  "summary": "The law of supply states that, ceteris paribus, price and quantity supplied are directly related: as price increases, quantity supplied increases, and vice versa. This relationship is explained by the profit motive (higher prices make production more profitable) and increasing marginal cost (firms need higher prices to cover rising costs as output expands). The supply curve slopes upward, showing this direct relationship. A change in the price of the good causes a change in quantity supplied—a movement along the curve. A change in any other factor affecting supply—input prices, technology, expectations, number of sellers, taxes/subsidies, or natural conditions—causes a change in supply—a shift of the entire curve. Lower input prices, better technology, subsidies, and more sellers shift supply right (increase). Higher input prices, taxes, and fewer sellers shift supply left (decrease). Understanding supply is essential for analyzing producer behavior and market outcomes."
}
