{
  "expanded_description": "Why do some things cost more than others? Why are concert tickets sometimes impossible to get, while other events have plenty of empty seats? The answer lies in the interaction of two powerful forces: supply and demand. These twin concepts are the foundation of microeconomics, explaining how prices are determined and how markets allocate resources. When you understand supply and demand, you understand why gasoline prices rise in the summer, why rent is higher in cities, and why new technology gets cheaper over time. In this unit, we'll explore the laws of supply and demand, how they interact to determine market prices and quantities, what happens when markets are out of balance, and how changes in underlying conditions shift the curves and create new equilibria.",
  
  "core_concept": {
    "principle": "Supply and demand are the forces that make market economies work. They determine the quantity of each good produced and the price at which it is sold. (1) Demand: The relationship between price and quantity demanded by consumers. The law of demand states that, ceteris paribus, as price increases, quantity demanded decreases—an inverse relationship. This is shown by a downward-sloping demand curve. (2) Supply: The relationship between price and quantity supplied by producers. The law of supply states that, ceteris paribus, as price increases, quantity supplied increases—a direct relationship. This is shown by an upward-sloping supply curve. (3) Market equilibrium: The point where supply and demand curves intersect, determining the market-clearing price and quantity. At this price, the quantity consumers want to buy exactly equals the quantity producers want to sell. (4) Disequilibrium: When price is above equilibrium, quantity supplied exceeds quantity demanded, creating a surplus. When price is below equilibrium, quantity demanded exceeds quantity supplied, creating a shortage. Market forces push prices toward equilibrium. (5) Shifts vs. movements: Changes in price cause movements along curves. Changes in other factors (income, input prices, technology, etc.) cause the entire curves to shift, creating new equilibria.",
    
    "explanation": "Think of supply and demand like a dance. Consumers want low prices; producers want high prices. The market price is where they meet—the compromise that clears the market. If price is too high, too many sellers want to dance but few buyers show up (surplus). If price is too low, too many buyers want to dance but few sellers appear (shortage). The price adjusts until the number of willing buyers equals the number of willing sellers—the market equilibrium.",
    
    "image": {
      "src": "images/unit2/supply_demand_overview.png",
      "alt": "Basic supply and demand graph showing downward-sloping demand curve, upward-sloping supply curve, and equilibrium intersection",
      "caption": "Figure 2.0.1: Supply and demand determine market prices and quantities."
    }
  },

  "sections": [
    {
      "section_title": "2.1 Law of Demand",
      "introduction": "Why do people buy more strawberries when they're in season and cheap, and fewer when they're expensive? This everyday observation reflects the law of demand: when price goes up, quantity demanded goes down, and vice versa. But demand is more than just a simple relationship—it reflects consumer preferences, income, and the prices of related goods. In this section, we'll explore the law of demand, what shapes demand curves, the difference between demand and quantity demanded, and the factors that can cause demand to shift.",
      
      "introduction_image": {
        "src": "images/unit2/demand_intro.png",
        "alt": "Shopper looking at price tags, deciding whether to buy based on price",
        "caption": "Figure 2.1.1: The law of demand captures how consumers respond to price changes."
      },
      
      "key_concept": {
        "definition": "Demand refers to the entire relationship between price and quantity demanded, while quantity demanded is the specific amount consumers are willing to buy at a particular price. The law of demand states that, ceteris paribus (all else equal), there is an inverse relationship between price and quantity demanded. This occurs for two reasons: (1) Substitution effect: As price rises, consumers substitute toward relatively cheaper alternatives. (2) Income effect: As price rises, consumers' real income falls, reducing purchasing power and quantity demanded. The demand curve graphs this relationship with price on the vertical axis and quantity on the horizontal axis. It slopes downward. A change in price causes a movement along the demand curve—a change in quantity demanded. A change in any other factor affecting demand causes the entire curve to shift—a change in demand. Key shifters (determinants of demand) include: (a) Income: For normal goods, demand increases when income rises; for inferior goods, demand decreases when income rises. (b) Prices of related goods: For substitutes (goods used in place of each other), a price increase in one increases demand for the other. For complements (goods used together), a price increase in one decreases demand for the other. (c) Tastes and preferences: Changes in consumer preferences shift demand. (d) Expectations: Expectations of future prices or income can shift current demand. (e) Number of buyers: More buyers increases demand.",
        
        "context": "The concept of demand has been understood for centuries, but Alfred Marshall formalized it in his 1890 book 'Principles of Economics,' introducing the supply and demand diagram still used today. The law of demand is one of the most robust empirical regularities in economics—it holds across virtually all goods and contexts. Understanding demand is essential for analyzing consumer behavior, pricing decisions, and the effects of taxes, subsidies, and regulations.",
        
        "image": {
          "src": "images/unit2/demand_curve.png",
          "alt": "Downward-sloping demand curve with price and quantity axes labeled, showing movement along vs shift",
          "caption": "Figure 2.1.2: The demand curve slopes downward, showing inverse price-quantity relationship."
        }
      },

      "classifications": [
        {
          "type": "Normal Goods",
          "value": "Goods for which demand increases as income increases",
          "characteristics": ["Positive income elasticity", "Luxury goods", "Necessities", "Most goods", "Shift right with income growth"],
          "behavior": "Normal goods are what most people think of as typical goods: when consumers have more income, they buy more of them. This includes everything from restaurant meals to new cars to clothing. Normal goods can be further divided into necessities (goods we buy regardless of income, but buy slightly more as income rises—like basic food) and luxuries (goods we buy disproportionately more as income rises—like high-end electronics or vacations). For normal goods, the demand curve shifts to the right when income increases (more demanded at every price) and to the left when income decreases. The strength of the response depends on whether the good is a necessity or luxury.",
          
          "image": {
            "src": "images/unit2/normal_goods.png",
            "alt": "Graph showing demand curve shifting right as income increases",
            "caption": "Figure 2.1.3: Normal goods see increased demand when income rises."
          },
          
          "examples": [
            {
              "process": "Restaurant meals",
              "explanation": "When people get raises, they tend to eat out more often. Demand for restaurant meals increases with income—a normal good."
            },
            {
              "process": "New cars",
              "explanation": "As incomes rise, more households can afford new cars, increasing demand. During recessions (income falls), new car demand drops."
            }
          ]
        },
        {
          "type": "Inferior Goods",
          "value": "Goods for which demand decreases as income increases",
          "characteristics": ["Negative income elasticity", "Lower-quality alternatives", "Shift left with income growth", "Often basic staples", "Related to perceived quality"],
          "behavior": "Inferior goods are goods that consumers buy less of as their income rises. This doesn't mean the goods are low quality in an absolute sense—they're goods that people replace with better alternatives when they can afford to. Examples include generic brands, public transportation, and instant noodles. When a consumer's income increases, they might switch from generic cereal to name-brand, from bus to car, or from instant noodles to restaurant meals. For inferior goods, the demand curve shifts to the left when income increases (less demanded at every price) and to the right when income decreases. The term 'inferior' is an economic classification, not a value judgment—it simply describes how demand responds to income changes.",
          
          "image": {
            "src": "images/unit2/inferior_goods.png",
            "alt": "Graph showing demand curve shifting left as income increases",
            "caption": "Figure 2.1.4: Inferior goods see decreased demand when income rises."
          },
          
          "examples": [
            {
              "process": "Generic cereal",
              "explanation": "A budget-conscious consumer buys generic corn flakes. After a promotion and raise, they switch to a name brand. Demand for generic cereal falls as income rises—it's an inferior good."
            },
            {
              "process": "Public transit",
              "explanation": "Low-income workers rely on buses. As their incomes rise, many buy cars and use transit less. Public transit ridership often declines in prosperous times (inferior) and increases in recessions."
            }
          ]
        },
        {
          "type": "Substitutes",
          "value": "Goods used in place of each other",
          "characteristics": ["Cross-price elasticity positive", "Competing goods", "Price of one affects demand for other", "Examples: Coke/Pepsi, tea/coffee", "Shift same direction as other's price"],
          "behavior": "Substitutes are goods that can be used in place of each other. When the price of one good rises, consumers switch to the substitute, increasing demand for the substitute. For example, if the price of coffee rises significantly, some consumers will switch to tea, increasing the demand for tea. Graphically, an increase in the price of a substitute shifts the demand curve for the original good to the right. A decrease in the price of a substitute shifts demand to the left. The cross-price elasticity of demand (responsiveness of demand for one good to price changes in another) is positive for substitutes. The closer the substitutes, the stronger the effect.",
          
          "image": {
            "src": "images/unit2/substitutes.png",
            "alt": "Two products side by side with arrow showing switching when price changes",
            "caption": "Figure 2.1.5: Substitutes are goods used in place of each other—price changes in one affect demand for the other."
          },
          
          "examples": [
            {
              "process": "Coke and Pepsi",
              "explanation": "If Pepsi's price increases, Coke becomes relatively cheaper. Consumers buy more Coke, shifting Coke's demand curve right. If Pepsi's price decreases, Coke demand shifts left."
            },
            {
              "process": "Butter and margarine",
              "explanation": "When butter prices spike, bakers and households switch to margarine, increasing margarine demand. They're close substitutes."
            }
          ]
        },
        {
          "type": "Complements",
          "value": "Goods used together",
          "characteristics": ["Cross-price elasticity negative", "Used jointly", "Price of one affects demand for other inversely", "Examples: printers/ink, cars/gasoline", "Shift opposite direction of other's price"],
          "behavior": "Complements are goods that are typically used together. When the price of one good rises, the demand for its complement falls because the combined cost of using both increases. For example, if the price of printers rises significantly, fewer people buy printers, which reduces the demand for printer ink (even if ink prices haven't changed). Graphically, an increase in the price of a complement shifts the demand curve for the original good to the left. A decrease in the price of a complement shifts demand to the right. The cross-price elasticity of demand is negative for complements. The stronger the complementary relationship, the larger the effect.",
          
          "image": {
            "src": "images/unit2/complements.png",
            "alt": "Two products used together with arrow showing linked demand",
            "caption": "Figure 2.1.6: Complements are goods used together—price changes in one affect demand for the other."
          },
          
          "examples": [
            {
              "process": "Printers and ink cartridges",
              "explanation": "If printer prices fall, more people buy printers, increasing demand for ink cartridges (complement). If printer prices rise, ink demand falls."
            },
            {
              "process": "Cars and gasoline",
              "explanation": "Higher gas prices increase the cost of driving, reducing demand for gas-guzzling vehicles. Cars and gasoline are complements."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Law of Demand: Inverse Price-Quantity Relationship",
          "statement": "The law of demand states that, ceteris paribus, as the price of a good increases, the quantity demanded decreases, and as price decreases, quantity demanded increases. This inverse relationship is one of the most robust findings in economics. It holds because: (1) Substitution effect: Higher price makes other goods relatively cheaper, leading consumers to substitute away. (2) Income effect: Higher price reduces purchasing power, effectively lowering real income and reducing quantity demanded. The law applies to virtually all goods, though the strength of the response varies (elasticity). Exceptions are rare (Giffen goods, Veblen goods) and mainly theoretical. Understanding this law is essential for predicting how consumers respond to price changes, taxes, and subsidies.",
          "application": "When analyzing a price change, predict that quantity demanded will move in the opposite direction. For policy analysis, consider how taxes (which raise prices) will reduce consumption, and subsidies (which lower prices) will increase consumption.",
          "example": "When a city imposes a congestion charge (price increase for driving in certain areas), the quantity of vehicles driven decreases. When a store has a sale (price decrease), quantity demanded increases.",
          
          "image": {
            "src": "images/unit2/law_of_demand.png",
            "alt": "Downward-sloping demand curve with arrows showing inverse relationship",
            "caption": "Figure 2.1.7: The law of demand: price up, quantity demanded down."
          }
        },
        {
          "principle": "Distinguish Between Change in Demand and Change in Quantity Demanded",
          "statement": "A common confusion in economics is the difference between a change in demand and a change in quantity demanded. A change in quantity demanded is a movement along a fixed demand curve, caused ONLY by a change in the price of the good itself. A change in demand is a shift of the entire demand curve, caused by a change in any other factor affecting demand—income, prices of related goods, tastes, expectations, or number of buyers. When the curve shifts, consumers buy different amounts at every price. This distinction is crucial for correctly analyzing market changes. In graphs, movements along are shown as arrows following the curve; shifts are shown as the curve moving to a new position.",
          "application": "When analyzing a market event, first identify whether price changed (causing movement) or something else changed (causing shift). For example, 'price of coffee increased' affects quantity demanded of coffee (movement). 'Income increased' affects demand for coffee (shift).",
          "example": "If the price of pizza rises, we move along the pizza demand curve—quantity demanded falls. If consumer incomes rise and pizza is normal, the entire pizza demand curve shifts right—more demanded at every price.",
          
          "image": {
            "src": "images/unit2/demand_vs_quantity.png",
            "alt": "Two graphs: one showing movement along demand curve, one showing shift of entire curve",
            "caption": "Figure 2.1.8: Change in quantity demanded (movement) vs. change in demand (shift)."
          }
        },
        {
          "principle": "Demand Curves Slope Downward Due to Substitution and Income Effects",
          "statement": "The downward slope of demand curves is explained by two complementary effects: (1) Substitution effect: When the price of a good rises, it becomes more expensive relative to other goods. Rational consumers substitute away from the now-more-expensive good toward relatively cheaper alternatives. For example, if the price of beef rises, consumers buy more chicken. This effect always leads consumers to buy less of a good when its price rises. (2) Income effect: When the price of a good rises, consumers' real income (purchasing power) falls because they must spend more to buy the same amount. With lower real income, they reduce consumption of normal goods (and may increase consumption of inferior goods, but the overall effect for normal goods is reduced consumption). For normal goods, both effects work in the same direction, reinforcing the law of demand. For inferior goods, the income effect works opposite, but the substitution effect dominates, so the law of demand still holds.",
          "application": "Understanding these effects helps explain consumer behavior beyond simple price responses. It also explains why demand for different goods responds differently to price changes based on their share of budget and availability of substitutes.",
          "example": "When gasoline prices spike, consumers substitute by carpooling or using public transit (substitution effect) and also have less real income to spend on other goods (income effect). Both reduce gasoline consumption.",
          
          "image": {
            "src": "images/unit2/substitution_income_effects.png",
            "alt": "Diagram showing substitution effect (switching to alternatives) and income effect (reduced purchasing power)",
            "caption": "Figure 2.1.9: Substitution and income effects explain why demand curves slope downward."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Movement vs. Shift Identification",
          
          "image": {
            "src": "images/unit2/demand_example1.png",
            "alt": "List of events affecting coffee market",
            "caption": "Figure 2.1.10: Identify whether each event changes demand or quantity demanded."
          },
          
          "problem": "For each event in the coffee market, identify whether it causes a change in demand (shift) or change in quantity demanded (movement):<br>a) The price of coffee increases by \\$1 per pound.<br>b) Consumer incomes decrease due to a recession.<br>c) The price of tea decreases significantly.<br>d) A new study finds that coffee reduces heart disease risk.<br>e) Coffee shops offer half-price lattes for one week.<br>f) The population increases due to immigration.",
          
          "step_by_step": [
            {
              "step": "Event a",
              "explanation": "Price of coffee itself changes. This causes a movement along the demand curve—change in quantity demanded, not demand."
            },
            {
              "step": "Event b",
              "explanation": "Income changes. Income is a demand shifter. Assuming coffee is normal, demand decreases (shifts left)."
            },
            {
              "step": "Event c",
              "explanation": "Price of a substitute (tea) changes. This shifts demand for coffee. Lower tea price makes tea more attractive, reducing coffee demand (shift left)."
            },
            {
              "step": "Event d",
              "explanation": "Tastes and preferences change due to health information. This shifts demand right (more coffee demanded at every price)."
            },
            {
              "step": "Event e",
              "explanation": "Price of coffee itself changes (temporary sale). This causes movement along demand—change in quantity demanded."
            },
            {
              "step": "Event f",
              "explanation": "Number of buyers increases. This shifts demand right."
            }
          ],
          
          "final_answer": "a) Movement, b) Shift, c) Shift, d) Shift, e) Movement, f) Shift",
          "concept_applied": "Only price changes cause movements along the demand curve. All other factors cause shifts."
        },
        {
          "title": "Constructing a Demand Schedule and Curve",
          
          "image": {
            "src": "images/unit2/demand_example2.png",
            "alt": "Table of prices and quantities",
            "caption": "Figure 2.1.11: Create demand schedule and graph from data."
          },
          
          "problem": "Market research provides the following data for monthly DVD demand:<br>At \\$20, quantity demanded = 100<br>At \\$18, quantity demanded = 150<br>At \\$16, quantity demanded = 200<br>At \\$14, quantity demanded = 250<br>At \\$12, quantity demanded = 300<br>a) Create a demand schedule (table).<br>b) Graph the demand curve.<br>c) What is the quantity demanded at \\$15?<br>d) If price increases from \\$14 to \\$16, what happens to quantity demanded?<br>e) If income increases and DVDs are normal, what happens to the curve?",
          
          "step_by_step": [
            {
              "step": "Create demand schedule",
              "explanation": "Table with two columns: Price and Quantity Demanded. List each price-quantity pair."
            },
            {
              "step": "Graph the demand curve",
              "explanation": "Plot points with price on Y-axis, quantity on X-axis. Connect with a downward-sloping line."
            },
            {
              "step": "Find quantity at \\$15",
              "explanation": "Between \\$14 (250) and \\$16 (200), linear interpolation gives about 225 units at \\$15."
            },
            {
              "step": "Price increase from \\$14 to \\$16",
              "explanation": "Quantity demanded falls from 250 to 200—a decrease of 50 units. This is a movement along the curve."
            },
            {
              "step": "Income increase effect",
              "explanation": "For normal goods, demand increases. The entire curve shifts right—more demanded at every price."
            }
          ],
          
          "final_answer": "c) Approximately 225 DVDs. d) Quantity demanded decreases by 50. e) Demand curve shifts right.",
          "concept_applied": "Demand schedules and curves organize price-quantity relationships. Shifts vs movements depend on the cause."
        },
        {
          "title": "Analyzing Normal vs. Inferior Goods",
          
          "image": {
            "src": "images/unit2/demand_example3.png",
            "alt": "Scenarios with income changes",
            "caption": "Figure 2.1.12: Determine how demand changes for different good types."
          },
          
          "problem": "For each scenario, determine whether demand increases, decreases, or is indeterminate, and identify the type of good:<br>a) Income rises by 10%. Good A consumption rises by 15%.<br>b) Income falls by 5%. Good B consumption falls by 2%.<br>c) Income rises by 20%. Good C consumption falls by 10%.<br>d) Income falls by 8%. Good D consumption rises by 5%.<br>e) Income doubles. Good E consumption stays the same.",
          
          "step_by_step": [
            {
              "step": "Scenario a",
              "explanation": "Income rises, consumption rises more than proportionally (15% > 10%). This is a normal good, specifically a luxury. Demand increases."
            },
            {
              "step": "Scenario b",
              "explanation": "Income falls, consumption falls less than proportionally (2% < 5%). This is a normal good, specifically a necessity. Demand decreases."
            },
            {
              "step": "Scenario c",
              "explanation": "Income rises, consumption falls. This is an inferior good. Demand decreases (shifts left)."
            },
            {
              "step": "Scenario d",
              "explanation": "Income falls, consumption rises. This is an inferior good. Demand increases (shifts right)."
            },
            {
              "step": "Scenario e",
              "explanation": "Income doubles, consumption unchanged. This is unusual—income elasticity of zero. The good is neither normal nor inferior in this range."
            }
          ],
          
          "final_answer": "a) Increase, normal luxury. b) Decrease, normal necessity. c) Decrease, inferior. d) Increase, inferior. e) No change, income elasticity zero.",
          "concept_applied": "Income changes affect normal and inferior goods differently. Normal goods increase with income; inferior goods decrease."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Good and Market",
          "description": "Clearly define the product and the geographic/temporal market.",
          "mechanism": "Specify what good, what time period, and what geographic area. Demand varies by context.",
          "result": "Clear market definition.",
          
          "image": {
            "src": "images/unit2/demand_step1.png",
            "alt": "Magnifying glass over product with location and time",
            "caption": "Figure 2.1.13: Step 1 - Define the good and market clearly."
          }
        },
        {
          "step": 2,
          "process": "Gather Price-Quantity Data",
          "description": "Collect information on how much consumers buy at different prices.",
          "mechanism": "Market research, historical data, surveys, or economic models provide demand information.",
          "result": "Demand schedule (table of prices and quantities).",
          
          "image": {
            "src": "images/unit2/demand_step2.png",
            "alt": "Table with prices and quantities",
            "caption": "Figure 2.1.14: Step 2 - Gather data on quantities demanded at various prices."
          }
        },
        {
          "step": 3,
          "process": "Graph the Demand Curve",
          "description": "Plot the relationship with price on vertical axis, quantity on horizontal.",
          "mechanism": "Plot each price-quantity point. Connect points to form curve (usually downward-sloping).",
          "result": "Visual demand curve.",
          
          "image": {
            "src": "images/unit2/demand_step3.png",
            "alt": "Points plotted and connected to form downward-sloping curve",
            "caption": "Figure 2.1.15: Step 3 - Plot points and draw the demand curve."
          }
        },
        {
          "step": 4,
          "process": "Identify Demand Shifters",
          "description": "Consider factors other than price that affect demand.",
          "mechanism": "List: income, related goods prices, tastes, expectations, number of buyers. Assess current values.",
          "result": "Understanding of factors that could shift demand.",
          
          "image": {
            "src": "images/unit2/demand_step4.png",
            "alt": "Icons for income, substitutes, complements, tastes, expectations, buyers",
            "caption": "Figure 2.1.16: Step 4 - Identify factors that could shift demand."
          }
        },
        {
          "step": 5,
          "process": "Analyze Changes",
          "description": "Determine whether events cause movements or shifts.",
          "mechanism": "If price changes → movement. If any shifter changes → shift (right for increase, left for decrease).",
          "result": "Correct prediction of demand response.",
          
          "image": {
            "src": "images/unit2/demand_step5.png",
            "alt": "Decision tree: price change? → movement; else → shift",
            "caption": "Figure 2.1.17: Step 5 - Analyze whether events cause movements or shifts."
          }
        }
      ],

      "image": {
        "src": "images/unit2/demand_summary.png",
        "alt": "Comprehensive demand summary: law of demand, curve, shifters, movements vs shifts, normal vs inferior, substitutes vs complements",
        "caption": "Figure 2.1.18: Demand summary - law, curve, shifters, and key distinctions."
      }
    },
    {
      "section_title": "2.2 Law of Supply",
      "introduction": "Why do farmers plant more corn when prices are high? Why do oil companies drill more when oil prices rise? These behaviors reflect the law of supply: when price increases, quantity supplied increases. Producers respond to higher prices by increasing production because it becomes more profitable. But supply is more complex than just this relationship—it depends on production costs, technology, and expectations. In this section, we'll explore the law of supply, what shapes supply curves, the difference between supply and quantity supplied, and the factors that shift supply.",
      
      "introduction_image": {
        "src": "images/unit2/supply_intro.png",
        "alt": "Factory production line speeding up as demand increases",
        "caption": "Figure 2.2.1: The law of supply captures how producers respond to price changes."
      },
      
      "key_concept": {
        "definition": "Supply refers to the entire relationship between price and quantity supplied, while quantity supplied is the specific amount producers are willing to sell at a particular price. The law of supply states that, ceteris paribus, there is a direct relationship between price and quantity supplied. As price increases, quantity supplied increases; as price decreases, quantity supplied decreases. This occurs because: (1) Higher prices increase revenue, making production more profitable, encouraging firms to produce more. (2) Higher prices allow firms to cover higher marginal costs of production (the law of diminishing returns means costs rise as output expands). (3) Higher prices attract new firms into the market. The supply curve graphs this relationship with price on the vertical axis and quantity on the horizontal axis. It slopes upward. A change in price causes a movement along the supply curve—a change in quantity supplied. A change in any other factor affecting supply causes the entire curve to shift—a change in supply. Key shifters (determinants of supply) include: (a) Input prices: Lower input prices reduce production costs, increasing supply (shift right). Higher input prices decrease supply (shift left). (b) Technology: Technological improvements reduce costs, increasing supply (shift right). (c) Expectations: Expectations of future prices affect current supply. If prices are expected to rise, firms may reduce current supply to sell more later (shift left). (d) Number of sellers: More sellers increase supply (shift right). (e) Taxes and subsidies: Taxes increase costs, decreasing supply (shift left). Subsidies decrease costs, increasing supply (shift right). (f) Natural conditions: Weather, disasters, and other natural factors affect supply, especially in agriculture.",
        
        "context": "The law of supply was also formalized by Alfred Marshall alongside demand. It reflects the profit-maximizing behavior of firms. In the short run, supply curves slope upward because of diminishing returns—as firms increase output, marginal costs rise, requiring higher prices to justify additional production. In the long run, supply may be more elastic as firms can adjust capacity. Understanding supply is essential for analyzing production decisions, industry dynamics, and the effects of taxes, regulations, and technological change.",
        
        "image": {
          "src": "images/unit2/supply_curve.png",
          "alt": "Upward-sloping supply curve with price and quantity axes labeled, showing movement along vs shift",
          "caption": "Figure 2.2.2: The supply curve slopes upward, showing direct price-quantity relationship."
        }
      },

      "classifications": [
        {
          "type": "Input Price Changes",
          "value": "Changes in cost of factors of production affect supply",
          "characteristics": ["Wages", "Raw materials", "Energy costs", "Capital costs", "Shift opposite direction of input price"],
          "behavior": "Input prices are a major determinant of supply. When the cost of labor, materials, energy, or other inputs rises, production becomes more expensive at every output level, reducing profitability. Firms respond by producing less at any given price—the supply curve shifts left. Conversely, when input prices fall, production becomes cheaper, increasing profitability and shifting supply right. For example, if steel prices rise, automobile supply decreases (shift left). If wages fall, supply increases (shift right). The size of the shift depends on how important the input is in production and how easily firms can substitute away from it.",
          
          "image": {
            "src": "images/unit2/input_prices.png",
            "alt": "Factory with input costs rising, supply curve shifting left",
            "caption": "Figure 2.2.3: Higher input prices decrease supply (shift left); lower input prices increase supply (shift right)."
          },
          
          "examples": [
            {
              "process": "Oil prices and gasoline",
              "explanation": "Crude oil is the main input for gasoline. When oil prices rise, gasoline supply decreases (shift left) because it's more expensive to produce gasoline at any given price."
            },
            {
              "process": "Minimum wage increase",
              "explanation": "A higher minimum wage increases labor costs for restaurants, reducing the supply of restaurant meals (shift left) as some restaurants may close or reduce hours."
            }
          ]
        },
        {
          "type": "Technology",
          "value": "Improvements in production methods increase supply",
          "characteristics": ["Innovation", "Better machinery", "Process improvements", "Automation", "Shift right"],
          "behavior": "Technological progress reduces production costs, allowing firms to produce more output with the same inputs or the same output with fewer inputs. This increases profitability and shifts the supply curve to the right—more is supplied at every price. Technology can take many forms: new machinery, better production processes, improved organization, or innovations that reduce waste. Technological change is a primary driver of economic growth and has dramatically increased supply in industries from agriculture to manufacturing to services. In the modern economy, rapid technological progress continuously shifts supply curves rightward, lowering prices and increasing quantities over time for many goods.",
          
          "image": {
            "src": "images/unit2/technology.png",
            "alt": "Factory with new technology, supply curve shifting right",
            "caption": "Figure 2.2.4: Technological improvements increase supply (shift right)."
          },
          
          "examples": [
            {
              "process": "Solar panel production",
              "explanation": "Advances in manufacturing have dramatically reduced the cost of producing solar panels. The supply curve for solar panels has shifted far right, lowering prices and increasing adoption."
            },
            {
              "process": "Fracking technology",
              "explanation": "Hydraulic fracturing technology made it profitable to extract oil and gas from previously inaccessible deposits. This shifted the supply of oil and gas rightward, lowering energy prices."
            }
          ]
        },
        {
          "type": "Taxes and Subsidies",
          "value": "Government policies affect production costs",
          "characteristics": ["Per-unit taxes increase costs", "Subsidies decrease costs", "Taxes shift left", "Subsidies shift right", "Regulatory costs"],
          "behavior": "Government policies significantly affect supply. Taxes on production (per-unit taxes, excise taxes, or taxes on inputs) increase the cost of production, reducing profitability and shifting supply left. For example, a tax on cigarettes reduces the supply of cigarettes. Subsidies (government payments to producers) reduce production costs, increasing profitability and shifting supply right. For example, agricultural subsidies increase the supply of corn. Regulations can also affect supply: environmental regulations, safety standards, and licensing requirements may increase production costs, shifting supply left. Deregulation may reduce costs and shift supply right. Understanding these effects is crucial for analyzing the impact of government policy on markets.",
          
          "image": {
            "src": "images/unit2/taxes_subsidies.png",
            "alt": "Tax icon causing left shift, subsidy icon causing right shift",
            "caption": "Figure 2.2.5: Taxes decrease supply (shift left); subsidies increase supply (shift right)."
          },
          
          "examples": [
            {
              "process": "Sugar tax",
              "explanation": "A tax on sugary drinks increases production costs for beverage companies, shifting the supply curve for sugary drinks left (higher price, lower quantity)."
            },
            {
              "process": "Renewable energy subsidies",
              "explanation": "Government subsidies for wind power reduce production costs for wind energy companies, shifting supply right and encouraging more renewable energy production."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Law of Supply: Direct Price-Quantity Relationship",
          "statement": "The law of supply states that, ceteris paribus, as the price of a good increases, the quantity supplied increases, and as price decreases, quantity supplied decreases. This direct relationship holds because: (1) Higher prices increase revenue per unit, making production more profitable and encouraging firms to increase output. (2) Higher prices allow firms to cover the higher marginal costs that come from increasing production (due to diminishing returns). (3) In the long run, higher prices attract new firms into the industry, further increasing quantity supplied. The law applies to most goods and services, though the strength of the response varies (elasticity). Understanding this law is essential for predicting how producers respond to price changes, taxes, and market opportunities.",
          "application": "When analyzing a price change, predict that quantity supplied will move in the same direction. For policy analysis, consider how subsidies (which effectively increase price received by producers) will increase supply, and taxes (which reduce net price) will decrease supply.",
          "example": "When the price of corn rises due to increased demand for ethanol, farmers plant more corn, increasing quantity supplied. When hotel prices drop during off-season, hotels take rooms offline or reduce staff, decreasing quantity supplied.",
          
          "image": {
            "src": "images/unit2/law_of_supply.png",
            "alt": "Upward-sloping supply curve with arrows showing direct relationship",
            "caption": "Figure 2.2.6: The law of supply: price up, quantity supplied up."
          }
        },
        {
          "principle": "Distinguish Between Change in Supply and Change in Quantity Supplied",
          "statement": "Just as with demand, it's crucial to distinguish between a change in supply and a change in quantity supplied. A change in quantity supplied is a movement along a fixed supply curve, caused ONLY by a change in the price of the good itself. A change in supply is a shift of the entire supply curve, caused by a change in any other factor affecting supply—input prices, technology, expectations, number of sellers, or taxes/subsidies. When the curve shifts, producers offer different amounts at every price. This distinction is essential for correctly analyzing market events. In graphs, movements along are shown as arrows following the curve; shifts are shown as the curve moving to a new position.",
          "application": "When analyzing a market event, first identify whether price changed (causing movement) or something else changed (causing shift). For example, 'price of oil increased' affects quantity supplied of oil (movement). 'New drilling technology developed' affects supply of oil (shift).",
          "example": "If the price of wheat rises, we move along the wheat supply curve—quantity supplied increases. If a new drought-resistant seed is developed, the entire wheat supply curve shifts right—more supplied at every price.",
          
          "image": {
            "src": "images/unit2/supply_vs_quantity.png",
            "alt": "Two graphs: one showing movement along supply curve, one showing shift of entire curve",
            "caption": "Figure 2.2.7: Change in quantity supplied (movement) vs. change in supply (shift)."
          }
        },
        {
          "principle": "Supply Curves Slope Upward Due to Increasing Marginal Cost",
          "statement": "The upward slope of supply curves reflects increasing marginal cost. As firms produce more output, they typically face rising costs per unit. This occurs because: (1) In the short run, diminishing returns mean that adding more variable inputs (like labor) to fixed inputs (like factories) eventually yields smaller increases in output, raising cost per unit. (2) Firms may need to use less efficient resources as they expand—the best land, workers, and machines are used first; expanding requires using resources that are less productive. (3) In the long run, industry expansion may bid up input prices, increasing costs for all firms. For these reasons, higher prices are needed to induce firms to increase quantity supplied. The supply curve's slope reflects these increasing costs. In some cases, supply curves can be vertical (fixed supply, like land) or horizontal (constant costs), but upward slope is typical.",
          "application": "Understanding why supply slopes upward helps predict how much quantity will respond to price changes. Steeper supply curves mean quantity supplied is less responsive to price changes; flatter curves mean more responsive.",
          "example": "A small bakery can increase bread production by hiring an extra worker, but eventually kitchen space limits output. To produce even more, they'd need a larger kitchen (higher fixed costs), so they'll only expand if prices are high enough to justify the investment.",
          
          "image": {
            "src": "images/unit2/marginal_cost.png",
            "alt": "Graph showing rising marginal cost curve, which is the supply curve",
            "caption": "Figure 2.2.8: Supply curves slope upward because marginal cost increases with output."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Movement vs. Shift Identification - Supply",
          
          "image": {
            "src": "images/unit2/supply_example1.png",
            "alt": "List of events affecting gasoline market",
            "caption": "Figure 2.2.9: Identify whether each event changes supply or quantity supplied."
          },
          
          "problem": "For each event in the gasoline market, identify whether it causes a change in supply (shift) or change in quantity supplied (movement):<br>a) The price of gasoline increases by \\$0.50 per gallon.<br>b) The price of crude oil (an input) increases sharply.<br>c) A new refining technology reduces production costs.<br>d) Several oil refineries are closed due to a hurricane.<br>e) The government imposes a new tax on gasoline.<br>f) Gas stations expect prices to rise next week.",
          
          "step_by_step": [
            {
              "step": "Event a",
              "explanation": "Price of gasoline itself changes. This causes a movement along the supply curve—change in quantity supplied, not supply."
            },
            {
              "step": "Event b",
              "explanation": "Input price increases. This shifts supply left (decreases supply) because production costs rise."
            },
            {
              "step": "Event c",
              "explanation": "Technology improves. This reduces costs and shifts supply right (increases supply)."
            },
            {
              "step": "Event d",
              "explanation": "Number of sellers decreases (refineries close). This shifts supply left."
            },
            {
              "step": "Event e",
              "explanation": "Tax increases production costs. This shifts supply left."
            },
            {
              "step": "Event f",
              "explanation": "Expectations of future price increases. Sellers may hold back supply to sell later at higher prices, shifting current supply left."
            }
          ],
          
          "final_answer": "a) Movement, b) Shift, c) Shift, d) Shift, e) Shift, f) Shift",
          "concept_applied": "Only price changes cause movements along supply. All other factors cause shifts."
        },
        {
          "title": "Constructing a Supply Schedule and Curve",
          
          "image": {
            "src": "images/unit2/supply_example2.png",
            "alt": "Table of prices and quantities supplied",
            "caption": "Figure 2.2.10: Create supply schedule and graph from data."
          },
          
          "problem": "A study of wheat farmers provides the following data for monthly wheat supply:<br>At \\$4 per bushel, quantity supplied = 1000 bushels<br>At \\$5 per bushel, quantity supplied = 1500<br>At \\$6 per bushel, quantity supplied = 1900<br>At \\$7 per bushel, quantity supplied = 2200<br>At \\$8 per bushel, quantity supplied = 2400<br>a) Create a supply schedule (table).<br>b) Graph the supply curve.<br>c) What is the quantity supplied at \\$6.50?<br>d) If price decreases from \\$7 to \\$5, what happens to quantity supplied?<br>e) If new fertilizer increases yields, what happens to the curve?",
          
          "step_by_step": [
            {
              "step": "Create supply schedule",
              "explanation": "Table with two columns: Price and Quantity Supplied. List each price-quantity pair."
            },
            {
              "step": "Graph the supply curve",
              "explanation": "Plot points with price on Y-axis, quantity on X-axis. Connect with an upward-sloping line."
            },
            {
              "step": "Find quantity at \\$6.50",
              "explanation": "Between \\$6 (1900) and \\$7 (2200), linear interpolation gives about 2050 bushels at \\$6.50."
            },
            {
              "step": "Price decrease from \\$7 to \\$5",
              "explanation": "Quantity supplied falls from 2200 to 1500—a decrease of 700 bushels. This is a movement along the curve."
            },
            {
              "step": "New fertilizer effect",
              "explanation": "Technology improves (better input). Supply increases—the entire curve shifts right."
            }
          ],
          
          "final_answer": "c) Approximately 2050 bushels. d) Quantity supplied decreases by 700. e) Supply curve shifts right.",
          "concept_applied": "Supply schedules and curves organize price-quantity relationships. Shifts vs movements depend on the cause."
        },
        {
          "title": "Analyzing Supply Shifters",
          
          "image": {
            "src": "images/unit2/supply_example3.png",
            "alt": "Scenarios with various supply-changing events",
            "caption": "Figure 2.2.11: Determine how each event affects supply."
          },
          
          "problem": "For each event, determine whether supply increases (shifts right), decreases (shifts left), or remains unchanged (movement along):<br>a) The price of coffee beans falls.<br>b) A new machine halves production time for widgets.<br>c) The government reduces taxes on manufacturers.<br>d) The market price of the good increases by 10%.<br>e) A flood destroys several factories in the industry.<br>f) Wages for production workers increase significantly.",
          
          "step_by_step": [
            {
              "step": "Event a",
              "explanation": "Input price falls (coffee beans). This reduces costs, increasing supply—shift right."
            },
            {
              "step": "Event b",
              "explanation": "Technology improves. This reduces costs, increasing supply—shift right."
            },
            {
              "step": "Event c",
              "explanation": "Tax reduction decreases costs, increasing supply—shift right."
            },
            {
              "step": "Event d",
              "explanation": "Price of the good itself increases. This causes movement along supply—increase in quantity supplied, not supply shift."
            },
            {
              "step": "Event e",
              "explanation": "Number of sellers decreases (factories destroyed). This decreases supply—shift left."
            },
            {
              "step": "Event f",
              "explanation": "Input price (wages) increases. This increases costs, decreasing supply—shift left."
            }
          ],
          
          "final_answer": "a) Right shift, b) Right shift, c) Right shift, d) No shift (movement), e) Left shift, f) Left shift",
          "concept_applied": "Supply shifters include input prices, technology, taxes/subsidies, number of sellers, expectations, and natural conditions."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Good and Market",
          "description": "Clearly define the product and market scope.",
          "mechanism": "Specify what good, time period, and geographic area. Supply varies by context.",
          "result": "Clear market definition.",
          
          "image": {
            "src": "images/unit2/supply_step1.png",
            "alt": "Factory icon with location and product",
            "caption": "Figure 2.2.12: Step 1 - Define the good and market clearly."
          }
        },
        {
          "step": 2,
          "process": "Gather Price-Quantity Data",
          "description": "Collect information on how much producers supply at different prices.",
          "mechanism": "Industry data, surveys, or economic models provide supply information.",
          "result": "Supply schedule (table of prices and quantities).",
          
          "image": {
            "src": "images/unit2/supply_step2.png",
            "alt": "Table with prices and quantities supplied",
            "caption": "Figure 2.2.13: Step 2 - Gather data on quantities supplied at various prices."
          }
        },
        {
          "step": 3,
          "process": "Graph the Supply Curve",
          "description": "Plot the relationship with price on vertical axis, quantity on horizontal.",
          "mechanism": "Plot each price-quantity point. Connect points to form curve (usually upward-sloping).",
          "result": "Visual supply curve.",
          
          "image": {
            "src": "images/unit2/supply_step3.png",
            "alt": "Points plotted and connected to form upward-sloping curve",
            "caption": "Figure 2.2.14: Step 3 - Plot points and draw the supply curve."
          }
        },
        {
          "step": 4,
          "process": "Identify Supply Shifters",
          "description": "Consider factors other than price that affect supply.",
          "mechanism": "List: input prices, technology, expectations, number of sellers, taxes/subsidies, natural conditions. Assess current values.",
          "result": "Understanding of factors that could shift supply.",
          
          "image": {
            "src": "images/unit2/supply_step4.png",
            "alt": "Icons for input prices, technology, taxes, sellers, expectations, natural factors",
            "caption": "Figure 2.2.15: Step 4 - Identify factors that could shift supply."
          }
        },
        {
          "step": 5,
          "process": "Analyze Changes",
          "description": "Determine whether events cause movements or shifts.",
          "mechanism": "If price changes → movement. If any shifter changes → shift (right for increase, left for decrease).",
          "result": "Correct prediction of supply response.",
          
          "image": {
            "src": "images/unit2/supply_step5.png",
            "alt": "Decision tree: price change? → movement; else → shift",
            "caption": "Figure 2.2.16: Step 5 - Analyze whether events cause movements or shifts."
          }
        }
      ],

      "image": {
        "src": "images/unit2/supply_summary.png",
        "alt": "Comprehensive supply summary: law of supply, curve, shifters, movements vs shifts",
        "caption": "Figure 2.2.17: Supply summary - law, curve, shifters, and key distinctions."
      }
    },
    {
      "section_title": "2.3 Finding Market Equilibrium",
      "introduction": "How does a market actually determine the price you pay? In a free market, the price is not set by any single person or institution. Instead, it emerges from the interaction of buyers and sellers. The equilibrium price—the price that clears the market—is where the plans of consumers and producers align. At this price, the quantity consumers want to buy exactly equals the quantity producers want to sell. In this section, we'll explore how to find equilibrium using tables and graphs, why equilibrium is stable, and what equilibrium tells us about market outcomes.",
      
      "introduction_image": {
        "src": "images/unit2/equilibrium_intro.png",
        "alt": "Balance scale with consumers on one side and producers on the other, balanced at equilibrium",
        "caption": "Figure 2.3.1: Market equilibrium balances the plans of buyers and sellers."
      },
      
      "key_concept": {
        "definition": "Market equilibrium occurs at the price where quantity demanded equals quantity supplied. At this price, there is neither a shortage nor a surplus—the market clears. (1) Equilibrium price (market-clearing price): The price at which Qd = Qs. (2) Equilibrium quantity: The quantity bought and sold at the equilibrium price. (3) Finding equilibrium: Using a demand schedule and supply schedule, find the price where quantities match. Graphically, it's the intersection of demand and supply curves. (4) Properties: At equilibrium, all buyers who want to buy at that price can find sellers, and all sellers who want to sell at that price can find buyers. There is no pressure for price to change unless underlying conditions change. (5) Adjustment: If price is above equilibrium, surplus (excess supply) pushes price down. If price is below equilibrium, shortage (excess demand) pushes price up. This self-correcting mechanism is fundamental to market economies. (6) Mathematical approach: With linear demand Qd = a - bP and supply Qs = c + dP, set Qd = Qs and solve for P, then substitute to find Q.",
        
        "context": "The concept of equilibrium comes from physics and was applied to economics by Léon Walras and Alfred Marshall. Marshall's supply and demand diagram remains the standard way to present equilibrium. Understanding equilibrium is essential for analyzing how markets allocate resources and how they respond to changes. In AP Microeconomics, equilibrium analysis is the foundation for studying price controls, taxes, subsidies, and market shocks.",
        
        "image": {
          "src": "images/unit2/equilibrium_graph.png",
          "alt": "Supply and demand curves intersecting at equilibrium point E, with equilibrium price and quantity labeled",
          "caption": "Figure 2.3.2: Market equilibrium occurs where supply and demand curves intersect."
        }
      },

      "classifications": [
        {
          "type": "Finding Equilibrium from Tables",
          "value": "Using demand and supply schedules to find matching quantities",
          "characteristics": ["Price column", "Qd column", "Qs column", "Compare Qd and Qs", "Find price where they match"],
          "behavior": "When given tables of quantity demanded and quantity supplied at various prices, find equilibrium by locating the price where Qd equals Qs. If no exact match exists, equilibrium lies between prices where Qd crosses from above to below Qs. This method is straightforward and helps build intuition before moving to graphs. The equilibrium price is where the market clears. At lower prices, Qd > Qs (shortage); at higher prices, Qs > Qd (surplus). Examining tables helps understand why prices tend toward equilibrium: at prices with shortages, buyers bid prices up; at prices with surpluses, sellers cut prices.",
          
          "image": {
            "src": "images/unit2/equilibrium_table.png",
            "alt": "Table with price, Qd, Qs columns, highlighting row where Qd = Qs",
            "caption": "Figure 2.3.3: Find equilibrium by comparing quantity demanded and supplied at each price."
          },
          
          "examples": [
            {
              "process": "Simple market table",
              "explanation": "Price: $1, Qd=100, Qs=20; $2, Qd=80, Qs=40; $3, Qd=60, Qs=60; $4, Qd=40, Qs=80; $5, Qd=20, Qs=100. Equilibrium at $3 where Qd=Qs=60."
            }
          ]
        },
        {
          "type": "Finding Equilibrium from Graphs",
          "value": "Locating intersection of supply and demand curves",
          "characteristics": ["Downward-sloping demand", "Upward-sloping supply", "Intersection point", "Read P and Q from axes", "Visual identification"],
          "behavior": "Graphically, equilibrium is the point where the demand curve and supply curve intersect. From this point, drop down to the quantity axis to find equilibrium quantity, and across to the price axis to find equilibrium price. Graphs provide an intuitive visual of market outcomes and make it easy to see how shifts affect equilibrium. They also show consumer surplus (area below demand and above price) and producer surplus (area above supply and below price), which are important for welfare analysis. Reading graphs accurately requires careful attention to axes and scales.",
          
          "image": {
            "src": "images/unit2/equilibrium_graph_find.png",
            "alt": "Supply and demand curves with dotted lines from intersection to axes showing Pe and Qe",
            "caption": "Figure 2.3.4: Graphically, equilibrium is the intersection of supply and demand."
          },
          
          "examples": [
            {
              "process": "Reading equilibrium from graph",
              "explanation": "On a correctly labeled graph, find where curves cross. Read horizontally to price axis for equilibrium price, vertically to quantity axis for equilibrium quantity."
            }
          ]
        },
        {
          "type": "Finding Equilibrium Algebraically",
          "value": "Solving equations to find exact equilibrium values",
          "characteristics": ["Demand equation", "Supply equation", "Set Qd = Qs", "Solve for P", "Substitute to find Q"],
          "behavior": "When demand and supply are given as linear equations, equilibrium can be found algebraically. Given Qd = a - bP and Qs = c + dP (where a,b,c,d are positive numbers), set a - bP = c + dP, solve for P, then substitute back to find Q. This method yields exact values and is useful for quantitative problems. It also allows sensitivity analysis—seeing how changes in parameters affect equilibrium. Understanding the algebraic approach is essential for more advanced economic analysis and for checking graphical solutions.",
          
          "image": {
            "src": "images/unit2/equilibrium_algebra.png",
            "alt": "Equations being solved step by step",
            "caption": "Figure 2.3.5: Algebraically solve for equilibrium by setting Qd = Qs."
          },
          
          "examples": [
            {
              "process": "Solving linear equations",
              "explanation": "Demand: Qd = 100 - 2P. Supply: Qs = 20 + 3P. Set equal: 100 - 2P = 20 + 3P → 80 = 5P → P = 16. Q = 100 - 2(16) = 68."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Equilibrium Is Where Buyers' and Sellers' Plans Align",
          "statement": "At the equilibrium price, the quantity consumers want to buy exactly equals the quantity producers want to sell. This alignment means that everyone who wants to buy at that price can find a seller, and everyone who wants to sell at that price can find a buyer. No one is frustrated—there's no line of disappointed buyers (shortage) and no pile of unsold goods (surplus). This coordination happens automatically through price adjustments in free markets. The equilibrium outcome is efficient in the sense that all mutually beneficial transactions occur—any unit where someone values it more than it costs to produce gets produced and sold. Understanding this alignment helps explain why markets are powerful coordination mechanisms.",
          "application": "When analyzing a market, always identify the equilibrium first. It's the baseline from which changes are measured. Compare actual prices to equilibrium to predict whether shortages or surpluses exist.",
          "example": "In the housing market, equilibrium rent aligns the number of apartments landlords want to rent with the number of apartments renters want to occupy. If rent is above equilibrium, vacancies appear (surplus); if below, waiting lists appear (shortage).",
          
          "image": {
            "src": "images/unit2/alignment.png",
            "alt": "Two arrows (buyers and sellers) meeting at equilibrium point",
            "caption": "Figure 2.3.6: Equilibrium aligns the plans of buyers and sellers."
          }
        },
        {
          "principle": "Markets Tend to Self-Correct Toward Equilibrium",
          "statement": "Markets have a natural tendency to move toward equilibrium. If price is above equilibrium, quantity supplied exceeds quantity demanded, creating a surplus. Sellers find themselves with unsold inventory and compete for customers by lowering prices. As price falls, quantity demanded increases and quantity supplied decreases, reducing the surplus until equilibrium is reached. If price is below equilibrium, quantity demanded exceeds quantity supplied, creating a shortage. Buyers compete for limited goods by bidding prices up. As price rises, quantity demanded decreases and quantity supplied increases, reducing the shortage. This self-correcting mechanism operates without any central direction—it's the invisible hand at work. The speed of adjustment depends on the market—some adjust quickly (financial markets), others slowly (housing markets).",
          "application": "When you observe a price that seems 'too high' or 'too low,' expect market forces to push it toward equilibrium unless something prevents adjustment (like price controls). Use surplus/shortage analysis to predict price direction.",
          "example": "After a good harvest, farmers bring more corn to market, creating a temporary surplus. Prices fall, encouraging consumers to buy more (corn on sale!) and farmers to plant less next season, moving toward equilibrium.",
          
          "image": {
            "src": "images/unit2/self_correct.png",
            "alt": "Diagram showing surplus pushing price down, shortage pushing price up, both toward equilibrium",
            "caption": "Figure 2.3.7: Markets self-correct—surpluses push prices down, shortages push prices up."
          }
        },
        {
          "principle": "Equilibrium Changes When Supply or Demand Shifts",
          "statement": "Equilibrium is not fixed—it changes when underlying conditions shift supply or demand. An increase in demand (shift right) raises both equilibrium price and quantity. A decrease in demand (shift left) lowers both. An increase in supply (shift right) lowers equilibrium price and raises quantity. A decrease in supply (shift left) raises equilibrium price and lowers quantity. When both curves shift simultaneously, the effect on price or quantity may be ambiguous, depending on the direction and magnitude of shifts. Understanding these patterns allows economists to predict how events like income changes, technological progress, or natural disasters will affect market outcomes.",
          "application": "When analyzing a market change, first determine whether supply shifts, demand shifts, or both. Then apply the rules: D↑ → P↑ Q↑; D↓ → P↓ Q↓; S↑ → P↓ Q↑; S↓ → P↑ Q↓. For simultaneous shifts, consider relative magnitudes.",
          "example": "If a new study shows coffee is healthy (demand ↑) and a frost damages coffee crops (supply ↓), price definitely rises, but quantity change is ambiguous—it depends on which shift is larger.",
          
          "image": {
            "src": "images/unit2/equilibrium_shifts.png",
            "alt": "Four panels showing effects of demand increase, demand decrease, supply increase, supply decrease on equilibrium",
            "caption": "Figure 2.3.8: Shifts in supply or demand change equilibrium price and quantity in predictable ways."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Finding Equilibrium from a Table",
          
          "image": {
            "src": "images/unit2/equilibrium_example1.png",
            "alt": "Table with price, Qd, Qs for pizza market",
            "caption": "Figure 2.3.9: Find equilibrium from the given data."
          },
          
          "problem": "The following table shows the demand and supply for pizza in a college town:<br>Price: $8, $10, $12, $14, $16<br>Qd: 400, 350, 300, 250, 200<br>Qs: 200, 250, 300, 350, 400<br>a) What is the equilibrium price and quantity?<br>b) At a price of $10, is there a shortage or surplus? How much?<br>c) At a price of $14, is there a shortage or surplus? How much?<br>d) If price is currently $8, what will happen to price? Why?",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "Look for price where Qd = Qs. At $12, Qd = 300 and Qs = 300. Equilibrium price = $12, quantity = 300."
            },
            {
              "step": "Analyze $10",
              "explanation": "At $10, Qd = 350, Qs = 250. Qd > Qs by 100, so shortage of 100 pizzas."
            },
            {
              "step": "Analyze $14",
              "explanation": "At $14, Qd = 250, Qs = 350. Qs > Qd by 100, so surplus of 100 pizzas."
            },
            {
              "step": "Price at $8",
              "explanation": "At $8, Qd = 400, Qs = 200. Shortage of 200 pizzas. With shortage, buyers compete for limited pizzas, bidding price up toward equilibrium $12."
            }
          ],
          
          "final_answer": "a) $12, 300 pizzas. b) Shortage of 100. c) Surplus of 100. d) Price will rise due to shortage.",
          "concept_applied": "Equilibrium is where Qd=Qs. Prices below cause shortages; above cause surpluses. Markets adjust toward equilibrium."
        },
        {
          "title": "Finding Equilibrium Algebraically",
          
          "image": {
            "src": "images/unit2/equilibrium_example2.png",
            "alt": "Demand and supply equations",
            "caption": "Figure 2.3.10: Solve for equilibrium using algebra."
          },
          
          "problem": "The market for smartphones is described by:<br>Demand: Qd = 500 - 2P<br>Supply: Qs = 100 + 3P<br>where P is price in dollars, Q in thousands.<br>a) Find equilibrium price and quantity.<br>b) If price is set at $60, is there shortage or surplus? How much?<br>c) If price is set at $100, is there shortage or surplus? How much?",
          
          "step_by_step": [
            {
              "step": "Set Qd = Qs",
              "explanation": "500 - 2P = 100 + 3P"
            },
            {
              "step": "Solve for P",
              "explanation": "500 - 100 = 3P + 2P → 400 = 5P → P = $80"
            },
            {
              "step": "Find Q",
              "explanation": "Q = 500 - 2(80) = 500 - 160 = 340 thousand, or Q = 100 + 3(80) = 100 + 240 = 340 thousand."
            },
            {
              "step": "Check P = $60",
              "explanation": "Qd = 500 - 2(60) = 500 - 120 = 380. Qs = 100 + 3(60) = 100 + 180 = 280. Qd > Qs by 100 thousand, so shortage."
            },
            {
              "step": "Check P = $100",
              "explanation": "Qd = 500 - 2(100) = 500 - 200 = 300. Qs = 100 + 3(100) = 100 + 300 = 400. Qs > Qd by 100 thousand, so surplus."
            }
          ],
          
          "final_answer": "a) P = $80, Q = 340,000. b) Shortage of 100,000. c) Surplus of 100,000.",
          "concept_applied": "Algebraic solution yields exact equilibrium. Compare actual price to equilibrium to determine shortage/surplus."
        },
        {
          "title": "Graphing Equilibrium",
          
          "image": {
            "src": "images/unit2/equilibrium_example3.png",
            "alt": "Blank supply and demand axes",
            "caption": "Figure 2.3.11: Draw and label equilibrium graph."
          },
          
          "problem": "Draw a correctly labeled supply and demand graph for the pizza market from the first example. Label axes, curves, equilibrium point, equilibrium price, and equilibrium quantity. Then show what happens if the price of hamburgers (a substitute) increases significantly.",
          
          "step_by_step": [
            {
              "step": "Draw axes",
              "explanation": "Vertical axis: Price. Horizontal axis: Quantity."
            },
            {
              "step": "Draw demand curve",
              "explanation": "Downward-sloping line from upper left to lower right. Label D."
            },
            {
              "step": "Draw supply curve",
              "explanation": "Upward-sloping line from lower left to upper right. Label S."
            },
            {
              "step": "Label equilibrium",
              "explanation": "Mark intersection as E. Draw dotted line to price axis for Pe, to quantity axis for Qe."
            },
            {
              "step": "Analyze price of hamburgers increase",
              "explanation": "Hamburgers are substitutes. Higher hamburger price increases demand for pizza (shift right). New demand curve D2 to the right of original. New equilibrium E2 has higher price and higher quantity."
            }
          ],
          
          "final_answer": "Graph should show original equilibrium with Pe, Qe, and new equilibrium after demand shift right with higher P and Q.",
          "concept_applied": "Graphs visually represent equilibrium and how shifts change market outcomes."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Obtain Demand and Supply Information",
          "description": "Gather data on quantities demanded and supplied at various prices.",
          "mechanism": "Use tables, equations, or graphs representing market conditions.",
          "result": "Demand and supply schedules or curves.",
          
          "image": {
            "src": "images/unit2/equilibrium_step1.png",
            "alt": "Table with demand and supply data",
            "caption": "Figure 2.3.12: Step 1 - Obtain demand and supply information."
          }
        },
        {
          "step": 2,
          "process": "Find Where Qd = Qs",
          "description": "Identify price where quantities match.",
          "mechanism": "From table: scan for matching Qd and Qs. From graph: find intersection. From equations: set equal and solve.",
          "result": "Equilibrium price and quantity.",
          
          "image": {
            "src": "images/unit2/equilibrium_step2.png",
            "alt": "Magnifying glass finding matching quantities",
            "caption": "Figure 2.3.13: Step 2 - Find where quantity demanded equals quantity supplied."
          }
        },
        {
          "step": 3,
          "process": "Verify at Adjacent Prices",
          "description": "Check prices above and below to confirm equilibrium.",
          "mechanism": "Above equilibrium: Qs > Qd (surplus). Below equilibrium: Qd > Qs (shortage). This confirms correct identification.",
          "result": "Confirmation of equilibrium.",
          
          "image": {
            "src": "images/unit2/equilibrium_step3.png",
            "alt": "Above equilibrium showing surplus, below showing shortage",
            "caption": "Figure 2.3.14: Step 3 - Verify that above equilibrium has surplus, below has shortage."
          }
        },
        {
          "step": 4,
          "process": "Analyze Disequilibrium if Price Differs",
          "description": "If actual price differs from equilibrium, determine surplus/shortage.",
          "mechanism": "Calculate Qd and Qs at actual price. Difference = surplus (if Qs > Qd) or shortage (if Qd > Qs).",
          "result": "Understanding of market imbalance.",
          
          "image": {
            "src": "images/unit2/equilibrium_step4.png",
            "alt": "Calculating difference between Qd and Qs at non-equilibrium price",
            "caption": "Figure 2.3.15: Step 4 - If price isn't equilibrium, calculate surplus or shortage."
          }
        },
        {
          "step": 5,
          "process": "Predict Price Adjustment",
          "description": "Determine direction of price movement toward equilibrium.",
          "mechanism": "Surplus → price falls. Shortage → price rises. Continue until equilibrium reached.",
          "result": "Prediction of market adjustment.",
          
          "image": {
            "src": "images/unit2/equilibrium_step5.png",
            "alt": "Arrows showing surplus pushing price down, shortage pushing price up",
            "caption": "Figure 2.3.16: Step 5 - Predict price movement toward equilibrium."
          }
        }
      ],

      "image": {
        "src": "images/unit2/equilibrium_summary.png",
        "alt": "Comprehensive equilibrium summary: finding from table, graph, algebra; surplus/shortage; adjustment",
        "caption": "Figure 2.3.17: Market equilibrium summary - how to find it and how markets adjust."
      }
    },
    {
      "section_title": "2.4 Disequilibrium Analysis",
      "introduction": "What happens when a market is not in equilibrium? Sometimes prices are temporarily out of balance; other times, government policies like price ceilings and price floors prevent prices from reaching equilibrium. In these situations, we observe shortages or surpluses that persist, leading to queues, black markets, or unsold goods. Understanding disequilibrium helps explain many real-world phenomena—from rent-controlled apartments with waiting lists to agricultural price supports creating government stockpiles. In this section, we'll explore shortages and surpluses, how markets naturally adjust toward equilibrium, and what happens when prices are prevented from adjusting.",
      
      "introduction_image": {
        "src": "images/unit2/disequilibrium_intro.png",
        "alt": "Long line of customers outside a store (shortage) and farmers with unsold crops (surplus)",
        "caption": "Figure 2.4.1: Disequilibrium creates shortages (long lines) or surpluses (unsold goods)."
      },
      
      "key_concept": {
        "definition": "Disequilibrium occurs when quantity demanded does not equal quantity supplied at the current price. This creates either a shortage or a surplus. (1) Shortage (excess demand): Occurs when price is below equilibrium. Qd > Qs. Some buyers cannot find the good. Characteristics: long lines, waiting lists, black markets, non-price rationing (first-come, first-served, seller preferences). (2) Surplus (excess supply): Occurs when price is above equilibrium. Qs > Qd. Sellers cannot sell all they produce. Characteristics: unsold inventory, price cutting, reduced production, layoffs. (3) Market adjustment: In free markets, shortages push prices up, surpluses push prices down, moving toward equilibrium. (4) Price controls: Government-imposed maximum prices (price ceilings) or minimum prices (price floors) can prevent adjustment to equilibrium, causing persistent shortages or surpluses. (5) Price ceiling: A legal maximum price. If set below equilibrium, creates persistent shortage. Examples: rent control, price controls on gasoline. Consequences: reduced quantity supplied, increased quantity demanded, shortage, non-price rationing, black markets, reduced quality. (6) Price floor: A legal minimum price. If set above equilibrium, creates persistent surplus. Examples: minimum wage, agricultural price supports. Consequences: increased quantity supplied, reduced quantity demanded, surplus, government may need to buy excess, waste, inefficiency.",
        
        "context": "Disequilibrium analysis became particularly important during the 1970s when price controls were common, and during agricultural policy debates. The concepts of shortages and surpluses are intuitive but have subtle implications for efficiency and equity. Price controls often create unintended consequences—helping some but hurting others, and always creating inefficiency. Understanding disequilibrium helps evaluate policies and predict their side effects.",
        
        "image": {
          "src": "images/unit2/disequilibrium_graph.png",
          "alt": "Supply and demand graph showing shortage (gap where Qd > Qs at low price) and surplus (gap where Qs > Qd at high price)",
          "caption": "Figure 2.4.2: Shortage occurs below equilibrium; surplus above equilibrium."
        }
      },

      "classifications": [
        {
          "type": "Shortage (Excess Demand)",
          "value": "Quantity demanded exceeds quantity supplied",
          "characteristics": ["Price below equilibrium", "Qd > Qs", "Long lines", "Waiting lists", "Sellers ration", "Black markets possible", "Upward price pressure"],
          "behavior": "A shortage occurs when price is too low, causing consumers to want more than producers are willing to supply. In a free market, the shortage would be temporary—prices would rise, eliminating it. But if prices are prevented from rising (by price ceiling or sticky prices), the shortage persists. Persistent shortages lead to non-price rationing: who gets the limited goods? Methods include first-come, first-served (lines); seller preferences (discrimination); coupons or rationing systems; or black markets where goods sell at illegal higher prices. Shortages also reduce quality as sellers have no incentive to maintain standards when goods are scarce. The economic inefficiency is that some buyers who value the good more than its cost cannot get it, while others who value it less (but got in line first) do get it.",
          
          "image": {
            "src": "images/unit2/shortage.png",
            "alt": "Graph showing shortage area between demand and supply below equilibrium price",
            "caption": "Figure 2.4.3: Shortage occurs when price is below equilibrium—Qd exceeds Qs."
          },
          
          "examples": [
            {
              "process": "Rent control",
              "explanation": "In cities with rent control (price ceiling on apartments), below-equilibrium rents create housing shortages. Waiting lists, lotteries, and discrimination by landlords replace price rationing. Some people can't find apartments despite willingness to pay."
            },
            {
              "process": "1970s gasoline price controls",
              "explanation": "U.S. price controls on gasoline in the 1970s created long lines at gas stations. Drivers waited hours for fuel because price was below equilibrium, preventing market from clearing."
            }
          ]
        },
        {
          "type": "Surplus (Excess Supply)",
          "value": "Quantity supplied exceeds quantity demanded",
          "characteristics": ["Price above equilibrium", "Qs > Qd", "Unsold inventory", "Price cutting", "Reduced production", "Downward price pressure", "Government may buy excess"],
          "behavior": "A surplus occurs when price is too high, causing producers to supply more than consumers are willing to buy. In free markets, surpluses are temporary—prices fall, eliminating them. But if prices are prevented from falling (by price floor or sticky prices), the surplus persists. Persistent surpluses lead to unsold goods, inventory accumulation, and pressure to cut production and lay off workers. For agricultural price supports, governments often buy the surplus to maintain prices, leading to stockpiles (butter mountains, wine lakes) and waste. Surpluses are inefficient because resources are used to produce goods that people don't value enough to buy at the supported price. The goods may eventually be destroyed, sold at a loss, or given away.",
          
          "image": {
            "src": "images/unit2/surplus.png",
            "alt": "Graph showing surplus area between supply and demand above equilibrium price",
            "caption": "Figure 2.4.4: Surplus occurs when price is above equilibrium—Qs exceeds Qd."
          },
          
          "examples": [
            {
              "process": "Agricultural price supports",
              "explanation": "The U.S. and EU have historically supported farm prices above equilibrium. This creates surpluses of crops like wheat and dairy, which governments sometimes buy and store, leading to massive stockpiles."
            },
            {
              "process": "Minimum wage",
              "explanation": "A minimum wage above equilibrium creates a surplus of labor—unemployment. More workers want jobs at the higher wage than firms want to hire, leading to job seekers unable to find work."
            }
          ]
        },
        {
          "type": "Price Ceiling",
          "value": "Legal maximum price",
          "characteristics": ["Government-imposed", "Maximum price", "If below equilibrium → shortage", "Non-price rationing", "Black markets", "Reduced quality"],
          "behavior": "A price ceiling is a legal maximum price that can be charged. To be binding (affect the market), it must be set below the equilibrium price. Binding price ceilings create persistent shortages because price cannot rise to eliminate excess demand. Consequences include: (1) Reduced quantity supplied: producers supply less at the lower price. (2) Increased quantity demanded: consumers want more at the lower price. (3) Shortage: the gap between Qd and Qs. (4) Non-price rationing: goods must be allocated by something other than price—lines, lotteries, seller preferences. (5) Black markets: illegal sales at prices above the ceiling. (6) Reduced quality: sellers cut quality since they can't raise price. (7) Discrimination: sellers may favor friends, family, or those who pay bribes. Price ceilings are often intended to help consumers, but they typically harm those they intend to help by creating shortages and reducing quality.",
          
          "image": {
            "src": "images/unit2/price_ceiling.png",
            "alt": "Graph with price ceiling below equilibrium, showing shortage",
            "caption": "Figure 2.4.5: A binding price ceiling below equilibrium creates persistent shortage."
          },
          
          "examples": [
            {
              "process": "Rent control in NYC",
              "explanation": "New York City's rent control laws keep rents below market for some apartments. Benefits sitting tenants but reduces supply of rental housing and creates shortages—waiting lists, discrimination, and deterioration of controlled units."
            },
            {
              "process": "Price controls on essential medicines",
              "explanation": "Some countries cap prices of life-saving drugs. While intended to make them affordable, this can create shortages as manufacturers supply less, and patients can't find medicines despite willingness to pay."
            }
          ]
        },
        {
          "type": "Price Floor",
          "value": "Legal minimum price",
          "characteristics": ["Government-imposed", "Minimum price", "If above equilibrium → surplus", "Unsold goods", "Government may buy excess", "Waste", "Reduced demand"],
          "behavior": "A price floor is a legal minimum price that can be charged. To be binding, it must be set above the equilibrium price. Binding price floors create persistent surpluses because price cannot fall to eliminate excess supply. Consequences include: (1) Increased quantity supplied: producers supply more at the higher price. (2) Reduced quantity demanded: consumers want less at the higher price. (3) Surplus: the gap between Qs and Qd. (4) Unsold goods: producers can't sell all they produce. (5) Government intervention: to maintain the floor, government may buy the surplus, subsidize exports, or pay producers not to produce. (6) Waste: surplus goods may be stored (costly) or destroyed. (7) Inefficiency: resources used to produce goods no one wants at that price. Price floors are often intended to help producers but create surpluses and waste, and consumers pay higher prices.",
          
          "image": {
            "src": "images/unit2/price_floor.png",
            "alt": "Graph with price floor above equilibrium, showing surplus",
            "caption": "Figure 2.4.6: A binding price floor above equilibrium creates persistent surplus."
          },
          
          "examples": [
            {
              "process": "Minimum wage",
              "explanation": "A minimum wage above the market-clearing wage creates unemployment (surplus of labor). More workers seek jobs than firms want to hire at that wage."
            },
            {
              "process": "Agricultural price supports",
              "explanation": "The U.S. government has historically set minimum prices for crops like corn and wheat. This creates surpluses, which the government buys and stores, costing taxpayers and creating inefficiency."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Shortages and Surpluses Create Pressure for Price Adjustment",
          "statement": "In free markets, shortages and surpluses are temporary because they create incentives for price adjustment. A shortage means buyers can't get as much as they want—they bid against each other, pushing prices up. Higher prices reduce quantity demanded and increase quantity supplied, eliminating the shortage. A surplus means sellers can't sell all they have—they cut prices to attract more buyers. Lower prices increase quantity demanded and decrease quantity supplied, eliminating the surplus. This self-correcting mechanism is why markets tend toward equilibrium. The speed of adjustment depends on market conditions—flexible prices adjust quickly; sticky prices (like wages or menu costs) adjust more slowly. But the tendency is always toward equilibrium unless prevented.",
          "application": "When you observe a shortage or surplus, predict that prices will adjust unless something blocks them. Shortage → price up. Surplus → price down. This helps forecast market direction.",
          "example": "When a new video game is released, initial shortage may lead to scalpers selling at high prices (price adjustment). When a fashion trend fades, stores have surplus and put items on sale (price down).",
          
          "image": {
            "src": "images/unit2/pressure.png",
            "alt": "Shortage with upward arrow, surplus with downward arrow, both pointing to equilibrium",
            "caption": "Figure 2.4.7: Shortages push prices up; surpluses push prices down."
          }
        },
        {
          "principle": "Price Ceilings Create Shortages and Non-Price Rationing",
          "statement": "When government imposes a price ceiling below equilibrium, it prevents the market from reaching equilibrium. The resulting persistent shortage must be rationed by some method other than price. Common non-price rationing mechanisms include: (1) First-come, first-served: lines and waiting lists. (2) Seller preferences: landlords may discriminate by race, gender, or family status. (3) Coupons or rationing tickets: government issues rights to buy. (4) Black markets: illegal sales at higher prices. These methods are generally less efficient than price rationing because goods don't necessarily go to those who value them most, but to those with time to wait, connections to sellers, or luck. Price ceilings also reduce quality and investment because sellers can't earn normal returns. While intended to help consumers, price ceilings often harm the very people they're meant to help by creating shortages and reducing quality.",
          "application": "When evaluating a proposed price ceiling, consider: Will it be below equilibrium? Who will get the goods instead of price? What are the unintended consequences (black markets, quality deterioration)?",
          "example": "Venezuela's price controls on basic foods created massive shortages despite the intent to make food affordable. People spent hours in lines, and black markets flourished at much higher prices.",
          
          "image": {
            "src": "images/unit2/ceiling_consequences.png",
            "alt": "Price ceiling graph with shortage, plus icons for lines, black markets, quality decline",
            "caption": "Figure 2.4.8: Price ceilings cause shortages and lead to non-price rationing."
          }
        },
        {
          "principle": "Price Floors Create Surpluses and Waste",
          "statement": "When government imposes a price floor above equilibrium, it creates a persistent surplus. For goods, this means unsold inventory. For labor (minimum wage), this means unemployment. To maintain the floor, government often must intervene further—buying surplus agricultural products, paying farmers not to plant, or subsidizing exports. These interventions are costly and create waste: surplus goods may spoil in storage or be destroyed while people elsewhere go hungry. Price floors also lead to inefficient allocation: resources are used to produce goods that consumers don't value enough to buy at the floor price. While intended to help producers (or workers), price floors create surpluses, waste, and higher prices for consumers, and may not even help the intended beneficiaries (e.g., minimum wage may help some workers but price others out of jobs).",
          "application": "When evaluating a proposed price floor, consider: Will it be above equilibrium? What will happen to the surplus? Will government need to buy it? Who bears the cost?",
          "example": "EU agricultural price supports created 'wine lakes' and 'butter mountains'—vast stockpiles of surplus goods that cost taxpayers billions and were sometimes destroyed while poor countries faced food shortages.",
          
          "image": {
            "src": "images/unit2/floor_consequences.png",
            "alt": "Price floor graph with surplus, plus icons for unsold goods, government buying, waste",
            "caption": "Figure 2.4.9: Price floors create surpluses and often lead to government purchases and waste."
          }
        },
        {
          "principle": "Price Controls Create Deadweight Loss",
          "statement": "Both price ceilings and price floors create deadweight loss—a measure of economic inefficiency representing mutually beneficial transactions that no longer occur. With a price ceiling below equilibrium, some transactions that would have occurred (where value to buyers exceeded cost to sellers) don't happen because quantity supplied is too low. With a price floor above equilibrium, some transactions don't happen because quantity demanded is too low. Deadweight loss measures the value of these foregone transactions—the loss to society from interference with market outcomes. This is why economists generally oppose price controls except in specific circumstances (like emergencies) where equity concerns may outweigh efficiency losses. Understanding deadweight loss is essential for evaluating the full cost of price controls.",
          "application": "When analyzing price controls, calculate or estimate deadweight loss. It represents the harm to society beyond the redistribution between buyers and sellers. Policies that create large deadweight losses are generally inefficient.",
          "example": "A rent control law may transfer wealth from landlords to some tenants, but it also creates deadweight loss because fewer apartments are supplied and some people who would have rented can't find apartments at all.",
          
          "image": {
            "src": "images/unit2/deadweight_loss.png",
            "alt": "Supply and demand graph with price ceiling showing deadweight loss triangle",
            "caption": "Figure 2.4.10: Price controls create deadweight loss—transactions that would have benefited both parties no longer occur."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing a Price Ceiling",
          
          "image": {
            "src": "images/unit2/disequilibrium_example1.png",
            "alt": "Apartment rental market data",
            "caption": "Figure 2.4.11: Analyze effects of rent control price ceiling."
          },
          
          "problem": "The apartment market in a city has demand Qd = 1000 - 2P and supply Qs = 200 + 2P, where P is monthly rent in dollars, Q is number of apartments. The government imposes a rent ceiling of $150 per month.<br>a) Find equilibrium price and quantity without rent control.<br>b) Is the price ceiling binding?<br>c) What is quantity demanded at the ceiling? Quantity supplied?<br>d) What is the shortage of apartments?<br>e) What problems will likely arise?",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "Set Qd = Qs: 1000 - 2P = 200 + 2P → 800 = 4P → P = $200. Q = 1000 - 2(200) = 600 apartments."
            },
            {
              "step": "Check if binding",
              "explanation": "Equilibrium price is $200. Ceiling is $150, which is below equilibrium. So the ceiling is binding."
            },
            {
              "step": "Calculate at ceiling",
              "explanation": "At P = $150: Qd = 1000 - 2(150) = 1000 - 300 = 700. Qs = 200 + 2(150) = 200 + 300 = 500."
            },
            {
              "step": "Shortage",
              "explanation": "Shortage = Qd - Qs = 700 - 500 = 200 apartments."
            },
            {
              "step": "Problems",
              "explanation": "Likely problems: long waiting lists, discrimination by landlords, black markets (illegal payments to get apartments), reduced quality and maintenance of existing apartments, reduced construction of new apartments."
            }
          ],
          
          "final_answer": "a) P=$200, Q=600. b) Yes, binding. c) Qd=700, Qs=500. d) Shortage of 200. e) Waiting lists, discrimination, black markets, quality decline.",
          "concept_applied": "Binding price ceilings create persistent shortages and various unintended consequences."
        },
        {
          "title": "Analyzing a Price Floor",
          
          "image": {
            "src": "images/unit2/disequilibrium_example2.png",
            "alt": "Agricultural market data",
            "caption": "Figure 2.4.12: Analyze effects of agricultural price support floor."
          },
          
          "problem": "The wheat market has demand Qd = 500 - 10P and supply Qs = 100 + 10P, where P is price per bushel, Q is millions of bushels. The government sets a price floor of $25 per bushel and agrees to buy any surplus.<br>a) Find equilibrium price and quantity.<br>b) Is the price floor binding?<br>c) What is quantity demanded at the floor? Quantity supplied?<br>d) What is the surplus? How much will the government need to buy?<br>e) What is the cost to the government if it pays the floor price for surplus?<br>f) What are the efficiency implications?",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "Set Qd = Qs: 500 - 10P = 100 + 10P → 400 = 20P → P = $20. Q = 500 - 10(20) = 300 million bushels."
            },
            {
              "step": "Check if binding",
              "explanation": "Equilibrium price is $20. Floor is $25, which is above equilibrium. So the floor is binding."
            },
            {
              "step": "Calculate at floor",
              "explanation": "At P = $25: Qd = 500 - 10(25) = 500 - 250 = 250. Qs = 100 + 10(25) = 100 + 250 = 350."
            },
            {
              "step": "Surplus and government purchase",
              "explanation": "Surplus = Qs - Qd = 350 - 250 = 100 million bushels. Government must buy this surplus to maintain the floor price."
            },
            {
              "step": "Government cost",
              "explanation": "Cost = surplus × floor price = 100 million × $25 = $2.5 billion."
            },
            {
              "step": "Efficiency implications",
              "explanation": "Resources are used to produce 100 million bushels that consumers don't want at that price. This is inefficient. Taxpayers bear $2.5 billion cost. Some of the surplus may spoil or be wasted. The policy transfers money from taxpayers to farmers."
            }
          ],
          
          "final_answer": "a) P=$20, Q=300. b) Yes, binding. c) Qd=250, Qs=350. d) Surplus=100 million, government buys that. e) $2.5 billion. f) Inefficient resource use, taxpayer cost, potential waste.",
          "concept_applied": "Binding price floors create surpluses that often require government purchases, costing taxpayers and creating inefficiency."
        },
        {
          "title": "Comparing Shortage and Surplus",
          
          "image": {
            "src": "images/unit2/disequilibrium_example3.png",
            "alt": "Market data table",
            "caption": "Figure 2.4.13: Calculate shortage or surplus at different prices."
          },
          
          "problem": "A market has the following demand and supply schedule:<br>Price: $4, $5, $6, $7, $8<br>Qd: 500, 450, 400, 350, 300<br>Qs: 200, 300, 400, 500, 600<br>a) What is equilibrium price and quantity?<br>b) At a price of $5, is there shortage or surplus? How much?<br>c) At a price of $7, is there shortage or surplus? How much?<br>d) If the government sets a price floor at $7, what happens?<br>e) If the government sets a price ceiling at $5, what happens?",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "At $6, Qd = 400 and Qs = 400. Equilibrium price = $6, quantity = 400."
            },
            {
              "step": "At $5",
              "explanation": "Qd = 450, Qs = 300. Qd > Qs by 150, so shortage of 150 units."
            },
            {
              "step": "At $7",
              "explanation": "Qd = 350, Qs = 500. Qs > Qd by 150, so surplus of 150 units."
            },
            {
              "step": "Price floor at $7",
              "explanation": "$7 is above equilibrium, so binding floor. Creates surplus of 150. Without government action, price would tend to fall, but floor prevents it. Unsold goods accumulate."
            },
            {
              "step": "Price ceiling at $5",
              "explanation": "$5 is below equilibrium, so binding ceiling. Creates shortage of 150. Without ceiling, price would rise, but prevented. Non-price rationing needed."
            }
          ],
          
          "final_answer": "a) $6, 400. b) Shortage 150. c) Surplus 150. d) Surplus of 150, unsold goods. e) Shortage of 150, non-price rationing.",
          "concept_applied": "Prices below equilibrium cause shortages; above cause surpluses. Price controls prevent adjustment and create persistent imbalances."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Determine Equilibrium",
          "description": "Find the equilibrium price and quantity where Qd = Qs.",
          "mechanism": "Use table, graph, or equations to find equilibrium.",
          "result": "Baseline equilibrium.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step1.png",
            "alt": "Finding equilibrium point",
            "caption": "Figure 2.4.14: Step 1 - Determine market equilibrium."
          }
        },
        {
          "step": 2,
          "process": "Compare Actual Price to Equilibrium",
          "description": "Determine if current price is above, below, or equal to equilibrium.",
          "mechanism": "If price = equilibrium → market clears. If price > equilibrium → potential surplus. If price < equilibrium → potential shortage.",
          "result": "Identification of disequilibrium type.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step2.png",
            "alt": "Comparing actual price to equilibrium price",
            "caption": "Figure 2.4.15: Step 2 - Compare actual price to equilibrium."
          }
        },
        {
          "step": 3,
          "process": "Calculate Qd and Qs at Actual Price",
          "description": "Find quantities demanded and supplied at the current price.",
          "mechanism": "Use demand and supply functions or tables to find Qd and Qs at the actual price.",
          "result": "Specific quantities.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step3.png",
            "alt": "Reading Qd and Qs from curves at given price",
            "caption": "Figure 2.4.16: Step 3 - Find Qd and Qs at actual price."
          }
        },
        {
          "step": 4,
          "process": "Determine Shortage or Surplus",
          "description": "Calculate the difference between Qd and Qs.",
          "mechanism": "If Qd > Qs, shortage = Qd - Qs. If Qs > Qd, surplus = Qs - Qd.",
          "result": "Magnitude of imbalance.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step4.png",
            "alt": "Calculating gap between Qd and Qs",
            "caption": "Figure 2.4.17: Step 4 - Calculate shortage or surplus."
          }
        },
        {
          "step": 5,
          "process": "Analyze Consequences and Adjustments",
          "description": "Predict market adjustment or effects of price controls.",
          "mechanism": "If free market, price will adjust toward equilibrium. If price controls prevent adjustment, analyze rationing, black markets, government purchases, etc.",
          "result": "Understanding of outcomes.",
          
          "image": {
            "src": "images/unit2/disequilibrium_step5.png",
            "alt": "Arrows showing adjustment or icons showing consequences of controls",
            "caption": "Figure 2.4.18: Step 5 - Analyze adjustment or control consequences."
          }
        }
      ],

      "image": {
        "src": "images/unit2/disequilibrium_summary.png",
        "alt": "Comprehensive disequilibrium summary: shortage, surplus, price ceilings, price floors, consequences",
        "caption": "Figure 2.4.19: Disequilibrium summary - shortages, surpluses, and price controls."
      }
    },
    {
      "section_title": "2.5 Analyzing Market Changes",
      "introduction": "Markets are constantly changing. Incomes rise, technology improves, weather affects crops, and consumer tastes evolve. Each of these changes shifts either the demand curve or the supply curve, leading to a new equilibrium. Understanding how to analyze these changes—predicting the direction of price and quantity adjustments—is a essential skill in microeconomics. In this section, we'll develop a systematic approach to analyzing market changes, considering single shifts and simultaneous shifts, and learning to handle ambiguous cases.",
      
      "introduction_image": {
        "src": "images/unit2/market_changes_intro.png",
        "alt": "Before and after graphs showing shifting curves and new equilibria",
        "caption": "Figure 2.5.1: Market changes shift curves and create new equilibria."
      },
      
      "key_concept": {
        "definition": "Analyzing market changes involves predicting how equilibrium price and quantity respond to shifts in supply or demand. (1) Single shift rules: (a) Demand increase (shift right): Price ↑, Quantity ↑. (b) Demand decrease (shift left): Price ↓, Quantity ↓. (c) Supply increase (shift right): Price ↓, Quantity ↑. (d) Supply decrease (shift left): Price ↑, Quantity ↓. (2) Simultaneous shifts: When both curves shift, one outcome (price or quantity) may be ambiguous, depending on the relative magnitudes of the shifts. (3) Step-by-step approach: (a) Identify which curve(s) shift and direction. (b) Determine effect on equilibrium using graph. (c) For simultaneous shifts, consider whether effects on price or quantity reinforce or oppose. (d) If opposing, the net effect depends on which shift dominates. (4) Common shifters review: Demand shifters—income, prices of related goods, tastes, expectations, number of buyers. Supply shifters—input prices, technology, expectations, number of sellers, taxes/subsidies, natural conditions. (5) Comparative statics: The method of comparing old and new equilibrium after a change.",
        
        "context": "Analyzing market changes is the heart of applied microeconomics. It's how economists predict the effects of events—a new tax, a technological breakthrough, a change in consumer preferences. This analysis appears throughout the AP curriculum and is essential for understanding real-world markets. Mastering the systematic approach will serve you well in exams and in interpreting economic news.",
        
        "image": {
          "src": "images/unit2/market_changes_summary.png",
          "alt": "Four panels showing effects of demand increase, demand decrease, supply increase, supply decrease",
          "caption": "Figure 2.5.2: Summary of how single shifts affect equilibrium price and quantity."
        }
      },

      "classifications": [
        {
          "type": "Demand Shift Only",
          "value": "Change in demand with supply constant",
          "characteristics": ["Curve shifts right or left", "Movement along supply", "P and Q move same direction", "Predictable outcome"],
          "behavior": "When only demand changes, both equilibrium price and quantity move in the same direction as the demand shift. An increase in demand (right shift) raises both price and quantity. A decrease in demand (left shift) lowers both. This is because the supply curve is upward-sloping—higher demand means buyers compete for goods, pushing up price, and producers respond by supplying more along their supply curve. The magnitude of changes depends on the slopes of the curves (elasticities), but the direction is unambiguous. This pattern holds for any demand shifter: income increases (normal goods), price of substitutes increases, price of complements decreases, favorable taste changes, population growth, or expectations of future price increases.",
          
          "image": {
            "src": "images/unit2/demand_shift_only.png",
            "alt": "Two graphs: demand increase (right) with P↑ Q↑, demand decrease (left) with P↓ Q↓",
            "caption": "Figure 2.5.3: Demand shifts cause P and Q to move in same direction."
          },
          
          "examples": [
            {
              "process": "Health study increases demand for blueberries",
              "explanation": "News that blueberries improve health shifts demand right. Price rises, quantity rises as farmers supply more along their supply curve."
            },
            {
              "process": "Recession reduces demand for cars",
              "explanation": "Income falls (normal good), demand shifts left. Price falls, quantity falls as manufacturers reduce production."
            }
          ]
        },
        {
          "type": "Supply Shift Only",
          "value": "Change in supply with demand constant",
          "characteristics": ["Curve shifts right or left", "Movement along demand", "P and Q move opposite directions", "Predictable outcome"],
          "behavior": "When only supply changes, price and quantity move in opposite directions. An increase in supply (right shift) lowers price and increases quantity. A decrease in supply (left shift) raises price and decreases quantity. This is because the demand curve is downward-sloping—more supply means sellers compete for buyers, pushing price down, and buyers respond by purchasing more along their demand curve. The direction is unambiguous, though magnitude varies. This pattern holds for any supply shifter: lower input prices, technological progress, more sellers, favorable natural conditions, subsidies, or expectations of lower future prices (which increase current supply).",
          
          "image": {
            "src": "images/unit2/supply_shift_only.png",
            "alt": "Two graphs: supply increase (right) with P↓ Q↑, supply decrease (left) with P↑ Q↓",
            "caption": "Figure 2.5.4: Supply shifts cause P and Q to move in opposite directions."
          },
          
          "examples": [
            {
              "process": "New technology reduces solar panel costs",
              "explanation": "Supply shifts right. Price of solar panels falls, quantity installed increases."
            },
            {
              "process": "Hurricane destroys orange crops",
              "explanation": "Supply shifts left. Price of oranges rises, quantity sold falls."
            }
          ]
        },
        {
          "type": "Simultaneous Shifts",
          "value": "Both supply and demand change at once",
          "characteristics": ["Two curves shift", "One outcome ambiguous", "Depends on relative shifts", "Need to compare magnitudes", "Can determine one direction if shifts reinforce"],
          "behavior": "When both supply and demand shift simultaneously, the effect on either price or quantity may be ambiguous, depending on the direction and magnitude of the shifts. Four cases: (1) Demand ↑ and Supply ↑: Quantity definitely increases (both increase Q). Price ambiguous—demand ↑ pushes price up, supply ↑ pushes price down. Net effect depends on which shift is larger. (2) Demand ↑ and Supply ↓: Price definitely increases (both push price up). Quantity ambiguous—demand ↑ pushes Q up, supply ↓ pushes Q down. (3) Demand ↓ and Supply ↑: Price definitely decreases (both push price down). Quantity ambiguous—demand ↓ pushes Q down, supply ↑ pushes Q up. (4) Demand ↓ and Supply ↓: Quantity definitely decreases (both push Q down). Price ambiguous—demand ↓ pushes price down, supply ↓ pushes price up. To determine ambiguous outcomes, you need information about the relative sizes of the shifts or the elasticities of the curves. This analysis is crucial for real-world situations where multiple factors change simultaneously.",
          
          "image": {
            "src": "images/unit2/simultaneous_shifts.png",
            "alt": "Four panels showing combinations of demand and supply shifts with ambiguous outcomes noted",
            "caption": "Figure 2.5.5: Simultaneous shifts can make price or quantity ambiguous."
          },
          
          "examples": [
            {
              "process": "Smartphone market: technology improves (S↑) and incomes rise (D↑)",
              "explanation": "Quantity definitely increases. Price ambiguous—technology pushes price down, income pushes price up. Actual outcome depends on which effect dominates. In reality, smartphone prices have often fallen while quality improved."
            },
            {
              "process": "Housing market in growing city: population increases (D↑) and construction costs rise (S↓)",
              "explanation": "Price definitely increases. Quantity ambiguous—more people want housing (Q↑) but higher costs reduce construction (Q↓). Actual quantity change depends on relative strengths."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Systematic Approach: Determine Which Curves Shift and How",
          "statement": "To analyze any market change, follow a systematic process: (1) Identify the event and which curve(s) it affects. Is it a demand shifter (income, related goods prices, tastes, expectations, number of buyers) or a supply shifter (input prices, technology, expectations, number of sellers, taxes, natural conditions)? (2) Determine the direction of the shift (right for increase, left for decrease). (3) Draw or visualize the shift and find the new equilibrium. (4) Compare new equilibrium to old to determine changes in price and quantity. (5) If both curves shift, determine which effects on price and quantity reinforce or oppose. For opposing effects, note ambiguity. This systematic approach prevents errors and provides a clear framework for answering exam questions and real-world analysis.",
          "application": "When given a market scenario, always ask: Which curve shifts? Which direction? Then apply the rules. Write out your reasoning step by step. For ambiguous cases, explain that the outcome depends on relative magnitudes.",
          "example": "Event: 'A drought reduces wheat harvest, and simultaneously, a new health study praises wheat's benefits.' Drought affects supply (left shift). Health study affects demand (right shift). Price definitely rises (both push price up). Quantity ambiguous—drought reduces Q, health study increases Q. Need more info to determine quantity direction.",
          
          "image": {
            "src": "images/unit2/systematic_approach.png",
            "alt": "Flowchart: Event → Which curve? → Direction → New equilibrium → Compare",
            "caption": "Figure 2.5.6: Systematic approach to analyzing market changes."
          }
        },
        {
          "principle": "Use Graphs to Visualize Changes",
          "statement": "Graphs are powerful tools for analyzing market changes. Drawing supply and demand diagrams helps visualize shifts and see the effects on price and quantity. Even a quick sketch can clarify whether price rises or falls, and whether quantity increases or decreases. For simultaneous shifts, graphs make it clear why one outcome is ambiguous—you can see the two opposing forces. When practicing, draw the original equilibrium, then draw the new curve(s) with arrows showing shifts. Label old and new equilibrium points. This visual approach reinforces understanding and is essential for exam success (many AP questions include graphs or require you to draw them).",
          "application": "On exams and in practice, always sketch a graph when analyzing market changes. Label axes, original curves, shift directions, and new equilibrium. This makes your reasoning clear and helps catch errors.",
          "example": "For an increase in demand, draw original D and S, then D2 to the right. New intersection is higher price and higher quantity. For simultaneous shifts, draw both new curves and note the range of possible new equilibria.",
          
          "image": {
            "src": "images/unit2/visualize_changes.png",
            "alt": "Step-by-step graph drawing: original, shift, new equilibrium",
            "caption": "Figure 2.5.7: Use graphs to visualize and analyze market changes."
          }
        },
        {
          "principle": "When Both Curves Shift, One Outcome Is Ambiguous",
          "statement": "A common exam question involves simultaneous shifts. The key insight is that when both curves shift in directions that have opposing effects on either price or quantity, that variable becomes ambiguous—it could increase, decrease, or stay the same depending on the relative sizes of the shifts. For example, if demand increases (pushes price up) and supply increases (pushes price down), the net effect on price is ambiguous. To determine the actual outcome, you need additional information: which shift was larger? how elastic are the curves? In multiple-choice questions, the correct answer often is 'price may increase, decrease, or stay the same' or 'quantity definitely increases but price is ambiguous.' Understanding which outcomes are determinate and which are ambiguous is crucial for correct analysis.",
          "application": "When analyzing simultaneous shifts, first determine which variable (P or Q) has reinforcing effects—that one is determinate. The other variable, with opposing effects, is ambiguous. State clearly that it depends on the relative magnitudes of the shifts.",
          "example": "Demand increases (P↑ Q↑) and supply decreases (P↑ Q↓). Price effects reinforce (both up) so P definitely rises. Quantity effects oppose, so Q is ambiguous. Without knowing which shift dominates, we cannot say whether Q rises or falls.",
          
          "image": {
            "src": "images/unit2/ambiguous.png",
            "alt": "Table showing four combinations of shifts and which outcomes are determinate vs ambiguous",
            "caption": "Figure 2.5.8: With simultaneous shifts, one outcome is determinate, the other ambiguous."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Single Shift Analysis",
          
          "image": {
            "src": "images/unit2/market_example1.png",
            "alt": "List of events",
            "caption": "Figure 2.5.9: Analyze each event's effect on equilibrium P and Q."
          },
          
          "problem": "For each event, determine the effect on equilibrium price and quantity in the specified market:<br>a) Coffee market: Price of tea increases sharply.<br>b) New car market: Automobile workers' wages increase.<br>c) Air travel market: Fuel prices decrease.<br>d) Movie tickets market: Streaming services become more popular.<br>e) Housing market: Population of the city increases.",
          
          "step_by_step": [
            {
              "step": "Event a",
              "explanation": "Tea is a substitute for coffee. Tea price ↑ increases demand for coffee (shift right). Supply unchanged. Result: P ↑, Q ↑."
            },
            {
              "step": "Event b",
              "explanation": "Wages are an input price increase. This decreases supply of cars (shift left). Demand unchanged. Result: P ↑, Q ↓."
            },
            {
              "step": "Event c",
              "explanation": "Fuel is an input for air travel. Fuel price ↓ decreases costs, increasing supply (shift right). Demand unchanged. Result: P ↓, Q ↑."
            },
            {
              "step": "Event d",
              "explanation": "Streaming is a substitute for movies. Increased popularity reduces demand for movie tickets (shift left). Supply unchanged. Result: P ↓, Q ↓."
            },
            {
              "step": "Event e",
              "explanation": "Population increase means more buyers, increasing demand for housing (shift right). Supply unchanged (in short run). Result: P ↑, Q ↑."
            }
          ],
          
          "final_answer": "a) P↑ Q↑. b) P↑ Q↓. c) P↓ Q↑. d) P↓ Q↓. e) P↑ Q↑.",
          "concept_applied": "Single shifts have predictable effects: D shifts move P and Q same direction; S shifts move them opposite."
        },
        {
          "title": "Simultaneous Shifts Analysis",
          
          "image": {
            "src": "images/unit2/market_example2.png",
            "alt": "Events with multiple changes",
            "caption": "Figure 2.5.10: Analyze simultaneous shift effects."
          },
          
          "problem": "For each scenario, determine the effects on equilibrium price and quantity (↑, ↓, or ambiguous):<br>a) Smartphone market: Technology improves (S↑) and consumer incomes rise (D↑, normal good).<br>b) Beef market: Price of cattle feed increases (S↓) and price of chicken (substitute) increases (D↑).<br>c) Apartment market: New construction increases supply (S↑) and population decreases (D↓).<br>d) Gasoline market: Oil prices rise (S↓) and people buy more fuel-efficient cars (D↓).",
          
          "step_by_step": [
            {
              "step": "Scenario a",
              "explanation": "S↑ → P↓ Q↑; D↑ → P↑ Q↑. Q effects reinforce (both ↑), so Q definitely ↑. P effects oppose (↑ and ↓), so P ambiguous."
            },
            {
              "step": "Scenario b",
              "explanation": "S↓ → P↑ Q↓; D↑ → P↑ Q↑. P effects reinforce (both ↑), so P definitely ↑. Q effects oppose (↓ and ↑), so Q ambiguous."
            },
            {
              "step": "Scenario c",
              "explanation": "S↑ → P↓ Q↑; D↓ → P↓ Q↓. P effects reinforce (both ↓), so P definitely ↓. Q effects oppose (↑ and ↓), so Q ambiguous."
            },
            {
              "step": "Scenario d",
              "explanation": "S↓ → P↑ Q↓; D↓ → P↓ Q↓. Q effects reinforce (both ↓), so Q definitely ↓. P effects oppose (↑ and ↓), so P ambiguous."
            }
          ],
          
          "final_answer": "a) P ambiguous, Q↑. b) P↑, Q ambiguous. c) P↓, Q ambiguous. d) P ambiguous, Q↓.",
          "concept_applied": "With simultaneous shifts, one variable is determinate (reinforcing effects), the other ambiguous (opposing effects)."
        },
        {
          "title": "Graphical Analysis",
          
          "image": {
            "src": "images/unit2/market_example3.png",
            "alt": "Blank supply and demand axes",
            "caption": "Figure 2.5.11: Draw and label graphs for each scenario."
          },
          
          "problem": "Draw supply and demand graphs for each scenario from the previous problem (simultaneous shifts). Show original equilibrium, shift directions, and new equilibrium. For ambiguous cases, show two possible outcomes.",
          
          "step_by_step": [
            {
              "step": "Scenario a graph",
              "explanation": "Draw original D and S. Shift D right, S right. New equilibrium must have higher Q. Show two possibilities: if D shift larger, P up; if S shift larger, P down. Label both possibilities."
            },
            {
              "step": "Scenario b graph",
              "explanation": "Draw original D and S. Shift D right, S left. New equilibrium must have higher P. Show two Q possibilities: if D shift larger, Q up; if S shift larger, Q down."
            },
            {
              "step": "Scenario c graph",
              "explanation": "Draw original D and S. Shift D left, S right. New equilibrium must have lower P. Show two Q possibilities."
            },
            {
              "step": "Scenario d graph",
              "explanation": "Draw original D and S. Shift D left, S left. New equilibrium must have lower Q. Show two P possibilities."
            }
          ],
          
          "final_answer": "Graphs should show original curves, shifted curves, and new equilibria with appropriate labels and arrows.",
          "concept_applied": "Graphs help visualize why one outcome is ambiguous—the new intersection could be in different places depending on shift magnitudes."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Event(s)",
          "description": "Clearly state what is changing in the market.",
          "mechanism": "Read scenario carefully. List all factors that might affect demand or supply.",
          "result": "Clear list of changes.",
          
          "image": {
            "src": "images/unit2/market_step1.png",
            "alt": "Magnifying glass over event description",
            "caption": "Figure 2.5.12: Step 1 - Identify all events affecting the market."
          }
        },
        {
          "step": 2,
          "process": "Determine Which Curve(s) Shift",
          "description": "For each event, decide whether it affects demand or supply.",
          "mechanism": "Use determinants of demand (income, related goods, tastes, expectations, buyers) and supply (input prices, technology, expectations, sellers, taxes, natural conditions).",
          "result": "Identification of affected curves.",
          
          "image": {
            "src": "images/unit2/market_step2.png",
            "alt": "Decision tree: Demand shifter? Supply shifter?",
            "caption": "Figure 2.5.13: Step 2 - Determine which curve(s) shift."
          }
        },
        {
          "step": 3,
          "process": "Determine Direction of Each Shift",
          "description": "For each shifting curve, decide whether it shifts right (increase) or left (decrease).",
          "mechanism": "Apply logic: income ↑ for normal good → D right. Input price ↑ → S left. Technology ↑ → S right. Etc.",
          "result": "Shift directions.",
          
          "image": {
            "src": "images/unit2/market_step3.png",
            "alt": "Arrows showing right or left shifts",
            "caption": "Figure 2.5.14: Step 3 - Determine direction of each shift."
          }
        },
        {
          "step": 4,
          "process": "Analyze Effects on P and Q",
          "description": "Combine shift effects to determine changes in equilibrium price and quantity.",
          "mechanism": "If one curve shifts, apply single-shift rules. If both shift, determine reinforcing and opposing effects. For opposing effects, outcome is ambiguous.",
          "result": "Predicted changes (↑, ↓, or ambiguous) for P and Q.",
          
          "image": {
            "src": "images/unit2/market_step4.png",
            "alt": "Combining effects with plus and minus signs",
            "caption": "Figure 2.5.15: Step 4 - Combine effects to determine P and Q changes."
          }
        },
        {
          "step": 5,
          "process": "Draw Graph to Verify",
          "description": "Sketch supply-demand diagram to visualize results.",
          "mechanism": "Draw original curves, shifted curves, new equilibria. Confirm verbal analysis. For ambiguous cases, show range of possibilities.",
          "result": "Visual confirmation and deeper understanding.",
          
          "image": {
            "src": "images/unit2/market_step5.png",
            "alt": "Graph with original and shifted curves",
            "caption": "Figure 2.5.16: Step 5 - Draw graph to verify analysis."
          }
        }
      ],

      "image": {
        "src": "images/unit2/market_changes_comprehensive.png",
        "alt": "Comprehensive summary: single shift rules, simultaneous shift table, systematic approach flowchart",
        "caption": "Figure 2.5.17: Market changes analysis - complete summary."
      }
    }
  ],

  "key_terms": [
    "Demand",
    "Law of demand",
    "Quantity demanded",
    "Demand curve",
    "Demand schedule",
    "Change in demand",
    "Change in quantity demanded",
    "Demand shifters",
    "Normal good",
    "Inferior good",
    "Substitutes",
    "Complements",
    "Income effect",
    "Substitution effect",
    "Supply",
    "Law of supply",
    "Quantity supplied",
    "Supply curve",
    "Supply schedule",
    "Change in supply",
    "Change in quantity supplied",
    "Supply shifters",
    "Input prices",
    "Technology",
    "Expectations",
    "Number of sellers",
    "Taxes",
    "Subsidies",
    "Market equilibrium",
    "Equilibrium price",
    "Equilibrium quantity",
    "Market-clearing price",
    "Disequilibrium",
    "Shortage",
    "Excess demand",
    "Surplus",
    "Excess supply",
    "Price ceiling",
    "Price floor",
    "Binding price control",
    "Non-price rationing",
    "Black market",
    "Rent control",
    "Minimum wage",
    "Price supports",
    "Deadweight loss",
    "Comparative statics",
    "Simultaneous shifts",
    "Ambiguous outcome",
    "Ceteris paribus",
    "Supply and demand model"
  ],

  "summary": "Supply and demand are the fundamental tools of microeconomic analysis. The law of demand states that, ceteris paribus, price and quantity demanded are inversely related, shown by a downward-sloping demand curve. Changes in price cause movements along the demand curve; changes in income, prices of related goods, tastes, expectations, or number of buyers shift the entire demand curve. The law of supply states that, ceteris paribus, price and quantity supplied are directly related, shown by an upward-sloping supply curve. Changes in price cause movements along the supply curve; changes in input prices, technology, expectations, number of sellers, taxes, subsidies, or natural conditions shift the entire supply curve. Market equilibrium occurs where quantity demanded equals quantity supplied, determining the market-clearing price and quantity. At prices below equilibrium, shortages occur, pushing prices up; at prices above equilibrium, surpluses occur, pushing prices down. Price ceilings (legal maximums) set below equilibrium create persistent shortages and non-price rationing; price floors (legal minimums) set above equilibrium create persistent surpluses and often require government purchases. When analyzing market changes, follow a systematic approach: identify events, determine which curves shift and in what direction, and combine effects. Single shifts have unambiguous effects. Simultaneous shifts make one outcome ambiguous—the net effect depends on relative magnitudes. Mastering supply and demand analysis is essential for understanding how markets work and how they respond to changes in economic conditions and government policies."
}
