{
  "expanded_description": "Why do economists and policymakers worry about monopoly? The answer lies in inefficiency. Compared to perfect competition, monopoly restricts output and charges a higher price, creating a loss to society known as deadweight loss. This loss represents transactions that would have benefited both consumers and producers but do not occur under monopoly. Beyond the deadweight loss, monopolies may also lead to other inefficiencies like rent-seeking, reduced innovation over time, and inequitable transfers from consumers to the monopolist. Understanding these inefficiencies is crucial for evaluating whether government intervention in monopoly markets is justified and for comparing market structures.",
  
  "core_concept": {
    "principle": "Monopoly creates inefficiency compared to perfect competition, measured primarily by deadweight loss. (1) Deadweight loss: The reduction in total surplus (consumer surplus + producer surplus) caused by monopoly. It represents the value of mutually beneficial transactions that do not occur because the monopolist restricts output. Graphically, it's the triangle between the demand curve and the MC curve from the monopoly quantity to the competitive quantity. (2) Consumer surplus transfer: Part of what would have been consumer surplus under competition becomes producer surplus (monopoly profit) under monopoly. This is a transfer, not inefficiency, but raises equity concerns. (3) Underproduction: Monopoly produces less than the socially optimal quantity where $P = MC$. At the monopoly quantity, the value to consumers of an additional unit ($P$) exceeds the cost of producing it ($MC$), indicating underproduction. (4) Rent-seeking: Firms may spend resources to obtain or maintain monopoly power (lobbying, legal fees, patent races). These expenditures use resources without creating value, adding to the social cost of monopoly. (5) X-inefficiency: Without competitive pressure, monopolists may not minimize costs, leading to higher costs than necessary. (6) Dynamic efficiency concerns: While monopoly profits can fund innovation, monopolies may also have less incentive to innovate over time.",
    
    "explanation": "Think of a bridge that costs $\\$100$ per crossing to maintain (marginal cost). If the monopolist charges $\\$200$, some people who value the crossing at $\\$150$ won't use it, even though they'd be willing to pay more than the cost. That's a lost opportunity—a deadweight loss. Society loses the value those trips would have created. The monopolist gains from higher prices, but the loss to consumers is larger than the gain to the monopolist, so total surplus falls.",
    
    "image": {
      "src": "images/unit6/deadweight_loss.png",
      "alt": "Graph showing consumer surplus, producer surplus, and deadweight loss triangle under monopoly",
      "caption": "Figure 6.3.1: Monopoly creates deadweight loss—transactions that don't occur despite benefits exceeding costs."
    }
  },

  "sections": [
    {
      "section_title": "6.3 Inefficiency and Deadweight Loss",
      "introduction": "Why do economists and policymakers worry about monopoly? The answer lies in inefficiency. Compared to perfect competition, monopoly restricts output and charges a higher price, creating a loss to society known as deadweight loss. This loss represents transactions that would have benefited both consumers and producers but do not occur under monopoly. Beyond the deadweight loss, monopolies may also lead to other inefficiencies like rent-seeking, reduced innovation over time, and inequitable transfers from consumers to the monopolist. Understanding these inefficiencies is crucial for evaluating whether government intervention in monopoly markets is justified and for comparing market structures.",
      
      "introduction_image": {
        "src": "images/unit6/inefficiency_intro.png",
        "alt": "Scale with consumer and producer surplus on one side, deadweight loss on the other",
        "caption": "Figure 6.3.2: Monopoly creates deadweight loss—a reduction in total surplus."
      },
      
      "key_concept": {
        "definition": "Monopoly leads to several types of inefficiency compared to perfect competition. (1) Deadweight loss (DWL): The reduction in total surplus (consumer surplus + producer surplus) caused by monopoly. Under monopoly, the quantity produced ($Q_m$) is less than the socially efficient quantity where $P = MC$ ($Q_c$). For each unit between $Q_m$ and $Q_c$, consumers value the unit more than it costs to produce ($P > MC$), but these units are not produced. The sum of these lost surpluses is the deadweight loss. Graphically, DWL is the triangle between the demand curve and the MC curve from $Q_m$ to $Q_c$. (2) Consumer surplus reduction: Consumers lose surplus both from higher prices (paying more for units they still buy) and from reduced consumption (not buying units they would have at competitive price). Part of this loss becomes producer surplus (monopoly profit)—a transfer, not inefficiency. (3) Allocative inefficiency: The monopoly outcome fails the condition for allocative efficiency ($P = MC$). At $Q_m$, $P > MC$, meaning resources are underallocated to this market. Society would benefit from more output. (4) Productive inefficiency: Monopolies may not produce at minimum average total cost (X-inefficiency). Without competitive pressure, they may have higher costs than necessary. (5) Rent-seeking: Firms may spend resources to obtain or maintain monopoly power (lobbying for patents, regulatory capture, legal battles). These expenditures are socially wasteful—they use resources without creating value. (6) Dynamic efficiency concerns: The relationship between monopoly and innovation is complex. Monopoly profits can fund R&D, but monopolies may also have less incentive to innovate due to lack of competition.",
        
        "context": "The analysis of monopoly inefficiency dates back to Adam Smith and was formalized in the late 19th century. The concept of deadweight loss is central to antitrust policy and regulation. When evaluating whether to break up a monopoly or regulate its prices, policymakers weigh the efficiency losses against any benefits (like economies of scale in natural monopolies). In AP Microeconomics, understanding deadweight loss is essential for comparing market structures and evaluating the social cost of market power.",
        
        "image": {
          "src": "images/unit6/dwl_graph.png",
          "alt": "Monopoly graph with DWL triangle shaded, showing consumer and producer surplus areas",
          "caption": "Figure 6.3.3: Deadweight loss is the triangle between demand and MC from Qm to Qc."
        }
      },

      "classifications": [
        {
          "type": "Deadweight Loss",
          "value": "Lost surplus from underproduction",
          "characteristics": ["Triangle between demand and MC", "From Qm to Qc", "Measures inefficiency", "Positive in monopoly", "Zero in perfect competition"],
          "behavior": "Deadweight loss is the fundamental measure of monopoly inefficiency. It represents the value of units that are not produced even though consumers value them more than their cost of production. Under perfect competition, output expands until $P = MC$, exhausting all gains from trade. Under monopoly, the firm restricts output to maximize profit, forgoing these gains. The size of deadweight loss depends on the elasticity of demand and the shape of the MC curve. More inelastic demand leads to larger deadweight loss because the price markup is higher and the quantity reduction is still substantial. Deadweight loss can be calculated as the area of a triangle: $DWL = \\frac{1}{2} (P_m - MC)(Q_c - Q_m)$ when MC is constant, or more generally as the integral of $(P - MC)$ over the range of underproduction.",
          
          "image": {
            "src": "images/unit6/dwl_triangle.png",
            "alt": "DWL triangle highlighted",
            "caption": "Figure 6.3.4: Deadweight loss triangle."
          },
          
          "examples": [
            {
              "process": "DWL calculation",
              "explanation": "If competitive output is 100 units at $P=MC=50$, and monopoly output is 60 units at $P=80$ with $MC=50$ at that range, DWL = ½ × (80-50) × (100-60) = ½ × 30 × 40 = 600."
            }
          ]
        },
        {
          "type": "Consumer Surplus Loss",
          "value": "Consumers lose from higher prices and less output",
          "characteristics": ["Higher prices on units still bought", "Lost consumption on units not bought", "Part becomes producer surplus", "Part becomes DWL", "Regressive effect"],
          "behavior": "Consumers are harmed by monopoly in two ways. First, they pay a higher price for the units they still purchase. This transfers surplus from consumers to the monopolist (becoming part of monopoly profit). Second, they cannot purchase units that they would have bought at the competitive price. This lost consumption is part of deadweight loss—it's surplus that disappears entirely, not transferred. The total loss to consumers is the sum of these two effects. Consumer surplus under monopoly is the area under demand and above price up to $Q_m$. Under perfect competition, consumer surplus would be the area under demand and above $P_c$ up to $Q_c$. The difference is the consumer surplus loss, which is often substantial.",
          
          "image": {
            "src": "images/unit6/cs_loss.png",
            "alt": "Consumer surplus under monopoly vs. competition",
            "caption": "Figure 6.3.5: Consumers lose surplus to both higher prices and lost consumption."
          },
          
          "examples": [
            {
              "process": "CS loss example",
              "explanation": "With demand $P=100-Q$, competitive $P=20$, $Q=80$, CS = ½ × 80 × 80 = 3200. Monopoly $P=60$, $Q=40$, CS = ½ × 40 × 40 = 800. Consumer loss = 2400, of which some becomes profit and some DWL."
            }
          ]
        },
        {
          "type": "Producer Surplus Gain",
          "value": "Monopolist gains from higher prices",
          "characteristics": ["Higher price on units sold", "Profit rectangle", "Transfer from consumers", "Part of total surplus", "Can exceed competitive profit"],
          "behavior": "The monopolist gains producer surplus (economic profit) from its market power. This surplus comes partly from consumers who pay higher prices (transfer) and partly from the fact that the monopolist doesn't compete away profits. Under perfect competition, producer surplus would be zero in long-run equilibrium (normal profit only). Under monopoly, producer surplus is positive and can be substantial. However, the gain to the monopolist is less than the loss to consumers because of deadweight loss. The transfer from consumers to the monopolist is not itself inefficient—it's a redistribution—but it raises equity concerns and may lead to rent-seeking behavior.",
          
          "image": {
            "src": "images/unit6/ps_gain.png",
            "alt": "Producer surplus (profit) rectangle under monopoly",
            "caption": "Figure 6.3.6: Monopoly profit is a transfer from consumers."
          },
          
          "examples": [
            {
              "process": "PS calculation",
              "explanation": "Continuing the example, monopoly profit = $(60-20) × 40 = 1600$. This is producer surplus gain relative to competition where PS=0."
            }
          ]
        },
        {
          "type": "Rent-Seeking",
          "value": "Wasteful spending to gain/keep monopoly",
          "characteristics": ["Lobbying", "Legal fees", "Patent races", "Regulatory capture", "Adds to social cost"],
          "behavior": "Rent-seeking refers to expenditures made by firms to obtain or maintain monopoly power. These expenditures use real resources (lawyers, lobbyists, time) but do not create value—they simply attempt to capture transfers. Examples include: lobbying government for favorable regulations, spending on patent races, legal battles to protect patents, and efforts to capture regulatory agencies. Rent-seeking is socially wasteful because it diverts resources from productive uses. The potential monopoly profit acts as a prize that attracts these expenditures. In some cases, rent-seeking can consume much or even all of the monopoly profit, making the social cost of monopoly much larger than the deadweight loss alone. This is why economists are concerned about activities that create or protect monopoly power.",
          
          "image": {
            "src": "images/unit6/rent_seeking.png",
            "alt": "Lobbyists and lawyers around a monopoly prize",
            "caption": "Figure 6.3.7: Rent-seeking uses resources to gain monopoly power, adding to social cost."
          },
          
          "examples": [
            {
              "process": "Patent race",
              "explanation": "Multiple firms spend millions racing to be first to patent a new drug. Only one wins, but all the R&D spending is sunk. The total social cost includes all this spending, not just the winner's costs."
            },
            {
              "process": "Lobbying for regulatory barriers",
              "explanation": "An industry spends heavily on lobbying to maintain regulations that keep out competitors. This spending is socially wasteful."
            }
          ]
        },
        {
          "type": "X-Inefficiency",
          "value": "Higher costs due to lack of competition",
          "characteristics": ["Costs above minimum", "Managerial slack", "No competitive pressure", "Higher ATC", "Reduces profit and surplus"],
          "behavior": "X-inefficiency refers to the tendency for monopolies to have higher costs than necessary because they lack competitive pressure. In competitive markets, firms must minimize costs to survive. A monopolist, protected by barriers to entry, may become complacent—managers may not work as hard, workers may be less productive, and the firm may not adopt the most efficient technology. Costs rise above the minimum achievable level. This inefficiency reduces both the monopolist's profit and total surplus. X-inefficiency is difficult to measure but can be significant. It's one reason why even regulated monopolies may be less efficient than competitive firms.",
          
          "image": {
            "src": "images/unit6/x_inefficiency.png",
            "alt": "ATC curve shifted up due to inefficiency",
            "caption": "Figure 6.3.8: X-inefficiency means costs are higher than necessary."
          },
          
          "examples": [
            {
              "process": "Legacy monopolies",
              "explanation": "Former state-owned monopolies in telecommunications often had bloated workforces and inefficient operations compared to competitive entrants."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Deadweight Loss Measures the Social Cost of Monopoly",
          "statement": "Deadweight loss is the key measure of monopoly inefficiency. It represents the value of mutually beneficial transactions that do not occur because the monopolist restricts output. At the monopoly quantity, the price consumers are willing to pay exceeds the marginal cost of production, indicating that additional units would create net value. By not producing these units, society loses that potential value. The deadweight loss triangle captures this lost surplus. The size of deadweight loss depends on the elasticity of demand and the shape of the cost curve. More inelastic demand leads to larger deadweight loss because the markup is higher and the quantity reduction is still substantial. Deadweight loss is zero under perfect competition, positive under monopoly, and serves as a benchmark for evaluating the efficiency of real-world markets.",
          "application": "To calculate deadweight loss, find the competitive quantity where $P = MC$ and the monopoly quantity where $MR = MC$. The DWL is the area between demand and MC from $Q_m$ to $Q_c$. For linear curves, $DWL = \\frac{1}{2} (P_m - P_c)(Q_c - Q_m)$ if MC is constant.",
          "example": "With $P=100-Q$, $MC=20$, competitive $Q_c=80$, $P_c=20$. Monopoly $Q_m=40$, $P_m=60$. DWL = ½ × (60-20) × (80-40) = ½ × 40 × 40 = 800.",
          
          "image": {
            "src": "images/unit6/dwl_measure.png",
            "alt": "DWL triangle with dimensions labeled",
            "caption": "Figure 6.3.9: Deadweight loss measures the social cost of monopoly."
          }
        },
        {
          "principle": "Monopoly Involves Both Inefficiency and Redistribution",
          "statement": "The effects of monopoly can be divided into two categories: inefficiency (deadweight loss) and redistribution (transfer from consumers to the monopolist). The deadweight loss is a net loss to society—surplus that disappears entirely. The transfer is a redistribution—what consumers lose, the monopolist gains. While redistribution does not reduce total surplus, it raises equity concerns and may have secondary effects (like rent-seeking). Understanding this distinction is crucial for policy analysis. Policies that aim to reduce monopoly power typically address both concerns: they reduce deadweight loss (improving efficiency) and redistribute surplus back to consumers. However, some policies (like price regulation) may involve trade-offs between these objectives.",
          "application": "When analyzing monopoly, separate the efficiency effects (DWL) from distributional effects (transfer). This helps clarify the goals of policy: eliminating DWL improves efficiency; reducing transfer addresses equity.",
          "example": "In the numerical example, total consumer loss is 2400. Of this, 1600 becomes monopoly profit (transfer) and 800 is deadweight loss (inefficiency).",
          
          "image": {
            "src": "images/unit6/inefficiency_vs_transfer.png",
            "alt": "Pie chart showing DWL and transfer components of consumer loss",
            "caption": "Figure 6.3.10: Monopoly creates both inefficiency (DWL) and redistribution (transfer)."
          }
        },
        {
          "principle": "The Social Cost of Monopoly May Exceed Deadweight Loss",
          "statement": "Deadweight loss is not the only social cost of monopoly. Rent-seeking expenditures—resources spent to obtain or maintain monopoly power—can add substantially to the total cost. If firms compete to become the monopolist (e.g., patent races, lobbying for licenses), they may spend up to the entire expected monopoly profit on these efforts. From a social perspective, these expenditures are wasteful because they use resources without creating value. In extreme cases, the entire monopoly profit could be dissipated through rent-seeking, making the social cost much larger than the deadweight loss. Additionally, X-inefficiency (higher costs due to lack of competitive pressure) can further increase the social cost. These considerations suggest that the full cost of monopoly to society may be substantially greater than the deadweight loss triangle alone would suggest.",
          "application": "When evaluating the social cost of monopoly, consider not just the DWL but also potential rent-seeking and X-inefficiency. These are harder to measure but can be significant.",
          "example": "If a monopoly is expected to earn $\\$1$ billion in profit, firms may spend up to $\\$1$ billion competing for that position (through R&D, lobbying, etc.). This spending is socially wasteful, adding to the cost of monopoly.",
          
          "image": {
            "src": "images/unit6/social_cost.png",
            "alt": "DWL plus rent-seeking and X-inefficiency components",
            "caption": "Figure 6.3.11: Total social cost of monopoly may exceed deadweight loss."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Deadweight Loss",
          
          "image": {
            "src": "images/unit6/inefficiency_example1.png",
            "alt": "Demand and cost functions",
            "caption": "Figure 6.3.12: Calculate deadweight loss from monopoly."
          },
          
          "problem": "A monopolist faces demand $P = 120 - 3Q$ and has constant marginal cost $MC = 30$.<br>a) Find the monopoly price and quantity.<br>b) Find the competitive price and quantity (where $P = MC$).<br>c) Calculate the deadweight loss from monopoly.<br>d) Calculate consumer surplus under monopoly and under competition. What is the loss in consumer surplus?<br>e) How much of the consumer loss is transferred to the monopolist? How much is deadweight loss?",
          
          "step_by_step": [
            {
              "step": "Find monopoly outcome",
              "explanation": "$MR = 120 - 6Q$. Set $MR = MC$: $120 - 6Q = 30$ → $6Q = 90$ → $Q_m = 15$. $P_m = 120 - 3(15) = 120 - 45 = 75$."
            },
            {
              "step": "Find competitive outcome",
              "explanation": "Set $P = MC$: $120 - 3Q = 30$ → $3Q = 90$ → $Q_c = 30$. $P_c = 30$."
            },
            {
              "step": "Calculate deadweight loss",
              "explanation": "DWL is triangle between demand and MC from $Q_m$ to $Q_c$. Height at $Q_m$: $P_m - MC = 75 - 30 = 45$. Base: $Q_c - Q_m = 30 - 15 = 15$. DWL = $\\frac{1}{2} × 45 × 15 = 337.5$."
            },
            {
              "step": "Consumer surplus comparison",
              "explanation": "Under competition: CS = $\\frac{1}{2} × (120-30) × 30 = \\frac{1}{2} × 90 × 30 = 1350$. Under monopoly: CS = $\\frac{1}{2} × (120-75) × 15 = \\frac{1}{2} × 45 × 15 = 337.5$. Loss in CS = $1350 - 337.5 = 1012.5$."
            },
            {
              "step": "Decompose consumer loss",
              "explanation": "Monopoly profit = $(P_m - MC) × Q_m = (75-30) × 15 = 45 × 15 = 675$. This is transfer from consumers. Deadweight loss = $337.5$ (calculated). Check: $675 + 337.5 = 1012.5$, matching consumer loss."
            }
          ],
          
          "final_answer": "a) $Q_m=15$, $P_m=75$. b) $Q_c=30$, $P_c=30$. c) $DWL=337.5$. d) CS monopoly=$337.5$, CS competition=$1350$, loss=$1012.5$. e) Transfer=$675$, DWL=$337.5$.",
          "concept_applied": "Deadweight loss is the triangle between demand and MC from monopoly to competitive quantity. Consumer loss = transfer + DWL."
        },
        {
          "title": "Graphical Identification of Deadweight Loss",
          
          "image": {
            "src": "images/unit6/inefficiency_example2.png",
            "alt": "Monopoly graph with demand, MR, MC",
            "caption": "Figure 6.3.13: Identify and shade areas on the graph."
          },
          
          "problem": "The graph shows a monopolist's demand, MR, and MC curves. $MC$ is constant.<br>a) Label the monopoly price and quantity as $P_m$ and $Q_m$.<br>b) Label the competitive price and quantity as $P_c$ and $Q_c$.<br>c) Shade the area representing consumer surplus under monopoly.<br>d) Shade the area representing monopoly profit (producer surplus).<br>e) Shade the area representing deadweight loss.<br>f) Explain what each area represents.",
          
          "step_by_step": [
            {
              "step": "Label monopoly outcome",
              "explanation": "Find where $MR = MC$, label $Q_m$. Go up to demand, label $P_m$."
            },
            {
              "step": "Label competitive outcome",
              "explanation": "Find where demand intersects MC, label $Q_c$. At that point, $P_c = MC$."
            },
            {
              "step": "Shade consumer surplus",
              "explanation": "Under monopoly, CS is the triangle above $P_m$ and below demand, from 0 to $Q_m$."
            },
            {
              "step": "Shade monopoly profit",
              "explanation": "Profit is the rectangle between $P_m$ and MC from 0 to $Q_m$."
            },
            {
              "step": "Shade deadweight loss",
              "explanation": "DWL is the triangle between demand and MC from $Q_m$ to $Q_c$."
            },
            {
              "step": "Explain areas",
              "explanation": "CS: value consumers get above what they pay. Profit: monopolist's gain above costs. DWL: lost surplus from units not produced."
            }
          ],
          
          "final_answer": "Graph should show all areas correctly labeled and shaded.",
          "concept_applied": "Graphical analysis shows the components of surplus and the deadweight loss triangle."
        },
        {
          "title": "Rent-Seeking and Social Cost",
          
          "image": {
            "src": "images/unit6/inefficiency_example3.png",
            "alt": "Rent-seeking scenario",
            "caption": "Figure 6.3.14: Analyze rent-seeking behavior."
          },
          
          "problem": "A pharmaceutical company expects to earn $\\$500$ million in monopoly profit from a new drug if it receives a patent. To obtain the patent, it must invest in R&D. Several other firms are also racing to develop a similar drug.<br>a) If there are 5 firms, each spending $\\$100$ million on R&D, and only one wins the patent, what is the total social cost of the R&D race?<br>b) How does this compare to the deadweight loss from the monopoly (assume DWL is $\\$200$ million)?<br>c) What does this imply about the total social cost of monopoly?<br>d) If the firms anticipated this, would they still enter the race? Explain.",
          
          "step_by_step": [
            {
              "step": "Calculate total R&D spending",
              "explanation": "5 firms × $\\$100$ million = $\\$500$ million. This is the total resources devoted to the patent race."
            },
            {
              "step": "Compare to DWL",
              "explanation": "DWL is $\\$200$ million. R&D spending ($\\$500$ million) is larger than DWL. The social cost includes both the DWL from the resulting monopoly and the wasteful R&D spending."
            },
            {
              "step": "Implication for social cost",
              "explanation": "Total social cost = DWL + wasteful R&D spending (at least the losing firms' spending, possibly some of the winner's if it exceeds what would have been spent in a competitive market). Here, total cost could be $\\$700$ million or more, far exceeding DWL alone."
            },
            {
              "step": "Would firms still enter?",
              "explanation": "From an individual firm's perspective, expected profit is ($\\$500$ million × probability of winning) minus R&D cost. If probability is 1/5, expected profit = $\\$100$ million - $\\$100$ million = 0. They might be indifferent. But if any firm sees a slightly higher chance, they'd enter. This is a classic rent-seeking equilibrium where expected profits are zero but total spending equals the prize."
            }
          ],
          
          "final_answer": "a) $\\$500$ million. b) R&D spending exceeds DWL. c) Social cost may be much larger than DWL alone. d) Firms may still enter if expected profit is zero or positive; competition can drive total spending to equal expected monopoly profit.",
          "concept_applied": "Rent-seeking can add substantially to the social cost of monopoly, potentially exceeding deadweight loss."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Find Monopoly Outcome",
          "description": "Determine $Q_m$ where $MR = MC$, then $P_m$ from demand.",
          "mechanism": "$MR = MC$ → $Q_m$, $P_m = P(Q_m)$.",
          "result": "Monopoly price and quantity.",
          
          "image": {
            "src": "images/unit6/ineff_step1.png",
            "alt": "Finding monopoly outcome",
            "caption": "Figure 6.3.15: Step 1 - Find monopoly price and quantity."
          }
        },
        {
          "step": 2,
          "process": "Find Competitive Outcome",
          "description": "Determine $Q_c$ where $P = MC$, then $P_c$ (which equals MC).",
          "mechanism": "$P(Q) = MC(Q)$ → $Q_c$, $P_c = MC$ at that Q.",
          "result": "Competitive price and quantity.",
          
          "image": {
            "src": "images/unit6/ineff_step2.png",
            "alt": "Finding competitive outcome",
            "caption": "Figure 6.3.16: Step 2 - Find competitive price and quantity."
          }
        },
        {
          "step": 3,
          "process": "Calculate Deadweight Loss",
          "description": "Find the area between demand and MC from $Q_m$ to $Q_c$.",
          "mechanism": "$DWL = \\int_{Q_m}^{Q_c} (P(Q) - MC(Q)) dQ$. For linear curves, $DWL = \\frac{1}{2} (P_m - MC)(Q_c - Q_m)$ if MC constant.",
          "result": "Deadweight loss value.",
          
          "image": {
            "src": "images/unit6/ineff_step3.png",
            "alt": "DWL triangle calculation",
            "caption": "Figure 6.3.17: Step 3 - Calculate deadweight loss."
          }
        },
        {
          "step": 4,
          "process": "Compute Surplus Changes",
          "description": "Calculate consumer surplus, producer surplus, and total surplus under both scenarios.",
          "mechanism": "$CS = \\int_0^Q P(Q) dQ - P×Q$, $PS = P×Q - \\int_0^Q MC(Q) dQ$.",
          "result": "Surplus comparison.",
          
          "image": {
            "src": "images/unit6/ineff_step4.png",
            "alt": "Surplus areas",
            "caption": "Figure 6.3.18: Step 4 - Compute surplus changes."
          }
        },
        {
          "step": 5,
          "process": "Consider Additional Inefficiencies",
          "description": "Evaluate potential rent-seeking and X-inefficiency.",
          "mechanism": "Assess whether resources are being spent to obtain/maintain monopoly power. Consider if costs are above minimum.",
          "result": "Broader assessment of social cost.",
          
          "image": {
            "src": "images/unit6/ineff_step5.png",
            "alt": "Rent-seeking and X-inefficiency",
            "caption": "Figure 6.3.19: Step 5 - Consider additional inefficiencies."
          }
        }
      ],

      "image": {
        "src": "images/unit6/inefficiency_summary.png",
        "alt": "Comprehensive summary: deadweight loss, consumer loss, transfer, rent-seeking, X-inefficiency",
        "caption": "Figure 6.3.20: Monopoly inefficiency summary."
      }
    }
  ],

  "key_terms": [
    "Deadweight loss (DWL)",
    "Allocative inefficiency",
    "Productive inefficiency",
    "X-inefficiency",
    "Rent-seeking",
    "Consumer surplus",
    "Producer surplus",
    "Total surplus",
    "Transfer",
    "Redistribution",
    "Social cost",
    "Underproduction",
    "$P > MC$",
    "Efficiency loss",
    "Monopoly profit",
    "Patent race",
    "Lobbying",
    "Regulatory capture",
    "Welfare analysis",
    "Pareto efficiency"
  ],

  "summary": "Monopoly creates inefficiency compared to perfect competition, measured primarily by deadweight loss—the value of mutually beneficial transactions that do not occur because the monopolist restricts output. Deadweight loss is the triangle between the demand curve and the marginal cost curve from the monopoly quantity to the competitive quantity. In addition to deadweight loss, monopoly involves a transfer of surplus from consumers to the monopolist (monopoly profit), which is a redistribution rather than inefficiency but raises equity concerns. Consumers lose surplus both from higher prices on units they still buy and from reduced consumption. Other potential inefficiencies include: (1) Rent-seeking—resources spent to obtain or maintain monopoly power (lobbying, patent races, legal battles), which are socially wasteful; (2) X-inefficiency—higher costs due to lack of competitive pressure; (3) Potential dynamic inefficiency—reduced innovation incentives over time. The total social cost of monopoly may substantially exceed the deadweight loss triangle when these factors are considered. Understanding monopoly inefficiency is essential for evaluating antitrust policy, regulation, and the performance of real-world markets."
}
