{
  "expanded_description": "Can a monopolist charge different prices to different customers for the same product? Yes—through price discrimination. This practice allows firms to capture more consumer surplus and increase profits. While price discrimination is often viewed with suspicion, it can sometimes increase output and even benefit some consumers. Understanding the different types of price discrimination, the conditions necessary for it to work, and its effects on efficiency and equity is essential for analyzing real-world pricing strategies. Airlines, movie theaters, pharmaceutical companies, and software vendors all use various forms of price discrimination.",
  
  "core_concept": {
    "principle": "Price discrimination occurs when a firm sells the same product to different customers at different prices for reasons not related to costs. (1) Conditions for price discrimination: (a) Market power—the firm must be able to set prices above marginal cost. (b) Ability to segment customers—the firm must identify groups with different willingness to pay. (c) No arbitrage—customers must not be able to resell the product to others. (2) Types of price discrimination: (a) First-degree (perfect) price discrimination: Charging each customer their maximum willingness to pay. (b) Second-degree price discrimination: Prices vary based on quantity consumed or product version (volume discounts, bundling). (c) Third-degree price discrimination: Dividing customers into groups with different elasticities and charging different prices (student discounts, senior discounts). (3) Effects: Price discrimination generally increases the monopolist's profit. It may increase or decrease total surplus depending on the type and whether output expands. Perfect price discrimination eliminates deadweight loss but transfers all consumer surplus to the producer.",
    
    "explanation": "Think of airline pricing. Business travelers (inelastic demand) pay high last-minute fares. Leisure travelers (elastic demand) get discounts by booking early or staying over Saturday night. The airline is charging different prices for the same seat based on customers' willingness to pay. This is third-degree price discrimination—and it's everywhere once you start looking.",
    
    "image": {
      "src": "images/unit6/price_discrimination_overview.png",
      "alt": "Different customers paying different prices for the same product: student discount, senior discount, business price",
      "caption": "Figure 6.4.1: Price discrimination means different prices for different customers."
    }
  },

  "sections": [
    {
      "section_title": "6.4 Price Discrimination",
      "introduction": "Can a monopolist charge different prices to different customers for the same product? Yes—through price discrimination. This practice allows firms to capture more consumer surplus and increase profits. While price discrimination is often viewed with suspicion, it can sometimes increase output and even benefit some consumers. Understanding the different types of price discrimination, the conditions necessary for it to work, and its effects on efficiency and equity is essential for analyzing real-world pricing strategies. Airlines, movie theaters, pharmaceutical companies, and software vendors all use various forms of price discrimination.",
      
      "introduction_image": {
        "src": "images/unit6/pd_intro.png",
        "alt": "Airline ticket pricing screen showing different prices for same flight",
        "caption": "Figure 6.4.2: Airlines practice price discrimination daily."
      },
      
      "key_concept": {
        "definition": "Price discrimination is the practice of charging different prices to different customers for the same product when the price differences are not based on cost differences. (1) Necessary conditions: (a) Market power: The firm must have some control over price—it cannot be a price taker. (b) Market segmentation: The firm must be able to identify groups of customers with different price elasticities of demand or different willingness to pay. (c) No arbitrage: The firm must prevent customers who buy at low prices from reselling to those who would otherwise pay high prices. If resale is possible, price discrimination fails. (2) Types: (a) First-degree (perfect) price discrimination: The firm charges each customer their maximum willingness to pay. The firm captures all consumer surplus. (b) Second-degree price discrimination: Prices vary based on quantity consumed or product version (volume discounts, bundling, versioning). Customers self-select into different price categories. (c) Third-degree price discrimination: The firm divides customers into distinct groups based on observable characteristics (age, location, time of purchase) and charges different prices to each group. (3) Effects: Price discrimination increases the monopolist's profit. It may increase or decrease total surplus depending on the type and whether output expands. Perfect price discrimination eliminates deadweight loss but transfers all surplus to the producer.",
        
        "context": "The analysis of price discrimination dates back to Arthur Pigou, who classified the three degrees in his 1920 book \"The Economics of Welfare.\" Today, price discrimination is ubiquitous. Understanding it helps explain why seniors get discounts, why software comes in different versions, and why airline prices vary so much. In AP Microeconomics, you'll need to identify types of price discrimination, analyze their effects, and evaluate their implications for efficiency and equity.",
        
        "image": {
          "src": "images/unit6/pd_types.png",
          "alt": "Three panels showing first-degree (individual pricing), second-degree (quantity discounts), third-degree (group pricing)",
          "caption": "Figure 6.4.3: Three degrees of price discrimination."
        }
      },

      "classifications": [
        {
          "type": "First-Degree (Perfect) Price Discrimination",
          "value": "Each customer pays their maximum willingness to pay",
          "characteristics": ["Individual pricing", "Captures all consumer surplus", "Requires perfect information", "Output expands to competitive level", "No deadweight loss"],
          "behavior": "In first-degree price discrimination, the monopolist charges each customer exactly what they are willing to pay. This requires the firm to know each customer's reservation price and prevent arbitrage. With perfect information, the firm can extract all consumer surplus. Interestingly, the profit-maximizing output expands to the competitive level where $P = MC$ because the firm can sell each unit at a different price without lowering price on previous units. Deadweight loss is eliminated, but all surplus goes to the producer. Perfect price discrimination is rare in practice because firms rarely know each customer's exact willingness to pay. However, some situations approximate it: car dealerships (negotiating individual prices), online auctions, and some personalized pricing online.",
          
          "image": {
            "src": "images/unit6/first_degree.png",
            "alt": "Graph showing demand curve with shaded area representing all surplus captured by producer",
            "caption": "Figure 6.4.4: First-degree price discrimination captures all consumer surplus."
          },
          
          "examples": [
            {
              "process": "Car dealership negotiations",
              "explanation": "A car salesperson negotiates individually with each buyer, trying to discover their maximum willingness to pay. Different customers pay different prices for the same car."
            },
            {
              "process": "Online auctions",
              "explanation": "eBay auctions result in each buyer paying their own maximum bid, approximating first-degree discrimination."
            }
          ]
        },
        {
          "type": "Second-Degree Price Discrimination",
          "value": "Prices vary with quantity or product version",
          "characteristics": ["Volume discounts", "Bundling", "Versioning", "Self-selection by consumers", "Common in utilities, software"],
          "behavior": "Second-degree price discrimination involves charging different prices based on the quantity consumed or the version of the product, allowing customers to self-select into different price categories. Examples include: (a) Quantity discounts: Buying in bulk lowers per-unit price (e.g., Costco). (b) Bundling: Selling multiple products together at a discount (e.g., cable TV packages, software suites). (c) Versioning: Offering different versions of a product at different prices (e.g., software with basic, pro, and enterprise editions; first-class vs. economy). Customers choose the version that best matches their willingness to pay. This type of discrimination does not require the firm to identify customer groups in advance—the pricing structure induces self-selection. It's common in industries with high fixed costs and low marginal costs.",
          
          "image": {
            "src": "images/unit6/second_degree.png",
            "alt": "Quantity discounts and product versions",
            "caption": "Figure 6.4.5: Second-degree price discrimination uses quantity or version to sort customers."
          },
          
          "examples": [
            {
              "process": "Electricity pricing",
              "explanation": "Utilities often charge higher rates for the first block of usage and lower rates for additional usage (or vice versa for conservation)."
            },
            {
              "process": "Software versions",
              "explanation": "Microsoft Office comes in Home & Student, Home & Business, and Professional versions at different prices. Users self-select based on their needs."
            },
            {
              "process": "Movie theater popcorn",
              "explanation": "Small, medium, and large sizes are priced so that the per-ounce cost declines with size, encouraging larger purchases."
            }
          ]
        },
        {
          "type": "Third-Degree Price Discrimination",
          "value": "Different prices for different customer groups",
          "characteristics": ["Group pricing", "Based on observable characteristics", "Different elasticities", "Common and visible", "Requires segmentation"],
          "behavior": "Third-degree price discrimination divides customers into distinct groups based on observable characteristics (age, location, student status, time of purchase) and charges different prices to each group. The firm sets prices in each market by equating marginal revenue to the common marginal cost, leading to higher prices in markets with less elastic demand and lower prices in markets with more elastic demand. Examples include student and senior discounts, geographic pricing, and time-based pricing (matinee vs. evening movies). This is the most common and visible form of price discrimination. It requires that the firm can identify group membership and prevent arbitrage between groups (e.g., students can't resell discounted tickets to non-students). The effect on total surplus is ambiguous—it may increase or decrease depending on whether output expands.",
          
          "image": {
            "src": "images/unit6/third_degree.png",
            "alt": "Two groups with different demand curves, different prices, same MC",
            "caption": "Figure 6.4.6: Third-degree price discrimination charges different prices to different groups."
          },
          
          "examples": [
            {
              "process": "Student discounts",
              "explanation": "Movie theaters, museums, and software companies offer lower prices to students, who typically have more elastic demand due to lower incomes."
            },
            {
              "process": "Senior discounts",
              "explanation": "Restaurants and retailers offer discounts to seniors, who may have more elastic demand (fixed incomes) or more time to shop around."
            },
            {
              "process": "Airline pricing",
              "explanation": "Airlines charge higher prices to business travelers (inelastic demand) and lower prices to leisure travelers (elastic demand) through advance purchase requirements and Saturday night stay rules."
            },
            {
              "process": "Geographic pricing",
              "explanation": "Pharmaceutical companies often charge different prices in different countries based on local demand conditions and ability to pay."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Price Discrimination Requires No Arbitrage",
          "statement": "For any form of price discrimination to work, the firm must prevent arbitrage—the practice of buying at a low price and reselling at a high price. If customers who get low prices can resell to those who would otherwise pay high prices, the price differences will be eliminated through market forces. Arbitrage can be prevented through: (a) Physical barriers (services that can't be resold, like haircuts). (b) Legal barriers (contracts prohibiting resale). (c) Product differentiation (making versions non-identical). (d) Time-based restrictions (perishable services). (e) Identification requirements (student IDs). The ease of arbitrage determines whether price discrimination is feasible. Goods that are easily resold (commodities, durable goods) are difficult to price discriminate; services and perishable goods are easier.",
          "application": "When evaluating whether price discrimination is possible, always ask: Can customers who buy at the low price resell to those who would pay the high price? If yes, price discrimination will fail.",
          "example": "Student discounts on movie tickets work because theaters check IDs at the door—students can't buy tickets and resell them to non-students. But if they could, the discount would quickly disappear.",
          
          "image": {
            "src": "images/unit6/no_arbitrage.png",
            "alt": "Arrow showing resale attempt blocked",
            "caption": "Figure 6.4.7: Price discrimination requires preventing arbitrage."
          }
        },
        {
          "principle": "Third-Degree Price Discrimination Involves Charging Higher Prices to Groups with Less Elastic Demand",
          "statement": "In third-degree price discrimination, the monopolist divides customers into groups and sets prices to maximize profit. The condition for profit maximization in each market is $MR_1 = MR_2 = MC$. Since $MR = P(1 - 1/|E|)$, this implies $P_1(1 - 1/|E_1|) = P_2(1 - 1/|E_2|)$. The group with the less elastic demand (smaller $|E|$) will be charged the higher price. This is intuitive: customers who are less sensitive to price can be charged more without losing many sales. The firm sets prices to equate the marginal revenue from each group to the common marginal cost. This explains why students get discounts (more elastic demand) while business travelers pay full fare (less elastic demand).",
          "application": "To determine which group pays a higher price, compare elasticities. The group with more inelastic demand will be charged the higher price. This is the key prediction of third-degree price discrimination.",
          "example": "Business travelers have inelastic demand for last-minute flights (must travel). Leisure travelers have elastic demand (can choose when to fly). Airlines charge business travelers more, leisure travelers less.",
          
          "image": {
            "src": "images/unit6/elasticity_pricing.png",
            "alt": "Two groups with different elasticities and different prices",
            "caption": "Figure 6.4.8: Less elastic demand leads to higher prices in third-degree discrimination."
          }
        },
        {
          "principle": "Price Discrimination Can Increase or Decrease Total Surplus",
          "statement": "The effect of price discrimination on total surplus (efficiency) is ambiguous. It depends on whether output expands or contracts relative to single-price monopoly. (a) First-degree discrimination: Output expands to the competitive level ($P = MC$), eliminating deadweight loss. Total surplus is maximized, but all surplus goes to the producer. (b) Second-degree discrimination: Effects vary, but can increase output by serving customers who wouldn't buy at the single price. (c) Third-degree discrimination: Output may increase or decrease. If the discrimination opens up new markets (serving groups that wouldn't be served at all under single price), total surplus can increase. If it simply reallocates output between groups without expanding total quantity, surplus may decrease. The net effect depends on demand elasticities and market sizes. This ambiguity is why economists don't have a simple verdict on price discrimination—it must be evaluated case by case.",
          "application": "To evaluate the efficiency effects of price discrimination, compare total output under discrimination to output under single-price monopoly. If output increases, total surplus may increase (though distribution changes).",
          "example": "A software company might sell at a high price to businesses and a low price to students. If students wouldn't buy at the high price, the low-price sales increase output and total surplus. If they would have bought anyway, discrimination just transfers surplus.",
          
          "image": {
            "src": "images/unit6/surplus_effects.png",
            "alt": "Comparison of surplus under single price vs. price discrimination",
            "caption": "Figure 6.4.9: Price discrimination can increase or decrease total surplus."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Types of Price Discrimination",
          
          "image": {
            "src": "images/unit6/pd_example1.png",
            "alt": "List of pricing scenarios",
            "caption": "Figure 6.4.10: Identify the type of price discrimination in each scenario."
          },
          
          "problem": "For each scenario, identify the type of price discrimination (first, second, or third degree) and explain why:<br>a) A movie theater charges lower prices for matinee shows than evening shows.<br>b) A software company sells a basic version for $\\$50$ and a professional version for $\\$200$.<br>c) A car salesman negotiates a different price with each customer.<br>d) A museum charges lower admission for students and seniors.<br>e) A utility company charges a lower per-unit rate for customers who use more electricity.<br>f) An airline charges different prices based on how far in advance you book.",
          
          "step_by_step": [
            {
              "step": "Matinee pricing",
              "explanation": "This is third-degree discrimination based on time of day. Customers are segmented by when they attend (leisure vs. potentially more elastic demand at matinees)."
            },
            {
              "step": "Software versions",
              "explanation": "This is second-degree discrimination (versioning). Customers self-select based on their needs and willingness to pay."
            },
            {
              "step": "Car salesman negotiations",
              "explanation": "This approximates first-degree discrimination. The salesman tries to discover each customer's maximum willingness to pay."
            },
            {
              "step": "Student and senior discounts",
              "explanation": "This is third-degree discrimination based on observable group characteristics (age, student status)."
            },
            {
              "step": "Electricity quantity discounts",
              "explanation": "This is second-degree discrimination (quantity discounts). Customers self-select into different pricing tiers based on usage."
            },
            {
              "step": "Airline advance booking",
              "explanation": "This is third-degree discrimination based on time of purchase (leisure vs. business travelers)."
            }
          ],
          
          "final_answer": "a) Third-degree. b) Second-degree. c) First-degree. d) Third-degree. e) Second-degree. f) Third-degree.",
          "concept_applied": "Price discrimination types are distinguished by how customers are sorted: individually (first), by self-selection (second), or by group characteristics (third)."
        },
        {
          "title": "Third-Degree Price Discrimination Calculation",
          
          "image": {
            "src": "images/unit6/pd_example2.png",
            "alt": "Two market segments with demand functions",
            "caption": "Figure 6.4.11: Calculate prices in two markets with third-degree discrimination."
          },
          
          "problem": "A monopolist serves two markets with demand curves:<br>Market A: $P_A = 100 - 2Q_A$<br>Market B: $P_B = 60 - Q_B$<br>The monopolist has constant marginal cost $MC = 20$.<br>a) If the monopolist can price discriminate between the markets, find the price and quantity in each market.<br>b) Calculate total profit.<br>c) If the monopolist must charge a single price, find the aggregate demand, marginal revenue, and profit-maximizing price and quantity.<br>d) Compare total output and profit under discrimination vs. single price.",
          
          "step_by_step": [
            {
              "step": "Find MR in each market",
              "explanation": "Market A: $MR_A = 100 - 4Q_A$<br>Market B: $MR_B = 60 - 2Q_B$"
            },
            {
              "step": "Set MR = MC in each market",
              "explanation": "Market A: $100 - 4Q_A = 20$ → $4Q_A = 80$ → $Q_A = 20$, $P_A = 100 - 2(20) = 60$<br>Market B: $60 - 2Q_B = 20$ → $2Q_B = 40$ → $Q_B = 20$, $P_B = 60 - 20 = 40$"
            },
            {
              "step": "Calculate profit with discrimination",
              "explanation": "Profit A = $(60 - 20) × 20 = 40 × 20 = 800$<br>Profit B = $(40 - 20) × 20 = 20 × 20 = 400$<br>Total profit = $800 + 400 = 1200$"
            },
            {
              "step": "Find single-price outcome",
              "explanation": "Aggregate demand: For $P > 60$, only market A buys. For $P ≤ 60$, both buy. Need to sum horizontally. For $P ≤ 60$, $Q = Q_A + Q_B = (100-P)/2 + (60-P) = 50 - 0.5P + 60 - P = 110 - 1.5P$. Solve for P: $1.5P = 110 - Q$ → $P = (110 - Q)/1.5 = 73.33 - 0.667Q$. This holds for Q where this P ≤ 60, so $73.33 - 0.667Q ≤ 60$ → $13.33 ≤ 0.667Q$ → $Q ≥ 20$. So for Q > 20, use this demand. For Q ≤ 20, only market A: $P = 100 - 2Q$.<br>Find MR for Q>20: $MR = 73.33 - 1.333Q$. Set $MR = MC = 20$: $73.33 - 1.333Q = 20$ → $1.333Q = 53.33$ → $Q = 40$. Then $P = 73.33 - 0.667(40) = 73.33 - 26.68 = 46.65$. Check that this P ≤ 60 (yes). So single-price: $Q=40$, $P=46.65$."
            },
            {
              "step": "Compare outcomes",
              "explanation": "Discrimination: $Q_A=20$, $Q_B=20$, total Q=40, profit=1200.<br>Single price: Q=40, profit = $(46.65-20)×40 = 26.65×40 = 1066$.<br>Same total quantity but higher profit with discrimination."
            }
          ],
          
          "final_answer": "a) Market A: $Q=20$, $P=60$; Market B: $Q=20$, $P=40$. b) Profit = $1200$. c) Single price: $Q=40$, $P=46.65$, profit = $1066$. d) Same total Q, discrimination increases profit.",
          "concept_applied": "Third-degree discrimination increases profit and can leave total quantity unchanged or changed. Here quantity same, profit higher."
        },
        {
          "title": "First-Degree Price Discrimination Analysis",
          
          "image": {
            "src": "images/unit6/pd_example3.png",
            "alt": "Demand and MC for perfect price discrimination",
            "caption": "Figure 6.4.12: Analyze first-degree price discrimination."
          },
          
          "problem": "A monopolist faces demand $P = 100 - Q$ and has constant $MC = 20$.<br>a) Find the single-price monopoly outcome and deadweight loss.<br>b) If the monopolist can perfectly price discriminate, what quantity will it produce?<br>c) What is consumer surplus under perfect price discrimination? Producer surplus?<br>d) What is the deadweight loss under perfect price discrimination?<br>e) Compare total surplus under single price vs. perfect discrimination.",
          
          "step_by_step": [
            {
              "step": "Single-price outcome",
              "explanation": "$MR = 100 - 2Q$, set $MR = MC$: $100 - 2Q = 20$ → $2Q = 80$ → $Q_m = 40$, $P_m = 60$. DWL = $½ × (60-20) × (80-40) = ½ × 40 × 40 = 800$."
            },
            {
              "step": "Perfect discrimination quantity",
              "explanation": "With perfect discrimination, the firm produces until $P = MC$ for the last unit, because it can sell each unit at a different price. Set $P = MC$: $100 - Q = 20$ → $Q = 80$."
            },
            {
              "step": "Surplus under perfect discrimination",
              "explanation": "Consumer surplus = 0 (all surplus captured by firm). Producer surplus = total area under demand and above MC from 0 to 80 = area of trapezoid = $(100-20)×80/2? Actually area of triangle: $½ × (100-20) × 80 = ½ × 80 × 80 = 3200$."
            },
            {
              "step": "Deadweight loss",
              "explanation": "Under perfect discrimination, output is at competitive level, so deadweight loss = 0."
            },
            {
              "step": "Total surplus comparison",
              "explanation": "Single price: CS = $½ × (100-60) × 40 = ½ × 40 × 40 = 800$, PS = $(60-20) × 40 = 1600$, total = 2400, DWL = 800. Perfect discrimination: CS = 0, PS = 3200, total = 3200, DWL = 0. Total surplus is higher under perfect discrimination (efficient) but all goes to producer."
            }
          ],
          
          "final_answer": "a) $Q=40$, $P=60$, DWL=800. b) $Q=80$. c) CS=0, PS=3200. d) DWL=0. e) Total surplus higher under perfect discrimination (3200 > 2400) but distributed differently.",
          "concept_applied": "Perfect price discrimination eliminates deadweight loss and achieves efficiency, but captures all surplus for the producer."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Check Conditions for Price Discrimination",
          "description": "Verify that the firm has market power, can segment customers, and can prevent arbitrage.",
          "mechanism": "Assess whether the firm is a price maker, whether identifiable groups exist, and whether resale is possible.",
          "result": "Feasibility assessment.",
          
          "image": {
            "src": "images/unit6/pd_step1.png",
            "alt": "Three conditions checklist",
            "caption": "Figure 6.4.13: Step 1 - Check conditions for price discrimination."
          }
        },
        {
          "step": 2,
          "process": "Identify Type of Discrimination",
          "description": "Determine whether discrimination is first, second, or third degree.",
          "mechanism": "Based on how customers are sorted: individually (first), by self-selection (second), or by group (third).",
          "result": "Type classification.",
          
          "image": {
            "src": "images/unit6/pd_step2.png",
            "alt": "Three types with examples",
            "caption": "Figure 6.4.14: Step 2 - Identify the type of price discrimination."
          }
        },
        {
          "step": 3,
          "process": "Analyze Pricing Decisions",
          "description": "Determine how prices are set for each type.",
          "mechanism": "First-degree: charge each customer reservation price. Second-degree: design pricing schedules for self-selection. Third-degree: set $MR = MC$ in each market.",
          "result": "Price and quantity outcomes.",
          
          "image": {
            "src": "images/unit6/pd_step3.png",
            "alt": "Pricing rules for each type",
            "caption": "Figure 6.4.15: Step 3 - Analyze pricing decisions."
          }
        },
        {
          "step": 4,
          "process": "Calculate Profit and Surplus",
          "description": "Compute producer and consumer surplus under discrimination.",
          "mechanism": "Sum profits across segments. Compare to single-price monopoly.",
          "result": "Profit and surplus measures.",
          
          "image": {
            "src": "images/unit6/pd_step4.png",
            "alt": "Profit calculation",
            "caption": "Figure 6.4.16: Step 4 - Calculate profit and surplus."
          }
        },
        {
          "step": 5,
          "process": "Evaluate Efficiency Effects",
          "description": "Determine whether total surplus increases or decreases compared to single-price monopoly.",
          "mechanism": "Compare total output under discrimination to single-price output. If output increases, surplus likely increases.",
          "result": "Efficiency assessment.",
          
          "image": {
            "src": "images/unit6/pd_step5.png",
            "alt": "Comparing total surplus",
            "caption": "Figure 6.4.17: Step 5 - Evaluate efficiency effects."
          }
        }
      ],

      "image": {
        "src": "images/unit6/price_discrimination_summary.png",
        "alt": "Comprehensive summary: three types, conditions, examples, efficiency effects",
        "caption": "Figure 6.4.18: Price discrimination summary."
      }
    }
  ],

  "key_terms": [
    "Price discrimination",
    "First-degree price discrimination",
    "Perfect price discrimination",
    "Second-degree price discrimination",
    "Third-degree price discrimination",
    "Market segmentation",
    "Arbitrage",
    "Resale",
    "Willingness to pay",
    "Reservation price",
    "Consumer surplus",
    "Producer surplus",
    "Deadweight loss",
    "Versioning",
    "Bundling",
    "Quantity discounts",
    "Group pricing",
    "Student discounts",
    "Senior discounts",
    "Elasticity",
    "Self-selection",
    "Two-part tariff"
  ],

  "summary": "Price discrimination occurs when a firm sells the same product to different customers at different prices for reasons not based on costs. Three conditions are necessary: market power, ability to segment customers, and no arbitrage (preventing resale). There are three degrees: (1) First-degree (perfect) price discrimination charges each customer their maximum willingness to pay, capturing all consumer surplus and eliminating deadweight loss by expanding output to the competitive level. (2) Second-degree price discrimination uses quantity discounts, bundling, or versioning to induce customers to self-select into different price categories. (3) Third-degree price discrimination divides customers into groups with different elasticities, charging higher prices to groups with less elastic demand. Price discrimination always increases the firm's profit. Its effect on total surplus (efficiency) is ambiguous—it may increase or decrease depending on whether total output expands. Under perfect price discrimination, output expands to the efficient level, eliminating deadweight loss but transferring all surplus to the producer. Understanding price discrimination is essential for analyzing real-world pricing strategies and evaluating their welfare effects."
}
