{
  "expanded_description": "How does a monopolist decide how much to produce and what price to charge? Unlike a perfectly competitive firm that simply takes the market price, a monopolist must consider the entire demand curve. The profit-maximizing rule is the same—produce where marginal revenue equals marginal cost—but the implementation differs because the monopolist's marginal revenue is less than price. Understanding this decision process is crucial for analyzing monopoly outcomes and comparing them to perfect competition. In this section, we'll explore how monopolists find their profit-maximizing price and quantity, how to calculate monopoly profit, and why the outcome differs from competition.",
  
  "core_concept": {
    "principle": "A monopolist maximizes profit by producing the quantity where marginal revenue equals marginal cost ($MR = MC$), then charging the highest price consumers are willing to pay for that quantity, determined by the demand curve. (1) Unlike perfect competition, $P > MR$ because the monopolist faces a downward-sloping demand curve. To sell an additional unit, the monopolist must lower the price on all units, so marginal revenue is less than price. (2) The profit-maximizing quantity $Q^*$ is found where $MR = MC$. (3) The profit-maximizing price $P^*$ is found by going up to the demand curve at $Q^*$: $P^* = P(Q^*)$. (4) Economic profit is calculated as $(P - ATC) \\times Q$. The monopolist can earn positive economic profit even in the long run if barriers to entry persist. (5) There is no supply curve for a monopolist—the same quantity could be supplied at different prices depending on demand conditions. (6) Compared to perfect competition, monopoly results in higher price and lower quantity, assuming identical costs.",
    
    "explanation": "Think of a monopolist as the only seller of a concert ticket. They could sell 1,000 tickets at $\\$100$ each, or 1,500 tickets at $\\$80$ each. They choose the combination that maximizes profit. They'll keep selling tickets as long as the revenue from one more ticket exceeds the cost of providing it. But here's the catch: selling that extra ticket means lowering the price for all tickets, so the marginal revenue is less than the ticket price. This leads them to sell fewer tickets at a higher price than a competitive market would.",
    
    "image": {
      "src": "images/unit6/monopoly_profit_max.png",
      "alt": "Graph showing MR = MC intersection, price from demand curve, profit rectangle",
      "caption": "Figure 6.2.1: Monopolist maximizes profit where MR = MC, then sets price from demand."
    }
  },

  "sections": [
    {
      "section_title": "6.2 Profit Maximization - Monopolist",
      "introduction": "How does a monopolist decide how much to produce and what price to charge? Unlike a perfectly competitive firm that simply takes the market price, a monopolist must consider the entire demand curve. The profit-maximizing rule is the same—produce where marginal revenue equals marginal cost—but the implementation differs because the monopolist's marginal revenue is less than price. Understanding this decision process is crucial for analyzing monopoly outcomes and comparing them to perfect competition. In this section, we'll explore how monopolists find their profit-maximizing price and quantity, how to calculate monopoly profit, and why the outcome differs from competition.",
      
      "introduction_image": {
        "src": "images/unit6/monopoly_profit_intro.png",
        "alt": "Monopolist at a control panel choosing price and quantity",
        "caption": "Figure 6.2.2: The monopolist chooses the profit-maximizing price-quantity combination."
      },
      
      "key_concept": {
        "definition": "A monopolist maximizes profit by following the same marginal principle as competitive firms, but with a key difference: marginal revenue is less than price. (1) Marginal revenue for a monopolist: Because the monopolist faces a downward-sloping demand curve, selling an additional unit requires lowering the price on all units sold. Therefore, $MR = P + Q \\times (\\Delta P/\\Delta Q)$. Since $\\Delta P/\\Delta Q$ is negative, $MR < P$. For linear demand $P = a - bQ$, $MR = a - 2bQ$—twice as steep as demand. (2) Profit-maximizing quantity: Found where $MR = MC$. This determines $Q^*$. (3) Profit-maximizing price: At $Q^*$, find the price consumers are willing to pay from the demand curve: $P^* = P(Q^*)$. (4) Profit calculation: Economic profit = $(P^* - ATC) \\times Q^*$. If $P^* > ATC$, the monopolist earns positive economic profit. (5) No supply curve: A monopolist does not have a supply curve—the same firm could supply different quantities at the same price depending on demand conditions. The firm's decision depends on the entire demand curve, not just price. (6) Comparison to perfect competition: If the monopoly has the same costs as a competitive industry, the monopoly produces less ($Q_m < Q_c$) and charges a higher price ($P_m > P_c$). (7) Long-run profit: Unlike perfect competition, barriers to entry allow monopolists to earn positive economic profit in the long run.",
        
        "context": "The analysis of monopoly profit maximization was developed in the 19th and early 20th centuries as economists sought to understand the behavior of firms with market power. The key insight—that marginal revenue is less than price for a monopolist—is fundamental to industrial organization. In AP Microeconomics, understanding monopoly profit maximization is essential for analyzing the inefficiency of monopoly and for comparing market structures. It also provides the foundation for understanding price discrimination and regulation.",
        
        "image": {
          "src": "images/unit6/mr_mc_graph.png",
          "alt": "Monopoly graph with demand, MR, MC, showing Q* at MR=MC and P* from demand",
          "caption": "Figure 6.2.3: Profit maximization for a monopolist."
        }
      },

      "classifications": [
        {
          "type": "Marginal Revenue for Monopolist",
          "value": "$MR < P$",
          "characteristics": ["Downward-sloping demand", "MR curve below demand", "Twice as steep for linear demand", "$MR = P + Q(\\Delta P/\\Delta Q)$", "Can be negative"],
          "behavior": "Marginal revenue for a monopolist is always less than price. This is because to sell an additional unit, the monopolist must lower the price on all units sold. The revenue gained from the additional unit is partially offset by the revenue lost on existing units that now sell at a lower price. For linear demand $P = a - bQ$, marginal revenue is $MR = a - 2bQ$—a line with the same intercept but twice the slope. MR can become negative if the price reduction effect outweighs the gain from selling another unit. Understanding this relationship is crucial because the monopolist's profit-maximizing quantity is where $MR = MC$, not where $P = MC$ as in competition.",
          
          "image": {
            "src": "images/unit6/mr_derivation.png",
            "alt": "Demand and MR curves, showing MR below demand",
            "caption": "Figure 6.2.4: Marginal revenue lies below the demand curve."
          },
          
          "examples": [
            {
              "process": "Linear demand example",
              "explanation": "If demand is $P = 100 - 2Q$, then $MR = 100 - 4Q$. At Q=10, P=$80$, MR=$60$. The 10th unit adds $60$ to revenue, even though it sells for $80$, because selling it required lowering price from $82$ to $80$ on all 10 units."
            }
          ]
        },
        {
          "type": "Profit-Maximizing Quantity",
          "value": "$Q^*$ where $MR = MC$",
          "characteristics": ["Found at intersection of MR and MC", "Must be on rising portion of MC", "Lower than competitive output", "Determines price via demand", "Key decision point"],
          "behavior": "The monopolist finds its profit-maximizing quantity by locating where marginal revenue equals marginal cost. This is the same rule used by competitive firms, but with a different MR curve. The intersection must occur on the rising portion of the MC curve (if MC is U-shaped). At this quantity, any deviation would reduce profit: producing less would mean $MR > MC$ (forgoing profitable units), producing more would mean $MR < MC$ (adding unprofitable units). Once $Q^*$ is found, the monopolist determines the price consumers will pay for that quantity from the demand curve. This quantity is always less than the quantity that would be produced in a perfectly competitive market with the same cost structure.",
          
          "image": {
            "src": "images/unit6/find_q.png",
            "alt": "MR and MC intersection determining Q*",
            "caption": "Figure 6.2.5: Q* is where MR = MC."
          },
          
          "examples": [
            {
              "process": "Monopoly quantity decision",
              "explanation": "A monopolist with $MR = 100 - 4Q$ and $MC = 20 + 2Q$ sets $100 - 4Q = 20 + 2Q$ → $80 = 6Q$ → $Q = 13.33$. This is the profit-maximizing quantity."
            }
          ]
        },
        {
          "type": "Profit-Maximizing Price",
          "value": "$P^*$ from demand at $Q^*$",
          "characteristics": ["Read from demand curve", "Above MC at Q*", "Higher than competitive price", "Determines profit margin", "Reflects market power"],
          "behavior": "After finding the profit-maximizing quantity $Q^*$, the monopolist sets the highest price consumers are willing to pay for that quantity, which is given by the demand curve: $P^* = P(Q^*)$. This price is always above marginal cost at $Q^*$ (since $MR = MC$ and $MR < P$). The difference $P^* - MC$ is the markup, a measure of market power. The monopolist would like to charge even more, but any higher price would reduce quantity sold below $Q^*$, lowering profit. Any lower price would increase quantity sold but with $MR < MC$ on additional units, reducing profit. The price is therefore determined by the interaction of demand and costs.",
          
          "image": {
            "src": "images/unit6/find_p.png",
            "alt": "From Q* go up to demand curve to find P*",
            "caption": "Figure 6.2.6: P* is found from the demand curve at Q*."
          },
          
          "examples": [
            {
              "process": "Monopoly price",
              "explanation": "Continuing the example, with demand $P = 100 - 2Q$ and $Q^* = 13.33$, $P^* = 100 - 2(13.33) = 100 - 26.66 = 73.34$. The monopolist charges $\\$73.34$ while $MC$ at that quantity is $20 + 2(13.33) = 46.66$, giving a markup of $\\$26.68$."
            }
          ]
        },
        {
          "type": "Monopoly Profit",
          "value": "$\\pi = (P - ATC) \\times Q$",
          "characteristics": ["Can be positive in long run", "Profit rectangle on graph", "Depends on cost structure", "May attract regulatory attention", "Sign of market power"],
          "behavior": "Once $Q^*$ and $P^*$ are determined, economic profit is calculated as total revenue minus total cost, or $(P^* - ATC) \\times Q^*$ where $ATC$ is average total cost at $Q^*$. Graphically, profit is the rectangle with height $(P^* - ATC)$ and width $Q^*$. Unlike perfect competition, monopoly profit can persist in the long run because barriers to entry prevent new firms from entering and competing it away. The size of monopoly profit depends on the firm's cost structure and the elasticity of demand. More inelastic demand allows higher markups and larger profits. Monopoly profit is often a source of concern for regulators and antitrust authorities.",
          
          "image": {
            "src": "images/unit6/profit_rectangle.png",
            "alt": "Profit rectangle between P* and ATC at Q*",
            "caption": "Figure 6.2.7: Monopoly profit is the rectangle (P* - ATC) × Q*."
          },
          
          "examples": [
            {
              "process": "Profit calculation",
              "explanation": "If at $Q^* = 13.33$, $P^* = 73.34$, and $ATC = 50$, then profit per unit = $23.34$, total profit = $23.34 × 13.33 = 311.11$."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Monopolist's Marginal Revenue Is Less Than Price",
          "statement": "This is the most important distinction between monopoly and perfect competition. For a competitive firm, $MR = P$ because the firm can sell any quantity at the market price without affecting that price. For a monopolist, selling an additional unit requires lowering the price on all units sold, so the marginal revenue from that unit is the new price minus the loss on previous units. Mathematically, $MR = P + Q \\times (\\Delta P/\\Delta Q)$. Since $\\Delta P/\\Delta Q$ is negative, $MR < P$. For linear demand, $MR$ has the same intercept but twice the slope. Understanding this relationship explains why monopolists produce less than competitive firms—they recognize that expanding output reduces the price on all units, making additional units less attractive.",
          "application": "When given a demand function, derive $MR$ by doubling the slope. For $P = a - bQ$, $MR = a - 2bQ$. Always check that $MR$ is below demand at all positive quantities.",
          "example": "If demand is $P = 50 - Q$, then $MR = 50 - 2Q$. At $Q=10$, $P=40$, $MR=30$. The 10th unit adds only $30$ to revenue despite selling for $40$.",
          
          "image": {
            "src": "images/unit6/mr_less_p.png",
            "alt": "Graph showing MR below demand",
            "caption": "Figure 6.2.8: For a monopolist, marginal revenue is always less than price."
          }
        },
        {
          "principle": "The Monopolist Produces Less and Charges More Than a Competitive Market",
          "statement": "Compared to a perfectly competitive market with the same cost structure, a monopolist will produce a lower quantity and charge a higher price. In perfect competition, firms produce where $P = MC$, and entry drives price to minimum $ATC$ in the long run. A monopolist produces where $MR = MC$ and charges $P > MC$ from the demand curve. Since $MR < P$, the monopolist's quantity is lower than the competitive quantity where $P = MC$. This reduction in output is the source of monopoly inefficiency. Consumers pay more and get less, while the monopolist earns positive profits. The magnitude of the price increase and quantity decrease depends on the elasticity of demand—more elastic demand leads to smaller deviations from competition.",
          "application": "To compare monopoly to competition, find the competitive quantity where $P = MC$ and the monopoly quantity where $MR = MC$. The monopoly outcome always has $Q_m < Q_c$ and $P_m > P_c$ (assuming identical costs).",
          "example": "With $P = 100 - Q$ and $MC = 20$, competitive outcome: $100 - Q = 20$ → $Q_c = 80$, $P_c = 20$. Monopoly: $MR = 100 - 2Q = 20$ → $2Q = 80$ → $Q_m = 40$, $P_m = 60$. Monopoly produces half as much at triple the price.",
          
          "image": {
            "src": "images/unit6/mono_vs_comp.png",
            "alt": "Comparison of monopoly and competitive outcomes on same graph",
            "caption": "Figure 6.2.9: Monopoly produces less and charges more than competition."
          }
        },
        {
          "principle": "A Monopolist Has No Supply Curve",
          "statement": "Unlike a perfectly competitive firm, a monopolist does not have a supply curve—a relationship between price and quantity supplied independent of demand. The reason is that the monopolist's output decision depends on the shape of the demand curve, not just the price. The same firm might supply different quantities at the same price under different demand conditions, or the same quantity at different prices. For example, if demand becomes more elastic, the monopolist might charge a lower price for the same quantity. There is no unique mapping from price to quantity supplied. This is why economists analyze monopoly using the $MR = MC$ condition rather than a supply curve. The absence of a supply curve is a key difference between monopoly and perfect competition.",
          "application": "When analyzing monopoly, never draw a supply curve. Instead, use the $MR = MC$ intersection to find quantity, then read price from demand. Recognize that the same firm could have different price-quantity combinations under different demand scenarios.",
          "example": "A monopolist facing demand $P = 100 - Q$ produces 40 units at price $60$. If demand shifts to $P = 120 - Q$, the new $MR = 120 - 2Q$, setting equal to $MC=20$ gives $Q=50$, $P=70$. Different price and quantity.",
          
          "image": {
            "src": "images/unit6/no_supply_curve.png",
            "alt": "Graph with no supply curve, only MR and MC",
            "caption": "Figure 6.2.10: Monopolists have no supply curve—output depends on demand."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Finding Monopoly Price and Quantity",
          
          "image": {
            "src": "images/unit6/mono_profit_example1.png",
            "alt": "Demand and cost functions",
            "caption": "Figure 6.2.11: Calculate monopoly price, quantity, and profit."
          },
          
          "problem": "A monopolist faces demand $P = 120 - 4Q$ and has total cost $TC = 20Q + Q^2$.<br>a) Derive the marginal revenue function.<br>b) Derive the marginal cost function.<br>c) Find the profit-maximizing quantity and price.<br>d) Calculate the monopolist's profit.<br>e) What would be the competitive quantity and price if this industry were perfectly competitive with the same MC?",
          
          "step_by_step": [
            {
              "step": "Derive MR",
              "explanation": "For linear demand $P = a - bQ$, $MR = a - 2bQ$. Here $a=120$, $b=4$, so $MR = 120 - 8Q$."
            },
            {
              "step": "Derive MC",
              "explanation": "$MC = dTC/dQ = 20 + 2Q$."
            },
            {
              "step": "Find Q* where MR = MC",
              "explanation": "$120 - 8Q = 20 + 2Q$ → $100 = 10Q$ → $Q = 10$."
            },
            {
              "step": "Find P* from demand",
              "explanation": "$P = 120 - 4(10) = 120 - 40 = 80$."
            },
            {
              "step": "Calculate profit",
              "explanation": "$TR = P × Q = 80 × 10 = 800$. $TC = 20(10) + (10)^2 = 200 + 100 = 300$. Profit = $800 - 300 = 500$."
            },
            {
              "step": "Competitive outcome",
              "explanation": "In perfect competition, $P = MC$. $120 - 4Q = 20 + 2Q$ → $100 = 6Q$ → $Q_c = 16.67$, $P_c = 120 - 4(16.67) = 120 - 66.68 = 53.32$."
            }
          ],
          
          "final_answer": "a) $MR = 120 - 8Q$. b) $MC = 20 + 2Q$. c) $Q=10$, $P=80$. d) Profit = $500$. e) Competitive: $Q=16.67$, $P=53.32$.",
          "concept_applied": "Monopoly produces less and charges more than competition. Profit is (P - ATC) × Q."
        },
        {
          "title": "Graphical Profit Maximization",
          
          "image": {
            "src": "images/unit6/mono_profit_example2.png",
            "alt": "Monopoly graph with demand, MR, MC, ATC",
            "caption": "Figure 6.2.12: Identify profit-maximizing points and profit area."
          },
          
          "problem": "The graph shows a monopolist's demand, MR, MC, and ATC curves.<br>a) Identify the profit-maximizing quantity.<br>b) Identify the profit-maximizing price.<br>c) Shade the area representing total revenue.<br>d) Shade the area representing total cost.<br>e) Shade the area representing profit.<br>f) Label the competitive quantity and price if this market were perfectly competitive.",
          
          "step_by_step": [
            {
              "step": "Find Q*",
              "explanation": "Q* is where MR and MC intersect. Mark this point and drop vertically to quantity axis."
            },
            {
              "step": "Find P*",
              "explanation": "From Q*, go up to the demand curve, then horizontally to price axis. This is P*."
            },
            {
              "step": "Total revenue area",
              "explanation": "Total revenue = P* × Q*. This is a rectangle from origin to Q* horizontally and to P* vertically."
            },
            {
              "step": "Total cost area",
              "explanation": "At Q*, find ATC on the ATC curve. Total cost = ATC × Q*. This rectangle extends from origin to Q* horizontally and to ATC vertically."
            },
            {
              "step": "Profit area",
              "explanation": "Profit = TR - TC. This is the rectangle between P* and ATC over Q*."
            },
            {
              "step": "Competitive outcome",
              "explanation": "Competitive quantity is where P = MC (demand intersects MC). Competitive price is that price. Mark these on the graph."
            }
          ],
          
          "final_answer": "Graph should show Q* at MR=MC, P* from demand, profit rectangle between P* and ATC, and competitive point where demand meets MC.",
          "concept_applied": "Graphical analysis shows monopoly outcomes and comparison to competition."
        },
        {
          "title": "Monopoly with Different Cost Structures",
          
          "image": {
            "src": "images/unit6/mono_profit_example3.png",
            "alt": "Two monopoly scenarios with different costs",
            "caption": "Figure 6.2.13: Compare monopoly outcomes with different costs."
          },
          
          "problem": "Two monopolists face the same demand $P = 100 - Q$ but have different cost structures:<br>Firm A: $MC = 20$, constant<br>Firm B: $MC = 10 + Q$<br>a) Find the profit-maximizing quantity and price for each.<br>b) Calculate profit for each (assume no fixed costs for simplicity).<br>c) Which firm has more market power? How can you tell?<br>d) How would your answers change if there were fixed costs of $\\$200$?",
          
          "step_by_step": [
            {
              "step": "Firm A (constant MC)",
              "explanation": "Demand $P=100-Q$, so $MR = 100 - 2Q$. Set $MR = MC$: $100 - 2Q = 20$ → $2Q = 80$ → $Q = 40$. $P = 100 - 40 = 60$. Profit = $(P - MC) × Q = (60 - 20) × 40 = 40 × 40 = 1600$."
            },
            {
              "step": "Firm B (increasing MC)",
              "explanation": "$MR = 100 - 2Q$, $MC = 10 + Q$. Set equal: $100 - 2Q = 10 + Q$ → $90 = 3Q$ → $Q = 30$. $P = 100 - 30 = 70$. Profit = $(P - ATC) × Q$. Need ATC at Q=30. $TC = ∫MC dQ = 10Q + Q^2/2$ (plus constant, assume 0). At Q=30, $TC = 300 + 450 = 750$. $ATC = 750/30 = 25$. Profit = $(70 - 25) × 30 = 45 × 30 = 1350$."
            },
            {
              "step": "Market power comparison",
              "explanation": "Firm B has more market power as measured by Lerner Index $(P-MC)/P$. Firm A: $(60-20)/60 = 40/60 = 0.67$. Firm B: at Q=30, $MC = 40$, so $(70-40)/70 = 30/70 = 0.43$. Actually Firm A has higher markup! Firm A's constant MC leads to larger markup because demand elasticity at Q=40 is lower. Wait recalc: At Q=30 for Firm B, $MC = 10+30=40$, so Lerner = (70-40)/70 = 30/70 = 0.43. Firm A Lerner = (60-20)/60 = 40/60 = 0.67. Firm A has more market power."
            },
            {
              "step": "Add fixed costs",
              "explanation": "Fixed costs don't affect Q* or P* (they don't change MR or MC). They reduce profit by the amount of fixed costs. Firm A profit becomes $1600 - 200 = 1400$. Firm B profit becomes $1350 - 200 = 1150$."
            }
          ],
          
          "final_answer": "a) Firm A: Q=40, P=60; Firm B: Q=30, P=70. b) Firm A profit=1600, Firm B profit=1350. c) Firm A has higher Lerner index (0.67 > 0.43). d) Profits reduced by $200$ each.",
          "concept_applied": "Cost structure affects monopoly outcome. Constant MC leads to different quantity/price than increasing MC. Fixed costs don't affect price/quantity decisions."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Derive Marginal Revenue",
          "description": "From the demand function, derive marginal revenue.",
          "mechanism": "For linear demand $P = a - bQ$, $MR = a - 2bQ$. For non-linear, differentiate total revenue.",
          "result": "$MR$ function.",
          
          "image": {
            "src": "images/unit6/mono_step1.png",
            "alt": "Deriving MR from demand",
            "caption": "Figure 6.2.14: Step 1 - Derive marginal revenue."
          }
        },
        {
          "step": 2,
          "process": "Find Profit-Maximizing Quantity",
          "description": "Set $MR = MC$ and solve for $Q$.",
          "mechanism": "$MR(Q) = MC(Q)$ → solve for $Q^*$.",
          "result": "$Q^*$.",
          
          "image": {
            "src": "images/unit6/mono_step2.png",
            "alt": "MR = MC intersection",
            "caption": "Figure 6.2.15: Step 2 - Find Q* where MR = MC."
          }
        },
        {
          "step": 3,
          "process": "Find Profit-Maximizing Price",
          "description": "Substitute $Q^*$ into the demand function to find $P^*$.",
          "mechanism": "$P^* = P(Q^*)$.",
          "result": "$P^*$.",
          
          "image": {
            "src": "images/unit6/mono_step3.png",
            "alt": "Finding P* from demand at Q*",
            "caption": "Figure 6.2.16: Step 3 - Find P* from demand."
          }
        },
        {
          "step": 4,
          "process": "Calculate Profit",
          "description": "Compute total revenue minus total cost, or $(P^* - ATC) \\times Q^*$.",
          "mechanism": "Find $ATC$ at $Q^*$ from cost function. Profit = $(P^* - ATC) \\times Q^*$.",
          "result": "Economic profit.",
          
          "image": {
            "src": "images/unit6/mono_step4.png",
            "alt": "Profit calculation",
            "caption": "Figure 6.2.17: Step 4 - Calculate profit."
          }
        },
        {
          "step": 5,
          "process": "Compare to Competition",
          "description": "Find competitive outcome where $P = MC$ for comparison.",
          "mechanism": "Set $P(Q) = MC(Q)$ → solve for $Q_c$, find $P_c$.",
          "result": "Comparison of monopoly and competitive outcomes.",
          
          "image": {
            "src": "images/unit6/mono_step5.png",
            "alt": "Comparing monopoly and competition",
            "caption": "Figure 6.2.18: Step 5 - Compare to competitive outcome."
          }
        }
      ],

      "image": {
        "src": "images/unit6/monopoly_profit_summary.png",
        "alt": "Comprehensive summary: MR derivation, MR=MC rule, price from demand, profit calculation, comparison to competition",
        "caption": "Figure 6.2.19: Monopoly profit maximization summary."
      }
    }
  ],

  "key_terms": [
    "Profit maximization",
    "Marginal revenue (MR)",
    "Marginal cost (MC)",
    "MR = MC rule",
    "Downward-sloping demand",
    "Price maker",
    "Monopoly pricing",
    "Markup",
    "Lerner Index",
    "Deadweight loss",
    "Monopoly quantity",
    "Monopoly price",
    "Monopoly profit",
    "Economic profit",
    "No supply curve",
    "Demand elasticity",
    "Price discrimination",
    "Barriers to entry",
    "Market power",
    "Comparative statics"
  ],

  "summary": "A monopolist maximizes profit by producing the quantity where marginal revenue equals marginal cost ($MR = MC$), then charging the highest price consumers are willing to pay for that quantity, determined by the demand curve. Unlike perfect competition, the monopolist's marginal revenue is less than price because selling an additional unit requires lowering the price on all units. For linear demand $P = a - bQ$, marginal revenue is $MR = a - 2bQ$—twice as steep. The profit-maximizing quantity $Q^*$ is found at $MR = MC$, and the price $P^*$ is read from the demand curve at $Q^*$. Economic profit is $(P^* - ATC) \\times Q^*$, which can persist in the long run due to barriers to entry. Compared to perfect competition with the same costs, monopoly results in lower output and higher price ($Q_m < Q_c$, $P_m > P_c$). A monopolist has no supply curve because the quantity supplied depends on the shape of demand, not just price. Understanding monopoly profit maximization is essential for analyzing market power, inefficiency, and the effects of regulation."
}
