{
  "expanded_description": "What should society do about monopolies? The answer depends on the type of monopoly and its effects. Some monopolies, like those based on patents, are intentionally created to encourage innovation. Others, like natural monopolies, may be more efficient than competition. Still others are harmful and warrant intervention. Governments have several tools to address monopoly power: antitrust laws to prevent monopolization, regulation of prices and service quality, public ownership, and promoting competition. Understanding these policy options and their trade-offs is essential for evaluating real-world interventions in monopoly markets.",
  
  "core_concept": {
    "principle": "Government regulation of monopoly aims to reduce or eliminate the inefficiency and distributional consequences of monopoly power. (1) Antitrust policy: Laws that promote competition by preventing anticompetitive mergers, breaking up monopolies, and prohibiting predatory behavior. Key laws: Sherman Act (1890), Clayton Act (1914), Federal Trade Commission Act (1914). (2) Price regulation: Setting maximum prices that monopolists can charge, commonly used for natural monopolies like utilities. Approaches include: (a) Marginal cost pricing: Set $P = MC$, which achieves allocative efficiency but may cause losses if $ATC > MC$. Requires subsidy. (b) Average cost pricing: Set $P = ATC$, allowing normal profit (zero economic profit). This is common in practice. (c) Rate-of-return regulation: Allowing a fair rate of return on invested capital. (3) Public ownership: Government ownership and operation of monopoly industries (common in other countries, less so in US). (4) Promoting competition: Deregulation, breaking down barriers to entry, encouraging new firms. (5) Challenges: Regulatory capture (regulators serve industry interests), information problems (regulators don't know true costs), and dynamic effects on innovation.",
    
    "explanation": "Think of a local water company—it's a natural monopoly because duplicate pipes would be wasteful. We can't just break it up. So instead, we regulate it. The government might say: you can charge enough to cover your costs plus a fair profit, but no more. This tries to balance efficiency (getting water to everyone) with fairness (not gouging customers). But regulation isn't perfect—the company might inflate costs, and regulators might become too cozy with the industry.",
    
    "image": {
      "src": "images/unit6/regulation_overview.png",
      "alt": "Government regulator overseeing a monopolist with various policy tools",
      "caption": "Figure 6.5.1: Government can regulate monopolies through antitrust, price controls, or public ownership."
    }
  },

  "sections": [
    {
      "section_title": "6.5 Regulation of Monopoly",
      "introduction": "What should society do about monopolies? The answer depends on the type of monopoly and its effects. Some monopolies, like those based on patents, are intentionally created to encourage innovation. Others, like natural monopolies, may be more efficient than competition. Still others are harmful and warrant intervention. Governments have several tools to address monopoly power: antitrust laws to prevent monopolization, regulation of prices and service quality, public ownership, and promoting competition. Understanding these policy options and their trade-offs is essential for evaluating real-world interventions in monopoly markets.",
      
      "introduction_image": {
        "src": "images/unit6/regulation_intro.png",
        "alt": "Government building with icons representing antitrust, price regulation, public ownership",
        "caption": "Figure 6.5.2: Governments use various tools to address monopoly power."
      },
      
      "key_concept": {
        "definition": "Regulation of monopoly refers to government policies designed to control monopoly power and reduce its negative effects. (1) Antitrust policy: Laws and enforcement actions that promote competition by: (a) Prohibiting anticompetitive mergers (horizontal and vertical mergers that would substantially lessen competition). (b) Breaking up existing monopolies (dissolution). (c) Prohibiting anticompetitive practices (price fixing, predatory pricing, exclusive dealing, tying contracts). (2) Price regulation: Direct government setting of prices charged by monopolists, typically used for natural monopolies. Main approaches: (a) Marginal cost pricing: Setting $P = MC$. This achieves allocative efficiency but may result in losses if average cost is above marginal cost (common in natural monopolies). Requires government subsidy to keep firm operating. (b) Average cost pricing: Setting $P = ATC$. This allows the firm to earn zero economic profit (normal profit), avoiding losses while eliminating monopoly profit. It's the most common regulatory approach. (c) Rate-of-return regulation: Allowing the firm to earn a fair rate of return on its invested capital. This can lead to overcapitalization (Averch-Johnson effect). (3) Public ownership: Government ownership and operation of monopoly industries (e.g., many countries have publicly owned utilities, postal services). This removes profit motive but may introduce other inefficiencies. (4) Deregulation and promoting competition: Removing barriers to entry, encouraging new firms, and letting competition replace regulation (e.g., airlines, telecommunications). (5) Challenges: (a) Regulatory capture: Regulators may come to serve the interests of the regulated industry rather than the public. (b) Information asymmetry: Regulators lack full information about the firm's true costs. (c) Dynamic effects: Regulation may reduce incentives for innovation and cost reduction.",
        
        "context": "The history of monopoly regulation in the United States began with the Sherman Antitrust Act of 1890, responding to concerns about the power of trusts like Standard Oil. The Clayton Act and FTC Act in 1914 strengthened antitrust enforcement. Natural monopoly regulation developed with state public utility commissions in the early 20th century. In recent decades, deregulation has swept through industries like airlines, telecommunications, and electricity, with mixed results. In AP Microeconomics, understanding regulation is essential for evaluating policy responses to market power and for analyzing real-world applications of monopoly theory.",
        
        "image": {
          "src": "images/unit6/regulation_tools.png",
          "alt": "Four panels: antitrust, price regulation, public ownership, deregulation",
          "caption": "Figure 6.5.3: Four approaches to monopoly regulation."
        }
      },

      "classifications": [
        {
          "type": "Antitrust Policy",
          "value": "Laws promoting competition",
          "characteristics": ["Sherman Act (1890)", "Clayton Act (1914)", "FTC Act (1914)", "Merger enforcement", "Prohibits anticompetitive practices"],
          "behavior": "Antitrust policy aims to prevent monopoly from arising or to break up existing monopolies. Key provisions: (1) Sherman Act Section 1 prohibits contracts, combinations, and conspiracies in restraint of trade (e.g., price fixing, bid rigging). Section 2 prohibits monopolization and attempts to monopolize. (2) Clayton Act addresses specific practices: price discrimination that lessens competition, exclusive dealing contracts, tying arrangements, mergers that substantially lessen competition, and interlocking directorates. (3) FTC Act created the Federal Trade Commission to enforce antitrust laws. (4) Merger enforcement: The Department of Justice and FTC review proposed mergers to prevent those that would substantially reduce competition. Horizontal mergers (between competitors) are scrutinized most closely. (5) Remedies include: blocking mergers, breaking up companies (dissolution), fines, and injunctions against anticompetitive practices. Notable cases: Standard Oil (1911), AT&T (1982), Microsoft (1998).",
          
          "image": {
            "src": "images/unit6/antitrust.png",
            "alt": "Gavel and law books representing antitrust laws",
            "caption": "Figure 6.5.4: Antitrust laws prevent anticompetitive behavior."
          },
          
          "examples": [
            {
              "process": "Standard Oil breakup",
              "explanation": "In 1911, the Supreme Court ordered the breakup of Standard Oil, which had controlled about 90% of U.S. refining, into 34 separate companies."
            },
            {
              "process": "Microsoft case",
              "explanation": "The Justice Department sued Microsoft in 1998 for bundling Internet Explorer to maintain its operating system monopoly, resulting in a settlement with conduct remedies."
            }
          ]
        },
        {
          "type": "Price Regulation (Natural Monopoly)",
          "value": "Government setting of prices for natural monopolies",
          "characteristics": ["Marginal cost pricing", "Average cost pricing", "Rate-of-return regulation", "Price caps", "Common for utilities"],
          "behavior": "Price regulation is used primarily for natural monopolies—industries where economies of scale are so extensive that a single firm can produce at lower cost than multiple firms. The regulator faces a trade-off: setting price at marginal cost achieves allocative efficiency ($P = MC$) but may cause losses because $ATC > MC$ in natural monopolies. This requires a subsidy. Setting price at average cost ($P = ATC$) allows the firm to break even (zero economic profit) but does not achieve full efficiency because $P > MC$. In practice, regulators often use average cost pricing or rate-of-return regulation. Rate-of-return regulation allows the firm to set prices to earn a \"fair\" rate of return on its invested capital. This can lead to the Averch-Johnson effect—overinvestment in capital because the allowed return exceeds the cost of capital. Modern approaches include price cap regulation, which sets a maximum price adjusted for inflation and expected productivity gains, giving firms incentive to reduce costs.",
          
          "image": {
            "src": "images/unit6/price_regulation.png",
            "alt": "Graph showing marginal cost pricing (loss) and average cost pricing (breakeven)",
            "caption": "Figure 6.5.5: Price regulation choices for natural monopoly."
          },
          
          "examples": [
            {
              "process": "Electric utilities",
              "explanation": "State public utility commissions regulate electricity prices, typically allowing utilities to earn a fair rate of return on their investments."
            },
            {
              "process": "Local telephone service",
              "explanation": "Before deregulation, local phone service was regulated as a natural monopoly with prices set to allow a reasonable return."
            }
          ]
        },
        {
          "type": "Public Ownership",
          "value": "Government ownership of monopoly industries",
          "characteristics": ["State-owned enterprises", "Common outside US", "No profit motive", "May pursue social goals", "Different incentive problems"],
          "behavior": "Public ownership places the monopoly under government control rather than private ownership. The government owns and operates the firm, setting prices and output. This approach removes the profit motive and can allow pursuit of social objectives (universal service, affordability). However, public ownership introduces different incentive problems: managers may face political rather than market pressures, there may be less pressure for efficiency and innovation, and the firm may be used for political patronage. Public ownership is common for utilities in many countries (water, electricity, postal service) but less common in the United States, where regulated private ownership is preferred. The performance of publicly owned enterprises varies widely, with some being efficient and others suffering from bureaucracy and political interference.",
          
          "image": {
            "src": "images/unit6/public_ownership.png",
            "alt": "Government building with industry icon",
            "caption": "Figure 6.5.6: Public ownership places monopoly under government control."
          },
          
          "examples": [
            {
              "process": "US Postal Service",
              "explanation": "The USPS is a government-owned monopoly for first-class mail delivery (though facing competition from private carriers)."
            },
            {
              "process": "European utilities",
              "explanation": "Many European countries have publicly owned water, electricity, and railway companies."
            }
          ]
        },
        {
          "type": "Deregulation and Competition Promotion",
          "value": "Removing barriers and encouraging entry",
          "characteristics": ["Remove entry barriers", "Break up monopolies", "Let competition replace regulation", "Examples: airlines, telecom", "Mixed results"],
          "behavior": "Deregulation involves removing government-imposed barriers to entry and allowing competition to replace regulation. The belief is that competition, if feasible, will lead to lower prices, better service, and innovation. Deregulation has been attempted in industries once thought to be natural monopolies or that were heavily regulated, including airlines (1978), trucking (1980), telecommunications (1996), and electricity in some states. Results have been mixed: airline deregulation led to lower fares and more choices but also financial instability and service reductions to smaller communities. Telecommunications deregulation spurred innovation but also led to consolidation. Deregulation works best when technology has changed to make competition feasible and when there are no insurmountable natural monopoly characteristics. It requires careful design to ensure genuine competition emerges rather than private monopolies.",
          
          "image": {
            "src": "images/unit6/deregulation.png",
            "alt": "Breaking down barriers, new firms entering",
            "caption": "Figure 6.5.7: Deregulation promotes competition by removing barriers."
          },
          
          "examples": [
            {
              "process": "Airline deregulation",
              "explanation": "The Airline Deregulation Act of 1978 removed government control over fares and routes, leading to increased competition, lower fares, and the rise of low-cost carriers."
            },
            {
              "process": "Telecommunications Act of 1996",
              "explanation": "This act aimed to promote competition in local telephone service, though its success has been debated."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Regulation Faces an Information Problem—Regulators Don't Know True Costs",
          "statement": "A fundamental challenge in regulating monopolies is that regulators lack full information about the firm's costs. The firm has an incentive to overstate costs to justify higher prices (under rate-of-return regulation) or to claim that marginal cost pricing would cause larger losses than it actually would. This information asymmetry makes regulation inherently difficult. Regulators must rely on accounting data provided by the firm, which may be manipulated. They may use benchmarking (comparing to similar firms) or incentive regulation (price caps) to mitigate this problem. Price cap regulation, which sets a maximum price that can increase only with inflation minus a productivity factor, gives firms incentive to reduce costs because they keep the profits from cost savings. This aligns incentives better than rate-of-return regulation, which may encourage cost inflation.",
          "application": "When evaluating regulatory options, consider the information available to regulators. Rate-of-return regulation requires detailed cost information; price caps require less information but may lead to quality reductions.",
          "example": "Under rate-of-return regulation, a utility might build a more expensive power plant than necessary because it can earn a return on the larger investment (Averch-Johnson effect). Regulators may not know a cheaper option existed.",
          
          "image": {
            "src": "images/unit6/information_problem.png",
            "alt": "Regulator looking at cost reports that may be inaccurate",
            "caption": "Figure 6.5.8: Regulators lack full information about the firm's true costs."
          }
        },
        {
          "principle": "Regulatory Capture Is a Constant Threat",
          "statement": "Regulatory capture occurs when the regulatory agency, which is supposed to act in the public interest, instead acts to serve the interests of the regulated industry. This can happen through various channels: (a) The \"revolving door\"—regulators may come from the industry and return to it, creating incentives to be favorable. (b) Industry lobbying and political pressure. (c) Information asymmetry—regulators rely on industry for information and may come to adopt industry perspectives. (d) Diffusion of costs, concentration of benefits—the benefits of favorable regulation are concentrated on the industry, while costs are spread among many consumers, giving the industry stronger incentives to influence regulation. Regulatory capture can lead to prices above competitive levels, barriers to entry, and reduced innovation. Preventing capture requires transparency, diverse stakeholder input, and institutional design that insulates regulators from industry pressure.",
          "application": "When analyzing regulation, consider the risk of capture. Who benefits from regulatory decisions? Are there mechanisms to ensure public interest representation? Is there transparency?",
          "example": "Some argue that the Interstate Commerce Commission, which regulated trucking and railroads, became captured by the industries it regulated, leading to inefficient route structures and high prices until deregulation.",
          
          "image": {
            "src": "images/unit6/regulatory_capture.png",
            "alt": "Regulator and industry executive shaking hands with consumers looking on unhappily",
            "caption": "Figure 6.5.9: Regulatory capture occurs when regulators serve industry interests."
          }
        },
        {
          "principle": "There Is No Perfect Solution—Each Approach Has Trade-offs",
          "statement": "Each approach to dealing with monopoly involves trade-offs. Antitrust can prevent monopolies from forming but may be ineffective against natural monopolies. Price regulation can reduce prices but may reduce innovation and efficiency. Public ownership removes profit motive but introduces political incentives. Deregulation can spur competition but may lead to instability or loss of universal service. The choice depends on the specific industry, technology, and institutional context. For natural monopolies with declining average costs, some form of regulation or public ownership is likely necessary. For monopolies based on barriers that can be removed, antitrust or deregulation may be appropriate. For patent-based monopolies, we accept temporary monopoly to encourage innovation. Understanding these trade-offs is essential for informed policy analysis.",
          "application": "When evaluating a monopoly policy, list the pros and cons of each approach. Consider efficiency, equity, innovation, and administrative feasibility. There is rarely a single right answer.",
          "example": "Electricity transmission is a natural monopoly—duplicate wires would be wasteful. Regulation is necessary. But should it be average cost pricing (simple, but inefficient) or marginal cost pricing with subsidies (efficient, but requires raising funds)? Each has trade-offs.",
          
          "image": {
            "src": "images/unit6/tradeoffs.png",
            "alt": "Balance scale with different regulatory approaches",
            "caption": "Figure 6.5.10: Each regulatory approach involves trade-offs."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Comparing Regulatory Approaches for Natural Monopoly",
          
          "image": {
            "src": "images/unit6/reg_example1.png",
            "alt": "Natural monopoly cost and demand curves",
            "caption": "Figure 6.5.11: Compare regulatory options for a natural monopoly."
          },
          
          "problem": "A natural monopoly has demand $P = 100 - Q$ and total cost $TC = 500 + 20Q$ (so $ATC = 500/Q + 20$, $MC = 20$).<br>a) Find the unregulated monopoly price, quantity, and profit.<br>b) If regulators impose marginal cost pricing ($P = MC$), find quantity, price, and the firm's profit or loss. Would a subsidy be needed?<br>c) If regulators impose average cost pricing ($P = ATC$), find quantity, price, and profit.<br>d) Compare the outcomes in terms of efficiency and feasibility.",
          
          "step_by_step": [
            {
              "step": "Unregulated monopoly",
              "explanation": "$MR = 100 - 2Q$. Set $MR = MC = 20$: $100 - 2Q = 20$ → $2Q = 80$ → $Q = 40$, $P = 100 - 40 = 60$. Profit = $(60 - ATC) × 40$. $ATC = 500/40 + 20 = 12.5 + 20 = 32.5$. Profit = $(60 - 32.5) × 40 = 27.5 × 40 = 1100$."
            },
            {
              "step": "Marginal cost pricing",
              "explanation": "Set $P = MC = 20$. From demand: $20 = 100 - Q$ → $Q = 80$. $ATC$ at $Q=80$: $500/80 + 20 = 6.25 + 20 = 26.25$. Loss per unit = $26.25 - 20 = 6.25$, total loss = $6.25 × 80 = 500$. This equals fixed costs. A subsidy of $500$ would be needed to keep firm operating."
            },
            {
              "step": "Average cost pricing",
              "explanation": "Set $P = ATC$: $100 - Q = 500/Q + 20$. Multiply by Q: $100Q - Q^2 = 500 + 20Q$ → $80Q - Q^2 = 500$ → $Q^2 - 80Q + 500 = 0$. Solve: $Q = [80 ± √(6400 - 2000)]/2 = [80 ± √4400]/2 = [80 ± 66.33]/2$. $Q = (80 + 66.33)/2 = 73.165$ or $Q = (80 - 66.33)/2 = 6.835$. The larger Q is the relevant one (efficient scale). So $Q ≈ 73.2$, $P = 100 - 73.2 = 26.8$. Check $ATC = 500/73.2 + 20 = 6.83 + 20 = 26.83$ (close). Profit = 0."
            },
            {
              "step": "Comparison",
              "explanation": "Unregulated: $Q=40$, $P=60$, profit=1100, DWL large. Marginal cost pricing: $Q=80$, $P=20$, efficient but requires $500$ subsidy. Average cost pricing: $Q≈73.2$, $P≈26.8$, zero profit, close to efficient but still some DWL ($P > MC$). Average cost pricing is more feasible (no subsidy) but less efficient."
            }
          ],
          
          "final_answer": "a) $Q=40$, $P=60$, profit=1100. b) $Q=80$, $P=20$, loss=500, subsidy needed. c) $Q≈73.2$, $P≈26.8$, profit=0. d) MC pricing is efficient but requires subsidy; AC pricing is feasible but less efficient.",
          "concept_applied": "Regulation involves trade-offs between efficiency and feasibility. Natural monopolies pose a dilemma."
        },
        {
          "title": "Analyzing an Antitrust Case",
          
          "image": {
            "src": "images/unit6/reg_example2.png",
            "alt": "Merger scenario",
            "caption": "Figure 6.5.12: Evaluate a proposed merger."
          },
          
          "problem": "Two firms in an industry propose to merge. Currently, the industry has 5 firms with market shares: Firm A 30%, Firm B 25%, Firm C 20%, Firm D 15%, Firm E 10%. The merger would combine Firms A and B.<br>a) Calculate the Herfindahl-Hirschman Index (HHI) before and after the merger. HHI is the sum of squared market shares.<br>b) According to DOJ/FTC merger guidelines, markets with HHI below 1500 are unconcentrated, 1500-2500 moderately concentrated, above 2500 highly concentrated. Mergers that increase HHI by more than 200 points in highly concentrated markets raise significant competition concerns. What does this indicate?<br>c) What efficiency arguments might the merging firms make?<br>d) What anticompetitive concerns might regulators have?",
          
          "step_by_step": [
            {
              "step": "Calculate pre-merger HHI",
              "explanation": "HHI = $30^2 + 25^2 + 20^2 + 15^2 + 10^2 = 900 + 625 + 400 + 225 + 100 = 2250$."
            },
            {
              "step": "Calculate post-merger HHI",
              "explanation": "New firm has 30+25 = 55% share. Others unchanged. HHI = $55^2 + 20^2 + 15^2 + 10^2 = 3025 + 400 + 225 + 100 = 3750$."
            },
            {
              "step": "Interpret change",
              "explanation": "Increase = $3750 - 2250 = 1500$ points. Pre-merger HHI 2250 is already in highly concentrated range (>2500? Wait 2250 is in 1500-2500 moderately concentrated? Actually 2250 is in 1500-2500 moderate. Post-merger 3750 is highly concentrated (>2500). Increase of 1500 far exceeds 200-point threshold. This merger would raise significant competition concerns."
            },
            {
              "step": "Efficiency arguments",
              "explanation": "Merging firms might argue: economies of scale, lower costs, improved efficiency, better innovation, synergies that will benefit consumers through lower prices."
            },
            {
              "step": "Anticompetitive concerns",
              "explanation": "Increased market power could lead to higher prices, reduced output, less innovation, and potential for coordinated behavior among remaining firms."
            }
          ],
          
          "final_answer": "a) Pre-merger HHI=2250, post-merger=3750, increase=1500. b) Merger would raise significant concerns. c) Efficiency arguments: scale economies, cost reductions. d) Anticompetitive concerns: higher prices, reduced output.",
          "concept_applied": "Antitrust authorities use HHI to screen mergers for potential competition concerns."
        },
        {
          "title": "Regulatory Capture Analysis",
          
          "image": {
            "src": "images/unit6/reg_example3.png",
            "alt": "Regulatory scenario",
            "caption": "Figure 6.5.13: Analyze potential regulatory capture."
          },
          
          "problem": "A state public utility commission regulates electricity prices. The commission's five members are appointed by the governor. Over time, observers note that: (1) Three of the five commissioners previously worked for regulated utilities. (2) The commission's staff regularly meets with utility executives but rarely with consumer groups. (3) Utility trade associations make campaign contributions to the governor. (4) The commission has consistently approved rate increases close to what utilities request.<br>a) What signs of potential regulatory capture do you see?<br>b) How might capture affect electricity prices and service quality?<br>c) What reforms could reduce the risk of capture?",
          
          "step_by_step": [
            {
              "step": "Identify signs of capture",
              "explanation": "Signs include: (1) Commissioners from the industry (revolving door). (2) Unequal access—utilities have more influence than consumers. (3) Political contributions from industry. (4) Outcomes favor industry (rate increases approved)."
            },
            {
              "step": "Effects of capture",
              "explanation": "Capture likely leads to higher electricity prices than necessary, as regulators approve excessive rate increases. Service quality may be higher than optimal (if utilities can pass costs) or lower (if they have no incentive to improve). Innovation may be stifled if utilities prefer status quo."
            },
            {
              "step": "Reforms",
              "explanation": "Possible reforms: (1) Prohibit commissioners from having industry ties. (2) Fund consumer representation in proceedings. (3) Increase transparency (public meetings, published decisions). (4) Limit campaign contributions from regulated industries. (5) Use price caps instead of rate-of-return regulation to align incentives."
            }
          ],
          
          "final_answer": "a) Industry background of commissioners, unequal access, political contributions, pro-industry outcomes. b) Higher prices, potentially lower service quality, less innovation. c) Revolving door restrictions, consumer funding, transparency, campaign finance reform, price caps.",
          "concept_applied": "Regulatory capture is a real risk that can undermine the public interest goals of regulation."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Type of Monopoly",
          "description": "Determine whether the monopoly is natural, legal, or based on other barriers.",
          "mechanism": "Assess cost structure (economies of scale), source of barriers.",
          "result": "Monopoly classification.",
          
          "image": {
            "src": "images/unit6/reg_step1.png",
            "alt": "Identifying monopoly type",
            "caption": "Figure 6.5.14: Step 1 - Identify the type of monopoly."
          }
        },
        {
          "step": 2,
          "process": "Evaluate Costs and Benefits",
          "description": "Assess the inefficiency (deadweight loss) and distributional effects of the monopoly.",
          "mechanism": "Calculate DWL, consumer loss, monopoly profit. Consider dynamic effects (innovation).",
          "result": "Assessment of monopoly's impact.",
          
          "image": {
            "src": "images/unit6/reg_step2.png",
            "alt": "Weighing costs and benefits",
            "caption": "Figure 6.5.15: Step 2 - Evaluate costs and benefits."
          }
        },
        {
          "step": 3,
          "process": "Consider Policy Options",
          "description": "List possible interventions: antitrust, price regulation, public ownership, deregulation.",
          "mechanism": "Match options to monopoly type. For natural monopolies, price regulation or public ownership. For others, antitrust or deregulation.",
          "result": "Set of policy options.",
          
          "image": {
            "src": "images/unit6/reg_step3.png",
            "alt": "Policy options menu",
            "caption": "Figure 6.5.16: Step 3 - Consider policy options."
          }
        },
        {
          "step": 4,
          "process": "Analyze Trade-offs",
          "description": "For each option, consider efficiency, equity, feasibility, information requirements, and risk of capture.",
          "mechanism": "Compare outcomes under each approach using economic analysis and institutional knowledge.",
          "result": "Trade-off assessment.",
          
          "image": {
            "src": "images/unit6/reg_step4.png",
            "alt": "Balance scale of trade-offs",
            "caption": "Figure 6.5.17: Step 4 - Analyze trade-offs."
          }
        },
        {
          "step": 5,
          "process": "Recommend Approach",
          "description": "Based on analysis, recommend a policy approach.",
          "mechanism": "Choose option that best balances competing objectives given institutional constraints.",
          "result": "Policy recommendation.",
          
          "image": {
            "src": "images/unit6/reg_step5.png",
            "alt": "Recommendation",
            "caption": "Figure 6.5.18: Step 5 - Recommend approach."
          }
        }
      ],

      "image": {
        "src": "images/unit6/regulation_summary.png",
        "alt": "Comprehensive summary: antitrust, price regulation, public ownership, deregulation, challenges",
        "caption": "Figure 6.5.19: Monopoly regulation summary."
      }
    }
  ],

  "key_terms": [
    "Antitrust policy",
    "Sherman Act",
    "Clayton Act",
    "FTC Act",
    "Merger guidelines",
    "Herfindahl-Hirschman Index (HHI)",
    "Price regulation",
    "Marginal cost pricing",
    "Average cost pricing",
    "Rate-of-return regulation",
    "Price cap regulation",
    "Natural monopoly",
    "Public ownership",
    "Deregulation",
    "Regulatory capture",
    "Averch-Johnson effect",
    "Information asymmetry",
    "Revolving door",
    "Predatory pricing",
    "Price fixing",
    "Tying",
    "Exclusive dealing",
    "Horizontal merger",
    "Vertical merger"
  ],

  "summary": "Government regulation of monopoly aims to reduce inefficiency and protect consumers. Policy approaches include: (1) Antitrust policy: Laws (Sherman, Clayton, FTC Acts) that prevent anticompetitive mergers, break up monopolies, and prohibit anticompetitive practices. Merger enforcement uses HHI to screen potentially anticompetitive combinations. (2) Price regulation: Used primarily for natural monopolies where competition is inefficient. Options include marginal cost pricing ($P = MC$, efficient but may require subsidy), average cost pricing ($P = ATC$, zero profit but less efficient), and rate-of-return regulation (allows fair return, may cause overinvestment). (3) Public ownership: Government operation of monopoly industries, common in other countries. (4) Deregulation: Removing barriers to entry and letting competition replace regulation, as in airlines and telecommunications. Each approach faces challenges: information asymmetry (regulators don't know true costs), regulatory capture (regulators serve industry interests), and trade-offs between efficiency and feasibility. The choice of policy depends on the type of monopoly, institutional context, and societal values. Understanding these options and their trade-offs is essential for evaluating real-world interventions in monopoly markets."
}
