{
  "expanded_description": "This section introduces the Doppler effect, a phenomenon observed when there is relative motion between a wave source and an observer. The effect causes the observed frequency of the wave to differ from the emitted frequency. It is commonly experienced with sound waves (e.g., the changing pitch of a siren as it passes by) and also applies to light and other electromagnetic waves, with important applications in astronomy (redshift) and radar. Understanding the Doppler effect is essential for explaining why a moving source sounds different and for analyzing velocity measurements in various scientific contexts.",
  "core_concept": {
    "principle": "The Doppler effect is the change in the observed frequency of a wave when the source and the observer are in relative motion. If the source and observer are moving toward each other, the observed frequency increases (higher pitch for sound, blueshift for light). If they are moving apart, the observed frequency decreases (lower pitch, redshift). For sound waves, the formula depends on whether the source, observer, or both are moving, and the speed of sound in the medium. For light, the relativistic Doppler formula accounts for the constancy of light speed.",
    "explanation": "The Doppler effect arises because relative motion changes the number of wavefronts reaching the observer per unit time. When a source moves toward an observer, each successive wavefront is emitted from a closer position, shortening the wavelength and increasing frequency. Conversely, when the source moves away, wavelengths are stretched. The same effect occurs if the observer moves toward or away from a stationary source. The Doppler effect is a key tool in astronomy (measuring stellar velocities), meteorology (Doppler radar), medicine (ultrasound blood flow measurement), and everyday life (sirens, speed guns).",
    "image": {
      "src": "images/unit8/doppler_effect_intro.png",
      "alt": "Diagram showing wavefronts from a stationary source (concentric circles) and a moving source (compressed ahead, stretched behind)",
      "caption": "A moving source compresses wavefronts in the direction of motion (higher frequency) and stretches them opposite (lower frequency)."
    }
  },
  "sections": [
    {
      "section_title": "What is the Doppler Effect?",
      "introduction": "Have you ever noticed how the pitch of a siren drops as an ambulance passes by? This change in frequency is the Doppler effect. It occurs for all types of waves—sound, light, water waves—whenever the source or observer is moving.",
      "key_concept": {
        "definition": "The Doppler effect is the change in the observed frequency of a wave due to the relative motion between the source and the observer. When the source and observer move toward each other, the observed frequency is higher than the emitted frequency. When they move apart, the observed frequency is lower.",
        "context": "This effect is named after Christian Doppler, who proposed it in 1842. It has profound implications in astronomy (revealing the expansion of the universe), radar technology, medical imaging, and everyday experiences with sound."
      },
      "principles": [
        {
          "principle": "General Description",
          "statement": "If the source and observer are moving relative to each other, the observed frequency $f'$ differs from the emitted frequency $f$. The change depends on the speeds and directions of motion, and for sound, on the speed of sound $v$.",
          "application": "The general formulas for sound waves are: \n- Moving source, stationary observer: $f' = f \\left(\\frac{v}{v \\pm v_s}\\right)$ (minus for source toward observer, plus for away).\n- Stationary source, moving observer: $f' = f \\left(\\frac{v \\pm v_o}{v}\\right)$ (plus for observer toward source, minus for away).\n- Both moving: combine appropriately.",
          "example": "A source emitting 500 Hz sound moves at 30 m/s toward a stationary observer. If $v = 343$ m/s, $f' = 500 \\times \\frac{343}{343-30} = 500 \\times \\frac{343}{313} \\approx 548$ Hz."
        },
        {
          "principle": "Moving Source",
          "statement": "When the source moves, the wavelength in front is shortened, behind is lengthened. For a source moving at speed $v_s$ toward a stationary observer, $f' = f \\frac{v}{v - v_s}$. For a source moving away, $f' = f \\frac{v}{v + v_s}$.",
          "application": "This explains the pitch change of a siren as it approaches and then recedes.",
          "example": "A train whistle at 400 Hz approaches at 25 m/s. Sound speed 343 m/s → $f' = 400 \\times 343/(343-25) = 400 \\times 343/318 \\approx 432$ Hz."
        },
        {
          "principle": "Moving Observer",
          "statement": "When the observer moves toward a stationary source, they encounter wavefronts more frequently, increasing frequency: $f' = f \\frac{v + v_o}{v}$. Moving away: $f' = f \\frac{v - v_o}{v}$.",
          "application": "A person running toward a stationary siren hears a higher pitch than someone standing still.",
          "example": "Observer runs at 5 m/s toward a stationary 600 Hz siren. $f' = 600 \\times (343+5)/343 = 600 \\times 348/343 \\approx 609$ Hz."
        }
      ],
      "classifications": [
        {
          "type": "Source vs. Observer Motion",
          "value": "Two cases that can be combined",
          "characteristics": [
            "Source motion changes wavelength reaching the observer",
            "Observer motion changes the rate at which wavefronts are encountered",
            "Formulas differ; both motions can be present simultaneously"
          ],
          "behavior": "When both source and observer move, the general formula is $f' = f \\frac{v \\pm v_o}{v \\mp v_s}$ with signs chosen appropriately: + in numerator if observer toward source, - in numerator if observer away; - in denominator if source toward observer, + in denominator if source away.",
          "examples": [
            {
              "process": "Source toward, observer toward",
              "explanation": "Both moving toward each other: $f' = f \\frac{v + v_o}{v - v_s}$ (increases frequency more)."
            },
            {
              "process": "Source away, observer away",
              "explanation": "Both moving apart: $f' = f \\frac{v - v_o}{v + v_s}$ (decreases frequency more)."
            }
          ]
        },
        {
          "type": "Applications",
          "value": "Real‑world uses of the Doppler effect",
          "characteristics": [
            "Astronomy: redshift/blueshift of light reveals velocities of stars and galaxies",
            "Radar: police radar guns measure vehicle speed by frequency shift of reflected waves",
            "Medical: Doppler ultrasound measures blood flow velocity",
            "Meteorology: Doppler radar tracks storm movements"
          ],
          "behavior": "In each case, the frequency shift provides information about relative velocity.",
          "examples": [
            {
              "process": "Redshift",
              "explanation": "Light from distant galaxies is shifted to longer wavelengths (redshift) because they are moving away from us, indicating cosmic expansion."
            },
            {
              "process": "Speed gun",
              "explanation": "A radar gun emits a known frequency; the reflected wave from a moving car has a frequency shift proportional to the car's speed."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Moving Source (Sound)",
          "problem": "A police car siren emits a frequency of 800 Hz. The car approaches a stationary observer at 30 m/s, then passes and moves away at the same speed. Calculate the frequency heard by the observer in each case. (Speed of sound = 343 m/s)",
          "step_by_step": [
            {
              "step": "Approaching",
              "explanation": "$f' = f \\frac{v}{v - v_s} = 800 \\times \\frac{343}{343-30} = 800 \\times \\frac{343}{313} = 800 \\times 1.0958 = 876.6$ Hz"
            },
            {
              "step": "Receding",
              "explanation": "$f' = f \\frac{v}{v + v_s} = 800 \\times \\frac{343}{343+30} = 800 \\times \\frac{343}{373} = 800 \\times 0.9196 = 735.7$ Hz"
            }
          ],
          "final_answer": "Approaching: $877$ Hz; Receding: $736$ Hz",
          "concept_applied": "Source motion changes observed frequency; higher when approaching, lower when receding."
        },
        {
          "title": "Moving Observer",
          "problem": "A stationary train horn emits a frequency of 400 Hz. A person runs toward the train at 8 m/s. What frequency does the person hear? (Sound speed = 343 m/s)",
          "step_by_step": [
            {
              "step": "Use moving observer formula (observer toward source)",
              "explanation": "$f' = f \\frac{v + v_o}{v} = 400 \\times \\frac{343+8}{343} = 400 \\times \\frac{351}{343} = 400 \\times 1.0233 = 409.3$ Hz"
            }
          ],
          "final_answer": "$409$ Hz",
          "concept_applied": "Observer motion increases frequency when moving toward the source."
        },
        {
          "title": "Both Source and Observer Moving",
          "problem": "A source emitting 600 Hz moves at 20 m/s toward an observer. The observer moves at 10 m/s toward the source. Sound speed = 340 m/s. Find the observed frequency.",
          "step_by_step": [
            {
              "step": "Identify directions",
              "explanation": "Both moving toward each other: source toward observer (use $v - v_s$ in denominator), observer toward source (use $v + v_o$ in numerator)."
            },
            {
              "step": "Apply combined formula",
              "explanation": "$f' = f \\frac{v + v_o}{v - v_s} = 600 \\times \\frac{340+10}{340-20} = 600 \\times \\frac{350}{320} = 600 \\times 1.09375 = 656.25$ Hz"
            }
          ],
          "final_answer": "$656$ Hz",
          "concept_applied": "When both move toward each other, frequency shift is larger than either alone."
        },
        {
          "title": "Doppler Effect for Light (Conceptual)",
          "problem": "A star emits light at a wavelength of 500 nm. If the star is moving away from Earth at 0.1c (10% of light speed), what is the approximate observed wavelength? (Use non‑relativistic approximation: $\\Delta \\lambda / \\lambda \\approx v/c$.)",
          "step_by_step": [
            {
              "step": "Non‑relativistic Doppler shift for light (approximate)",
              "explanation": "$\\Delta \\lambda = \\lambda \\times (v/c) = 500 \\times 0.1 = 50$ nm"
            },
            {
              "step": "Observed wavelength",
              "explanation": "$\\lambda' = \\lambda + \\Delta \\lambda = 500 + 50 = 550$ nm (redshifted)"
            }
          ],
          "final_answer": "$550$ nm",
          "concept_applied": "Light from receding source is redshifted to longer wavelengths."
        }
      ],
      "image": {
        "src": "images/unit8/doppler_examples.png",
        "alt": "Illustrations of Doppler scenarios: ambulance passing, star moving away, radar gun",
        "caption": "The Doppler effect appears in many contexts: moving sound sources, astronomical redshift, and speed measurements."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with the Doppler effect.",
      "classifications": [
        {
          "type": "Sign Confusion in Formulas",
          "value": "Using the wrong sign in the denominator or numerator",
          "characteristics": [
            "Adding when should subtract, or vice versa",
            "Not remembering which sign corresponds to toward or away"
          ],
          "behavior": "For source motion: $f' = f \\frac{v}{v \\mp v_s}$: minus (−) when source toward observer (increases frequency), plus (+) when source away. For observer motion: $f' = f \\frac{v \\pm v_o}{v}$: plus (+) when observer toward source, minus (−) when away.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "For source approaching, student uses $f' = f v/(v+v_s)$ and gets lower frequency."
            },
            {
              "process": "Correct",
              "explanation": "Approaching source: $f' = f v/(v - v_s)$ gives higher frequency."
            }
          ]
        },
        {
          "type": "Using Sound Formulas for Light",
          "value": "Applying non‑relativistic Doppler formulas to light without adjustment",
          "characteristics": [
            "Using $f' = f (v \\pm v_o)/(v \\mp v_s)$ for light",
            "Not realizing that light has no medium and relativistic effects are needed"
          ],
          "behavior": "Light waves obey relativistic Doppler formulas because their speed is constant in all frames. For low speeds, the non‑relativistic approximation $\\Delta f/f \\approx v/c$ works, but the exact formula differs.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses sound Doppler formula for light from a star."
            },
            {
              "process": "Correct",
              "explanation": "Use $f' = f \\sqrt{\\frac{1 \\pm v/c}{1 \\mp v/c}}$ (relativistic) or the approximation $\\Delta \\lambda / \\lambda \\approx v/c$."
            }
          ]
        },
        {
          "type": "Forgetting That Frequency Changes, Not Speed",
          "value": "Thinking the Doppler effect changes the wave's speed",
          "characteristics": [
            "Believing sound moves faster when source approaches",
            "Not understanding that speed is medium‑dependent and constant"
          ],
          "behavior": "The Doppler effect changes the observed frequency and wavelength, but the wave speed in the medium remains constant (for sound) or constant $c$ (for light).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student thinks the siren's sound travels faster when the ambulance approaches."
            },
            {
              "process": "Correct",
              "explanation": "Sound speed is fixed by the medium; frequency changes due to motion."
            }
          ]
        },
        {
          "type": "Applying Doppler Effect Only to Sound",
          "value": "Not realizing it applies to all waves",
          "characteristics": [
            "Thinking only sound exhibits Doppler effect",
            "Not connecting to light, water waves, etc."
          ],
          "behavior": "The Doppler effect is a general wave phenomenon; it occurs for any wave when source or observer moves relative to the medium (for mechanical waves) or relative to each other (for light).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says Doppler effect doesn't apply to light."
            },
            {
              "process": "Correct",
              "explanation": "Light shows Doppler effect (redshift/blueshift) crucial in astronomy."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/doppler_mistakes.png",
        "alt": "Common mistakes: sign errors, using sound formulas for light, forgetting speed constancy",
        "caption": "Avoid these common errors when applying the Doppler effect."
      }
    }
  ],
  "key_terms": [
    "Doppler Effect",
    "Observed Frequency",
    "Emitted Frequency",
    "Relative Motion",
    "Moving Source",
    "Moving Observer",
    "Redshift",
    "Blueshift",
    "Siren",
    "Radar",
    "Doppler Ultrasound",
    "Wavefront"
  ],
  "summary": "The Doppler effect is the change in observed frequency of a wave due to relative motion between source and observer. For sound waves, the formulas depend on whether the source or observer moves: $f' = f \\frac{v}{v \\mp v_s}$ (source moving) and $f' = f \\frac{v \\pm v_o}{v}$ (observer moving). When both move, the general formula combines these. The effect causes higher frequency when approaching, lower when receding. For light, the relativistic Doppler formula gives redshift (receding) or blueshift (approaching). The Doppler effect has widespread applications: from police radar and medical ultrasound to measuring the expansion of the universe. Common mistakes include sign errors in formulas, applying sound formulas to light, and forgetting that wave speed remains constant. Understanding the Doppler effect is essential for interpreting many natural and technological phenomena."
}
