{
  "expanded_description": "This section examines what happens when waves encounter boundaries between different media. Reflection occurs when a wave bounces off a surface, changing direction but remaining in the original medium. Refraction occurs when a wave passes from one medium into another, changing speed and direction. These fundamental behaviors are observed in all types of waves—light, sound, water waves—and underlie many everyday phenomena from echoes and mirages to the operation of lenses and prisms.",
  "core_concept": {
    "principle": "When a wave encounters a boundary between two media, it may reflect (bounce back into the original medium) and/or refract (transmit into the new medium, changing speed and direction). The law of reflection states that the angle of incidence equals the angle of reflection. Refraction is described by Snell's law: $n_1 \\sin \\theta_1 = n_2 \\sin \\theta_2$, where $n$ is the index of refraction of the medium ($n = c/v$ for light).",
    "explanation": "Reflection and refraction are consequences of the change in wave speed at a boundary. The direction changes are determined by Fermat's principle of least time or by matching wavefronts at the interface. For light, the index of refraction quantifies how much the speed decreases in a material. When light moves from a lower index to a higher index (slower medium), it bends toward the normal; from higher to lower, it bends away. Total internal reflection occurs when light attempts to move from a higher index to a lower index at an angle exceeding the critical angle, resulting in 100% reflection. These principles are essential in optics, acoustics, and many technologies.",
    "image": {
      "src": "images/unit8/reflection_refraction.png",
      "alt": "Diagram showing a wave incident on a boundary, with reflected and refracted rays, angles labeled",
      "caption": "At a boundary between two media, a wave can reflect (bounce back) and refract (bend) as it enters the new medium."
    }
  },
  "sections": [
    {
      "section_title": "Reflection and Refraction",
      "introduction": "When a wave traveling through one medium encounters a different medium, part or all of the wave may bounce back into the original medium (reflection), and part may pass into the new medium (refraction), often changing direction. These behaviors are universal to all waves.",
      "key_concept": {
        "definition": "Reflection is the change in direction of a wave at an interface between two different media, so that the wave returns to the medium from which it originated. Refraction is the change in direction of a wave as it passes from one medium to another, caused by a change in its speed.",
        "context": "Understanding reflection and refraction is crucial for designing lenses, prisms, mirrors, and fiber optics, and for explaining natural phenomena like rainbows, mirages, and echoes."
      },
      "principles": [
        {
          "principle": "Law of Reflection",
          "statement": "The angle of incidence $\\theta_i$ equals the angle of reflection $\\theta_r$, measured from the normal (a line perpendicular to the surface). The incident ray, reflected ray, and normal all lie in the same plane.",
          "application": "This law applies to all waves—light, sound, water waves—and is used to design mirrors, periscopes, and to analyze echoes.",
          "example": "A light ray striking a mirror at 30° from the normal reflects at 30° from the normal on the other side."
        },
        {
          "principle": "Index of Refraction",
          "statement": "The index of refraction $n$ of a medium is defined as $n = c/v$, where $c$ is the speed of light in vacuum ($3.00 \\times 10^8$ m/s) and $v$ is the speed of light in the medium. For all transparent materials, $n \\ge 1$.",
          "application": "The index determines how much light bends when entering a medium. Higher index means slower light and more bending.",
          "example": "Water has $n \\approx 1.33$, so light travels in water at $v = c/1.33 \\approx 2.26 \\times 10^8$ m/s."
        },
        {
          "principle": "Snell's Law (Law of Refraction)",
          "statement": "When a wave passes from medium 1 with index $n_1$ to medium 2 with index $n_2$, the angles are related by $n_1 \\sin \\theta_1 = n_2 \\sin \\theta_2$, where $\\theta_1$ and $\\theta_2$ are measured from the normal.",
          "application": "Snell's law predicts the direction change. If $n_2 > n_1$ (entering slower medium), the ray bends toward the normal ($\\theta_2 < \\theta_1$). If $n_2 < n_1$ (entering faster medium), the ray bends away from the normal ($\\theta_2 > \\theta_1$).",
          "example": "Light entering water ($n=1.33$) from air ($n=1.00$) at $\\theta_1 = 45°$: $1.00 \\sin45° = 1.33 \\sin \\theta_2$, so $\\sin \\theta_2 = 0.7071/1.33 = 0.532$, $\\theta_2 = 32.1°$."
        },
        {
          "principle": "Total Internal Reflection",
          "statement": "When light travels from a medium with higher index to one with lower index ($n_1 > n_2$), if the angle of incidence exceeds the critical angle $\\theta_c$, where $\\sin \\theta_c = n_2/n_1$, the light undergoes total internal reflection—no light enters the second medium.",
          "application": "This principle is used in fiber optics to guide light along fibers with minimal loss, and in prisms for binoculars and periscopes.",
          "example": "For water ($n=1.33$) to air ($n=1.00$), $\\theta_c = \\sin^{-1}(1/1.33) = \\sin^{-1}(0.752) = 48.8°$. At angles greater than 48.8°, light reflects entirely back into the water."
        }
      ],
      "classifications": [
        {
          "type": "Types of Reflection",
          "value": "Specular vs. Diffuse Reflection",
          "characteristics": [
            "Specular reflection: occurs on smooth surfaces (mirrors, calm water); parallel rays reflect in the same direction, producing clear images",
            "Diffuse reflection: occurs on rough surfaces (paper, walls); parallel rays reflect in many directions, producing no image"
          ],
          "behavior": "Most surfaces are rough on a microscopic scale, causing diffuse reflection. This is why we can see objects from any angle—light scatters in all directions.",
          "examples": [
            {
              "process": "Specular reflection",
              "explanation": "A mirror reflects light such that the angle of incidence equals the angle of reflection, preserving image clarity."
            },
            {
              "process": "Diffuse reflection",
              "explanation": "A piece of paper reflects light in all directions, allowing us to read it from any angle."
            }
          ]
        },
        {
          "type": "Refraction and Dispersion",
          "value": "Separation of colors",
          "characteristics": [
            "The index of refraction varies slightly with wavelength (color) in most materials",
            "This variation causes different colors to bend by different amounts",
            "Dispersion is the separation of white light into its component colors"
          ],
          "behavior": "Shorter wavelengths (violet) generally bend more than longer wavelengths (red) in transparent materials, creating a spectrum.",
          "examples": [
            {
              "process": "Rainbow",
              "explanation": "Sunlight refracts and reflects inside water droplets, with different colors bending at different angles, creating a circular spectrum."
            },
            {
              "process": "Prism",
              "explanation": "White light passing through a prism disperses into a rainbow of colors due to wavelength‑dependent refraction."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Angle of Refraction",
          "problem": "Light travels from air ($n=1.00$) into glass ($n=1.50$) at an angle of incidence of 30°. What is the angle of refraction?",
          "step_by_step": [
            {
              "step": "Apply Snell's law",
              "explanation": "$n_1 \\sin \\theta_1 = n_2 \\sin \\theta_2$ → $1.00 \\sin30° = 1.50 \\sin \\theta_2$"
            },
            {
              "step": "Calculate $\\sin \\theta_2$",
              "explanation": "$\\sin30° = 0.5$, so $0.5 = 1.50 \\sin \\theta_2$ → $\\sin \\theta_2 = 0.5/1.50 = 0.3333$"
            },
            {
              "step": "Find $\\theta_2$",
              "explanation": "$\\theta_2 = \\sin^{-1}(0.3333) = 19.5°$"
            }
          ],
          "final_answer": "$19.5°$ (bent toward the normal)",
          "concept_applied": "Snell's law gives the angle in the second medium."
        },
        {
          "title": "Finding Index of Refraction",
          "problem": "Light traveling through an unknown liquid enters air ($n=1.00$) at an angle of incidence of 25° and refracts at an angle of 38°. What is the index of refraction of the liquid?",
          "step_by_step": [
            {
              "step": "Apply Snell's law",
              "explanation": "$n_{\\text{liquid}} \\sin25° = n_{\\text{air}} \\sin38° = 1.00 \\sin38°$"
            },
            {
              "step": "Calculate $\\sin$ values",
              "explanation": "$\\sin25° = 0.4226$, $\\sin38° = 0.6157$"
            },
            {
              "step": "Solve for $n_{\\text{liquid}}$",
              "explanation": "$n_{\\text{liquid}} \\times 0.4226 = 0.6157$ → $n_{\\text{liquid}} = 0.6157/0.4226 = 1.457$"
            }
          ],
          "final_answer": "$1.46$",
          "concept_applied": "Snell's law can be used to determine the index of an unknown material."
        },
        {
          "title": "Critical Angle for Total Internal Reflection",
          "problem": "What is the critical angle for light traveling from glass ($n=1.52$) into water ($n=1.33$)?",
          "step_by_step": [
            {
              "step": "Recall critical angle formula",
              "explanation": "$\\sin \\theta_c = n_2/n_1$, where $n_1 > n_2$"
            },
            {
              "step": "Substitute values",
              "explanation": "$\\sin \\theta_c = 1.33 / 1.52 = 0.875$"
            },
            {
              "step": "Find $\\theta_c$",
              "explanation": "$\\theta_c = \\sin^{-1}(0.875) = 61.0°$"
            }
          ],
          "final_answer": "$61.0°$",
          "concept_applied": "At angles greater than the critical angle, total internal reflection occurs."
        },
        {
          "title": "Apparent Depth",
          "problem": "A coin is at the bottom of a swimming pool 2.0 m deep. When viewed from above, how deep does the coin appear to be? (Assume $n_{\\text{water}} = 1.33$, $n_{\\text{air}} = 1.00$.)",
          "step_by_step": [
            {
              "step": "Recall apparent depth formula",
              "explanation": "For near‑normal viewing, $\\text{apparent depth} = \\frac{\\text{actual depth}}{n_{\\text{water}}/n_{\\text{air}}}$ = $\\frac{\\text{actual depth}}{n_{\\text{water}}}$ when $n_{\\text{air}} \\approx 1$"
            },
            {
              "step": "Calculate",
              "explanation": "$\\text{apparent depth} = 2.0 / 1.33 = 1.50$ m"
            }
          ],
          "final_answer": "$1.50$ m",
          "concept_applied": "Refraction makes objects in water appear shallower than they actually are."
        },
        {
          "title": "Fiber Optics and Total Internal Reflection",
          "problem": "An optical fiber has a core with $n=1.48$ and a cladding with $n=1.45$. What is the critical angle for total internal reflection at the core‑cladding interface?",
          "step_by_step": [
            {
              "step": "Identify which index is larger",
              "explanation": "Light travels in the core (higher index) and reflects at the boundary with the cladding (lower index)."
            },
            {
              "step": "Apply critical angle formula",
              "explanation": "$\\sin \\theta_c = n_{\\text{cladding}} / n_{\\text{core}} = 1.45 / 1.48 = 0.9797$"
            },
            {
              "step": "Find $\\theta_c$",
              "explanation": "$\\theta_c = \\sin^{-1}(0.9797) = 78.3°$"
            }
          ],
          "final_answer": "$78.3°$",
          "concept_applied": "In fiber optics, light is kept within the core by total internal reflection when the angle of incidence exceeds the critical angle."
        }
      ],
      "image": {
        "src": "images/unit8/snell_law_diagram.png",
        "alt": "Diagram showing Snell's law: ray bending toward normal when entering higher index medium, away when entering lower index",
        "caption": "Snell's law describes refraction: $n_1 \\sin \\theta_1 = n_2 \\sin \\theta_2$."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with reflection and refraction.",
      "classifications": [
        {
          "type": "Measuring Angles from the Surface",
          "value": "Using the angle from the surface instead of from the normal",
          "characteristics": [
            "Measuring incidence angle as 30° from the horizontal surface",
            "Forgetting that angles in optics are always measured from the normal"
          ],
          "behavior": "In reflection and refraction, all angles are measured from the normal (perpendicular) to the surface. Always convert if given an angle from the surface.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "A light ray strikes a mirror at 30° to the surface; student uses 30° as incidence angle (should be 60° from normal)."
            },
            {
              "process": "Correct",
              "explanation": "Angle to surface = 30°, so angle from normal = 90° - 30° = 60°."
            }
          ]
        },
        {
          "type": "Confusing Which Way Light Bends",
          "value": "Getting the direction of bending wrong in refraction",
          "characteristics": [
            "Thinking light always bends toward the normal",
            "Not checking relative indices"
          ],
          "behavior": "Light bends toward the normal when entering a medium with higher index (slower speed). It bends away from the normal when entering a medium with lower index (faster speed).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says light entering water from air bends away from the normal."
            },
            {
              "process": "Correct",
              "explanation": "Water has higher index, so light bends toward the normal."
            }
          ]
        },
        {
          "type": "Misapplying Total Internal Reflection",
          "value": "Applying total internal reflection when light goes from lower to higher index",
          "characteristics": [
            "Using $\\sin \\theta_c = n_2/n_1$ with $n_1 < n_2$",
            "Expecting total internal reflection from air to water"
          ],
          "behavior": "Total internal reflection can only occur when light travels from a higher index to a lower index ($n_1 > n_2$). Otherwise, the critical angle formula gives a value >1 (impossible).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student tries to find critical angle for light from air to glass."
            },
            {
              "process": "Correct",
              "explanation": "TIR only possible for glass to air, not air to glass."
            }
          ]
        },
        {
          "type": "Forgetting That Frequency Remains Constant",
          "value": "Thinking that the color (frequency) changes when light refracts",
          "characteristics": [
            "Assuming light changes color when entering water",
            "Not understanding that wavelength changes, not frequency"
          ],
          "behavior": "When light refracts, its frequency (color) remains constant; only speed and wavelength change according to $v = f\\lambda$ and $n = c/v$.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says red light turns blue when entering water."
            },
            {
              "process": "Correct",
              "explanation": "Red light stays red; its wavelength in water is shorter than in air."
            }
          ]
        },
        {
          "type": "Unit Errors in Snell's Law",
          "value": "Using degrees in calculator when it should be in degree mode, or using radians incorrectly",
          "characteristics": [
            "Calculator set to radians when using degrees",
            "Getting strange values for sine"
          ],
          "behavior": "Always ensure calculator is in the correct mode (DEG) when working with angles in degrees.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student calculates $\\sin30°$ with calculator in radian mode, getting 0.5? Actually sin(30 rad) is not 0.5, so they'd get a wrong value."
            },
            {
              "process": "Correct",
              "explanation": "Check calculator mode; use degrees for problems stated in degrees."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/reflection_refraction_mistakes.png",
        "alt": "Common mistakes: measuring angles from surface, wrong bending direction, TIR misapplication",
        "caption": "Avoid these common errors when analyzing reflection and refraction."
      }
    }
  ],
  "key_terms": [
    "Reflection",
    "Refraction",
    "Law of Reflection",
    "Angle of Incidence",
    "Angle of Reflection",
    "Normal",
    "Index of Refraction",
    "$n = c/v$",
    "Snell's Law",
    "$n_1 \\sin \\theta_1 = n_2 \\sin \\theta_2$",
    "Total Internal Reflection",
    "Critical Angle",
    "Specular Reflection",
    "Diffuse Reflection",
    "Dispersion"
  ],
  "summary": "When waves encounter a boundary between two media, they can reflect (bounce back) and refract (bend as they enter the new medium). The law of reflection states that the angle of incidence equals the angle of reflection, measured from the normal. Reflection can be specular (smooth surfaces, clear images) or diffuse (rough surfaces, scattered light). Refraction is governed by Snell's law: $n_1 \\sin \\theta_1 = n_2 \\sin \\theta_2$, where $n = c/v$ is the index of refraction. Light bends toward the normal when entering a higher‑index (slower) medium and away from the normal when entering a lower‑index (faster) medium. Total internal reflection occurs when light traveling from a higher index to a lower index strikes the boundary at an angle greater than the critical angle $\\theta_c = \\sin^{-1}(n_2/n_1)$, reflecting 100% back into the higher index medium. This principle underlies fiber optics. Common mistakes include measuring angles from the surface instead of the normal, confusing the direction of bending, misapplying total internal reflection to the wrong direction, and forgetting that frequency remains constant during refraction."
}
