{
  "expanded_description": "This section provides an in-depth exploration of sound as a physical phenomenon. Sound is a longitudinal mechanical wave that propagates through solids, liquids, and gases via compressions and rarefactions. We examine the nature of sound waves, the factors that determine their speed, the relationship between physical wave properties and human perception (pitch and loudness), and the quantitative measure of sound intensity using the decibel scale. Understanding sound is essential in fields ranging from music and architecture to medicine (ultrasound) and engineering (noise control).",
  "core_concept": {
    "principle": "Sound is a longitudinal mechanical wave that requires a material medium for propagation. It is characterized by frequency (determining pitch), amplitude (determining loudness), and speed (which depends on the medium's properties and temperature).",
    "explanation": "Sound waves are generated by vibrating sources, which create alternating regions of compression (high pressure) and rarefaction (low pressure) that travel through the medium. Unlike electromagnetic waves, sound cannot travel through a vacuum. The speed of sound varies significantly with the medium—fastest in solids, slower in liquids, and slowest in gases—and in air, it increases with temperature. The human ear detects frequencies roughly between 20 Hz and 20,000 Hz, with infrasound and ultrasound lying outside this range. The perceived loudness is related to the wave's amplitude, but the human ear responds logarithmically, leading to the decibel scale for sound intensity level.",
    "image": {
      "src": "images/unit8/sound_wave_diagram.png",
      "alt": "Diagram of a longitudinal sound wave showing compressions and rarefactions, with a vibrating tuning fork as the source",
      "caption": "Sound consists of compressions (high pressure) and rarefactions (low pressure) traveling through a medium."
    }
  },
  "sections": [
    {
      "section_title": "Nature of Sound",
      "introduction": "Sound is all around us, from the music we hear to the speech we exchange. Physically, it is a wave—a disturbance that transfers energy through a medium without permanently displacing the medium itself.",
      "key_concept": {
        "definition": "Sound is a longitudinal mechanical wave consisting of compressions (regions where particles are crowded together) and rarefactions (regions where particles are spread apart) propagating through a material medium (solid, liquid, or gas).",
        "context": "Understanding sound as a wave helps explain phenomena like echoes (reflection), the bending of sound around obstacles (diffraction), and the variation in pitch when a source moves (Doppler effect)."
      },
      "classifications": [
        {
          "type": "Sound as a Mechanical Wave",
          "value": "Requires a material medium",
          "characteristics": [
            "Cannot travel through vacuum",
            "Speed depends on medium's density and elasticity",
            "Exhibits all wave behaviors: reflection, refraction, interference, diffraction"
          ],
          "behavior": "The wave energy is transmitted through particle interactions. In a gas, molecules collide and transfer energy; in solids, both longitudinal and transverse sound waves can exist (e.g., P‑waves and S‑waves in earthquakes).",
          "examples": [
            {
              "process": "Sound in air",
              "explanation": "Air molecules oscillate back and forth along the direction of wave travel, creating compressions and rarefactions."
            },
            {
              "process": "Sound in water",
              "explanation": "Sound travels about four times faster in water than in air because water is less compressible and denser."
            },
            {
              "process": "Sound in steel",
              "explanation": "In solids, sound can travel as both longitudinal and transverse waves; speed is even higher due to strong elastic forces."
            }
          ]
        },
        {
          "type": "Audible Range",
          "value": "Frequencies detectable by human hearing",
          "characteristics": [
            "Approximately 20 Hz to 20,000 Hz (20 kHz)",
            "Range varies with age and individual",
            "Infrasound: below 20 Hz (elephants, earthquakes)",
            "Ultrasound: above 20 kHz (medical imaging, dog whistles)"
          ],
          "behavior": "The ear is most sensitive to frequencies between 1 kHz and 4 kHz, roughly the range of human speech. Infrasound can be felt as vibrations rather than heard; ultrasound is used in echolocation and medical diagnostics.",
          "examples": [
            {
              "process": "Infrasound",
              "explanation": "Whales communicate using infrasound that can travel hundreds of kilometers through the ocean."
            },
            {
              "process": "Ultrasound",
              "explanation": "Medical ultrasound uses frequencies of 1–10 MHz to create images of internal organs."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Sound Requires a Medium",
          "statement": "Sound waves are mechanical, meaning they require a material medium to propagate. They cannot travel through a vacuum.",
          "application": "This explains why there is no sound in outer space; astronauts must use radios to communicate.",
          "example": "A ringing bell placed inside a jar gradually becomes quieter as air is pumped out, demonstrating that sound needs air to travel."
        },
        {
          "principle": "Sound is Longitudinal",
          "statement": "In a sound wave, particles of the medium oscillate parallel to the direction of wave propagation. This creates compressions (high pressure) and rarefactions (low pressure).",
          "application": "The longitudinal nature distinguishes sound from transverse waves like light or waves on a string.",
          "example": "A slinky pushed and pulled at one end produces a longitudinal wave that models sound propagation."
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Sound Wave Characteristics",
          "problem": "A sound wave in air has a frequency of 440 Hz and travels at 343 m/s. (a) Is this wave longitudinal or transverse? (b) Calculate its wavelength. (c) If the wave enters water where its speed is 1480 m/s, what happens to its frequency and wavelength?",
          "step_by_step": [
            {
              "step": "Determine wave type",
              "explanation": "Sound is always longitudinal in gases and liquids; in solids it can be both, but here it's in air, so longitudinal."
            },
            {
              "step": "Calculate wavelength in air",
              "explanation": "$\\lambda = v/f = 343 / 440 = 0.780$ m"
            },
            {
              "step": "Effect of changing medium",
              "explanation": "Frequency is determined by the source and remains constant at 440 Hz. Wavelength changes to $\\lambda = v_{\\text{water}}/f = 1480/440 = 3.36$ m."
            }
          ],
          "final_answer": "(a) longitudinal; (b) $0.780$ m; (c) frequency unchanged at 440 Hz, wavelength becomes $3.36$ m.",
          "concept_applied": "Sound type, wave equation, and behavior across media."
        }
      ]
    },
    {
      "section_title": "Speed of Sound",
      "introduction": "The speed of sound is not constant; it depends on the properties of the medium through which it travels. In general, sound travels fastest in solids, slower in liquids, and slowest in gases. In air, temperature also affects the speed.",
      "key_concept": {
        "definition": "The speed of sound $v$ in a medium is determined by its elastic properties and density. For gases, $v = \\sqrt{\\frac{\\gamma P}{\\rho}}$, where $\\gamma$ is the adiabatic index, $P$ is pressure, and $\\rho$ is density. For air near room temperature, an approximate formula is $v \\approx 331 + 0.6T$ m/s, where $T$ is temperature in degrees Celsius.",
        "context": "Knowing the speed of sound is essential for echolocation, musical instrument design, and understanding phenomena like sonic booms. It also explains why we see lightning before hearing thunder."
      },
      "principles": [
        {
          "principle": "Dependence on Medium",
          "statement": "Sound travels fastest in solids, slower in liquids, and slowest in gases because solids have greater elasticity, allowing disturbances to transfer more quickly between particles.",
          "application": "This is why you can hear a train approaching by putting your ear to the rail – sound travels much faster through steel than through air.",
          "example": "Speed of sound in air: ≈ 343 m/s (at 20°C); in water: ≈ 1,480 m/s; in steel: ≈ 5,000 m/s."
        },
        {
          "principle": "Temperature Dependence in Air",
          "statement": "In air, the speed of sound increases with temperature. The linear approximation $v = 331 + 0.6T$ (with $T$ in °C) is accurate over typical environmental ranges.",
          "application": "This affects musical instrument tuning (wind instruments change pitch with temperature) and the time delay for echoes.",
          "example": "At 0°C, $v = 331$ m/s; at 20°C, $v = 331 + 12 = 343$ m/s; at 30°C, $v = 331 + 18 = 349$ m/s."
        }
      ],
      "classifications": [
        {
          "type": "Typical Sound Speeds",
          "value": "Approximate values in common media",
          "characteristics": [
            "Air (20°C): 343 m/s",
            "Water (fresh, 20°C): 1480 m/s",
            "Seawater: ≈ 1530 m/s",
            "Steel: ≈ 5000 m/s",
            "Glass: ≈ 4500 m/s",
            "Wood: varies (3000–4000 m/s)"
          ],
          "behavior": "Speed is higher in denser and more elastic media. Note that despite being denser than air, water has a higher speed because it is much less compressible.",
          "examples": [
            {
              "process": "Sound in helium",
              "explanation": "Helium is less dense than air, but its speed of sound is about three times higher (≈ 1000 m/s) because of its lower molar mass. This is why inhaling helium raises the pitch of your voice – the resonant frequencies of your vocal tract increase."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Speed of Sound at Different Temperatures",
          "problem": "Calculate the speed of sound in air at 35°C and at -15°C.",
          "step_by_step": [
            {
              "step": "Use $v = 331 + 0.6T$",
              "explanation": "At 35°C: $v = 331 + 0.6(35) = 331 + 21 = 352$ m/s"
            },
            {
              "step": "At -15°C",
              "explanation": "$v = 331 + 0.6(-15) = 331 - 9 = 322$ m/s"
            }
          ],
          "final_answer": "$352$ m/s at 35°C, $322$ m/s at -15°C",
          "concept_applied": "Sound speed increases with temperature."
        },
        {
          "title": "Distance from Lightning",
          "problem": "You see a lightning flash and hear the thunder 3.8 seconds later. If the air temperature is 28°C, how far away did the lightning strike?",
          "step_by_step": [
            {
              "step": "Find the speed of sound at 28°C",
              "explanation": "$v = 331 + 0.6(28) = 331 + 16.8 = 347.8$ m/s"
            },
            {
              "step": "Calculate distance",
              "explanation": "$d = v \\times t = 347.8 \\times 3.8 = 1321.6$ m ≈ 1.32 km"
            }
          ],
          "final_answer": "$1.32$ km",
          "concept_applied": "Distance = speed × time; speed depends on temperature."
        }
      ]
    },
    {
      "section_title": "Perception of Sound: Pitch and Loudness",
      "introduction": "The physical properties of sound waves directly relate to how we perceive them. The frequency of a sound wave determines its pitch (how high or low it sounds), while the amplitude determines its loudness. These two attributes are independent: a high‑pitched sound can be soft, and a low‑pitched sound can be loud.",
      "key_concept": {
        "definition": "Pitch is the perceptual correlate of frequency: higher frequency corresponds to higher pitch. Loudness is the perceptual correlate of amplitude (or intensity): larger amplitude corresponds to louder sound. However, the ear's response is not linear; loudness perception is approximately logarithmic.",
        "context": "Understanding this relationship is crucial in music (tuning instruments), audio engineering (equalization), and hearing science. It also explains why a small amplitude change can be noticeable at low volumes but negligible at high volumes."
      },
      "classifications": [
        {
          "type": "Pitch (Frequency)",
          "value": "How high or low a sound seems",
          "characteristics": [
            "Determined by frequency $f$ (Hz)",
            "Higher frequency = higher pitch",
            "Lower frequency = lower pitch",
            "Musical notes correspond to specific frequencies (e.g., A above middle C = 440 Hz)"
          ],
          "behavior": "The human ear can distinguish pitch differences as small as a few hertz at low frequencies, but the just‑noticeable difference increases at higher frequencies. The musical scale is logarithmic: each octave doubles the frequency.",
          "examples": [
            {
              "process": "Middle C",
              "explanation": "Middle C on a piano is approximately 262 Hz. The C one octave higher is 524 Hz."
            },
            {
              "process": "Frequency and wavelength",
              "explanation": "For a given speed, higher frequency means shorter wavelength. A 1000 Hz tone in air has $\\lambda = 343/1000 = 0.343$ m."
            }
          ]
        },
        {
          "type": "Loudness (Amplitude)",
          "value": "How strong a sound seems",
          "characteristics": [
            "Related to pressure amplitude $\\Delta P$ (Pa)",
            "Larger amplitude = louder sound",
            "Energy transported is proportional to amplitude squared: $I \\propto A^2$",
            "Perceived loudness doubles roughly every 10‑fold increase in intensity (about 10 dB increase)"
          ],
          "behavior": "The ear's sensitivity varies with frequency; we are most sensitive to frequencies around 2‑4 kHz. The same physical amplitude produces different perceived loudness at different frequencies.",
          "examples": [
            {
              "process": "Whisper",
              "explanation": "A whisper has a pressure amplitude of about $2 \\times 10^{-5}$ Pa (the threshold of hearing)."
            },
            {
              "process": "Normal conversation",
              "explanation": "Typical conversation has a pressure amplitude about $2 \\times 10^{-3}$ Pa (100 times greater than threshold)."
            },
            {
              "process": "Rock concert",
              "explanation": "Rock concerts can reach pressure amplitudes around 20 Pa (one million times threshold), which can cause hearing damage."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Intensity and Amplitude",
          "statement": "The intensity $I$ of a sound wave (power per unit area) is proportional to the square of the amplitude: $I \\propto A^2$. Doubling the amplitude quadruples the intensity.",
          "application": "This explains why a small increase in amplitude can dramatically increase the energy carried by the wave.",
          "example": "A sound wave with twice the pressure amplitude carries four times the energy and is perceived as significantly louder (though not four times louder due to logarithmic perception)."
        }
      ],
      "worked_examples": [
        {
          "title": "Relating Pitch and Wavelength",
          "problem": "A tuning fork produces a sound wave in air with a frequency of 512 Hz. (a) What is the wavelength? (b) What would be the wavelength of a 256 Hz sound wave in the same conditions? (Assume $v=343$ m/s.)",
          "step_by_step": [
            {
              "step": "Wavelength for 512 Hz",
              "explanation": "$\\lambda = v/f = 343/512 = 0.670$ m"
            },
            {
              "step": "Wavelength for 256 Hz",
              "explanation": "$\\lambda = 343/256 = 1.34$ m"
            }
          ],
          "final_answer": "(a) $0.670$ m, (b) $1.34$ m",
          "concept_applied": "Lower frequency corresponds to longer wavelength."
        },
        {
          "title": "Comparing Amplitudes and Loudness",
          "problem": "Sound wave A has a pressure amplitude of 0.02 Pa. Sound wave B has a pressure amplitude of 0.08 Pa. How many times greater is the intensity of B compared to A?",
          "step_by_step": [
            {
              "step": "Recall $I \\propto A^2$",
              "explanation": "The ratio of intensities is $(A_B/A_A)^2 = (0.08/0.02)^2 = (4)^2 = 16$."
            }
          ],
          "final_answer": "Wave B has 16 times the intensity of wave A.",
          "concept_applied": "Intensity is proportional to the square of amplitude."
        }
      ]
    },
    {
      "section_title": "Sound Intensity and the Decibel Scale",
      "introduction": "Because the range of sound intensities the human ear can detect is enormous (from the faintest whisper to a jet engine), a logarithmic scale is used to quantify sound level. The decibel (dB) scale compares the intensity of a sound to a reference intensity, typically the threshold of hearing.",
      "key_concept": {
        "definition": "The sound intensity level $\\beta$ in decibels is defined as $\\beta = 10 \\log_{10}\\left(\\frac{I}{I_0}\\right)$, where $I$ is the sound intensity (W/m²) and $I_0 = 10^{-12}$ W/m² is the reference intensity (threshold of hearing at 1 kHz).",
        "context": "The decibel scale compresses the vast range of audible intensities (a factor of $10^{12}$) into a manageable 0–120 dB scale. A 10 dB increase corresponds to a tenfold increase in intensity, and a 20 dB increase corresponds to a hundredfold increase. The threshold of pain is around 120 dB."
      },
      "principles": [
        {
          "principle": "Logarithmic Nature",
          "statement": "Because perception is approximately logarithmic, the decibel scale aligns with how we perceive loudness. Each 10 dB increase is perceived as roughly twice as loud (though this is a rough rule).",
          "application": "This is used in audio engineering to set volume levels and in hearing tests to measure hearing loss.",
          "example": "A 60 dB conversation is 10 times more intense than a 50 dB quiet room, and 100 times more intense than a 40 dB library."
        }
      ],
      "classifications": [
        {
          "type": "Typical Sound Levels",
          "value": "Approximate dB levels for common sounds",
          "characteristics": [
            "Threshold of hearing: 0 dB",
            "Rustling leaves: 10 dB",
            "Whisper (1 m): 20 dB",
            "Quiet room: 30–40 dB",
            "Normal conversation (1 m): 60 dB",
            "Busy street traffic: 70 dB",
            "Vacuum cleaner: 80 dB",
            "Lawn mower: 90 dB",
            "Rock concert: 110–120 dB",
            "Threshold of pain: 120 dB",
            "Jet engine at 30 m: 140 dB"
          ],
          "behavior": "Exposure to sounds above 85 dB for prolonged periods can cause hearing damage. Instantaneous damage can occur above 120 dB.",
          "examples": [
            {
              "process": "Hearing damage risk",
              "explanation": "Listening to music at 100 dB through headphones for more than 15 minutes can cause permanent hearing loss."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Decibel Level",
          "problem": "A sound wave has an intensity of $10^{-5}$ W/m². What is its sound level in dB?",
          "step_by_step": [
            {
              "step": "Use $\\beta = 10 \\log_{10}(I/I_0)$",
              "explanation": "$I_0 = 10^{-12}$ W/m², $I = 10^{-5}$ W/m², so $I/I_0 = 10^{7}$."
            },
            {
              "step": "Calculate log",
              "explanation": "$\\log_{10}(10^7) = 7$, so $\\beta = 10 \\times 7 = 70$ dB."
            }
          ],
          "final_answer": "$70$ dB",
          "concept_applied": "Direct application of the decibel formula."
        },
        {
          "title": "Intensity Ratio from dB Change",
          "problem": "A sound increases from 60 dB to 80 dB. By what factor does its intensity increase?",
          "step_by_step": [
            {
              "step": "Recall that 10 dB corresponds to a factor of 10 in intensity",
              "explanation": "A 20 dB increase is two increments of 10 dB, so the intensity multiplies by $10 \\times 10 = 100$."
            },
            {
              "step": "Alternatively use formula",
              "explanation": "$\\beta_2 - \\beta_1 = 10 \\log_{10}(I_2/I_1) = 20$ → $\\log_{10}(I_2/I_1) = 2$ → $I_2/I_1 = 10^2 = 100$."
            }
          ],
          "final_answer": "The intensity increases by a factor of 100.",
          "concept_applied": "Decibel difference corresponds to logarithmic intensity ratio."
        }
      ]
    }
  ],
  "key_terms": [
    "Sound",
    "Longitudinal wave",
    "Mechanical wave",
    "Compression",
    "Rarefaction",
    "Frequency",
    "Pitch",
    "Amplitude",
    "Loudness",
    "Speed of sound",
    "Temperature dependence",
    "Infrasound",
    "Ultrasound",
    "Audible range",
    "Intensity",
    "Decibel",
    "$\\beta = 10 \\log_{10}(I/I_0)$",
    "Threshold of hearing"
  ],
  "summary": "Sound is a longitudinal mechanical wave consisting of compressions and rarefactions. It requires a medium; its speed depends on the medium's properties and, in gases, on temperature (in air, $v \\approx 331 + 0.6T$ m/s). Frequency determines pitch, with human hearing ranging from about 20 Hz to 20 kHz. Amplitude determines loudness, and intensity (power per unit area) is proportional to amplitude squared. Because of the vast range of intensities, sound level is measured on a logarithmic decibel scale: $\\beta = 10 \\log_{10}(I/I_0)$, where $I_0 = 10^{-12}$ W/m² is the threshold of hearing. Common sounds range from 0 dB (threshold) to 120 dB (threshold of pain). Understanding these properties is essential in acoustics, music, medicine, and engineering."
}
