{
  "expanded_description": "This section introduces sound as a physical phenomenon – a longitudinal mechanical wave that propagates through a medium (solid, liquid, or gas) via compressions and rarefactions. Sound waves are produced by vibrating sources and are detected by ears or microphones. Understanding sound involves exploring its nature as a wave, its speed in different media, and its perceptual characteristics such as pitch (frequency) and loudness (amplitude).",
  "core_concept": {
    "principle": "Sound is a longitudinal mechanical wave that requires a material medium to propagate. It consists of alternating compressions (regions of high pressure and density) and rarefactions (regions of low pressure and density) traveling through the medium. The frequency of the wave determines the pitch, while the amplitude determines the loudness. Sound cannot travel through a vacuum.",
    "explanation": "Sound waves are generated by vibrating objects, such as vocal cords, loudspeakers, or musical instruments. These vibrations cause the surrounding particles to oscillate, transferring energy through the medium. In air, sound travels at approximately 343 m/s at room temperature, but its speed depends on the medium's properties (density and elasticity) and temperature. The human ear can detect frequencies roughly between 20 Hz and 20,000 Hz, with ultrasound and infrasound lying outside this range.",
    "image": {
      "src": "images/unit8/sound_intro.png",
      "alt": "Diagram of a sound wave showing compressions and rarefactions, with a vibrating tuning fork as the source",
      "caption": "Sound is a longitudinal wave consisting of compressions and rarefactions traveling through a medium."
    }
  },
  "sections": [
    {
      "section_title": "What is Sound?",
      "introduction": "Sound is all around us, from the music we enjoy to the conversations we share. But what is sound physically? It is not a thing that travels, but rather a disturbance – a wave – that propagates through a material.",
      "key_concept": {
        "definition": "Sound is a longitudinal mechanical wave that propagates through a medium (solid, liquid, or gas) by the transfer of energy via compressions (regions of high pressure) and rarefactions (regions of low pressure). It is produced by vibrating sources and detected by ears or instruments.",
        "context": "Understanding sound is essential in fields ranging from music and architecture to medicine (ultrasound) and engineering (noise control, sonar). As a wave, sound exhibits all the wave properties we have studied: reflection (echo), refraction, interference, and diffraction."
      },
      "principles": [
        {
          "principle": "Sound Requires a Medium",
          "statement": "Sound waves are mechanical, meaning they require a material medium to propagate. They cannot travel through a vacuum because there are no particles to transmit the vibrations.",
          "application": "This explains why there is no sound in outer space – astronauts must use radios to communicate.",
          "example": "A ringing bell inside a vacuum jar becomes inaudible as the air is pumped out, demonstrating that sound needs a medium."
        },
        {
          "principle": "Sound as a Longitudinal Wave",
          "statement": "In a sound wave, particles of the medium oscillate parallel to the direction of wave propagation. This creates alternating regions of compression (particles crowded together) and rarefaction (particles spread apart).",
          "application": "The longitudinal nature distinguishes sound from transverse waves like light or waves on a string.",
          "example": "A slinky pushed and pulled at one end produces a longitudinal wave, modeling sound propagation."
        },
        {
          "principle": "Pitch and Frequency",
          "statement": "The pitch of a sound is determined by its frequency. Higher frequency produces higher pitch; lower frequency produces lower pitch. Frequency is measured in hertz (Hz).",
          "application": "Musical notes correspond to specific frequencies. For example, middle C is approximately 262 Hz.",
          "example": "A flute produces high‑frequency (high‑pitched) sounds; a bass drum produces low‑frequency (low‑pitched) sounds."
        },
        {
          "principle": "Loudness and Amplitude",
          "statement": "The loudness of a sound is related to the amplitude of the pressure variations. Larger amplitude means louder sound. Loudness is perceived logarithmically (decibels), but the physical amplitude is a linear measure.",
          "application": "Increasing the amplitude of a sound wave requires more energy; doubling the amplitude quadruples the energy.",
          "example": "A whispered sound has small amplitude; a shouted sound has large amplitude."
        }
      ],
      "classifications": [
        {
          "type": "Audible Range",
          "value": "Frequencies detectable by human hearing",
          "characteristics": [
            "Approximately 20 Hz to 20,000 Hz (20 kHz)",
            "Range varies with age and individual",
            "Lower frequencies are felt as much as heard"
          ],
          "behavior": "Sounds below 20 Hz are called infrasound (elephants communicate with infrasound). Sounds above 20 kHz are called ultrasound (used in medical imaging and dog whistles).",
          "examples": [
            {
              "process": "Infrasound",
              "explanation": "Earthquakes produce infrasound waves that travel long distances."
            },
            {
              "process": "Audible sound",
              "explanation": "Human speech ranges from about 100 Hz to 4,000 Hz."
            },
            {
              "process": "Ultrasound",
              "explanation": "Medical ultrasound uses frequencies around 1–10 MHz to image internal organs."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Sound Wave Properties",
          "problem": "A sound wave in air has a frequency of 440 Hz and an amplitude of 0.02 Pa (pressure variation). (a) What is the period of the wave? (b) If the speed of sound is 343 m/s, what is the wavelength?",
          "step_by_step": [
            {
              "step": "Find the period",
              "explanation": "$T = 1/f = 1/440 = 0.00227$ s = 2.27 ms"
            },
            {
              "step": "Find the wavelength",
              "explanation": "$\\lambda = v/f = 343 / 440 = 0.780$ m"
            }
          ],
          "final_answer": "(a) $2.27$ ms, (b) $0.780$ m",
          "concept_applied": "Sound waves follow the same wave equation $v = f\\lambda$ as all waves."
        }
      ]
    },
    {
      "section_title": "Speed of Sound",
      "introduction": "The speed of sound is not constant; it depends on the properties of the medium through which it travels. In general, sound travels faster in solids than in liquids, and faster in liquids than in gases. It also increases with temperature in gases.",
      "key_concept": {
        "definition": "The speed of sound $v$ in a medium depends on the medium's elasticity and density. For gases, $v = \\sqrt{\\frac{\\gamma kT}{m}}$, but a simpler approximation for air is $v \\approx 331 + 0.6T$ m/s, where $T$ is the temperature in degrees Celsius.",
        "context": "Knowing the speed of sound is essential for locating thunderstorms (time between lightning and thunder), echolocation (sonar), and understanding the behavior of sound in different environments."
      },
      "principles": [
        {
          "principle": "Speed in Different Media",
          "statement": "Sound travels fastest in solids, slower in liquids, and slowest in gases. This is because solids have greater elasticity, allowing disturbances to transfer more quickly between particles.",
          "application": "This is why you can hear a train approaching by putting your ear to the rail – sound travels much faster through steel than through air.",
          "example": "Speed of sound in air: ≈ 343 m/s; in water: ≈ 1,480 m/s; in steel: ≈ 5,000 m/s."
        },
        {
          "principle": "Temperature Dependence in Air",
          "statement": "In air, the speed of sound increases with temperature. The approximate formula $v = 331 + 0.6T$ (with $T$ in °C) gives the speed at any temperature.",
          "application": "This affects musical instrument tuning and the time delay for echoes.",
          "example": "At 20°C, $v = 331 + 0.6(20) = 331 + 12 = 343$ m/s. At 0°C, $v = 331$ m/s."
        }
      ],
      "worked_examples": [
        {
          "title": "Speed of Sound at Different Temperatures",
          "problem": "Calculate the speed of sound in air at 25°C and at −10°C.",
          "step_by_step": [
            {
              "step": "Use $v = 331 + 0.6T$",
              "explanation": "At 25°C: $v = 331 + 0.6(25) = 331 + 15 = 346$ m/s"
            },
            {
              "step": "At −10°C",
              "explanation": "$v = 331 + 0.6(−10) = 331 - 6 = 325$ m/s"
            }
          ],
          "final_answer": "$346$ m/s at 25°C, $325$ m/s at −10°C",
          "concept_applied": "Sound speed increases with temperature."
        },
        {
          "title": "Distance from Lightning",
          "problem": "You see a lightning flash and hear the thunder 5.2 seconds later. If the air temperature is 20°C, how far away did the lightning strike?",
          "step_by_step": [
            {
              "step": "Find the speed of sound",
              "explanation": "At 20°C, $v = 331 + 0.6(20) = 343$ m/s"
            },
            {
              "step": "Use $d = v \\times t$",
              "explanation": "$d = 343 \\times 5.2 = 1784$ m ≈ 1.78 km"
            }
          ],
          "final_answer": "$1.78$ km",
          "concept_applied": "The time delay between seeing lightning and hearing thunder gives distance."
        }
      ]
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with sound waves.",
      "classifications": [
        {
          "type": "Thinking Sound Travels Through Vacuum",
          "value": "Believing that sound can travel through empty space",
          "characteristics": [
            "Assuming that explosions in space movies are realistic",
            "Not understanding that sound is a mechanical wave"
          ],
          "behavior": "Sound requires a medium. Space is a near‑vacuum, so sound cannot travel through it.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student thinks they could hear a spaceship exploding in space."
            },
            {
              "process": "Correct",
              "explanation": "No medium, no sound; they would only see the light."
            }
          ]
        },
        {
          "type": "Confusing Pitch and Loudness",
          "value": "Using 'high' to mean loud instead of high‑pitched, or vice versa",
          "characteristics": [
            "Saying a high‑pitched sound is loud",
            "Not distinguishing frequency from amplitude"
          ],
          "behavior": "Pitch is determined by frequency; loudness by amplitude. They are independent. A high‑pitched sound can be soft, and a low‑pitched sound can be loud.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a whistle is loud because it's high‑pitched."
            },
            {
              "process": "Correct",
              "explanation": "A whistle is high‑pitched but can be blown softly or loudly."
            }
          ]
        },
        {
          "type": "Forgetting That Sound Speed Depends on Medium",
          "value": "Assuming the speed of sound is the same in all media",
          "characteristics": [
            "Using 343 m/s for sound in water",
            "Not realizing sound travels faster in solids"
          ],
          "behavior": "Sound speed varies greatly with medium. Always use the correct speed for the given material.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses 343 m/s for underwater sound calculations."
            },
            {
              "process": "Correct",
              "explanation": "Sound speed in water is about 1480 m/s."
            }
          ]
        },
        {
          "type": "Misunderstanding the Wave Equation for Sound",
          "value": "Using $v = f\\lambda$ incorrectly by forgetting that $v$ depends on medium",
          "characteristics": [
            "Thinking that changing $f$ changes $v$",
            "Not recognizing that $v$ is fixed by medium, so $f$ and $\\lambda$ vary inversely"
          ],
          "behavior": "In a given medium, sound speed is constant. Changing frequency changes wavelength, not speed.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says increasing frequency makes sound travel faster."
            },
            {
              "process": "Correct",
              "explanation": "Increasing frequency decreases wavelength; speed remains the same."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/sound_mistakes.png",
        "alt": "Common mistakes: sound in vacuum, pitch vs. loudness, medium dependence",
        "caption": "Avoid these common errors when studying sound waves."
      }
    }
  ],
  "key_terms": [
    "Sound",
    "Longitudinal Wave",
    "Mechanical Wave",
    "Compression",
    "Rarefaction",
    "Pitch",
    "Frequency",
    "Loudness",
    "Amplitude",
    "Speed of Sound",
    "Audible Range",
    "Infrasound",
    "Ultrasound",
    "Medium",
    "Echo"
  ],
  "summary": "Sound is a longitudinal mechanical wave that propagates through a medium via compressions and rarefactions. It requires a material medium and cannot travel through a vacuum. The pitch of a sound is determined by its frequency, while loudness is determined by amplitude. The speed of sound depends on the medium's properties – faster in solids than liquids, and faster in liquids than gases. In air, the speed is approximately $v = 331 + 0.6T$ m/s, where $T$ is temperature in °C. The human audible range is roughly 20 Hz to 20 kHz; frequencies below are infrasound, above are ultrasound. Sound exhibits all wave phenomena: reflection (echo), refraction, interference, and diffraction. Common mistakes include thinking sound can travel through vacuum, confusing pitch with loudness, assuming sound speed is constant across media, and misunderstanding the relationship between frequency, wavelength, and speed."
}
