{
  "expanded_description": "This section introduces the fundamental properties that describe all waves: amplitude, wavelength, frequency, and speed. These quantities are interrelated and provide a complete description of a wave's characteristics. Amplitude measures the wave's strength or energy, wavelength is the spatial period, frequency is the temporal period, and speed describes how fast the wave propagates through the medium. Understanding these properties is essential for analyzing wave behavior and applying the wave equation.",
  "core_concept": {
    "principle": "All waves, regardless of type, can be described by four fundamental properties: amplitude ($A$), wavelength ($\\lambda$), frequency ($f$), and wave speed ($v$). These properties are related by the wave equation $v = f\\lambda$. Amplitude determines the energy carried by the wave; wavelength and frequency determine the wave's period and spatial extent; speed depends on the properties of the medium.",
    "explanation": "The amplitude of a wave corresponds to the maximum displacement from equilibrium, and for mechanical waves, it is related to the wave's energy (energy $\\propto A^2$). Wavelength is the distance between two consecutive corresponding points (e.g., crest to crest). Frequency is the number of complete oscillations per unit time, measured in hertz (Hz). The period $T = 1/f$ is the time for one complete oscillation. Wave speed is how fast the disturbance travels, and it depends on the medium's properties (e.g., tension and mass density for strings, bulk modulus and density for sound). The wave equation $v = f\\lambda$ links these quantities and is fundamental to wave analysis.",
    "image": {
      "src": "images/unit8/wave_properties.png",
      "alt": "Diagram of a transverse wave showing amplitude, wavelength, crest, trough, and labeling these properties",
      "caption": "Key wave properties: amplitude (A), wavelength (λ), crest, trough, and the direction of propagation."
    }
  },
  "sections": [
    {
      "section_title": "Wave Properties",
      "introduction": "To describe any wave quantitatively, we need to specify its amplitude, wavelength, frequency, and speed. These four properties capture both the spatial and temporal characteristics of the wave.",
      "key_concept": {
        "definition": "Wave properties are the measurable characteristics that define a wave: amplitude $A$ (maximum displacement from equilibrium), wavelength $\\lambda$ (distance between successive identical points), frequency $f$ (number of oscillations per second), and wave speed $v$ (how fast the wave propagates). The period $T = 1/f$ is the time for one complete oscillation.",
        "context": "These properties are interrelated. For a given medium, wave speed is often fixed (e.g., speed of sound in air), so frequency and wavelength are inversely related: higher frequency means shorter wavelength. Understanding these relationships is essential for analyzing everything from musical instruments to light and radio waves."
      },
      "classifications": [
        {
          "type": "Amplitude (A)",
          "value": "Maximum displacement from equilibrium",
          "characteristics": [
            "Measured in meters (m) for mechanical waves",
            "Determines the energy carried by the wave (energy ∝ A²)",
            "For sound waves, amplitude corresponds to loudness",
            "For light waves, amplitude corresponds to brightness"
          ],
          "behavior": "The amplitude is the height of the wave crest (or depth of trough) measured from the equilibrium position. In transverse waves, it's the maximum vertical displacement; in longitudinal waves, it's the maximum compression or rarefaction (often measured as pressure variation).",
          "examples": [
            {
              "process": "Sound wave",
              "explanation": "A louder sound has a larger amplitude, meaning greater pressure variations."
            },
            {
              "process": "Water wave",
              "explanation": "A taller wave has a larger amplitude and carries more energy."
            },
            {
              "process": "Light wave",
              "explanation": "A brighter light has a larger electric field amplitude."
            }
          ]
        },
        {
          "type": "Wavelength (λ)",
          "value": "Spatial period of the wave",
          "characteristics": [
            "Measured in meters (m)",
            "Distance between two consecutive crests (or compressions)",
            "Inversely related to frequency for a given wave speed",
            "Determines the wave's spatial scale"
          ],
          "behavior": "Wavelength is the distance over which the wave's shape repeats. In transverse waves, it's the distance from crest to crest or trough to trough. In longitudinal waves, it's the distance from compression to compression or rarefaction to rarefaction.",
          "examples": [
            {
              "process": "Visible light",
              "explanation": "Red light has a longer wavelength (≈700 nm) than blue light (≈400 nm)."
            },
            {
              "process": "Sound waves",
              "explanation": "Low‑pitched sounds have long wavelengths; high‑pitched sounds have short wavelengths."
            }
          ]
        },
        {
          "type": "Frequency (f) and Period (T)",
          "value": "Temporal characteristics of the wave",
          "characteristics": [
            "Frequency: number of oscillations per second, measured in hertz (Hz)",
            "Period: time for one complete oscillation, $T = 1/f$, measured in seconds (s)",
            "Frequency determines pitch for sound waves, color for light waves",
            "Independent of medium (frequency remains constant when wave changes medium)"
          ],
          "behavior": "Frequency is determined by the source of the wave. A vibrating source with a higher frequency produces waves with shorter periods. When a wave passes from one medium to another, its frequency remains constant, but its speed and wavelength may change.",
          "examples": [
            {
              "process": "Musical note",
              "explanation": "Middle C has a frequency of about 262 Hz, meaning the source vibrates 262 times per second."
            },
            {
              "process": "Radio waves",
              "explanation": "An FM radio station broadcasting at 100 MHz has waves oscillating 100 million times per second."
            }
          ]
        },
        {
          "type": "Wave Speed (v)",
          "value": "How fast the wave propagates through the medium",
          "characteristics": [
            "Measured in meters per second (m/s)",
            "Depends on the properties of the medium (e.g., density, elasticity)",
            "For a given medium, wave speed is constant",
            "Related to wavelength and frequency by $v = f\\lambda$"
          ],
          "behavior": "Wave speed is determined by the medium, not by how the wave is generated. For example, the speed of sound in air at room temperature is about 343 m/s, regardless of the sound's frequency or amplitude. Changing the medium changes the speed.",
          "examples": [
            {
              "process": "Sound in air",
              "explanation": "At 20°C, sound travels at approximately 343 m/s."
            },
            {
              "process": "Light in vacuum",
              "explanation": "Light travels at $c = 3.00 \\times 10^8$ m/s, regardless of frequency."
            },
            {
              "process": "Waves on a string",
              "explanation": "Speed depends on tension and linear density: $v = \\sqrt{F_T/\\mu}$."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Energy and Amplitude",
          "statement": "The energy carried by a wave is proportional to the square of its amplitude. For mechanical waves, doubling the amplitude quadruples the energy.",
          "application": "This relationship explains why larger‑amplitude waves are more destructive (tsunamis) or louder (sound).",
          "example": "A sound wave with twice the amplitude carries four times the energy and is perceived as significantly louder."
        },
        {
          "principle": "Inverse Relationship Between Frequency and Wavelength",
          "statement": "For waves traveling at a constant speed, frequency and wavelength are inversely proportional: $f \\propto 1/\\lambda$. Higher frequency means shorter wavelength, and vice versa.",
          "application": "This is why high‑pitched sounds (high frequency) have short wavelengths, and low‑pitched sounds have long wavelengths.",
          "example": "In air at 343 m/s, a 100 Hz sound has $\\lambda = v/f = 3.43$ m; a 1000 Hz sound has $\\lambda = 0.343$ m."
        },
        {
          "principle": "Wave Speed Depends on Medium",
          "statement": "The speed of a wave is determined by the properties of the medium through which it travels, not by the wave's frequency or amplitude. Changing the medium changes the speed.",
          "application": "This explains why sound travels faster in water than in air, and faster in steel than in water.",
          "example": "Sound speed in air ≈ 343 m/s, in water ≈ 1480 m/s, in steel ≈ 5000 m/s."
        },
        {
          "principle": "Frequency Remains Constant Across Boundaries",
          "statement": "When a wave passes from one medium to another, its frequency remains constant (determined by the source), but its speed and wavelength change according to $v = f\\lambda$.",
          "application": "This is why light changes color? No, color is determined by frequency, so light's color does not change when entering a new medium, but its wavelength does.",
          "example": "Red light entering water from air has the same frequency but a shorter wavelength because its speed decreases."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Wavelength from Frequency and Speed",
          "problem": "A sound wave in air has a frequency of 440 Hz (the note A). If the speed of sound in air is 343 m/s, what is the wavelength?",
          "step_by_step": [
            {
              "step": "Recall the wave equation",
              "explanation": "$v = f\\lambda$"
            },
            {
              "step": "Solve for wavelength",
              "explanation": "$\\lambda = v/f = 343 / 440 = 0.780$ m"
            }
          ],
          "final_answer": "$0.780$ m (78.0 cm)",
          "concept_applied": "Direct application of $v = f\\lambda$."
        },
        {
          "title": "Finding Frequency from Wavelength and Speed",
          "problem": "An FM radio station broadcasts at a wavelength of 3.0 m. What is its frequency? (Radio waves travel at the speed of light, $3.00 \\times 10^8$ m/s.)",
          "step_by_step": [
            {
              "step": "Use $v = f\\lambda$",
              "explanation": "$f = v/\\lambda = (3.00 \\times 10^8) / 3.0 = 1.00 \\times 10^8$ Hz = 100 MHz"
            }
          ],
          "final_answer": "$100$ MHz",
          "concept_applied": "Radio waves are electromagnetic; they travel at light speed."
        },
        {
          "title": "Determining Wave Speed from Frequency and Wavelength",
          "problem": "A wave on a string has a frequency of 120 Hz and a wavelength of 0.25 m. What is the wave speed?",
          "step_by_step": [
            {
              "step": "Apply $v = f\\lambda$",
              "explanation": "$v = 120 \\times 0.25 = 30$ m/s"
            }
          ],
          "final_answer": "$30$ m/s",
          "concept_applied": "Wave speed is product of frequency and wavelength."
        },
        {
          "title": "Finding Period from Frequency",
          "problem": "A wave has a frequency of 50 Hz. What is its period?",
          "step_by_step": [
            {
              "step": "Recall $T = 1/f$",
              "explanation": "$T = 1/50 = 0.02$ s = 20 ms"
            }
          ],
          "final_answer": "$0.02$ s",
          "concept_applied": "Period is the reciprocal of frequency."
        },
        {
          "title": "Energy and Amplitude Relationship",
          "problem": "Wave A has twice the amplitude of wave B. How many times more energy does wave A carry compared to wave B?",
          "step_by_step": [
            {
              "step": "Recall energy ∝ amplitude²",
              "explanation": "$E \\propto A^2$, so if $A_A = 2A_B$, then $E_A/E_B = (2)^2 = 4$."
            }
          ],
          "final_answer": "Wave A carries 4 times the energy of wave B.",
          "concept_applied": "Wave energy is proportional to the square of amplitude."
        }
      ],
      "image": {
        "src": "images/unit8/wave_properties_diagram.png",
        "alt": "Detailed diagram of a wave with labeled amplitude, wavelength, crest, trough, and equilibrium line",
        "caption": "The amplitude is the maximum displacement from equilibrium; the wavelength is the distance between successive crests."
      }
    },
    {
      "section_title": "The Wave Equation",
      "introduction": "The wave equation $v = f\\lambda$ is a fundamental relationship that connects the speed, frequency, and wavelength of any wave. It applies to all types of waves, from sound to light to water waves.",
      "key_concept": {
        "definition": "The wave equation states that the speed of a wave ($v$) equals the product of its frequency ($f$) and wavelength ($\\lambda$): $v = f\\lambda$. Since $f = 1/T$, it can also be written as $v = \\lambda / T$.",
        "context": "This equation is universal and allows us to calculate any one of the three quantities if the other two are known. It also reveals the inverse relationship between frequency and wavelength when speed is constant."
      },
      "principles": [
        {
          "principle": "Derivation",
          "statement": "Consider a wave traveling at speed $v$. In one period $T$, the wave moves forward by one wavelength $\\lambda$. Since distance = speed × time, $\\lambda = vT$, and with $T = 1/f$, we get $\\lambda = v/f$, or $v = f\\lambda$.",
          "application": "This derivation shows why the equation holds for any periodic wave.",
          "example": "If a wave has frequency 100 Hz and speed 200 m/s, then $\\lambda = 200/100 = 2$ m."
        }
      ]
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with wave properties.",
      "classifications": [
        {
          "type": "Confusing Frequency and Speed",
          "value": "Thinking that changing the frequency changes the wave speed",
          "characteristics": [
            "Assuming that higher frequency waves travel faster",
            "Not recognizing that speed is medium‑dependent"
          ],
          "behavior": "Wave speed is determined by the medium, not by frequency. In a given medium, all frequencies travel at the same speed (for non‑dispersive media). Changing the frequency changes the wavelength, not the speed.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student thinks high‑pitched sound travels faster than low‑pitched sound."
            },
            {
              "process": "Correct",
              "explanation": "All sounds travel at the same speed in air (approximately 343 m/s) regardless of pitch."
            }
          ]
        },
        {
          "type": "Mixing Up Wavelength and Amplitude",
          "value": "Confusing the spatial extent of the wave with its height",
          "characteristics": [
            "Thinking wavelength is the height of the wave",
            "Using amplitude when wavelength is needed in calculations"
          ],
          "behavior": "Amplitude is the maximum displacement (height); wavelength is the distance between repeating points (length). They are independent properties.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a wave with large amplitude has a long wavelength."
            },
            {
              "process": "Correct",
              "explanation": "Amplitude and wavelength are independent; a wave can have large amplitude and short wavelength."
            }
          ]
        },
        {
          "type": "Unit Errors",
          "value": "Using incorrect units for frequency (Hz) or forgetting to convert",
          "characteristics": [
            "Using cycles per second but not calling it Hz",
            "Forgetting that $T = 1/f$ requires consistent time units"
          ],
          "behavior": "Frequency must be in Hz (s⁻¹) when used with speed in m/s to get wavelength in meters. Period must be in seconds when used with speed.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses $f = 100$ kHz without converting to Hz in $v = f\\lambda$."
            },
            {
              "process": "Correct",
              "explanation": "Convert 100 kHz = $100 \\times 10^3$ Hz = $10^5$ Hz."
            }
          ]
        },
        {
          "type": "Forgetting the $f = 1/T$ Relationship",
          "value": "Not knowing how to convert between period and frequency",
          "characteristics": [
            "Using $f = T$",
            "Not recognizing that higher frequency means shorter period"
          ],
          "behavior": "Frequency and period are reciprocals: $f = 1/T$ and $T = 1/f$.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a wave with period 0.5 s has frequency 0.5 Hz."
            },
            {
              "process": "Correct",
              "explanation": "$f = 1/0.5 = 2$ Hz."
            }
          ]
        },
        {
          "type": "Assuming All Waves Have the Same Speed",
          "value": "Thinking that wave speed is the same for all types of waves",
          "characteristics": [
            "Using the speed of light for sound waves",
            "Not recognizing that different media give different speeds"
          ],
          "behavior": "Different wave types have different speeds, and even the same type of wave has different speeds in different media. Always use the appropriate speed for the wave and medium.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses $3 \\times 10^8$ m/s for a sound wave problem."
            },
            {
              "process": "Correct",
              "explanation": "Sound speed in air is about 343 m/s; light speed is $3 \\times 10^8$ m/s."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/wave_properties_mistakes.png",
        "alt": "Common mistakes: confusing frequency and speed, mixing wavelength and amplitude, unit errors",
        "caption": "Avoid these common errors when working with wave properties."
      }
    }
  ],
  "key_terms": [
    "Amplitude",
    "Wavelength",
    "Frequency",
    "Period",
    "Wave Speed",
    "Hertz",
    "$v = f\\lambda$",
    "Crest",
    "Trough",
    "Compression",
    "Rarefaction",
    "Equilibrium Position"
  ],
  "summary": "All waves are characterized by four fundamental properties: amplitude ($A$), wavelength ($\\lambda$), frequency ($f$), and wave speed ($v$). Amplitude measures the maximum displacement from equilibrium and determines the wave's energy (energy $\\propto A^2$). Wavelength is the distance between successive identical points (e.g., crest to crest). Frequency is the number of oscillations per second (measured in Hz), and its reciprocal is the period $T = 1/f$. Wave speed depends on the medium and is related to frequency and wavelength by the universal wave equation $v = f\\lambda$. For a given medium, wave speed is constant, so frequency and wavelength are inversely related. When a wave changes medium, its frequency remains constant, but its speed and wavelength change. Understanding these properties is essential for analyzing all types of waves, from sound to light to water waves."
}
