{
  "expanded_description": "What determines an economy's potential output? How does an economy's productive capacity expand over time? The long-run aggregate supply (LRAS) curve represents the economy's potential output—the maximum sustainable level of production when all resources are fully employed. Unlike the short-run aggregate supply curve, which can shift due to temporary factors, the LRAS shifts only when the economy's productive capacity changes. Understanding what shifts the LRAS is essential for analyzing long-run growth, the effects of supply-side policies, and the economy's potential to sustain non-inflationary growth. In this section, we'll revisit the LRAS curve, exploring its determinants, how it shifts over time, and its relationship to economic growth.",
  
  "core_concept": {
    "principle": "The long-run aggregate supply (LRAS) curve is vertical at the economy's potential GDP—the level of output that can be sustained when all resources are fully employed at normal utilization rates. Unlike the short-run aggregate supply curve, which slopes upward due to sticky wages and prices, the LRAS is vertical because in the long run, prices and wages adjust fully, and output is determined by real factors: the quantity and quality of labor, the stock of physical capital, human capital, and technology. The LRAS shifts over time as these real factors change. The key determinants of LRAS shifts are: (1) Changes in the quantity of labor: Population growth, increased labor force participation, and immigration expand the labor force, shifting LRAS right. (2) Changes in the quality of labor (human capital): Improvements in education, training, and health increase worker productivity, shifting LRAS right. (3) Changes in the stock of physical capital: Investment in machinery, equipment, infrastructure, and technology increases the capital stock, allowing more output to be produced, shifting LRAS right. (4) Changes in technology and productivity: Technological progress, innovation, and improvements in production methods allow more output to be produced from the same inputs, shifting LRAS right. (5) Changes in natural resources: Discovery of new resources or improvements in resource extraction can increase potential output. (6) Changes in institutions and policies: Improvements in property rights, rule of law, regulatory efficiency, and economic freedom can increase potential output by improving incentives and resource allocation. The LRAS curve shifts right over time in growing economies, reflecting the expansion of potential GDP. The slope of the LRAS is vertical, indicating that in the long run, the price level does not affect real output. This is the classical dichotomy: real variables (output, employment) are determined by real factors, while nominal variables (price level, inflation) are determined by monetary factors. Understanding LRAS shifts is essential for analyzing long-run growth, supply-side policies, and the economy's capacity to sustain growth without inflation.",
    
    "explanation": "Imagine the economy's potential output as a factory's maximum production capacity. In the short run, you can run the factory faster (more output) by paying overtime, but that's not sustainable. In the long run, the only way to produce more is to build more factories, hire more workers, or invent better machines. The LRAS curve is like that maximum sustainable capacity. It shifts right when you add more workers, more machines, or better technology. It's vertical because in the long run, prices don't affect how much you can actually produce—only real factors matter.",
    
    "image": {
      "src": "images/unit12/lras_overview.png",
      "alt": "Graph showing vertical LRAS curve shifting right over time as economy grows",
      "caption": "Figure 12.2.1: The long-run aggregate supply curve is vertical at potential GDP. It shifts right as the economy's productive capacity expands."
    }
  },

  "sections": [
    {
      "section_title": "12.2 LRAS Revisited",
      "introduction": "In the short run, aggregate supply can fluctuate due to sticky prices and wages. But in the long run, output is determined by the economy's productive capacity—its labor force, capital stock, technology, and institutions. The long-run aggregate supply (LRAS) curve represents this capacity. Understanding what shifts the LRAS is essential for analyzing economic growth, the effects of supply-side policies, and the economy's potential to sustain non-inflationary expansion. In this section, we'll revisit the LRAS curve, exploring its determinants, how it shifts over time, and its relationship to growth.",
      
      "introduction_image": {
        "src": "images/unit12/lras_intro.png",
        "alt": "Graph showing LRAS shifting right over time with labels for labor, capital, technology",
        "caption": "Figure 12.2.2: The LRAS curve shifts right as the economy's productive capacity expands due to increases in labor, capital, and technology."
      },
      
      "key_concept": {
        "definition": "The long-run aggregate supply (LRAS) curve is vertical at the economy's potential GDP—the level of output that can be sustained when all resources are fully employed at normal utilization rates. It is vertical because in the long run, prices and wages adjust fully, and real output is determined by real factors, not the price level. The LRAS shifts over time as these real factors change. The key determinants of LRAS shifts are: (1) Labor supply: An increase in the quantity of labor—from population growth, higher labor force participation, or immigration—shifts LRAS right. Each additional worker can produce more output, increasing potential GDP. (2) Physical capital: Investment in machinery, equipment, buildings, and infrastructure increases the capital stock, allowing each worker to produce more. This shifts LRAS right. (3) Human capital: Improvements in education, training, and health increase worker productivity, shifting LRAS right. (4) Technology and productivity: Technological progress, innovation, and improvements in production methods allow more output to be produced from the same inputs. This is a major source of LRAS shifts. (5) Natural resources: Discovery of new resources or improvements in extraction technology can increase potential output. (6) Institutions and policies: Improvements in property rights, rule of law, regulatory efficiency, and economic freedom can increase potential output by improving incentives and resource allocation. The LRAS curve shifts right over time in growing economies, reflecting the expansion of potential GDP. The slope of the LRAS is vertical, embodying the classical dichotomy: real variables are determined by real factors, nominal by nominal. Understanding LRAS shifts is essential for analyzing long-run growth, supply-side policies, and the economy's capacity to sustain growth without inflation.",
        
        "context": "The concept of long-run aggregate supply is rooted in classical economics and was incorporated into the AD-AS framework to distinguish short-run fluctuations from long-run growth. The vertical LRAS embodies the idea that in the long run, the economy returns to potential GDP regardless of the price level. Shifts in LRAS represent economic growth. In AP Macroeconomics, understanding LRAS is essential for analyzing growth, supply-side policies, and the long-run effects of shocks.",
        
        "image": {
          "src": "images/unit12/lras_determinants.png",
          "alt": "Diagram showing factors that shift LRAS: labor, capital, human capital, technology, institutions",
          "caption": "Figure 12.2.3: The LRAS curve shifts right due to increases in labor, capital, human capital, technology, and improvements in institutions."
        }
      },

      "classifications": [
        {
          "type": "Labor Force Growth",
          "value": "Increases in quantity of workers",
          "characteristics": ["Population growth", "Immigration", "Higher participation rates", "Demographic changes", "Increases potential output"],
          "behavior": "An increase in the labor force shifts the LRAS curve to the right because more workers can produce more output. Labor force growth comes from natural population increase, immigration, and changes in labor force participation (e.g., more women entering the workforce, later retirement). Each additional worker adds to potential GDP, though the amount depends on their productivity. Labor force growth is a key driver of potential output, especially in countries with growing populations. However, labor force growth alone does not increase output per worker—it increases total output but not necessarily living standards. For sustained growth in living standards, productivity must also increase. Labor force growth also affects the capital-labor ratio: if capital doesn't grow as fast as labor, capital per worker falls, potentially reducing productivity. This is why investment must keep pace with labor force growth.",
          
          "image": {
            "src": "images/unit12/labor_growth.png",
            "alt": "Graph showing LRAS shifting right with more workers",
            "caption": "Figure 12.2.4: Labor force growth shifts LRAS right. More workers can produce more potential output."
          },
          
          "examples": [
            {
              "process": "U.S. Baby Boom",
              "explanation": "The post-WWII baby boom expanded the U.S. labor force as the cohort entered working age, contributing to potential GDP growth."
            },
            {
              "process": "Immigration",
              "explanation": "Countries like Canada and Australia use immigration to increase labor force growth and potential output."
            }
          ]
        },
        {
          "type": "Capital Accumulation",
          "value": "Increases in physical capital stock",
          "characteristics": ["Investment in machinery", "Infrastructure spending", "Technology investment", "Increases output per worker", "Subject to diminishing returns"],
          "behavior": "Capital accumulation—increasing the stock of machinery, equipment, buildings, and infrastructure—shifts the LRAS curve to the right. More capital allows each worker to produce more, increasing potential GDP per worker. Capital accumulation requires investment, which must be financed by saving (domestic or foreign). The rate of investment relative to depreciation determines how fast the capital stock grows. Capital accumulation is subject to diminishing returns: each additional unit of capital adds less to output than the previous unit. This means that as an economy develops, the growth contribution from capital accumulation tends to decline. However, capital accumulation is essential for adopting new technologies, as many technologies are embodied in new capital goods. Infrastructure investment (roads, ports, electricity) also has large spillover effects, enabling other sectors to be more productive. Capital accumulation is a key driver of growth, especially in developing countries with low initial capital stocks.",
          
          "image": {
            "src": "images/unit12/capital_accumulation.png",
            "alt": "Graph showing LRAS shifting right with more capital",
            "caption": "Figure 12.2.5: Capital accumulation shifts LRAS right. More capital per worker increases potential output."
          },
          
          "examples": [
            {
              "process": "China's infrastructure boom",
              "explanation": "China's massive investment in roads, ports, and high-speed rail increased its capital stock dramatically, shifting LRAS right and supporting rapid growth."
            },
            {
              "process": "Post-war reconstruction",
              "explanation": "Europe and Japan rebuilt their capital stocks after WWII, rapidly increasing potential output."
            }
          ]
        },
        {
          "type": "Technological Progress",
          "value": "Advances in knowledge and productivity",
          "characteristics": ["Innovation", "R&D", "Process improvements", "New products", "Shifts LRAS right without more inputs"],
          "behavior": "Technological progress is the most important source of sustained long-run growth. It refers to advances in knowledge that allow more output to be produced from the same inputs. This includes new production methods, better organization, improved materials, and new products. Technological progress shifts the LRAS curve to the right without requiring more labor or capital. It is the key to increasing output per worker and living standards over time. Technological progress comes from research and development, innovation, entrepreneurship, and diffusion of knowledge from abroad. It is influenced by incentives, institutions, and policies—such as patent protection, R&D subsidies, education, and openness to trade. Unlike capital accumulation, technological progress does not exhibit diminishing returns; in fact, ideas can be used by many people at once (non-rivalry) and can lead to increasing returns. This is why technological progress can sustain growth indefinitely.",
          
          "image": {
            "src": "images/unit12/technology_progress.png",
            "alt": "Graph showing LRAS shifting right with technology improvement",
            "caption": "Figure 12.2.6: Technological progress shifts LRAS right, allowing more output from the same inputs."
          },
          
          "examples": [
            {
              "process": "Information technology revolution",
              "explanation": "Computers, software, and the internet have dramatically increased productivity across many sectors, shifting LRAS right."
            },
            {
              "process": "Green Revolution",
              "explanation": "New crop varieties and agricultural techniques increased food output per acre, shifting LRAS right in agricultural economies."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "LRAS Is Vertical Because Real Output Is Determined by Real Factors",
          "statement": "The LRAS curve is vertical because in the long run, the price level does not affect the economy's real output. This reflects the classical dichotomy: nominal variables (like the price level) do not influence real variables (like output and employment) in the long run. Real output is determined by the economy's productive capacity—the quantity and quality of labor, the stock of capital, technology, and institutions. Changes in aggregate demand affect the price level in the long run but not real GDP. This is why the LRAS is vertical at potential GDP. The vertical LRAS is a crucial concept for understanding the long-run effects of monetary policy: in the long run, money is neutral, affecting only prices, not output.",
          "application": "When analyzing long-run effects, remember that the LRAS is vertical. Expansionary policy may temporarily boost output, but in the long run, it only raises prices. This is why central banks focus on price stability in the long run.",
          "example": "If the Fed doubles the money supply, in the long run, the price level will double, but real GDP will return to potential. The LRAS hasn't shifted; the economy just moves up the vertical curve.",
          
          "image": {
            "src": "images/unit12/lras_vertical.png",
            "alt": "Vertical LRAS with arrows showing price level changes not affecting output",
            "caption": "Figure 12.2.7: LRAS is vertical because in the long run, real output is determined by real factors, not the price level."
          }
        },
        {
          "principle": "LRAS Shifts Represent Economic Growth",
          "statement": "When the LRAS curve shifts to the right, it means the economy's potential output has increased—the economy can produce more goods and services than before. This is economic growth. LRAS shifts are driven by increases in the factors of production (labor and capital) and improvements in technology and institutions. The rate at which LRAS shifts determines the economy's long-run growth rate. Understanding what shifts LRAS is essential for analyzing growth and for designing policies to promote it. Supply-side policies aim to shift LRAS right by increasing productivity, improving incentives, or expanding the labor force. In the AD-AS framework, LRAS shifts are the source of long-run increases in real GDP.",
          "application": "When analyzing growth, focus on LRAS shifts. Policies that increase labor force participation, investment, education, or technological progress shift LRAS right and raise potential GDP. This is how economies grow over time.",
          "example": "The U.S. LRAS has shifted right over decades due to labor force growth, capital accumulation, and technological progress. This is why real GDP has increased over time.",
          
          "image": {
            "src": "images/unit12/lras_growth.png",
            "alt": "LRAS shifting right over time, representing economic growth",
            "caption": "Figure 12.2.8: Rightward shifts in LRAS represent economic growth—an increase in potential GDP."
          }
        },
        {
          "principle": "Supply-Side Policies Aim to Shift LRAS Right",
          "statement": "Supply-side policies are government policies designed to increase the economy's potential output by shifting the LRAS curve to the right. These policies focus on increasing the quantity or quality of factors of production or improving productivity. Examples include: (1) Tax reforms that improve incentives to work, save, and invest. Lower marginal tax rates can increase labor supply and encourage investment. (2) Investment in education and training to improve human capital. (3) Infrastructure spending to increase public capital. (4) Deregulation to reduce inefficiencies and encourage competition. (5) Research and development subsidies to promote innovation. (6) Immigration policies to expand the labor force. (7) Trade liberalization to increase access to technology and markets. Supply-side policies are distinct from demand-side policies (monetary and fiscal policy) which aim to stabilize the economy in the short run. In the long run, supply-side policies are the key to raising living standards.",
          "application": "When evaluating policies for long-run growth, consider whether they shift LRAS right. Tax cuts that increase incentives to work and invest can boost potential GDP. Education spending increases human capital. Deregulation can improve efficiency.",
          "example": "The Tax Reform Act of 1986 lowered marginal tax rates, which some argue increased labor supply and investment, contributing to LRAS growth. Investments in infrastructure under the 2021 Infrastructure Investment and Jobs Act aim to shift LRAS right.",
          
          "image": {
            "src": "images/unit12/supply_side.png",
            "alt": "Diagram showing supply-side policies shifting LRAS right",
            "caption": "Figure 12.2.9: Supply-side policies aim to shift LRAS right by increasing productivity, labor supply, or capital."
          }
        },
        {
          "principle": "LRAS and AD Interact to Determine Long-Run Equilibrium",
          "statement": "In the long run, the economy's equilibrium is determined by the intersection of the LRAS curve and the aggregate demand curve. At this point, output is at potential GDP, and unemployment is at the natural rate. The price level adjusts to bring aggregate demand into line with potential output. If AD is too high (above LRAS), prices rise until AD falls back to LRAS; if AD is too low, prices fall. This adjustment process ensures that in the long run, the economy returns to potential GDP. Changes in AD affect the price level in the long run but not output. Changes in LRAS affect both output and the price level (depending on AD response). Understanding this interaction is essential for analyzing the long-run effects of policy and shocks.",
          "application": "When analyzing long-run equilibrium, find where AD intersects LRAS. That determines the price level. If LRAS shifts right, potential GDP increases. If AD doesn't shift, the price level will fall. If AD shifts with LRAS, prices may be stable.",
          "example": "If the economy experiences a positive supply shock (LRAS shifts right) and AD is unchanged, the price level falls and output rises. If the central bank increases AD to match the LRAS shift, prices can remain stable while output grows.",
          
          "image": {
            "src": "images/unit12/lras_ad_interaction.png",
            "alt": "AD-AS graph showing long-run equilibrium at intersection of AD and LRAS",
            "caption": "Figure 12.2.10: Long-run equilibrium occurs where AD intersects LRAS. Output is at potential; price level adjusts."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying LRAS Shifts",
          
          "image": {
            "src": "images/unit12/lras_shifts.png",
            "alt": "List of events affecting LRAS",
            "caption": "Figure 12.2.11: Determine whether each event shifts LRAS and in which direction."
          },
          
          "problem": "For each event, determine whether the LRAS curve shifts and in which direction (right, left, or no shift). a) The labor force increases due to immigration. b) A major earthquake destroys factories and infrastructure. c) The government invests in education and training programs. d) A technological breakthrough increases productivity. e) The central bank increases the money supply. f) A new oil field is discovered. g) The retirement age is raised, increasing labor force participation.",
          
          "step_by_step": [
            {
              "step": "Analyze scenario a",
              "explanation": "Immigration increases labor force → more workers can produce more → LRAS shifts right."
            },
            {
              "step": "Analyze scenario b",
              "explanation": "Earthquake destroys capital stock → less productive capacity → LRAS shifts left."
            },
            {
              "step": "Analyze scenario c",
              "explanation": "Education investment increases human capital → workers more productive → LRAS shifts right."
            },
            {
              "step": "Analyze scenario d",
              "explanation": "Technological breakthrough increases productivity → more output from same inputs → LRAS shifts right."
            },
            {
              "step": "Analyze scenario e",
              "explanation": "Money supply increase affects nominal variables, not real productive capacity → no LRAS shift."
            },
            {
              "step": "Analyze scenario f",
              "explanation": "New oil field increases natural resources → potential output increases → LRAS shifts right."
            },
            {
              "step": "Analyze scenario g",
              "explanation": "Higher participation increases labor force → LRAS shifts right."
            }
          ],
          
          "final_answer": "a) Right. b) Left. c) Right. d) Right. e) No shift. f) Right. g) Right.",
          "concept_applied": "LRAS shifts only when the economy's productive capacity changes—labor, capital, technology, resources, institutions."
        },
        {
          "title": "Graphing LRAS Shifts and Long-Run Equilibrium",
          
          "image": {
            "src": "images/unit12/lras_graphing.png",
            "alt": "AD-AS graph with initial LRAS",
            "caption": "Figure 12.2.12: Show the effect of an LRAS shift on long-run equilibrium."
          },
          
          "problem": "An economy is initially in long-run equilibrium with LRAS at potential GDP of $\\$20$ trillion and price level 100. A wave of immigration increases the labor force, shifting LRAS right to $\\$22$ trillion. a) Show the initial equilibrium on an AD-AS graph. b) Show the new LRAS curve. c) If AD remains unchanged, what is the new long-run equilibrium price level and output? d) If the central bank wants to maintain stable prices, what should it do to AD? e) Show the outcome with stable prices.",
          
          "step_by_step": [
            {
              "step": "Draw initial equilibrium",
              "explanation": "Draw AD1, LRAS1 at $20, intersecting at price level 100."
            },
            {
              "step": "Draw new LRAS",
              "explanation": "Draw LRAS2 vertical at $22, to the right of LRAS1."
            },
            {
              "step": "New equilibrium with unchanged AD",
              "explanation": "AD1 intersects LRAS2 at a lower price level (since AD is downward sloping). Output is $22, price level lower, say 90."
            },
            {
              "step": "Central bank action for stable prices",
              "explanation": "To keep prices stable at 100, the central bank must increase AD to shift AD right to intersect LRAS2 at price level 100. This means expansionary policy."
            },
            {
              "step": "Outcome with stable prices",
              "explanation": "AD shifts right to AD2, intersecting LRAS2 at price level 100 and output $22. Prices stable, output higher."
            }
          ],
          
          "final_answer": "a) Graph with AD and LRAS1 at $20, P=100. b) LRAS2 at $22. c) Output $22, lower price. d) Increase AD. e) AD2 at $22, P=100.",
          "concept_applied": "LRAS shifts change potential output. With unchanged AD, prices fall. With AD adjustment, prices can be stable."
        },
        {
          "title": "Calculating Growth from LRAS Shifts",
          
          "image": {
            "src": "images/unit12/growth_calc.png",
            "alt": "Table with LRAS values over time",
            "caption": "Figure 12.2.13: Calculate growth rates from LRAS shifts."
          },
          
          "problem": "An economy's potential GDP (LRAS) was $\\$18$ trillion in 2020 and $\\$19$ trillion in 2021, $\\$20$ trillion in 2022. a) Calculate the growth rate from 2020 to 2021. b) Calculate the growth rate from 2021 to 2022. c) If this growth rate continues, how long will it take for potential GDP to double? d) What factors could have caused these LRAS shifts? e) If actual GDP equals potential GDP each year, what is the growth rate of actual GDP?",
          
          "step_by_step": [
            {
              "step": "Growth 2020-21",
              "explanation": "Growth rate = (19 - 18)/18 × 100% = 1/18 × 100% = 5.56%."
            },
            {
              "step": "Growth 2021-22",
              "explanation": "Growth rate = (20 - 19)/19 × 100% = 1/19 × 100% = 5.26%."
            },
            {
              "step": "Doubling time",
              "explanation": "Using Rule of 70: 70 / growth rate. If growth is about 5.4%, doubling time ≈ 70/5.4 ≈ 13 years."
            },
            {
              "step": "Possible causes",
              "explanation": "Labor force growth, capital accumulation, technological progress, education improvements, institutional reforms."
            },
            {
              "step": "Actual GDP growth",
              "explanation": "If actual = potential each year, actual GDP grows at same rate as potential: 5.56% and 5.26%."
            }
          ],
          
          "final_answer": "a) 5.56%. b) 5.26%. c) ~13 years. d) Labor, capital, technology, education. e) Same as potential growth.",
          "concept_applied": "LRAS shifts measure potential GDP growth. Actual GDP grows at same rate if economy stays at potential."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Initial LRAS Position",
          "description": "The economy has a given potential GDP determined by current labor, capital, technology, and institutions.",
          "mechanism": "LRAS is vertical at current potential GDP.",
          "result": "Baseline LRAS established.",
          
          "image": {
            "src": "images/unit12/lras_step1.png",
            "alt": "Vertical LRAS curve at initial potential GDP",
            "caption": "Figure 12.2.14: Step 1 - Initial LRAS at current potential GDP."
          }
        },
        {
          "step": 2,
          "process": "Factor Accumulation or Technological Progress",
          "description": "The economy experiences growth in factors or improvements in technology.",
          "mechanism": "Labor force grows, capital accumulates, human capital improves, technology advances, or institutions strengthen.",
          "result": "Productive capacity increases.",
          
          "image": {
            "src": "images/unit12/lras_step2.png",
            "alt": "Arrows showing labor, capital, technology increasing",
            "caption": "Figure 12.2.15: Step 2 - Factors accumulate or technology improves, increasing productive capacity."
          }
        },
        {
          "step": 3,
          "process": "LRAS Shifts Right",
          "description": "The increase in productive capacity shifts the LRAS curve to the right.",
          "mechanism": "At every price level, the economy can produce more output. Potential GDP increases.",
          "result": "New LRAS at higher potential GDP.",
          
          "image": {
            "src": "images/unit12/lras_step3.png",
            "alt": "LRAS shifting right to new potential GDP",
            "caption": "Figure 12.2.16: Step 3 - LRAS shifts right, reflecting higher potential output."
          }
        },
        {
          "step": 4,
          "process": "Long-Run Equilibrium Adjusts",
          "description": "The new LRAS interacts with aggregate demand to determine new long-run equilibrium.",
          "mechanism": "If AD unchanged, price level falls. If AD increases with LRAS, prices can remain stable.",
          "result": "New equilibrium output and price level.",
          
          "image": {
            "src": "images/unit12/lras_step4.png",
            "alt": "AD-AS graph showing new equilibrium with shifted LRAS",
            "caption": "Figure 12.2.17: Step 4 - New long-run equilibrium established at higher potential GDP."
          }
        },
        {
          "step": 5,
          "process": "Growth Continues",
          "description": "The process repeats over time, with ongoing shifts in LRAS driving economic growth.",
          "mechanism": "Continued investment, innovation, and factor accumulation sustain LRAS shifts.",
          "result": "Long-run growth trajectory.",
          
          "image": {
            "src": "images/unit12/lras_step5.png",
            "alt": "LRAS shifting right over multiple periods, showing growth",
            "caption": "Figure 12.2.18: Step 5 - Ongoing LRAS shifts drive long-run economic growth."
          }
        }
      ],

      "image": {
        "src": "images/unit12/lras_summary.png",
        "alt": "Comprehensive summary diagram of LRAS: vertical curve, determinants of shifts, interaction with AD, and growth implications",
        "caption": "Figure 12.2.19: LRAS revisited - determinants, shifts, and role in long-run growth."
      }
    }
  ],

  "key_terms": [
    "Long-run aggregate supply (LRAS)",
    "Potential GDP",
    "Full-employment output",
    "Natural rate of output",
    "Production possibilities",
    "Labor force",
    "Population growth",
    "Labor force participation",
    "Immigration",
    "Physical capital",
    "Capital stock",
    "Investment",
    "Depreciation",
    "Human capital",
    "Education",
    "Training",
    "Technology",
    "Technological progress",
    "Innovation",
    "Research and development",
    "Total factor productivity",
    "Natural resources",
    "Land",
    "Resource discovery",
    "Institutions",
    "Property rights",
    "Rule of law",
    "Governance",
    "Economic freedom",
    "Regulation",
    "Tax policy",
    "Supply-side policies",
    "Classical dichotomy",
    "Monetary neutrality",
    "Long-run equilibrium",
    "AD-AS model",
    "Potential output growth",
    "Growth rate",
    "Rule of 70",
    "Compound growth",
    "Steady state",
    "Convergence",
    "Catch-up growth",
    "Diminishing returns",
    "Capital deepening",
    "Capital widening",
    "Labor productivity",
    "Output per worker",
    "Production function",
    "Aggregate production function"
  ],

  "summary": "The long-run aggregate supply (LRAS) curve is vertical at the economy's potential GDP—the maximum sustainable level of output when all resources are fully employed. It is vertical because in the long run, real output is determined by real factors, not the price level (classical dichotomy). The LRAS shifts over time as the economy's productive capacity changes. Key determinants of LRAS shifts include: (1) Labor force growth: Increases in population, immigration, or labor force participation expand the number of workers, shifting LRAS right. (2) Physical capital accumulation: Investment in machinery, equipment, and infrastructure increases the capital stock, allowing more output per worker, shifting LRAS right. (3) Human capital improvement: Education, training, and health improvements increase worker productivity, shifting LRAS right. (4) Technological progress: Innovation, R&D, and productivity improvements allow more output from the same inputs, shifting LRAS right. (5) Natural resources: Discovery of new resources or improved extraction shifts LRAS right. (6) Institutions and policies: Improvements in property rights, rule of law, and economic freedom increase potential output by improving incentives and resource allocation. LRAS shifts represent economic growth—an increase in potential GDP. Supply-side policies aim to shift LRAS right by promoting investment, education, innovation, and efficiency. In the AD-AS model, long-run equilibrium occurs where AD intersects LRAS. Changes in AD affect the price level in the long run but not output; changes in LRAS affect both output and (depending on AD) the price level. Understanding LRAS is essential for analyzing long-run growth, the effects of supply-side policies, and the economy's capacity to sustain non-inflationary expansion."
}
