{
  "expanded_description": "What determines how much a worker can produce? Why are workers in some countries so much more productive than others? Productivity—output per worker or per hour worked—is the fundamental determinant of living standards. Countries with high productivity have high incomes; countries with low productivity are poor. Productivity growth is what allows living standards to rise over time. Understanding productivity—its determinants, how it's measured, and what drives its growth—is essential for understanding economic growth and for designing policies to improve living standards. The key determinants of productivity include physical capital, human capital, and technological knowledge. Improvements in any of these raise productivity and living standards.",
  
  "core_concept": {
    "principle": "Productivity is the amount of goods and services produced per unit of input, most commonly measured as output per worker or output per hour worked. It is the key determinant of living standards because a country's income is ultimately its production. The primary determinants of productivity are: (1) Physical capital per worker: The stock of machinery, equipment, buildings, and infrastructure available to each worker. More capital allows workers to produce more. Capital is produced through investment and is subject to diminishing returns. (2) Human capital per worker: The knowledge, skills, and health that workers possess, acquired through education, training, and experience. Human capital increases workers' ability to produce. (3) Technological knowledge: Society's understanding of the best ways to produce goods and services. Technology determines how effectively inputs are transformed into outputs. Technological progress is the main driver of sustained productivity growth. (4) Natural resources per worker: Land, energy, and raw materials available. Natural resources can boost productivity but are not necessary for high productivity (e.g., Japan and Switzerland have high productivity despite few natural resources). (5) Institutional factors: Property rights, rule of law, efficient regulation, and competitive markets affect the incentives to invest, innovate, and use resources efficiently. Productivity growth comes from increases in capital per worker (capital deepening), improvements in labor quality (human capital), and technological progress. The growth rate of productivity determines the growth rate of living standards over the long run. Productivity can be measured at the level of the firm, industry, or entire economy. Common measures include labor productivity (output per worker or per hour) and total factor productivity (output per unit of combined inputs). Understanding productivity is essential for analyzing economic growth, competitiveness, and the effects of policy.",
    
    "explanation": "Think of productivity as how much a worker can produce in an hour. A worker with better tools (physical capital), more skills (human capital), and better methods (technology) will produce more. That's why workers in rich countries produce so much more than workers in poor countries—they have more capital, more skills, and better technology. Raising productivity is the only way to sustainably raise living standards. It's like making the economic pie larger so everyone can have a bigger slice.",
    
    "image": {
      "src": "images/unit12/productivity_overview.png",
      "alt": "Diagram showing determinants of productivity: physical capital, human capital, technology, and institutions",
      "caption": "Figure 12.3.1: Productivity is determined by physical capital per worker, human capital per worker, technology, and institutions."
    }
  },

  "sections": [
    {
      "section_title": "12.3 Productivity",
      "introduction": "Why are some countries rich and others poor? The answer, ultimately, is productivity. Workers in rich countries produce more per hour than workers in poor countries. Understanding what determines productivity—and how to increase it—is the key to understanding economic growth and living standards. In this section, we'll explore the concept of productivity, its determinants, how it's measured, and what drives productivity growth over time.",
      
      "introduction_image": {
        "src": "images/unit12/productivity_intro.png",
        "alt": "Graph showing GDP per capita vs productivity across countries",
        "caption": "Figure 12.3.2: Productivity and living standards are closely linked. Countries with higher productivity have higher incomes."
      },
      
      "key_concept": {
        "definition": "Productivity is the amount of goods and services produced per unit of input. The most commonly used measure is labor productivity: output per worker or output per hour worked. Labor productivity is a key determinant of living standards because a country's income per person is approximately equal to its output per person. The production function relates output to inputs: $Y = A \\cdot F(K, L, H, N)$, where $Y$ is output, $K$ is physical capital, $L$ is labor, $H$ is human capital, $N$ is natural resources, and $A$ is technology. Labor productivity ($Y/L$) depends on capital per worker ($K/L$), human capital per worker ($H/L$), natural resources per worker ($N/L$), and technology ($A$). The key determinants of productivity are: (1) Physical capital per worker: More and better machinery, equipment, and infrastructure allow each worker to produce more. Capital is accumulated through investment and is subject to diminishing returns. (2) Human capital per worker: The knowledge, skills, and health that workers bring to their jobs. Human capital is accumulated through education, training, and experience. (3) Technological knowledge: Society's understanding of how to produce goods and services. Technology determines how effectively inputs are transformed into outputs. Technological progress is the main driver of sustained productivity growth. (4) Natural resources per worker: Land, energy, and raw materials. Natural resources can boost productivity but are not necessary for high productivity. (5) Institutions and policies: The legal, regulatory, and economic environment affects incentives to invest, innovate, and use resources efficiently. Productivity growth comes from capital deepening (increasing capital per worker), improvements in labor quality, and technological progress. Productivity can be measured at the firm, industry, or economy level. Labor productivity is calculated as real GDP divided by total hours worked or number of workers. Total factor productivity (TFP) measures output per unit of combined inputs, capturing the effects of technology and efficiency. Productivity growth is the key to rising living standards over time.",
        
        "context": "The study of productivity has been central to economics since Adam Smith's analysis of the division of labor. In the 20th century, growth accounting and the Solow model formalized the role of productivity. The productivity slowdown of the 1970s and the resurgence in the 1990s (driven by information technology) have been major research topics. In AP Macroeconomics, understanding productivity is essential for analyzing growth, competitiveness, and living standards.",
        
        "image": {
          "src": "images/unit12/productivity_determinants.png",
          "alt": "Diagram showing determinants of productivity: capital per worker, human capital, technology, natural resources, institutions",
          "caption": "Figure 12.3.3: Productivity depends on physical capital per worker, human capital per worker, technology, natural resources, and institutions."
        }
      },

      "classifications": [
        {
          "type": "Physical Capital per Worker",
          "value": "Tools, machinery, equipment, infrastructure per worker",
          "characteristics": ["Produced through investment", "Subject to diminishing returns", "Requires saving", "Depreciates over time", "Complementary to labor"],
          "behavior": "Physical capital per worker is a key determinant of labor productivity. Workers with more and better tools can produce more. Capital is accumulated through investment, which must be financed by saving (domestic or foreign). Capital deepening—increasing capital per worker—raises productivity. However, capital is subject to diminishing returns: each additional unit of capital per worker adds less to output than the previous unit. This means that as an economy develops, the productivity gains from further capital deepening diminish. Capital also depreciates over time, requiring ongoing investment just to maintain the existing capital stock. The level of capital per worker varies enormously across countries, explaining much of the difference in productivity. For example, a worker with a modern computer, factory equipment, and good infrastructure will be far more productive than a worker with hand tools.",
          
          "image": {
            "src": "images/unit12/capital_per_worker.png",
            "alt": "Graph showing relationship between capital per worker and output per worker",
            "caption": "Figure 12.3.4: More capital per worker increases productivity, but with diminishing returns."
          },
          
          "examples": [
            {
              "process": "Factory automation",
              "explanation": "A factory worker with automated machinery can produce far more than one with hand tools. Investment in automation raises capital per worker and productivity."
            },
            {
              "process": "Infrastructure",
              "explanation": "Good roads, ports, and electricity supply raise productivity by reducing costs and enabling efficient production. This is public capital."
            }
          ]
        },
        {
          "type": "Human Capital per Worker",
          "value": "Skills, education, health of workers",
          "characteristics": ["Acquired through investment", "Less diminishing returns", "Spillover effects", "Complementary to technology", "Affects productivity directly"],
          "behavior": "Human capital per worker—the knowledge, skills, and health that workers possess—is a crucial determinant of productivity. More educated and skilled workers can perform complex tasks, adapt to new technologies, and solve problems more effectively. Better health reduces absenteeism and increases energy and cognitive function. Human capital is accumulated through investment in education, training, and healthcare. Unlike physical capital, human capital may not exhibit strong diminishing returns, and there can be increasing returns due to spillovers (educated workers make others more productive). Human capital also facilitates technological progress by enabling innovation and adoption of new technologies. Differences in human capital explain a significant portion of cross-country productivity differences. For example, a country with universal secondary education will have a more productive workforce than one where most workers are illiterate.",
          
          "image": {
            "src": "images/unit12/human_capital_productivity.png",
            "alt": "Graph showing relationship between education levels and productivity",
            "caption": "Figure 12.3.5: Human capital—education, skills, health—increases worker productivity and facilitates innovation."
          },
          
          "examples": [
            {
              "process": "Education and earnings",
              "explanation": "Workers with more education earn higher wages, reflecting their higher productivity. Each additional year of schooling typically raises earnings by 8-10%."
            },
            {
              "process": "Health and productivity",
              "explanation": "Healthier workers are more productive. Reductions in disease and malnutrition have contributed to productivity gains in developing countries."
            }
          ]
        },
        {
          "type": "Technological Knowledge",
          "value": "Society's understanding of production methods",
          "characteristics": ["Non-rival (can be used by many)", "Can have increasing returns", "Drives sustained growth", "Comes from R&D and learning", "Embodied in capital and people"],
          "behavior": "Technological knowledge is society's understanding of how to produce goods and services. It includes both process innovations (better ways to make things) and product innovations (new goods). Technology determines how effectively inputs are transformed into outputs. Unlike physical capital, technology is non-rival—many people and firms can use the same idea simultaneously without depleting it. This can lead to increasing returns and sustained growth. Technological progress shifts the production function upward, allowing more output from the same inputs. It is the main driver of long-run productivity growth. Technology comes from research and development, innovation, learning-by-doing, and diffusion of knowledge from abroad. It is influenced by incentives, institutions, and policies—such as patent protection, R&D subsidies, education, and openness to trade. Technology can be embodied in new capital goods (e.g., more efficient machines) or in people (knowledge and skills). Understanding technological progress is essential for understanding why productivity grows over time.",
          
          "image": {
            "src": "images/unit12/technology_productivity.png",
            "alt": "Production function shifting upward with technological progress",
            "caption": "Figure 12.3.6: Technological progress shifts the production function upward, increasing productivity from the same inputs."
          },
          
          "examples": [
            {
              "process": "Information technology",
              "explanation": "Computers, software, and the internet have dramatically increased productivity in many sectors by enabling faster communication, automation, and data analysis."
            },
            {
              "process": "Green Revolution",
              "explanation": "New crop varieties and farming techniques multiplied agricultural productivity, enabling more food to be produced from the same land."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Productivity Is the Fundamental Determinant of Living Standards",
          "statement": "The most important lesson of growth economics is that a country's living standards are determined by its productivity. A country can produce a high income per person only if its workers are highly productive. This is true across countries and over time. Differences in productivity explain most of the variation in income per capita across nations. Growth in productivity is what allows living standards to rise over time. Policies that raise productivity—investment in capital, education, technology, and good institutions—are the key to improving living standards. This insight focuses attention on the real determinants of prosperity rather than on monetary or demand-side factors, which affect short-run fluctuations but not long-run living standards.",
          "application": "When analyzing why some countries are rich and others poor, look at productivity. Countries with high productivity have high incomes. Policies that raise productivity are the most effective way to raise living standards over the long run.",
          "example": "In 2023, U.S. GDP per capita was about $\\$80,000$, while in India it was about $\\$2,500$. This difference is almost entirely explained by differences in productivity—U.S. workers produce far more per hour than Indian workers due to more capital, better education, and superior technology.",
          
          "image": {
            "src": "images/unit12/productivity_living_standards.png",
            "alt": "Scatter plot showing strong positive correlation between productivity and GDP per capita across countries",
            "caption": "Figure 12.3.7: Productivity and living standards are closely linked. Higher productivity means higher income per person."
          }
        },
        {
          "principle": "Capital Deepening Raises Productivity but Encounters Diminishing Returns",
          "statement": "Capital deepening—increasing the amount of capital per worker—raises labor productivity. A worker with more machinery, better equipment, and superior infrastructure can produce more. This is why investment is crucial for growth. However, capital is subject to diminishing returns: each additional unit of capital per worker adds less to output than the previous unit. This means that as an economy develops, the productivity gains from further capital deepening diminish. Eventually, in the absence of technological progress, capital deepening alone cannot sustain productivity growth. The economy reaches a steady state where new investment just offsets depreciation, and capital per worker stops growing. This is why technological progress is essential for sustained productivity growth.",
          "application": "When evaluating the potential for productivity growth, consider the current level of capital per worker. Poor countries with low capital can achieve rapid productivity gains through investment. Rich countries with high capital need technological progress to continue raising productivity.",
          "example": "South Korea's rapid growth was fueled in part by massive investment that raised capital per worker dramatically. As it approached the technology frontier, its growth slowed, and it now relies more on innovation.",
          
          "image": {
            "src": "images/unit12/capital_deepening.png",
            "alt": "Graph showing diminishing returns to capital deepening",
            "caption": "Figure 12.3.8: Capital deepening raises productivity but with diminishing returns. Each additional unit of capital adds less than the previous one."
          }
        },
        {
          "principle": "Technological Progress Is the Key to Sustained Productivity Growth",
          "statement": "While capital deepening can raise productivity for a time, only technological progress can sustain productivity growth indefinitely. Technology shifts the production function upward, allowing more output from the same inputs. This offsets diminishing returns to capital. Technological progress comes from innovation, research and development, and the diffusion of new ideas. It is influenced by incentives, institutions, and policies. Countries that invest in education, protect intellectual property, support R&D, and foster competition tend to have faster technological progress. The rate of technological progress determines the long-run growth rate of productivity and living standards. This is why advanced economies focus so much on innovation and why policies that promote R&D and technology adoption are crucial for long-run growth.",
          "application": "When assessing long-run productivity prospects, focus on factors that influence technological progress: R&D spending, education, innovation policies, and openness to new ideas. These determine whether productivity growth can be sustained.",
          "example": "The U.S. productivity surge in the late 1990s and early 2000s was driven by technological progress in information technology—computers, software, and the internet. This raised productivity growth above its previous trend.",
          
          "image": {
            "src": "images/unit12/tech_progress_productivity.png",
            "alt": "Graph showing productivity growth with and without technological progress",
            "caption": "Figure 12.3.9: Technological progress sustains productivity growth by shifting the production function upward, offsetting diminishing returns."
          }
        },
        {
          "principle": "Human Capital Complements Physical Capital and Technology",
          "statement": "Human capital—the skills, knowledge, and health of workers—is not just another input; it complements physical capital and technology. Workers with more education and skills can use more complex machinery effectively, adapt to new technologies, and innovate. This complementarity means that investment in human capital raises the returns to physical capital and makes technological progress more effective. Conversely, lack of human capital can limit the benefits of investment and technology adoption. This is why countries with low education levels often struggle to grow, even when they invest in physical capital. Human capital also has spillover effects—educated workers make others around them more productive. Understanding these complementarities is essential for designing effective growth strategies.",
          "application": "When designing policies to raise productivity, consider the interactions. Investment in education should accompany investment in physical capital. Technology adoption requires skilled workers. A balanced approach that develops human capital alongside physical capital and technology is most effective.",
          "example": "Germany's strong vocational training system produces skilled workers who can operate advanced machinery effectively, complementing its high levels of physical capital and technology.",
          
          "image": {
            "src": "images/unit12/human_capital_complement.png",
            "alt": "Diagram showing complementarity between human capital, physical capital, and technology",
            "caption": "Figure 12.3.10: Human capital complements physical capital and technology. Skilled workers make better use of capital and innovation."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Labor Productivity",
          
          "image": {
            "src": "images/unit12/productivity_calc.png",
            "alt": "Table with GDP and employment data",
            "caption": "Figure 12.3.11: Calculate labor productivity from GDP and employment data."
          },
          
          "problem": "A country has real GDP of $\\$2$ trillion and total employment of 50 million workers. a) What is labor productivity (output per worker)? b) If employment rises to 52 million and GDP rises to $\\$2.2$ trillion, what is the new labor productivity? c) What was the growth rate of labor productivity? d) How much of the GDP growth was due to more workers, and how much to higher productivity? e) If hours worked per worker average 2,000 per year, what is output per hour?",
          
          "step_by_step": [
            {
              "step": "Initial productivity",
              "explanation": "Output per worker = GDP / workers = $2,000,000,000,000 / 50,000,000 = $40,000$ per worker."
            },
            {
              "step": "New productivity",
              "explanation": "New GDP = $2.2$ trillion, workers = 52 million. Productivity = $2,200,000,000,000 / 52,000,000 = $42,307.69$ per worker."
            },
            {
              "step": "Productivity growth rate",
              "explanation": "Growth = (42,307.69 - 40,000) / 40,000 × 100% = 2,307.69/40,000 × 100% = 5.77%."
            },
            {
              "step": "Decomposition of GDP growth",
              "explanation": "GDP growth = (2.2 - 2)/2 × 100% = 10%. Contribution from workers: (52-50)/50 × 100% = 4%. Contribution from productivity: 5.77% (accounts for 5.77 of the 10%, with rounding). So about 4% from more workers, 5.77% from higher productivity."
            },
            {
              "step": "Output per hour",
              "explanation": "Total hours = 50 million × 2000 = 100 billion hours. Output per hour = $2,000,000,000,000 / 100,000,000,000 = $20$ per hour."
            }
          ],
          
          "final_answer": "a) $\\$40,000$. b) $\\$42,308$. c) 5.77%. d) Workers 4%, productivity 5.77%. e) $\\$20$ per hour.",
          "concept_applied": "Labor productivity is output per worker or per hour. Growth comes from more workers or higher productivity."
        },
        {
          "title": "Growth Accounting with Human Capital",
          
          "image": {
            "src": "images/unit12/growth_accounting_human.png",
            "alt": "Table with growth rates",
            "caption": "Figure 12.3.12: Decompose output growth into contributions from capital, labor, human capital, and productivity."
          },
          
          "problem": "An economy's output grows at 5% per year. The capital stock grows at 4%, labor at 1%, and human capital (average years of schooling) grows at 0.5% per year. Capital's share is 0.3, labor's share is 0.6, and human capital's share is 0.1 (these sum to 1). a) What is the contribution of capital growth? b) What is the contribution of labor growth? c) What is the contribution of human capital growth? d) What is total factor productivity growth? e) Interpret the results.",
          
          "step_by_step": [
            {
              "step": "Capital contribution",
              "explanation": "Contribution = capital share × capital growth = 0.3 × 4% = 1.2%."
            },
            {
              "step": "Labor contribution",
              "explanation": "Contribution = labor share × labor growth = 0.6 × 1% = 0.6%."
            },
            {
              "step": "Human capital contribution",
              "explanation": "Contribution = human capital share × human capital growth = 0.1 × 0.5% = 0.05%."
            },
            {
              "step": "TFP growth",
              "explanation": "TFP growth = output growth - sum of contributions = 5% - (1.2% + 0.6% + 0.05%) = 5% - 1.85% = 3.15%."
            },
            {
              "step": "Interpretation",
              "explanation": "Most of the growth (3.15% of 5%) comes from productivity growth (technology and efficiency). Capital contributes 1.2%, labor 0.6%, and human capital 0.05%. This suggests a dynamic economy with strong technological progress."
            }
          ],
          
          "final_answer": "a) 1.2%. b) 0.6%. c) 0.05%. d) 3.15%. e) Productivity growth dominates, indicating technological progress.",
          "concept_applied": "Growth accounting decomposes output growth into contributions from inputs and productivity. Human capital is a separate input."
        },
        {
          "title": "Analyzing the Effects of Education on Productivity",
          
          "image": {
            "src": "images/unit12/education_productivity.png",
            "alt": "Graph showing returns to education",
            "caption": "Figure 12.3.13: Estimate the productivity gains from increased education."
          },
          
          "problem": "Studies show that each additional year of schooling raises a worker's earnings by about 8%, reflecting higher productivity. A country currently has an average of 10 years of schooling. It implements a policy to raise average schooling to 12 years over a decade. a) By what percentage would you expect worker productivity to increase? b) If the labor force is 50 million and GDP is $\\$2$ trillion, what is the initial GDP per worker? c) After the education increase, what would GDP per worker be, assuming no other changes? d) What would total GDP be? e) What are the costs of this policy, and how would you evaluate whether it's worthwhile?",
          
          "step_by_step": [
            {
              "step": "Productivity increase",
              "explanation": "Each additional year raises productivity 8%, so 2 years × 8% = 16% increase in productivity."
            },
            {
              "step": "Initial GDP per worker",
              "explanation": "GDP per worker = $2,000,000,000,000 / 50,000,000 = $40,000$."
            },
            {
              "step": "New GDP per worker",
              "explanation": "New GDP per worker = $40,000 × 1.16 = $46,400$."
            },
            {
              "step": "Total GDP",
              "explanation": "Total GDP = $46,400 × 50,000,000 = $2.32$ trillion."
            },
            {
              "step": "Cost-benefit",
              "explanation": "Costs include education spending, students' foregone earnings during schooling, and implementation costs. Benefits are the permanent increase in GDP ($\\$320$ billion annually). A cost-benefit analysis would compare the present value of benefits to costs. Typically, education has high returns, so the policy is likely worthwhile."
            }
          ],
          
          "final_answer": "a) 16%. b) $\\$40,000$. c) $\\$46,400$. d) $\\$2.32$ trillion. e) Benefits likely exceed costs; education has high returns.",
          "concept_applied": "Investment in human capital raises productivity and GDP. Cost-benefit analysis is needed to evaluate policies."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Inputs Combined in Production",
          "description": "Workers use physical capital, human capital, and technology to produce output.",
          "mechanism": "Production function $Y = A \\cdot F(K, L, H)$ transforms inputs into output. More or better inputs increase output.",
          "result": "Output produced.",
          
          "image": {
            "src": "images/unit12/prod_step1.png",
            "alt": "Factory with workers, machines, and output",
            "caption": "Figure 12.3.14: Step 1 - Workers use capital, skills, and technology to produce output."
          }
        },
        {
          "step": 2,
          "process": "Productivity Measured",
          "description": "Productivity is calculated as output per worker or per hour.",
          "mechanism": "Labor productivity = GDP / total workers or GDP / total hours. Used to compare across time and countries.",
          "result": "Productivity level determined.",
          
          "image": {
            "src": "images/unit12/prod_step2.png",
            "alt": "Calculator showing GDP divided by workers",
            "caption": "Figure 12.3.15: Step 2 - Productivity is measured as output per worker or per hour."
          }
        },
        {
          "step": 3,
          "process": "Investment Increases Capital per Worker",
          "description": "Saving and investment increase the capital stock, raising capital per worker.",
          "mechanism": "Capital deepening: more machinery, equipment, infrastructure per worker raises productivity, but with diminishing returns.",
          "result": "Higher productivity from capital deepening.",
          
          "image": {
            "src": "images/unit12/prod_step3.png",
            "alt": "Graph showing capital per worker increasing",
            "caption": "Figure 12.3.16: Step 3 - Investment increases capital per worker, raising productivity (diminishing returns)."
          }
        },
        {
          "step": 4,
          "process": "Education and Training Improve Human Capital",
          "description": "Investment in education, training, and health increases worker skills and productivity.",
          "mechanism": "Human capital accumulation raises labor quality, enabling workers to produce more and use technology better.",
          "result": "Higher productivity from human capital.",
          
          "image": {
            "src": "images/unit12/prod_step4.png",
            "alt": "Worker in training, graduation cap",
            "caption": "Figure 12.3.17: Step 4 - Education and training improve human capital, raising productivity."
          }
        },
        {
          "step": 5,
          "process": "Technological Progress Shifts Production Frontier",
          "description": "Innovation and R&D improve technology, allowing more output from same inputs.",
          "mechanism": "Technological progress shifts production function upward, enabling sustained productivity growth.",
          "result": "Sustained productivity growth.",
          
          "image": {
            "src": "images/unit12/prod_step5.png",
            "alt": "Production function shifting upward",
            "caption": "Figure 12.3.18: Step 5 - Technological progress shifts the production frontier, sustaining productivity growth."
          }
        }
      ],

      "image": {
        "src": "images/unit12/productivity_summary.png",
        "alt": "Comprehensive summary diagram of productivity: determinants, measurement, growth sources, and policy implications",
        "caption": "Figure 12.3.19: Productivity summary - determinants, measurement, and sources of growth."
      }
    }
  ],

  "key_terms": [
    "Productivity",
    "Labor productivity",
    "Output per worker",
    "Output per hour",
    "Total factor productivity (TFP)",
    "Production function",
    "Physical capital",
    "Capital per worker",
    "Capital deepening",
    "Capital widening",
    "Diminishing returns",
    "Marginal product",
    "Human capital",
    "Education",
    "Training",
    "Skills",
    "Health",
    "Technological knowledge",
    "Technology",
    "Innovation",
    "Research and development",
    "Process innovation",
    "Product innovation",
    "Learning by doing",
    "Spillovers",
    "Knowledge spillovers",
    "Increasing returns",
    "Scale economies",
    "Natural resources",
    "Land",
    "Resource curse",
    "Institutions",
    "Property rights",
    "Rule of law",
    "Efficiency",
    "X-efficiency",
    "Technical efficiency",
    "Allocative efficiency",
    "Growth accounting",
    "Solow residual",
    "Capital share",
    "Labor share",
    "Human capital share",
    "Convergence",
    "Catch-up growth",
    "Technology frontier",
    "Leading edge",
    "Diffusion",
    "Technology transfer",
    "Absorptive capacity",
    "Complementarity",
    "Capital-skill complementarity",
    "Skill-biased technical change"
  ],

  "summary": "Productivity—output per worker or per hour worked—is the fundamental determinant of living standards. Countries with high productivity have high incomes; productivity growth allows living standards to rise over time. The key determinants of productivity are: (1) Physical capital per worker: The stock of machinery, equipment, and infrastructure available to each worker. More capital allows workers to produce more, but capital is subject to diminishing returns. (2) Human capital per worker: The knowledge, skills, and health that workers possess, acquired through education, training, and experience. Human capital increases productivity and complements physical capital and technology. (3) Technological knowledge: Society's understanding of how to produce goods and services. Technology determines how effectively inputs are transformed into outputs. Technological progress is the main driver of sustained productivity growth. (4) Natural resources per worker: Land, energy, and raw materials can boost productivity but are not necessary for high productivity. (5) Institutions and policies: Property rights, rule of law, efficient regulation, and competitive markets affect incentives to invest, innovate, and use resources efficiently. Productivity growth comes from capital deepening (increasing capital per worker), improvements in labor quality (human capital), and technological progress. The production function $Y = A \\cdot F(K, L, H)$ relates output to inputs and technology. Labor productivity is measured as real GDP divided by total workers or total hours. Total factor productivity (TFP) measures output per unit of combined inputs, capturing the effects of technology and efficiency. Growth accounting decomposes output growth into contributions from capital, labor, human capital, and TFP. The Solow model shows that without technological progress, capital deepening eventually encounters diminishing returns and productivity growth stops. Therefore, technological progress is essential for sustained productivity growth. Human capital complements physical capital and technology, making investment in education crucial. Understanding productivity is essential for analyzing economic growth, competitiveness, and the effects of policy on living standards."
}
