{
  "expanded_description": "How are interest rates determined? What makes them rise or fall? The answer lies in the money market—the interaction between the supply of money and the demand for money. Just as the price of apples is determined by supply and demand in the apple market, the price of money—the interest rate—is determined by supply and demand in the money market. Understanding this market is essential for understanding how monetary policy works. When the central bank changes the money supply, it affects interest rates, which then affect spending, output, and inflation. In this section, we'll explore the money market: what money demand is and why it slopes downward, what money supply is and why it's vertical, how equilibrium is reached, and how changes in supply or demand affect interest rates. This framework is the foundation for analyzing monetary policy.",
  
  "core_concept": {
    "principle": "The money market is the interaction between the demand for money and the supply of money that determines the equilibrium interest rate. The supply of money (Ms) is controlled by the central bank. In the money market diagram, it is drawn as a vertical line because the central bank can set the money supply at a fixed level independent of the interest rate. The demand for money (Md) is the amount of wealth that households and businesses want to hold as money (cash and checking deposits) rather than as interest-bearing assets like bonds. Money demand slopes downward because the opportunity cost of holding money is the interest rate—when interest rates are high, people hold less money (they prefer interest-bearing assets); when interest rates are low, they hold more money. The equilibrium interest rate is determined where money supply equals money demand. At this rate, the quantity of money people want to hold exactly equals the quantity the central bank has supplied. If the interest rate is above equilibrium, there is excess supply of money—people hold more money than they want, so they buy bonds, driving bond prices up and interest rates down. If the interest rate is below equilibrium, there is excess demand for money—people want more money than they have, so they sell bonds, driving bond prices down and interest rates up. The money market is linked to the bond market: when people buy bonds, they reduce their money holdings; when they sell bonds, they increase their money holdings. The key insight is that the central bank can influence interest rates by changing the money supply. An increase in money supply shifts the vertical Ms curve right, creating excess supply at the original interest rate. People buy bonds with their excess money, driving bond prices up and interest rates down until a new equilibrium at a lower rate. A decrease in money supply shifts Ms left, creating excess demand, leading to bond sales, lower bond prices, and higher interest rates. This is how monetary policy works through the money market.",
    
    "explanation": "Think of money as just another asset you can hold. You have a certain amount of wealth. You can hold it as money (cash, checking account) which is liquid but earns little or no interest. Or you can hold it as bonds (or other interest-bearing assets) which earn interest but are less liquid. The interest rate is the opportunity cost of holding money—what you give up by not holding bonds. When interest rates are high, you want to hold more bonds and less money. When rates are low, the cost of holding money is low, so you hold more money. This is money demand. The central bank decides how much money is in the economy—that's money supply. The interest rate adjusts to balance the two. If the central bank prints more money (increases supply), people have more money than they want at the current rate. They buy bonds with the excess, which pushes bond prices up and interest rates down. That's expansionary policy. If the central bank reduces the money supply, people have less money than they want, so they sell bonds to get money, pushing bond prices down and interest rates up. That's contractionary policy.",
    
    "image": {
      "src": "images/unit7/money_market_overview.png",
      "alt": "Money market graph with downward-sloping money demand curve and vertical money supply curve, equilibrium at interest rate i*",
      "caption": "Figure 7.1.1: The money market determines the equilibrium interest rate where money supply equals money demand."
    }
  },

  "sections": [
    {
      "section_title": "7.1 The Money Market",
      "introduction": "Interest rates are among the most important prices in the economy. They affect borrowing costs for homes and cars, returns on savings, business investment decisions, and exchange rates. But what determines interest rates? The answer lies in the money market—the supply and demand for money. In this section, we'll explore the components of the money market, why money demand slopes downward, why money supply is vertical, how equilibrium is established, and how changes in supply or demand affect interest rates. This framework is essential for understanding how monetary policy influences the economy.",
      
      "introduction_image": {
        "src": "images/unit7/money_market_intro.png",
        "alt": "Graph showing money demand and money supply curves with equilibrium labeled",
        "caption": "Figure 7.1.2: The money market model shows how interest rates are determined by supply and demand for money."
      },
      
      "key_concept": {
        "definition": "The money market is a model of the interaction between the demand for money and the supply of money that determines the equilibrium nominal interest rate. Money supply (Ms) is the total stock of money in the economy. In the money market diagram, the money supply curve is vertical because the central bank can set the money supply at a fixed level independent of the interest rate. The central bank controls the money supply through its policy tools—open market operations, reserve requirements, and the discount rate. Money demand (Md) is the amount of wealth that households and firms choose to hold as money (cash and checking deposits) rather than as other assets like bonds, stocks, or real estate. The demand for money is a decision about portfolio allocation. The key determinant of money demand is the interest rate. The interest rate is the opportunity cost of holding money—if you hold money, you forgo the interest you could earn by holding bonds. Therefore, money demand is negatively related to the interest rate: when interest rates are high, the opportunity cost of holding money is high, so people hold less money; when interest rates are low, the opportunity cost is low, so people hold more money. This relationship is shown as a downward-sloping money demand curve. Other factors that affect money demand include the price level (higher prices mean people need more money for transactions), real income (higher income means more transactions, so higher money demand), and payment technology (ATMs, credit cards, digital payments can reduce money demand). The equilibrium interest rate is determined where money supply equals money demand: Ms = Md. At this interest rate, the quantity of money people want to hold exactly equals the quantity the central bank has supplied. If the interest rate is above equilibrium, there is an excess supply of money—people are holding more money than they want at that high rate. They will use their excess money to buy bonds, increasing bond prices. Since bond prices and interest rates move inversely (when bond prices go up, interest rates go down), this pushes the interest rate down toward equilibrium. If the interest rate is below equilibrium, there is excess demand for money—people want to hold more money than they have. They will sell bonds to get money, decreasing bond prices and pushing interest rates up toward equilibrium. The money market is closely linked to the bond market through this adjustment mechanism.",
        
        "context": "The money market model was developed as part of Keynesian economics. Keynes introduced the concept of liquidity preference—the desire to hold money—as a theory of interest rate determination. The model has been refined over time and remains a fundamental tool for analyzing monetary policy. Central banks use this framework to understand how changes in the money supply affect interest rates, and how those interest rate changes then affect aggregate demand. In AP Macroeconomics, the money market is essential for understanding monetary policy transmission and is frequently tested on the exam.",
        
        "image": {
          "src": "images/unit7/money_market_equilibrium.png",
          "alt": "Money market graph showing equilibrium at intersection of Md and Ms, with arrows showing adjustment above and below equilibrium",
          "caption": "Figure 7.1.3: Equilibrium in the money market occurs where money supply equals money demand. Above equilibrium, excess supply pushes rates down; below equilibrium, excess demand pushes rates up."
        }
      },

      "classifications": [
        {
          "type": "Money Supply",
          "value": "The total stock of money in the economy",
          "characteristics": ["Controlled by central bank", "Vertical in money market graph", "Independent of interest rate", "Can be increased or decreased", "Measured as M1 or M2"],
          "behavior": "The money supply is determined by the central bank's policy decisions. In the money market diagram, it is represented as a vertical line because the central bank sets the quantity of money, and this quantity does not depend on the interest rate. The central bank can increase the money supply through open market purchases (buying government bonds, paying with new reserves), which shifts the Ms curve to the right. It can decrease the money supply through open market sales (selling bonds, draining reserves), which shifts the Ms curve to the left. Changes in reserve requirements or the discount rate can also affect the money supply, though open market operations are the primary tool. The money supply is a stock variable—it is measured at a point in time. In the U.S., M1 (currency + checking deposits) and M2 (M1 + savings deposits, small time deposits, money market mutual funds) are common measures.",
          
          "image": {
            "src": "images/unit7/money_supply.png",
            "alt": "Money market graph showing vertical money supply curve shifting right and left",
            "caption": "Figure 7.1.4: Money supply is vertical (set by central bank). Open market purchases shift Ms right; sales shift Ms left."
          },
          
          "examples": [
            {
              "process": "Open market purchase",
              "explanation": "The Fed buys $\\$10$ billion in bonds from banks. It pays by crediting reserve accounts, increasing the money supply. In the money market, Ms shifts right, lowering interest rates."
            },
            {
              "process": "Open market sale",
              "explanation": "The Fed sells $\\$5$ billion in bonds to banks. It debits reserve accounts, decreasing the money supply. Ms shifts left, raising interest rates."
            }
          ]
        },
        {
          "type": "Money Demand",
          "value": "The amount of wealth people want to hold as money",
          "characteristics": ["Downward sloping", "Determined by interest rate", "Affected by price level", "Affected by real income", "Affected by payment technology"],
          "behavior": "Money demand reflects the portfolio choice between money (liquid but low or zero return) and interest-bearing assets (less liquid but positive return). The interest rate is the opportunity cost of holding money—the return you give up by not holding bonds. Therefore, money demand is negatively related to the interest rate: higher rates reduce money demand; lower rates increase it. This is why the money demand curve slopes downward. Money demand also depends on the price level: higher prices mean you need more money for transactions, so money demand increases. It depends on real income: higher income means more transactions, so money demand increases. It depends on payment technology: ATMs, credit cards, and digital payments can reduce the need to hold money, shifting money demand left. Changes in these factors shift the money demand curve. For example, during the holiday season, money demand increases as people need more cash for shopping, shifting Md right and putting upward pressure on interest rates.",
          
          "image": {
            "src": "images/unit7/money_demand.png",
            "alt": "Money market graph showing downward-sloping money demand curve shifting right and left",
            "caption": "Figure 7.1.5: Money demand slopes downward (higher rates, lower demand). Changes in income, prices, or technology shift the curve."
          },
          
          "examples": [
            {
              "process": "Income increase",
              "explanation": "GDP grows, so people have higher incomes and make more transactions. Money demand increases, shifting Md right. At the initial money supply, this raises interest rates."
            },
            {
              "process": "Payment innovation",
              "explanation": "Widespread adoption of credit cards reduces the need to hold cash. Money demand decreases, shifting Md left, lowering interest rates."
            }
          ]
        },
        {
          "type": "Equilibrium Interest Rate",
          "value": "The interest rate where money supply equals money demand",
          "characteristics": ["Determined in money market", "Clears the market", "Adjusts to eliminate excess supply/demand", "Linked to bond prices", "Target of monetary policy"],
          "behavior": "The equilibrium interest rate is found at the intersection of the money supply and money demand curves. At this rate, the quantity of money people want to hold exactly equals the quantity the central bank has supplied. If the interest rate is above equilibrium, there is excess supply of money—people have more money than they want at that high rate. They will use the excess money to buy bonds, increasing bond prices. Since bond prices and interest rates are inversely related, this pushes interest rates down toward equilibrium. If the interest rate is below equilibrium, there is excess demand for money—people want more money than they have. They will sell bonds to obtain money, decreasing bond prices and pushing interest rates up toward equilibrium. This adjustment mechanism ensures that the money market is always tending toward equilibrium. The equilibrium interest rate is not fixed—it changes when either money supply or money demand shifts. Central banks target specific interest rates (like the federal funds rate) by adjusting the money supply to achieve desired rates.",
          
          "image": {
            "src": "images/unit7/equilibrium_rate.png",
            "alt": "Money market graph showing equilibrium at intersection, with arrows showing adjustment",
            "caption": "Figure 7.1.6: Equilibrium interest rate is where Ms = Md. Excess supply pushes rates down; excess demand pushes rates up."
          },
          
          "examples": [
            {
              "process": "Fed lowers target rate",
              "explanation": "The FOMC decides to lower the federal funds target. The New York Fed conducts open market purchases, increasing money supply. Ms shifts right, lowering the equilibrium interest rate to the new target."
            },
            {
              "process": "Seasonal demand shift",
              "explanation": "Around Christmas, money demand increases (more transactions). This shifts Md right, raising equilibrium interest rates. The Fed may accommodate by increasing money supply to keep rates stable."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Interest Rate Is the Opportunity Cost of Holding Money",
          "statement": "Money earns little or no interest. Bonds and other interest-bearing assets do. When you hold money, you give up the interest you could have earned by holding bonds. This forgone interest is the opportunity cost of holding money. The higher the interest rate, the greater the opportunity cost, so the less money people want to hold. This negative relationship is why the money demand curve slopes downward. Understanding this opportunity cost is essential for understanding why people make trade-offs between money and other assets, and why interest rates affect money demand.",
          "application": "When analyzing why money demand changes, always consider the interest rate. A rise in rates makes money less attractive, reducing money demand. A fall in rates makes money more attractive, increasing money demand. This is the primary mechanism through which monetary policy affects the economy.",
          "example": "If bond yields rise from 2% to 5%, the cost of holding cash has increased substantially. People will shift some of their wealth from checking accounts (low interest) to bonds, reducing money demand. Conversely, if rates fall to near zero, the opportunity cost is minimal, and people may hold more money.",
          
          "image": {
            "src": "images/unit7/opportunity_cost.png",
            "alt": "Balance scale comparing money (no interest) and bonds (positive interest)",
            "caption": "Figure 7.1.7: The interest rate is the opportunity cost of holding money—the return you give up by not holding bonds."
          }
        },
        {
          "principle": "The Central Bank Controls the Money Supply",
          "statement": "In the money market model, the money supply is exogenous—determined by the central bank, not by economic conditions. The central bank can increase the money supply by buying government securities (open market purchases), which injects reserves into the banking system and allows banks to create more money through lending. It can decrease the money supply by selling securities (open market sales), draining reserves and reducing the money supply. This control over the money supply gives the central bank power to influence interest rates. By shifting the vertical money supply curve, the central bank can move the equilibrium interest rate up or down. This is the essence of monetary policy.",
          "application": "When analyzing monetary policy in the money market, focus on shifts in the money supply curve. An open market purchase shifts Ms right, lowering interest rates. An open market sale shifts Ms left, raising interest rates. The magnitude of the shift depends on the size of the operation and the money multiplier.",
          "example": "To fight a recession, the Fed buys bonds. This increases the money supply, shifting Ms right. The new equilibrium has a lower interest rate, which will stimulate borrowing and spending. To fight inflation, the Fed sells bonds, decreasing money supply, shifting Ms left, raising interest rates.",
          
          "image": {
            "src": "images/unit7/cb_control.png",
            "alt": "Central bank with levers controlling money supply, graph showing Ms shifts",
            "caption": "Figure 7.1.8: The central bank controls the money supply. Open market purchases shift Ms right; sales shift Ms left."
          }
        },
        {
          "principle": "Money Market Equilibrium Links to Bond Prices",
          "statement": "The money market and the bond market are two sides of the same coin. When people have excess money (money supply > money demand), they buy bonds, increasing bond demand, which raises bond prices. Since bond prices and interest rates are inversely related, higher bond prices mean lower interest rates. When people have insufficient money (money demand > money supply), they sell bonds, increasing bond supply, which lowers bond prices and raises interest rates. This inverse relationship between bond prices and interest rates is crucial: bond prices fall when interest rates rise, and rise when interest rates fall. Understanding this link helps explain how monetary policy transmits to financial markets.",
          "application": "When the Fed increases money supply, expect bond prices to rise and interest rates to fall. When the Fed decreases money supply, expect bond prices to fall and interest rates to rise. This relationship is immediate and observable in financial markets.",
          "example": "When the Fed announces a large bond-buying program (quantitative easing), bond prices surge and long-term interest rates fall. This is exactly what the money market model predicts: increased money supply leads people to buy bonds, pushing prices up and rates down.",
          
          "image": {
            "src": "images/unit7/bond_price_link.png",
            "alt": "Diagram linking excess money to bond buying to higher bond prices to lower interest rates",
            "caption": "Figure 7.1.9: Money market equilibrium links to bond prices. Excess money leads to bond buying, raising bond prices and lowering rates."
          }
        },
        {
          "principle": "Changes in Money Demand Affect Interest Rates",
          "statement": "While the central bank controls money supply, money demand can also shift due to changes in the price level, real income, or payment technology. An increase in money demand (shift right) at a given money supply creates excess demand for money, leading people to sell bonds, which lowers bond prices and raises interest rates. A decrease in money demand (shift left) creates excess supply, leading to bond buying, which raises bond prices and lowers interest rates. These shifts in money demand mean that the central bank may need to adjust money supply to keep interest rates at target. For example, if money demand increases seasonally (holiday shopping), the Fed may increase money supply to accommodate it and prevent rates from rising.",
          "application": "When analyzing interest rate changes, consider whether they come from money supply shifts (policy) or money demand shifts (economic conditions). A rise in rates could be due to contractionary policy (Ms left) or increased money demand (Md right). Distinguishing them is important for understanding the cause.",
          "example": "During the pandemic, money demand increased as people held more cash for precautionary reasons and because spending opportunities were limited. This shift in Md right put upward pressure on rates, but the Fed's massive increase in Ms more than offset it, keeping rates low.",
          
          "image": {
            "src": "images/unit7/md_shifts.png",
            "alt": "Money market graph showing Md shift right (higher rates) and left (lower rates)",
            "caption": "Figure 7.1.10: Changes in money demand shift the Md curve. Right shift raises rates; left shift lowers rates."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Finding Equilibrium Interest Rate",
          
          "image": {
            "src": "images/unit7/equilibrium_example.png",
            "alt": "Money market graph with money demand schedule",
            "caption": "Figure 7.1.11: Use the money demand schedule to find equilibrium."
          },
          
          "problem": "The money demand schedule is as follows: At interest rate 2%, money demand = $\\$500$ billion; at 3%, money demand = $\\$450$ billion; at 4%, money demand = $\\$400$ billion; at 5%, money demand = $\\$350$ billion. The money supply is set by the central bank at $\\$400$ billion. a) What is the equilibrium interest rate? b) If the central bank increases money supply to $\\$450$ billion, what happens to the equilibrium rate? c) If instead money demand increases by $\\$50$ billion at each interest rate, what happens to the equilibrium rate (with original Ms = $\\$400$ billion)? d) Graph the original equilibrium and both changes.",
          
          "step_by_step": [
            {
              "step": "Find original equilibrium",
              "explanation": "Money supply = $\\$400$ billion. Looking at the schedule, money demand = $\\$400$ billion at 4% interest rate. So equilibrium rate = 4%."
            },
            {
              "step": "Increase money supply",
              "explanation": "New Ms = $\\$450$ billion. At original rate 4%, money demand is $\\$400$ billion, so there is excess supply of $\\$50$ billion. People buy bonds, pushing rates down. New equilibrium where Md = $\\$450$ billion. From schedule, Md = $\\$450$ at 3%. So new rate = 3%."
            },
            {
              "step": "Increase money demand",
              "explanation": "Md increases by $\\$50$ at each rate: at 5%: $\\$400$; 4%: $\\$450$; 3%: $\\$500$; 2%: $\\$550$. With Ms = $\\$400$, at original rate 4%, new Md = $\\$450$ > Ms, excess demand. People sell bonds, pushing rates up. New equilibrium where new Md = $\\$400$. From new schedule, that occurs at 5%. So new rate = 5%."
            },
            {
              "step": "Graph",
              "explanation": "Draw vertical Ms at $\\$400$ and downward-sloping Md. Equilibrium at 4%. For Ms increase, shift Ms right to $\\$450$, new equilibrium at 3%. For Md increase, shift Md right, new equilibrium at 5%."
            }
          ],
          
          "final_answer": "a) 4%. b) Falls to 3%. c) Rises to 5%. d) Graphs as described.",
          "concept_applied": "Equilibrium interest rate adjusts to equate money supply and money demand. Changes in either shift the equilibrium."
        },
        {
          "title": "Graphing Monetary Policy in the Money Market",
          
          "image": {
            "src": "images/unit7/money_market_policy.png",
            "alt": "Blank money market graphs for drawing policy effects",
            "caption": "Figure 7.1.12: Draw the effects of expansionary and contractionary policy."
          },
          
          "problem": "Draw two money market graphs. On the first, show an initial equilibrium at interest rate 5%. Then show the effect of expansionary monetary policy (open market purchase). Label the new equilibrium. On the second, show an initial equilibrium at 3%. Then show the effect of contractionary monetary policy (open market sale). Label the new equilibrium. Explain what happens to money supply, interest rates, and bond prices in each case.",
          
          "step_by_step": [
            {
              "step": "Draw first graph (expansionary)",
              "explanation": "Draw vertical Ms1 and downward-sloping Md intersecting at 5%. Label equilibrium E1 with interest rate 5% and money supply Q1."
            },
            {
              "step": "Show open market purchase",
              "explanation": "Open market purchase increases money supply. Draw new vertical Ms2 to the right of Ms1. At original rate 5%, there is excess supply of money. This leads to bond buying, which raises bond prices and lowers interest rates."
            },
            {
              "step": "Label new equilibrium",
              "explanation": "New intersection of Ms2 and Md at lower interest rate, say 3%. Label E2. Money supply higher, interest rate lower."
            },
            {
              "step": "Draw second graph (contractionary)",
              "explanation": "Draw vertical Ms1 and Md intersecting at 3%. Label E1 with rate 3%."
            },
            {
              "step": "Show open market sale",
              "explanation": "Open market sale decreases money supply. Draw new vertical Ms2 to the left of Ms1. At original rate 3%, there is excess demand for money. This leads to bond selling, which lowers bond prices and raises interest rates."
            },
            {
              "step": "Label new equilibrium",
              "explanation": "New intersection at higher interest rate, say 5%. Label E2. Money supply lower, interest rate higher."
            },
            {
              "step": "Explain bond prices",
              "explanation": "Expansionary policy: bond prices rise (inverse of interest rates). Contractionary policy: bond prices fall."
            }
          ],
          
          "final_answer": "Graphs drawn as described. Expansionary: Ms right, rates down, bond prices up. Contractionary: Ms left, rates up, bond prices down.",
          "concept_applied": "Monetary policy works by shifting money supply, which changes equilibrium interest rates and bond prices."
        },
        {
          "title": "Money Demand Shift Analysis",
          
          "image": {
            "src": "images/unit7/md_shift_analysis.png",
            "alt": "Money market graph with initial equilibrium and shift arrow",
            "caption": "Figure 7.1.13: Analyze the effects of money demand shifts."
          },
          
          "problem": "Suppose the economy is initially in equilibrium in the money market. For each scenario, determine whether money demand increases or decreases, and explain what happens to the equilibrium interest rate (assuming the central bank does not change money supply). a) Real GDP increases. b) The price level falls. c) Widespread adoption of mobile payment apps reduces the need for cash. d) It's the holiday season, and people need more cash for shopping. e) Interest rates on bonds rise, making bonds more attractive.",
          
          "step_by_step": [
            {
              "step": "Analyze scenario a",
              "explanation": "Real GDP increases → more transactions → money demand increases (Md right). At fixed Ms, this creates excess demand, leading to bond sales, lower bond prices, higher interest rates. Equilibrium rate rises."
            },
            {
              "step": "Analyze scenario b",
              "explanation": "Price level falls → people need less money for transactions → money demand decreases (Md left). Excess supply of money at original rate leads to bond buying, higher bond prices, lower interest rates. Equilibrium rate falls."
            },
            {
              "step": "Analyze scenario c",
              "explanation": "Mobile payment apps reduce need for cash → money demand decreases (Md left). Same as b: excess supply, bond buying, lower rates. Equilibrium rate falls."
            },
            {
              "step": "Analyze scenario d",
              "explanation": "Holiday shopping increases need for cash → money demand increases (Md right). Same as a: excess demand, bond sales, higher rates. Equilibrium rate rises."
            },
            {
              "step": "Analyze scenario e",
              "explanation": "Higher bond rates make bonds more attractive relative to money → people want to hold less money → money demand decreases (Md left). This shifts Md left, lowering equilibrium rates. Note: this is a movement along the curve, not a shift, if we're thinking about the interest rate itself. Actually, higher bond rates mean higher opportunity cost of money, so money demand decreases—this is a shift of the Md curve, not a movement along it. So Md left, rates fall further? Wait, careful: The scenario says interest rates on bonds rise. That means the opportunity cost of holding money has increased. At any given interest rate (the rate we're measuring in the money market), people will want to hold less money. So Md shifts left. This leads to a new equilibrium at a lower interest rate. So the initial rise in bond rates causes Md to shift, leading to a new equilibrium with lower money market rates. This shows the interdependence."
            }
          ],
          
          "final_answer": "a) Md ↑, rates ↑. b) Md ↓, rates ↓. c) Md ↓, rates ↓. d) Md ↑, rates ↑. e) Md ↓, rates ↓.",
          "concept_applied": "Changes in economic conditions shift money demand, affecting interest rates even without central bank action."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Central Bank Sets Money Supply",
          "description": "The central bank determines the money supply through open market operations, reserve requirements, and the discount rate.",
          "mechanism": "Open market purchases increase money supply; open market sales decrease it. The money supply is fixed at a point in time, shown as a vertical line in the money market graph.",
          "result": "Money supply curve Ms positioned at chosen quantity.",
          
          "image": {
            "src": "images/unit7/mm_step1.png",
            "alt": "Central bank with money supply lever, vertical Ms curve appearing",
            "caption": "Figure 7.1.14: Step 1 - Central bank sets the money supply, shown as a vertical line."
          }
        },
        {
          "step": 2,
          "process": "Households and Firms Determine Money Demand",
          "description": "Based on interest rates, prices, income, and payment technology, people decide how much money to hold.",
          "mechanism": "Higher interest rates reduce money demand (opportunity cost effect). Higher prices or income increase money demand. The relationship is shown as a downward-sloping money demand curve.",
          "result": "Money demand curve Md positioned.",
          
          "image": {
            "src": "images/unit7/mm_step2.png",
            "alt": "Households and firms deciding between money and bonds, downward-sloping Md curve",
            "caption": "Figure 7.1.15: Step 2 - Money demand is determined by interest rates, income, and prices."
          }
        },
        {
          "step": 3,
          "process": "Equilibrium Interest Rate Established",
          "description": "The interest rate adjusts until money supply equals money demand.",
          "mechanism": "At the intersection of Ms and Md, the quantity of money people want to hold equals the quantity supplied. If rates are too high, excess supply leads to bond buying, pushing rates down. If rates are too low, excess demand leads to bond selling, pushing rates up.",
          "result": "Equilibrium interest rate i* determined.",
          
          "image": {
            "src": "images/unit7/mm_step3.png",
            "alt": "Money market graph showing intersection of Ms and Md at equilibrium rate i*",
            "caption": "Figure 7.1.16: Step 3 - Equilibrium interest rate is where Ms = Md."
          }
        },
        {
          "step": 4,
          "process": "Central Bank Changes Money Supply",
          "description": "To implement monetary policy, the central bank changes the money supply through open market operations.",
          "mechanism": "Expansionary policy: open market purchase shifts Ms right. Contractionary policy: open market sale shifts Ms left.",
          "result": "Money supply curve shifts, changing equilibrium interest rate.",
          
          "image": {
            "src": "images/unit7/mm_step4.png",
            "alt": "Money market graph showing Ms shifting right (lower rates) and left (higher rates)",
            "caption": "Figure 7.1.17: Step 4 - Central bank shifts money supply to change interest rates."
          }
        },
        {
          "step": 5,
          "process": "New Equilibrium Affects Economy",
          "description": "The change in interest rates affects borrowing, spending, output, and inflation through the monetary policy transmission mechanism.",
          "mechanism": "Lower rates encourage borrowing and spending, increasing aggregate demand. Higher rates discourage borrowing and spending, reducing aggregate demand.",
          "result": "Economic activity responds to policy.",
          
          "image": {
            "src": "images/unit7/mm_step5.png",
            "alt": "Arrow from lower rates to increased spending to higher GDP, and from higher rates to decreased spending to lower inflation",
            "caption": "Figure 7.1.18: Step 5 - Interest rate changes affect the broader economy through spending decisions."
          }
        }
      ],

      "image": {
        "src": "images/unit7/money_market_summary.png",
        "alt": "Comprehensive summary diagram of money market: Ms, Md, equilibrium, shifts, and link to bond market",
        "caption": "Figure 7.1.19: Money market summary - money supply, money demand, equilibrium, and effects of policy."
      }
    }
  ],

  "key_terms": [
    "Money market",
    "Money supply",
    "Money demand",
    "Equilibrium interest rate",
    "Nominal interest rate",
    "Opportunity cost of holding money",
    "Liquidity preference",
    "Transactions demand",
    "Precautionary demand",
    "Speculative demand",
    "Portfolio allocation",
    "Bond prices",
    "Inverse relationship",
    "Excess supply of money",
    "Excess demand for money",
    "Open market purchase",
    "Open market sale",
    "Central bank",
    "Federal Reserve",
    "M1",
    "M2",
    "Price level",
    "Real income",
    "Payment technology",
    "Money demand shifters",
    "Money supply shifters",
    "Liquidity trap",
    "Zero lower bound",
    "Monetary policy",
    "Expansionary policy",
    "Contractionary policy"
  ],

  "summary": "The money market is the interaction between the supply of money and the demand for money that determines the equilibrium interest rate. Money supply (Ms) is controlled by the central bank and is represented as a vertical line in the money market graph because it is independent of the interest rate. The central bank can increase money supply through open market purchases (shifting Ms right) and decrease it through open market sales (shifting Ms left). Money demand (Md) is the amount of wealth households and firms want to hold as money rather than as interest-bearing assets like bonds. Money demand slopes downward because the interest rate is the opportunity cost of holding money—when interest rates are high, people hold less money; when rates are low, they hold more. Money demand also depends on the price level (higher prices increase demand), real income (higher income increases demand), and payment technology (innovations can reduce demand). The equilibrium interest rate is determined where money supply equals money demand: Ms = Md. At this rate, the quantity of money people want to hold exactly equals the quantity supplied. If the interest rate is above equilibrium, there is excess supply of money; people buy bonds, increasing bond prices and decreasing interest rates. If the rate is below equilibrium, there is excess demand; people sell bonds, decreasing bond prices and increasing interest rates. The money market is linked to the bond market through this inverse relationship between bond prices and interest rates. Monetary policy works through the money market: expansionary policy (increasing Ms) lowers interest rates; contractionary policy (decreasing Ms) raises interest rates. Changes in money demand also affect interest rates: increased Md raises rates; decreased Md lowers rates. Understanding the money market is essential for analyzing how central banks influence interest rates and how those interest rate changes affect the broader economy through borrowing, spending, and aggregate demand."
}
