{
  "expanded_description": "This section provides a comprehensive review of all topics covered in Unit 1: Foundations and Measurement. It synthesizes the key concepts, principles, and skills learned throughout the unit, preparing students for assessment and future application.",
  "core_concept": {
    "principle": "Unit 1 establishes the foundational knowledge and skills necessary for success in physics: understanding what physics is, mastering measurement systems, using scientific notation and significant figures, converting units, distinguishing scalars and vectors, interpreting graphs, practicing lab safety, and estimating orders of magnitude.",
    "explanation": "These foundations are not isolated topics - they work together. Good measurement requires proper tools (lab safety), correct units (SI system), appropriate precision (significant figures), and often estimation to check results. Graphs reveal patterns in data, while scalars and vectors describe physical quantities correctly.",
    "image": {
      "src": "images/unit1/unit1_review.png",
      "alt": "Concept map showing connections between all Unit 1 topics",
      "caption": "All Unit 1 topics interconnect to form the foundation of physics study"
    }
  },
  "sections": [
    {
      "section_title": "Unit 1 Topics Overview",
      "introduction": "Unit 1 covered ten sections that build the foundation for all future physics learning. Each topic contributes essential knowledge and skills.",
      "key_concept": {
        "definition": "The foundations of physics include understanding the nature of physics itself, measurement systems, mathematical tools, data analysis techniques, and laboratory practices.",
        "context": "Mastering these foundations ensures success in subsequent units on mechanics, energy, waves, electricity, and modern physics."
      },
      "classifications": [
        {
          "type": "Conceptual Foundations",
          "value": "What physics is and why we study it",
          "characteristics": [
            "Physics as fundamental science",
            "Branches of physics",
            "Relationship to other sciences"
          ],
          "behavior": "Physics seeks to discover fundamental laws governing matter, energy, space, and time. It provides the foundation for chemistry, biology, astronomy, and engineering. Understanding physics helps explain everyday phenomena and enables technological innovation.",
          "examples": [
            {
              "process": "1.1 What is Physics?",
              "explanation": "Introduced physics as the most fundamental science, its branches (mechanics, thermodynamics, electromagnetism, optics, modern physics), and its relationship to other sciences."
            }
          ]
        },
        {
          "type": "Measurement Foundations",
          "value": "SI units and measurement systems",
          "characteristics": [
            "Seven base units",
            "Derived units",
            "SI prefixes",
            "Standardization importance"
          ],
          "behavior": "The International System of Units (SI) provides a universal language for measurement. Seven base units (meter, kilogram, second, ampere, kelvin, mole, candela) are defined by fundamental physical constants. Derived units combine base units according to physical relationships. SI prefixes (kilo-, milli-, micro-, etc.) allow convenient expression of very large and very small quantities.",
          "examples": [
            {
              "process": "1.2 Measurement and SI Units",
              "explanation": "Covered the seven base units, derived units like newtons and joules, and SI prefixes from tera to pico."
            }
          ]
        },
        {
          "type": "Mathematical Tools",
          "value": "Scientific notation, significant figures, unit conversions",
          "characteristics": [
            "Expressing very large/small numbers",
            "Indicating measurement precision",
            "Converting between units",
            "Dimensional analysis"
          ],
          "behavior": "Scientific notation ($a \\times 10^n$) efficiently handles the enormous range of scales in physics. Significant figures communicate measurement precision and prevent false precision in calculations. Unit conversions using conversion factors and dimensional analysis ensure all quantities in a calculation have compatible units.",
          "examples": [
            {
              "process": "1.3 Scientific Notation and Significant Figures",
              "explanation": "Covered rules for writing numbers in scientific notation, identifying significant figures, and carrying them through calculations."
            },
            {
              "process": "1.4 Unit Conversions",
              "explanation": "Introduced conversion factors, dimensional analysis, and converting compound units including squared and cubed units."
            }
          ]
        },
        {
          "type": "Vector Foundations",
          "value": "Scalars, vectors, and vector addition",
          "characteristics": [
            "Scalars: magnitude only",
            "Vectors: magnitude and direction",
            "Vector components",
            "Graphical and mathematical addition"
          ],
          "behavior": "Scalars (mass, time, temperature, speed) are fully described by magnitude alone and add with ordinary arithmetic. Vectors (displacement, velocity, force, acceleration) require both magnitude and direction and add using special rules. Vectors can be broken into perpendicular components ($v_x = v \\cos \\theta$, $v_y = v \\sin \\theta$) for mathematical addition.",
          "examples": [
            {
              "process": "1.5 Scalars and Vectors",
              "explanation": "Distinguished between scalar and vector quantities with examples of each."
            },
            {
              "process": "1.6 Vector Addition Basics",
              "explanation": "Covered tip-to-tail graphical addition, component method, and finding resultants using $R = \\sqrt{R_x^2 + R_y^2}$ and $\\theta = \\tan^{-1}(R_y/R_x)$."
            }
          ]
        },
        {
          "type": "Data Analysis Foundations",
          "value": "Graphing, trends, and interpretation",
          "characteristics": [
            "Parts of a graph",
            "Independent vs. dependent variables",
            "Best-fit lines",
            "Interpreting trends"
          ],
          "behavior": "Graphs visually reveal relationships between variables. Independent variable goes on x-axis, dependent on y-axis. Best-fit lines show overall trends despite scatter. Trends can be linear (constant rate) or non-linear (changing rate). Proper graphing includes title, labeled axes with units, and appropriate scales.",
          "examples": [
            {
              "process": "1.7 Graphing and Data Analysis",
              "explanation": "Covered graph components, identifying linear vs. non-linear relationships, drawing best-fit lines, and interpreting trends."
            }
          ]
        },
        {
          "type": "Practical Foundations",
          "value": "Lab safety, equipment use, and estimation",
          "characteristics": [
            "Safety practices and PPE",
            "Proper measurement techniques",
            "Equipment care",
            "Estimation and orders of magnitude"
          ],
          "behavior": "Lab safety protects people and equipment through PPE, hazard awareness, and proper procedures. Correct equipment use requires specific techniques for each tool (rulers, balances, stopwatches, thermometers, glassware). Estimation provides quick approximations, sanity checks, and understanding of scale through orders of magnitude and Fermi problems.",
          "examples": [
            {
              "process": "1.8 Lab Safety and Equipment",
              "explanation": "Covered general safety, specific physics hazards (electrical, thermal, mechanical, optical), proper use of measurement tools, and common mistakes."
            },
            {
              "process": "1.9 Estimation and Orders of Magnitude",
              "explanation": "Introduced estimation techniques, orders of magnitude for length/mass/time scales, and Fermi problems as estimation tools."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit1/unit1_topics.png",
        "alt": "Visual summary of all ten Unit 1 topics with icons",
        "caption": "Unit 1 covers ten interconnected topics that build physics foundations"
      }
    },
    {
      "section_title": "Key Concepts Summary",
      "introduction": "This section summarizes the most important concepts from each topic in Unit 1, providing a quick reference for review.",
      "key_concept": {
        "definition": "Key concepts are the essential ideas that must be understood and remembered from each section.",
        "context": "These concepts form the foundation for all future physics learning and will be applied repeatedly throughout the course."
      },
      "principles": [
        {
          "principle": "1.1 What is Physics?",
          "statement": "Physics is the fundamental science that studies matter, energy, and their interactions, providing the foundation for all other sciences.",
          "application": "Understanding physics helps explain natural phenomena and enables technological innovation.",
          "example": "The same laws of motion govern both a baseball pitch and planetary orbits."
        },
        {
          "principle": "1.2 Measurement and SI Units",
          "statement": "The SI system provides seven base units (meter, kilogram, second, ampere, kelvin, mole, candela) from which all other units are derived.",
          "application": "All measurements in physics should be expressed in SI units or with appropriate SI prefixes for consistency.",
          "example": "$1 \\text{ N} = 1 \\text{ kg·m/s}^2$ combines base units of mass, length, and time."
        },
        {
          "principle": "1.3 Scientific Notation and Significant Figures",
          "statement": "Scientific notation expresses numbers as $a \\times 10^n$ with $1 \\leq a < 10$. Significant figures indicate measurement precision and determine how results should be rounded.",
          "application": "Use scientific notation for very large/small numbers. In multiplication/division, round to fewest sig figs; in addition/subtraction, round to fewest decimal places.",
          "example": "$0.00450$ has 3 sig figs; $4.50 \\times 10^{-3}$ in scientific notation."
        },
        {
          "principle": "1.4 Unit Conversions",
          "statement": "Unit conversions use conversion factors (equal to 1) to change units without changing value. Dimensional analysis treats units algebraically to ensure correct cancellation.",
          "application": "Arrange conversion factors so unwanted units cancel. For area/volume, square or cube the linear conversion factor.",
          "example": "$10 \\text{ m/s} \\times \\frac{1 \\text{ km}}{1000 \\text{ m}} \\times \\frac{3600 \\text{ s}}{1 \\text{ h}} = 36 \\text{ km/h}$"
        },
        {
          "principle": "1.5 Scalars and Vectors",
          "statement": "Scalars have magnitude only; vectors have both magnitude and direction.",
          "application": "Scalars (mass, time, temperature, speed) add with ordinary arithmetic. Vectors (displacement, velocity, force) require special addition considering direction.",
          "example": "Speed is scalar (60 km/h); velocity is vector (60 km/h north)."
        },
        {
          "principle": "1.6 Vector Addition Basics",
          "statement": "Vectors can be added graphically (tip-to-tail) or mathematically using components: $R_x = \\sum v_x$, $R_y = \\sum v_y$, $R = \\sqrt{R_x^2 + R_y^2}$, $\\theta = \\tan^{-1}(R_y/R_x)$.",
          "application": "Break each vector into x and y components using $v_x = v \\cos \\theta$, $v_y = v \\sin \\theta$. Add components separately, then find resultant.",
          "example": "$\\vec{A} = 3$ east, $\\vec{B} = 4$ north gives $R = 5$ at $53.1°$"
        },
        {
          "principle": "1.7 Graphing and Data Analysis",
          "statement": "Graphs visually reveal relationships between variables. Independent variable on x-axis, dependent on y-axis. Best-fit lines show overall trends despite scatter.",
          "application": "Linear graphs show constant rate of change; curved graphs show changing rate. Always include title, labeled axes with units, and appropriate scales.",
          "example": "Distance-time graph slope gives velocity; steeper slope means faster speed."
        },
        {
          "principle": "1.8 Lab Safety and Equipment",
          "statement": "Lab safety requires PPE, hazard awareness, and proper procedures. Each measurement tool requires specific techniques for accurate use.",
          "application": "Read at eye level to avoid parallax. Check for zero error. Take multiple trials and average. Clean and store equipment properly.",
          "example": "Read thermometer at eye level, bulb fully immersed, waiting for stabilization."
        },
        {
          "principle": "1.9 Estimation and Orders of Magnitude",
          "statement": "Estimation provides quick approximations using reasonable assumptions. Orders of magnitude ($10^n$) allow comparison across vast scales.",
          "application": "Use Fermi problems to break complex estimates into simple parts. Focus on powers of ten, not exact digits.",
          "example": "Human height: $10^0$ m; atom size: $10^{-10}$ m - 10 orders of magnitude difference."
        }
      ],
      "image": {
        "src": "images/unit1/key_concepts_summary.png",
        "alt": "Visual summary of key concepts from each section",
        "caption": "Master these key concepts from each section to build a strong physics foundation"
      }
    },
    {
      "section_title": "Important Formulas and Relationships",
      "introduction": "Unit 1 introduced several formulas and mathematical relationships that will be used throughout physics.",
      "key_concept": {
        "definition": "Formulas are mathematical expressions that describe relationships between physical quantities. Understanding when and how to use each formula is essential.",
        "context": "These formulas appear repeatedly in future units. Memorize them and practice applying them."
      },
      "classifications": [
        {
          "type": "Scientific Notation",
          "value": "Rules for operations",
          "characteristics": [
            "Multiplication: $(a \\times 10^m)(b \\times 10^n) = (a \\times b) \\times 10^{m+n}$",
            "Division: $(a \\times 10^m) \\div (b \\times 10^n) = (a \\div b) \\times 10^{m-n}$",
            "Addition/Subtraction: Convert to same exponent first"
          ],
          "behavior": "These rules follow from properties of exponents and place value. Multiplication adds exponents because $10^m \\times 10^n = 10^{m+n}$. Division subtracts exponents. Addition requires same exponent because you can only add like terms.",
          "examples": [
            {
              "process": "Multiplication",
              "explanation": "$(3 \\times 10^4) \\times (2 \\times 10^5) = 6 \\times 10^9$"
            },
            {
              "process": "Division",
              "explanation": "$(8 \\times 10^7) \\div (2 \\times 10^3) = 4 \\times 10^4$"
            },
            {
              "process": "Addition",
              "explanation": "$(5.2 \\times 10^5) + (3.7 \\times 10^4) = 5.57 \\times 10^5$"
            }
          ]
        },
        {
          "type": "Vector Components",
          "value": "Resolving vectors into components",
          "characteristics": [
            "$v_x = v \\cos \\theta$",
            "$v_y = v \\sin \\theta$",
            "$v = \\sqrt{v_x^2 + v_y^2}$",
            "$\\theta = \\tan^{-1}(v_y/v_x)$ (with quadrant adjustment)"
          ],
          "behavior": "These relationships come from right triangle trigonometry. Cosine gives adjacent side (x-component), sine gives opposite side (y-component). Pythagorean theorem gives magnitude from components. Inverse tangent gives angle, but quadrant must be checked.",
          "examples": [
            {
              "process": "Components from magnitude/angle",
              "explanation": "$v = 10 \\text{ m/s}$ at $30°$: $v_x = 10 \\cos 30° = 8.66$, $v_y = 10 \\sin 30° = 5$"
            },
            {
              "process": "Magnitude/angle from components",
              "explanation": "$v_x = 3$, $v_y = 4$: $v = \\sqrt{3^2 + 4^2} = 5$, $\\theta = \\tan^{-1}(4/3) = 53.1°$"
            }
          ]
        },
        {
          "type": "Unit Conversions",
          "value": "Conversion setup",
          "characteristics": [
            "Quantity $\\times$ conversion factor = new quantity",
            "Conversion factor = $\\frac{\\text{desired units}}{\\text{original units}}$",
            "For area/volume: $(\\text{conversion factor})^{\\text{power}}$"
          ],
          "behavior": "Conversion factors equal 1, so multiplying doesn't change the physical value. Units cancel algebraically. For squared or cubed units, the linear conversion factor must be raised to the appropriate power.",
          "examples": [
            {
              "process": "Simple conversion",
              "explanation": "$5 \\text{ km} \\times \\frac{1000 \\text{ m}}{1 \\text{ km}} = 5000 \\text{ m}$"
            },
            {
              "process": "Area conversion",
              "explanation": "$2 \\text{ m}^2 \\times \\left(\\frac{100 \\text{ cm}}{1 \\text{ m}}\\right)^2 = 20,000 \\text{ cm}^2$"
            },
            {
              "process": "Complex units",
              "explanation": "$20 \\text{ m/s} \\times \\frac{1 \\text{ km}}{1000 \\text{ m}} \\times \\frac{3600 \\text{ s}}{1 \\text{ h}} = 72 \\text{ km/h}$"
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit1/formulas_summary.png",
        "alt": "Summary card of important formulas from Unit 1",
        "caption": "Memorize these formulas and understand when to apply them"
      }
    },
    {
      "section_title": "Common Mistakes to Avoid",
      "introduction": "Reviewing common errors from each section helps prevent them in future work.",
      "classifications": [
        {
          "type": "Measurement Errors",
          "value": "Mistakes when measuring",
          "characteristics": [
            "Parallax error - not reading at eye level",
            "Zero error - not checking instrument zero",
            "Single trial - not averaging multiple measurements",
            "Inconsistent technique"
          ],
          "behavior": "These errors reduce accuracy and precision. Parallax causes systematic reading errors. Zero error adds constant offset. Single trials are vulnerable to random errors. Inconsistent technique adds variability.",
          "examples": [
            {
              "process": "Parallax",
              "explanation": "Reading a thermometer from above gives a falsely high reading."
            },
            {
              "process": "Zero error",
              "explanation": "Not zeroing a balance adds constant offset to all mass measurements."
            }
          ]
        },
        {
          "type": "Significant Figure Errors",
          "value": "Mistakes with precision",
          "characteristics": [
            "Reporting too many digits (false precision)",
            "Rounding too early in calculations",
            "Confusing rules for addition vs. multiplication",
            "Not recognizing exact numbers"
          ],
          "behavior": "These errors miscommunicate precision. Reporting extra digits claims more accuracy than actually achieved. Rounding too early compounds errors. Using wrong rules (e.g., decimal places for multiplication) gives incorrect precision.",
          "examples": [
            {
              "process": "False precision",
              "explanation": "Reporting $12.3456$ cm when ruler only measures to 0.1 cm."
            },
            {
              "process": "Wrong rule",
              "explanation": "For $3.4 \\times 5.67$, reporting to 2 decimal places instead of 2 sig figs."
            }
          ]
        },
        {
          "type": "Vector Errors",
          "value": "Mistakes with vectors",
          "characteristics": [
            "Adding magnitudes without considering direction",
            "Forgetting quadrant adjustment for angle",
            "Sign errors in components",
            "Using wrong trigonometric function"
          ],
          "behavior": "These errors give wrong resultants. Adding magnitudes directly only works for same-direction vectors. Forgetting quadrant can give angle 180° wrong. Sign errors come from not trusting $\\cos \\theta$ to give correct sign.",
          "examples": [
            {
              "process": "Scalar addition",
              "explanation": "Adding 3 N east and 4 N north as 7 N (should be 5 N at 53°)."
            },
            {
              "process": "Quadrant error",
              "explanation": "$R_x = -3$, $R_y = -4$, reporting $\\theta = 53°$ instead of $233°$."
            }
          ]
        },
        {
          "type": "Unit Conversion Errors",
          "value": "Mistakes when converting",
          "characteristics": [
            "Using conversion factor upside down",
            "Forgetting to square/cube for area/volume",
            "Not checking unit cancellation",
            "Using approximate when exact needed"
          ],
          "behavior": "These errors give answers off by factors of 10, 100, or more. Upside-down factors invert the conversion. Forgetting powers gives factors of 100 (area) or 1,000,000 (volume) error.",
          "examples": [
            {
              "process": "Upside down",
              "explanation": "$5 \\text{ km} \\times \\frac{1 \\text{ km}}{1000 \\text{ m}}$ gives nonsense units (km²/m)."
            },
            {
              "process": "Missing square",
              "explanation": "$2 \\text{ m}^2 = 200 \\text{ cm}^2$ (wrong - should be 20,000 cm²)."
            }
          ]
        },
        {
          "type": "Graphing Errors",
          "value": "Mistakes when creating graphs",
          "characteristics": [
            "Axes reversed (independent on y)",
            "Connecting dots instead of best-fit line",
            "Poor scale choice cramping data",
            "Missing labels or units"
          ],
          "behavior": "These errors make graphs misleading or unreadable. Reversed axes violate convention and confuse readers. Connecting dots hides the true trend. Poor scales obscure patterns. Missing labels make graphs meaningless.",
          "examples": [
            {
              "process": "Connected dots",
              "explanation": "Drawing zigzag lines between points instead of smooth best-fit line."
            },
            {
              "process": "Missing labels",
              "explanation": "Graph with numbers but no indication of what was measured or in what units."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit1/common_mistakes.png",
        "alt": "Summary of common mistakes from each section",
        "caption": "Being aware of common errors helps you avoid them"
      }
    },
    {
      "section_title": "Practice Problems",
      "introduction": "These practice problems review key skills from Unit 1. Work through them to check your understanding.",
      "worked_examples": [
        {
          "title": "Scientific Notation and Significant Figures",
          "problem": "Calculate $(4.52 \\times 10^3) \\times (2.1 \\times 10^{-2})$ and express the answer with the correct number of significant figures.",
          "step_by_step": [
            {
              "step": "Multiply coefficients",
              "explanation": "$4.52 \\times 2.1 = 9.492$"
            },
            {
              "step": "Add exponents",
              "explanation": "$10^3 \\times 10^{-2} = 10^{1}$"
            },
            {
              "step": "Combine",
              "explanation": "$9.492 \\times 10^1 = 94.92$"
            },
            {
              "step": "Apply significant figures",
              "explanation": "$4.52$ has 3 sig figs, $2.1$ has 2 sig figs. Result should have 2 sig figs."
            },
            {
              "step": "Round",
              "explanation": "$94.92$ rounded to 2 sig figs is $95$ (or $9.5 \\times 10^1$)"
            }
          ],
          "final_answer": "$9.5 \\times 10^1$ or $95$",
          "concept_applied": "Multiplication: result has as many sig figs as the least precise measurement."
        },
        {
          "title": "Unit Conversion",
          "problem": "Convert a speed of $65 \\text{ miles per hour}$ to meters per second. (Use $1 \\text{ mi} = 1609 \\text{ m}$)",
          "step_by_step": [
            {
              "step": "Write starting quantity",
              "explanation": "$65 \\frac{\\text{mi}}{\\text{h}}$"
            },
            {
              "step": "Convert miles to meters",
              "explanation": "$65 \\frac{\\text{mi}}{\\text{h}} \\times \\frac{1609 \\text{ m}}{1 \\text{ mi}}$"
            },
            {
              "step": "Convert hours to seconds",
              "explanation": "$\\times \\frac{1 \\text{ h}}{3600 \\text{ s}}$"
            },
            {
              "step": "Calculate",
              "explanation": "$65 \\times 1609 \\div 3600 = 104585 \\div 3600 = 29.05 \\text{ m/s}$"
            },
            {
              "step": "Round appropriately",
              "explanation": "$65$ has 2 sig figs, so round to $29 \\text{ m/s}$"
            }
          ],
          "final_answer": "$29 \\text{ m/s}$",
          "concept_applied": "Chain conversions with units canceling, then apply significant figures."
        },
        {
          "title": "Vector Addition",
          "problem": "Add the following vectors: $\\vec{A} = 12 \\text{ N}$ at $0°$, $\\vec{B} = 8 \\text{ N}$ at $90°$, and $\\vec{C} = 5 \\text{ N}$ at $180°$.",
          "step_by_step": [
            {
              "step": "Find components of $\\vec{A}$",
              "explanation": "$A_x = 12 \\cos 0° = 12$, $A_y = 12 \\sin 0° = 0$"
            },
            {
              "step": "Find components of $\\vec{B}$",
              "explanation": "$B_x = 8 \\cos 90° = 0$, $B_y = 8 \\sin 90° = 8$"
            },
            {
              "step": "Find components of $\\vec{C}$",
              "explanation": "$C_x = 5 \\cos 180° = -5$, $C_y = 5 \\sin 180° = 0$"
            },
            {
              "step": "Sum components",
              "explanation": "$R_x = 12 + 0 + (-5) = 7$, $R_y = 0 + 8 + 0 = 8$"
            },
            {
              "step": "Find magnitude",
              "explanation": "$R = \\sqrt{7^2 + 8^2} = \\sqrt{49 + 64} = \\sqrt{113} = 10.63 \\text{ N}$"
            },
            {
              "step": "Find direction",
              "explanation": "$\\theta = \\tan^{-1}(8/7) = \\tan^{-1}(1.143) = 48.8°$"
            },
            {
              "step": "Check quadrant",
              "explanation": "$R_x > 0$, $R_y > 0$, so first quadrant - angle correct."
            }
          ],
          "final_answer": "$10.6 \\text{ N}$ at $48.8°$ (3 sig figs from original measurements)",
          "concept_applied": "Component method handles multiple vectors by adding all x and all y components separately."
        },
        {
          "title": "Estimation (Fermi Problem)",
          "problem": "Estimate the total number of heartbeats in a human lifetime.",
          "step_by_step": [
            {
              "step": "Estimate heart rate",
              "explanation": "Average resting heart rate about 70 beats per minute. (During sleep lower, during activity higher - 70 is reasonable average.)"
            },
            {
              "step": "Calculate beats per year",
              "explanation": "$70 \\text{ beats/min} \\times 60 \\text{ min/h} \\times 24 \\text{ h/day} \\times 365 \\text{ days/year}$"
            },
            {
              "step": "Simplify step by step",
              "explanation": "$70 \\times 60 = 4200$ beats/h"
            },
            {
              "step": "Continue",
              "explanation": "$4200 \\times 24 = 100,800$ beats/day ≈ $1 \\times 10^5$ beats/day"
            },
            {
              "step": "Continue",
              "explanation": "$1 \\times 10^5 \\times 365 \\approx 3.65 \\times 10^7$ beats/year ≈ $4 \\times 10^7$ beats/year"
            },
            {
              "step": "Estimate lifetime",
              "explanation": "Average human lifetime about 80 years ≈ $8 \\times 10^1$ years"
            },
            {
              "step": "Multiply",
              "explanation": "$4 \\times 10^7 \\times 8 \\times 10^1 = 32 \\times 10^8 = 3.2 \\times 10^9$ heartbeats"
            }
          ],
          "final_answer": "Approximately $3 \\times 10^9$ heartbeats in a lifetime",
          "concept_applied": "Fermi estimation breaks problem into manageable parts: rate × time = total."
        }
      ],
      "image": {
        "src": "images/unit1/practice_problems.png",
        "alt": "Practice problems covering key Unit 1 skills",
        "caption": "Work through these practice problems to test your understanding"
      }
    }
  ],
  "key_terms": [
    "Physics",
    "SI Units",
    "Base Units",
    "Derived Units",
    "Scientific Notation",
    "Significant Figures",
    "Unit Conversion",
    "Dimensional Analysis",
    "Scalar",
    "Vector",
    "Vector Components",
    "Resultant",
    "Graph",
    "Best-Fit Line",
    "Independent Variable",
    "Dependent Variable",
    "Lab Safety",
    "PPE",
    "Parallax Error",
    "Zero Error",
    "Estimation",
    "Order of Magnitude",
    "Fermi Problem"
  ],
  "summary": "Unit 1: Foundations and Measurement established the essential knowledge and skills for success in physics. We learned that physics is the fundamental science studying matter, energy, and their interactions, with branches including mechanics, thermodynamics, electromagnetism, optics, and modern physics. The SI system provides seven base units (meter, kilogram, second, ampere, kelvin, mole, candela) defined by fundamental constants, with derived units combining them and SI prefixes handling scale. Scientific notation ($a \\times 10^n$) manages very large and small numbers, while significant figures communicate measurement precision. Unit conversions using dimensional analysis ensure consistent units in calculations. Scalars have only magnitude; vectors have both magnitude and direction and add using components: $v_x = v \\cos \\theta$, $v_y = v \\sin \\theta$, $R = \\sqrt{R_x^2 + R_y^2}$, $\\theta = \\tan^{-1}(R_y/R_x)$. Graphs visually reveal relationships with independent variable on x-axis, dependent on y-axis, and best-fit lines showing trends. Lab safety requires PPE, hazard awareness, and proper techniques for measurement tools including rulers, balances, stopwatches, thermometers, and glassware. Estimation and orders of magnitude provide quick approximations, sanity checks, and understanding of scale through Fermi problems. These foundations interconnect and will be applied throughout the study of physics."
}
