{
  "expanded_description": "Demand schedules and demand curves are two complementary ways of representing the relationship between price and quantity demanded. A demand schedule is a table showing specific price-quantity pairs, while a demand curve is the graphical representation of that same relationship. Understanding how to construct, interpret, and use these tools is essential for economic analysis.",
  "core_concept": {
    "principle": "A demand schedule is a table listing quantities demanded at various prices, holding all other factors constant. A demand curve is the graphical representation of a demand schedule, plotting price on the vertical axis and quantity demanded on the horizontal axis. Both show the same information—the relationship between price and quantity demanded—in different formats. The demand curve slopes downward from left to right, reflecting the law of demand. Every point on the demand curve represents a specific price-quantity combination from the demand schedule. The demand curve makes the inverse relationship between price and quantity demanded visually clear and enables analysis of consumer behavior, market outcomes, and policy effects.",
    "explanation": "Demand schedules and curves are the fundamental tools for analyzing consumer behavior. They translate the abstract law of demand into concrete, usable information. Consider a simple example—weekly demand for coffee by an individual: Demand Schedule: At \\$5 per cup → 2 cups demanded per week, At \\$4 per cup → 3 cups demanded per week, At \\$3 per cup → 5 cups demanded per week, At \\$2 per cup → 8 cups demanded per week, At \\$1 per cup → 12 cups demanded per week. This table shows the demand schedule—specific price-quantity pairs showing how many cups this person wants at each price. The same information can be shown graphically as a demand curve: Vertical axis: Price (\\$1, \\$2, \\$3, \\$4, \\$5), Horizontal axis: Quantity (2, 3, 5, 8, 12 cups/week), Plot points: (2, \\$5), (3, \\$4), (5, \\$3), (8, \\$2), (12, \\$1), Connect points with smooth curve sloping downward. The demand curve makes the inverse relationship visible—as you move down the price axis (lower prices), you move right along the quantity axis (higher quantities). Both formats are useful: Demand schedules provide precise numerical information, useful for calculations. Demand curves provide visual representation, useful for seeing relationships and comparing scenarios. We distinguish between: Individual demand (one consumer's demand schedule/curve—shows one person's purchasing behavior), Market demand (sum of all individual demands—shows total quantity demanded by all consumers at each price). Market demand is simply the horizontal sum of individual demands—at each price, add up quantities demanded by all individuals. Understanding demand schedules and curves enables: Predicting consumer behavior (how will sales change if price changes?), Measuring consumer surplus (difference between willingness to pay and actual price), Finding market equilibrium (where demand intersects supply), Analyzing policy effects (how do taxes affect quantity purchased?). These tools transform the abstract law of demand into practical analytical power.",
    "image": {
      "src": "images/unit3/demand_schedule_curve.png",
      "alt": "Side-by-side display of demand schedule table and corresponding demand curve graph",
      "caption": "Demand schedule (table) and demand curve (graph) show same information: price-quantity relationship following law of demand"
    }
  },
  "sections": [
    {
      "section_title": "Constructing Demand Schedules",
      "introduction": "A demand schedule organizes information about the price-quantity relationship in table format. Understanding how to create and interpret demand schedules is the first step toward demand analysis.",
      "key_concept": {
        "definition": "A demand schedule is a table showing the quantity of a good that consumers are willing and able to purchase at each of various prices during a specific time period, ceteris paribus. Format: typically two columns—one for price, one for quantity demanded. The schedule lists multiple price points and corresponding quantities, showing how quantity demanded varies with price. Time period specification is essential (per day, per week, per year) because demand is a flow concept—quantity per unit of time.",
        "context": "Demand schedules can represent individual demand (one consumer) or market demand (all consumers). They provide the foundation for constructing demand curves and performing economic calculations. The schedule must hold all other factors constant (ceteris paribus) to isolate the pure price effect."
      },
      "principles": [
        {
          "principle": "Demand Schedules Show Inverse Price-Quantity Relationship",
          "statement": "In a properly constructed demand schedule, as price increases, quantity demanded decreases (moving down the schedule). As price decreases, quantity demanded increases (moving up the schedule). This reflects the law of demand.",
          "application": "When reading a demand schedule, verify that it shows inverse relationship—higher prices correspond to lower quantities.",
          "example": "Individual demand schedule for movie tickets per month: Price | Quantity Demanded, \\$20 | 1 ticket, \\$15 | 2 tickets, \\$10 | 4 tickets, \\$5 | 7 tickets. Pattern: Price ↓ → Quantity ↓. Inverse relationship confirmed. If schedule showed price ↑ → quantity ↑, something would be wrong (violates law of demand, or other factors changing)."
        },
        {
          "principle": "Each Entry Shows Willingness and Ability to Purchase",
          "statement": "Quantity demanded at each price represents what consumers are both willing (want to buy) and able (can afford) to purchase. Demand requires both desire and purchasing power.",
          "application": "Demand schedules reflect effective demand—backed by ability to pay, not just wishful thinking.",
          "example": "Luxury car demand schedule: At \\$100,000 price → 500 units demanded (500 buyers both want and can afford). Many more people want luxury cars (10,000+), but only 500 can afford at \\$100,000. Quantity demanded = 500 (effective demand), not 10,000 (wishful demand). At \\$50,000 price → 2,000 units demanded (more can now afford). Demand schedule reflects purchasing power constraints."
        },
        {
          "principle": "Demand Schedules Hold Other Factors Constant (Ceteris Paribus)",
          "statement": "A single demand schedule assumes all non-price factors remain constant—income, preferences, prices of other goods, expectations, etc. If these factors change, the entire schedule shifts (covered later).",
          "application": "When constructing or interpreting demand schedules, explicitly note that other factors are held constant. Changes in those factors require new schedules.",
          "example": "Coffee demand schedule: At \\$5 → 1,000 cups, At \\$3 → 2,000 cups, At \\$1 → 4,000 cups. This schedule assumes: Income constant (if income rises, entire schedule shifts), Preferences constant (if tastes change, schedule shifts), Tea price constant (if tea price changes, schedule shifts), Expectations constant (if price expectations change, schedule shifts). Ceteris paribus condition essential for isolating price effect."
        },
        {
          "principle": "Time Period Must Be Specified",
          "statement": "Demand is a flow variable—quantity per unit of time. Demand schedules must specify the time period (per day, per month, per year) for quantities to be meaningful.",
          "application": "Always include time period when presenting demand schedules. Without it, quantities are ambiguous.",
          "example": "Ambiguous: At \\$10 → 50 units demanded. Unclear timeframe. Clear: At \\$10 → 50 units demanded per week. Now meaningful. Same consumer at same price: 50 units per week = 2,600 units per year. Different time periods, different quantities. Time period specification essential."
        }
      ],
      "worked_examples": [
        {
          "title": "Creating a Demand Schedule from Data",
          "problem": "Market research shows gasoline demand in a city: At \\$4/gallon, residents buy 100,000 gallons/day. At \\$3.50/gallon, residents buy 120,000 gallons/day. At \\$3/gallon, residents buy 150,000 gallons/day. At \\$2.50/gallon, residents buy 180,000 gallons/day. At \\$2/gallon, residents buy 220,000 gallons/day. (a) Construct the demand schedule. (b) Verify it follows law of demand. (c) What assumptions are implicit?",
          "step_by_step": [
            {
              "step": "Part (a): Construct demand schedule table",
              "explanation": "Organize data into standard two-column format: Price (per gallon) | Quantity Demanded (gallons per day), \\$4.00 | 100,000, \\$3.50 | 120,000, \\$3.00 | 150,000, \\$2.50 | 180,000, \\$2.00 | 220,000. This is the demand schedule—shows quantity demanded at each price. Time period specified: gallons per day. Prices in descending order (convention for easy reading)."
            },
            {
              "step": "Part (b): Verify law of demand",
              "explanation": "Check for inverse relationship between price and quantity: \\$4.00 → \\$3.50: Price ↓ \\$0.50 (12.5%), Quantity ↑ 20,000 (20%). ✓ \\$3.50 → \\$3.00: Price ↓ \\$0.50 (14.3%), Quantity ↑ 30,000 (25%). ✓ \\$3.00 → \\$2.50: Price ↓ \\$0.50 (16.7%), Quantity ↑ 30,000 (20%). ✓ \\$2.50 → \\$2.00: Price ↓ \\$0.50 (20%), Quantity ↑ 40,000 (22.2%). ✓ Every price decrease corresponds to quantity increase. Inverse relationship confirmed. Schedule follows law of demand."
            },
            {
              "step": "Part (c): Identify implicit assumptions (ceteris paribus)",
              "explanation": "This schedule assumes all other demand factors constant: Incomes constant: If residents' incomes change, demand changes. Preferences constant: If attitudes toward driving/environment change, demand changes. Vehicle fuel efficiency constant: If cars become more/less efficient, demand changes. Public transit availability constant: If transit improves/worsens, demand changes. Population constant: If city population grows, demand increases. Expectations constant: If expecting shortages/price changes, current demand changes. Prices of substitutes/complements constant: If electric vehicle or public transit prices change, gasoline demand changes. These factors held constant (ceteris paribus) to isolate price effect on quantity demanded."
            }
          ],
          "final_answer": "(a) Demand schedule: \\$4→100K, \\$3.50→120K, \\$3→150K, \\$2.50→180K, \\$2→220K gallons/day. (b) Yes, follows law of demand—every price decrease corresponds to quantity increase (inverse relationship). (c) Implicit assumptions: incomes, preferences, vehicle efficiency, transit availability, population, expectations, and related prices all held constant. Schedule shows pure price effect, ceteris paribus.",
          "concept_applied": "Demand schedules organize price-quantity data systematically. They must show inverse relationship (law of demand), specify time period (flow variable), represent willingness and ability to purchase (effective demand), and hold other factors constant (ceteris paribus). Proper construction requires identifying and maintaining these conditions."
        }
      ],
      "image": {
        "src": "images/unit3/demand_schedule_construction.png",
        "alt": "Example demand schedule table with columns for price and quantity demanded, showing inverse relationship",
        "caption": "Demand schedule: table showing quantities demanded at various prices, demonstrating law of demand through inverse relationship"
      }
    },
    {
      "section_title": "Plotting Demand Curves",
      "introduction": "A demand curve is the graphical representation of a demand schedule. Understanding how to plot demand curves from schedules and interpret them is essential for visual economic analysis.",
      "key_concept": {
        "definition": "A demand curve is a graph showing the relationship between the price of a good (vertical axis) and the quantity demanded (horizontal axis). It plots the price-quantity pairs from the demand schedule as points on a coordinate plane, then connects them with a smooth curve. Convention: Price on vertical (y) axis, Quantity on horizontal (x) axis. The curve slopes downward from left to right, reflecting the law of demand—as price falls, quantity demanded rises. Each point on the curve represents a specific price-quantity combination where consumers are willing and able to purchase that quantity at that price.",
        "context": "Despite being called a 'curve,' demand curves are often drawn as straight lines for simplicity. Whether curved or linear, they slope downward. The graphical representation makes the inverse relationship visible and enables geometric analysis of consumer surplus, market equilibrium, and policy effects."
      },
      "principles": [
        {
          "principle": "Standard Axes: Price Vertical, Quantity Horizontal",
          "statement": "By convention, demand curves always plot price on the vertical (y) axis and quantity on the horizontal (x) axis. This is standard across all economics—always use this orientation.",
          "application": "When plotting demand curves, always put price vertical and quantity horizontal, regardless of which is the 'independent' variable conceptually.",
          "example": "Plotting demand for books: Vertical axis: Price (\\$5, \\$10, \\$15, \\$20, \\$25). Horizontal axis: Quantity (0, 10, 20, 30, 40, 50 books per month). Plot points from schedule, connect with downward-sloping line. Note: Technically, price is independent variable (we vary price to see quantity response), so mathematically it should be horizontal. But economics convention: Price always vertical. Follow convention for consistency with all economic analysis."
        },
        {
          "principle": "Demand Curves Slope Downward",
          "statement": "The demand curve slopes downward from upper left to lower right, reflecting the inverse relationship between price and quantity demanded (law of demand). Higher prices correspond to points high on vertical axis and left on horizontal axis (low quantity). Lower prices correspond to points low on vertical axis and right on horizontal axis (high quantity).",
          "application": "Always verify demand curves slope downward. Upward slope indicates error (or rare exception like Giffen/Veblen goods).",
          "example": "Demand curve for pizza: Point A: (10 pizzas, \\$20) high on graph (high price, low quantity). Point B: (20 pizzas, \\$15) middle of graph. Point C: (35 pizzas, \\$10) lower on graph. Point D: (60 pizzas, \\$5) low on graph (low price, high quantity). Connecting A→B→C→D creates downward-sloping curve. Visual representation of law of demand."
        },
        {
          "principle": "Every Point on the Curve Represents a Price-Quantity Pair",
          "statement": "Each point on the demand curve shows the quantity consumers demand at that specific price. Moving along the curve shows how quantity demanded changes as price changes, holding other factors constant.",
          "application": "Can read quantity demanded at any price by finding corresponding point on curve.",
          "example": "Demand curve for concert tickets: At \\$100 price: Find \\$100 on vertical axis, move horizontally to demand curve, drop vertically to horizontal axis → read 5,000 tickets demanded. At \\$50 price: Same process → read 12,000 tickets demanded. At \\$25 price: Read 20,000 tickets demanded. Each point on curve tells quantity demanded at that price."
        },
        {
          "principle": "Curve Can Be Linear or Curved, Still Called 'Demand Curve'",
          "statement": "Demand curves can be straight lines (linear) or curved lines (nonlinear). Both are called 'demand curves' by convention. Linear demand curves have constant slope. Curved demand curves have changing slope (usually flattening as quantity increases).",
          "application": "Don't be confused by terminology—'demand curve' doesn't necessarily mean curved shape. It's the generic term for the graphical demand relationship.",
          "example": "Linear demand: Straight line from (0, \\$50) to (100, \\$0). Slope constant everywhere: -\\$0.50 per unit. Simple to work with mathematically. Nonlinear demand: Curved line, steep at high prices, flatter at low prices. Slope changes: steep portion -\\$2 per unit, flat portion -\\$0.25 per unit. More realistic for many goods. Both called 'demand curves.'"
        }
      ],
      "worked_examples": [
        {
          "title": "Plotting a Demand Curve from a Schedule",
          "problem": "Individual's demand schedule for streaming services per month: \\$20 → 1 service, \\$15 → 2 services, \\$10 → 3 services, \\$5 → 5 services, \\$3 → 7 services. (a) Plot the demand curve. (b) What quantity is demanded at \\$12? (c) At what price is quantity demanded equal to 4 services?",
          "step_by_step": [
            {
              "step": "Part (a): Plot demand curve",
              "explanation": "Set up axes: Vertical (y) axis: Price (\\$0 to \\$20 in \\$5 increments). Horizontal (x) axis: Quantity (0 to 8 services in 1-service increments). Plot points from schedule: Point A: (1 service, \\$20), Point B: (2 services, \\$15), Point C: (3 services, \\$10), Point D: (5 services, \\$5), Point E: (7 services, \\$3). Connect points with smooth curve sloping downward from upper left (A) to lower right (E). This is the demand curve—visual representation of the demand schedule."
            },
            {
              "step": "Part (b): Find quantity demanded at \\$12",
              "explanation": "Price \\$12 is between plotted points B (\\$15) and C (\\$10). Interpolate between these points: At \\$15 → 2 services. At \\$10 → 3 services. At \\$12 (40% of way from \\$15 to \\$10): Quantity ≈ 2 + 0.4(3-2) = 2.4 services. Approximately 2-3 services demanded at \\$12 price. Graphically: Find \\$12 on vertical axis, move horizontally right to demand curve, drop down to horizontal axis → read approximately 2.4 services."
            },
            {
              "step": "Part (c): Find price where quantity demanded = 4 services",
              "explanation": "Quantity 4 is between plotted points C (3 services) and D (5 services). Interpolate: At 3 services → \\$10. At 5 services → \\$5. At 4 services (50% of way from 3 to 5): Price ≈ \\$10 - 0.5(\\$10-\\$5) = \\$10 - \\$2.50 = \\$7.50. At approximately \\$7.50 price, quantity demanded equals 4 services. Graphically: Find 4 on horizontal axis, move vertically up to demand curve, move horizontally left to vertical axis → read \\$7.50."
            }
          ],
          "final_answer": "(a) Demand curve: downward-sloping curve through points (1, \\$20), (2, \\$15), (3, \\$10), (5, \\$5), (7, \\$3). (b) At \\$12 price, quantity demanded ≈ 2.4 services (between 2 and 3). (c) At quantity demanded of 4 services, price ≈ \\$7.50. Demand curve allows reading price-quantity relationships in both directions.",
          "concept_applied": "Demand curves are plotted with price on vertical axis, quantity on horizontal axis. Points from demand schedule are plotted and connected with downward-sloping curve. The curve allows reading quantities demanded at various prices (and vice versa), including interpolating between plotted points. Visual representation makes the inverse price-quantity relationship clear and enables graphical analysis."
        }
      ],
      "image": {
        "src": "images/unit3/plotting_demand_curve.png",
        "alt": "Graph showing step-by-step process of plotting demand curve from schedule points",
        "caption": "Plotting demand curve: price on vertical axis, quantity on horizontal axis, connect points from demand schedule with downward-sloping curve"
      }
    },
    {
      "section_title": "Individual vs. Market Demand",
      "introduction": "Individual demand represents one consumer's behavior, while market demand represents all consumers combined. Understanding how to aggregate individual demands into market demand is essential for analyzing markets.",
      "key_concept": {
        "definition": "Individual demand is the demand schedule or curve for a single consumer, showing how much that person wants to buy at various prices. Market demand is the sum of all individual demands, showing total quantity demanded by all consumers at each price. Market demand is found by horizontal summation—at each price, add up the quantities demanded by all individuals. Market demand curve lies to the right of any individual demand curve because it represents more buyers.",
        "context": "Most economic analysis focuses on market demand because markets involve many buyers. But market demand is simply the aggregation of individual demands—understanding individual behavior is the foundation for understanding market outcomes."
      },
      "principles": [
        {
          "principle": "Market Demand Is Horizontal Sum of Individual Demands",
          "statement": "To find market demand, take each price and sum the quantities demanded by all individual consumers at that price. Repeat for all prices. This is called horizontal summation because you're adding quantities (horizontal axis) at each price level.",
          "application": "Given individual demand schedules, sum quantities at each price to create market demand schedule.",
          "example": "Two consumers, pizza demand: Consumer A: At \\$10 → 2 pizzas, At \\$8 → 3 pizzas, At \\$6 → 5 pizzas. Consumer B: At \\$10 → 1 pizza, At \\$8 → 2 pizzas, At \\$6 → 4 pizzas. Market demand (A + B): At \\$10 → 2+1 = 3 pizzas total, At \\$8 → 3+2 = 5 pizzas total, At \\$6 → 5+4 = 9 pizzas total. Market demand schedule shows combined purchasing."
        },
        {
          "principle": "Market Demand Curve Lies to the Right of Individual Curves",
          "statement": "Because market demand represents more buyers, at any given price, market quantity demanded exceeds any individual's quantity demanded. Graphically, market demand curve is to the right of individual demand curves.",
          "application": "Market demand is always greater than individual demand at every price level (assuming positive individual demands).",
          "example": "Coffee demand at \\$3 per cup: Individual A demands 2 cups. Individual B demands 3 cups. Individual C demands 1 cup. Market demand: 2+3+1 = 6 cups total at \\$3. Graphically: Individual curves pass through (2, \\$3), (3, \\$3), (1, \\$3). Market curve passes through (6, \\$3)—to the right of all individual curves. More buyers → greater total quantity."
        },
        {
          "principle": "Market Demand Inherits Law of Demand from Individuals",
          "statement": "If all individual demand curves slope downward (law of demand), market demand curve must also slope downward. Inverse relationship holds at aggregate level because it holds at individual level.",
          "application": "Market demand follows law of demand because it's built from individuals who follow law of demand.",
          "example": "Each individual: Higher price → lower individual quantity demanded (law of demand). Market (sum of individuals): Higher price → lower quantity for each individual → lower total quantity demanded. Market demand slopes downward because individual demands slope downward."
        },
        {
          "principle": "Adding Consumers Increases Market Demand",
          "statement": "As more consumers enter the market, market demand increases at every price. The market demand curve shifts rightward when population grows or new buyers enter.",
          "application": "Market size affects total demand. Larger markets have greater demand at every price.",
          "example": "Original market: 1,000 consumers. At \\$5 → each buys 2 units → market demand 2,000 units. Population grows: 1,500 consumers. At \\$5 → each buys 2 units → market demand 3,000 units. 50% more consumers → 50% more market demand. Market demand curve shifted right."
        }
      ],
      "worked_examples": [
        {
          "title": "Deriving Market Demand from Individual Demands",
          "problem": "Three consumers in a market for e-books per month. Consumer A: \\$15→1, \\$10→3, \\$5→6 books. Consumer B: \\$15→0, \\$10→2, \\$5→5 books. Consumer C: \\$15→2, \\$10→4, \\$5→7 books. (a) Derive market demand schedule. (b) Plot individual and market demand curves. (c) What happens to market demand if Consumer D enters with same demand as Consumer A?",
          "step_by_step": [
            {
              "step": "Part (a): Derive market demand schedule",
              "explanation": "Sum quantities at each price: At \\$15: A(1) + B(0) + C(2) = 3 books total. At \\$10: A(3) + B(2) + C(4) = 9 books total. At \\$5: A(6) + B(5) + C(7) = 18 books total. Market demand schedule: Price | Market Quantity Demanded, \\$15 | 3 books/month, \\$10 | 9 books/month, \\$5 | 18 books/month. This is horizontal summation—added quantities (horizontal) at each price."
            },
            {
              "step": "Part (b): Plot curves",
              "explanation": "Individual curves: Consumer A: Plot (1, \\$15), (3, \\$10), (6, \\$5). Connect with downward slope. Consumer B: Plot (0, \\$15), (2, \\$10), (5, \\$5). Connect with downward slope. Consumer C: Plot (2, \\$15), (4, \\$10), (7, \\$5). Connect with downward slope. Market curve: Plot (3, \\$15), (9, \\$10), (18, \\$5). Connect with downward slope. Observation: At each price, market quantity (3, 9, 18) is sum of individual quantities. Market curve to the right of all individual curves. All curves slope downward (law of demand)."
            },
            {
              "step": "Part (c): New consumer enters",
              "explanation": "Consumer D enters with same demand as A: \\$15→1, \\$10→3, \\$5→6. New market demand (A+B+C+D): At \\$15: 3 (old) + 1 (D) = 4 books. At \\$10: 9 (old) + 3 (D) = 12 books. At \\$5: 18 (old) + 6 (D) = 24 books. Effect: Market demand increased at every price. Market demand curve shifted rightward. More consumers → greater market demand. New market demand schedule: \\$15→4, \\$10→12, \\$5→24 books."
            }
          ],
          "final_answer": "(a) Market demand: \\$15→3, \\$10→9, \\$5→18 books/month (horizontal sum of individual demands). (b) Individual curves show individual purchasing; market curve shows total purchasing at each price, lying to the right of all individual curves. All slope downward. (c) Consumer D entering increases market demand to \\$15→4, \\$10→12, \\$5→24 books—market demand curve shifts right when more consumers enter.",
          "concept_applied": "Market demand is horizontal summation of individual demands—at each price, add all individual quantities demanded. Market demand curve lies to the right of individual curves (represents more buyers). Market demand inherits downward slope from individuals (law of demand). Adding consumers shifts market demand rightward, increasing quantity demanded at every price. Market analysis aggregates individual behaviors."
        }
      ],
      "image": {
        "src": "images/unit3/individual_market_demand.png",
        "alt": "Multiple individual demand curves and their horizontal sum creating market demand curve to the right",
        "caption": "Market demand: horizontal sum of individual demands; at each price, add individual quantities to get market quantity"
      }
    }
  ],
  "key_terms": [
    "Demand schedule",
    "Demand curve",
    "Individual demand",
    "Market demand",
    "Horizontal summation",
    "Price axis",
    "Quantity axis",
    "Ceteris paribus",
    "Flow variable",
    "Effective demand",
    "Linear demand",
    "Nonlinear demand",
    "Interpolation"
  ],
  "summary": "Demand schedules and demand curves are complementary tools representing the relationship between price and quantity demanded. A demand schedule is a table listing quantities demanded at various prices, organized with price in one column and corresponding quantity demanded in another. The schedule shows the inverse relationship between price and quantity (law of demand) through numerical data, with higher prices corresponding to lower quantities and vice versa. Each entry represents quantity consumers are both willing and able to purchase (effective demand, not wishful thinking). The schedule must specify a time period (per day, per week, per year) because demand is a flow variable—quantity per unit of time. The ceteris paribus condition is essential—the schedule holds all non-price factors constant (income, preferences, prices of other goods, expectations) to isolate the pure price effect. A demand curve is the graphical representation of the demand schedule, plotting price on the vertical axis and quantity demanded on the horizontal axis by convention (always use this orientation in economics). Points from the demand schedule are plotted as coordinates (quantity, price) and connected with a smooth curve. The demand curve slopes downward from left to right, reflecting the law of demand—as you move down the price axis (lower prices), you move right along the quantity axis (higher quantities demanded). Each point on the curve represents a specific price-quantity combination showing how much consumers demand at that price. Despite being called a 'curve,' demand curves can be linear (straight lines with constant slope) or nonlinear (curved lines with changing slope)—both are called demand curves by convention. The curve allows reading quantities demanded at any price and prices at any quantity, including interpolating between plotted points. Individual demand represents one consumer's purchasing behavior at various prices, showing a single person's demand schedule or curve. Market demand represents all consumers combined, showing total quantity demanded by everyone at each price. Market demand is derived through horizontal summation—at each price, add up the quantities demanded by all individual consumers. The process: take a price, sum all individual quantities demanded at that price, repeat for all prices to create market demand schedule. Market demand curve lies to the right of any individual demand curve because it represents more buyers purchasing at each price. Market demand inherits the law of demand from individuals—if individual curves slope downward, market curve must also slope downward. Adding more consumers to the market increases market demand at every price, shifting the market demand curve rightward. Market size directly affects total demand—larger populations or more buyers create greater market demand. Demand schedules provide precise numerical information useful for calculations and detailed analysis. Demand curves provide visual representation useful for seeing relationships, comparing scenarios, and geometric analysis of consumer surplus, equilibrium, and policy effects. Both formats show the same fundamental information—the price-quantity relationship—but serve different analytical purposes. Understanding how to construct demand schedules from data, plot demand curves from schedules, interpret points on curves, aggregate individual demands into market demand, and translate between numerical and graphical formats is essential for economic analysis. These tools transform the abstract law of demand into concrete, usable frameworks for analyzing consumer behavior, predicting market responses to price changes, measuring welfare (consumer surplus), finding equilibrium (where supply meets demand), and evaluating policy effects (taxes, subsidies, regulations). Mastery of demand schedules and curves is foundational to all further microeconomic analysis."
}
