{
  "expanded_description": "While price is the primary factor affecting quantity demanded, numerous other factors also influence consumer purchasing decisions. These non-price determinants of demand can shift the entire demand curve—changing the quantity demanded at every price level. Understanding what causes demand to shift, how to identify these factors, and how to predict shift directions is essential for analyzing market dynamics and real-world economic changes.",
  "core_concept": {
    "principle": "Determinants of demand (also called demand shifters) are non-price factors that change the quantity demanded at every price, causing the entire demand curve to shift. The main determinants are: (1) Consumer income—changes in purchasing power affect ability to buy, (2) Prices of related goods—substitutes and complements affect relative attractiveness, (3) Tastes and preferences—changes in desires and values affect willingness to buy, (4) Expectations—beliefs about future prices, income, or availability affect current purchasing, (5) Number of buyers—market size changes affect total demand.<br><br>When these factors change, the demand curve shifts: rightward (increase in demand—higher quantity demanded at every price), or leftward (decrease in demand—lower quantity demanded at every price). These shifts are fundamentally different from movements along the curve caused by price changes.",
    "explanation": "Understanding demand shifters is crucial for distinguishing two very different phenomena:<br><br>Movement along the demand curve (change in quantity demanded): Caused by price change. Move to a different point on the same curve. Quantity changes, but the relationship between price and quantity hasn't changed. Example: Coffee price falls from \\$5 to \\$3 → quantity demanded rises from 1,000 to 2,000 cups. Movement down along the same demand curve.<br><br>Shift of the demand curve (change in demand): Caused by change in non-price determinant. Entire curve moves left or right. At every price, quantity demanded is different—the whole relationship changed. Example: Study shows coffee prevents cancer → preferences change → at every price, people want more coffee. At \\$5, demand increases from 1,000 to 1,500 cups. At \\$3, demand increases from 2,000 to 2,500 cups. Entire demand curve shifted right.<br><br>This distinction is critical but commonly confused. Consider income changes: Income increases by 20%: Coffee is a normal good (demand rises with income). At every coffee price, consumers can now afford more and want more. At \\$5, quantity demanded increases 1,000 → 1,200 (20% more income → 20% more coffee). At \\$3, quantity demanded increases 2,000 → 2,400. At \\$1, quantity demanded increases 4,000 → 4,800. The entire demand curve shifted right—more demanded at every price. This is NOT a movement along the curve (price didn't change). It's a shift of the curve (non-price factor changed).<br><br>Understanding determinants of demand enables: Predicting how markets respond to economic changes (recession, new product launches, demographic shifts), Distinguishing correlation from causation (did quantity change because of price or because of other factors?), Analyzing policy effects (how do taxes on related goods affect demand?), Forecasting market trends (aging population, changing preferences, technological change), Making business decisions (when to expand capacity, how to position products).<br><br>Each determinant has different effects depending on the type of good and market context. Income affects normal and inferior goods differently. Related goods matter only if they're actually substitutes or complements. Preferences are shaped by culture, advertising, information, and social trends. Expectations can create self-fulfilling prophecies. Number of buyers reflects demographics and market access.<br><br>Mastering these determinants transforms demand analysis from static (single curve) to dynamic (shifting curves responding to changing conditions)—reflecting real-world market behavior.",
    "image": {
      "src": "images/unit3/demand_shifters.png",
      "alt": "Diagram showing original demand curve and shifted demand curves (both rightward and leftward) with labels for various determinants",
      "caption": "Determinants of demand: non-price factors that shift entire demand curve right (increase) or left (decrease)"
    }
  },
  "sections": [
    {
      "section_title": "Consumer Income and Demand",
      "introduction": "Income is one of the most important determinants of demand. Changes in consumers' income affect their purchasing power and demand for goods, but the direction of effect depends on whether the good is normal or inferior.",
      "key_concept": {
        "definition": "Consumer income affects demand through purchasing power. For normal goods, demand increases when income rises and decreases when income falls (positive relationship). For inferior goods, demand decreases when income rises and increases when income falls (inverse relationship).<br><br>Income changes shift the entire demand curve: Normal good + income increase → demand curve shifts right (more demanded at every price). Normal good + income decrease → demand curve shifts left (less demanded at every price). Inferior good + income increase → demand curve shifts left (less demanded at every price). Inferior good + income decrease → demand curve shifts right (more demanded at every price).",
        "context": "Whether a good is normal or inferior depends on consumer behavior, not inherent good characteristics. Most goods are normal. Inferior goods are typically lower-quality alternatives that people abandon when they can afford better options. The normal/inferior distinction will be explored in detail in section 3.4."
      },
      "principles": [
        {
          "principle": "Normal Goods: Income and Demand Move Together",
          "statement": "For normal goods, income increases cause demand to increase (rightward shift), and income decreases cause demand to decrease (leftward shift). Most goods are normal goods.",
          "application": "Rising incomes in an economy increase demand for most goods. Recessions (falling incomes) decrease demand for most goods.",
          "example": "Restaurant meals (normal good): Income rises 10%: Demand increases—at \\$20 per meal, quantity demanded rises from 100 to 115 meals per month. Demand curve shifts right. People can afford more and want more dining experiences. Income falls 10% (recession): Demand decreases—at \\$20 per meal, quantity demanded falls from 100 to 85 meals per month. Demand curve shifts left. People eat out less to save money. Normal good: income ↑ → demand ↑. Income ↓ → demand ↓."
        },
        {
          "principle": "Inferior Goods: Income and Demand Move Opposite",
          "statement": "For inferior goods, income increases cause demand to decrease (leftward shift), and income decreases cause demand to increase (rightward shift). Inferior goods are typically lower-quality alternatives.",
          "application": "Rising incomes reduce demand for inferior goods as consumers trade up to better alternatives. Economic hardship increases demand for inferior goods.",
          "example": "Instant ramen noodles (inferior good for many): Income rises 10%: Demand decreases—at \\$0.50 per package, quantity demanded falls from 20 to 15 packages per month. Demand curve shifts left. People can afford better food, abandon ramen. Income falls 10% (recession): Demand increases—at \\$0.50 per package, quantity demanded rises from 20 to 25 packages per month. Demand curve shifts right. People substitute cheaper ramen for expensive foods. Inferior good: income ↑ → demand ↓. Income ↓ → demand ↑."
        },
        {
          "principle": "Magnitude of Income Effect Varies by Good",
          "statement": "Some goods are very income-sensitive (luxury goods)—demand changes dramatically with income. Other goods are income-insensitive (necessities)—demand barely changes with income.",
          "application": "Luxury goods experience large demand shifts when income changes. Necessities experience small demand shifts.",
          "example": "Luxury vacation packages: Income rises 20% → demand increases 40% (highly income-sensitive). Income falls 20% → demand decreases 60% (postpone vacations). Salt: Income rises 20% → demand increases 0.5% (barely affected). Income falls 20% → demand decreases 0.5% (still need salt). Luxury goods very responsive to income. Necessities barely responsive."
        },
        {
          "principle": "Income Distribution Matters, Not Just Average Income",
          "statement": "Changes in how income is distributed across the population can affect demand even if average income is constant. Redistribution toward groups with different consumption patterns shifts demand.",
          "application": "Progressive taxation and transfers can change demand patterns by redistributing income.",
          "example": "Income redistribution from rich to poor: Rich have low marginal propensity to consume (save most additional income). Poor have high marginal propensity to consume (spend most additional income). Redistribution \\$1,000 from rich to poor: Rich reduce consumption \\$200 (20% of income transfer). Poor increase consumption \\$800 (80% of income transfer). Net effect: Total consumption ↑ \\$600 → demand increases for consumer goods. Same total income, different distribution → different aggregate demand."
        }
      ],
      "worked_examples": [
        {
          "title": "Income Changes and Demand Shifts",
          "problem": "Original demand for organic groceries: At \\$50/week, quantity demanded is 10,000 households. At \\$30/week, quantity demanded is 20,000 households. Average household income rises 15%. Organic groceries are a normal good with income elasticity of 1.2 (demand rises 1.2% for every 1% income increase). (a) Calculate new demand. (b) Show the shift graphically. (c) Interpret the results.",
          "step_by_step": [
            {
              "step": "Part (a): Calculate new quantities demanded",
              "explanation": "Income rises 15%. Income elasticity = 1.2 (demand rises 1.2% per 1% income rise). Demand increase: 15% × 1.2 = 18%. At \\$50/week: Original: 10,000 households. Increase: 18% of 10,000 = 1,800 households. New: 10,000 + 1,800 = 11,800 households. At \\$30/week: Original: 20,000 households. Increase: 18% of 20,000 = 3,600 households. New: 20,000 + 3,600 = 23,600 households. Demand increased 18% at every price level."
            },
            {
              "step": "Part (b): Graph the shift",
              "explanation": "Original demand curve: Passes through (10,000, \\$50) and (20,000, \\$30). Downward sloping. New demand curve: Passes through (11,800, \\$50) and (23,600, \\$30). Downward sloping. Parallel shift right. At every price, new curve is 18% to the right of original. Rightward shift = demand increase. More households buying organic groceries at every price point."
            },
            {
              "step": "Part (c): Interpret results",
              "explanation": "Income increase shifted demand right because: Organic groceries are normal good (demand rises with income). Higher income → greater purchasing power → can afford more. Income elasticity > 1 means organic groceries are luxury good. Demand rises faster than income (18% vs. 15%). Higher-income households prioritize organic food. Real-world context: Economic expansion raises incomes → demand for normal goods increases. Organic food industry benefits from income growth. Farmers can sell more at every price—both price and quantity can rise."
            }
          ],
          "final_answer": "(a) New demand: 11,800 households at \\$50/week (was 10,000); 23,600 households at \\$30/week (was 20,000)—18% increase at all prices. (b) Demand curve shifts right by 18% at every price level. (c) Income increase shifts demand right for normal goods. Organic groceries are luxury goods (income elasticity 1.2 > 1), so demand rises faster than income. Economic growth benefits markets for normal goods, especially luxuries.",
          "concept_applied": "Income changes shift demand curves for normal goods (income ↑ → demand ↑). The magnitude of shift depends on income elasticity. Normal goods with elasticity > 1 (luxuries) experience larger demand increases than income increases. Normal goods with elasticity < 1 (necessities) experience smaller demand increases. Income is a powerful demand determinant, especially for income-sensitive goods."
        }
      ],
      "image": {
        "src": "images/unit3/income_demand_shift.png",
        "alt": "Two panels: normal good showing rightward shift with income increase, inferior good showing leftward shift with income increase",
        "caption": "Income effects: normal goods—demand shifts right when income rises; inferior goods—demand shifts left when income rises"
      }
    },
    {
      "section_title": "Prices of Related Goods: Substitutes and Complements",
      "introduction": "The prices of related goods significantly affect demand. Substitutes are goods that can replace each other, while complements are goods used together. Price changes for related goods shift demand for the good in question.",
      "key_concept": {
        "definition": "Related goods come in two types: (1) Substitutes—goods that can be used in place of each other (Coke and Pepsi, butter and margarine, coffee and tea). When substitute's price rises, demand for the good increases (people switch to the now-relatively-cheaper good). When substitute's price falls, demand for the good decreases. (2) Complements—goods used together (coffee and cream, cars and gasoline, printers and ink). When complement's price rises, demand for the good decreases (bundle becomes more expensive). When complement's price falls, demand for the good increases (bundle becomes cheaper).<br><br>Whether goods are substitutes, complements, or unrelated depends on consumer usage patterns, not inherent characteristics.",
        "context": "Most goods have both substitutes and complements. Strong substitutes create competitive pressure between products. Strong complements create linked demand—selling one good creates demand for the other. Understanding these relationships is crucial for business strategy and market analysis."
      },
      "principles": [
        {
          "principle": "Substitute Price Increase → Demand Increases (Rightward Shift)",
          "statement": "When a substitute's price rises, demand for the good increases because the good becomes relatively cheaper compared to the substitute. Consumers switch to the now-better-value alternative.",
          "application": "Competitive goods: when competitor raises prices, your demand increases as customers switch to your product.",
          "example": "Coca-Cola and Pepsi (close substitutes): Pepsi price rises from \\$1.50 to \\$2.00 (33% increase). Coke price unchanged at \\$1.50. Before: At \\$1.50, Coke and Pepsi equally attractive → Coke demand at certain level. After: At \\$1.50, Coke now cheaper than Pepsi (\\$1.50 vs. \\$2.00). Some Pepsi consumers switch to Coke. At \\$1.50 Coke price, quantity demanded increases from 1 million to 1.3 million cases. Coke demand curve shifts right. Substitute price increase → demand increase."
        },
        {
          "principle": "Substitute Price Decrease → Demand Decreases (Leftward Shift)",
          "statement": "When a substitute's price falls, demand for the good decreases because the substitute becomes relatively cheaper. Consumers switch to the now-better-value substitute.",
          "application": "Competitive threat: when competitor lowers prices, your demand decreases as customers defect.",
          "example": "Butter and margarine (substitutes): Margarine price falls from \\$3 to \\$2 per pound (33% decrease). Butter price unchanged at \\$4 per pound. Before: At \\$4, butter demand at certain level (some prefer butter despite premium). After: Margarine now very cheap (\\$2 vs. \\$4 butter—50% cheaper). Price-sensitive consumers switch from butter to margarine. At \\$4 butter price, quantity demanded decreases from 500,000 to 400,000 pounds. Butter demand curve shifts left. Substitute price decrease → demand decrease."
        },
        {
          "principle": "Complement Price Increase → Demand Decreases (Leftward Shift)",
          "statement": "When a complement's price rises, demand for the good decreases because the total cost of using them together increases. The bundle becomes less affordable or attractive.",
          "application": "Goods used together: when one becomes expensive, demand for both falls.",
          "example": "Printers and ink cartridges (complements): Ink price doubles from \\$20 to \\$40 per cartridge. Printer price unchanged at \\$100. Before: Total printing cost over 2 years: \\$100 printer + \\$200 ink (10 cartridges × \\$20) = \\$300. After: Total printing cost: \\$100 printer + \\$400 ink (10 cartridges × \\$40) = \\$500. Printing becomes much more expensive. At \\$100 printer price, quantity demanded decreases from 200,000 to 150,000 units. Printer demand curve shifts left. Expensive ink reduces printer demand. Complement price increase → demand decrease."
        },
        {
          "principle": "Complement Price Decrease → Demand Increases (Rightward Shift)",
          "statement": "When a complement's price falls, demand for the good increases because the total cost of using them together decreases. The bundle becomes more affordable and attractive.",
          "application": "Price reductions for complements boost demand for both goods in the bundle.",
          "example": "Electric vehicles and electricity (complements): Electricity price falls 30% due to solar power. EV price unchanged at \\$40,000. Before: Total 5-year cost: \\$40,000 car + \\$3,000 electricity = \\$43,000. After: Total 5-year cost: \\$40,000 car + \\$2,100 electricity = \\$42,100. EV ownership becomes cheaper (lower operating costs). At \\$40,000 EV price, quantity demanded increases from 100,000 to 120,000 vehicles. EV demand curve shifts right. Cheap electricity increases EV demand. Complement price decrease → demand increase."
        }
      ],
      "worked_examples": [
        {
          "title": "Related Goods Price Changes",
          "problem": "Coffee market analysis. Original coffee demand: At \\$4/cup, 10,000 cups/day. At \\$3/cup, 15,000 cups/day. Events: (a) Tea (substitute) price increases 40%, (b) Cream (complement) price increases 50%, (c) Both occur simultaneously. Assume: 20% of coffee drinkers switch from tea when tea price rises 40%. 15% of coffee drinkers stop using cream when cream price rises 50%, reducing their coffee consumption by half. Analyze each scenario's effect on coffee demand.",
          "step_by_step": [
            {
              "step": "Event (a): Tea price increases 40%",
              "explanation": "Tea is coffee substitute. Tea becomes more expensive → some tea drinkers switch to coffee. 20% of current coffee drinkers are tea switchers when tea price rises 40%. At \\$4: Original 10,000 cups. Switchers: 20% × 10,000 = 2,000 additional cups. New: 10,000 + 2,000 = 12,000 cups. At \\$3: Original 15,000 cups. Switchers: 20% × 15,000 = 3,000 additional cups. New: 15,000 + 3,000 = 18,000 cups. Coffee demand shifts right by 20% at all prices. Substitute price increase → demand increase."
            },
            {
              "step": "Event (b): Cream price increases 50%",
              "explanation": "Cream is coffee complement. Cream becomes expensive → some cream users reduce coffee consumption. 15% of coffee drinkers use cream and reduce coffee by half when cream is expensive. At \\$4: Original 10,000 cups. Cream users reducing: 15% × 10,000 = 1,500 people. Reduction: 1,500 × 50% = 750 cups. New: 10,000 - 750 = 9,250 cups. At \\$3: Original 15,000 cups. Cream users reducing: 15% × 15,000 = 2,250 people. Reduction: 2,250 × 50% = 1,125 cups. New: 15,000 - 1,125 = 13,875 cups. Coffee demand shifts left by 7.5% at all prices. Complement price increase → demand decrease."
            },
            {
              "step": "Event (c): Both occur simultaneously",
              "explanation": "Combine effects from (a) and (b): At \\$4: Tea switchers: +2,000 cups (from a). Cream reducers: -750 cups (from b). Net: +2,000 - 750 = +1,250 cups. New: 10,000 + 1,250 = 11,250 cups. At \\$3: Tea switchers: +3,000 cups (from a). Cream reducers: -1,125 cups (from b). Net: +3,000 - 1,125 = +1,875 cups. New: 15,000 + 1,875 = 16,875 cups. Net effect: Demand shifts right by 12.5% at all prices. Substitute effect (+20%) dominates complement effect (-7.5%). Overall: coffee demand increases."
            }
          ],
          "final_answer": "(a) Tea price increase: Coffee demand shifts right by 20% (substitute effect—tea drinkers switch to coffee). (b) Cream price increase: Coffee demand shifts left by 7.5% (complement effect—cream users reduce coffee). (c) Both occur: Net effect is rightward shift of 12.5% (substitute effect dominates). Real-world: Multiple related goods can shift demand in different directions; net effect depends on relative magnitudes.",
          "concept_applied": "Prices of related goods shift demand curves. Substitute price increases shift demand right (consumers switch to the good). Complement price increases shift demand left (bundle becomes expensive). When multiple related goods change prices, effects can offset or reinforce—net shift depends on relative magnitudes. Understanding substitutes and complements is essential for predicting demand responses to market changes."
        }
      ],
      "image": {
        "src": "images/unit3/related_goods_shifts.png",
        "alt": "Four panels showing: substitute price rise (demand right), substitute price fall (demand left), complement price rise (demand left), complement price fall (demand right)",
        "caption": "Related goods effects: substitute prices move with demand in same direction; complement prices move with demand in opposite direction"
      }
    },
    {
      "section_title": "Tastes, Preferences, and Expectations",
      "introduction": "Consumer tastes, preferences, and expectations about the future are powerful determinants of demand. Changes in what people want or expect can dramatically shift demand curves.",
      "key_concept": {
        "definition": "Tastes and preferences represent consumers' subjective desires and values—what they want and how much they value different goods. Preferences change due to: advertising and marketing, information and news, social trends and fashion, health and safety information, cultural shifts, personal experiences.<br><br>When preferences for a good increase, demand shifts right (want more at every price). When preferences decrease, demand shifts left (want less at every price).<br><br>Expectations about future prices, income, or availability also affect current demand: Expect higher future prices → buy more now (demand increases). Expect lower future prices → buy less now, wait (demand decreases). Expect higher future income → buy more now (demand increases if can borrow). Expect shortages → buy more now (stock up, demand increases).",
        "context": "Preferences and expectations are often difficult to measure or predict, making them challenging determinants to analyze. But their effects on demand can be powerful and rapid—preferences can shift overnight based on news or trends."
      },
      "principles": [
        {
          "principle": "Increased Preference → Demand Increases (Rightward Shift)",
          "statement": "When consumers' desire for a good increases—due to advertising, information, trends, or other factors—demand shifts right. Want more at every price regardless of price changes.",
          "application": "Successful marketing, positive news, or favorable trends increase demand by changing preferences.",
          "example": "Plant-based meat: Documentary on health benefits of plant-based diets goes viral. Preferences shift: More consumers value plant-based eating. Want plant-based meat even at same prices. At \\$8/pound: Original demand 1 million pounds/month. New demand 1.8 million pounds/month (80% increase). Demand curve shifts right. Price unchanged, but quantity demanded increased due to changed preferences."
        },
        {
          "principle": "Decreased Preference → Demand Decreases (Leftward Shift)",
          "statement": "When consumers' desire for a good decreases—due to negative information, changing fashion, or other factors—demand shifts left. Want less at every price.",
          "application": "Negative publicity, health scares, or unfavorable trends decrease demand by changing preferences.",
          "example": "Sugary sodas: Health studies link soda to obesity, diabetes. Public awareness increases. Preferences shift: More consumers avoid sugary drinks. Want less soda even at same prices. At \\$1.50/bottle: Original demand 10 million bottles/day. New demand 7 million bottles/day (30% decrease). Demand curve shifts left. Price unchanged, but quantity demanded decreased due to health concerns."
        },
        {
          "principle": "Expect Higher Future Prices → Current Demand Increases",
          "statement": "If consumers expect prices to rise in the future, they increase current demand to buy before the increase. Expectation of future price increase shifts current demand right.",
          "application": "Anticipated price hikes cause stockpiling and advance purchases, increasing current demand.",
          "example": "Gasoline before hurricane: News: Hurricane approaching, may disrupt refineries. Expectation: Gas prices will spike next week. Current behavior: Drivers fill tanks now (buy before price rise). At current \\$3/gallon: Normal demand 10 million gallons/day. Anticipatory demand 15 million gallons/day. Current demand shifts right. Stockpiling today (expecting higher prices tomorrow)."
        },
        {
          "principle": "Expect Lower Future Prices → Current Demand Decreases",
          "statement": "If consumers expect prices to fall in the future, they decrease current demand to wait for the decrease. Expectation of future price decrease shifts current demand left.",
          "application": "Anticipated sales or discounts reduce current demand as consumers wait for better prices.",
          "example": "Electronics before holiday sales: November: Consumers know Black Friday sales coming in 2 weeks. Expectation: Prices will drop 30% soon. Current behavior: Delay purchases, wait for sales. At current \\$500 price: Normal demand 100,000 units/week. Pre-sale demand 60,000 units/week. Current demand shifts left. Waiting for better prices (expecting future decrease)."
        },
        {
          "principle": "Number of Buyers Changes Shift Market Demand",
          "statement": "When more buyers enter the market (population growth, expanded access, new demographics), market demand shifts right. When buyers leave (population decline, exit, changing demographics), market demand shifts left.",
          "application": "Population growth, market expansion, and demographic shifts affect total demand.",
          "example": "Smartphones in developing country: Initially: 10% of population has smartphones (10 million users). Internet infrastructure expands. Now: 30% of population has smartphones (30 million users). At \\$200 price: Original demand 10 million phones. New demand 30 million phones. Market demand tripled. Demand curve shifts right dramatically. More buyers → greater market demand."
        }
      ],
      "worked_examples": [
        {
          "title": "Preferences and Expectations Effects",
          "problem": "Market for solar panels. Original demand: At \\$10,000, 50,000 installations/year. At \\$8,000, 75,000 installations/year. Events: (a) Government announces tax credit will expire next year, (b) Study shows solar panels increase home values 5%, (c) Electricity prices expected to rise 40% over next 5 years. Analyze effect of each event on current solar panel demand.",
          "step_by_step": [
            {
              "step": "Event (a): Tax credit expiring next year",
              "explanation": "Expectation: Tax credit available now, gone next year. Effective price: With credit, panels cost \\$7,000 now (\\$10,000 - \\$3,000 credit). Without credit next year, panels cost \\$10,000. Rational response: Buy now to get credit before expiration. Current demand increases: At \\$10,000 (actually \\$7,000 with credit): Demand increases from 50,000 to perhaps 80,000 installations. At \\$8,000 (actually \\$5,000 with credit): Demand increases from 75,000 to perhaps 110,000 installations. Demand curve shifts right. Advance purchases (expecting worse terms next year). Note: This creates intertemporal substitution—borrowing from future demand."
            },
            {
              "step": "Event (b): Solar panels increase home values 5%",
              "explanation": "New information: Solar panels add value beyond electricity savings. Median home \\$200,000 + panels = \\$210,000 (5% increase). Net cost: \\$10,000 panels - \\$10,000 home value increase = \\$0 net cost (financially neutral). Preference change: Panels now seen as investment, not just expense. More homeowners interested. Demand increases: At \\$10,000: Demand increases from 50,000 to perhaps 70,000 installations. Many fence-sitters convinced by home value benefit. Demand curve shifts right. Changed preferences due to new information."
            },
            {
              "step": "Event (c): Electricity prices expected to rise 40%",
              "explanation": "Expectation: Electricity costs rising dramatically. Current electricity: \\$150/month. Expected future: \\$210/month (40% increase). Solar savings: Currently save \\$150/month with panels. Future: Save \\$210/month with panels (higher value). Preference change: Solar panels become more attractive investment. Higher future savings → better payback. Demand increases: At \\$10,000: Demand increases from 50,000 to perhaps 75,000 installations. Better economics due to expected electricity price increases. Demand curve shifts right. Expectations about future costs change current demand."
            },
            {
              "step": "Combined effect",
              "explanation": "All three factors shift demand right: Tax credit expiring: Urgent need to buy now (+30,000 installations at \\$10,000). Home value increase: Improved value proposition (+20,000 installations). Electricity price expectations: Better future savings (+25,000 installations). Combined effect: At \\$10,000: Demand could increase from 50,000 to 125,000 installations (150% increase). Massive rightward shift. Multiple positive factors reinforcing. Solar industry boom from expectations and preference changes."
            }
          ],
          "final_answer": "(a) Tax credit expiring increases current demand (buy now before expiration). (b) Home value information increases demand (changed preferences—panels seen as investment). (c) Electricity price expectations increase demand (better future savings). Combined: Demand shifts right dramatically as all three factors reinforce. Expectations and preferences are powerful demand determinants that can create rapid, large shifts.",
          "concept_applied": "Expectations about future prices, policies, or costs shift current demand. Positive expectations (better terms now, worse later) increase current demand. New information changes preferences by revealing benefits or costs. Multiple factors can reinforce (all shift same direction) or offset (shift opposite directions). Preference and expectation changes can cause rapid, substantial demand shifts—important for understanding market volatility."
        }
      ],
      "image": {
        "src": "images/unit3/preferences_expectations.png",
        "alt": "Multiple panels showing demand shifts from: positive news, negative news, expected price increase, expected price decrease",
        "caption": "Preferences and expectations: positive changes shift demand right; negative changes shift demand left; future price expectations affect current demand"
      }
    }
  ],
  "key_terms": [
    "Determinants of demand",
    "Demand shifters",
    "Normal goods",
    "Inferior goods",
    "Substitutes",
    "Complements",
    "Related goods",
    "Tastes and preferences",
    "Expectations",
    "Number of buyers",
    "Market size",
    "Income effect on demand",
    "Substitute effect",
    "Complement effect",
    "Rightward shift",
    "Leftward shift"
  ],
  "summary": "Determinants of demand (demand shifters) are non-price factors that change the quantity demanded at every price level, causing the entire demand curve to shift rather than movement along the curve.<br><br>The main determinants are: (1) Consumer income—changes in purchasing power affect demand differently for normal goods (income ↑ → demand ↑) versus inferior goods (income ↑ → demand ↓). Most goods are normal goods where income and demand move together. The magnitude of income effect varies by good—luxuries are highly income-sensitive while necessities barely respond to income changes. Income distribution also matters, as redistribution toward high-spending groups increases aggregate demand.<br><br>(2) Prices of related goods affect demand through two channels: Substitutes are goods that can replace each other—when substitute's price rises, demand for the good increases (people switch to the now-relatively-cheaper alternative), and when substitute's price falls, demand decreases (people switch to the now-cheaper substitute). Complements are goods used together—when complement's price rises, demand for the good decreases (the bundle becomes more expensive), and when complement's price falls, demand increases (the bundle becomes cheaper). The strength of these effects depends on how closely goods are related.<br><br>(3) Tastes and preferences represent consumers' subjective desires—when preference for a good increases (due to advertising, positive information, social trends, health news), demand shifts right, and when preference decreases (due to negative information, changing fashion, health scares), demand shifts left. Preferences can shift rapidly and dramatically based on news, trends, or information.<br><br>(4) Expectations about future conditions affect current demand—expecting higher future prices causes current demand to increase (buy now before increase), expecting lower future prices causes current demand to decrease (wait for better prices), expecting higher future income increases current demand (if can borrow), and expecting shortages increases current demand (stockpiling).<br><br>(5) Number of buyers affects market demand—when more buyers enter the market (population growth, expanded access, new demographics), market demand shifts right, and when buyers exit (population decline, market contraction), demand shifts left.<br><br>These demand shifters are fundamentally different from price changes: price changes cause movements along the demand curve (change in quantity demanded), while non-price determinants cause shifts of the entire curve (change in demand). Understanding this distinction is critical for economic analysis.<br><br>When determinants change, the demand curve shifts: rightward shift (increase in demand) means higher quantity demanded at every price—curve moves to the right. Leftward shift (decrease in demand) means lower quantity demanded at every price—curve moves to the left.<br><br>Multiple determinants can change simultaneously—effects may reinforce each other (all shift same direction creating large net shift) or offset each other (shift opposite directions creating small net shift or no change). The net effect depends on relative magnitudes of individual shifts.<br><br>Understanding determinants of demand enables: predicting market responses to economic changes (recessions decrease demand for normal goods, increase demand for inferior goods), distinguishing correlation from causation (did quantity change because of price or because income/preferences/related goods changed?), analyzing policy effects (how subsidies for complements or taxes on substitutes affect demand), forecasting trends (demographic shifts, cultural changes, technological innovations all shift demand), and making business decisions (when to expand, how to position products, what marketing emphasis).<br><br>Demand analysis is dynamic, not static—real-world demand curves constantly shift in response to changing economic conditions, consumer preferences, expectations, and market environments. Mastering determinants of demand transforms understanding from simple price-quantity relationships to comprehensive analysis of how markets respond to the complex, interrelated factors shaping consumer behavior in actual economies."
}
