{
  "title": "3.5 Law of Supply",
  "expanded_description": "Understanding the fundamental direct relationship between price and quantity supplied, analyzing producer behavior and profit maximization, and examining how supply curves represent producer willingness to sell under the ceteris paribus assumption.",
  "core_concept": {
    "principle": "The law of supply states that, ceteris paribus, there is a direct relationship between the price of a good and the quantity supplied - as price increases, quantity supplied increases, and as price decreases, quantity supplied decreases.",
    "explanation": "This direct relationship occurs because higher prices make production more profitable, encouraging firms to increase output and allocate more resources toward production. The supply curve graphically represents this relationship, sloping upward from left to right, showing the various quantities producers are willing and able to sell at different price levels during a specific time period. The law of supply reflects producer profit-maximizing behavior and the increasing marginal costs of production.",
    "image": {
      "url": "/images/economics/supply-curve.svg",
      "alt": "Supply curve",
      "caption": "Upward-sloping supply curve showing direct price-quantity relationship"
    }
  },
  "sections": [
    {
      "section_title": "The Law of Supply and Producer Behavior",
      "introduction": "The law of supply explains how producers respond to price changes based on profit incentives and cost structures, forming the foundation for understanding market production decisions and resource allocation in competitive markets.",
      "key_concept": {
        "definition": "The law of supply is the economic principle that states, all other factors being equal, as the price of a good or service increases, the quantity supplied by producers increases, and as the price decreases, the quantity supplied decreases.",
        "context": "This fundamental relationship drives producer decision-making and market production levels, reflecting how businesses allocate resources and adjust output in response to changing market prices and profit opportunities.",
        "image": {
          "url": "/images/economics/law-supply-graph.svg",
          "alt": "Law of supply graph",
          "caption": "Visual representation of the direct price-quantity relationship"
        }
      },
      "classifications": [
        {
          "type": "Profit Maximization",
          "value": "Revenue-cost optimization",
          "characteristics": ["Marginal revenue", "Marginal cost", "Production decisions", "Output adjustment"],
          "behavior": "Producers increase output when prices rise because higher prices increase marginal revenue, making additional production profitable until marginal cost equals the new higher price.",
          "examples": [
            {
              "process": "Output Expansion",
              "explanation": "When wheat prices increase from $\\$4$ to $\\$6$ per bushel, farmers expand production because the higher price covers the additional costs of cultivating more land or using more intensive farming methods.",
              "image": {
                "url": "/images/economics/profit-maximization-supply.svg",
                "alt": "Profit maximization supply",
                "caption": "How price changes affect production decisions"
              }
            },
            {
              "process": "Marginal Cost Pricing",
              "explanation": "Producers set output where $P = MC$ to maximize profits, so higher prices justify production where marginal costs are higher, increasing total quantity supplied.",
              "image": {
                "url": "/images/economics/marginal-cost-pricing.svg",
                "alt": "Marginal cost pricing",
                "caption": "Profit-maximizing output determination"
              }
            }
          ]
        },
        {
          "type": "Increasing Opportunity Costs",
          "value": "Resource allocation trade-offs",
          "characteristics": ["Resource specialization", "Production trade-offs", "Alternative uses", "Efficiency losses"],
          "behavior": "As production increases, producers must use resources that are less efficient or specialized for that particular production, leading to higher marginal costs and requiring higher prices to justify additional output.",
          "examples": [
            {
              "process": "Resource Reallocation",
              "explanation": "To produce more cars, manufacturers might need to use factory space and workers that are better suited for truck production, incurring efficiency losses that increase costs.",
              "image": {
                "url": "/images/economics/opportunity-costs-supply.svg",
                "alt": "Opportunity costs supply",
                "caption": "How resource constraints affect production costs"
              }
            },
            {
              "process": "Land Use Patterns",
              "explanation": "Farmers use their most fertile land first at lower prices, but must cultivate less productive land to increase output, requiring higher prices to cover additional costs.",
              "image": {
                "url": "/images/economics/land-use-supply.svg",
                "alt": "Land use supply",
                "caption": "Declining productivity with expanded production"
              }
            }
          ]
        },
        {
          "type": "Supply Schedule and Curve",
          "value": "Representing supply relationships",
          "characteristics": ["Price-quantity pairs", "Upward slope", "Ceteris paribus", "Willingness and ability to sell"],
          "behavior": "A supply schedule shows specific price-quantity combinations, while the supply curve plots these points to create a smooth upward-sloping line representing the law of supply.",
          "examples": [
            {
              "process": "Constructing Supply Schedule",
              "explanation": "A table listing various prices and the corresponding quantities producers would supply at each price, holding other factors constant.",
              "image": {
                "url": "/images/economics/supply-schedule-construction.svg",
                "alt": "Supply schedule construction",
                "caption": "Creating a supply schedule from producer data"
              }
            },
            {
              "process": "Plotting Supply Curve",
              "explanation": "Transferring price-quantity pairs from the supply schedule to a graph, with price on vertical axis and quantity on horizontal axis, then connecting points to form the supply curve.",
              "image": {
                "url": "/images/economics/supply-curve-plotting.svg",
                "alt": "Supply curve plotting",
                "caption": "From schedule to graphical representation"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Quantity Supplied at Different Prices",
          "problem": "Given the supply function $Q_s = -20 + 4P$, where $Q_s$ is quantity supplied and $P$ is price, calculate the quantity supplied at prices of $\\$10$, $\\$15$, $\\$20$, $\\$25$, and $\\$30$. Create a supply schedule and plot the supply curve.",
          "step_by_step": [
            {
              "step": "At $P = 10$",
              "explanation": "Substitute $P=10$ into the supply function",
              "calculation": "$Q_s = -20 + 4(10) = -20 + 40 = 20$ units"
            },
            {
              "step": "At $P = 15$",
              "explanation": "Substitute $P=15$ into the supply function",
              "calculation": "$Q_s = -20 + 4(15) = -20 + 60 = 40$ units"
            },
            {
              "step": "At $P = 20$",
              "explanation": "Substitute $P=20$ into the supply function",
              "calculation": "$Q_s = -20 + 4(20) = -20 + 80 = 60$ units"
            },
            {
              "step": "At $P = 25$",
              "explanation": "Substitute $P=25$ into the supply function",
              "calculation": "$Q_s = -20 + 4(25) = -20 + 100 = 80$ units"
            },
            {
              "step": "At $P = 30$",
              "explanation": "Substitute $P=30$ into the supply function",
              "calculation": "$Q_s = -20 + 4(30) = -20 + 120 = 100$ units"
            }
          ],
          "final_answer": "The supply schedule shows: $P=\\$10\\rightarrow Q=20$, $P=\\$15\\rightarrow Q=40$, $P=\\$20\\rightarrow Q=60$, $P=\\$25\\rightarrow Q=80$, $P=\\$30\\rightarrow Q=100$. The supply curve slopes upward, demonstrating the law of supply - as price increases from $\\$10$ to $\\$30$, quantity supplied increases from 20 to 100 units.",
          "concept_applied": "The direct relationship between price and quantity supplied is clearly demonstrated, with higher prices resulting in higher quantities supplied, consistent with the law of supply.",
          "image": {
            "url": "/images/economics/supply-calculation-graph.svg",
            "alt": "Supply calculation graph",
            "caption": "Supply curve from calculated price-quantity pairs"
          }
        }
      ],
      "principles": [
        {
          "principle": "Increasing Marginal Costs",
          "statement": "As a producer increases output, the additional cost of producing each successive unit (marginal cost) increases due to diminishing returns and resource constraints, explaining why producers require higher prices to supply additional units.",
          "application": "This principle explains the upward slope of the supply curve - producers need higher prices to cover the increasing costs of additional production, particularly in the short run when some inputs are fixed.",
          "example": "A bakery can easily increase output from 100 to 200 loaves with minimal cost increases, but expanding from 900 to 1000 loaves may require overtime pay, less efficient equipment, or premium ingredients, significantly increasing marginal costs.",
          "analogy": "Like climbing a hill - the first steps are easy, but as you go higher, each additional step requires more effort, just as each additional unit of production requires more resources and higher costs.",
          "image": {
            "url": "/images/economics/increasing-marginal-costs.svg",
            "alt": "Increasing marginal costs",
            "caption": "Rising production costs with expanded output"
          }
        }
      ]
    },
    {
      "section_title": "Factors Influencing Supply",
      "introduction": "While the law of supply focuses on the price-quantity relationship, numerous other factors influence producer supply decisions, causing the entire supply curve to shift rather than moving along a fixed curve.",
      "key_concept": {
        "definition": "Supply shifters are factors other than price that change producer supply, causing the entire supply curve to move left (decrease in supply) or right (increase in supply), representing changes in the quantity supplied at every price level.",
        "context": "Understanding these factors is crucial for distinguishing between movements along the supply curve (price changes) and shifts of the supply curve (changes in other determinants).",
        "image": {
          "url": "/images/economics/supply-shifters.svg",
          "alt": "Supply shifters",
          "caption": "Factors that cause the supply curve to shift"
        }
      },
      "classifications": [
        {
          "type": "Input Prices",
          "value": "Production cost changes",
          "characteristics": ["Raw materials", "Labor costs", "Energy prices", "Capital costs"],
          "behavior": "When input prices decrease, supply increases (curve shifts right) because production becomes more profitable at each price level. When input prices increase, supply decreases (curve shifts left).",
          "examples": [
            {
              "process": "Raw Material Costs",
              "explanation": "If lumber prices decrease, furniture supply increases because producers can profitably supply more furniture at each price level due to lower production costs.",
              "image": {
                "url": "/images/economics/input-prices-supply.svg",
                "alt": "Input prices supply",
                "caption": "How production costs affect supply"
              }
            },
            {
              "process": "Labor Cost Changes",
              "explanation": "If minimum wage increases, supply of labor-intensive goods may decrease because higher labor costs reduce profitability at each price level.",
              "image": {
                "url": "/images/economics/labor-costs-supply.svg",
                "alt": "Labor costs supply",
                "caption": "How wage changes affect production decisions"
              }
            }
          ]
        },
        {
          "type": "Technology and Productivity",
          "value": "Production efficiency changes",
          "characteristics": ["Technological innovation", "Process improvements", "Automation", "Efficiency gains"],
          "behavior": "Technological improvements increase supply (curve shifts right) by reducing production costs and increasing output per unit of input. Technological regressions decrease supply (curve shifts left).",
          "examples": [
            {
              "process": "Manufacturing Technology",
              "explanation": "Automation in car manufacturing increases supply by reducing labor costs and increasing production speed, allowing more cars to be supplied at each price level.",
              "image": {
                "url": "/images/economics/technology-supply.svg",
                "alt": "Technology supply",
                "caption": "How innovation increases production capacity"
              }
            },
            {
              "process": "Agricultural Technology",
              "explanation": "Improved seeds and farming techniques increase crop supply by boosting yields and reducing losses, shifting agricultural supply curves rightward.",
              "image": {
                "url": "/images/economics/agricultural-technology.svg",
                "alt": "Agricultural technology",
                "caption": "Productivity improvements in farming"
              }
            }
          ]
        },
        {
          "type": "Producer Expectations and Number of Sellers",
          "value": "Market structure changes",
          "characteristics": ["Future price expectations", "Market entry/exit", "Industry competition", "Business formation"],
          "behavior": "Expectations of future price increases may decrease current supply as producers withhold inventory. Increasing numbers of sellers increases market supply, while decreasing numbers reduces supply.",
          "examples": [
            {
              "process": "Price Expectations",
              "explanation": "If oil producers expect higher prices next year, they may reduce current supply to save inventory for future sale, shifting current supply leftward.",
              "image": {
                "url": "/images/economics/expectations-supply.svg",
                "alt": "Expectations supply",
                "caption": "How future price outlook affects current supply"
              }
            },
            {
              "process": "Market Entry",
              "explanation": "When new restaurants open in a neighborhood, the total supply of restaurant meals increases, shifting the market supply curve rightward.",
              "image": {
                "url": "/images/economics/market-entry-supply.svg",
                "alt": "Market entry supply",
                "caption": "How competition affects market supply"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Analyzing Supply Shifts vs Movements",
          "problem": "The market for smartphones has an initial supply of $Q_s = -100 + 5P$. Analyze what happens to supply in these scenarios: (a) Price increases from $\\$200$ to $\\$250$, (b) A new manufacturing technology reduces production costs by $20\\%$, (c) Component prices increase by $15\\%$.",
          "step_by_step": [
            {
              "step": "Scenario A: Price Increase",
              "explanation": "This causes a movement along the supply curve, not a shift",
              "calculation": "$\\text{At } P=\\$200: Q_s=-100+5(200)=900$ | $\\text{At } P=\\$250: Q_s=-100+5(250)=1150$ | $\\text{Movement along curve: quantity increases from 900 to 1150}$"
            },
            {
              "step": "Scenario B: Technology Improvement",
              "explanation": "This shifts the entire supply curve rightward",
              "calculation": "$\\text{New supply might be } Q_s = -50 + 5P$ | $\\text{At original } P=\\$200: Q_s \\text{ increases from 900 to 950}$ | $\\text{Entire curve shifts right}$"
            },
            {
              "step": "Scenario C: Input Price Increase",
              "explanation": "This shifts the entire supply curve leftward",
              "calculation": "$\\text{New supply might be } Q_s = -150 + 5P$ | $\\text{At original } P=\\$200: Q_s \\text{ decreases from 900 to 850}$ | $\\text{Entire curve shifts left}$"
            }
          ],
          "final_answer": "Scenario A shows movement along the supply curve (price change affecting quantity supplied). Scenario B shows a rightward supply shift (technology improvement increasing supply at all prices). Scenario C shows a leftward supply shift (input cost increase reducing supply at all prices). Understanding this distinction is crucial for proper supply analysis.",
          "concept_applied": "Price changes cause movements along a fixed supply curve, while changes in other factors (technology, input costs, expectations) cause the entire supply curve to shift, changing quantity supplied at every price level.",
          "image": {
            "url": "/images/economics/supply-shift-vs-movement.svg",
            "alt": "Supply shift vs movement",
            "caption": "Difference between supply curve shifts and movements"
          }
        }
      ],
      "principles": [
        {
          "principle": "Ceteris Paribus Condition in Supply",
          "statement": "The law of supply holds only when all other factors affecting supply remain constant, allowing us to isolate and analyze the pure relationship between price and quantity supplied without contamination from other changing variables.",
          "application": "This assumption is essential for economic modeling and analysis, enabling clear understanding of causal relationships by holding potentially confounding variables constant while examining price effects.",
          "example": "When studying how oil price changes affect production, we assume no simultaneous changes in drilling technology, labor costs, or environmental regulations.",
          "analogy": "Like a scientific experiment where you test one variable at a time while holding all others constant to determine its specific effect on the outcome.",
          "image": {
            "url": "/images/economics/ceteris-paribus-supply.svg",
            "alt": "Ceteris paribus supply",
            "caption": "Isolating price-quantity relationship in supply"
          }
        }
      ]
    },
    {
      "section_title": "Time Periods and Supply Elasticity",
      "introduction": "The responsiveness of supply to price changes varies significantly across different time horizons, with supply being more elastic in the long run when producers can fully adjust all inputs and production processes.",
      "key_concept": {
        "definition": "Supply elasticity measures how responsive quantity supplied is to price changes, with time period being a crucial determinant - immediate run (perfectly inelastic), short run (somewhat elastic), and long run (highly elastic) supply show different responsiveness patterns.",
        "context": "Understanding how supply responsiveness evolves over time is essential for predicting market adjustments to price changes and designing effective economic policies.",
        "image": {
          "url": "/images/economics/time-supply-elasticity.svg",
          "alt": "Time and supply elasticity",
          "caption": "How supply responsiveness changes across time periods"
        }
      },
      "classifications": [
        {
          "type": "Market Period (Immediate Run)",
          "value": "Fixed supply constraints",
          "characteristics": ["Perfectly inelastic", "Fixed output", "No production adjustment", "Inventory sales only"],
          "behavior": "In the immediate run, supply is perfectly inelastic because production cannot be changed - only existing inventory can be sold, regardless of price changes.",
          "examples": [
            {
              "process": "Agricultural Harvest",
              "explanation": "Once a crop is harvested, the supply is fixed until the next growing season - higher prices cannot increase current supply, only affect how much inventory is sold.",
              "image": {
                "url": "/images/economics/market-period-supply.svg",
                "alt": "Market period supply",
                "caption": "Perfectly inelastic supply in immediate run"
              }
            },
            {
              "process": "Concert Tickets",
              "explanation": "For a specific concert, the number of seats is fixed - higher prices cannot create more seats, making supply perfectly inelastic once the venue is sold out.",
              "image": {
                "url": "/images/economics/fixed-capacity-supply.svg",
                "alt": "Fixed capacity supply",
                "caption": "Capacity constraints creating inelastic supply"
              }
            }
          ]
        },
        {
          "type": "Short Run",
          "value": "Partial adjustment capability",
          "characteristics": ["Some elasticity", "Variable inputs adjustable", "Fixed capital", "Limited expansion"],
          "behavior": "In the short run, supply is somewhat elastic as producers can adjust variable inputs (labor, materials) but cannot change fixed inputs (factories, equipment), allowing limited production increases.",
          "examples": [
            {
              "process": "Manufacturing Output",
              "explanation": "A factory can increase output by adding shifts or overtime, but cannot immediately build new factories, making supply moderately elastic in the short run.",
              "image": {
                "url": "/images/economics/short-run-supply.svg",
                "alt": "Short run supply",
                "caption": "Moderate supply elasticity with fixed capital"
              }
            },
            {
              "process": "Service Industry",
              "explanation": "A restaurant can extend hours or hire more waitstaff in response to higher demand, but cannot immediately expand seating capacity, creating short-run supply elasticity.",
              "image": {
                "url": "/images/economics/service-supply.svg",
                "alt": "Service supply",
                "caption": "Labor-intensive supply adjustments"
              }
            }
          ]
        },
        {
          "type": "Long Run",
          "value": "Full adjustment capability",
          "characteristics": ["Highly elastic", "All inputs variable", "New capacity", "Market entry/exit"],
          "behavior": "In the long run, supply becomes highly elastic as producers can adjust all inputs, build new capacity, and new firms can enter the market, allowing substantial production increases in response to price changes.",
          "examples": [
            {
              "process": "Industry Expansion",
              "explanation": "If solar panel prices remain high, new factories will be built and new companies will enter the market, significantly increasing supply over several years.",
              "image": {
                "url": "/images/economics/long-run-supply.svg",
                "alt": "Long run supply",
                "caption": "Highly elastic supply with full adjustment"
              }
            },
            {
              "process": "Agricultural Land Use",
              "explanation": "If crop prices remain high, farmers can convert pasture to cropland, invest in irrigation, and make other long-term adjustments that substantially increase supply.",
              "image": {
                "url": "/images/economics/agricultural-adjustment.svg",
                "alt": "Agricultural adjustment",
                "caption": "Long-term production capacity changes"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Analyzing Supply Across Time Periods",
          "problem": "The oil market experiences a price increase from $\\$60$ to $\\$90$ per barrel. Analyze how quantity supplied changes in: (a) Immediate run (existing wells only), (b) Short run (6-12 months), (c) Long run (3-5 years).",
          "step_by_step": [
            {
              "step": "Immediate Run Analysis",
              "explanation": "No time for production adjustments",
              "calculation": "$\\text{Supply perfectly inelastic}$ | $\\text{Quantity supplied remains unchanged}$ | $\\text{Only inventory drawdown possible}$"
            },
            {
              "step": "Short Run Analysis",
              "explanation": "Limited adjustments possible",
              "calculation": "$\\text{Moderate supply increase}$ | $\\text{Existing wells can increase output slightly}$ | $\\text{Maybe 5-10\\% quantity increase}$"
            },
            {
              "step": "Long Run Analysis",
              "explanation": "Full adjustment possible",
              "calculation": "$\\text{Substantial supply increase}$ | $\\text{New drilling, enhanced recovery}$ | $\\text{Possible 30-50\\% quantity increase}$"
            }
          ],
          "final_answer": "In the immediate run, oil supply is perfectly inelastic - no quantity increase despite the $50\\%$ price hike. In the short run, supply increases moderately (5-10\\%) through optimized existing operations. In the long run, supply becomes highly elastic, potentially increasing 30-50\\% through new drilling and technological investments. This demonstrates how supply elasticity increases with the time available for adjustment.",
          "concept_applied": "Supply responsiveness to price changes depends critically on the time horizon, with immediate run supply being perfectly inelastic, short run supply moderately elastic, and long run supply highly elastic as producers can fully adjust all inputs and production processes.",
          "image": {
            "url": "/images/economics/time-period-supply.svg",
            "alt": "Time period supply",
            "caption": "Evolution of supply elasticity across time horizons"
          }
        }
      ],
      "principles": [
        {
          "principle": "Time and Adjustment Principle",
          "statement": "The elasticity of supply increases with the length of the time period considered, because producers need time to adjust their production processes, change input combinations, and make capital investments in response to price changes.",
          "application": "This principle explains why price spikes often cause minimal immediate supply response but substantial long-term supply increases, and why policies affecting production need to consider appropriate time horizons for expected results.",
          "example": "When coffee prices rise due to crop failures, supply cannot increase immediately, but over several years, farmers plant more coffee trees, significantly increasing future supply.",
          "analogy": "Like steering a large ship - small immediate course corrections are possible, but major direction changes require substantial time and planning, just as production capacity adjustments require different time horizons.",
          "image": {
            "url": "/images/economics/time-adjustment-principle.svg",
            "alt": "Time adjustment principle",
            "caption": "How time affects production adjustment capacity"
          }
        }
      ]
    }
  ],
  "key_terms": [
    "Law of Supply",
    "Quantity Supplied",
    "Supply Curve",
    "Supply Schedule",
    "Direct Relationship",
    "Profit Maximization",
    "Marginal Cost",
    "Increasing Opportunity Costs",
    "Supply Shifters",
    "Input Prices",
    "Technology",
    "Producer Expectations",
    "Number of Sellers",
    "Ceteris Paribus",
    "Supply Elasticity",
    "Market Period",
    "Short Run",
    "Long Run",
    "Production Costs",
    "Resource Allocation"
  ],
  "summary": "The law of supply establishes the fundamental direct relationship between price and quantity supplied, driven by profit incentives and increasing marginal costs. This relationship is represented by upward-sloping supply curves that show producer willingness to sell at various prices. While price changes cause movements along a fixed supply curve, other factors like input costs, technology, producer expectations, and the number of sellers cause the entire curve to shift. Supply responsiveness varies significantly across time horizons, with immediate run supply being perfectly inelastic, short run supply moderately elastic, and long run supply highly elastic as producers gain more adjustment flexibility. Understanding the law of supply and its determinants provides the foundation for analyzing producer behavior, market production patterns, and resource allocation in market economies."
}
