{
  "expanded_description": "The law of supply is the fundamental principle describing producer behavior, stating that there is a positive relationship between price and quantity supplied. Just as the law of demand governs consumer behavior, the law of supply governs producer behavior. Understanding why producers supply more at higher prices and the mechanisms behind this relationship is essential for analyzing markets, predicting producer responses, and understanding how prices coordinate production decisions.",
  "core_concept": {
    "principle": "The law of supply states: There is a positive (direct) relationship between the price of a good and the quantity supplied, ceteris paribus (all other factors held constant). When price increases, quantity supplied increases. When price decreases, quantity supplied decreases. This positive relationship creates an upward-sloping supply curve—one of the foundational concepts in economics, complementing the downward-sloping demand curve.",
    "explanation": "The law of supply captures a fundamental aspect of producer behavior: higher prices make production more profitable, inducing greater supply.<br><br>Consider wheat farming: At $3 per bushel, farmers plant 50 million acres (quantity supplied = 5 billion bushels). At $5 per bushel, farmers plant 60 million acres (quantity supplied = 6 billion bushels). At $7 per bushel, farmers plant 70 million acres (quantity supplied = 7 billion bushels). At $10 per bushel, farmers plant 85 million acres (quantity supplied = 8.5 billion bushels). This pattern—higher prices leading to higher quantities supplied—reflects the law of supply in action.<br><br>Why does this happen? The law of supply works through three mechanisms:<br><br>(1) Profitability and production incentives: Higher prices lead to greater profit margins, which create stronger incentives to produce more. At a $3 wheat price, profit per bushel might be $0.50 (if cost is $2.50). At a $7 wheat price, profit per bushel is $4.50 (same $2.50 cost). Much higher profit creates a strong incentive to expand production.<br><br>(2) Rising marginal costs: Producers face increasing costs as they expand output. The first 1,000 units might cost $10 each (using best resources efficiently). The next 1,000 units might cost $15 each (needing overtime, less efficient equipment). The next 1,000 units might cost $20 each (hiring temporary workers, renting extra facilities). To justify producing high-cost units, producers need high prices to cover these costs. Higher prices are needed to elicit more supply because marginal costs rise.<br><br>(3) Entry of new producers: High prices attract new firms into the market. At a $5 price, 100 firms might profitably produce (having costs below $5). At a $10 price, 200 firms can profitably produce (firms with costs between $5-10 now become viable). More firms lead to greater total market supply.<br><br>These three effects work together, ensuring supply curves slope upward.<br><br>The law of supply has profound implications: Price changes predictably affect producer behavior (business planning, policy). Supply curves predict producer responses to price changes (market analysis). Producer surplus can be measured (profit above minimum acceptable price). Markets coordinate production through price signals (allocation mechanism).<br><br>The law of supply applies virtually universally to goods and services in the long run. Short-run exceptions exist (fixed supply—concert tickets already printed, agricultural products already harvested), but these reflect temporary constraints, not violations of the law. In the long run, when producers can adjust production, the law of supply holds: higher prices mean higher quantity supplied.<br><br>Understanding the law of supply, combined with the law of demand, enables analyzing market equilibrium, predicting price changes, and understanding how markets allocate resources through the interaction of buyers' and sellers' responses to prices. The upward-sloping supply curve meeting the downward-sloping demand curve creates the market equilibrium that coordinates economic activity without central planning.",
    "image": {
      "src": "images/unit3/law_of_supply_basic.png",
      "alt": "Upward-sloping supply curve showing positive relationship between price and quantity supplied",
      "caption": "Law of supply: positive relationship between price and quantity supplied creates upward-sloping supply curve"
    }
  },
  "sections": [
    {
      "section_title": "The Positive Relationship: Price and Quantity Supplied",
      "introduction": "The law of supply describes the positive correlation between price and quantity supplied. Understanding this direct relationship is fundamental to analyzing producer behavior and market outcomes.",
      "key_concept": {
        "definition": "The law of supply: Holding all other factors constant (ceteris paribus), when the price of a good increases, the quantity supplied increases. When the price decreases, the quantity supplied decreases. This creates a positive (direct) relationship between price and quantity supplied.<br><br>Graphically, this positive relationship produces an upward-sloping supply curve—as you move up the price axis (higher prices), you move right along the quantity axis (higher quantities supplied).",
        "context": "The ceteris paribus condition is crucial—the law of supply describes the isolated effect of price changes, assuming other factors (input costs, technology, expectations, number of sellers) remain constant. This isolation allows understanding the pure price effect on production decisions."
      },
      "principles": [
        {
          "principle": "Higher Prices Increase Quantity Supplied",
          "statement": "As price increases, producers supply more units of the good, all else equal. The relationship is causal—price increases cause quantity supplied to increase.",
          "application": "Producers respond to higher prices by expanding output. The question is by how much (elasticity—covered later).",
          "example": "Consider apartment construction. Apartment rent increases from $1,500 to $2,000/month (33% increase). Before: Developers build 5,000 new apartments/year at $1,500 rent. After: Developers build 8,000 new apartments/year at $2,000 rent. Quantity supplied increased 60% when price increased 33%.<br><br>Why: Higher rents lead to greater profit margins, making construction more profitable. Projects that weren't viable at $1,500 become viable at $2,000. More developers enter the market. Construction financing becomes easier to obtain (banks see profitability). This demonstrates the law of supply: Higher price leads to higher quantity supplied."
        },
        {
          "principle": "Lower Prices Decrease Quantity Supplied",
          "statement": "As price decreases, producers supply fewer units of the good, all else equal. Lower prices reduce profitability, causing producers to cut output.",
          "application": "Price declines cause producers to reduce production or exit markets. This is the flip side of the law of supply.",
          "example": "Consider oil production. Oil price falls from $80 to $50 per barrel (37.5% decrease). Before: Global production is 95 million barrels/day at $80. After: Global production is 90 million barrels/day at $50. Quantity supplied decreased 5.3% when price decreased 37.5%.<br><br>Why: Lower price reduces profit margins, making production less profitable. High-cost wells shut down (production costs $55-75 are no longer viable at $50). Fewer new wells are drilled (exploration and development become less attractive). Some producers exit the market (bankruptcy, consolidation). This demonstrates the law of supply: Lower price leads to lower quantity supplied."
        },
        {
          "principle": "The Relationship Is Positive, Not Proportional",
          "statement": "Price and quantity supplied move in the same direction (positive relationship), but not necessarily by the same percentage. A 10% price increase might cause a 5% quantity increase, or a 20% increase—the magnitude varies.",
          "application": "The positive relationship is directional. The degree of response (elasticity) varies across goods and time periods.",
          "example": "Consider agricultural products in the short run versus the long run. In the short run (growing season already started): Corn price rises 20% leads to quantity supplied rising only 2% (farmers can't plant more mid-season). This shows a positive relationship but small response (inelastic supply).<br><br>In the long run (next planting season): Corn price rises 20% leads to quantity supplied rising 30% (farmers plant more acres, switch from other crops). This shows a positive relationship with larger response (elastic supply). The law specifies direction (both positive), not exact proportion."
        },
        {
          "principle": "The Law Holds 'All Else Equal' (Ceteris Paribus)",
          "statement": "The positive relationship assumes other supply factors remain constant—input costs, technology, expectations, weather (agriculture), number of sellers. If these change, quantity supplied may change for reasons other than price.",
          "application": "When analyzing price effects, you must isolate them from other changing factors. In reality, multiple factors change simultaneously—you must distinguish price effects from other effects.",
          "example": "Consider smartphone production. Price increases from $700 to $800, but quantity supplied decreases. This seems to violate the law of supply (price increases, quantity decreases). But other factors changed: Chip shortage increased input costs dramatically (shifts supply left). Factory lockdowns reduced production capacity (shifts supply left). Regulatory changes increased compliance costs (shifts supply left).<br><br>The price effect (positive): Price increase of 14% would increase quantity supplied by about 10% if acting alone. Other effects (negative): Costs, capacity, regulations decreased quantity supplied by 20%. Net effect: Quantity supplied decreased despite price increase. The law of supply still holds for the isolated price effect. The ceteris paribus condition is crucial."
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying the Positive Relationship",
          "problem": "Coffee bean production data: At $1.50/lb, 10 million pounds supplied annually. At $2.00/lb, 13 million pounds supplied. At $2.50/lb, 17 million pounds supplied. At $3.00/lb, 22 million pounds supplied. (a) Does this demonstrate the law of supply? (b) Calculate percentage changes. (c) Explain why quantity supplied changed.",
          "step_by_step": [
            {
              "step": "Part (a): Check for positive relationship",
              "explanation": "Compare price changes to quantity changes: $1.50 to $2.00: Price increased 33%, quantity increased from 10M to 13M (increased 30%). ✓<br><br>$2.00 to $2.50: Price increased 25%, quantity increased from 13M to 17M (increased 31%). ✓<br><br>$2.50 to $3.00: Price increased 20%, quantity increased from 17M to 22M (increased 29%). ✓<br><br>Every price increase corresponds to a quantity increase. Positive relationship confirmed. Yes, data demonstrates the law of supply."
            },
            {
              "step": "Part (b): Calculate percentage changes",
              "explanation": "Segment 1 ($1.50 to $2.00): Price change: ($2.00 - $1.50)/$1.50 = +33%. Quantity change: (13M - 10M)/10M = +30%.<br><br>Segment 2 ($2.00 to $2.50): Price change: ($2.50 - $2.00)/$2.00 = +25%. Quantity change: (17M - 13M)/13M = +31%.<br><br>Segment 3 ($2.50 to $3.00): Price change: ($3.00 - $2.50)/$2.50 = +20%. Quantity change: (22M - 17M)/17M = +29%.<br><br>Pattern: Price and quantity move together (positive relationship). Percentage changes are roughly similar (supply relatively proportional to price—unit elastic)."
            },
            {
              "step": "Part (c): Explain quantity changes",
              "explanation": "Why does quantity supplied increase as price rises?<br><br>Rising marginal costs: First 10M pounds come from low-cost farms (flat land, good climate, $1.20/lb cost). At $1.50 price, it's profitable to produce ($0.30/lb profit). Next 3M pounds come from higher-cost farms (hillier land, less ideal climate, $1.80/lb cost). These are only profitable at $2.00+ price ($0.20/lb profit at $2.00). Next 4M pounds come from even higher-cost farms (poor climate, expensive labor, $2.30/lb cost). They need $2.50+ price to be profitable. Final 5M pounds come from highest-cost farms (marginal land, $2.70/lb cost). They need $3.00 price to justify production. Higher prices are needed to cover rising marginal costs of expansion.<br><br>Profitability incentive: At $1.50, only low-cost producers are profitable (10M supply). At $3.00, all producers are profitable, including high-cost ones (22M supply). Higher profit margins attract more production.<br><br>Entry of new producers: At $1.50, 1,000 farms are profitable (costs < $1.50). At $3.00, 2,200 farms are profitable (costs < $3.00). More farms enter at higher prices, leading to greater total supply.<br><br>All three mechanisms work together creating the positive price-quantity relationship."
            }
          ],
          "final_answer": "(a) Yes, demonstrates law of supply—every price increase corresponds to quantity increase (positive relationship). (b) Price increases of 33%, 25%, and 20% correspond to quantity increases of 30%, 31%, and 29% respectively—roughly proportional. (c) Quantity supplied increases because: rising marginal costs require higher prices to justify expansion, higher prices create greater profit incentives encouraging production, and higher prices attract new producers into market. These mechanisms create upward-sloping supply curve.",
          "concept_applied": "Law of supply manifests as positive relationship in data—price up, quantity up. Relationship need not be proportional—different price changes can elicit different percentage quantity responses. Three mechanisms (rising marginal costs, profitability incentives, entry) explain why producers supply more at higher prices and less at lower prices."
        }
      ],
      "image": {
        "src": "images/unit3/positive_relationship_supply.png",
        "alt": "Graph showing specific price-quantity points demonstrating positive relationship",
        "caption": "Positive relationship: as price rises (vertical axis up), quantity supplied rises (horizontal axis right)"
      }
    },
    {
      "section_title": "Why the Law of Supply Holds: Rising Marginal Costs",
      "introduction": "The law of supply results primarily from rising marginal costs of production. As producers expand output, each additional unit becomes more expensive to produce, requiring higher prices to justify continued expansion.",
      "key_concept": {
        "definition": "Marginal cost is the additional cost of producing one more unit of output. For most production processes, marginal cost rises as output increases due to:<br><br>Diminishing marginal returns—adding more variable inputs (labor) to fixed inputs (capital, land) yields progressively smaller output increases, raising per-unit costs.<br><br>Capacity constraints—as production approaches facility limits, costs rise (overtime wages, equipment strain, rushed production).<br><br>Less-suitable resources—expansion requires using progressively less-efficient or more-expensive inputs.<br><br>Because marginal cost rises with output, producers need higher prices to justify producing more units. This creates the upward-sloping supply curve.",
        "context": "Rising marginal costs are the fundamental reason supply curves slope upward. Understanding why costs rise with output explains producer behavior and supply responses to price changes."
      },
      "principles": [
        {
          "principle": "Diminishing Marginal Returns Drive Rising Marginal Costs",
          "statement": "When some inputs are fixed (factory size, land area) and others variable (workers, materials), adding more variable inputs yields progressively smaller output increases. This diminishing marginal productivity raises cost per unit.",
          "application": "Short-run production with fixed capital faces diminishing returns, causing marginal costs to rise as output expands.",
          "example": "Consider a T-shirt factory with 20 sewing machines (fixed capital). With 5 workers: They produce 100 shirts/day (20 shirts per worker). With 10 workers: They produce 220 shirts/day (22 shirts per worker—some sharing machines). With 15 workers: They produce 300 shirts/day (20 shirts per worker—more congestion). With 20 workers: They produce 360 shirts/day (18 shirts per worker—significant waiting for machines). With 25 workers: They produce 400 shirts/day (16 shirts per worker—overcrowding).<br><br>Marginal product declines: Workers 1-5 produce 20 shirts/worker. Workers 16-20 produce 12 shirts/worker. Workers 21-25 produce 8 shirts/worker.<br><br>Marginal cost rises: If wage is $100/day: First 100 shirts cost $5 per shirt ($500 ÷ 100). Next 120 shirts cost $4.17 per shirt ($500 ÷ 120). Next 80 shirts cost $6.25 per shirt ($500 ÷ 80). Next 60 shirts cost $8.33 per shirt ($500 ÷ 60). Last 40 shirts cost $12.50 per shirt ($500 ÷ 40).<br><br>Marginal cost more than doubles from first to last batch. Producers need higher prices to justify high-cost production."
        },
        {
          "principle": "Capacity Constraints Raise Costs at High Output",
          "statement": "As production approaches facility capacity, costs rise due to overtime, equipment strain, quality issues, and rushed production.",
          "application": "High output levels are costly—producers need high prices to justify operating near capacity.",
          "example": "Consider a manufacturing plant's capacity. At normal operation (80% capacity): Cost is $20 per unit, high quality, regular shifts. At high operation (95% capacity): Cost is $28 per unit (overtime wages, accelerated maintenance), with some quality issues. At maximum operation (100% capacity): Cost is $40 per unit (double overtime, equipment failures, quality problems), unsustainable long-term.<br><br>Costs rise 100% from normal to maximum capacity. Producers only operate at maximum if price is very high (>$40) to cover costs."
        },
        {
          "principle": "Resource Quality Deteriorates with Expansion",
          "statement": "Producers use best resources first, then progressively worse resources. Expansion requires using less-suitable, more-expensive inputs, raising costs.",
          "application": "When expanding production, producers must use inferior resources (less-skilled workers, worse land, older equipment), increasing marginal costs.",
          "example": "Consider agricultural expansion. The first 1,000 acres might be flat, fertile land with ideal climate. Production cost is $50/acre. The next 1,000 acres might be sloped land with good soil and decent climate. Cost is $75/acre (erosion control, less efficient machinery). The next 1,000 acres might have poor soil and marginal climate. Cost is $120/acre (fertilizer, irrigation, crop insurance). The final 1,000 acres might be rocky, steep, with harsh climate. Cost is $200/acre (terracing, heavy fertilization, specialized equipment).<br><br>Marginal cost quadruples from first to last acreage. Farmers need high crop prices to justify farming marginal land."
        },
        {
          "principle": "Higher Prices Needed to Cover Rising Marginal Costs",
          "statement": "Because marginal cost rises, producers only expand output if price rises to cover the higher costs. At low prices, they produce only low-cost units. At high prices, they produce both low-cost and high-cost units. This creates upward-sloping supply.",
          "application": "The supply curve reflects the rising marginal cost curve—quantity supplied increases only when price rises enough to cover additional costs.",
          "example": "Consider oil production ranked by cost. 1-40M barrels/day: $20/barrel cost (Saudi conventional wells—very cheap). 41-70M barrels/day: $40/barrel cost (U.S. conventional, offshore). 71-85M barrels/day: $60/barrel cost (deep offshore, Arctic). 86-95M barrels/day: $80/barrel cost (tar sands, shale oil).<br><br>At $30 price: Produce only first 40M barrels (costs $20, profit $10/barrel). High-cost wells are unprofitable, shut down.<br><br>At $70 price: Produce first 85M barrels (all have costs < $70). It becomes profitable to operate high-cost wells.<br><br>At $100 price: Produce all 95M barrels. Even highest-cost sources become profitable. Higher prices unlock higher-cost supply."
        }
      ],
      "worked_examples": [
        {
          "title": "Marginal Cost and Supply Decisions",
          "problem": "Bakery production costs: First 100 loaves/day: $1.50 each (efficient regular shift). Next 100 loaves: $2.00 each (extending shift, less efficient). Next 100 loaves: $2.75 each (overtime wages, tired workers). Next 100 loaves: $4.00 each (double overtime, equipment strain). (a) At $2.50 price, how many loaves supplied? (b) At $3.50 price? (c) Why does quantity change?",
          "step_by_step": [
            {
              "step": "Part (a): Quantity supplied at $2.50 price",
              "explanation": "Marginal cost schedule: Loaves 1-100: MC = $1.50 (below $2.50 price, so produce). Loaves 101-200: MC = $2.00 (below $2.50 price, so produce). Loaves 201-300: MC = $2.75 (above $2.50 price, so don't produce—loses $0.25/loaf). Loaves 301-400: MC = $4.00 (way above price, so definitely don't produce).<br><br>Profitable production: Loaves 1-200 have MC < $2.50, so produce these. Loaves 201+ have MC > $2.50, so don't produce (unprofitable). Quantity supplied at $2.50: 200 loaves. Produce where price covers marginal cost."
            },
            {
              "step": "Part (b): Quantity supplied at $3.50 price",
              "explanation": "Marginal cost schedule: Loaves 1-100: MC = $1.50 (below $3.50, so produce, earn $2.00/loaf). Loaves 101-200: MC = $2.00 (below $3.50, so produce, earn $1.50/loaf). Loaves 201-300: MC = $2.75 (below $3.50, so produce, earn $0.75/loaf). Loaves 301-400: MC = $4.00 (above $3.50, so don't produce—loses $0.50/loaf).<br><br>Profitable production: Loaves 1-300 have MC < $3.50, so produce. Loaves 301+ have MC > $3.50, so don't produce. Quantity supplied at $3.50: 300 loaves. Higher price allows producing higher-cost units."
            },
            {
              "step": "Part (c): Why quantity increased from 200 to 300",
              "explanation": "Price increase from $2.50 to $3.50 made batch 3 (loaves 201-300) profitable: At $2.50: Batch 3 costs $2.75/loaf, price $2.50 leads to loss of $0.25/loaf, so don't produce. At $3.50: Batch 3 costs $2.75/loaf, price $3.50 leads to profit of $0.75/loaf, so produce.<br><br>Rising marginal cost creates a threshold: Below $2.75 price, don't make batch 3. Above $2.75 price, make batch 3.<br><br>Law of supply in action: Higher price ($3.50) leads to higher quantity (300 loaves) because higher price covers higher marginal costs. Price increase unlocks high-cost production that wasn't viable at low prices."
            },
            {
              "step": "Generalize the pattern",
              "explanation": "Supply curve reflects marginal cost curve: At $1.75 price: Supply 100 loaves (only batch 1, MC $1.50). At $2.25 price: Supply 200 loaves (batches 1-2, MC ≤ $2.00). At $3.00 price: Supply 300 loaves (batches 1-3, MC ≤ $2.75). At $4.50 price: Supply 400 loaves (all batches, MC ≤ $4.00).<br><br>Quantity supplied rises with price because each price level unlocks production up to that marginal cost. Upward-sloping supply equals rising marginal cost."
            }
          ],
          "final_answer": "(a) At $2.50, supply 200 loaves (produce units with MC ≤ $2.50; stop when MC > price). (b) At $3.50, supply 300 loaves (higher price covers higher marginal costs, enabling production of more expensive units). (c) Quantity increased because price increase made previously unprofitable batch 3 (MC $2.75) profitable at $3.50 price. Rising marginal costs create upward-sloping supply—higher prices needed to justify producing higher-cost units.",
          "concept_applied": "Producers supply quantity where marginal cost equals or is just below price. Rising marginal costs mean higher prices enable higher quantities by covering higher production costs. The supply curve mirrors the marginal cost curve—quantity supplied increases with price because each price level justifies producing up to that marginal cost. This is the fundamental mechanism behind the law of supply."
        }
      ],
      "image": {
        "src": "images/unit3/marginal_cost_supply.png",
        "alt": "Graph showing rising marginal cost curve overlaid with supply curve, demonstrating they coincide",
        "caption": "Supply and marginal cost: supply curve reflects rising marginal costs; higher prices needed to justify higher-cost production"
      }
    },
    {
      "section_title": "Market Entry, Exit, and the Law of Supply",
      "introduction": "Beyond individual firms expanding output, the law of supply also operates through firms entering or exiting the market in response to prices. High prices attract new suppliers; low prices drive suppliers out.",
      "key_concept": {
        "definition": "Market entry and exit reinforces the law of supply: High prices lead to profits that attract new firms, leading to more suppliers and greater market quantity supplied. Low prices lead to losses that drive firms out, leading to fewer suppliers and lower market quantity supplied.<br><br>This entry/exit mechanism is particularly important in the long run when firms can adjust whether to participate in the market. Combined with individual firms' output adjustments, entry/exit ensures supply curves slope upward.",
        "context": "Short run (fixed number of firms): Supply changes come from existing firms adjusting output. Long run (variable number of firms): Supply changes come from both output adjustments and entry/exit. Entry/exit magnifies supply responses to price changes in the long run."
      },
      "principles": [
        {
          "principle": "High Prices Attract Entry, Increasing Market Supply",
          "statement": "When prices rise above costs, economic profits emerge, attracting new firms into the market. More firms lead to greater total market quantity supplied at each price.",
          "application": "Profit opportunities from high prices cause industry expansion through new firm entry.",
          "example": "Consider the craft brewery industry. In 2010: Beer price is $15/case, with 1,500 craft breweries and modest profits. In 2015: Beer price rises to $22/case. High profits attract entry. By 2020: There are 8,000 craft breweries (433% increase). Market quantity supplied at $22 is much higher than at $15. Entry expanded market supply dramatically.<br><br>New breweries include entrepreneurs seeing profit opportunity, homebrewers going commercial, and existing beverage companies entering the craft segment. All are attracted by high prices and profits."
        },
        {
          "principle": "Low Prices Cause Exit, Decreasing Market Supply",
          "statement": "When prices fall below costs, losses emerge, forcing firms to exit the market. Fewer firms lead to lower total market quantity supplied at each price.",
          "application": "Unprofitable prices cause industry contraction through firm exit and bankruptcies.",
          "example": "Consider the fracking/shale oil industry. In 2014: Oil price is $100/barrel, with 1,800 active drilling rigs and high production. In 2015-2016: Oil price falls to $30/barrel. Many frackers have costs of $40-60/barrel, leading to losses. By 2016: Only 400 active rigs remain (78% decrease). Market quantity supplied fell from 9.5M to 8.5M barrels/day.<br><br>Exit reduced supply through bankruptcies (companies with high costs), consolidation (mergers, acquisitions), rig shutdowns (mothballed equipment), and production cuts. All driven by low prices causing losses."
        },
        {
          "principle": "Entry/Exit Barriers Affect Supply Responsiveness",
          "statement": "How easily firms can enter or exit affects how responsive supply is to price changes. Low barriers lead to easy entry/exit and highly responsive supply. High barriers lead to difficult entry/exit and less responsive supply.",
          "application": "Industries with low barriers have more elastic long-run supply. High-barrier industries have inelastic supply.",
          "example": "Low barriers (food trucks): Start-up cost is $50,000-100,000 (truck, permits). They can enter/exit quickly (weeks to months). When price rises, many new food trucks enter rapidly. When price falls, trucks exit easily (sell equipment, quit). Supply is very responsive to price changes.<br><br>High barriers (semiconductor fabs): Start-up cost is $5-20 billion (fabrication facility). It takes years to build, requiring specialized expertise. When price rises, few new fabs enter (too expensive, too slow). When price falls, existing fabs stay (sunk costs, exit costly). Supply is less responsive to price changes."
        }
      ],
      "image": {
        "src": "images/unit3/entry_exit_supply.png",
        "alt": "Diagram showing high prices attracting entry (more firms, rightward supply shift) and low prices causing exit (fewer firms, leftward supply shift)",
        "caption": "Entry and exit: high prices attract new firms (increase supply); low prices drive firms out (decrease supply)"
      }
    }
  ],
  "key_terms": [
    "Law of supply",
    "Quantity supplied",
    "Positive relationship",
    "Ceteris paribus",
    "Marginal cost",
    "Diminishing marginal returns",
    "Upward-sloping supply curve",
    "Profitability incentive",
    "Capacity constraints",
    "Market entry",
    "Market exit",
    "Supply responsiveness",
    "Entry barriers",
    "Exit barriers"
  ],
  "summary": "The law of supply states there is a positive (direct) relationship between the price of a good and the quantity supplied, holding all other factors constant (ceteris paribus). When price increases, quantity supplied increases. When price decreases, quantity supplied decreases. This positive relationship creates the upward-sloping supply curve fundamental to economics, complementing the downward-sloping demand curve.<br><br>The law of supply operates through three primary mechanisms:<br><br>(1) Profitability and production incentives—higher prices create greater profit margins, providing stronger incentives to produce more. At low prices, only high-profit opportunities are worth pursuing. At high prices, many production opportunities become profitable, encouraging expansion.<br><br>(2) Rising marginal costs—producers face increasing costs as they expand output due to diminishing marginal returns (adding variable inputs to fixed inputs yields progressively smaller output increases, raising per-unit costs), capacity constraints (approaching facility limits raises costs through overtime, equipment strain, quality issues), and resource quality deterioration (expansion requires using progressively less-suitable, more-expensive inputs like poor land, less-skilled workers, older equipment). Because marginal cost rises with output, producers need higher prices to justify producing additional units. The supply curve essentially mirrors the marginal cost curve—producers supply quantity where price covers marginal cost.<br><br>(3) Entry of new producers—high prices attract new firms into the market as profits signal opportunities. More firms means greater total market supply. Low prices cause losses, driving firms to exit, reducing market supply. This entry/exit mechanism is particularly important in the long run when firms can adjust market participation.<br><br>The law of supply is directional, not proportional—price and quantity move in same direction, but not necessarily by same percentage. A 10% price increase might cause 5% quantity increase (inelastic) or 20% increase (elastic)—magnitude varies by product and time period.<br><br>The ceteris paribus condition is essential—the law isolates the pure price effect, assuming other factors (input costs, technology, expectations, number of sellers, weather for agriculture) remain constant. In reality, multiple factors change simultaneously, requiring careful analysis to distinguish price effects from other effects.<br><br>The positive price-quantity relationship is empirically confirmed across virtually all goods and services in the long run. Short-run exceptions exist when supply is temporarily fixed (concert tickets already printed, agricultural harvest already completed, factory capacity already determined), but these reflect constraints, not violations of the law. In the long run when producers can adjust production decisions, the law of supply consistently holds.<br><br>Understanding the law of supply enables: predicting producer behavior in response to price changes, measuring producer surplus (profit above minimum acceptable price), analyzing market equilibrium where supply meets demand, forecasting industry expansion or contraction based on profitability, and understanding how markets coordinate production through price signals without central planning.<br><br>The mechanisms behind the law—rising marginal costs creating need for higher prices to justify expansion, profit incentives attracting resources to high-price goods, and entry/exit responding to profitability—explain why supply curves slope upward and how markets allocate production efficiently. Combined with the law of demand (downward-sloping demand curve), the law of supply creates the supply-demand framework that is the foundation of market analysis, showing how prices coordinate the independent decisions of millions of buyers and sellers to allocate resources and determine production patterns in market economies."
}
