{
  "expanded_description": "The law of demand is one of the most fundamental principles in economics, describing the inverse relationship between price and quantity demanded. It states that, all else being equal, as the price of a good rises, the quantity demanded falls, and as the price falls, the quantity demanded rises. Understanding this law and the reasons behind it is essential for analyzing consumer behavior and market dynamics.",
  "core_concept": {
    "principle": "The law of demand states: There is an inverse (negative) relationship between the price of a good and the quantity demanded, ceteris paribus (all other factors held constant). When price increases, quantity demanded decreases. When price decreases, quantity demanded increases. This relationship is so consistent and universal that it's called a 'law.' The law of demand creates the downward-sloping demand curve—one of the most recognizable concepts in economics.",
    "explanation": "The law of demand captures a fundamental aspect of human behavior: people respond to prices. When something becomes more expensive, people buy less of it. When something becomes cheaper, people buy more. This seems obvious, but understanding why it happens and its implications is crucial.<br><br>Consider coffee: At \\$2 per cup, you might buy coffee every day (7 cups per week). At \\$5 per cup, you might buy only 3 cups per week (too expensive for daily consumption). At \\$10 per cup, you might buy only 1 cup per week (special treat only). At \\$20 per cup, you might buy zero cups (too expensive, switch to tea). This pattern—higher prices leading to lower quantities demanded—reflects the law of demand in action.<br><br>The law of demand works through three mechanisms: (1) Substitution effect: When price rises, the good becomes relatively more expensive compared to substitutes. Rational consumers substitute cheaper alternatives. Coffee at \\$10? Buy tea at \\$3 instead. (2) Income effect: When price rises, real purchasing power (what your money can buy) decreases. You're effectively poorer, so you buy less of most goods. If coffee price doubles, your \\$100 budget buys less total stuff—you must reduce consumption of something, often including the now-expensive coffee. (3) Diminishing marginal utility: Each additional unit of a good provides less additional satisfaction than the previous unit. Your first cup of coffee provides huge utility (waking you up, tasting great). Your second cup provides less additional utility (nice, but not as crucial). Your fifth cup provides minimal additional utility (might make you jittery). Because additional units are worth less to you, you're only willing to buy them at lower prices. You might pay \\$5 for the first cup (high value) but only \\$2 for the fifth cup (low marginal value).<br><br>These three effects reinforce each other, ensuring that demand curves slope downward.<br><br>The law of demand has profound implications: Price changes predictably affect consumer behavior (marketing, policy). Demand curves can be used to predict consumer responses to price changes (business strategy). Consumer surplus can be measured (difference between willingness to pay and actual price). Market forces push toward equilibrium (when prices are 'wrong,' shortages or surpluses emerge).<br><br>The law of demand applies virtually universally—to goods, services, labor, capital, and more. There are rare exceptions (Giffen goods, Veblen goods), but these are curiosities that prove the rule. For 99%+ of goods, the law of demand holds: higher prices mean lower quantity demanded.<br><br>Understanding the law of demand is the first step toward understanding markets, consumer behavior, and how economies allocate resources through price signals.",
    "image": {
      "src": "images/unit3/law_of_demand_basic.png",
      "alt": "Downward-sloping demand curve showing inverse relationship between price and quantity demanded",
      "caption": "Law of demand: inverse relationship between price and quantity demanded creates downward-sloping demand curve"
    }
  },
  "sections": [
    {
      "section_title": "The Inverse Relationship: Price and Quantity Demanded",
      "introduction": "The law of demand describes the negative correlation between price and quantity demanded. Understanding this inverse relationship is fundamental to economic analysis.",
      "key_concept": {
        "definition": "The law of demand: Holding all other factors constant (ceteris paribus), when the price of a good increases, the quantity demanded decreases. When the price decreases, the quantity demanded increases. This creates an inverse (negative) relationship between price and quantity demanded. Graphically, this inverse relationship produces a downward-sloping demand curve—as you move down the price axis (lower prices), you move right along the quantity axis (higher quantities demanded).",
        "context": "The 'ceteris paribus' condition is crucial—the law of demand describes the isolated effect of price changes, assuming other factors (income, preferences, other prices) remain constant. This isolation allows us to understand the pure price effect on purchasing decisions."
      },
      "principles": [
        {
          "principle": "Higher Prices Reduce Quantity Demanded",
          "statement": "As price increases, consumers purchase fewer units of the good, all else equal. The relationship is causal—price increases cause quantity demanded to decrease.",
          "application": "Businesses know raising prices will reduce sales volume. The question is by how much (elasticity—covered later).",
          "example": "Streaming service raises monthly price from \\$10 to \\$15: Before: 10 million subscribers (quantity demanded at \\$10). After: 8 million subscribers (quantity demanded at \\$15). Price increase of 50% → quantity demanded decrease of 20%. Some subscribers cancel because: Too expensive relative to alternatives (substitution to other entertainment), Reduced purchasing power (income effect), Not worth \\$15 even though worth \\$10 (diminishing marginal utility). Law of demand in action: higher price → lower quantity demanded."
        },
        {
          "principle": "Lower Prices Increase Quantity Demanded",
          "statement": "As price decreases, consumers purchase more units of the good, all else equal. Price decreases cause quantity demanded to increase.",
          "application": "Sales and discounts increase demand for products. Lower prices attract more buyers and encourage existing buyers to purchase more.",
          "example": "Airline offers sale: Round-trip ticket normally \\$400, on sale for \\$250: Normal price: 100,000 tickets sold monthly (quantity demanded at \\$400). Sale price: 180,000 tickets sold monthly (quantity demanded at \\$250). Price decrease of 37.5% → quantity demanded increase of 80%. More tickets sold because: More affordable relative to other travel options (substitution effect), More purchasing power for vacations (income effect), Trips that weren't worth \\$400 are worth \\$250 (marginal utility consideration). Law of demand: lower price → higher quantity demanded."
        },
        {
          "principle": "The Relationship Is Inverse, Not Proportional",
          "statement": "Price and quantity demanded move in opposite directions (inverse), but not necessarily by the same percentage. A 10% price increase might cause a 5% quantity decrease, or a 15% decrease—the magnitude varies by product.",
          "application": "The inverse relationship is directional, not proportional. The degree of response (elasticity) varies across goods.",
          "example": "Gasoline price increases 20% (from \\$3 to \\$3.60 per gallon): Short run: Quantity demanded falls only 5% (people need to drive, few alternatives). Long run: Quantity demanded falls 15% (people buy fuel-efficient cars, move closer to work). Inverse relationship holds in both cases (price up → quantity down). But magnitude differs (inelastic short-run, more elastic long-run). Law of demand specifies direction, not exact proportion."
        },
        {
          "principle": "The Law Holds 'All Else Equal' (Ceteris Paribus)",
          "statement": "The inverse relationship assumes other factors affecting demand remain constant—income, preferences, prices of other goods, expectations, etc. If these change, quantity demanded may change for reasons other than price.",
          "application": "When analyzing price effects, must isolate from other changing factors. In real world, multiple factors change simultaneously—must distinguish price effects from other effects.",
          "example": "Smartphone price increases from \\$800 to \\$900, but quantity demanded also increases: Seems to violate law of demand (price up, quantity up). But other factors changed: Incomes rose 10% (increases demand), Competitor phones became worse (increases demand for this phone), Fashion trends favor this brand (increases demand). Price effect (negative): Price ↑ 12.5% would reduce quantity demanded ~10% if alone. Other effects (positive): Income, preferences, competition increased demand 20%. Net effect: Quantity demanded increased despite price increase. Law of demand still holds for isolated price effect. Ceteris paribus condition crucial."
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying the Inverse Relationship",
          "problem": "Movie theater data: At \\$15 per ticket, 5,000 tickets sold weekly. At \\$12 per ticket, 7,000 tickets sold weekly. At \\$9 per ticket, 10,000 tickets sold weekly. At \\$6 per ticket, 15,000 tickets sold weekly. (a) Does this data demonstrate the law of demand? (b) Calculate percentage changes. (c) Explain why quantity demanded changed.",
          "step_by_step": [
            {
              "step": "Part (a): Check for inverse relationship",
              "explanation": "Compare price changes to quantity changes: \\$15 → \\$12: Price decreased 20%, quantity increased from 5,000 to 7,000 (increased 40%). ✓ \\$12 → \\$9: Price decreased 25%, quantity increased from 7,000 to 10,000 (increased 43%). ✓ \\$9 → \\$6: Price decreased 33%, quantity increased from 10,000 to 15,000 (increased 50%). ✓ Every price decrease corresponds to quantity increase. Inverse relationship confirmed. Yes, data demonstrates law of demand."
            },
            {
              "step": "Part (b): Calculate percentage changes",
              "explanation": "Segment 1 (\\$15 to \\$12): Price change: (\\$12 - \\$15)/\\$15 = -20%. Quantity change: (7,000 - 5,000)/5,000 = +40%. Segment 2 (\\$12 to \\$9): Price change: (\\$9 - \\$12)/\\$12 = -25%. Quantity change: (10,000 - 7,000)/7,000 = +43%. Segment 3 (\\$9 to \\$6): Price change: (\\$6 - \\$9)/\\$9 = -33%. Quantity change: (15,000 - 10,000)/10,000 = +50%. Pattern: Larger price decreases → larger quantity increases. Inverse relationship with varying magnitudes."
            },
            {
              "step": "Part (c): Explain quantity changes",
              "explanation": "Why does quantity demanded increase as price falls? Substitution effect: At \\$15, movies are expensive relative to alternatives (streaming \\$15/month, video games \\$60 one-time). Some consumers substitute cheaper entertainment. At \\$6, movies are cheaper relative to alternatives. Consumers substitute toward movies (away from streaming, games). Income effect: At \\$15, taking family of 4 to movies costs \\$60 (substantial expense). Reduced purchasing power limits movie-going. At \\$6, family movie costs \\$24 (more affordable). Increased real purchasing power enables more movie-going. Diminishing marginal utility: First movie of month: High value (entertainment-starved, worth \\$20 subjective value). Second movie: Medium value (nice, but not as crucial, worth \\$12 subjective value). Third movie: Lower value (getting saturated, worth \\$7 subjective value). At \\$15 price: Buy only first movie (only one exceeding \\$15 value). At \\$6 price: Buy all three movies (all exceed \\$6 value). Lower prices enable purchasing lower-marginal-utility units. All three effects work together to create inverse relationship."
            }
          ],
          "final_answer": "(a) Yes, data demonstrates law of demand—every price decrease corresponds to quantity increase (inverse relationship). (b) Price decreases of 20%, 25%, and 33% correspond to quantity increases of 40%, 43%, and 50% respectively. (c) Quantity demanded increases as price falls due to: substitution effect (movies become relatively cheaper), income effect (purchasing power increases), diminishing marginal utility (lower prices justify purchasing lower-value units). These mechanisms create the inverse price-quantity relationship.",
          "concept_applied": "Law of demand manifests as inverse relationship in data—price down, quantity up. The relationship need not be proportional—different price changes can elicit different percentage quantity responses. Three mechanisms (substitution, income, diminishing marginal utility) explain why consumers buy more at lower prices and less at higher prices."
        }
      ],
      "image": {
        "src": "images/unit3/inverse_relationship.png",
        "alt": "Graph showing specific price-quantity points demonstrating inverse relationship",
        "caption": "Inverse relationship: as price falls (vertical axis down), quantity demanded rises (horizontal axis right)"
      }
    },
    {
      "section_title": "Why the Law of Demand Holds: Three Effects",
      "introduction": "The law of demand isn't arbitrary—it results from three powerful behavioral effects that reinforce each other. Understanding these mechanisms explains why demand curves slope downward.",
      "key_concept": {
        "definition": "Three effects explain the law of demand: (1) Substitution effect—when a good's price rises, it becomes relatively more expensive compared to substitutes. Rational consumers substitute toward relatively cheaper alternatives. (2) Income effect—when a good's price rises, consumers' real purchasing power (what their income can buy) falls. Effectively poorer, they buy less of most goods. (3) Diminishing marginal utility—each additional unit consumed provides less additional satisfaction. Consumers are willing to pay less for additional units, so lower prices are needed to induce purchasing more units.<br><br>These three effects work in the same direction (reducing quantity demanded when price rises), creating a robust inverse relationship.",
        "context": "While these effects are presented separately for clarity, they operate simultaneously in real purchasing decisions. Together, they explain virtually all downward-sloping demand curves observed in reality."
      },
      "categories": [
        {
          "type": "Substitution Effect",
          "description": "Price changes alter relative prices, causing consumers to substitute toward relatively cheaper goods.",
          "examples": [
            {
              "process": "What it is",
              "explanation": "When one good's price rises while other goods' prices remain constant, the good becomes relatively more expensive. Consumers substitute away from the now-relatively-expensive good toward now-relatively-cheap substitutes.<br><br>Example: Beef price rises from \\$8/lb to \\$12/lb. Chicken price stays \\$4/lb. Before: Beef relatively expensive (2× chicken price). After: Beef very expensive (3× chicken price). Consumers substitute chicken for beef. Beef quantity demanded falls due to substitution effect."
            },
            {
              "process": "Close vs. distant substitutes",
              "explanation": "Substitution effect is stronger when close substitutes exist.<br><br>Example: Coca-Cola price rises: Close substitutes: Pepsi, other colas. Strong substitution effect—easy to switch. Many consumers switch to Pepsi. Large quantity decrease for Coca-Cola.<br><br>Insulin price rises: No close substitutes: Diabetics must have insulin. Weak substitution effect—no alternatives. Few patients stop buying. Small quantity decrease. Substitution effect depends on availability of alternatives."
            },
            {
              "process": "All-else-equal condition",
              "explanation": "Substitution effect isolates the impact of relative price changes, holding purchasing power constant.<br><br>Example: Good X price rises 20%. Substitution effect: If purchasing power held constant, how much would consumption of X fall purely due to X becoming relatively expensive? Income effect: How much would consumption fall due to reduced purchasing power from higher prices? Combined: Total effect on quantity demanded. Substitution effect is the 'pure' relative price effect."
            }
          ]
        },
        {
          "type": "Income Effect",
          "description": "Price changes alter real purchasing power, changing consumption like an income change would.",
          "examples": [
            {
              "process": "What it is",
              "explanation": "When a good's price rises, your money income (dollars) stays the same, but your real income (what you can buy) falls. You're effectively poorer. Being poorer, you buy less of most goods (normal goods).<br><br>Example: Income: \\$1,000/week. Spend \\$200 on groceries. Grocery prices rise 25%. Now groceries cost \\$250 for same items. Real purchasing power fell: \\$50 less for other goods. Effectively a \\$50/week pay cut. Being poorer, reduce consumption of many goods (including groceries). Grocery quantity demanded falls due to income effect."
            },
            {
              "process": "Normal goods vs. inferior goods",
              "explanation": "Income effect works differently for normal vs. inferior goods. Normal goods: Income ↑ → demand ↑. Price ↑ → real income ↓ → demand ↓. Income effect reinforces substitution effect (both reduce quantity demanded when price rises).<br><br>Example: Restaurant meals (normal good). Price rises → real income falls → buy fewer meals.<br><br>Inferior goods: Income ↑ → demand ↓. Price ↑ → real income ↓ → demand ↑ (paradoxically). Income effect opposes substitution effect.<br><br>Example: Instant ramen (inferior good). Price rises → real income falls → might buy MORE ramen (trading down from other foods). But substitution effect usually dominates, so law of demand still holds."
            },
            {
              "process": "Size of income effect",
              "explanation": "Income effect is larger when the good represents bigger share of budget.<br><br>Example: Salt price doubles (from \\$2 to \\$4 per year per person): Small budget share (0.2% of \\$2,000 annual budget). Doubling price costs extra \\$2/year. Tiny real income impact. Negligible income effect.<br><br>Housing price doubles (from \\$1,000 to \\$2,000 per month): Large budget share (50% of \\$2,000 monthly budget). Doubling price costs extra \\$1,000/month. Massive real income impact. Large income effect. Income effect matters more for big-ticket items."
            }
          ]
        },
        {
          "type": "Diminishing Marginal Utility",
          "description": "Additional units provide decreasing additional satisfaction, so consumers pay less for them.",
          "examples": [
            {
              "process": "What it is",
              "explanation": "Total utility: Total satisfaction from consuming a good. Marginal utility: Additional satisfaction from consuming one more unit. Diminishing marginal utility: Each additional unit provides less additional satisfaction than the previous unit.<br><br>Example: Pizza consumption: First slice: Marginal utility = 10 (very hungry, delicious). Second slice: Marginal utility = 8 (still good, less hungry). Third slice: Marginal utility = 5 (getting full). Fourth slice: Marginal utility = 2 (uncomfortably full). Fifth slice: Marginal utility = -2 (makes you sick). Each additional slice provides less benefit (eventually negative)."
            },
            {
              "process": "Willingness to pay and marginal utility",
              "explanation": "Consumers willing to pay up to their marginal utility for each unit. Since marginal utility declines, willingness to pay declines for additional units.<br><br>Example: Coffee willingness to pay: First cup: Worth \\$6 to you (high marginal utility—waking up). Second cup: Worth \\$4 (medium marginal utility—tastes good). Third cup: Worth \\$2 (low marginal utility—bit much). At \\$5 price: Buy 1 cup (only first cup worth ≥\\$5). At \\$3 price: Buy 2 cups (first two cups worth ≥\\$3). At \\$1 price: Buy 3+ cups (all cups worth ≥\\$1). Lower prices needed to induce purchasing more units because marginal utility (and willingness to pay) declines."
            },
            {
              "process": "Diminishing marginal utility creates downward slope",
              "explanation": "Because marginal utility declines with quantity, demand curve slopes downward.<br><br>Example: Plot willingness to pay for each unit: First unit: \\$10 (point on demand curve). Second unit: \\$8 (point on demand curve). Third unit: \\$6 (point on demand curve). Connecting points creates downward-sloping demand curve. At \\$7 price, buy 2 units (first two have MU ≥ \\$7). At \\$5 price, buy 3 units (first three have MU ≥ \\$5). Diminishing marginal utility → declining willingness to pay → downward-sloping demand."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Separating the Three Effects",
          "problem": "Gasoline price rises from \\$3 to \\$4 per gallon. Consumer initially buys 40 gallons/month. After price increase, buys 35 gallons/month. Separate the effects: (a) Substitution effect, (b) Income effect, (c) Diminishing marginal utility effect. Consumer's monthly income is \\$4,000.",
          "step_by_step": [
            {
              "step": "Part (a): Substitution effect",
              "explanation": "Gas becomes relatively more expensive compared to alternatives. Before: Gas \\$3/gallon. Alternatives: Public transit \\$2/trip, carpooling free, staying home free. After: Gas \\$4/gallon (33% increase). Alternatives: Same prices. Gas relatively much more expensive now. Substitution toward alternatives: Drive less, use public transit more (3 fewer trips/month). Carpool to work 2 days/week (saves 8 gallons/month). Walk to nearby stores instead of driving (saves 2 gallons/month). Substitution effect: ~13 gallons/month reduction (from substituting alternatives). Remaining: 40 - 13 = 27 gallons still desired if could afford."
            },
            {
              "step": "Part (b): Income effect",
              "explanation": "Gas price increase reduces real purchasing power. Before: 40 gallons × \\$3 = \\$120/month on gas. After: 35 gallons × \\$4 = \\$140/month on gas (if buying 35). But to buy same 40 gallons: 40 × \\$4 = \\$160/month. Extra cost: \\$160 - \\$120 = \\$40/month. Real income effectively fell \\$40/month (1% of \\$4,000 income). Being poorer, reduce consumption of various goods including gas. Income effect: ~2 gallons/month reduction (from being effectively poorer). Example: Skip one long weekend trip (saves 2 gallons)."
            },
            {
              "step": "Part (c): Diminishing marginal utility",
              "explanation": "Each gallon of gas has declining marginal utility. High marginal utility gallons: Commuting to work (essential—high utility). Medium marginal utility: Grocery shopping, errands (important—medium utility). Low marginal utility: Recreational drives, extra trips (nice but optional—low utility). At \\$3 price: All 40 gallons worth at least \\$3 (including low-utility recreational driving). At \\$4 price: Only 35 gallons worth at least \\$4 (cut lowest-utility 5 gallons—recreational trips). Diminishing MU effect: ~5 gallons/month reduction (cutting lowest-marginal-utility uses that aren't worth \\$4/gallon even though worth \\$3/gallon)."
            },
            {
              "step": "Check: Do effects sum to observed change?",
              "explanation": "Total quantity change: 40 → 35 = 5 gallons reduction. Substitution effect: -13 gallons (switched to alternatives). Wait, this doesn't add up correctly. Let me reconsider: Actually, these effects overlap and are hard to separate precisely in practice. Better approach: Total effect observed: 5 gallons reduction. Effects contributing: Substitution (switching to alternatives), Income (purchasing power reduced), Diminishing MU (highest-price uses cut first). All three work together to create the 5 gallon reduction. Precise separation requires sophisticated analysis. Key point: All three effects reduce quantity demanded when price rises."
            }
          ],
          "final_answer": "Gas price increase from \\$3 to \\$4 reduced quantity demanded from 40 to 35 gallons (5 gallon decrease). Three effects contributed: (a) Substitution effect: Gas became relatively more expensive; consumer substituted public transit, carpooling, walking for some trips. (b) Income effect: \\$40/month real income loss (1% of income) reduced consumption of all goods including gas. (c) Diminishing marginal utility: At \\$4, only higher-value uses (commuting, essential errands) worth the price; recreational driving (low marginal utility) cut. All three effects work together to create the observed quantity reduction.",
          "concept_applied": "Law of demand results from three reinforcing effects. Substitution effect: relative price change encourages switching to alternatives. Income effect: purchasing power reduction decreases consumption. Diminishing marginal utility: lower-value uses aren't worth higher prices. Together, these mechanisms ensure quantity demanded falls when price rises, creating the downward-sloping demand curve."
        }
      ],
      "image": {
        "src": "images/unit3/three_effects.png",
        "alt": "Three panels showing substitution effect, income effect, and diminishing marginal utility graphically",
        "caption": "Three effects creating law of demand: substitution (relative price), income (purchasing power), diminishing MU (declining value)"
      }
    },
    {
      "section_title": "Exceptions to the Law of Demand",
      "introduction": "While the law of demand holds for the vast majority of goods, there are rare exceptions where demand curves slope upward. Understanding these exceptions illuminates why the law usually holds.",
      "key_concept": {
        "definition": "Two potential exceptions to the law of demand: (1) Giffen goods—inferior goods where the income effect is so strong that it outweighs the substitution effect, causing quantity demanded to rise when price rises. Theoretically possible but extremely rare in practice. (2) Veblen goods—luxury goods valued for their high price (status symbols). Higher prices may increase demand because consumers want conspicuous consumption. More common than Giffen goods but still unusual. These exceptions are rare curiosities that prove the rule—for 99%+ of goods, the law of demand holds.",
        "context": "Discussing exceptions helps understand why the law usually works. Giffen goods show that income effects can theoretically dominate. Veblen goods show that psychological factors (status-seeking) can override normal economic logic. But these exceptions are so rare that the law of demand remains a reliable principle for economic analysis."
      },
      "categories": [
        {
          "type": "Giffen Goods",
          "description": "Inferior goods where income effect dominates substitution effect, creating upward-sloping demand.",
          "examples": [
            {
              "process": "Theoretical mechanism",
              "explanation": "Requires specific conditions: Good must be inferior (demand decreases when income rises). Good must be large share of budget. No close substitutes available. Then: Price rises → Real income falls dramatically (large budget share). Being much poorer → Consume more of inferior good (income effect). Income effect > Substitution effect → Quantity demanded rises when price rises.<br><br>Example (theoretical): Staple food (rice) in very poor society: Rice is 80% of household budget. Rice is inferior (eat less rice, more meat when richer). Rice price rises 20% → Real income falls 16% (0.20 × 0.80 = 0.16). Being 16% poorer → Must cut meat consumption (expensive). Shift to consuming more rice (cheap calories). Perversely: Rice price ↑ → Rice quantity demanded ↑."
            },
            {
              "process": "Why extremely rare",
              "explanation": "Giffen goods require: Large budget share (so income effect is large), Inferior good status (demand falls with income), No substitutes (can't switch away), Extreme poverty (so income effects dominate). These conditions rarely coexist: Most goods aren't large budget shares. Most goods aren't inferior. Most goods have substitutes. Modern economies have safety nets (reducing extreme poverty). Result: Giffen goods are theoretical curiosities, rarely observed empirically. Historical example (disputed): Irish potato famine—potatoes possibly Giffen good. Modern examples: Essentially none confirmed."
            }
          ]
        },
        {
          "type": "Veblen Goods",
          "description": "Luxury goods valued for status signaling, where high prices increase desirability.",
          "examples": [
            {
              "process": "Conspicuous consumption",
              "explanation": "Some goods are purchased partly to signal wealth and status. Higher prices increase status value.<br><br>Example: Luxury watches (Rolex): At \\$5,000 price: Nice watch, some status. At \\$20,000 price: Exclusive, high status signal. At \\$50,000 price: Extremely exclusive, maximum status. Higher price increases desirability for status-seeking consumers. Demand may increase with price (upward-sloping range). Veblen effect: Price itself adds to the good's value through exclusivity."
            },
            {
              "process": "Why less rare than Giffen goods",
              "explanation": "Veblen goods actually exist in luxury markets: Designer fashion (Hermès bags, Gucci). Luxury cars (Ferrari, Bentley). Fine wines (Château Lafite). Luxury jewelry. High-end real estate. But even for these goods: Demand slopes upward only over certain price range. At very high prices, demand eventually falls (too expensive even for rich). Most buyers still respond normally to price (downward-sloping). Veblen effect applies to small segment (ultra-wealthy status-seekers). Normal law of demand still holds for most of market."
            },
            {
              "process": "Distinction from quality signaling",
              "explanation": "Veblen effect is about status, not quality inference. Quality signaling: Higher price signals higher quality (rational inference). People buy more because quality increased (not exception to law of demand—quality change shifted demand). Veblen effect: Higher price valued for exclusivity itself (irrational from traditional economic view). People buy more because expensive = exclusive (true exception).<br><br>Example: Wine prices: Quality signaling: \\$50 wine better than \\$10 wine (price reflects quality). Demand increases because quality increased (not exception). Veblen effect: \\$5,000 wine bought for status over \\$500 wine (quality similar). Demand increases purely because expensive (exception)."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit3/exceptions.png",
        "alt": "Two graphs: upward-sloping segments for Giffen and Veblen goods contrasted with normal downward-sloping demand",
        "caption": "Exceptions to law of demand: Giffen goods (income effect dominates), Veblen goods (status value from high prices)—both very rare"
      }
    }
  ],
  "key_terms": [
    "Law of demand",
    "Quantity demanded",
    "Inverse relationship",
    "Ceteris paribus",
    "Substitution effect",
    "Income effect",
    "Real purchasing power",
    "Diminishing marginal utility",
    "Marginal utility",
    "Normal goods",
    "Inferior goods",
    "Giffen goods",
    "Veblen goods",
    "Downward-sloping demand curve"
  ],
  "summary": "The law of demand states there is an inverse (negative) relationship between the price of a good and the quantity demanded, holding all other factors constant (ceteris paribus). When price increases, quantity demanded decreases. When price decreases, quantity demanded increases. This inverse relationship creates the downward-sloping demand curve fundamental to economics.<br><br>The law of demand holds because three powerful effects reinforce each other: (1) Substitution effect—when a good's price rises, it becomes relatively more expensive compared to substitutes, and rational consumers substitute toward relatively cheaper alternatives. The strength of substitution effect depends on availability of close substitutes. (2) Income effect—when a good's price rises, consumers' real purchasing power (what their money can buy) falls, making them effectively poorer. Being poorer, they buy less of most normal goods. The income effect is larger when the good represents a bigger share of the budget. For inferior goods, the income effect works oppositely (being poorer increases demand), but typically the substitution effect dominates, so the law of demand still holds. (3) Diminishing marginal utility—each additional unit consumed provides less additional satisfaction than the previous unit. Because marginal utility declines, consumers' willingness to pay declines for additional units. Lower prices are needed to induce purchasing more units because lower-marginal-utility units aren't worth as much to consumers.<br><br>These three effects work in the same direction (all reducing quantity demanded when price rises), creating a robust inverse relationship. The law of demand is directional, not proportional—price and quantity move in opposite directions, but not necessarily by the same percentage. The magnitude of response varies by product and is measured by price elasticity of demand (covered later).<br><br>The ceteris paribus (all else equal) condition is crucial—the law isolates the pure price effect, assuming other factors (income, preferences, prices of other goods, expectations, number of buyers) remain constant. In reality, multiple factors change simultaneously, so careful analysis must distinguish price effects from other effects.<br><br>While the law of demand holds for the vast majority of goods, there are two rare exceptions: Giffen goods are inferior goods where the income effect is so strong it outweighs the substitution effect, causing quantity demanded to rise when price rises. This requires specific conditions: the good must be inferior, represent a large budget share, have no close substitutes, and be purchased by extremely poor consumers. These conditions rarely coexist, making Giffen goods theoretical curiosities with essentially no confirmed modern examples. Veblen goods are luxury goods valued partly for status signaling, where higher prices may increase demand over certain ranges because exclusivity adds value. This applies to some luxury markets (designer fashion, luxury watches, fine wines) but only for small segments (ultra-wealthy status-seekers) and only over certain price ranges. Even for Veblen goods, demand eventually falls at very high prices, and most buyers respond normally to price.<br><br>These exceptions are so rare that the law of demand remains a reliable, universal principle for economic analysis. Understanding why the law usually holds (three reinforcing effects) and why exceptions are rare (require unusual conditions) demonstrates the law's robustness. The law of demand is foundational to microeconomics, explaining consumer behavior, market dynamics, and resource allocation through price signals. It enables predicting how consumers respond to price changes, measuring consumer surplus, and understanding market equilibria."
}
