{
  "expanded_description": "Market equilibrium is the foundational concept where the forces of supply and demand interact to determine the market price and quantity of a good or service. It represents a state of balance where the quantity that producers are willing and able to supply exactly matches the quantity that consumers are willing and able to purchase. At this point, there is no inherent tendency for the price or quantity to change—all market forces are in balance. Understanding equilibrium is crucial for analyzing how markets allocate resources, how prices are discovered, and how markets react to disturbances.",
  "core_concept": {
    "principle": "Market equilibrium occurs at the price where the quantity demanded equals the quantity supplied. This is represented graphically as the intersection point of the market demand curve and the market supply curve. The corresponding price is the equilibrium price (or market-clearing price), and the corresponding quantity is the equilibrium quantity. At any price above equilibrium, quantity supplied exceeds quantity demanded, resulting in a surplus that puts downward pressure on price. At any price below equilibrium, quantity demanded exceeds quantity supplied, resulting in a shortage that puts upward pressure on price. The market naturally tends to move toward equilibrium through the price mechanism.",
    "explanation": "Equilibrium is not static but a point toward which the market constantly gravitates. Think of it as the 'resting point' for the market. The demand curve shows consumers' willingness to buy at various prices (Law of Demand), and the supply curve shows producers' willingness to sell at various prices (Law of Supply). Only at the intersection are their plans mutually consistent.<br><br>Key characteristics: No Surplus or Shortage: At P*, Qd = Qs. All goods produced are sold, and all consumers who want to buy at that price can do so. No Incentive to Change: Neither buyers nor sellers have an incentive to alter their behavior at the equilibrium price. Buyers are getting exactly the quantity they want at that price, and sellers are selling exactly the quantity they want. Market-Clearing: The market is 'cleared' of excess supply or unmet demand.<br><br>The adjustment process is automatic in competitive markets: If Price > P* (e.g., \\$8): Qs > Qd (Surplus). Sellers have unsold inventory. To sell this excess, sellers compete by lowering prices. As price falls: Qd increases (movement down demand curve) and Qs decreases (movement down supply curve). This continues until price falls to P* where Qd = Qs. If Price < P* (e.g., \\$4): Qd > Qs (Shortage). Buyers cannot get all they want at this low price. Buyers compete for the limited goods by offering higher prices. As price rises: Qd decreases (movement up demand curve) and Qs increases (movement up supply curve). This continues until price rises to P* where Qd = Qs.",
    "image": {
      "src": "images/unit3/market_equilibrium.png",
      "alt": "Graph showing supply and demand curves intersecting at equilibrium point (P*, Q*). Arrows show surplus at prices above P* and shortage at prices below P*.",
      "caption": "Market Equilibrium: The intersection of supply and demand curves determines equilibrium price (P*) and quantity (Q*). Prices above P* create surplus; prices below P* create shortage."
    }
  },
  "sections": [
    {
      "section_title": "Finding Equilibrium: Schedules, Algebra, and Graphs",
      "introduction": "Equilibrium can be identified using three complementary methods: market schedules (tables), algebraic equations, and graphical analysis. Each method provides the same fundamental result but offers different insights.",
      "key_concept": {
        "definition": "Equilibrium is found where Quantity Demanded (Qd) = Quantity Supplied (Qs). In a schedule, it's the price where the Qd and Qs columns match. Algebraically, it's the solution to setting the demand function equal to the supply function. Graphically, it's the intersection point of the two curves.",
        "context": "These methods build directly on the demand schedules (3.2) and supply schedules (3.6) previously learned. The algebraic approach uses the linear equations often associated with these curves."
      },
      "principles": [
        {
          "principle": "Equilibrium from Market Schedules",
          "statement": "By comparing a market demand schedule and a market supply schedule at each price, the equilibrium price is found where the quantities are equal.",
          "application": "Create a combined schedule with columns for Price, Qd, and Qs. Scan for the row where Qd = Qs.",
          "example": "Coffee Market Schedule:<br>Price per cup | Qd (cups/day) | Qs (cups/day)<br>\\$1 | 120 | 30<br>\\$2 | 100 | 60<br>\\$3 | 80 | 80 ← EQUILIBRIUM (Qd = Qs)<br>\\$4 | 60 | 100<br>\\$5 | 40 | 120<br>Equilibrium Price (P*) = \\$3, Equilibrium Quantity (Q*) = 80 cups/day."
        },
        {
          "principle": "Algebraic Solution for Equilibrium",
          "statement": "Given linear demand and supply functions, set Qd = Qs and solve for price (P). Then substitute P back into either function to find Q.",
          "application": "Demand: Qd = a - bP. Supply: Qs = c + dP (assuming typical slopes). Set a - bP = c + dP.",
          "example": "Demand: Qd = 200 - 25P<br>Supply: Qs = 50 + 25P<br>Set Qd = Qs: 200 - 25P = 50 + 25P<br>200 - 50 = 25P + 25P<br>150 = 50P<br>P* = \\$3<br>Substitute P* into Qd: Q* = 200 - 25(3) = 125. Or into Qs: Q* = 50 + 25(3) = 125."
        },
        {
          "principle": "Graphical Intersection",
          "statement": "Plot the demand and supply curves on the same axes. The point where they cross is the equilibrium. The x-coordinate is Q*, the y-coordinate is P*.",
          "application": "Essential for visualizing surplus, shortage, and the adjustment process.",
          "example": "Graph with Demand: downward sloping from (Q=0, P=\\$8) to (Q=200, P=\\$0). Supply: upward sloping from (Q=0, P=\\$2) to (Q=200, P=\\$6). They intersect at point (Q*=125, P*=\\$3)."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Market Equilibrium",
          "problem": "The market for pizza slices has the following schedules:<br>Demand: P = 10 - 0.5Qd<br>Supply: P = 2 + 0.5Qs<br>(a) Find the equilibrium price and quantity algebraically. (b) Create a schedule for prices \\$2 to \\$8 in \\$1 increments to verify. (c) What is the quantity demanded and supplied at a price of \\$5? Describe the market condition at that price.",
          "step_by_step": [
            {
              "step": "Part (a): Algebraic Solution",
              "explanation": "The equations are already solved for P. To use the Qd=Qs method, solve each for quantity. Demand: P = 10 - 0.5Qd → 0.5Qd = 10 - P → Qd = 20 - 2P. Supply: P = 2 + 0.5Qs → 0.5Qs = P - 2 → Qs = 2P - 4. Set Qd = Qs: 20 - 2P = 2P - 4. Solve: 20 + 4 = 2P + 2P → 24 = 4P → P* = \\$6. Substitute P* into Qd: Q* = 20 - 2(6) = 8. Or into Qs: Q* = 2(6) - 4 = 8."
            },
            {
              "step": "Part (b): Schedule Verification",
              "explanation": "Use Qd = 20 - 2P and Qs = 2P - 4.<br>Price | Qd | Qs<br>\\$2 | 16 | 0<br>\\$3 | 14 | 2<br>\\$4 | 12 | 4<br>\\$5 | 10 | 6<br>\\$6 | 8 | 8 ← EQUILIBRIUM<br>\\$7 | 6 | 10<br>\\$8 | 4 | 12<br>The schedule confirms equilibrium at P*=\\$6, Q*=8 slices."
            },
            {
              "step": "Part (c): Market Condition at P=\\$5",
              "explanation": "From the schedule, at P=\\$5: Qd = 10, Qs = 6. Since Qd (10) > Qs (6), there is a SHORTAGE of 4 units (10 - 6 = 4). At this price below equilibrium, consumers want to buy more than producers want to sell. This shortage of 4 slices will create upward pressure on the price, as frustrated buyers offer to pay more."
            }
          ],
          "final_answer": "(a) Equilibrium: P* = \\$6 per slice, Q* = 8 slices. (b) Schedule confirms equilibrium at the \\$6 row. (c) At P=\\$5: Qd=10, Qs=6, resulting in a shortage of 4 slices. The market is in disequilibrium, and competitive pressure will push the price upward toward \\$6.",
          "concept_applied": "Equilibrium is where Qd = Qs. Algebra finds the exact point. A schedule shows the imbalance (shortage/surplus) at other prices. A price below equilibrium creates a shortage (Qd > Qs)."
        }
      ],
      "image": {
        "src": "images/unit3/finding_equilibrium.png",
        "alt": "Three-panel figure: (1) a combined schedule, (2) algebraic equations, (3) graph with intersecting lines, all pointing to P* and Q*.",
        "caption": "Three ways to find equilibrium: schedule, algebra, and graph."
      }
    },
    {
      "section_title": "The Equilibrium Adjustment Process",
      "introduction": "Markets are dynamic. When not in equilibrium, competitive forces automatically engage to move the price and quantity toward equilibrium. This process is known as the price mechanism or market mechanism.",
      "key_concept": {
        "definition": "The adjustment process relies on the responses of buyers and sellers to surpluses and shortages. A surplus (excess supply) triggers price competition among sellers, pushing price down. A shortage (excess demand) triggers price competition among buyers, pushing price up. These price changes cause movements along the curves, changing Qd and Qs until they are equal.",
        "context": "This process assumes a competitive market with many buyers and sellers, free flow of information, and price flexibility. It is the 'invisible hand' described by Adam Smith."
      },
      "principles": [
        {
          "principle": "Surplus Leads to Falling Prices",
          "statement": "If the market price is above P*, quantity supplied exceeds quantity demanded. Sellers cannot sell all their goods and will lower prices to attract buyers. Lower prices increase Qd and decrease Qs, reducing the surplus until it vanishes at P*.",
          "application": "Observed in markets with excess inventory (post-holiday sales, model year-end car clearances).",
          "example": "Market for T-shirts: P* = \\$15. Price is set at \\$20. At \\$20: Qs = 100 shirts, Qd = 60 shirts. Surplus = 40 shirts. Sellers have 40 unsold shirts. To clear stock, sellers discount to \\$18, then \\$16. As price falls: Buyers buy more (movement down demand curve). Sellers produce less (movement down supply curve). At \\$15, Qd = Qs = 80 shirts. Surplus is gone."
        },
        {
          "principle": "Shortage Leads to Rising Prices",
          "statement": "If the market price is below P*, quantity demanded exceeds quantity supplied. Buyers cannot obtain all they want and will offer higher prices to secure the good. Higher prices decrease Qd and increase Qs, reducing the shortage until it vanishes at P*.",
          "application": "Observed in markets for hot concert tickets, popular game consoles on launch day, or housing in booming cities.",
          "example": "Market for concert tickets: P* = \\$80. Price is initially \\$50. At \\$50: Qd = 10,000 tickets, Qs = 4,000 tickets. Shortage = 6,000 tickets. Thousands of fans are unable to buy at the box office. Scalpers (or a secondary market) emerge, offering tickets at higher prices. Price rises to \\$60, \\$70. As price rises: Some buyers drop out (movement up demand curve). More tickets may be released (movement up supply curve). At \\$80, Qd = Qs = 7,000 tickets. Shortage is gone."
        },
        {
          "principle": "Equilibrium as a Stable Attractor",
          "statement": "Equilibrium is a stable point. Any deviation creates forces that return the market to equilibrium. This self-correcting property is a key strength of competitive markets.",
          "application": "Markets are resilient to temporary shocks; prices guide resources to where they are most valued.",
          "example": "A sudden fad increases demand for a toy, creating a shortage at the old price. Price rises. The higher price: (1) rations the existing supply to those willing to pay most, (2) signals producers to make more. New supply arrives, and the market finds a new equilibrium at a higher P and Q. The market solved the allocation and production problem without central direction."
        }
      ],
      "worked_examples": [
        {
          "title": "Tracing the Adjustment Process",
          "problem": "The market for fresh strawberries has an equilibrium of P*=\\$4/qt, Q*=1000 quarts. Due to a temporary mispricing, a major seller lists them at \\$2/qt. (a) Describe the immediate market condition. (b) Trace the likely steps of adjustment. (c) How does the process differ if a law prevents prices from rising above \\$3 (a price ceiling)?",
          "step_by_step": [
            {
              "step": "Part (a): Immediate Condition at P=\\$2",
              "explanation": "At a price (\\$2) below the equilibrium price (\\$4), quantity demanded will exceed quantity supplied. This is a shortage. Consumers will rush to buy the cheaper strawberries, but producers are only willing to bring a smaller quantity to market at that low price. Shelves will empty quickly, and lines may form."
            },
            {
              "step": "Part (b): Natural Adjustment Steps",
              "explanation": "1. Shortage Emerges: At \\$2, Qd > Qs. Consumers who cannot find strawberries may offer to pay more, or sellers notice the rapid sell-out.<br>2. Price Rises: Sellers raise prices toward \\$4 (or a secondary market emerges with higher prices).<br>3. Quantity Adjusts: As price rises, Qd decreases (some consumers decide not to buy), and Qs increases (farmers pick and ship more strawberries).<br>4. Equilibrium Restored: The price continues to rise until it reaches \\$4, where the shortage is eliminated and Qd=Qs=1000 again."
            },
            {
              "step": "Part (c): Effect of a Price Ceiling at \\$3",
              "explanation": "If a law prevents price from rising above \\$3, the natural adjustment mechanism is disabled. At \\$3, the price is still below equilibrium, so a permanent shortage persists. The shortage at \\$3 will be smaller than at \\$2, but it will not self-correct. Adjustment must occur through non-price mechanisms: long lines, waiting lists, seller favoritism, or black markets where the good is sold illegally at prices above \\$3. The market is forced into a permanent disequilibrium (the topic of 3.9)."
            }
          ],
          "final_answer": "(a) At \\$2, a significant shortage occurs as Qd > Qs. (b) The shortage creates upward pressure on price; sellers raise prices, which reduces Qd and increases Qs until equilibrium is restored at \\$4. (c) A price ceiling at \\$3 blocks this adjustment, creating a permanent, though smaller, shortage. The market cannot clear, leading to inefficient non-price rationing.",
          "concept_applied": "The price mechanism eliminates shortages and surpluses. Government interventions like price ceilings can prevent equilibrium from being reached, leading to persistent disequilibrium."
        }
      ],
      "image": {
        "src": "images/unit3/adjustment_process.png",
        "alt": "Animated sequence: (1) Price above P* shows surplus and down arrow on price. (2) Price below P* shows shortage and up arrow on price. (3) Price at P* shows equilibrium with no arrows.",
        "caption": "The price mechanism: Surpluses drive prices down; shortages drive prices up until equilibrium is restored."
      }
    }
  ],
  "key_terms": [
    "Market equilibrium",
    "Equilibrium price (P*)",
    "Market-clearing price",
    "Equilibrium quantity (Q*)",
    "Surplus",
    "Excess supply",
    "Shortage",
    "Excess demand",
    "Price mechanism",
    "Market mechanism",
    "Intersection point",
    "Stable equilibrium",
    "Disequilibrium"
  ],
  "summary": "Market equilibrium is the central organizing concept of a market economy, representing the price and quantity where the plans of buyers and sellers align.<br><br>Equilibrium is defined by Quantity Demanded (Qd) = Quantity Supplied (Qs). The corresponding price is the equilibrium or market-clearing price (P*), and the corresponding quantity is the equilibrium quantity (Q*). Graphically, this is the intersection point of the market demand and supply curves.<br><br>When the market price is above P*, Qs > Qd, resulting in a surplus (excess supply). This surplus creates competitive pressure among sellers to lower prices to clear their inventory. Falling prices simultaneously increase the quantity demanded (movement down the demand curve) and decrease the quantity supplied (movement down the supply curve), reducing the surplus until it disappears at P*.<br><br>When the market price is below P*, Qd > Qs, resulting in a shortage (excess demand). This shortage creates competitive pressure among buyers to offer higher prices to obtain the good. Rising prices simultaneously decrease the quantity demanded (movement up the demand curve) and increase the quantity supplied (movement up the supply curve), reducing the shortage until it disappears at P*.<br><br>This self-correcting process is known as the price mechanism or market mechanism. It demonstrates how decentralized markets automatically adjust to eliminate imbalances without the need for central planning. Equilibrium acts as a stable attractor; any deviation creates forces that return the market to balance.<br><br>Equilibrium can be found using three methods: (1) Market Schedules: by inspecting a table of prices, Qd, and Qs to find the row where the quantities match; (2) Algebra: by setting the demand function (Qd = a - bP) equal to the supply function (Qs = c + dP) and solving for P* and Q*; (3) Graphically: by plotting both curves and identifying their intersection point.<br><br>Understanding equilibrium is prerequisite for analyzing disequilibrium (3.9)—the persistent surplus or shortage that occurs when prices are fixed away from P*—and shifts in equilibrium (3.10), which occur when an underlying determinant of demand or supply changes, moving the entire curves and creating a new intersection point."
}
