{
  "expanded_description": "Goods are classified as normal or inferior based on how demand responds to income changes. This classification is crucial for understanding consumer behavior, predicting market responses to economic conditions, and analyzing distributional effects of economic growth or recession. While most goods are normal, inferior goods play an important role in consumption patterns, especially during economic hardship.",
  "core_concept": {
    "principle": "Normal goods are goods for which demand increases when income increases and decreases when income decreases (positive income-demand relationship). Inferior goods are goods for which demand decreases when income increases and increases when income decreases (negative income-demand relationship). The classification depends on consumer behavior, not inherent product characteristics. The same good can be normal for some consumers and inferior for others, or normal at some income levels and inferior at others. Most goods are normal goods. Inferior goods are typically lower-quality alternatives that consumers abandon when they can afford better options. Understanding the normal/inferior distinction is essential because: Income changes (economic growth, recessions) affect markets differently for normal vs. inferior goods. Business strategy differs for normal goods (target growing incomes) vs. inferior goods (countercyclical—benefit from recessions). Policy effects vary—redistributive policies affect demand for normal and inferior goods oppositely.",
    "explanation": "The normal/inferior distinction captures a fundamental aspect of consumer behavior: as people get richer, they upgrade their consumption. Consider two goods: Restaurant meals (normal good for most people): When income rises 20%, might eat out 30% more often (income elasticity +1.5). When income falls 20% (recession), might eat out 40% less. Income ↑ → demand ↑. Income ↓ → demand ↓. Normal good. Instant ramen noodles (inferior good for many): When income rises 20%, might reduce ramen consumption 30% (buy better food). When income falls 20% (recession), might increase ramen consumption 40% (cheap calories). Income ↑ → demand ↓. Income ↓ → demand ↑. Inferior good. Why does this happen? Income changes alter opportunity costs and consumption patterns. When income rises: Can afford higher-quality alternatives to inferior goods. Substitute better options (restaurants) for inferior options (ramen). Inferior goods demand falls. Normal goods demand rises. When income falls: Must economize, seek cheaper alternatives. Substitute inferior goods (ramen) for normal goods (restaurants). Inferior goods demand rises. Normal goods demand falls (or rises less). The normal/inferior classification isn't absolute—it depends on: Income level: Ramen might be normal good for very poor (any food increase when income rises), but inferior for middle class (abandon ramen when richer). Consumer preferences: Some people love ramen regardless of income (normal good for them). Geographic context: Bus transit might be inferior in car-centric U.S., but normal in transit-oriented Europe. Time period: Same good can switch categories as economy develops. Examples across the spectrum: Clearly normal: Luxury goods (jewelry, vacation homes, fine dining, international travel). Most normal: Standard goods (clothing, housing, healthcare, education, entertainment). Borderline: Basic staples (bread, rice—demand relatively stable across incomes). Inferior goods: Low-quality alternatives (cheap processed foods, used goods, lower-tier services, public transit in car-centric areas). The normal/inferior distinction has practical importance: Economic growth: Raises incomes → normal goods boom, inferior goods struggle. Recessions: Lower incomes → normal goods decline, inferior goods increase. Business strategy: Normal goods: Market to growing incomes, premium positioning, expand during booms. Inferior goods: Market to budget-conscious, value positioning, countercyclical (steady or grow during recessions). Income inequality: Redistribution to poor increases demand for normal goods (high marginal propensity to consume). Taxation of rich decreases demand for luxury normal goods. Understanding whether your product is normal or inferior guides pricing, marketing, capacity planning, and financial forecasting. For policymakers, understanding these patterns helps predict consumption responses to tax changes, transfers, and economic cycles.",
    "image": {
      "src": "images/unit3/normal_inferior_comparison.png",
      "alt": "Two panels: normal good showing demand shifting right with income increase; inferior good showing demand shifting left with income increase",
      "caption": "Normal vs. inferior goods: normal goods—income ↑ demand ↑; inferior goods—income ↑ demand ↓"
    }
  },
  "sections": [
    {
      "section_title": "Defining Normal and Inferior Goods",
      "introduction": "The normal/inferior classification is based on the income elasticity of demand—how demand responds to income changes. Understanding precise definitions and measurement is essential for applying these concepts.",
      "key_concept": {
        "definition": "Normal good: A good for which quantity demanded increases when income increases, holding price and other factors constant. Income elasticity of demand is positive (> 0). Can be further classified as: Necessity (income elasticity between 0 and 1): Demand rises with income, but less than proportionally. Example: Food, basic clothing. Luxury (income elasticity > 1): Demand rises with income more than proportionally. Example: Fine dining, jewelry, luxury cars. Inferior good: A good for which quantity demanded decreases when income increases, holding price and other factors constant. Income elasticity of demand is negative (< 0). Income elasticity formula: % change in quantity demanded ÷ % change in income.",
        "context": "The classification is empirical—determined by observing actual consumer behavior, not by judgment about quality. 'Inferior' is a technical term describing income response, not a value judgment about the product. Many useful, important goods are inferior goods for certain consumers."
      },
      "principles": [
        {
          "principle": "Normal Goods: Positive Income-Demand Relationship",
          "statement": "For normal goods, income and demand move in the same direction. Income increases → demand increases (rightward shift). Income decreases → demand decreases (leftward shift). Income elasticity is positive.",
          "application": "Most goods in developed economies are normal goods. Economic growth increases demand for these goods.",
          "example": "Healthcare services (normal good): Consumer income: \\$40,000 → \\$50,000 (25% increase). Healthcare spending: \\$3,000 → \\$4,000 per year (33% increase). Income elasticity: 33% ÷ 25% = +1.32 (positive, > 1 → luxury normal good). At any given healthcare price, quantity demanded increased when income rose. Demand curve shifted right. Income ↑ → demand ↑. Normal good."
        },
        {
          "principle": "Inferior Goods: Negative Income-Demand Relationship",
          "statement": "For inferior goods, income and demand move in opposite directions. Income increases → demand decreases (leftward shift). Income decreases → demand increases (rightward shift). Income elasticity is negative.",
          "application": "Inferior goods are less common but important, especially during economic downturns. Recession increases demand for these goods.",
          "example": "Bus transit in car-owning area (inferior good for many): Consumer income: \\$30,000 → \\$40,000 (33% increase). Bus trips: 100 → 60 per year (40% decrease—bought a car instead). Income elasticity: -40% ÷ 33% = -1.21 (negative → inferior good). At any given bus fare, quantity demanded decreased when income rose. Demand curve shifted left. Income ↑ → demand ↓. Inferior good."
        },
        {
          "principle": "Income Elasticity Magnitude Matters",
          "statement": "The size of income elasticity indicates responsiveness to income changes. High elasticity (|value| > 1): Very income-sensitive—demand changes more than income. Low elasticity (|value| < 1): Income-insensitive—demand changes less than income. Zero elasticity: Income-independent—demand unaffected by income.",
          "application": "High-elasticity goods experience large demand swings during economic cycles. Low-elasticity goods have stable demand.",
          "example": "Income rises 10%: Luxury cars (elasticity +2.5): Demand increases 25% (very responsive). Bread (elasticity +0.2): Demand increases 2% (barely responsive). Used clothing (elasticity -0.8): Demand decreases 8% (inferior good, responsive). Salt (elasticity ≈0): Demand unchanged (income-independent)."
        },
        {
          "principle": "Classification Can Vary by Consumer and Income Level",
          "statement": "Whether a good is normal or inferior depends on the consumer. Same good can be: Normal for some consumers, inferior for others. Normal at low incomes, inferior at high incomes (or vice versa). The classification is behavioral, not inherent to the product.",
          "application": "Can't assume a good is universally normal or inferior—must examine specific consumer behavior.",
          "example": "McDonald's: For poor college student (income \\$15,000): Normal good—income rises to \\$20,000 → eats at McDonald's more often (can afford it more). For middle-class family (income \\$80,000): Inferior good—income rises to \\$100,000 → eats at McDonald's less often (substitute nicer restaurants). Same product, different income-demand relationship depending on consumer's income level and alternatives."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Income Elasticity and Classifying Goods",
          "problem": "Consumer's income rises from \\$40,000 to \\$50,000. Consumption changes: (a) Organic vegetables: 50 → 70 pounds/year, (b) White bread: 100 → 90 loaves/year, (c) Gasoline: 500 → 525 gallons/year. For each good: Calculate income elasticity, classify as normal or inferior, and identify as necessity/luxury if normal.",
          "step_by_step": [
            {
              "step": "Calculate income change percentage",
              "explanation": "Income: \\$40,000 → \\$50,000. Change: \\$50,000 - \\$40,000 = \\$10,000. Percentage: (\\$10,000 ÷ \\$40,000) × 100% = 25% increase. This 25% income increase will be used to calculate all elasticities."
            },
            {
              "step": "Part (a): Organic vegetables",
              "explanation": "Quantity: 50 → 70 pounds/year. Change: 70 - 50 = 20 pounds. Percentage: (20 ÷ 50) × 100% = 40% increase. Income elasticity: % change in quantity ÷ % change in income = 40% ÷ 25% = 1.6. Classification: Elasticity is positive (1.6 > 0) → Normal good. Elasticity > 1 → Luxury normal good. Interpretation: Income ↑ 25% → demand ↑ 40%. Demand rises faster than income. Organic vegetables are luxury good—income-sensitive, purchased more when consumers can afford them."
            },
            {
              "step": "Part (b): White bread",
              "explanation": "Quantity: 100 → 90 loaves/year. Change: 90 - 100 = -10 loaves. Percentage: (-10 ÷ 100) × 100% = -10% decrease. Income elasticity: -10% ÷ 25% = -0.4. Classification: Elasticity is negative (-0.4 < 0) → Inferior good. Interpretation: Income ↑ 25% → demand ↓ 10%. Higher income → less white bread consumed. Consumer substituted higher-quality bread (whole grain, artisan) for cheap white bread. White bread is inferior good for this consumer."
            },
            {
              "step": "Part (c): Gasoline",
              "explanation": "Quantity: 500 → 525 gallons/year. Change: 525 - 500 = 25 gallons. Percentage: (25 ÷ 500) × 100% = 5% increase. Income elasticity: 5% ÷ 25% = 0.2. Classification: Elasticity is positive (0.2 > 0) → Normal good. Elasticity < 1 → Necessity normal good. Interpretation: Income ↑ 25% → demand ↑ 5%. Demand rises with income but less than proportionally. Gasoline is necessity—needed for commuting regardless of income, but consumption doesn't rise much with higher income."
            },
            {
              "step": "Summary and comparison",
              "explanation": "Ranked by income elasticity: Organic vegetables: +1.6 (luxury—most income-sensitive). Gasoline: +0.2 (necessity—barely income-sensitive). White bread: -0.4 (inferior—demand falls with income). Different goods respond very differently to same income change. Organic vegetables see largest demand increase. Gasoline demand barely budges. White bread demand actually decreases."
            }
          ],
          "final_answer": "(a) Organic vegetables: Income elasticity +1.6 → Luxury normal good (demand rises faster than income). (b) White bread: Income elasticity -0.4 → Inferior good (demand falls when income rises—substituted better alternatives). (c) Gasoline: Income elasticity +0.2 → Necessity normal good (demand rises with income but less than proportionally). Income elasticity reveals how different goods respond to income changes, enabling classification and predicting demand responses to economic growth or recessions.",
          "concept_applied": "Income elasticity of demand measures responsiveness of quantity demanded to income changes. Positive elasticity = normal good (further classified as necessity if <1, luxury if >1). Negative elasticity = inferior good. Magnitude indicates sensitivity—high absolute values mean very responsive to income, low values mean relatively insensitive. Calculating elasticities enables precise classification and demand forecasting."
        }
      ],
      "image": {
        "src": "images/unit3/income_elasticity_spectrum.png",
        "alt": "Spectrum showing income elasticity values: inferior goods (negative), necessities (0 to 1), luxuries (above 1)",
        "caption": "Income elasticity spectrum: inferior goods (negative), necessity normal goods (0-1), luxury normal goods (>1)"
      }
    },
    {
      "section_title": "Examples and Real-World Patterns",
      "introduction": "Understanding which goods are typically normal or inferior helps predict market behavior and consumer responses to economic changes. Real-world examples illustrate the concepts and their practical importance.",
      "key_concept": {
        "definition": "Common normal goods include: Luxuries—jewelry, fine dining, international travel, luxury cars, designer clothing (high positive elasticity). Standard goods—housing quality, healthcare, education, entertainment, middle-tier products (moderate positive elasticity). Necessities—basic food, utilities, essential clothing, transportation (low positive elasticity). Common inferior goods include: Low-quality alternatives—instant noodles, cheap processed foods, store brands (for some consumers). Lower-tier services—public transit in car-oriented areas, budget motels, discount retailers. Used/second-hand goods—used cars, thrift store clothing, refurbished electronics. Emergency foods—rice and beans in bulk, canned goods, cheap starches.",
        "context": "These classifications represent typical patterns but aren't universal. Individual consumer behavior, cultural context, and specific market conditions can change whether particular goods are normal or inferior."
      },
      "categories": [
        {
          "type": "Luxury Normal Goods (High Income Elasticity)",
          "description": "Goods with income elasticity significantly above 1—demand rises faster than income.",
          "examples": [
            {
              "process": "International travel",
              "explanation": "Income elasticity often 2-3 or higher. Small income changes create large demand changes. Example: Income rises 10% (\\$60,000 to \\$66,000). International trips: 1 → 1.3 per year (30% increase). Income elasticity: 30% ÷ 10% = 3.0. Economic boom: International travel industry booms disproportionately. Recession: Travel collapses—people cut discretionary spending. Very cyclical industry."
            },
            {
              "process": "Fine dining and luxury goods",
              "explanation": "High-end restaurants, jewelry, luxury cars—all very income-sensitive. Example: Income rises 20%. Luxury car purchases: Increase 50% (elasticity 2.5). Fine dining: Increase 40% (elasticity 2.0). These industries boom during economic expansions, struggle during downturns. Marketing targets affluent, growing-income segments."
            },
            {
              "process": "Premium housing",
              "explanation": "Trading up to better housing very income-sensitive. Example: Income rises 15%. Move from \\$300,000 home to \\$400,000+ home (33% increase in housing). Housing quality income elasticity: 33% ÷ 15% = 2.2. Luxury housing markets very cyclical—boom in good times, bust in recessions."
            }
          ]
        },
        {
          "type": "Necessity Normal Goods (Low Income Elasticity)",
          "description": "Goods with income elasticity between 0 and 1—demand rises with income but less than proportionally.",
          "examples": [
            {
              "process": "Food overall",
              "explanation": "Total food spending rises with income, but slowly (Engel's Law). Example: Income doubles (\\$30,000 → \\$60,000). Food spending: \\$6,000 → \\$9,000 (50% increase, not 100%). Income elasticity: 50% ÷ 100% = 0.5. Food share of budget falls as income rises: Poor: 40% on food. Rich: 10% on food. Necessity—need to eat regardless of income."
            },
            {
              "process": "Utilities and basic services",
              "explanation": "Electricity, water, phone service—weakly income-sensitive. Example: Income rises 25%. Utility spending: Rises 10% (slightly bigger home, more usage). Income elasticity: 10% ÷ 25% = 0.4. Utility demand relatively stable across business cycles—recession-resistant."
            },
            {
              "process": "Healthcare",
              "explanation": "Necessary but income-sensitive (varies by system). U.S. example: Income rises 20%. Healthcare spending: Rises 30% (elasticity 1.5—actually luxury). International: With universal coverage, individual spending less income-sensitive (more like necessity). Healthcare classification varies by institutional context."
            }
          ]
        },
        {
          "type": "Common Inferior Goods",
          "description": "Goods with negative income elasticity—demand falls when income rises.",
          "examples": [
            {
              "process": "Instant noodles and cheap staples",
              "explanation": "Classic inferior good—people abandon when they can afford better. Example: College student: Income \\$12,000: Eats ramen 100 times/year (cheap calories). Income \\$50,000 (post-graduation): Eats ramen 10 times/year (nostalgia only). Income elasticity: -90% ÷ 317% ≈ -0.28 (inferior good). Ramen companies market to students, budget-conscious—countercyclical during recessions."
            },
            {
              "process": "Public transit in car-oriented areas",
              "explanation": "Many switch from bus/subway to car ownership when income rises. Example: Urban resident: Income \\$25,000: Takes bus 200 trips/year (can't afford car). Income \\$45,000: Takes bus 50 trips/year (bought used car, only use bus occasionally). Income elasticity: -75% ÷ 80% ≈ -0.94 (strongly inferior). Transit ridership increases during recessions as people give up cars."
            },
            {
              "process": "Store brands and generic products",
              "explanation": "Some consumers switch to name brands when income rises. Example: Shopper: Income \\$30,000: Buys generic cereals, canned goods (save money). Income \\$50,000: Switches to name brands (can afford preferences). Generic purchases decline 40% despite 67% income increase. Income elasticity: -40% ÷ 67% ≈ -0.6 (inferior). Store brands do well in recessions as consumers trade down."
            },
            {
              "process": "Used goods and thrift stores",
              "explanation": "Used clothing, refurbished electronics—inferior for many as they can afford new. Example: Consumer: Income \\$20,000: Buys used clothing regularly (afford new rarely). Income \\$40,000: Buys mainly new clothing (used occasionally for vintage/unique). Thrift store purchases decline 60% despite 100% income increase. Income elasticity: -60% ÷ 100% = -0.6 (inferior). Thrift stores countercyclical—thrive during recessions."
            }
          ]
        },
        {
          "type": "Context-Dependent Classification",
          "description": "Goods that change classification based on income level, culture, or market.",
          "examples": [
            {
              "process": "Fast food—varies by income level",
              "explanation": "Can be normal or inferior depending on starting income. Low income (\\$15,000): Fast food is normal good—income rise means can afford McDonald's more. Middle income (\\$60,000): Fast food is inferior—income rise means substitute casual dining restaurants. High income (\\$150,000): Fast food is normal again—convenience good, not about cost. Same product, different relationships at different income levels."
            },
            {
              "process": "Potatoes—historical Giffen good debate",
              "explanation": "During Irish potato famine, some argued potatoes were Giffen good (extreme inferior good). Very poor Irish: Potatoes were huge budget share (80%+). Potato price rises → Real income falls dramatically. Being much poorer → Can't afford meat anymore. Shift consumption toward potatoes (cheapest calories). Perversely: Potato price ↑ → Potato demand ↑. This is Giffen good (upward-sloping demand)—debated whether it actually occurred. Shows extreme income effects can create unusual patterns."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Recession Effects on Normal and Inferior Goods",
          "problem": "Economy enters recession. Average household income falls 12%. Three businesses: (a) Luxury hotel chain (income elasticity +2.0), (b) Grocery stores (income elasticity +0.4), (c) Budget motel chain (income elasticity -0.6). Predict revenue changes for each business. Assume prices remain constant.",
          "step_by_step": [
            {
              "step": "Part (a): Luxury hotel chain",
              "explanation": "Income elasticity: +2.0 (luxury normal good). Income change: -12% (recession). Demand change: Income elasticity × Income change = 2.0 × (-12%) = -24%. Prediction: Luxury hotel stays decline 24%. Revenue impact (assuming constant prices): Revenue falls 24%. Interpretation: Luxury hotels very vulnerable to recession. Discretionary luxury spending cut first. Demand falls twice as fast as income. Business should: Prepare for major revenue decline. Cut costs aggressively. Shift marketing to value proposition. Consider temporary price reductions to maintain occupancy."
            },
            {
              "step": "Part (b): Grocery stores",
              "explanation": "Income elasticity: +0.4 (necessity normal good). Income change: -12%. Demand change: 0.4 × (-12%) = -4.8%. Prediction: Grocery sales decline 4.8%. Revenue impact: Revenue falls 4.8%. Interpretation: Groceries relatively recession-resistant. Food is necessity—demand doesn't fall much. Demand falls less than income (inelastic). Business should: Expect modest sales decline. May see shift to cheaper products/brands within store. Relatively stable during recession. Might gain market share if restaurants (more cyclical) lose customers."
            },
            {
              "step": "Part (c): Budget motel chain",
              "explanation": "Income elasticity: -0.6 (inferior good). Income change: -12%. Demand change: -0.6 × (-12%) = +7.2%. Prediction: Budget motel stays increase 7.2%. Revenue impact: Revenue rises 7.2%. Interpretation: Budget motels benefit from recession (countercyclical). Consumers trade down from luxury hotels to budget options. Being poorer → Demand for inferior good increases. Business should: Expect increased demand. Maintain capacity—don't cut. Marketing emphasizes value and savings. Countercyclical opportunity—revenue grows while economy shrinks."
            },
            {
              "step": "Compare three businesses",
              "explanation": "During 12% income decline: Luxury hotels: -24% revenue (hard hit). Grocery stores: -4.8% revenue (slight decline). Budget motels: +7.2% revenue (benefit). Pattern: Normal goods (especially luxuries): Suffer during recessions. Necessities: Relatively stable. Inferior goods: Benefit from recessions (countercyclical). Portfolio diversification: Investors might hold mix—normal goods for growth periods, inferior goods for recession protection."
            }
          ],
          "final_answer": "(a) Luxury hotels: Revenue falls 24% (income elasticity +2.0 → luxury very vulnerable to recession). (b) Grocery stores: Revenue falls 4.8% (income elasticity +0.4 → necessity relatively stable). (c) Budget motels: Revenue rises 7.2% (income elasticity -0.6 → inferior good benefits from consumers trading down). Normal/inferior classification critically important for predicting business performance during economic cycles.",
          "concept_applied": "Income elasticity predicts business performance during economic cycles. Luxury normal goods (high positive elasticity) suffer disproportionately during recessions but boom during expansions. Necessity normal goods (low positive elasticity) are relatively recession-resistant with stable demand. Inferior goods (negative elasticity) are countercyclical—benefit from recessions as consumers trade down. Understanding whether your product is normal or inferior guides business strategy, financial planning, and risk management."
        }
      ],
      "image": {
        "src": "images/unit3/normal_inferior_examples.png",
        "alt": "Chart showing various goods plotted by income elasticity: luxuries (high positive), necessities (low positive), inferior goods (negative)",
        "caption": "Normal and inferior goods examples: luxuries most income-sensitive; necessities stable; inferior goods countercyclical"
      }
    },
    {
      "section_title": "Engel Curves and Income-Consumption Patterns",
      "introduction": "Engel curves graphically represent the relationship between income and quantity demanded for a good. They provide a visual way to understand normal and inferior goods and how consumption patterns change with income.",
      "key_concept": {
        "definition": "An Engel curve plots the relationship between consumer income (horizontal axis) and quantity demanded (vertical axis), holding prices constant. For normal goods: Engel curve slopes upward (positive slope)—higher income → higher quantity demanded. Steep slope = luxury (income-sensitive). Gentle slope = necessity (income-insensitive). For inferior goods: Engel curve slopes downward (negative slope)—higher income → lower quantity demanded. The curve may be straight (constant income elasticity) or curved (changing elasticity at different income levels). Engel curves are named after Ernst Engel, a 19th-century statistician who studied how household spending patterns change with income.",
        "context": "Engel curves complement demand curves: Demand curves show price-quantity relationship (holding income constant). Engel curves show income-quantity relationship (holding price constant). Both are essential for complete demand analysis. Engel curves reveal consumption patterns across income distribution."
      },
      "principles": [
        {
          "principle": "Upward-Sloping Engel Curve Indicates Normal Good",
          "statement": "For normal goods, the Engel curve slopes upward from left to right. As you move right on income axis (higher income), you move up on quantity axis (higher quantity demanded). Positive slope reflects positive income-demand relationship.",
          "application": "Can identify normal goods by observing upward-sloping Engel curves. Steepness indicates degree of income sensitivity.",
          "example": "Restaurant meals Engel curve: At \\$20,000 income: 10 restaurant meals/month. At \\$40,000 income: 20 restaurant meals/month. At \\$60,000 income: 35 restaurant meals/month. At \\$80,000 income: 50 restaurant meals/month. Plotting: Income on horizontal axis, meals on vertical. Curve slopes upward (income ↑ → meals ↑). Curve gets steeper at higher incomes (accelerating consumption). Normal good with increasing income sensitivity."
        },
        {
          "principle": "Downward-Sloping Engel Curve Indicates Inferior Good",
          "statement": "For inferior goods, the Engel curve slopes downward from left to right. As you move right on income axis (higher income), you move down on quantity axis (lower quantity demanded). Negative slope reflects negative income-demand relationship.",
          "application": "Can identify inferior goods by observing downward-sloping Engel curves. Curve may slope down only at higher incomes (good becomes inferior above threshold).",
          "example": "Instant ramen Engel curve: At \\$15,000 income: 80 ramen meals/year. At \\$25,000 income: 60 ramen meals/year. At \\$40,000 income: 30 ramen meals/year. At \\$60,000 income: 10 ramen meals/year. Plotting: Curve slopes downward throughout (income ↑ → ramen ↓). Inferior good across entire income range shown."
        },
        {
          "principle": "Engel Curve Slope Equals Income Effect",
          "statement": "The slope of the Engel curve shows how quantity demanded changes per dollar of income change. Steep positive slope = large income effect (luxury). Gentle positive slope = small income effect (necessity). Negative slope = inferior good. Zero slope = income-independent good.",
          "application": "Engel curve steepness visually represents income elasticity and good classification.",
          "example": "Comparing three Engel curves at \\$40,000 income, \\$1,000 income increase: Luxury car curve: Quantity increases 0.05 cars (steep slope—large effect). Bread curve: Quantity increases 2 loaves (gentle slope—small effect). Used car curve: Quantity decreases 0.02 cars (negative slope—inferior). Slope differences visually show income sensitivity differences."
        },
        {
          "principle": "Engel Curves Can Change Slope (Good Switches Categories)",
          "statement": "Some goods are normal at low incomes, then become inferior at high incomes (or vice versa). Engel curve slopes upward at first, then downward. Reflects changing consumption patterns across income spectrum.",
          "application": "Same good can be normal for poor, inferior for rich. Engel curve captures this transition.",
          "example": "Fast food Engel curve: At \\$10,000 income: 20 fast food meals/month (can barely afford). At \\$30,000 income: 35 fast food meals/month (normal good—more income, more fast food). At \\$60,000 income: 25 fast food meals/month (inferior good starts—substitute casual dining). At \\$100,000 income: 10 fast food meals/month (strongly inferior—prefer upscale). Engel curve: Slopes upward from \\$10K-\\$30K (normal good range). Slopes downward from \\$30K-\\$100K (inferior good range). Transition point ≈\\$30,000 income."
        }
      ],
      "image": {
        "src": "images/unit3/engel_curves.png",
        "alt": "Three Engel curves: steep upward slope (luxury), gentle upward slope (necessity), downward slope (inferior good)",
        "caption": "Engel curves: income (horizontal) vs. quantity demanded (vertical); slope indicates normal (upward) or inferior (downward)"
      }
    }
  ],
  "key_terms": [
    "Normal goods",
    "Inferior goods",
    "Income elasticity of demand",
    "Luxury goods",
    "Necessity goods",
    "Engel curve",
    "Engel's Law",
    "Income-consumption relationship",
    "Countercyclical",
    "Procyclical",
    "Income-sensitive goods",
    "Income-insensitive goods"
  ],
  "summary": "Goods are classified as normal or inferior based on how demand responds to income changes, measured by income elasticity of demand (percentage change in quantity demanded divided by percentage change in income). Normal goods have positive income elasticity—demand increases when income increases and decreases when income falls (income and demand move together). Most goods in developed economies are normal goods. Normal goods are further classified as necessities (income elasticity between 0 and 1—demand rises with income but less than proportionally, like food and utilities) or luxuries (income elasticity above 1—demand rises faster than income, like international travel, fine dining, jewelry, luxury cars). Inferior goods have negative income elasticity—demand decreases when income increases and increases when income falls (income and demand move opposite directions). Inferior goods are typically lower-quality alternatives that consumers abandon when they can afford better options, such as instant noodles, public transit in car-oriented areas, store brands, used goods, and cheap staples. The normal/inferior classification depends on consumer behavior, not inherent product characteristics—the same good can be normal for some consumers and inferior for others, or normal at some income levels and inferior at others. Income elasticity magnitude indicates responsiveness: high absolute values (>1) mean very income-sensitive with large demand swings during economic cycles, while low absolute values (<1) mean relatively income-insensitive with stable demand. Understanding normal versus inferior goods is essential for predicting market responses to economic conditions: economic growth raises incomes, increasing demand for normal goods (especially luxuries which boom disproportionately) while decreasing demand for inferior goods. Recessions lower incomes, decreasing demand for normal goods (especially luxuries which suffer disproportionately) while increasing demand for inferior goods (countercyclical—benefit from economic hardship). Business strategy differs dramatically: normal goods are marketed to growing incomes with premium positioning and expansion during booms, while inferior goods are marketed to budget-conscious consumers with value positioning and countercyclical steady or growing demand during recessions. Engel curves graphically represent income-quantity relationships with income on horizontal axis and quantity demanded on vertical axis, holding prices constant. Upward-sloping Engel curves indicate normal goods (income ↑ → quantity ↑) with steepness showing income sensitivity (steep = luxury, gentle = necessity). Downward-sloping Engel curves indicate inferior goods (income ↑ → quantity ↓). Some Engel curves change slope, showing goods that are normal at low incomes then become inferior at high incomes or vice versa. Engel's Law states that food's share of household budget declines as income rises—food is necessity normal good (elasticity <1) so spending rises with income but proportionally less, causing budget share to fall from perhaps 40% for poor households to 10% for wealthy households. Real-world patterns show luxury normal goods (international travel, fine dining, luxury vehicles with elasticities often 2-3+) are very cyclical and boom during expansions while collapsing during recessions. Necessity normal goods (total food, utilities, basic services with elasticities 0.2-0.6) are relatively recession-resistant with stable demand across business cycles. Inferior goods (instant noodles, budget lodging, thrift stores with negative elasticities) are countercyclical, thriving during recessions as consumers trade down. Policy implications include: redistributive policies transferring income to poor increase aggregate demand for normal goods because poor have high marginal propensity to consume. Progressive taxation of rich reduces demand for luxury normal goods. Understanding income effects helps forecast consumption responses to tax changes, transfers, and economic cycles. The normal/inferior distinction is fundamental to consumer behavior analysis, market forecasting, business strategy, and understanding how consumption patterns evolve with economic development as societies grow richer and shift consumption from inferior goods and necessities toward luxuries."
}
