{
  "expanded_description": "Why do countries trade with each other? What are the effects of imports and exports on domestic markets? And what happens when governments intervene with tariffs and quotas? International trade brings the principles of microeconomics to the global stage. Trade allows countries to specialize according to comparative advantage, increasing total world output and raising living standards. But trade also creates winners and losers within countries, leading to political pressure for protectionism. Understanding the microeconomics of international trade is essential for analyzing globalization, trade policy, and the ongoing debates about free trade vs. protectionism.",
  
  "core_concept": {
    "principle": "International trade allows countries to specialize according to comparative advantage, increasing total world output and consumption possibilities. (1) Comparative advantage: A country has a comparative advantage in producing a good if it can produce it at a lower opportunity cost than another country. Trade based on comparative advantage benefits both countries. (2) World price: The price at which a good trades on international markets. When a country opens to trade, the domestic price adjusts toward the world price. (3) Gains from trade: Trade increases total surplus by allowing countries to import goods they produce at high cost and export goods they produce at low cost. (4) Winners and losers: Trade benefits consumers of imported goods and producers of exported goods, but hurts domestic producers of import-competing goods and consumers of exported goods. (5) Trade policy: Tariffs (taxes on imports) and quotas (quantity limits on imports) restrict trade, creating deadweight loss. (6) Arguments for protectionism: National security, infant industry protection, anti-dumping, and job protection are often cited, but economists generally view them as weak justifications for trade barriers.",
    
    "explanation": "Think of a country as a giant household. If your household is good at growing vegetables but bad at making clothes, you'd grow extra vegetables and trade them for clothes. Your household is better off specializing and trading. The same logic applies to countries. When countries trade, they can focus on what they do best and import the rest. This makes everyone better off overall, though some individuals within each country may lose from trade.",
    
    "image": {
      "src": "images/unit11/trade_overview.png",
      "alt": "Countries trading goods, with arrows showing exports and imports",
      "caption": "Figure 11.0.1: International trade allows countries to specialize and benefit from exchange."
    }
  },

  "sections": [
    {
      "section_title": "11.1 Comparative Advantage Revisited",
      "introduction": "Why do countries trade with each other? The answer lies in comparative advantage—the ability to produce a good at a lower opportunity cost than another country. This concept, first explained by David Ricardo in 1817, shows that even if one country is more efficient at producing everything, both countries can still gain from trade. In this section, we'll revisit comparative advantage in an international context, learn how to determine which country should produce what, and analyze the gains from specialization and trade.",
      
      "introduction_image": {
        "src": "images/unit11/comparative_intro.png",
        "alt": "Two countries producing different goods and trading",
        "caption": "Figure 11.1.1: Comparative advantage determines the pattern of international trade."
      },
      
      "key_concept": {
        "definition": "Comparative advantage is the ability to produce a good at a lower opportunity cost than another country. (1) Opportunity cost: The amount of another good that must be given up to produce one unit of a good. (2) Determining comparative advantage: Calculate the opportunity cost of producing each good in each country. The country with the lower opportunity cost for a good has the comparative advantage in that good. (3) Absolute advantage vs. comparative advantage: Absolute advantage means being able to produce more with the same resources (higher productivity). Comparative advantage is about relative efficiency—it's possible to have absolute advantage in everything but still benefit from trade by specializing in what you do relatively best. (4) Specialization: Each country should specialize in producing the good for which it has a comparative advantage. (5) Gains from trade: By specializing and trading, both countries can consume beyond their own production possibilities frontiers. The terms of trade (the rate at which goods are exchanged) must lie between the two countries' opportunity costs for both to benefit. (6) Assumptions: The basic model assumes two countries, two goods, constant opportunity costs, no transportation costs, and no trade barriers.",
        
        "context": "Comparative advantage is the foundation of international trade theory. It demonstrates that trade is positive-sum—both parties can gain. This insight challenges mercantilist views that trade is zero-sum. In AP Microeconomics, understanding comparative advantage is essential for analyzing trade patterns, the effects of trade liberalization, and the gains from specialization.",
        
        "image": {
          "src": "images/unit11/comparative_diagram.png",
          "alt": "Production possibilities curves for two countries showing gains from trade",
          "caption": "Figure 11.1.2: Comparative advantage allows both countries to consume beyond their PPCs."
        }
      },

      "classifications": [
        {
          "type": "Absolute Advantage",
          "value": "Higher productivity in producing a good",
          "characteristics": ["More output per unit of input", "Same output with fewer inputs", "Does not determine trade pattern", "Can have absolute advantage in all goods", "Based on productivity, not opportunity cost"],
          "behavior": "Absolute advantage compares productivity across countries. If Country A can produce more of a good with the same resources than Country B, Country A has an absolute advantage. While absolute advantage matters for overall output, it does not determine the pattern of trade. A country with absolute advantage in everything can still benefit from trade by specializing in what it does relatively best (its comparative advantage). Absolute advantage is about who is better at producing, but trade is about relative efficiency.",
          
          "image": {
            "src": "images/unit11/absolute_advantage.png",
            "alt": "Two factories, one producing more with same workers",
            "caption": "Figure 11.1.3: Absolute advantage means higher productivity."
          },
          
          "examples": [
            {
              "process": "US vs. Mexico corn production",
              "explanation": "Due to better technology and climate, the US can produce more corn per acre than Mexico. The US has absolute advantage in corn."
            }
          ]
        },
        {
          "type": "Comparative Advantage",
          "value": "Lower opportunity cost in producing a good",
          "characteristics": ["Determines trade pattern", "Based on opportunity cost", "Everyone has a comparative advantage", "Mutual gains possible", "Key to trade theory"],
          "behavior": "Comparative advantage is about relative efficiency. A country has a comparative advantage in producing a good if it can produce it at a lower opportunity cost than another country. Opportunity cost measures what must be given up to produce one unit. By specializing according to comparative advantage, countries can increase total world output. Then, through trade at terms between their opportunity costs, both can consume more than they could in autarky. This is true even if one country has absolute advantage in everything. Comparative advantage explains why trade occurs and why it benefits all participants.",
          
          "image": {
            "src": "images/unit11/comparative_advantage.png",
            "alt": "Two countries with different opportunity costs",
            "caption": "Figure 11.1.4: Comparative advantage is about lower opportunity cost."
          },
          
          "examples": [
            {
              "process": "US and China",
              "explanation": "The US has comparative advantage in high-tech goods (lower opportunity cost than China). China has comparative advantage in labor-intensive goods. Both gain from trade."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Trade Is Based on Comparative Advantage, Not Absolute Advantage",
          "statement": "One of the most important insights in economics is that the pattern of trade is determined by comparative advantage, not absolute advantage. Even if a country is less productive in every industry (has absolute disadvantage in everything), it can still benefit from trade by specializing in the industries where its disadvantage is smallest—where it has comparative advantage. Conversely, a country with absolute advantage in everything can benefit by specializing in industries where its advantage is largest. This principle shows that trade is not zero-sum but positive-sum: both countries can gain. It also explains why trade occurs between developed and developing countries—each has comparative advantages in different goods.",
          "application": "To determine who should produce what, calculate opportunity costs. The country with lower opportunity cost for a good has comparative advantage and should specialize in that good. Trade benefits both if the terms of trade lie between their opportunity costs.",
          "example": "A lawyer who types faster than their secretary has absolute advantage in both law and typing. But the lawyer's comparative advantage is law (high value of time), so they should specialize in law and hire the secretary to type.",
          
          "image": {
            "src": "images/unit11/comparative_principle.png",
            "alt": "Comparative vs. absolute advantage",
            "caption": "Figure 11.1.5: Comparative advantage, not absolute, determines trade."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Determining Comparative Advantage",
          
          "image": {
            "src": "images/unit11/trade_example1.png",
            "alt": "Production data for two countries",
            "caption": "Figure 11.1.6: Calculate opportunity costs and determine comparative advantage."
          },
          
          "problem": "Two countries, Alpha and Beta, can produce the following amounts of cars and computers per worker per day:<br>Alpha: 10 cars or 20 computers<br>Beta: 8 cars or 16 computers<br>a) Which country has absolute advantage in cars? In computers?<br>b) Calculate the opportunity cost of producing one car in each country.<br>c) Calculate the opportunity cost of producing one computer in each country.<br>d) Which country has comparative advantage in cars? In computers?<br>e) Should they trade? If so, what is the acceptable range for terms of trade?",
          
          "step_by_step": [
            {
              "step": "Absolute advantage",
              "explanation": "Alpha produces more cars (10 > 8) and more computers (20 > 16) than Beta. Alpha has absolute advantage in both goods."
            },
            {
              "step": "Opportunity cost of cars",
              "explanation": "Alpha: 1 car costs 20/10 = 2 computers. Beta: 1 car costs 16/8 = 2 computers. Identical opportunity cost!"
            },
            {
              "step": "Opportunity cost of computers",
              "explanation": "Alpha: 1 computer costs 10/20 = 0.5 cars. Beta: 1 computer costs 8/16 = 0.5 cars. Also identical."
            },
            {
              "step": "Comparative advantage",
              "explanation": "Opportunity costs are identical, so neither country has a comparative advantage. No gains from trade possible."
            },
            {
              "step": "Trade feasibility",
              "explanation": "With identical opportunity costs, any trade would leave at least one country no better off. No mutually beneficial trade exists."
            }
          ],
          
          "final_answer": "a) Alpha in both. b) Both: 2 computers. c) Both: 0.5 cars. d) Neither—identical opportunity costs. e) No gains from trade.",
          "concept_applied": "Comparative advantage exists only when opportunity costs differ. Identical costs mean no gains from trade."
        },
        {
          "title": "Comparative Advantage with Different Costs",
          
          "image": {
            "src": "images/unit11/trade_example2.png",
            "alt": "Production data for two countries",
            "caption": "Figure 11.1.7: Calculate comparative advantage with different costs."
          },
          
          "problem": "Two countries, Country A and Country B, can produce wheat and cloth. With one unit of resources:<br>Country A: 20 wheat or 10 cloth<br>Country B: 15 wheat or 5 cloth<br>a) Calculate opportunity costs.<br>b) Which country has comparative advantage in wheat? In cloth?<br>c) What is the acceptable range for terms of trade (wheat per cloth)?<br>d) If they trade at 1 cloth = 2.5 wheat, who gains?",
          
          "step_by_step": [
            {
              "step": "Opportunity cost of wheat",
              "explanation": "A: 1 wheat costs 10/20 = 0.5 cloth. B: 1 wheat costs 5/15 = 1/3 ≈ 0.333 cloth."
            },
            {
              "step": "Opportunity cost of cloth",
              "explanation": "A: 1 cloth costs 20/10 = 2 wheat. B: 1 cloth costs 15/5 = 3 wheat."
            },
            {
              "step": "Comparative advantage",
              "explanation": "B has lower opportunity cost in wheat (0.333 < 0.5). A has lower opportunity cost in cloth (2 < 3). So B specializes in wheat, A in cloth."
            },
            {
              "step": "Acceptable terms of trade",
              "explanation": "Trade is in cloth for wheat. A's opportunity cost of cloth is 2 wheat, so A will only trade cloth if it gets more than 2 wheat per cloth. B's opportunity cost of wheat is 1/3 cloth, so B will only trade wheat if it gets more than 1/3 cloth per wheat—equivalently, if it pays less than 3 wheat per cloth. So acceptable range: between 2 and 3 wheat per cloth."
            },
            {
              "step": "Evaluate 1 cloth = 2.5 wheat",
              "explanation": "2.5 is within (2,3), so both gain. A gets 2.5 wheat for cloth that costs it 2 wheat domestically—gain of 0.5 wheat per cloth. B pays 2.5 wheat for cloth that would cost it 3 wheat domestically—gain of 0.5 wheat per cloth."
            }
          ],
          
          "final_answer": "a) A: wheat 0.5 cloth, cloth 2 wheat; B: wheat 0.333 cloth, cloth 3 wheat. b) B in wheat, A in cloth. c) 2 to 3 wheat per cloth. d) Both gain equally (0.5 wheat per cloth).",
          "concept_applied": "Comparative advantage determines specialization. Terms of trade between opportunity costs ensure mutual gains."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Production Capabilities",
          "description": "Determine how much each country can produce of each good with given resources.",
          "mechanism": "From data: output per worker, per acre, or maximum production if all resources devoted to one good.",
          "result": "Production possibilities for each country.",
          
          "image": {
            "src": "images/unit11/trade_step1.png",
            "alt": "Two flags with production numbers",
            "caption": "Figure 11.1.8: Step 1 - Identify production capabilities."
          }
        },
        {
          "step": 2,
          "process": "Calculate Opportunity Costs",
          "description": "For each country, calculate opportunity cost of each good.",
          "mechanism": "Opportunity cost of Good X = (max of Good Y)/(max of Good X).",
          "result": "Opportunity cost table.",
          
          "image": {
            "src": "images/unit11/trade_step2.png",
            "alt": "Opportunity cost calculations",
            "caption": "Figure 11.1.9: Step 2 - Calculate opportunity costs."
          }
        },
        {
          "step": 3,
          "process": "Determine Comparative Advantage",
          "description": "Compare opportunity costs across countries.",
          "mechanism": "Lower opportunity cost = comparative advantage.",
          "result": "Specialization pattern.",
          
          "image": {
            "src": "images/unit11/trade_step3.png",
            "alt": "Arrows to country with lower cost",
            "caption": "Figure 11.1.10: Step 3 - Determine comparative advantage."
          }
        },
        {
          "step": 4,
          "process": "Establish Terms of Trade",
          "description": "Determine acceptable range for exchange rate between goods.",
          "mechanism": "Terms must lie between the two countries' opportunity costs.",
          "result": "Trading range.",
          
          "image": {
            "src": "images/unit11/trade_step4.png",
            "alt": "Number line with acceptable range",
            "caption": "Figure 11.1.11: Step 4 - Establish terms of trade."
          }
        },
        {
          "step": 5,
          "process": "Demonstrate Gains from Trade",
          "description": "Show that both countries can consume more after specialization and trade.",
          "mechanism": "Compare consumption before and after trade. Illustrate on PPC.",
          "result": "Proof of mutual gains.",
          
          "image": {
            "src": "images/unit11/trade_step5.png",
            "alt": "Consumption beyond PPC",
            "caption": "Figure 11.1.12: Step 5 - Demonstrate gains from trade."
          }
        }
      ],

      "image": {
        "src": "images/unit11/comparative_summary.png",
        "alt": "Comprehensive summary: absolute vs comparative advantage, opportunity cost calculation, gains from trade",
        "caption": "Figure 11.1.13: Comparative advantage summary."
      }
    }
  ],

  "key_terms": [
    "Comparative advantage",
    "Absolute advantage",
    "Opportunity cost",
    "Specialization",
    "Gains from trade",
    "Terms of trade",
    "Mutually beneficial trade",
    "Production possibilities frontier",
    "Consumption possibilities",
    "Autarky",
    "Free trade",
    "International trade",
    "Trade pattern",
    "Ricardian model",
    "Labor productivity"
  ],

  "summary": "Comparative advantage is the ability to produce a good at a lower opportunity cost than another country. It determines the pattern of international trade. Absolute advantage (higher productivity) is different and does not determine trade patterns—even countries with absolute disadvantage in everything gain from trade by specializing according to comparative advantage. To find comparative advantage, calculate opportunity costs: the amount of one good given up to produce another. The country with the lower opportunity cost for a good has comparative advantage in that good. Specialization according to comparative advantage increases total world output. Through trade at terms between their opportunity costs, both countries can consume beyond their own production possibilities frontiers—a clear gain from trade. This principle demonstrates that trade is positive-sum: both parties can be better off. Understanding comparative advantage is essential for analyzing international trade patterns, the effects of trade liberalization, and the gains from globalization."
}
