{
  "expanded_description": "What happens when governments intervene in international trade with tariffs or quotas? These policies are designed to protect domestic industries from foreign competition, but they come at a cost. Tariffs (taxes on imports) and quotas (quantity limits on imports) raise domestic prices, benefit domestic producers, and generate government revenue (for tariffs) or quota rents (for quotas). But they also harm consumers and create deadweight loss. Understanding the effects of trade restrictions is essential for analyzing real-world trade policy and the debates over protectionism.",
  
  "core_concept": {
    "principle": "Tariffs and quotas are trade restrictions that reduce imports, raise domestic prices, and create deadweight loss. (1) Tariff: A tax on imported goods. It raises the domestic price above the world price, reduces imports, benefits domestic producers, harms consumers, and generates government revenue. (2) Quota: A quantitative limit on imports. It also raises the domestic price above the world price, reduces imports, benefits domestic producers, and harms consumers. Instead of government revenue, quotas create quota rents for those who hold import licenses. (3) Both tariffs and quotas create deadweight loss from overproduction (domestic producers produce too much at higher cost) and underconsumption (consumers consume too little at higher prices). (4) The size of deadweight loss depends on the elasticity of supply and demand. (5) Tariffs and quotas are equivalent in their effects on prices and quantities if the quota is set to limit imports to the same level as the tariff would achieve. However, they differ in who gets the revenue/rents.",
    
    "explanation": "Think of a tariff as a tax on foreign goods. It makes imports more expensive, so domestic consumers buy fewer imports and more domestic goods. Domestic producers gain, but consumers pay higher prices, and the government collects revenue. A quota is like a limit on how many foreign goods can enter. It also raises prices, but instead of government revenue, the windfall goes to whoever gets the right to import the limited quantity. Both policies help domestic producers but hurt consumers and create inefficiency.",
    
    "image": {
      "src": "images/unit11/tariff_quota.png",
      "alt": "Graphs showing effects of tariff and quota on domestic market",
      "caption": "Figure 11.4.1: Tariffs and quotas raise domestic prices, reduce imports, and create deadweight loss."
    }
  },

  "sections": [
    {
      "section_title": "11.4 Tariffs and Quotas",
      "introduction": "What happens when governments intervene in international trade with tariffs or quotas? These policies are designed to protect domestic industries from foreign competition, but they come at a cost. Tariffs (taxes on imports) and quotas (quantity limits on imports) raise domestic prices, benefit domestic producers, and generate government revenue (for tariffs) or quota rents (for quotas). But they also harm consumers and create deadweight loss. Understanding the effects of trade restrictions is essential for analyzing real-world trade policy and the debates over protectionism.",
      
      "introduction_image": {
        "src": "images/unit11/tariff_intro.png",
        "alt": "Customs officer inspecting goods with tariff schedule",
        "caption": "Figure 11.4.2: Tariffs and quotas restrict international trade."
      },
      
      "key_concept": {
        "definition": "Tariffs and quotas are the two main types of trade restrictions. (1) Tariff: A tax imposed on imported goods. It raises the domestic price of the imported good above the world price. Effects: (a) Domestic price rises to $P_w + tariff$. (b) Domestic production increases (from $Q_s$ to $Q_s'$). (c) Domestic consumption decreases (from $Q_d$ to $Q_d'$). (d) Imports fall (from $Q_d - Q_s$ to $Q_d' - Q_s'$). (e) Government revenue = tariff × quantity of imports after tariff. (f) Consumer surplus decreases. (g) Producer surplus increases. (h) Deadweight loss occurs from overproduction (domestic producers produce units that cost more than world price) and underconsumption (consumers forgo units they value above world price). (2) Quota: A quantitative limit on imports. It also raises the domestic price above the world price. Effects are similar to a tariff, except that instead of government revenue, quota rents (the difference between the higher domestic price and the world price times the quantity of imports) go to whoever holds the import licenses. If the quota is set to limit imports to the same level as a tariff would, the price and quantity effects are identical. (3) Comparison: Tariffs generate government revenue; quotas generate rents for license holders. Tariffs are more transparent; quotas can lead to rent-seeking. In international agreements, tariffs are often preferred because they are less distorting and easier to negotiate.",
        
        "context": "Tariffs and quotas have been used throughout history to protect domestic industries. Understanding their effects is essential for analyzing trade policy debates, from the Smoot-Hawley Tariff of the 1930s to modern disputes about steel tariffs and agricultural quotas. In AP Microeconomics, you'll need to analyze the welfare effects of tariffs and quotas, compare them, and evaluate the arguments for and against trade restrictions.",
        
        "image": {
          "src": "images/unit11/tariff_graph.png",
          "alt": "Graph showing effects of tariff on domestic market",
          "caption": "Figure 11.4.3: A tariff raises domestic price, increases domestic production, reduces consumption, and creates deadweight loss."
        }
      },

      "classifications": [
        {
          "type": "Tariff",
          "value": "Tax on imports",
          "characteristics": ["Raises domestic price to $P_w + t$", "Increases domestic production", "Decreases domestic consumption", "Reduces imports", "Generates government revenue", "Creates deadweight loss"],
          "behavior": "A tariff is a tax on imported goods. It raises the domestic price above the world price, benefiting domestic producers who can now sell at a higher price. Domestic consumers lose because they pay more and consume less. The government gains revenue equal to the tariff times the quantity of imports after the tariff. The net effect on total surplus is negative—the losses to consumers exceed the gains to producers plus government revenue. The deadweight loss comes from two sources: (1) production distortion: domestic producers produce additional units at a cost above the world price, wasting resources; (2) consumption distortion: consumers forgo units they value above the world price. The size of deadweight loss depends on the elasticities of supply and demand.",
          
          "image": {
            "src": "images/unit11/tariff_detail.png",
            "alt": "Tariff graph with areas labeled",
            "caption": "Figure 11.4.4: A tariff creates government revenue and deadweight loss."
          },
          
          "examples": [
            {
              "process": "US steel tariffs",
              "explanation": "The US has periodically imposed tariffs on steel imports to protect domestic steel producers. Domestic steel prices rise, helping steel companies but hurting steel-using industries and consumers."
            }
          ]
        },
        {
          "type": "Quota",
          "value": "Quantity limit on imports",
          "characteristics": ["Limits imports to specified quantity", "Raises domestic price", "Increases domestic production", "Decreases domestic consumption", "Creates quota rents", "Creates deadweight loss"],
          "behavior": "A quota is a quantitative restriction on imports. It limits the quantity that can be imported, typically through a system of import licenses. The quota reduces supply in the domestic market, raising the domestic price above the world price. Domestic producers gain from higher prices. Domestic consumers lose from higher prices and reduced consumption. Instead of government revenue, the quota creates quota rents—the difference between the higher domestic price and the world price multiplied by the quantity of imports. These rents go to whoever holds the import licenses. The deadweight loss is similar to a tariff: production distortion (too much domestic production at high cost) and consumption distortion (too little consumption). Quotas can lead to rent-seeking behavior as firms compete for import licenses, which may create additional inefficiency.",
          
          "image": {
            "src": "images/unit11/quota_detail.png",
            "alt": "Quota graph with areas labeled",
            "caption": "Figure 11.4.5: A quota creates quota rents and deadweight loss."
          },
          
          "examples": [
            {
              "process": "Sugar quotas",
              "explanation": "The US limits sugar imports through quotas, raising domestic sugar prices well above world prices. Sugar producers gain, but food manufacturers and consumers pay much higher prices."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Tariffs and Quotas Create Deadweight Loss",
          "statement": "Both tariffs and quotas reduce total surplus below the free trade level. They create deadweight loss by distorting production and consumption decisions. The production distortion occurs because domestic firms produce additional units that cost more to produce than the world price—resources are wasted producing goods that could be obtained more cheaply from abroad. The consumption distortion occurs because consumers reduce consumption below the efficient level, forgoing units they value above the world price. The total deadweight loss is the sum of these two distortions. This is the fundamental economic argument against trade restrictions: they make the country as a whole worse off, even though they benefit particular groups.",
          "application": "To calculate deadweight loss from a tariff or quota, find the change in total surplus relative to free trade. The DWL is the sum of the production distortion triangle and the consumption distortion triangle.",
          "example": "If a tariff raises price from $P_w$ to $P_d$, the production distortion is the triangle between world price and domestic supply from the free trade domestic production to the tariff domestic production. The consumption distortion is the triangle between world price and domestic demand from the tariff consumption to the free trade consumption.",
          
          "image": {
            "src": "images/unit11/dwl_tariff.png",
            "alt": "Deadweight loss from tariff",
            "caption": "Figure 11.4.6: Tariffs create deadweight loss from production and consumption distortions."
          }
        },
        {
          "principle": "Tariffs Generate Government Revenue; Quotas Generate Rents",
          "statement": "While tariffs and quotas have similar effects on prices, quantities, and deadweight loss, they differ in who captures the value of the restricted imports. With a tariff, the government collects revenue equal to the tariff times the quantity imported. This revenue can be used for public purposes or to reduce other taxes. With a quota, the difference between the domestic price and the world price (the quota rent) goes to whoever holds the import licenses. If licenses are given away, the rents accrue to license holders, who may be domestic importers or foreign exporters. If licenses are auctioned, the government can capture the rents. This difference matters for policy choice. Tariffs are generally more transparent and less prone to rent-seeking than quotas.",
          "application": "When comparing tariffs and quotas, consider who gets the revenue/rents. This affects the distributional impact and may influence political support for different policies.",
          "example": "Under a sugar quota, foreign producers who receive quota allocations capture much of the quota rent because they can sell at the high US price. This is why some foreign governments support US sugar quotas.",
          
          "image": {
            "src": "images/unit11/tariff_vs_quota.png",
            "alt": "Comparison of tariff and quota",
            "caption": "Figure 11.4.7: Tariffs generate government revenue; quotas generate rents."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing a Tariff",
          
          "image": {
            "src": "images/unit11/tariff_example1.png",
            "alt": "Domestic market with world price and tariff",
            "caption": "Figure 11.4.8: Calculate effects of a tariff."
          },
          
          "problem": "A country has domestic demand $P = 100 - Q$ and domestic supply $P = 20 + Q$. The world price is $\\$40$. The government imposes a tariff of $\\$10$ per unit on imports.<br>a) Find the free trade equilibrium (no tariff) quantities and imports.<br>b) After the tariff, what is the domestic price? Find domestic quantity demanded, domestic quantity supplied, and imports.<br>c) Calculate the change in consumer surplus, producer surplus, government revenue, and total surplus (deadweight loss).<br>d) Identify the production distortion and consumption distortion components of deadweight loss.",
          
          "step_by_step": [
            {
              "step": "Free trade",
              "explanation": "From previous example: $P_w = 40$, $Q_d = 60$, $Q_s = 20$, imports = 40."
            },
            {
              "step": "After tariff",
              "explanation": "Domestic price = $P_w + tariff = 40 + 10 = 50$. $Q_d = 100 - 50 = 50$. $Q_s = 50 - 20 = 30$. Imports = $50 - 30 = 20$."
            },
            {
              "step": "Surplus changes",
              "explanation": "Need to calculate CS, PS, government revenue, and total surplus.<br>Free trade CS = $\\frac{1}{2} × (100-40) × 60 = 1800$. PS = $\\frac{1}{2} × (40-20) × 20 = 200$. Total = 2000.<br>After tariff: CS = $\\frac{1}{2} × (100-50) × 50 = \\frac{1}{2} × 50 × 50 = 1250$. PS = $\\frac{1}{2} × (50-20) × 30 = \\frac{1}{2} × 30 × 30 = 450$. Government revenue = tariff × imports = $10 × 20 = 200$. Total surplus with tariff = $1250 + 450 + 200 = 1900$.<br>Change: CS -550, PS +250, revenue +200, total surplus -100 (deadweight loss)."
            },
            {
              "step": "Decompose DWL",
              "explanation": "Production distortion: triangle between world price and supply from $Q_s^{free}=20$ to $Q_s^{tariff}=30$. Height = $(50-40)=10$, base = 10, area = $\\frac{1}{2} × 10 × 10 = 50$. Consumption distortion: triangle between world price and demand from $Q_d^{tariff}=50$ to $Q_d^{free}=60$. Height = $(50-40)=10$, base = 10, area = $\\frac{1}{2} × 10 × 10 = 50$. Total DWL = $100$."
            }
          ],
          
          "final_answer": "a) Free trade: $Q_d=60$, $Q_s=20$, imports=40. b) After tariff: $P=50$, $Q_d=50$, $Q_s=30$, imports=20. c) CS -550, PS +250, revenue +200, total -100. d) Production DWL=50, consumption DWL=50.",
          "concept_applied": "Tariff reduces total surplus by creating deadweight loss from production and consumption distortions."
        },
        {
          "title": "Comparing Tariff and Quota",
          
          "image": {
            "src": "images/unit11/tariff_example2.png",
            "alt": "Tariff vs quota comparison",
            "caption": "Figure 11.4.9: Compare tariff and quota with same import level."
          },
          
          "problem": "Using the same market as above, suppose the government instead imposes a quota that limits imports to 20 units.<br>a) What will be the domestic price? (Hint: Find the price where $Q_d - Q_s = 20$)<br>b) Calculate consumer surplus, producer surplus, and quota rents under the quota.<br>c) Compare total surplus under the quota to total surplus under the tariff. What accounts for the difference?<br>d) If the government auctions the import licenses, how does the outcome change?",
          
          "step_by_step": [
            {
              "step": "Find domestic price with quota",
              "explanation": "We need $Q_d - Q_s = 20$. $Q_d = 100 - P$, $Q_s = P - 20$. So $(100 - P) - (P - 20) = 20$ → $120 - 2P = 20$ → $2P = 100$ → $P = 50$. Same price as tariff."
            },
            {
              "step": "Quantities at P=50",
              "explanation": "$Q_d = 50$, $Q_s = 30$, imports = 20 (by construction)."
            },
            {
              "step": "Surplus under quota",
              "explanation": "CS = same as tariff: $\\frac{1}{2} × (100-50) × 50 = 1250$. PS = same as tariff: $\\frac{1}{2} × (50-20) × 30 = 450$. Quota rents = (domestic price - world price) × imports = $(50-40) × 20 = 10 × 20 = 200$. These rents go to license holders. Total surplus = $1250 + 450 + 200 = 1900$, same as tariff total."
            },
            {
              "step": "Comparison",
              "explanation": "Total surplus is identical if quota rents are counted as surplus (they are, just going to different recipients). Under tariff, government gets $200$ revenue. Under quota with free licenses, license holders get $200$ rents. If licenses are auctioned, government captures the rents, making quota identical to tariff in all respects."
            }
          ],
          
          "final_answer": "a) $P=50$. b) CS=1250, PS=450, quota rents=200, total=1900. c) Same total surplus as tariff. d) Auction makes quota equivalent to tariff.",
          "concept_applied": "Tariffs and quotas are equivalent in price/quantity effects if quota rents are captured by government. Difference is who gets the revenue/rents."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Find Free Trade Outcome",
          "description": "Determine domestic quantities and imports at world price.",
          "mechanism": "$Q_d$ and $Q_s$ at $P_w$. Imports = $Q_d - Q_s$.",
          "result": "Free trade baseline.",
          
          "image": {
            "src": "images/unit11/tariff_step1.png",
            "alt": "Free trade equilibrium",
            "caption": "Figure 11.4.10: Step 1 - Find free trade outcome."
          }
        },
        {
          "step": 2,
          "process": "Determine Post-Tariff/Quota Price",
          "description": "For tariff: $P = P_w + t$. For quota: find price where $Q_d - Q_s =$ quota limit.",
          "mechanism": "Solve for new domestic price.",
          "result": "New domestic price.",
          
          "image": {
            "src": "images/unit11/tariff_step2.png",
            "alt": "New price determination",
            "caption": "Figure 11.4.11: Step 2 - Determine new domestic price."
          }
        },
        {
          "step": 3,
          "process": "Find New Quantities and Trade",
          "description": "Calculate $Q_d$, $Q_s$, and imports/exports at new price.",
          "mechanism": "Plug new price into demand and supply.",
          "result": "Post-policy quantities.",
          
          "image": {
            "src": "images/unit11/tariff_step3.png",
            "alt": "New quantities",
            "caption": "Figure 11.4.12: Step 3 - Find new quantities and trade."
          }
        },
        {
          "step": 4,
          "process": "Calculate Surplus Changes",
          "description": "Compute changes in CS, PS, government revenue (tariff), or quota rents.",
          "mechanism": "Compare CS and PS to free trade. Add revenue/rents.",
          "result": "Welfare effects.",
          
          "image": {
            "src": "images/unit11/tariff_step4.png",
            "alt": "Surplus changes",
            "caption": "Figure 11.4.13: Step 4 - Calculate surplus changes."
          }
        },
        {
          "step": 5,
          "process": "Calculate Deadweight Loss",
          "description": "Find total surplus change relative to free trade.",
          "mechanism": "DWL = loss in total surplus = production distortion + consumption distortion.",
          "result": "Deadweight loss.",
          
          "image": {
            "src": "images/unit11/tariff_step5.png",
            "alt": "Deadweight loss",
            "caption": "Figure 11.4.14: Step 5 - Calculate deadweight loss."
          }
        }
      ],

      "image": {
        "src": "images/unit11/tariff_summary.png",
        "alt": "Comprehensive summary: tariff and quota effects, welfare analysis, deadweight loss, comparison",
        "caption": "Figure 11.4.15: Tariffs and quotas summary."
      }
    }
  ],

  "key_terms": [
    "Tariff",
    "Quota",
    "Import quota",
    "Trade restriction",
    "Protectionism",
    "Domestic price",
    "World price",
    "Import tariff",
    "Specific tariff",
    "Ad valorem tariff",
    "Quota rent",
    "Import license",
    "Rent-seeking",
    "Deadweight loss",
    "Production distortion",
    "Consumption distortion",
    "Government revenue",
    "Trade policy",
    "Import-competing industry",
    "Trade barrier"
  ],

  "summary": "Tariffs and quotas are trade restrictions that reduce imports, raise domestic prices, and create deadweight loss. A tariff is a tax on imports that raises the domestic price to $P_w + t$, increases domestic production, decreases domestic consumption, reduces imports, generates government revenue, and creates deadweight loss from production and consumption distortions. A quota is a quantitative limit on imports that also raises the domestic price, with similar effects on production and consumption. Instead of government revenue, quotas create quota rents—the difference between the higher domestic price and the world price times the quantity of imports—which go to holders of import licenses. Tariffs and quotas are equivalent in their effects on prices and quantities if the quota is set to achieve the same import level as the tariff. They differ in who captures the value of the restricted imports: government under a tariff, license holders under a quota (unless licenses are auctioned). Both policies reduce total surplus below the free trade level, making the country as a whole worse off, even though they benefit domestic producers. Understanding tariffs and quotas is essential for analyzing trade policy, evaluating the costs of protectionism, and understanding international trade disputes."
}
