{
  "expanded_description": "Does trade make a country better off overall? The answer is yes—total surplus increases when a country opens to trade. But trade also creates winners and losers within the country. Understanding the welfare effects of trade—who gains, who loses, and by how much—is essential for analyzing trade policy and the political debates surrounding free trade. In this section, we'll measure the gains from trade using consumer and producer surplus, quantify the effects on different groups, and see why the overall gains exceed the losses.",
  
  "core_concept": {
    "principle": "International trade increases total surplus in both importing and exporting countries, but redistributes surplus between consumers and producers. (1) For an importing country: Consumer surplus increases, producer surplus decreases, total surplus increases. The gain to consumers exceeds the loss to producers. (2) For an exporting country: Producer surplus increases, consumer surplus decreases, total surplus increases. The gain to producers exceeds the loss to consumers. (3) The net gain from trade is the area between the domestic supply and demand curves from the autarky quantity to the trade quantity, representing the efficiency gain from reallocating resources according to comparative advantage. (4) Distributional effects: Trade creates both winners and losers, which explains why trade is often politically controversial even though it increases overall welfare. (5) Compensation: In theory, the winners could compensate the losers and still be better off, but such compensation rarely occurs in practice.",
    
    "explanation": "Think of trade like a policy that gives $\\$100$ to consumers but takes $\\$60$ from producers. Overall, the country is $\\$40$ better off, but producers are upset. That's the welfare effect of trade—a net gain with redistribution. The challenge for policymakers is whether and how to compensate the losers.",
    
    "image": {
      "src": "images/unit11/welfare_trade.png",
      "alt": "Graphs showing surplus changes for importing and exporting countries",
      "caption": "Figure 11.3.1: Trade increases total surplus but redistributes it between consumers and producers."
    }
  },

  "sections": [
    {
      "section_title": "11.3 Welfare Effects of Trade",
      "introduction": "Does trade make a country better off overall? The answer is yes—total surplus increases when a country opens to trade. But trade also creates winners and losers within the country. Understanding the welfare effects of trade—who gains, who loses, and by how much—is essential for analyzing trade policy and the political debates surrounding free trade. In this section, we'll measure the gains from trade using consumer and producer surplus, quantify the effects on different groups, and see why the overall gains exceed the losses.",
      
      "introduction_image": {
        "src": "images/unit11/welfare_intro.png",
        "alt": "Scale showing gains to some, losses to others, with net gain",
        "caption": "Figure 11.3.2: Trade creates winners and losers, but total surplus increases."
      },
      
      "key_concept": {
        "definition": "The welfare effects of trade refer to the changes in consumer surplus, producer surplus, and total surplus when a country moves from autarky (no trade) to free trade. (1) Importing country case ($P_w < P_a$): (a) Consumer surplus increases by area (A + B) as consumers buy more at lower prices. (b) Producer surplus decreases by area A as domestic producers face lower prices and reduce output. (c) Total surplus increases by area B—the gain from trade. (d) Imports = $Q_d - Q_s$. (2) Exporting country case ($P_w > P_a$): (a) Producer surplus increases by area (C + D) as producers sell more at higher prices. (b) Consumer surplus decreases by area C as consumers pay higher prices. (c) Total surplus increases by area D—the gain from trade. (d) Exports = $Q_s - Q_d$. (3) The net gain from trade (areas B or D) represents the efficiency gain from specializing according to comparative advantage. (4) Distributional effects: Trade benefits the group that competes with the world market (consumers of imports, producers of exports) and harms the group that competes with domestic producers (producers of import-competing goods, consumers of exports). (5) Compensation principle: Because total surplus increases, the winners could theoretically compensate the losers and still be better off. However, such compensation rarely occurs in practice, which explains political opposition to trade.",
        
        "context": "The welfare analysis of trade using consumer and producer surplus is a powerful tool for understanding the distributional effects of trade liberalization. It shows why trade is generally supported by economists (it increases total surplus) but often opposed by groups that lose from it. In AP Microeconomics, you'll need to calculate these welfare changes and explain why trade creates both winners and losers.",
        
        "image": {
          "src": "images/unit11/welfare_graphs.png",
          "alt": "Importing and exporting graphs with surplus areas labeled",
          "caption": "Figure 11.3.3: Welfare effects of trade for importing and exporting countries."
        }
      },

      "classifications": [
        {
          "type": "Welfare Effects: Importing Country",
          "value": "$P_w < P_a$",
          "characteristics": ["Consumer surplus ↑", "Producer surplus ↓", "Total surplus ↑", "Net gain = area between supply and demand from $Q_s$ to $Q_d$", "Consumers win, producers lose"],
          "behavior": "When a country imports a good, consumers benefit from lower prices. Consumer surplus increases because consumers can buy more at a lower price. Domestic producers lose because they must compete with lower-priced imports, reducing their sales and forcing them to accept lower prices. The loss to producers is smaller than the gain to consumers, so total surplus increases. The net gain (often called the gains from trade) is the area between the domestic supply and demand curves from the domestic quantity supplied to the domestic quantity demanded at the world price. This area represents the value of additional consumption and the reallocation of resources to more efficient uses.",
          
          "image": {
            "src": "images/unit11/import_welfare.png",
            "alt": "Importing country with surplus areas",
            "caption": "Figure 11.3.4: In an importing country, consumers gain, producers lose, total surplus increases."
          },
          
          "examples": [
            {
              "process": "US textile imports",
              "explanation": "Consumers gain from lower clothing prices; domestic textile workers and firms lose. The net effect is positive, but the losses are concentrated and visible."
            }
          ]
        },
        {
          "type": "Welfare Effects: Exporting Country",
          "value": "$P_w > P_a$",
          "characteristics": ["Producer surplus ↑", "Consumer surplus ↓", "Total surplus ↑", "Net gain = area between supply and demand from $Q_d$ to $Q_s$", "Producers win, consumers lose"],
          "behavior": "When a country exports a good, producers benefit from higher prices. Producer surplus increases because they can sell more at a higher price. Domestic consumers lose because they must pay higher prices for the good. The loss to consumers is smaller than the gain to producers, so total surplus increases. The net gain is the area between the domestic supply and demand curves from the domestic quantity demanded to the domestic quantity supplied at the world price. This area represents the gains from selling additional output at higher world prices and the reallocation of resources to more efficient export industries.",
          
          "image": {
            "src": "images/unit11/export_welfare.png",
            "alt": "Exporting country with surplus areas",
            "caption": "Figure 11.3.5: In an exporting country, producers gain, consumers lose, total surplus increases."
          },
          
          "examples": [
            {
              "process": "US wheat exports",
              "explanation": "Farmers gain from higher prices; domestic food consumers lose. The net effect is positive, but consumers face higher food prices."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Trade Increases Total Surplus in Both Importing and Exporting Countries",
          "statement": "The fundamental result of trade welfare analysis is that total surplus increases when a country opens to trade, regardless of whether it imports or exports. In the importing case, consumer gains exceed producer losses. In the exporting case, producer gains exceed consumer losses. In both cases, the country as a whole is better off. This is why economists generally support free trade. However, this result does not mean everyone is better off—there are always losers. The gains are large enough that the winners could, in principle, compensate the losers and still be better off. In practice, compensation rarely occurs, which explains why trade is politically controversial.",
          "application": "To measure the gains from trade, calculate the change in total surplus between autarky and free trade. The net gain is the area between supply and demand from the autarky quantity to the trade quantity, or the difference between the gains to winners and losses to losers.",
          "example": "In the importing example, total surplus increased by 50. Consumers gained 325, producers lost 275—net gain 50.",
          
          "image": {
            "src": "images/unit11/total_surplus_increase.png",
            "alt": "Total surplus increase from trade",
            "caption": "Figure 11.3.6: Trade increases total surplus in both importing and exporting countries."
          }
        },
        {
          "principle": "Trade Creates Winners and Losers—the Distributional Effect Is Important",
          "statement": "While trade increases total surplus, it also redistributes surplus between groups. In the importing case, consumers gain and producers lose. In the exporting case, producers gain and consumers lose. These distributional effects are often large and concentrated, while the gains are diffuse. This explains why trade policy is often contentious—losers are often well-organized and vocal, while winners are dispersed and may not even realize they benefit. Understanding these distributional effects is essential for analyzing trade politics and for designing policies (like trade adjustment assistance) to help those harmed by trade.",
          "application": "When analyzing trade, always identify the winners and losers. This helps predict political reactions and evaluate proposals for compensation or adjustment assistance.",
          "example": "Workers in import-competing industries (like textiles) often oppose trade liberalization because they face job losses, even though consumers benefit from lower prices.",
          
          "image": {
            "src": "images/unit11/winners_losers_trade.png",
            "alt": "Winners and losers from trade",
            "caption": "Figure 11.3.7: Trade creates both winners and losers."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Welfare Effects of Imports",
          
          "image": {
            "src": "images/unit11/welfare_example1.png",
            "alt": "Importing country graph with areas",
            "caption": "Figure 11.3.8: Calculate welfare changes from imports."
          },
          
          "problem": "A country has domestic demand $P = 100 - Q$ and domestic supply $P = 20 + Q$. The world price is $\\$40$.<br>a) Find the autarky equilibrium.<br>b) At the world price, find domestic quantity demanded, domestic quantity supplied, and imports.<br>c) Calculate consumer surplus, producer surplus, and total surplus under autarky and under free trade.<br>d) What are the gains from trade? Who gains and who loses?",
          
          "step_by_step": [
            {
              "step": "Autarky equilibrium",
              "explanation": "$100 - Q = 20 + Q$ → $80 = 2Q$ → $Q_a = 40$, $P_a = 60$."
            },
            {
              "step": "At world price $40$",
              "explanation": "$Q_d = 100 - 40 = 60$. $Q_s = 40 - 20$? Wait: $P = 20 + Q$ → $Q = P - 20$. At $P=40$, $Q_s = 20$. Imports = $60 - 20 = 40$."
            },
            {
              "step": "Autarky surplus",
              "explanation": "CS = $\\frac{1}{2} × (100-60) × 40 = \\frac{1}{2} × 40 × 40 = 800$. PS = $\\frac{1}{2} × (60-20) × 40 = \\frac{1}{2} × 40 × 40 = 800$. Total = 1600."
            },
            {
              "step": "Free trade surplus",
              "explanation": "CS = $\\frac{1}{2} × (100-40) × 60 = \\frac{1}{2} × 60 × 60 = 1800$. PS = $\\frac{1}{2} × (40-20) × 20 = \\frac{1}{2} × 20 × 20 = 200$. Total = 2000."
            },
            {
              "step": "Gains and distribution",
              "explanation": "Gains from trade = $2000 - 1600 = 400$. Consumers gain $1000$ ($1800 - 800$), producers lose $600$ ($800 - 200$). Net gain $400$."
            }
          ],
          
          "final_answer": "a) $P=60$, $Q=40$. b) $Q_d=60$, $Q_s=20$, imports=40. c) Autarky: CS=800, PS=800, total=1600; Trade: CS=1800, PS=200, total=2000. d) Gains=400; consumers gain, producers lose.",
          "concept_applied": "Imports benefit consumers, harm producers, increase total surplus."
        },
        {
          "title": "Calculating Welfare Effects of Exports",
          
          "image": {
            "src": "images/unit11/welfare_example2.png",
            "alt": "Exporting country graph with areas",
            "caption": "Figure 11.3.9: Calculate welfare changes from exports."
          },
          
          "problem": "Using the same demand and supply, now suppose the world price is $\\$80$.<br>a) At the world price, find domestic quantity demanded, domestic quantity supplied, and exports.<br>b) Calculate consumer surplus, producer surplus, and total surplus under free trade.<br>c) What are the gains from trade? Who gains and who loses?",
          
          "step_by_step": [
            {
              "step": "At world price $80$",
              "explanation": "$Q_d = 100 - 80 = 20$. $Q_s = 80 - 20 = 60$. Exports = $60 - 20 = 40$."
            },
            {
              "step": "Free trade surplus",
              "explanation": "CS = $\\frac{1}{2} × (100-80) × 20 = \\frac{1}{2} × 20 × 20 = 200$. PS = $\\frac{1}{2} × (80-20) × 60 = \\frac{1}{2} × 60 × 60 = 1800$. Total = 2000."
            },
            {
              "step": "Compare to autarky",
              "explanation": "Autarky (from before): CS=800, PS=800, total=1600. Trade: CS=200, PS=1800, total=2000. Gains = 400. Consumers lose $600$ ($800-200$), producers gain $1000$ ($1800-800$)."
            }
          ],
          
          "final_answer": "a) $Q_d=20$, $Q_s=60$, exports=40. b) CS=200, PS=1800, total=2000. c) Gains=400; producers gain, consumers lose.",
          "concept_applied": "Exports benefit producers, harm consumers, increase total surplus."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Find Autarky Equilibrium",
          "description": "Determine domestic price and quantity without trade.",
          "mechanism": "$Q_d = Q_s$ to find $P_a$, $Q_a$.",
          "result": "Autarky outcome.",
          
          "image": {
            "src": "images/unit11/welfare_step1.png",
            "alt": "Autarky equilibrium",
            "caption": "Figure 11.3.10: Step 1 - Find autarky equilibrium."
          }
        },
        {
          "step": 2,
          "process": "Find Trade Outcome",
          "description": "Determine domestic quantities at world price.",
          "mechanism": "$Q_d$ and $Q_s$ at $P_w$. Determine imports/exports.",
          "result": "Trade outcome.",
          
          "image": {
            "src": "images/unit11/welfare_step2.png",
            "alt": "Trade outcome",
            "caption": "Figure 11.3.11: Step 2 - Find trade outcome."
          }
        },
        {
          "step": 3,
          "process": "Calculate Autarky Surplus",
          "description": "Compute consumer and producer surplus without trade.",
          "mechanism": "CS = area under demand above $P_a$. PS = area above supply below $P_a$.",
          "result": "Autarky surplus.",
          
          "image": {
            "src": "images/unit11/welfare_step3.png",
            "alt": "Autarky surplus",
            "caption": "Figure 11.3.12: Step 3 - Calculate autarky surplus."
          }
        },
        {
          "step": 4,
          "process": "Calculate Trade Surplus",
          "description": "Compute consumer and producer surplus with trade.",
          "mechanism": "CS and PS at $P_w$, using domestic quantities.",
          "result": "Trade surplus.",
          
          "image": {
            "src": "images/unit11/welfare_step4.png",
            "alt": "Trade surplus",
            "caption": "Figure 11.3.13: Step 4 - Calculate trade surplus."
          }
        },
        {
          "step": 5,
          "process": "Determine Gains and Distribution",
          "description": "Find changes in surplus and identify winners/losers.",
          "mechanism": "Compare CS and PS before and after. Net change = gains from trade.",
          "result": "Welfare effects.",
          
          "image": {
            "src": "images/unit11/welfare_step5.png",
            "alt": "Gains and distribution",
            "caption": "Figure 11.3.14: Step 5 - Determine gains and distribution."
          }
        }
      ],

      "image": {
        "src": "images/unit11/welfare_summary.png",
        "alt": "Comprehensive summary: welfare effects for importing and exporting countries, gains from trade, winners and losers",
        "caption": "Figure 11.3.15: Welfare effects of trade summary."
      }
    }
  ],

  "key_terms": [
    "Welfare effects",
    "Gains from trade",
    "Consumer surplus",
    "Producer surplus",
    "Total surplus",
    "Importing country",
    "Exporting country",
    "Winners and losers",
    "Distributional effects",
    "Autarky",
    "Free trade",
    "Compensation principle",
    "Trade liberalization",
    "Net gain",
    "Redistribution",
    "Efficiency gain",
    "Resource allocation",
    "Comparative advantage"
  ],

  "summary": "International trade increases total surplus in both importing and exporting countries, but redistributes surplus between consumers and producers. For an importing country (world price below autarky price): consumer surplus increases, producer surplus decreases, and total surplus increases by the area between domestic supply and demand from the domestic quantity supplied to the domestic quantity demanded. Consumers gain; producers lose. For an exporting country (world price above autarky price): producer surplus increases, consumer surplus decreases, and total surplus increases by the area between domestic supply and demand from the domestic quantity demanded to the domestic quantity supplied. Producers gain; consumers lose. In both cases, the gains exceed the losses, so total surplus rises. This is why economists generally support free trade. However, the distributional effects explain why trade is politically controversial—losers are often concentrated and vocal, while winners are diffuse. In theory, the winners could compensate the losers and still be better off, but such compensation rarely occurs in practice. Understanding the welfare effects of trade is essential for analyzing trade policy, predicting political reactions, and evaluating proposals for trade adjustment assistance."
}
