{
  "expanded_description": "What happens to a country's domestic market when it opens up to international trade? The effects depend on whether the world price is above or below the domestic price. If the world price is lower than the domestic price, the country becomes an importer; consumers gain from lower prices, but domestic producers lose. If the world price is higher, the country becomes an exporter; producers gain, but consumers lose. Understanding how world prices affect domestic markets is essential for analyzing the real-world impacts of trade liberalization and trade agreements.",
  
  "core_concept": {
    "principle": "When a country opens to trade, the domestic price adjusts to the world price. (1) World price: The price at which a good trades on international markets. It is determined by global supply and demand. (2) If world price < domestic price: The country becomes an importer. Domestic consumers can buy at the lower world price, increasing quantity demanded. Domestic producers cannot compete, so quantity supplied falls. Imports = quantity demanded - quantity supplied. (3) If world price > domestic price: The country becomes an exporter. Domestic producers can sell at the higher world price, increasing quantity supplied. Domestic consumers face higher prices, so quantity demanded falls. Exports = quantity supplied - quantity demanded. (4) Small country assumption: A small country cannot influence the world price—it is a price taker in world markets. (5) The analysis assumes no trade barriers; tariffs and quotas are considered later.",
    
    "explanation": "Think of the US market for sugar. The world price of sugar is often lower than the US domestic price due to US trade restrictions. If the US opened to free trade, sugar prices would fall to the world price. Consumers would benefit from cheaper sugar, but US sugar farmers would lose. If instead the world price were higher (as for some US exports), producers would gain and consumers would lose. Trade always creates winners and losers.",
    
    "image": {
      "src": "images/unit11/world_price_graph.png",
      "alt": "Two graphs: importing country (world price below domestic) and exporting country (world price above domestic)",
      "caption": "Figure 11.2.1: World price determines whether a country imports or exports."
    }
  },

  "sections": [
    {
      "section_title": "11.2 World Price and Domestic Markets",
      "introduction": "What happens to a country's domestic market when it opens up to international trade? The effects depend on whether the world price is above or below the domestic price. If the world price is lower than the domestic price, the country becomes an importer; consumers gain from lower prices, but domestic producers lose. If the world price is higher, the country becomes an exporter; producers gain, but consumers lose. Understanding how world prices affect domestic markets is essential for analyzing the real-world impacts of trade liberalization and trade agreements.",
      
      "introduction_image": {
        "src": "images/unit11/world_price_intro.png",
        "alt": "Global market with arrows showing world price affecting domestic market",
        "caption": "Figure 11.2.2: The world price determines whether a country imports or exports."
      },
      
      "key_concept": {
        "definition": "When a country opens to international trade, the domestic price converges to the world price (assuming no trade barriers). (1) World price ($P_w$): The price determined by global supply and demand. For a small country, $P_w$ is exogenous—the country cannot influence it. (2) Autarky price ($P_a$): The domestic price in the absence of trade, determined by domestic supply and demand. (3) Importing case: If $P_w < P_a$, the country becomes an importer. At $P_w$, domestic quantity demanded ($Q_d$) exceeds domestic quantity supplied ($Q_s$). Imports = $Q_d - Q_s$. (4) Exporting case: If $P_w > P_a$, the country becomes an exporter. At $P_w$, domestic quantity supplied exceeds domestic quantity demanded. Exports = $Q_s - Q_d$. (5) Effects on prices: Trade lowers domestic price to $P_w$ in the importing case and raises it to $P_w$ in the exporting case. (6) Effects on quantities: In the importing case, consumption rises (consumers buy more at lower price) and domestic production falls (producers reduce output). In the exporting case, consumption falls and domestic production rises. (7) Winners and losers: In the importing case, consumers gain, producers lose. In the exporting case, producers gain, consumers lose. (8) Small country assumption: The country's trade does not affect the world price. This simplifies analysis and is realistic for most countries in most markets.",
        
        "context": "The analysis of world price and domestic markets is the foundation for understanding the welfare effects of trade. It shows that trade creates both winners and losers, which explains why trade policy is often controversial. In AP Microeconomics, you'll need to analyze importing and exporting situations graphically, identify the effects on consumer and producer surplus, and understand how trade affects different groups.",
        
        "image": {
          "src": "images/unit11/world_price_detailed.png",
          "alt": "Detailed graphs for importing and exporting cases",
          "caption": "Figure 11.2.3: World price determines imports or exports."
        }
      },

      "classifications": [
        {
          "type": "Importing Country",
          "value": "$P_w < P_a$",
          "characteristics": ["Domestic price falls to $P_w$", "Consumers gain", "Producers lose", "Imports = $Q_d - Q_s$", "Net gain in total surplus"],
          "behavior": "When the world price is below the autarky price, opening to trade makes the country an importer. Domestic consumers now have access to cheaper goods, increasing consumer surplus. Domestic producers face lower prices and reduce output, decreasing producer surplus. The gain to consumers exceeds the loss to producers, so total surplus increases. The country gains overall from trade. The quantity imported is the gap between domestic quantity demanded and domestic quantity supplied at the world price. This case represents the typical situation for a country importing goods it produces at higher cost than the rest of the world.",
          
          "image": {
            "src": "images/unit11/importing.png",
            "alt": "Graph showing importing country with world price below domestic equilibrium",
            "caption": "Figure 11.2.4: Importing country: world price below domestic price."
          },
          
          "examples": [
            {
              "process": "US importing textiles",
              "explanation": "Textiles can be produced more cheaply in developing countries. The US imports textiles, benefiting consumers with lower prices, but domestic textile producers lose."
            }
          ]
        },
        {
          "type": "Exporting Country",
          "value": "$P_w > P_a$",
          "characteristics": ["Domestic price rises to $P_w$", "Producers gain", "Consumers lose", "Exports = $Q_s - Q_d$", "Net gain in total surplus"],
          "behavior": "When the world price is above the autarky price, opening to trade makes the country an exporter. Domestic producers can now sell at higher world prices, increasing producer surplus. Domestic consumers face higher prices and reduce consumption, decreasing consumer surplus. The gain to producers exceeds the loss to consumers, so total surplus increases. The country gains overall from trade. The quantity exported is the gap between domestic quantity supplied and domestic quantity demanded at the world price. This case represents countries exporting goods they produce at lower cost than the rest of the world.",
          
          "image": {
            "src": "images/unit11/exporting.png",
            "alt": "Graph showing exporting country with world price above domestic price",
            "caption": "Figure 11.2.5: Exporting country: world price above domestic price."
          },
          
          "examples": [
            {
              "process": "US exporting wheat",
              "explanation": "The US has comparative advantage in wheat production. Opening to trade raises domestic wheat prices, benefiting farmers but hurting domestic consumers."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Trade Creates Winners and Losers, but Total Surplus Increases",
          "statement": "When a country opens to trade, there are always both winners and losers. In the importing case, consumers gain and producers lose. In the exporting case, producers gain and consumers lose. In both cases, the gains exceed the losses, so total surplus increases. This is the fundamental result: trade increases overall economic welfare, even though it harms some groups. This explains why trade is generally supported by economists but often opposed by those who lose from it. Understanding this distributional effect is crucial for analyzing trade policy and the political economy of protectionism.",
          "application": "To analyze the effects of trade, compare consumer and producer surplus with and without trade. The net change in total surplus measures the gains from trade. Identify which groups gain and which lose.",
          "example": "If a country opens to imports, consumers gain area A, producers lose area B, and total surplus increases by area C (the difference). The gains from trade are positive even though producers are hurt.",
          
          "image": {
            "src": "images/unit11/winners_losers.png",
            "alt": "Surplus changes in importing and exporting cases",
            "caption": "Figure 11.2.6: Trade creates winners and losers, but total surplus increases."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing an Importing Country",
          
          "image": {
            "src": "images/unit11/world_price_example1.png",
            "alt": "Domestic supply and demand with world price",
            "caption": "Figure 11.2.7: Analyze the effects of opening to imports."
          },
          
          "problem": "A country's domestic demand for steel is $Q_d = 100 - 2P$ and domestic supply is $Q_s = 20 + 2P$. The world price of steel is $\\$15$.<br>a) Find the autarky equilibrium price and quantity.<br>b) If the country opens to free trade, will it import or export steel?<br>c) Find domestic quantity demanded, domestic quantity supplied, and imports at the world price.<br>d) Calculate the change in consumer surplus, producer surplus, and total surplus from opening to trade.",
          
          "step_by_step": [
            {
              "step": "Autarky equilibrium",
              "explanation": "$100 - 2P = 20 + 2P$ → $80 = 4P$ → $P_a = 20$, $Q_a = 100 - 40 = 60$."
            },
            {
              "step": "Compare world price",
              "explanation": "$P_w = 15 < P_a = 20$, so country will import steel."
            },
            {
              "step": "Quantities at world price",
              "explanation": "$Q_d = 100 - 2(15) = 100 - 30 = 70$. $Q_s = 20 + 2(15) = 20 + 30 = 50$. Imports = $70 - 50 = 20$."
            },
            {
              "step": "Surplus changes",
              "explanation": "Need to calculate CS and PS before and after. Before trade: CS = $\\frac{1}{2} × (50-20) × 60 = \\frac{1}{2} × 30 × 60 = 900$. PS = $\\frac{1}{2} × (20-10) × 60$? Need supply intercept: $Q_s = 20 + 2P$ → at Q=0, P=-10? Actually supply curve: $P = 0.5Q - 10$. At Q=0, P=-10 (not relevant). Better: PS = area above supply up to price. At P=20, Q=60, supply price at Q=60 is 20. PS = $\\frac{1}{2} × (20 - (-10)) × 60$? That gives $\\frac{1}{2} × 30 × 60 = 900$ also. So total surplus = 1800.<br>After trade: CS = $\\frac{1}{2} × (50 - 15) × 70 = \\frac{1}{2} × 35 × 70 = 1225$. PS = area above supply up to Q=50 at P=15. Supply price at Q=50 is $P = 0.5(50) - 10 = 25 - 10 = 15$? Actually that's exactly 15. So PS = $\\frac{1}{2} × (15 - (-10)) × 50 = \\frac{1}{2} × 25 × 50 = 625$. Total surplus = $1225 + 625 = 1850$. Change = +50."
            }
          ],
          
          "final_answer": "a) $P=20$, $Q=60$. b) Import. c) $Q_d=70$, $Q_s=50$, imports=20. d) CS +325, PS -275, total surplus +50.",
          "concept_applied": "Opening to imports benefits consumers, hurts producers, increases total surplus."
        },
        {
          "title": "Analyzing an Exporting Country",
          
          "image": {
            "src": "images/unit11/world_price_example2.png",
            "alt": "Domestic supply and demand with higher world price",
            "caption": "Figure 11.2.8: Analyze the effects of opening to exports."
          },
          
          "problem": "The same country now considers opening to trade in a different market where the world price is $\\$25$. Use the same demand and supply functions.<br>a) Will the country import or export?<br>b) Find domestic quantity demanded, domestic quantity supplied, and exports at the world price.<br>c) Calculate the change in consumer surplus, producer surplus, and total surplus from opening to trade.",
          
          "step_by_step": [
            {
              "step": "Compare world price",
              "explanation": "$P_w = 25 > P_a = 20$, so country will export."
            },
            {
              "step": "Quantities at world price",
              "explanation": "$Q_d = 100 - 2(25) = 100 - 50 = 50$. $Q_s = 20 + 2(25) = 20 + 50 = 70$. Exports = $70 - 50 = 20$."
            },
            {
              "step": "Surplus changes",
              "explanation": "Before trade (same as before): CS=900, PS=900, total=1800.<br>After trade: CS = $\\frac{1}{2} × (50 - 25) × 50 = \\frac{1}{2} × 25 × 50 = 625$. PS = area above supply up to Q=70 at P=25. Supply price at Q=70 is $P = 0.5(70) - 10 = 35 - 10 = 25$. PS = $\\frac{1}{2} × (25 - (-10)) × 70 = \\frac{1}{2} × 35 × 70 = 1225$. Total surplus = $625 + 1225 = 1850$. Change = +50."
            }
          ],
          
          "final_answer": "a) Export. b) $Q_d=50$, $Q_s=70$, exports=20. c) CS -275, PS +325, total surplus +50.",
          "concept_applied": "Opening to exports benefits producers, hurts consumers, increases total surplus."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Find Autarky Equilibrium",
          "description": "Determine domestic price and quantity without trade.",
          "mechanism": "Set $Q_d = Q_s$ to find $P_a$ and $Q_a$.",
          "result": "$P_a$, $Q_a$.",
          
          "image": {
            "src": "images/unit11/world_step1.png",
            "alt": "Domestic equilibrium",
            "caption": "Figure 11.2.9: Step 1 - Find autarky equilibrium."
          }
        },
        {
          "step": 2,
          "process": "Compare World Price to Autarky Price",
          "description": "Determine if country imports or exports.",
          "mechanism": "If $P_w < P_a$ → import. If $P_w > P_a$ → export.",
          "result": "Trade direction.",
          
          "image": {
            "src": "images/unit11/world_step2.png",
            "alt": "Comparing prices",
            "caption": "Figure 11.2.10: Step 2 - Compare world price to autarky price."
          }
        },
        {
          "step": 3,
          "process": "Find Domestic Quantities at World Price",
          "description": "Calculate $Q_d$ and $Q_s$ at $P_w$.",
          "mechanism": "Plug $P_w$ into demand and supply functions.",
          "result": "$Q_d$, $Q_s$.",
          
          "image": {
            "src": "images/unit11/world_step3.png",
            "alt": "Finding Qd and Qs at Pw",
            "caption": "Figure 11.2.11: Step 3 - Find domestic quantities at world price."
          }
        },
        {
          "step": 4,
          "process": "Calculate Imports or Exports",
          "description": "Find trade volume.",
          "mechanism": "Imports = $Q_d - Q_s$. Exports = $Q_s - Q_d$.",
          "result": "Trade volume.",
          
          "image": {
            "src": "images/unit11/world_step4.png",
            "alt": "Import or export volume",
            "caption": "Figure 11.2.12: Step 4 - Calculate imports or exports."
          }
        },
        {
          "step": 5,
          "process": "Calculate Surplus Changes",
          "description": "Find changes in consumer and producer surplus.",
          "mechanism": "Compute CS and PS before and after trade. Compare.",
          "result": "Welfare effects.",
          
          "image": {
            "src": "images/unit11/world_step5.png",
            "alt": "Surplus changes",
            "caption": "Figure 11.2.13: Step 5 - Calculate surplus changes."
          }
        }
      ],

      "image": {
        "src": "images/unit11/world_price_summary.png",
        "alt": "Comprehensive summary: importing vs exporting cases, surplus changes, trade volumes",
        "caption": "Figure 11.2.14: World price and domestic markets summary."
      }
    }
  ],

  "key_terms": [
    "World price",
    "Autarky price",
    "Domestic price",
    "Importer",
    "Exporter",
    "Imports",
    "Exports",
    "Small country assumption",
    "Price taker",
    "Consumer surplus",
    "Producer surplus",
    "Total surplus",
    "Gains from trade",
    "Winners and losers",
    "Trade liberalization",
    "Open economy",
    "Closed economy",
    "Domestic demand",
    "Domestic supply"
  ],

  "summary": "When a country opens to international trade, the domestic price adjusts to the world price. If the world price is below the autarky price, the country becomes an importer: domestic consumers gain from lower prices, domestic producers lose, and total surplus increases. Imports equal the gap between domestic quantity demanded and domestic quantity supplied at the world price. If the world price is above the autarky price, the country becomes an exporter: domestic producers gain from higher prices, domestic consumers lose, and total surplus increases. Exports equal the gap between domestic quantity supplied and domestic quantity demanded. In both cases, trade creates winners and losers, but the gains exceed the losses, so total surplus rises. This analysis assumes the country is a small price taker in world markets. Understanding how world prices affect domestic markets is essential for analyzing the real-world impacts of trade, the distributional effects of trade liberalization, and the political economy of protectionism."
}
