{
  "flashcards": [
    {
      "category": "AP Microeconomics: Introduction to Microeconomics",
      "cards": [
        {
          "front": "What is microeconomics?",
          "back": "The study of how individuals, households, and firms make decisions and how they interact in specific markets."
        },
        {
          "front": "What is the fundamental economic problem?",
          "back": "Scarcity: unlimited wants but limited resources."
        },
        {
          "front": "What is opportunity cost?",
          "back": "The value of the next best alternative that is given up when making a choice."
        },
        {
          "front": "What is marginal analysis?",
          "back": "Examining the additional benefits and costs of a decision. Rational choice: continue activity until marginal benefit equals marginal cost."
        },
        {
          "front": "What is the production possibilities frontier (PPF)?",
          "back": "A graph showing the maximum combination of two goods an economy can produce with given resources and technology."
        },
        {
          "front": "What do points on, inside, and outside the PPF represent?",
          "back": "On: efficient production. Inside: inefficient/unemployed resources. Outside: unattainable with current resources."
        },
        {
          "front": "Why is the PPF typically bowed outward?",
          "back": "Due to increasing opportunity cost: resources are not equally adaptable to producing different goods."
        },
        {
          "front": "What causes the PPF to shift outward?",
          "back": "Economic growth from: more resources, better technology, improved institutions."
        },
        {
          "front": "What are the three basic economic questions every society must answer?",
          "back": "What to produce? How to produce? For whom to produce?"
        },
        {
          "front": "What are the four factors of production?",
          "back": "Land, labor, capital, and entrepreneurship."
        },
        {
          "front": "What is a market economy?",
          "back": "An economic system where decisions are made by individuals and firms interacting in markets."
        },
        {
          "front": "What is a command economy?",
          "back": "An economic system where the government makes all major economic decisions."
        },
        {
          "front": "What is a mixed economy?",
          "back": "An economy that combines elements of market and command systems."
        },
        {
          "front": "What is the law of comparative advantage?",
          "back": "Individuals/nations should specialize in producing goods where they have the lowest opportunity cost."
        },
        {
          "front": "What is the difference between absolute and comparative advantage?",
          "back": "Absolute advantage: can produce more with same resources. Comparative advantage: lower opportunity cost."
        },
        {
          "front": "What are gains from trade?",
          "back": "The increase in total output and consumption from specialization according to comparative advantage."
        },
        {
          "front": "What determines the terms of trade?",
          "back": "The exchange rate between goods must fall between the opportunity costs of the two traders."
        },
        {
          "front": "What is the circular flow model?",
          "back": "A diagram showing the flow of goods, services, resources, and money between households and firms."
        },
        {
          "front": "What is specialization?",
          "back": "Focusing effort on a specific task or product to increase efficiency."
        },
        {
          "front": "What is division of labor?",
          "back": "Breaking production into specific tasks performed by different workers."
        },
        {
          "front": "What are property rights?",
          "back": "Legal rights to own, use, and dispose of resources, goods, and services."
        },
        {
          "front": "Why are property rights important for economic efficiency?",
          "back": "They encourage investment, maintenance, and efficient allocation of resources."
        },
        {
          "front": "What is the invisible hand concept?",
          "back": "Adam Smith's idea that individuals pursuing self-interest in markets promote social welfare."
        },
        {
          "front": "What are positive vs. normative statements?",
          "back": "Positive: factual claims about what is. Normative: value judgments about what ought to be."
        },
        {
          "front": "What is ceteris paribus?",
          "back": "Latin for 'all else equal' - examining the effect of one variable while holding others constant."
        },
        {
          "front": "What is economic efficiency?",
          "back": "Getting the maximum output from available resources (productive efficiency) and producing what society wants (allocative efficiency)."
        },
        {
          "front": "What is productive efficiency?",
          "back": "Producing at the lowest possible cost (any point on PPF)."
        },
        {
          "front": "What is allocative efficiency?",
          "back": "Producing the mix of goods and services most desired by society (where MB = MC)."
        },
        {
          "front": "What is voluntary exchange?",
          "back": "Trade where both parties expect to gain, increasing total satisfaction."
        },
        {
          "front": "What is the law of increasing opportunity cost?",
          "back": "As production of one good increases, the opportunity cost of additional units typically increases."
        },
        {
          "front": "What are capital goods vs. consumer goods?",
          "back": "Capital goods: used to produce other goods. Consumer goods: for immediate satisfaction. More capital goods today → greater growth tomorrow."
        },
        {
          "front": "What is human capital?",
          "back": "The skills, knowledge, and experience of workers."
        },
        {
          "front": "How does investment in human capital affect the PPF?",
          "back": "Increases productivity, shifting PPF outward over time."
        },
        {
          "front": "What are economic models?",
          "back": "Simplified representations of reality used to analyze economic behavior and predict outcomes."
        },
        {
          "front": "What is the difference between microeconomics and macroeconomics?",
          "back": "Micro: individual markets and decision-makers. Macro: economy as a whole (GDP, unemployment, inflation)."
        },
        {
          "front": "What are incentives?",
          "back": "Rewards or penalties that influence behavior. Prices are key incentives in market economies."
        },
        {
          "front": "What is consumer sovereignty?",
          "back": "Consumers' preferences determine what is produced through their spending decisions."
        },
        {
          "front": "What is the role of prices in a market economy?",
          "back": "Prices signal scarcity, provide incentives, and distribute goods to those willing to pay."
        },
        {
          "front": "What is the difference between explicit and implicit costs?",
          "back": "Explicit: actual monetary payments. Implicit: opportunity costs of using owned resources."
        },
        {
          "front": "What are sunk costs?",
          "back": "Costs that have already been incurred and cannot be recovered. Should not affect future decisions."
        },
        {
          "front": "What is rational decision-making in economics?",
          "back": "Choosing the option where marginal benefit ≥ marginal cost."
        }
      ]
    }
  ]
}
