{
  "flashcards": [
    {
      "category": "AP Microeconomics: Monopoly & Monopolistic Competition",
      "cards": [
        {
          "front": "What are the characteristics of a monopoly?",
          "back": "1) Single seller\n2) Unique product (no close substitutes)\n3) High barriers to entry\n4) Price maker\n5) Little non-price competition"
        },
        {
          "front": "What are the sources of monopoly power?",
          "back": "1) Control of key resources\n2) Government franchise/patent\n3) Natural monopoly (economies of scale)\n4) Network effects"
        },
        {
          "front": "What is a natural monopoly?",
          "back": "When one firm can supply the entire market at lower cost than multiple firms due to economies of scale. Examples: utilities, railways."
        },
        {
          "front": "Why is the monopoly demand curve the market demand curve?",
          "back": "The monopoly firm is the entire industry, so its demand curve is the downward-sloping market demand curve."
        },
        {
          "front": "What is the relationship between price and marginal revenue for a monopoly?",
          "back": "MR < P. To sell more, monopoly must lower price on all units, so MR is less than price."
        },
        {
          "front": "Why does marginal revenue fall faster than price for a monopoly?",
          "back": "Price cut applies to all units sold, not just the additional unit. The revenue loss on previous units reduces MR."
        },
        {
          "front": "What is the profit-maximizing rule for a monopoly?",
          "back": "Produce where MR = MC, then charge the highest price consumers will pay (found on demand curve)."
        },
        {
          "front": "How does a monopoly determine its profit-maximizing price and quantity?",
          "back": "1) Find where MR = MC (quantity)\n2) Go up to demand curve to find price for that quantity"
        },
        {
          "front": "Why is a monopoly allocatively inefficient?",
          "back": "It produces where P > MC, meaning consumers value additional units more than they cost to produce, but monopoly restricts output."
        },
        {
          "front": "Why is a monopoly productively inefficient?",
          "back": "Does not produce at minimum ATC. Can have excess capacity or produce beyond minimum cost point."
        },
        {
          "front": "What is deadweight loss in monopoly?",
          "back": "The loss of total surplus due to reduced output compared to perfect competition. Triangle between demand and MC curves."
        },
        {
          "front": "Can a monopoly earn economic profits in the long run?",
          "back": "Yes, due to barriers to entry preventing new firms from entering and competing away profits."
        },
        {
          "front": "What is price discrimination?",
          "back": "Charging different prices to different consumers for the same product based on willingness to pay."
        },
        {
          "front": "What conditions are needed for price discrimination?",
          "back": "1) Market power\n2) Ability to segment markets\n3) Prevent resale between segments"
        },
        {
          "front": "What is perfect (first-degree) price discrimination?",
          "back": "Charging each consumer their maximum willingness to pay. Captures all consumer surplus as profit."
        },
        {
          "front": "What is second-degree price discrimination?",
          "back": "Charging different prices based on quantity purchased. Examples: bulk discounts, block pricing."
        },
        {
          "front": "What is third-degree price discrimination?",
          "back": "Charging different prices to different demographic groups. Examples: student discounts, senior discounts."
        },
        {
          "front": "How does price discrimination affect efficiency?",
          "back": "Can increase output toward socially optimal level, reducing deadweight loss, but transfers surplus from consumers to producer."
        },
        {
          "front": "What are the characteristics of monopolistic competition?",
          "back": "1) Many firms\n2) Differentiated products\n3) Low barriers to entry\n4) Some price control\n5) Significant non-price competition"
        },
        {
          "front": "How does monopolistic competition differ from perfect competition?",
          "back": "Product differentiation gives some market power, downward-sloping demand curve, and non-price competition."
        },
        {
          "front": "How does monopolistic competition differ from monopoly?",
          "back": "Many firms vs one, free entry vs barriers, less market power, zero economic profit in long run vs possible profits."
        },
        {
          "front": "What is the demand curve like for a monopolistically competitive firm?",
          "back": "Downward sloping but relatively elastic due to many substitutes. More elastic than monopoly, less elastic than perfect competition."
        },
        {
          "front": "How does a monopolistically competitive firm maximize profits?",
          "back": "Same as monopoly: produce where MR = MC, charge price from demand curve."
        },
        {
          "front": "What happens in monopolistic competition in the long run?",
          "back": "Entry/exit leads to zero economic profit, but P > minimum ATC (excess capacity)."
        },
        {
          "front": "What is excess capacity in monopolistic competition?",
          "back": "Firms don't produce at minimum ATC. Operating at less than efficient scale due to product differentiation."
        },
        {
          "front": "Why is monopolistic competition allocatively inefficient?",
          "back": "P > MC in both short and long run, though less than monopoly."
        },
        {
          "front": "Why is monopolistic competition productively inefficient?",
          "back": "Not producing at minimum ATC in long run due to excess capacity."
        },
        {
          "front": "What is non-price competition?",
          "back": "Competition through advertising, product differentiation, quality, service, location rather than price."
        },
        {
          "front": "Why do monopolistically competitive firms engage in non-price competition?",
          "back": "To differentiate products, increase demand, make demand less elastic, and potentially earn short-run profits."
        },
        {
          "front": "What are the welfare implications of advertising in monopolistic competition?",
          "back": "Can be informative (helping consumers) or persuasive (creating artificial differentiation). Increases costs but may provide information."
        },
        {
          "front": "What is the role of brand names in monopolistic competition?",
          "back": "Create product differentiation, signal quality, build customer loyalty, and potentially increase market power."
        },
        {
          "front": "How does entry affect monopolistic competition?",
          "back": "Entry reduces demand for existing firms (demand curve shifts left), making it more elastic until zero economic profit."
        },
        {
          "front": "What is the efficiency trade-off in monopolistic competition?",
          "back": "Product variety vs efficiency. Consumers get choice/diversity but pay higher prices and firms operate with excess capacity."
        },
        {
          "front": "What are examples of monopolistically competitive markets?",
          "back": "Restaurants, clothing stores, hair salons, coffee shops—many firms with differentiated products."
        },
        {
          "front": "What are examples of monopoly markets?",
          "back": "Local utilities, patented drugs, Microsoft Windows (historically), DeBeers diamonds (historically)."
        },
        {
          "front": "What is a patent?",
          "back": "Government-granted exclusive right to produce/sell an invention for limited time, creating temporary monopoly."
        },
        {
          "front": "What is X-inefficiency?",
          "back": "When monopolies don't minimize costs due to lack of competitive pressure. Can operate above cost curves."
        },
        {
          "front": "What is rent-seeking behavior?",
          "back": "Using resources to obtain or maintain monopoly power (lobbying, legal challenges) rather than producing goods/services."
        },
        {
          "front": "How can governments regulate monopolies?",
          "back": "1) Price regulation (P = MC or P = ATC)\n2) Antitrust laws\n3) Public ownership\n4) Doing nothing if natural monopoly"
        },
        {
          "front": "What is the socially optimal price for a regulated monopoly?",
          "back": "P = MC (allocatively efficient) but may require subsidy if MC < ATC (natural monopoly)."
        },
        {
          "front": "What is the fair-return price for a regulated monopoly?",
          "back": "P = ATC (zero economic profit, covers all costs including normal profit)."
        },
        {
          "front": "What is the dilemma in regulating natural monopolies?",
          "back": "P = MC leads to losses (if MC < ATC), requiring subsidy. P = ATC is inefficient but sustainable."
        },
        {
          "front": "What is contestable market theory?",
          "back": "Even monopolies may behave competitively if markets are contestable (low entry/exit barriers, no sunk costs)."
        },
        {
          "front": "How does technological change affect monopoly power?",
          "back": "Can destroy existing monopolies (creative destruction) or create new ones through innovation and network effects."
        }
      ]
    }
  ]
}
