{
  "flashcards": [
    {
      "category": "AP Microeconomics: Production & Costs",
      "cards": [
        {
          "front": "What is the short run in production?",
          "back": "A period where at least one input is fixed (usually capital). Firms can adjust variable inputs like labor."
        },
        {
          "front": "What is the long run in production?",
          "back": "A period where all inputs are variable. Firms can adjust all factors of production."
        },
        {
          "front": "What are fixed costs?",
          "back": "Costs that do not vary with output level in the short run. Must be paid even if output is zero. Examples: rent, salaries, loan payments."
        },
        {
          "front": "What are variable costs?",
          "back": "Costs that vary with output level. Examples: raw materials, hourly labor, utilities for production."
        },
        {
          "front": "What are explicit costs?",
          "back": "Direct monetary payments for inputs. Also called accounting costs."
        },
        {
          "front": "What are implicit costs?",
          "back": "Opportunity costs of using owned resources. Examples: owner's time, capital invested, forgone interest."
        },
        {
          "front": "What is total cost?",
          "back": "Sum of fixed and variable costs. TC = FC + VC."
        },
        {
          "front": "What is marginal cost?",
          "back": "The additional cost of producing one more unit of output. MC = ΔTC/ΔQ."
        },
        {
          "front": "What is average total cost?",
          "back": "Total cost per unit of output. ATC = TC/Q = AFC + AVC."
        },
        {
          "front": "What is average fixed cost?",
          "back": "Fixed cost per unit of output. AFC = FC/Q. Declines continuously as output increases."
        },
        {
          "front": "What is average variable cost?",
          "back": "Variable cost per unit of output. AVC = VC/Q."
        },
        {
          "front": "What is the relationship between MC and ATC?",
          "back": "When MC < ATC, ATC is falling. When MC > ATC, ATC is rising. MC intersects ATC at its minimum point."
        },
        {
          "front": "What is the relationship between MC and AVC?",
          "back": "When MC < AVC, AVC is falling. When MC > AVC, AVC is rising. MC intersects AVC at its minimum point."
        },
        {
          "front": "What is total product?",
          "back": "The total output produced with given inputs."
        },
        {
          "front": "What is marginal product?",
          "back": "The additional output from adding one more unit of variable input. MP = ΔTP/ΔL."
        },
        {
          "front": "What is average product?",
          "back": "Output per unit of variable input. AP = TP/L."
        },
        {
          "front": "What is the law of diminishing marginal returns?",
          "back": "As more of a variable input is added to fixed inputs, the marginal product eventually declines."
        },
        {
          "front": "Why does marginal cost eventually rise?",
          "back": "Due to diminishing marginal returns. As MP falls, more variable inputs are needed for each additional unit, increasing MC."
        },
        {
          "front": "What is the relationship between marginal product and marginal cost?",
          "back": "Inverse relationship. When MP is rising, MC is falling. When MP is falling, MC is rising."
        },
        {
          "front": "What are economies of scale?",
          "back": "Long-run average total cost decreases as output increases. Due to specialization, bulk purchasing, etc."
        },
        {
          "front": "What are diseconomies of scale?",
          "back": "Long-run average total cost increases as output increases. Due to coordination problems, bureaucracy, etc."
        },
        {
          "front": "What are constant returns to scale?",
          "back": "Long-run average total cost remains constant as output increases."
        },
        {
          "front": "What is the minimum efficient scale?",
          "back": "The lowest output level at which long-run average total cost is minimized."
        },
        {
          "front": "What is the shape of typical short-run cost curves?",
          "back": "U-shaped ATC and AVC due to initially falling then rising MC. AFC declines continuously."
        },
        {
          "front": "What is the shape of typical long-run average total cost curve?",
          "back": "U-shaped due to economies then diseconomies of scale, or L-shaped with constant returns after initial economies."
        },
        {
          "front": "What is the shut-down rule for firms?",
          "back": "In short run: shut down if P < AVC. Continue operating if P > AVC even if making losses (covering variable costs)."
        },
        {
          "front": "What is the break-even point for firms?",
          "back": "Where P = ATC. Firm makes zero economic profit (covers all costs including normal profit)."
        },
        {
          "front": "What are sunk costs?",
          "back": "Costs that have been incurred and cannot be recovered. Should not affect future production decisions."
        },
        {
          "front": "What is normal profit?",
          "back": "The minimum return needed to keep resources in their current use. Considered a cost (implicit cost) in economics."
        },
        {
          "front": "What is economic profit?",
          "back": "Total revenue minus all costs (explicit and implicit). Different from accounting profit which excludes implicit costs."
        },
        {
          "front": "What is accounting profit?",
          "back": "Total revenue minus explicit costs only. Does not consider opportunity costs."
        },
        {
          "front": "What is the difference between economic and accounting profit?",
          "back": "Economic profit = Accounting profit - Implicit costs. Zero economic profit means firm is earning normal profit."
        },
        {
          "front": "What are increasing returns to scale?",
          "back": "When output increases more than proportionally to inputs. Leads to economies of scale."
        },
        {
          "front": "What are decreasing returns to scale?",
          "back": "When output increases less than proportionally to inputs. Leads to diseconomies of scale."
        },
        {
          "front": "What is total fixed cost curve?",
          "back": "A horizontal line at the fixed cost level, unchanged by output."
        },
        {
          "front": "What is total variable cost curve?",
          "back": "Starts at origin, initially increases at decreasing rate, then increases at increasing rate."
        },
        {
          "front": "What is total cost curve?",
          "back": "Parallel to TVC curve but shifted up by the amount of fixed costs."
        },
        {
          "front": "What is the relationship between short-run and long-run cost curves?",
          "back": "LRATC is the envelope of all possible SRATC curves. Each SRATC represents one plant size."
        },
        {
          "front": "What is the profit-maximizing output rule?",
          "back": "Produce where MR = MC (for price-takers, MR = P, so produce where P = MC)."
        },
        {
          "front": "Why is the marginal cost curve the firm's supply curve in perfect competition?",
          "back": "For price-taking firms, the portion of MC above AVC shows how much they'll supply at each price."
        },
        {
          "front": "What are quasi-fixed costs?",
          "back": "Costs that are fixed over some output range but variable over longer periods or larger output changes."
        },
        {
          "front": "What is learning by doing?",
          "back": "Cost reductions from accumulated production experience, shifting cost curves down over time."
        },
        {
          "front": "What are transaction costs?",
          "back": "Costs of arranging contracts and conducting exchanges. Can affect firm size and organization."
        }
      ]
    }
  ]
}
