{
  "flashcards": [
    {
      "category": "AP Microeconomics: Comprehensive Review",
      "cards": [
        {
          "front": "What is scarcity in economics?",
          "back": "Unlimited wants but limited resources, which forces choices, opportunity costs, and trade-offs."
        },
        {
          "front": "What does a Production Possibilities Frontier (PPF) show?",
          "back": "Maximum possible output combinations of two goods; bowed outward shape indicates increasing opportunity costs."
        },
        {
          "front": "What is the Law of Demand?",
          "back": "As price falls, quantity demanded rises (ceteris paribus). It describes an inverse relationship."
        },
        {
          "front": "What is the Law of Supply?",
          "back": "As price rises, quantity supplied rises (ceteris paribus). It describes a direct relationship."
        },
        {
          "front": "What is market equilibrium?",
          "back": "The point where quantity demanded equals quantity supplied, with no shortage or surplus."
        },
        {
          "front": "How is price elasticity of demand calculated and interpreted?",
          "back": "%∆Qd / %∆P. Elastic (>1) means demand is responsive to price; inelastic (<1) means it is not."
        },
        {
          "front": "What does cross-price elasticity measure?",
          "back": "%∆Qd of good A / %∆P of good B. Positive means substitutes; negative means complements."
        },
        {
          "front": "What does income elasticity measure?",
          "back": "%∆Qd / %∆Income. Positive means normal good; negative means inferior good."
        },
        {
          "front": "What is the utility maximization rule?",
          "back": "MUx/Px = MUy/Py. Spend until marginal utility per dollar is equal across all goods."
        },
        {
          "front": "What is diminishing marginal utility?",
          "back": "As consumption of a good increases, the additional satisfaction from each extra unit decreases."
        },
        {
          "front": "What is the difference between income and substitution effects?",
          "back": "Price drop: substitution effect (buy more because relatively cheaper) + income effect (real income rises)."
        },
        {
          "front": "What is an indifference curve?",
          "back": "Shows all combinations of two goods that provide the same level of satisfaction to a consumer."
        },
        {
          "front": "What is the law of diminishing marginal returns?",
          "back": "Adding more of a variable input to fixed inputs eventually yields smaller increases in total output."
        },
        {
          "front": "What is marginal cost?",
          "back": "The additional cost of producing one more unit of output: ΔTC / ΔQ."
        },
        {
          "front": "What is average total cost?",
          "back": "Total cost per unit of output: TC/Q. It is U-shaped in the short run."
        },
        {
          "front": "What are economies of scale?",
          "back": "When long-run average total cost falls as output expands, due to factors like specialization and bulk discounts."
        },
        {
          "front": "What is the difference between explicit and implicit costs?",
          "back": "Explicit costs are actual cash payments; implicit costs are opportunity costs of using owner-owned resources."
        },
        {
          "front": "What is the difference between accounting and economic profit?",
          "back": "Accounting profit = TR - explicit costs. Economic profit = TR - (explicit + implicit costs)."
        },
        {
          "front": "What are the characteristics of a perfectly competitive market?",
          "back": "Many firms, identical products, price takers, free entry/exit, and perfect information."
        },
        {
          "front": "What is the profit maximization rule for a firm?",
          "back": "Produce where Marginal Revenue (MR) equals Marginal Cost (MC)."
        },
        {
          "front": "What is the shutdown rule for a firm?",
          "back": "Shut down in the short run if price falls below Average Variable Cost (P < AVC)."
        },
        {
          "front": "What is long-run equilibrium in perfect competition?",
          "back": "P = MC = ATC. Firms earn zero economic profit and the market is allocatively and productively efficient."
        },
        {
          "front": "What are the characteristics of a monopoly?",
          "back": "Single seller, unique product, high barriers to entry, price maker, and no close substitutes."
        },
        {
          "front": "How does a monopoly maximize profit?",
          "back": "Produces where MR = MC, then charges a price higher than MR based on the demand curve."
        },
        {
          "front": "What is the deadweight loss in a monopoly?",
          "back": "The loss of total surplus because a monopoly produces less than the socially optimal quantity."
        },
        {
          "front": "What is price discrimination?",
          "back": "Charging different prices to different consumers based on their willingness to pay, increasing the firm's profit."
        },
        {
          "front": "What are the characteristics of monopolistic competition?",
          "back": "Many firms, differentiated products, free entry/exit, and some market power."
        },
        {
          "front": "What happens in the long run in monopolistic competition?",
          "back": "Firms earn zero economic profit (P = ATC), but operate with excess capacity (not at minimum ATC)."
        },
        {
          "front": "What are the characteristics of an oligopoly?",
          "back": "Few firms, interdependent decisions, high barriers to entry, and potential for collusion."
        },
        {
          "front": "What is the prisoner's dilemma in game theory?",
          "back": "A situation where individual incentives lead to a non-cooperative outcome, even though cooperation would benefit all parties."
        },
        {
          "front": "What is derived demand in factor markets?",
          "back": "Demand for a factor of production (like labor) is derived from the demand for the final product it helps produce."
        },
        {
          "front": "What is Marginal Revenue Product (MRP)?",
          "back": "The additional revenue from hiring one more unit of a factor: MRP = Marginal Product × Marginal Revenue."
        },
        {
          "front": "What is the profit-maximizing hiring rule for a firm?",
          "back": "Hire until Marginal Revenue Product (MRP) equals the Marginal Factor Cost (MFC)."
        },
        {
          "front": "What is a monopsony?",
          "back": "A market with a single buyer of labor. It pays a wage below MRP and hires fewer workers than a competitive market."
        },
        {
          "front": "What is an externality?",
          "back": "A cost or benefit imposed on third parties not directly involved in an economic transaction."
        },
        {
          "front": "What is a public good?",
          "back": "A good that is non-rival (one person's use doesn't reduce availability) and non-excludable (can't prevent non-payers from using)."
        },
        {
          "front": "What are common pool resources?",
          "back": "Resources that are rival (one person's use reduces availability) but non-excludable, leading to overuse (tragedy of the commons)."
        },
        {
          "front": "What is a Pigouvian tax?",
          "back": "A tax equal to the marginal external cost, used to correct a negative externality by internalizing the social cost."
        },
        {
          "front": "What is the effect of a price ceiling?",
          "back": "A maximum legal price set below equilibrium creates a shortage."
        },
        {
          "front": "What does a Lorenz curve show?",
          "back": "A graph that shows the distribution of income or wealth in an economy."
        }
      ]
    }
  ]
}
