{
  "expanded_description": "This section introduces thermodynamics—the study of heat, work, and energy transfer. Students will learn the Zeroth, First, and Second Laws of Thermodynamics, understand concepts like internal energy and entropy, and discover why some processes happen spontaneously while others do not.",
  "core_concept": {
    "principle": "Thermodynamics is governed by fundamental laws: energy is conserved (First Law), heat flows spontaneously from hot to cold (Second Law), and systems in thermal equilibrium share the same temperature (Zeroth Law).",
    "explanation": "These laws explain everything from why your coffee cools down (never spontaneously heats up) to why perpetual motion machines are impossible. They describe the rules that energy must follow in all physical processes.",
    "image": {
      "src": "images/unit7/thermodynamics_laws.png",
      "alt": "Iconic representation of three laws: Zeroth (thermometers), First (energy conservation), Second (heat flowing one direction)",
      "caption": "The laws of thermodynamics govern all energy transfers"
    }
  },
  "sections": [
    {
      "section_title": "What is Thermodynamics?",
      "introduction": "Thermodynamics is the branch of physics that deals with heat, work, temperature, and their relationship to energy, radiation, and the physical properties of matter. It describes how thermal energy converts to and from other forms of energy.",
      "key_concept": {
        "definition": "Thermodynamics (from Greek 'therme' meaning heat and 'dynamis' meaning power) is the study of energy transformations involving heat, work, and internal energy.",
        "context": "Thermodynamics emerged during the Industrial Revolution as scientists tried to understand how to make steam engines more efficient. Today, it applies to everything from car engines to refrigerators to stars."
      },
      "principles": [
        {
          "principle": "Systems and Surroundings",
          "statement": "A thermodynamic system is the part of the universe we're studying. Everything outside is the surroundings.",
          "application": "We classify systems as open (exchanges both energy and matter), closed (exchanges energy but not matter), or isolated (exchanges neither).",
          "example": "An open cup of coffee: exchanges energy (cools) and matter (water vapor escapes). A sealed thermos: approximates an isolated system.",
          "analogy": "Think of a system like a classroom: open system = door and windows open (students and heat come and go); closed system = door closed but windows open (only heat exchanges); isolated = sealed room with insulation (nothing exchanges)."
        },
        {
          "principle": "State Variables",
          "statement": "The state of a system is described by variables like temperature (T), pressure (P), volume (V), and internal energy (U).",
          "application": "These variables depend only on the current state, not on how the system got there.",
          "example": "A pot of boiling water at 100°C has the same state variables regardless of whether it was heated quickly or slowly."
        }
      ],
      "image": {
        "src": "images/unit7/thermodynamic_systems.png",
        "alt": "Diagrams showing open, closed, and isolated systems with arrows indicating energy and matter flow",
        "caption": "Systems can be open, closed, or isolated"
      }
    },
    {
      "section_title": "The Zeroth Law of Thermodynamics",
      "introduction": "The Zeroth Law seems almost obvious, but it's fundamental to how we measure temperature. It was named 'Zeroth' because it was recognized after the First and Second Laws but is logically prior to them.",
      "key_concept": {
        "definition": "If two systems are each in thermal equilibrium with a third system, then they are in thermal equilibrium with each other.",
        "context": "This law justifies the use of thermometers. If thermometer A is in equilibrium with system B and also with system C, then B and C must be at the same temperature."
      },
      "principles": [
        {
          "principle": "Thermal Equilibrium",
          "statement": "Two objects are in thermal equilibrium when they are at the same temperature and no net heat flows between them.",
          "application": "When you place a thermometer in a liquid, heat flows until they reach equilibrium. The thermometer then shows the liquid's temperature.",
          "example": "If a thermometer reads 20°C in a cup of water and also reads 20°C in a cup of coffee, then the water and coffee must be at the same temperature—even if you never directly compared them."
        },
        {
          "principle": "Why It's Called Zeroth",
          "statement": "The Zeroth Law was named after the First and Second Laws because scientists realized it was more fundamental and should come first.",
          "application": "Without the Zeroth Law, the concept of temperature wouldn't be well-defined—we couldn't say that two objects have 'the same temperature' in a meaningful way.",
          "example": "Imagine trying to measure temperature without this law—every thermometer reading would only tell you about that specific interaction, not about the object itself."
        }
      ],
      "worked_examples": [
        {
          "title": "Applying the Zeroth Law",
          "problem": "You have three blocks: Block A and Block B are in thermal equilibrium. Block B and Block C are in thermal equilibrium. What can you conclude about Block A and Block C?",
          "step_by_step": [
            {
              "step": "Recall the Zeroth Law",
              "explanation": "If two systems are each in thermal equilibrium with a third, they are in thermal equilibrium with each other."
            },
            {
              "step": "Identify the third system",
              "explanation": "Block B is the third system—it's in equilibrium with both A and C."
            },
            {
              "step": "Apply the law",
              "explanation": "Therefore, Block A and Block C must be in thermal equilibrium with each other."
            }
          ],
          "final_answer": "Block A and Block C are in thermal equilibrium—they have the same temperature.",
          "concept_applied": "Zeroth Law allows temperature comparisons through a common reference."
        }
      ]
    },
    {
      "section_title": "The First Law of Thermodynamics",
      "introduction": "The First Law is essentially the law of conservation of energy applied to thermodynamic systems. It states that energy cannot be created or destroyed—only transformed.",
      "key_concept": {
        "definition": "The change in internal energy of a system equals the heat added to the system minus the work done by the system: $\\Delta U = Q - W$.",
        "context": "This law connects heat (Q), work (W), and internal energy (U). A system can gain energy by absorbing heat or having work done on it; it can lose energy by releasing heat or doing work on its surroundings."
      },
      "principles": [
        {
          "principle": "The First Law Equation",
          "statement": "$\\Delta U = Q - W$, where $\\Delta U$ is change in internal energy, Q is heat added to system, and W is work done BY the system.",
          "application": "Sign conventions are crucial: Q positive = heat enters system; W positive = system does work on surroundings.",
          "example": "If a gas absorbs 100 J of heat and does 40 J of work expanding, its internal energy increases by $\\Delta U = 100 - 40 = 60$ J."
        },
        {
          "principle": "Special Cases",
          "statement": "Different processes have different constraints on the First Law.",
          "application": "In an isolated system ($Q = 0$, $W = 0$), $\\Delta U = 0$—internal energy constant. In a cyclic process (system returns to initial state), $\\Delta U = 0$, so $Q = W$.",
          "example": "A thermos approximates an isolated system—negligible heat exchange, no work done, so internal energy (and temperature) changes very slowly."
        },
        {
          "principle": "Conservation of Energy",
          "statement": "The First Law is just conservation of energy: the total energy of the universe remains constant.",
          "application": "Any energy that leaves a system must go to its surroundings, and vice versa. No energy is ever lost—it only changes form.",
          "example": "When you rub your hands together, work (friction) converts to heat—energy is conserved, just transformed from mechanical to thermal."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Internal Energy Change",
          "problem": "A gas absorbs 250 J of heat and does 80 J of work while expanding. What is the change in its internal energy?",
          "step_by_step": [
            {
              "step": "Identify given values",
              "explanation": "$Q = +250$ J (heat added to system), $W = +80$ J (work done BY system)"
            },
            {
              "step": "Apply First Law",
              "explanation": "$\\Delta U = Q - W = 250 - 80$"
            },
            {
              "step": "Calculate",
              "explanation": "$\\Delta U = 170$ J"
            }
          ],
          "final_answer": "The internal energy increases by 170 J.",
          "concept_applied": "First Law of Thermodynamics with heat added and work done by system."
        },
        {
          "title": "Finding Work Done",
          "problem": "A system's internal energy decreases by 50 J while it absorbs 30 J of heat. How much work is done, and is it done BY or ON the system?",
          "step_by_step": [
            {
              "step": "Identify given values",
              "explanation": "$\\Delta U = -50$ J (decrease), $Q = +30$ J (heat added)"
            },
            {
              "step": "Rearrange First Law",
              "explanation": "$\\Delta U = Q - W \\Rightarrow W = Q - \\Delta U$"
            },
            {
              "step": "Calculate",
              "explanation": "$W = 30 - (-50) = 30 + 50 = 80$ J"
            },
            {
              "step": "Interpret sign",
              "explanation": "Positive W means work is done BY the system."
            }
          ],
          "final_answer": "The system does 80 J of work on its surroundings.",
          "concept_applied": "First Law with internal energy decrease."
        },
        {
          "title": "Cyclic Process",
          "problem": "In a complete cycle, a system absorbs 200 J of heat. How much work does it do during the cycle?",
          "step_by_step": [
            {
              "step": "Recall cyclic process property",
              "explanation": "In a complete cycle, the system returns to its initial state, so $\\Delta U = 0$."
            },
            {
              "step": "Apply First Law",
              "explanation": "$\\Delta U = Q - W \\Rightarrow 0 = Q - W \\Rightarrow W = Q$"
            },
            {
              "step": "Calculate",
              "explanation": "$W = 200$ J"
            }
          ],
          "final_answer": "The system does 200 J of work during the cycle.",
          "concept_applied": "In a cyclic process, net heat absorbed equals net work done."
        }
      ],
      "image": {
        "src": "images/unit7/first_law_diagram.png",
        "alt": "Diagram showing system with heat entering (Q) and work leaving (W), with internal energy change indicated",
        "caption": "The First Law: $\\Delta U = Q - W$"
      }
    },
    {
      "section_title": "The Second Law of Thermodynamics",
      "introduction": "While the First Law says energy is conserved, it doesn't tell us which processes can actually happen. The Second Law provides the direction—it explains why some energy transformations are irreversible.",
      "key_concept": {
        "definition": "Heat cannot spontaneously flow from a colder body to a hotter body. Also, no process is 100% efficient—some energy always becomes unusable (entropy increases).",
        "context": "The Second Law explains why your coffee cools down but never spontaneously reheats, why perpetual motion machines are impossible, and why the universe is gradually running down."
      },
      "principles": [
        {
          "principle": "Direction of Heat Flow",
          "statement": "Heat flows spontaneously from hot to cold, never from cold to hot without external work.",
          "application": "This is why a refrigerator needs work (electricity) to move heat from cold inside to warm outside—it's forcing heat against its natural direction.",
          "example": "Place a hot object next to a cold one—heat flows from hot to cold until they equalize. They'll never spontaneously separate into hot and cold again."
        },
        {
          "principle": "Entropy",
          "statement": "Entropy is a measure of disorder or randomness in a system. The Second Law states that the total entropy of an isolated system always increases over time, or remains constant in ideal reversible processes.",
          "application": "Natural processes increase disorder. It's easier to scramble an egg than to unscramble it—the entropy increase reflects this irreversibility.",
          "example": "A broken eggshell won't spontaneously reassemble. A drop of ink in water spreads but never re-forms a droplet. These are entropy increases."
        },
        {
          "principle": "Heat Engine Efficiency",
          "statement": "No heat engine can convert all input heat into work—some heat must be rejected to a cold reservoir.",
          "application": "The maximum possible efficiency of a heat engine is $e_{max} = 1 - \\frac{T_C}{T_H}$ (temperatures in Kelvin). This is the Carnot efficiency.",
          "example": "A steam engine at 500 K rejecting heat to 300 K surroundings has maximum efficiency $1 - 300/500 = 0.4$ (40%). In reality, actual efficiency is lower due to irreversibilities."
        }
      ],
      "classifications": [
        {
          "type": "Reversible Processes",
          "value": "Theoretical ideal processes that can run backward without change",
          "characteristics": [
            "No friction or dissipative effects",
            "Infinitesimally slow",
            "System always in equilibrium",
            "Entropy change = 0"
          ],
          "behavior": "Reversible processes are idealizations—they never actually occur in nature but set upper limits on efficiency.",
          "examples": [
            {
              "process": "Quasi-static compression",
              "explanation": "Compressing a gas so slowly that it's always in equilibrium—theoretical ideal."
            },
            {
              "process": "Carnot cycle",
              "explanation": "The most efficient possible heat engine cycle, consisting of reversible processes."
            }
          ]
        },
        {
          "type": "Irreversible Processes",
          "value": "Real processes that happen spontaneously",
          "characteristics": [
            "Involve friction, turbulence, or dissipation",
            "Proceed at finite rates",
            "Entropy always increases",
            "Cannot run backward spontaneously"
          ],
          "behavior": "All real processes are irreversible. They increase the total entropy of the universe.",
          "examples": [
            {
              "process": "Heat conduction through a wall",
              "explanation": "Heat flows from hot to cold irreversibly—you can't make it flow back without work."
            },
            {
              "process": "Mixing two gases",
              "explanation": "Gases mix spontaneously but never unmix without external work."
            },
            {
              "process": "Friction",
              "explanation": "Mechanical work converts to heat irreversibly—you can't get the work back from the heat."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Heat Engine Efficiency",
          "problem": "A heat engine operates between a hot reservoir at 800 K and a cold reservoir at 300 K. What is its maximum possible efficiency?",
          "step_by_step": [
            {
              "step": "Recall Carnot efficiency formula",
              "explanation": "$e_{max} = 1 - \\frac{T_C}{T_H}$ (temperatures in Kelvin)"
            },
            {
              "step": "Insert values",
              "explanation": "$e_{max} = 1 - \\frac{300}{800} = 1 - 0.375$"
            },
            {
              "step": "Calculate",
              "explanation": "$e_{max} = 0.625 = 62.5\\%$"
            }
          ],
          "final_answer": "The maximum possible efficiency is 62.5%. Real engines would have lower efficiency.",
          "concept_applied": "Second Law limits heat engine efficiency."
        },
        {
          "title": "Why Refrigerators Need Work",
          "problem": "Explain why a refrigerator must consume electricity to keep food cold, even though the kitchen is warmer than the fridge.",
          "step_by_step": [
            {
              "step": "State the Second Law direction",
              "explanation": "Heat flows spontaneously from hot to cold, not from cold to hot."
            },
            {
              "step": "Identify what fridge does",
              "explanation": "A refrigerator moves heat from cold inside to warmer kitchen—against natural flow."
            },
            {
              "step": "Explain work requirement",
              "explanation": "To force heat against its natural direction, work must be done (by the compressor)."
            }
          ],
          "final_answer": "The Second Law says heat cannot spontaneously flow from cold to hot. A refrigerator must do work (using electricity) to force heat to move against its natural direction, from the cold interior to the warmer kitchen.",
          "concept_applied": "Second Law explains why cooling requires work."
        }
      ],
      "image": {
        "src": "images/unit7/second_law_examples.png",
        "alt": "Collage showing irreversible processes: coffee cooling, broken egg, ink spreading in water",
        "caption": "The Second Law explains why these processes happen one way but not the reverse"
      }
    },
    {
      "section_title": "The Third Law of Thermodynamics",
      "introduction": "The Third Law deals with behavior as temperature approaches absolute zero. It's less commonly encountered in everyday life but fundamental to low-temperature physics.",
      "key_concept": {
        "definition": "As temperature approaches absolute zero, the entropy of a perfect crystal approaches zero. It is impossible to reach absolute zero through any finite number of cooling steps.",
        "context": "This law means that absolute zero is an unattainable limit—we can get arbitrarily close but never quite there."
      },
      "principles": [
        {
          "principle": "Entropy at Absolute Zero",
          "statement": "A perfect crystal at 0 K has zero entropy—there is exactly one way to arrange its particles, so disorder is minimized.",
          "application": "This provides a reference point for entropy measurements. We can measure entropy changes from this theoretical baseline.",
          "example": "Helium becomes a superfluid near absolute zero, exhibiting quantum effects on a macroscopic scale."
        },
        {
          "principle": "Unattainability of Absolute Zero",
          "statement": "No finite series of processes can cool a system to exactly 0 K.",
          "application": "Each cooling step becomes harder as temperature drops. Scientists have reached billionths of a degree above absolute zero, but never exactly zero.",
          "example": "Laser cooling and magnetic trapping have achieved temperatures below 1 nanokelvin—still above absolute zero."
        }
      ],
      "note": "For Grade 9-10, the Third Law is mainly mentioned for completeness. Its deeper implications are studied in advanced physics and chemistry."
    },
    {
      "section_title": "Real-World Applications",
      "introduction": "Thermodynamics laws govern everything from power plants to biological systems. Understanding them helps explain how our world works.",
      "categories": [
        {
          "type": "Power Generation",
          "description": "All power plants operate on thermodynamic principles.",
          "examples": [
            {
              "process": "Coal/nuclear power plants",
              "explanation": "Heat from fuel or nuclear reactions boils water to steam, which expands through turbines (doing work), then condenses in cooling towers. First Law: heat in = work out + waste heat. Second Law: waste heat is unavoidable."
            },
            {
              "process": "Combined cycle plants",
              "explanation": "Use both gas and steam turbines to extract more work from fuel, approaching higher efficiencies by using two temperature stages."
            }
          ]
        },
        {
          "type": "Refrigeration and Air Conditioning",
          "description": "These devices violate the Second Law? No—they use work to force heat against its natural direction.",
          "examples": [
            {
              "process": "Refrigerator cycle",
              "explanation": "Compressor does work on refrigerant, forcing it to absorb heat from inside (cooling) and release it outside (warming)."
            },
            {
              "process": "Heat pumps",
              "explanation": "Essentially refrigerators that can heat a house in winter by moving heat from cold outside to warm inside—work input makes it possible."
            }
          ]
        },
        {
          "type": "Engines and Transportation",
          "description": "All vehicles use thermodynamic cycles.",
          "examples": [
            {
              "process": "Car engines",
              "explanation": "Gasoline combustion creates hot, high-pressure gas that expands, pushing pistons (work). The exhaust carries away waste heat—required by Second Law."
            },
            {
              "process": "Jet engines",
              "explanation": "Air is compressed, heated by combustion, expands through turbines, and exhausts at high speed—work extracted to drive compressor and provide thrust."
            }
          ]
        },
        {
          "type": "Biological Systems",
          "description": "Living organisms obey thermodynamic laws.",
          "examples": [
            {
              "process": "Metabolism",
              "explanation": "Animals convert chemical energy from food into work and heat. Efficiency is limited—some energy always becomes heat (why we're warm-blooded)."
            },
            {
              "process": "Photosynthesis",
              "explanation": "Plants convert solar radiation into chemical energy, but not all incoming energy is captured—some is reflected or re-radiated as heat."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit7/thermodynamics_applications.png",
        "alt": "Collage showing power plant, refrigerator, car engine, and human metabolism",
        "caption": "Thermodynamics applies to power generation, cooling, transportation, and life itself"
      }
    },
    {
      "section_title": "Heat Engines and Efficiency",
      "introduction": "A heat engine is any device that converts thermal energy into mechanical work. Understanding their operation and limitations is central to thermodynamics.",
      "key_concept": {
        "definition": "A heat engine absorbs heat ($Q_H$) from a hot reservoir, does work ($W$), and rejects waste heat ($Q_C$) to a cold reservoir. Efficiency $e = \\frac{W}{Q_H} = 1 - \\frac{Q_C}{Q_H}$.",
        "context": "The Second Law imposes a maximum possible efficiency based on reservoir temperatures: $e_{max} = 1 - \\frac{T_C}{T_H}$ (Carnot efficiency)."
      },
      "principles": [
        {
          "principle": "Basic Heat Engine Operation",
          "statement": "All heat engines operate in a cycle: absorb heat from hot source, convert some to work, reject remaining heat to cold sink.",
          "application": "Steam engines, car engines, and power plants all follow this pattern—none can convert all heat to work.",
          "example": "A typical car engine might have 25-30% efficiency—70-75% of fuel energy becomes waste heat, not motion."
        },
        {
          "principle": "Carnot's Theorem",
          "statement": "No heat engine operating between two temperatures can be more efficient than a Carnot engine operating between the same temperatures.",
          "application": "This sets an absolute upper limit on efficiency. Real engines always fall short due to friction, heat loss, and irreversibilities.",
          "example": "If $T_H = 500$ K and $T_C = 300$ K, maximum efficiency is 40%. A real engine might achieve 35%—still impressive, but below the limit."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Actual Efficiency",
          "problem": "A heat engine absorbs 1,200 J from a hot reservoir, does 300 J of work, and rejects 900 J to a cold reservoir. Calculate its efficiency and compare to Carnot efficiency if $T_H = 600$ K and $T_C = 300$ K.",
          "step_by_step": [
            {
              "step": "Calculate actual efficiency",
              "explanation": "$e = \\frac{W}{Q_H} = \\frac{300}{1,200} = 0.25 = 25\\%$"
            },
            {
              "step": "Calculate Carnot efficiency",
              "explanation": "$e_{max} = 1 - \\frac{T_C}{T_H} = 1 - \\frac{300}{600} = 1 - 0.5 = 0.5 = 50\\%$"
            },
            {
              "step": "Compare",
              "explanation": "Actual efficiency (25%) is half the maximum possible (50%). The engine has significant irreversibilities."
            }
          ],
          "final_answer": "Actual efficiency = 25%; Carnot efficiency = 50%. The engine operates at half the theoretical maximum.",
          "concept_applied": "Comparing real engines to the Carnot limit."
        }
      ]
    },
    {
      "section_title": "Simple Demonstrations",
      "introduction": "You can observe thermodynamic principles with simple experiments at home.",
      "process_flow": [
        {
          "step": "1",
          "process": "Coffee Cooling (Second Law)",
          "description": "Make a cup of hot coffee and let it sit. Observe its temperature over time (use a thermometer).",
          "mechanism": "Heat flows from hot coffee to cooler surroundings until equilibrium.",
          "result": "Coffee cools to room temperature but never spontaneously reheats—demonstrating the direction of heat flow.",
          "applications": [
            "Shows Second Law in action",
            "Discusses why reversed process never occurs"
          ]
        },
        {
          "step": "2",
          "process": "Rubbing Hands (First Law)",
          "description": "Rub your hands together vigorously for 30 seconds. Feel the warmth.",
          "mechanism": "Work (friction) converts to heat, increasing internal energy (temperature) of your hands.",
          "result": "Hands become warmer—work transformed into thermal energy.",
          "applications": [
            "Demonstrates energy conservation and transformation",
            "Shows work → heat conversion"
          ]
        },
        {
          "step": "3",
          "process": "Balloon in Freezer",
          "description": "Blow up a balloon and tie it. Measure its circumference. Place in freezer for 30 minutes, then measure again.",
          "mechanism": "Cooling reduces internal energy of air molecules, decreasing pressure and volume (if balloon is flexible).",
          "result": "Balloon shrinks noticeably. When removed, it expands back to original size.",
          "applications": [
            "Shows relationship between temperature and internal energy",
            "Demonstrates gas behavior with temperature change"
          ]
        },
        {
          "step": "4",
          "process": "The Impossible Ice Cube",
          "description": "Place an ice cube in a cup of warm water and observe. Then try to get the water to spontaneously separate back into ice cube and warm water.",
          "mechanism": "Heat flows from warm water to ice, melting it. Reverse never happens spontaneously.",
          "result": "Ice melts completely; reverse process never occurs, demonstrating irreversibility and entropy increase.",
          "applications": [
            "Powerful demonstration of Second Law",
            "Shows why some processes are irreversible"
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Thermodynamics",
    "System",
    "Surroundings",
    "Open system",
    "Closed system",
    "Isolated system",
    "Thermal equilibrium",
    "Zeroth Law",
    "First Law ($\\Delta U = Q - W$)",
    "Internal energy",
    "Heat",
    "Work",
    "Second Law",
    "Entropy",
    "Irreversible process",
    "Reversible process",
    "Heat engine",
    "Efficiency",
    "Carnot efficiency",
    "Third Law",
    "Absolute zero"
  ],
  "summary": "Thermodynamics is the study of heat, work, and energy transformations, governed by fundamental laws. The Zeroth Law establishes the concept of temperature: if A is in equilibrium with B and B with C, then A and C are in equilibrium—allowing thermometers to work. The First Law ($\\Delta U = Q - W$) is conservation of energy: the change in a system's internal energy equals heat added minus work done. The Second Law gives direction to processes: heat flows spontaneously from hot to cold, and entropy (disorder) always increases in isolated systems. This limits heat engine efficiency—no engine can convert all heat to work; some must be rejected to a cold reservoir. The maximum possible efficiency is $e_{max} = 1 - T_C/T_H$ (Carnot efficiency). The Third Law states that absolute zero is unattainable and entropy approaches zero for perfect crystals at 0 K. These laws explain why perpetual motion machines are impossible, why refrigerators need work, why power plants have cooling towers, and why some processes are irreversible. Thermodynamics applies to everything from car engines to living organisms, governing all energy transformations in the universe. This foundation prepares us for exploring thermal expansion in the next section."
}
