{
  "expanded_description": "This section introduces sound waves as a specific type of longitudinal wave. Students will explore how sound is produced, how it travels through different mediums, and the basic characteristics that distinguish one sound from another. The section establishes foundational knowledge for understanding pitch, loudness, and the human perception of sound.",
  "core_concept": {
    "principle": "Sound is a longitudinal wave that travels through materials by causing particles to vibrate back and forth, transferring energy from the source to the listener without transferring matter.",
    "explanation": "When something vibrates—like a guitar string, vocal cord, or speaker cone—it pushes against nearby air molecules, compressing them. These molecules push against their neighbors, passing the compression along. This chain reaction of compressions and rarefactions travels through the air until it reaches your ear, where it's interpreted as sound.",
    "image": {
      "src": "images/unit8/sound_wave_basics.png",
      "alt": "Diagram showing a vibrating speaker creating compressions and rarefactions in air that travel to a listener's ear",
      "caption": "Vibrating objects create sound waves—compressions and rarefactions that travel through air to our ears"
    }
  },
  "sections": [
    {
      "section_title": "What Is Sound?",
      "introduction": "Sound is so familiar that we rarely think about what it actually is. But understanding sound as a wave reveals why we can hear around corners, why some sounds are loud and others soft, and why music sounds different from noise.",
      "key_concept": {
        "definition": "Sound is a mechanical, longitudinal wave that travels through a medium (solid, liquid, or gas) as vibrations of particles.",
        "context": "Sound cannot travel through a vacuum because there are no particles to vibrate and pass along the energy. That's why space is silent—no air means no sound!"
      },
      "principles": [
        {
          "principle": "Sound Requires a Medium",
          "statement": "Sound waves need matter to travel through. They cannot travel through empty space.",
          "application": "The denser the medium, generally the faster sound travels—but also the more energy it takes to create vibrations.",
          "example": "You can hear sounds through walls (solid), through water (liquid), and through air (gas)—but not through a vacuum.",
          "analogy": "Think of sound like a domino chain: you need dominoes (particles) to pass the effect along. No dominoes, no chain reaction."
        },
        {
          "principle": "Sound Is Longitudinal",
          "statement": "Sound waves are longitudinal—particles vibrate back and forth in the same direction the wave travels.",
          "application": "This creates alternating regions of high pressure (compressions) and low pressure (rarefactions).",
          "example": "A speaker cone pushes air outward (compression), then pulls back (rarefaction), creating a longitudinal wave.",
          "analogy": "Imagine a line of people shoulder to shoulder. If you push the first person, they bump the next, and a \"push\" travels down the line—that's like a sound wave."
        }
      ],
      "image": {
        "src": "images/unit8/sound_longitudinal.png",
        "alt": "Close-up diagram of air molecules showing compressions (crowded) and rarefactions (spread out)",
        "caption": "Sound waves consist of compressions (high pressure) and rarefactions (low pressure)"
      }
    },
    {
      "section_title": "How Sound Is Produced",
      "introduction": "All sounds begin with something vibrating. Whether it's a drum skin, a vocal cord, or a falling book, vibration is the essential first step.",
      "principles": [
        {
          "principle": "Vibration Creates Sound",
          "statement": "When an object vibrates, it moves back and forth rapidly, disturbing the surrounding medium and creating sound waves.",
          "application": "The frequency of vibration determines the pitch; the amplitude determines the loudness.",
          "example": "A tuning fork vibrates at a specific frequency, producing a pure tone. A drumhead vibrates at multiple frequencies simultaneously, creating a complex sound.",
          "analogy": "Think of a flag waving in the wind—the motion disturbs the air, though flags don't create audible sound because the motion is too slow."
        },
        {
          "principle": "Sound Needs Energy",
          "statement": "The energy to create sound comes from whatever sets the object vibrating.",
          "application": "Striking, plucking, bowing, or blowing into an object transfers energy to it, which then radiates as sound waves.",
          "example": "Plucking a guitar string transfers energy from your hand to the string. The string vibrates, and you hear sound. When the energy dissipates, the sound fades."
        }
      ],
      "classifications": [
        {
          "type": "Musical Instruments",
          "value": "Designed to produce controlled vibrations",
          "characteristics": [
            "Regular, repeating vibrations",
            "Specific frequencies (notes)",
            "Pleasant to hear"
          ],
          "examples": [
            {
              "process": "String instruments",
              "explanation": "Guitar, violin, piano—strings vibrate when plucked, bowed, or struck."
            },
            {
              "process": "Wind instruments",
              "explanation": "Flute, trumpet, clarinet—air column vibrates inside the instrument."
            },
            {
              "process": "Percussion",
              "explanation": "Drums, xylophone—membrane or material vibrates when struck."
            }
          ]
        },
        {
          "type": "Human Voice",
          "value": "Vocal cords vibrate to create speech and song",
          "characteristics": [
            "Vocal cords are folds of tissue",
            "Air from lungs makes them vibrate",
            "Mouth and throat shape the sound"
          ],
          "examples": [
            {
              "process": "Speaking",
              "explanation": "Air passes through vibrating vocal cords, creating sound waves that your mouth shapes into words."
            },
            {
              "process": "Singing",
              "explanation": "Different tensions in vocal cords produce different pitches—tighter = higher pitch."
            }
          ]
        },
        {
          "type": "Noise",
          "value": "Irregular, often unwanted vibrations",
          "characteristics": [
            "Random or complex vibrations",
            "Many frequencies at once",
            "Often unpleasant"
          ],
          "examples": [
            {
              "process": "Footsteps",
              "explanation": "Impact of feet on floor creates vibrations that travel through structure and air."
            },
            {
              "process": "Dropped object",
              "explanation": "Sudden impact creates a brief, complex sound wave."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/sound_sources.png",
        "alt": "Illustration showing different sound sources: guitar string, vocal cords, drum, and tuning fork",
        "caption": "All sounds come from vibrating objects—strings, membranes, air columns, or vocal cords"
      }
    },
    {
      "section_title": "How Sound Travels",
      "introduction": "Once a sound is created, it needs to travel from the source to your ear. This journey through different materials affects how we hear it.",
      "principles": [
        {
          "principle": "Particle Vibration, Not Particle Travel",
          "statement": "In a sound wave, particles vibrate around fixed positions—they don't travel with the wave.",
          "application": "Each particle passes energy to its neighbor, then returns to its original position. The energy travels, but the air doesn't.",
          "example": "A candle flame near a loudspeaker flickers as sound passes, but the air itself doesn't blow out the candle—it just vibrates.",
          "analogy": "Like a line of people passing a message by whispering: the message travels, but each person stays put."
        },
        {
          "principle": "Sound Speed Depends on Medium",
          "statement": "Sound travels at different speeds through different materials, generally faster in denser, more elastic materials.",
          "application": "In air at 20°C: ~343 m/s. In water: ~1500 m/s. In steel: ~5000 m/s.",
          "example": "Put your ear to a train track—you'll hear an approaching train much sooner than through air because sound travels faster in steel."
        },
        {
          "principle": "Sound Can Reflect, Refract, and Diffract",
          "statement": "Like all waves, sound exhibits these behaviors, which explain many everyday acoustic phenomena.",
          "application": "Reflection creates echoes; refraction causes sound to bend in temperature gradients; diffraction lets us hear around corners.",
          "example": "You can hear someone in the next room through an open doorway because sound diffracts (spreads out) through the opening."
        }
      ],
      "classifications": [
        {
          "type": "Sound in Gases",
          "value": "Slowest, least dense medium",
          "characteristics": [
            "Speed ~330-350 m/s (depends on temperature)",
            "Particles far apart, collisions less frequent",
            "Sound attenuates (weakens) faster"
          ],
          "behavior": "In warmer air, molecules move faster and collisions happen more often—sound travels faster.",
          "examples": [
            {
              "process": "Everyday conversation",
              "explanation": "Sound travels through air to reach your ears."
            },
            {
              "process": "Temperature effect",
              "explanation": "Sound travels faster on a hot day than a cold day."
            }
          ]
        },
        {
          "type": "Sound in Liquids",
          "value": "Faster than gases, slower than most solids",
          "characteristics": [
            "Speed ~1400-1600 m/s in water",
            "Particles closer together",
            "Travels farther than in air"
          ],
          "behavior": "Whales communicate over hundreds of kilometers underwater because sound travels efficiently in water.",
          "examples": [
            {
              "process": "Underwater communication",
              "explanation": "Submarines use sonar—sound navigation and ranging."
            },
            {
              "process": "Hearing underwater",
              "explanation": "Sounds seem strange because speed difference affects perception."
            }
          ]
        },
        {
          "type": "Sound in Solids",
          "value": "Fastest, particles tightly packed",
          "characteristics": [
            "Speed 3000-6000 m/s typical",
            "Excellent transmission",
            "Can travel as both longitudinal and transverse (in solids)"
          ],
          "behavior": "Solids can support both compression waves (like sound in fluids) and shear waves (transverse)—but our hearing primarily detects the longitudinal component.",
          "examples": [
            {
              "process": "Hearing through walls",
              "explanation": "Sound travels through solid walls, though much energy is lost."
            },
            {
              "process": "Earthquake waves",
              "explanation": "P-waves are sound-like waves traveling through solid Earth."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/sound_mediums.png",
        "alt": "Diagram comparing particle spacing in gas, liquid, and solid with relative sound speeds",
        "caption": "Sound travels fastest in solids (tightly packed particles) and slowest in gases (widely spaced particles)"
      }
    },
    {
      "section_title": "Frequency and Pitch",
      "introduction": "What makes a sound high or low? The answer lies in how fast the source vibrates—its frequency.",
      "key_concept": {
        "definition": "Pitch is our perception of the frequency of a sound wave. Higher frequency = higher pitch; lower frequency = lower pitch.",
        "context": "Frequency is measured in hertz (Hz)—the number of vibrations per second. Human hearing typically ranges from about 20 Hz to 20,000 Hz (20 kHz)."
      },
      "classifications": [
        {
          "type": "Infrasound (Below 20 Hz)",
          "value": "Too low for humans to hear",
          "characteristics": [
            "Frequencies below 20 Hz",
            "Can be felt as vibrations",
            "Travel long distances"
          ],
          "examples": [
            {
              "process": "Earthquakes",
              "explanation": "Seismic waves include infrasound frequencies."
            },
            {
              "process": "Elephant communication",
              "explanation": "Elephants use infrasound to communicate over kilometers."
            },
            {
              "process": "Weather patterns",
              "explanation": "Storms produce infrasound detectable by special instruments."
            }
          ]
        },
        {
          "type": "Audible Sound (20 Hz - 20,000 Hz)",
          "value": "Human hearing range",
          "characteristics": [
            "Bass: 20-250 Hz (low pitch)",
            "Midrange: 250-4000 Hz (speech, most instruments)",
            "Treble: 4000-20,000 Hz (high pitch)"
          ],
          "examples": [
            {
              "process": "Bass drum",
              "explanation": "About 50-100 Hz—low pitch you feel as much as hear."
            },
            {
              "process": "Middle C on piano",
              "explanation": "About 262 Hz—in the middle of human hearing."
            },
            {
              "process": "Cymbal crash",
              "explanation": "Contains frequencies up to several kHz—high pitch."
            }
          ]
        },
        {
          "type": "Ultrasound (Above 20,000 Hz)",
          "value": "Too high for humans to hear",
          "characteristics": [
            "Frequencies above 20 kHz",
            "Used in medical imaging",
            "Animals use for echolocation"
          ],
          "examples": [
            {
              "process": "Bat echolocation",
              "explanation": "Bats emit ultrasound and listen for echoes to navigate and find prey."
            },
            {
              "process": "Medical ultrasound",
              "explanation": "Used to image babies in the womb and internal organs."
            },
            {
              "process": "Dog whistles",
              "explanation": "Dogs can hear ultrasound frequencies humans cannot."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/hearing_range.png",
        "alt": "Diagram showing frequency scale from 0 Hz to 50,000 Hz with infrasound, audible range, and ultrasound labeled, plus animal hearing ranges",
        "caption": "Humans hear approximately 20 Hz to 20,000 Hz—other animals hear different ranges"
      },
      "note": "As people age, the upper limit of hearing often decreases—many adults can't hear above 15-16 kHz, while children can often hear the full 20 kHz."
    },
    {
      "section_title": "Amplitude and Loudness",
      "introduction": "Why are some sounds loud and others soft? The answer lies in the wave's amplitude—how much energy it carries.",
      "key_concept": {
        "definition": "Loudness is our perception of the amplitude (energy) of a sound wave. Larger amplitude = louder sound; smaller amplitude = softer sound.",
        "context": "Amplitude corresponds to the amount of compression in the wave—how tightly air molecules are packed in compressions."
      },
      "principles": [
        {
          "principle": "Amplitude and Energy",
          "statement": "The energy carried by a sound wave is proportional to the square of its amplitude. Doubling amplitude quadruples energy.",
          "application": "This is why loud sounds require much more energy than soft sounds—and why they can damage hearing more easily.",
          "example": "A whisper has very small amplitude; a shout has large amplitude—maybe 1000× more energy!"
        },
        {
          "principle": "Measuring Loudness",
          "statement": "Loudness is measured in decibels (dB), a logarithmic scale that matches how our ears perceive sound.",
          "application": "Every 10 dB increase represents a 10× increase in sound intensity, but our ears perceive it as roughly twice as loud.",
          "example": "0 dB = threshold of hearing; 60 dB = normal conversation; 120 dB = threshold of pain."
        }
      ],
      "classifications": [
        {
          "type": "Typical Sound Levels",
          "value": "Everyday sounds and their approximate dB levels",
          "characteristics": [
            "0 dB: Threshold of hearing",
            "30 dB: Whisper",
            "60 dB: Normal conversation",
            "80 dB: Busy street",
            "100 dB: Subway train, power mower",
            "120 dB: Rock concert, threshold of pain",
            "140 dB: Jet engine at close range"
          ],
          "examples": [
            {
              "process": "Library",
              "explanation": "About 30-40 dB—very quiet."
            },
            {
              "process": "Movie theater",
              "explanation": "Can reach 100+ dB during action scenes—potentially damaging with long exposure."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/decibel_scale.png",
        "alt": "Diagram showing decibel scale from 0 dB to 140 dB with common sound examples at each level",
        "caption": "Decibels measure sound level—every 10 dB increase is 10× more intense"
      },
      "note": "Prolonged exposure to sounds above 85 dB can cause hearing damage. This is why musicians, construction workers, and others use hearing protection."
    },
    {
      "section_title": "Sound Wave Interactions",
      "introduction": "When sound waves encounter obstacles or each other, they interact in interesting ways that affect what we hear.",
      "principles": [
        {
          "principle": "Reflection (Echoes)",
          "statement": "Sound waves bounce off hard surfaces, creating reflections we call echoes.",
          "application": "If the reflected sound arrives more than 0.1 seconds after the direct sound, we hear it as a distinct echo. Shorter delays create reverberation (a blending of sound).",
          "example": "Shouting in a canyon or large empty hall produces echoes."
        },
        {
          "principle": "Refraction",
          "statement": "Sound bends when it passes through regions of different temperature or wind speed.",
          "application": "This explains why sound can sometimes be heard clearly over long distances at night (temperature inversion) or downwind.",
          "example": "On a cool evening, sound from a distant concert may travel farther than during the day."
        },
        {
          "principle": "Diffraction",
          "statement": "Sound waves bend around obstacles and spread out after passing through openings.",
          "application": "Because sound wavelengths are comparable to everyday objects (centimeters to meters), diffraction is very noticeable.",
          "example": "You can hear someone talking in the next room even if you can't see them—sound diffracts through doorways and around corners."
        },
        {
          "principle": "Interference",
          "statement": "When two or more sound waves meet, they combine. This can increase loudness (constructive) or decrease/cancel it (destructive).",
          "application": "This is why some places in a room have louder or softer sound—waves add or cancel.",
          "example": "Noise-canceling headphones use destructive interference: they create waves exactly opposite to incoming noise, canceling it out."
        }
      ],
      "image": {
        "src": "images/unit8/sound_interactions.png",
        "alt": "Diagram showing sound reflection (echo), diffraction around corner, and interference patterns",
        "caption": "Sound waves reflect, diffract, refract, and interfere—affecting what we hear"
      }
    },
    {
      "section_title": "Real-World Sound Examples",
      "introduction": "Sound wave principles explain countless everyday experiences and technological applications.",
      "categories": [
        {
          "type": "Acoustics and Architecture",
          "description": "Designing spaces for good sound.",
          "examples": [
            {
              "process": "Concert halls",
              "explanation": "Designed to balance reflection and absorption, creating rich sound without echoes."
            },
            {
              "process": "Recording studios",
              "explanation": "Use foam and special shapes to absorb reflections and prevent unwanted echoes."
            },
            {
              "process": "Classrooms",
              "explanation": "Good acoustics help students hear teachers clearly."
            }
          ]
        },
        {
          "type": "Musical Instrument Design",
          "description": "Instruments shaped to produce specific sounds.",
          "examples": [
            {
              "process": "Guitar body",
              "explanation": "The hollow body amplifies string vibrations by causing air inside to resonate."
            },
            {
              "process": "Brass instruments",
              "explanation": "Length of tubing determines fundamental frequency—longer = lower pitch."
            },
            {
              "process": "Piano",
              "explanation": "Soundboard amplifies string vibrations, projecting sound to audience."
            }
          ]
        },
        {
          "type": "Animal Communication",
          "description": "Animals use sound in remarkable ways.",
          "examples": [
            {
              "process": "Bat echolocation",
              "explanation": "Emit ultrasound and analyze returning echoes to \"see\" in darkness."
            },
            {
              "process": "Whale songs",
              "explanation": "Complex sounds that travel hundreds of kilometers underwater."
            },
            {
              "process": "Bird songs",
              "explanation": "Used to attract mates and defend territory—each species has characteristic frequencies."
            }
          ]
        },
        {
          "type": "Noise Pollution",
          "description": "Unwanted sound affects health and quality of life.",
          "examples": [
            {
              "process": "Traffic noise",
              "explanation": "Constant low-frequency noise from vehicles can cause stress and sleep disturbance."
            },
            {
              "process": "Sound barriers",
              "explanation": "Walls along highways block or deflect sound to protect nearby neighborhoods."
            },
            {
              "process": "Workplace noise",
              "explanation": "Factories and construction sites require hearing protection for workers."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/sound_applications.png",
        "alt": "Collage showing concert hall, musical instruments, bat echolocation, and sound barrier wall",
        "caption": "Understanding sound helps design better spaces, instruments, and solutions to noise problems"
      }
    },
    {
      "section_title": "Simple Sound Experiments",
      "introduction": "You can explore sound waves with simple materials at home or in class.",
      "process_flow": [
        {
          "step": "1",
          "process": "Seeing vibrations",
          "description": "Stretch plastic wrap tightly over a bowl. Sprinkle rice or salt on top.",
          "mechanism": "Hold a pan or drum near the bowl and hit it. Shout loudly near it.",
          "result": "The salt jumps as sound waves cause the plastic to vibrate.",
          "applications": [
            "Demonstrates that sound is vibration",
            "Shows energy transfer through air"
          ]
        },
        {
          "step": "2",
          "process": "Sound through different mediums",
          "description": "Tap a fork and hold it in air, then press it against a table with your ear to the table.",
          "mechanism": "Compare how loud the tapping sounds through air vs through the solid table.",
          "result": "Sound is much louder through the solid—sound travels better through solids.",
          "applications": [
            "Demonstrates medium effects on sound transmission"
          ]
        },
        {
          "step": "3",
          "process": "Make a string telephone",
          "description": "Attach two paper cups with a long string pulled tight.",
          "mechanism": "One person talks into a cup while another holds the other cup to their ear.",
          "result": "Sound vibrations travel along the string much better than through air.",
          "applications": [
            "Shows sound as vibration",
            "Demonstrates transmission through solids"
          ]
        },
        {
          "step": "4",
          "process": "Observing pitch",
          "description": "Stretch rubber bands of different thicknesses across a box.",
          "mechanism": "Pluck each rubber band and listen to the pitch.",
          "result": "Thicker, looser bands produce lower pitch; thinner, tighter bands produce higher pitch.",
          "applications": [
            "Relates frequency to pitch",
            "Demonstrates how instruments work"
          ]
        }
      ]
    },
    {
      "section_title": "Practice Questions",
      "introduction": "Apply your understanding of sound waves.",
      "worked_examples": [
        {
          "title": "Problem 1: Sound Medium",
          "problem": "Can sound travel through space? Why or why not?",
          "step_by_step": [
            {
              "step": "Recall sound requirements",
              "explanation": "Sound is a mechanical wave—it needs a medium (particles to vibrate)."
            },
            {
              "step": "Consider space",
              "explanation": "Space is mostly vacuum—no particles to vibrate."
            }
          ],
          "final_answer": "No, sound cannot travel through space because there's no medium (air, water, solid) to carry the vibrations.",
          "concept_applied": "Sound requires a medium."
        },
        {
          "title": "Problem 2: Identifying Wave Type",
          "problem": "What type of wave is sound? Describe how particles move.",
          "step_by_step": [
            {
              "step": "Recall wave types",
              "explanation": "Transverse: perpendicular vibration; Longitudinal: parallel vibration."
            },
            {
              "step": "Apply to sound",
              "explanation": "Sound particles vibrate back and forth in the same direction the wave travels."
            }
          ],
          "final_answer": "Sound is a longitudinal wave—particles vibrate parallel to the direction of wave travel, creating compressions and rarefactions.",
          "concept_applied": "Sound wave classification."
        },
        {
          "title": "Problem 3: Speed Comparison",
          "problem": "Sound travels at 340 m/s in air and 1500 m/s in water. If you hear a sound through air and through water at the same distance, which arrives first?",
          "step_by_step": [
            {
              "step": "Compare speeds",
              "explanation": "1500 m/s > 340 m/s, so sound travels faster in water."
            },
            {
              "step": "Conclusion",
              "explanation": "The sound through water arrives first."
            }
          ],
          "final_answer": "The sound through water arrives first because sound travels faster in water than in air.",
          "concept_applied": "Sound speed depends on medium."
        },
        {
          "title": "Problem 4: Frequency and Pitch",
          "problem": "A sound wave has frequency 100 Hz. Another has frequency 1000 Hz. Which has higher pitch?",
          "step_by_step": [
            {
              "step": "Recall relationship",
              "explanation": "Higher frequency = higher pitch."
            }
          ],
          "final_answer": "The 1000 Hz sound has higher pitch.",
          "concept_applied": "Frequency determines pitch."
        },
        {
          "title": "Problem 5: Amplitude and Loudness",
          "problem": "Two sound waves have the same frequency but different amplitudes. How do they differ in what we hear?",
          "step_by_step": [
            {
              "step": "Recall amplitude effect",
              "explanation": "Amplitude determines loudness, not pitch."
            }
          ],
          "final_answer": "They have the same pitch but different loudness—the larger amplitude wave sounds louder.",
          "concept_applied": "Amplitude determines loudness."
        },
        {
          "title": "Problem 6: Human Hearing Range",
          "problem": "A sound has frequency 25,000 Hz. Can most humans hear it? Explain.",
          "step_by_step": [
            {
              "step": "Recall human range",
              "explanation": "Humans hear approximately 20 Hz to 20,000 Hz."
            },
            {
              "step": "Compare",
              "explanation": "25,000 Hz is above 20,000 Hz—outside human range."
            }
          ],
          "final_answer": "No, most humans cannot hear 25,000 Hz because it's above the upper limit of human hearing (ultrasound).",
          "concept_applied": "Human hearing frequency range."
        }
      ]
    },
    {
      "section_title": "Common Misconceptions",
      "introduction": "Here are frequent misunderstandings about sound waves.",
      "principles": [
        {
          "principle": "Misconception: Sound travels by moving air molecules from source to ear",
          "statement": "Students often think air from the speaker's mouth travels to the listener's ear.",
          "application": "Air molecules vibrate in place, passing energy along—they don't travel the distance. It's the wave that travels, not the air.",
          "example": "You don't feel wind from someone talking—air isn't moving toward you, just vibrating."
        },
        {
          "principle": "Misconception: Sound travels fastest in gases because they're less dense",
          "statement": "Some assume less resistance means faster travel.",
          "application": "Sound actually travels faster in denser, more elastic materials because particles are closer and transfer energy more quickly.",
          "example": "Sound in steel (~5000 m/s) is much faster than in air (~340 m/s)."
        },
        {
          "principle": "Misconception: Loudness and pitch are the same thing",
          "statement": "Students sometimes confuse loud (amplitude) with high pitch (frequency).",
          "application": "They're completely independent properties. You can have loud low notes (bass) or soft high notes (piccolo).",
          "example": "A foghorn is loud and low pitch; a whistle can be soft and high pitch."
        },
        {
          "principle": "Misconception: Sound can travel through vacuum",
          "statement": "Movies and TV often show spaceships exploding with sound, reinforcing this myth.",
          "application": "Space is silent—no medium means no sound.",
          "example": "Astronauts communicate by radio (electromagnetic waves) because sound won't travel between them in space."
        },
        {
          "principle": "Misconception: All vibrations produce audible sound",
          "statement": "Some think anything vibrating makes sound we can hear.",
          "application": "Vibrations below 20 Hz (infrasound) and above 20,000 Hz (ultrasound) are inaudible to humans.",
          "example": "Dog whistles produce ultrasound—we can't hear them, but dogs can."
        }
      ]
    }
  ],
  "key_terms": [
    "Sound wave",
    "Longitudinal wave",
    "Compression",
    "Rarefaction",
    "Medium",
    "Vibration",
    "Pitch",
    "Frequency",
    "Hertz (Hz)",
    "Amplitude",
    "Loudness",
    "Decibel (dB)",
    "Infrasound",
    "Ultrasound",
    "Echo",
    "Diffraction",
    "Refraction",
    "Interference"
  ],
  "summary": "Sound is a longitudinal mechanical wave that requires a medium (solid, liquid, or gas) to travel. It's produced by vibrating objects, which create alternating compressions (high pressure) and rarefactions (low pressure) that travel through the medium. Particles vibrate in place, passing energy along without traveling themselves. Sound speed depends on the medium: fastest in solids (~5000 m/s in steel), slower in liquids (~1500 m/s in water), slowest in gases (~340 m/s in air). Frequency determines pitch: higher frequency = higher pitch. Human hearing ranges from about 20 Hz to 20,000 Hz—below is infrasound, above is ultrasound. Amplitude determines loudness: larger amplitude = louder sound, measured in decibels (dB). Sound waves exhibit reflection (echoes), refraction (bending in temperature gradients), diffraction (bending around obstacles), and interference (combining waves). Understanding sound explains everything from musical instrument design and concert hall acoustics to animal communication and noise pollution. This foundation prepares us for exploring sound properties in detail in the next section: pitch, loudness, and quality."
}
