{
  "expanded_description": "This section introduces the key measurable characteristics of waves: amplitude, wavelength, and frequency. Students will learn how these properties describe wave behavior and how they relate to wave energy and perception of waves in everyday contexts like sound and light.",
  "core_concept": {
    "principle": "Every wave has three fundamental properties: amplitude (height), wavelength (length of one cycle), and frequency (how often waves pass). These properties determine the wave's energy, appearance, and behavior.",
    "explanation": "Imagine ocean waves rolling toward shore. Some are tall (large amplitude), some are spaced far apart (long wavelength), and some arrive frequently (high frequency). These three measurements completely describe the wave's character—whether it's gentle ripples or powerful surf, deep bass notes or high-pitched sounds.",
    "image": {
      "src": "images/unit8/wave_properties_labeled.png",
      "alt": "Diagram of a wave showing amplitude (height from midpoint to crest), wavelength (distance between crests), and a wave passing a point to illustrate frequency",
      "caption": "Amplitude, wavelength, and frequency are the three key measurements that describe any wave"
    }
  },
  "sections": [
    {
      "section_title": "Amplitude: The Height of the Wave",
      "introduction": "When you see waves, one of the first things you notice is how big they are—are they gentle ripples or towering surges? That \"bigness\" is amplitude.",
      "key_concept": {
        "definition": "Amplitude is the maximum displacement of a wave from its rest (equilibrium) position. It measures how far the wave disturbs the medium.",
        "context": "For a water wave, amplitude is the height from flat water to wave crest. For a sound wave, amplitude corresponds to loudness. For light, amplitude relates to brightness."
      },
      "principles": [
        {
          "principle": "Measuring Amplitude",
          "statement": "Amplitude is measured from the equilibrium (middle) position to the crest (top) or trough (bottom). The distance is the same in either direction.",
          "application": "On a graph of a wave, amplitude is the vertical distance from the center line to the peak.",
          "example": "If calm water is at 0 cm, and a wave crest rises to +5 cm, the amplitude is 5 cm. The trough would be at -5 cm.",
          "analogy": "Think of amplitude like the volume knob on a radio—turn it up, amplitude increases; turn it down, amplitude decreases."
        },
        {
          "principle": "Amplitude and Energy",
          "statement": "The energy carried by a wave is proportional to the square of its amplitude. Double the amplitude, and you quadruple the energy!",
          "application": "This relationship explains why big waves are so much more powerful than small ones, and why loud sounds carry much more energy than quiet ones.",
          "example": "A sound wave with 2× larger amplitude carries 4× more energy. That's why turning up the volume slightly can make a big difference in power consumption.",
          "analogy": "It's like the difference between a gentle breeze (small amplitude) and a hurricane-force wind (large amplitude)—the energy difference is enormous!"
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Amplitude",
          "problem": "A wave on a graph shows crests at +3 cm and troughs at -3 cm. What is the amplitude?",
          "step_by_step": [
            {
              "step": "Recall definition",
              "explanation": "Amplitude is distance from equilibrium to crest (or trough)."
            },
            {
              "step": "Find equilibrium",
              "explanation": "Equilibrium is halfway between crest and trough: (+3 + -3)/2 = 0 cm."
            },
            {
              "step": "Measure to crest",
              "explanation": "From 0 cm to +3 cm = 3 cm."
            }
          ],
          "final_answer": "The amplitude is 3 cm.",
          "concept_applied": "Amplitude is the maximum displacement from rest position."
        },
        {
          "title": "Energy Comparison",
          "problem": "Wave A has amplitude 2 cm, Wave B has amplitude 6 cm. How much more energy does Wave B carry?",
          "step_by_step": [
            {
              "step": "Recall relationship",
              "explanation": "Energy ∝ amplitude²"
            },
            {
              "step": "Calculate ratio of amplitudes",
              "explanation": "Wave B amplitude ÷ Wave A amplitude = 6 ÷ 2 = 3"
            },
            {
              "step": "Square the ratio",
              "explanation": "Energy ratio = 3² = 9"
            }
          ],
          "final_answer": "Wave B carries 9 times more energy than Wave A.",
          "concept_applied": "Energy is proportional to the square of amplitude."
        }
      ]
    },
    {
      "section_title": "Wavelength: The Length of One Cycle",
      "introduction": "Look at waves on the ocean—some come close together, others are far apart. That spacing is wavelength, and it's a fundamental property of every wave.",
      "key_concept": {
        "definition": "Wavelength (symbolized by the Greek letter lambda, λ) is the distance between two consecutive corresponding points on a wave—usually measured from crest to crest or trough to trough.",
        "context": "Wavelength determines the \"size\" of one complete wave cycle. In sound, wavelength relates to pitch; in light, wavelength determines color."
      },
      "principles": [
        {
          "principle": "Measuring Wavelength",
          "statement": "Choose any two identical points on neighboring waves—the distance between them is the wavelength.",
          "application": "Common reference points: crest-to-crest, trough-to-trough, or even from where the wave crosses the equilibrium line going up to the next time it crosses going up.",
          "example": "Measure from the top of one wave to the top of the next—that distance is the wavelength.",
          "analogy": "Think of wavelength like the spacing between rungs on a ladder—close together means short wavelength, far apart means long wavelength."
        },
        {
          "principle": "Wavelength Units",
          "statement": "Wavelength is a distance, so it's measured in meters (m), centimeters (cm), or even nanometers (nm) for light waves.",
          "application": "Different types of waves have vastly different wavelengths:",
          "example": "Radio waves can have wavelengths of kilometers; visible light has wavelengths around 500 nanometers (billionths of a meter); sound waves in air range from centimeters to meters."
        }
      ],
      "classifications": [
        {
          "type": "Long Wavelength",
          "value": "Large distance between wave cycles",
          "characteristics": [
            "Low frequency (fewer waves pass per second)",
            "Low pitch sounds (bass)",
            "Red/infrared light"
          ],
          "behavior": "Long wavelengths bend more around obstacles (diffract more easily).",
          "examples": [
            {
              "process": "Bass notes",
              "explanation": "Deep bass sounds have long wavelengths—that's why you can hear bass through walls more easily than high notes."
            },
            {
              "process": "Radio waves",
              "explanation": "AM radio has long wavelengths (hundreds of meters) that can bend around hills."
            }
          ]
        },
        {
          "type": "Short Wavelength",
          "value": "Small distance between wave cycles",
          "characteristics": [
            "High frequency (many waves pass per second)",
            "High pitch sounds (treble)",
            "Blue/violet light"
          ],
          "behavior": "Short wavelengths are more directional and don't bend as much around obstacles.",
          "examples": [
            {
              "process": "Treble notes",
              "explanation": "High-pitched sounds have short wavelengths—they're more directional and easily blocked."
            },
            {
              "process": "Visible light",
              "explanation": "Light has very short wavelengths—that's why it travels in straight lines and creates sharp shadows."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/wavelength_comparison.png",
        "alt": "Two waves shown: one with long wavelength (widely spaced crests) and one with short wavelength (closely spaced crests)",
        "caption": "Long wavelength waves have widely spaced crests; short wavelength waves have closely spaced crests"
      }
    },
    {
      "section_title": "Frequency: How Often Waves Pass",
      "introduction": "Stand at the shore and count how many waves arrive each minute—that's frequency. It tells you how rapidly the wave source is vibrating.",
      "key_concept": {
        "definition": "Frequency (symbolized by f) is the number of complete wave cycles that pass a point per unit of time. It's measured in hertz (Hz), where 1 Hz = 1 cycle per second.",
        "context": "Frequency tells us how fast the wave source is vibrating. Higher frequency means more vibrations per second."
      },
      "principles": [
        {
          "principle": "The Hertz Unit",
          "statement": "1 hertz = 1 cycle per second. If 10 waves pass each second, frequency = 10 Hz.",
          "application": "Frequency is directly related to what we perceive:",
          "example": "Middle C on a piano has frequency about 262 Hz—the sound source vibrates 262 times every second!",
          "analogy": "Frequency is like the blinking rate of a flashlight—fast blinking means high frequency."
        },
        {
          "principle": "Frequency and Period",
          "statement": "The period (T) is the time for one complete cycle. Frequency and period are inverses: $f = 1/T$ and $T = 1/f$.",
          "application": "If a wave has frequency 100 Hz, each cycle takes 1/100 = 0.01 seconds.",
          "example": "A slow wave with frequency 2 Hz has period 0.5 seconds—half a second per wave.",
          "analogy": "If you blink 4 times per second (frequency 4 Hz), each blink takes 0.25 seconds (period)."
        }
      ],
      "worked_examples": [
        {
          "title": "Finding Frequency",
          "problem": "30 wave crests pass a point in 6 seconds. What is the frequency?",
          "step_by_step": [
            {
              "step": "Recall definition",
              "explanation": "Frequency = number of cycles ÷ time"
            },
            {
              "step": "Insert values",
              "explanation": "30 cycles ÷ 6 seconds = 5 cycles/second"
            }
          ],
          "final_answer": "The frequency is 5 Hz.",
          "concept_applied": "Frequency is cycles per second."
        },
        {
          "title": "Finding Period from Frequency",
          "problem": "A wave has frequency 20 Hz. What is its period?",
          "step_by_step": [
            {
              "step": "Recall relationship",
              "explanation": "$T = 1/f$"
            },
            {
              "step": "Insert value",
              "explanation": "$T = 1/20 = 0.05$ seconds"
            }
          ],
          "final_answer": "The period is 0.05 seconds (50 milliseconds).",
          "concept_applied": "Period is the inverse of frequency."
        },
        {
          "title": "Finding Cycles from Frequency",
          "problem": "A wave with frequency 50 Hz passes for 3 seconds. How many complete cycles occur?",
          "step_by_step": [
            {
              "step": "Recall relationship",
              "explanation": "Number of cycles = frequency × time"
            },
            {
              "step": "Insert values",
              "explanation": "50 Hz × 3 s = 150 cycles"
            }
          ],
          "final_answer": "150 complete cycles occur.",
          "concept_applied": "Total cycles = frequency × time."
        }
      ]
    },
    {
      "section_title": "The Relationship Between Properties",
      "introduction": "Amplitude, wavelength, and frequency are independent of each other—you can change one without affecting the others. But they do relate through wave speed.",
      "principles": [
        {
          "principle": "Amplitude Independence",
          "statement": "Amplitude doesn't affect wavelength or frequency—it's a separate property.",
          "application": "You can have tall waves or short waves with the same wavelength and frequency. Amplitude only affects energy.",
          "example": "Shout louder (increase amplitude) without changing pitch (frequency stays same). The wavelength also stays the same."
        },
        {
          "principle": "Wavelength-Frequency Relationship",
          "statement": "For a given wave speed, wavelength and frequency are inversely related: higher frequency means shorter wavelength.",
          "application": "This is why high-pitched sounds (high frequency) have short wavelengths, and low-pitched sounds have long wavelengths.",
          "example": "A violin (high frequency) produces short waves; a bass guitar (low frequency) produces long waves.",
          "note": "The exact relationship is $v = fλ$, which we'll explore in Section 8.4."
        }
      ],
      "image": {
        "src": "images/unit8/wave_properties_relationship.png",
        "alt": "Diagram showing waves with same amplitude but different wavelengths, and waves with same wavelength but different amplitudes",
        "caption": "Amplitude and wavelength can vary independently—they're separate properties"
      }
    },
    {
      "section_title": "Wave Properties in Sound and Light",
      "introduction": "The same three properties—amplitude, wavelength, frequency—describe all waves, but they affect our perception differently depending on the wave type.",
      "classifications": [
        {
          "type": "Sound Waves",
          "value": "Our ears detect these properties as loudness and pitch",
          "characteristics": [
            "Amplitude → Loudness (volume)",
            "Frequency → Pitch (high vs low notes)",
            "Wavelength → Related to pitch (inversely)"
          ],
          "behavior": "Larger amplitude = louder sound. Higher frequency = higher pitch.",
          "examples": [
            {
              "process": "Loud vs soft",
              "explanation": "A drum hit hard (large amplitude) produces a loud sound; same drum hit gently (small amplitude) produces a soft sound."
            },
            {
              "process": "High vs low pitch",
              "explanation": "A flute produces high-frequency waves (high pitch); a tuba produces low-frequency waves (low pitch)."
            }
          ]
        },
        {
          "type": "Light Waves",
          "value": "Our eyes detect these properties as brightness and color",
          "characteristics": [
            "Amplitude → Brightness (intensity)",
            "Frequency → Color (hue)",
            "Wavelength → Also determines color"
          ],
          "behavior": "Larger amplitude = brighter light. Higher frequency = toward blue end of spectrum; lower frequency = toward red end.",
          "examples": [
            {
              "process": "Bright vs dim",
              "explanation": "A bright light has large amplitude waves; a dim light has small amplitude waves."
            },
            {
              "process": "Red vs blue",
              "explanation": "Red light has long wavelength (low frequency); blue light has short wavelength (high frequency)."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit8/sound_light_perception.png",
        "alt": "Comparison showing how amplitude and frequency affect perception of sound (loudness/pitch) and light (brightness/color)",
        "caption": "Amplitude and frequency affect our perception differently for sound and light"
      }
    },
    {
      "section_title": "Real-World Examples of Wave Properties",
      "introduction": "Understanding amplitude, wavelength, and frequency helps explain countless everyday phenomena.",
      "categories": [
        {
          "type": "Music and Audio",
          "description": "Musicians and audio engineers work with wave properties constantly.",
          "examples": [
            {
              "process": "Equalizers",
              "explanation": "Audio equalizers adjust amplitude at different frequencies—boosting bass (low frequencies) or treble (high frequencies)."
            },
            {
              "process": "Musical instruments",
              "explanation": "Different instruments produce different combinations of frequencies (timbre) and amplitudes (volume)."
            },
            {
              "process": "Hearing protection",
              "explanation": "Loud sounds (large amplitude) can damage hearing—especially dangerous at certain frequencies."
            }
          ]
        },
        {
          "type": "Communication",
          "description": "Radio and TV use different frequencies for different channels.",
          "examples": [
            {
              "process": "AM vs FM radio",
              "explanation": "AM radio uses lower frequencies (longer wavelengths) that travel farther; FM uses higher frequencies with better sound quality."
            },
            {
              "process": "Wi-Fi channels",
              "explanation": "Different Wi-Fi bands (2.4 GHz vs 5 GHz) are different frequencies—5 GHz is faster but doesn't travel through walls as well."
            }
          ]
        },
        {
          "type": "Nature",
          "description": "Wave properties appear throughout the natural world.",
          "examples": [
            {
              "process": "Earthquake waves",
              "explanation": "Different seismic wave frequencies cause different types of ground motion—scientists analyze these to understand earthquakes."
            },
            {
              "process": "Animal communication",
              "explanation": "Elephants use very low frequency sounds (infrasound) that travel long distances; bats use very high frequency sounds (ultrasound) for echolocation."
            },
            {
              "process": "Ocean waves",
              "explanation": "Storm waves have large amplitude and carry enormous energy; gentle ripples have small amplitude."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Simple Experiments to Explore Wave Properties",
      "introduction": "You can investigate amplitude, wavelength, and frequency with simple materials.",
      "process_flow": [
        {
          "step": "1",
          "process": "Rope waves",
          "description": "Tie one end of a rope to a fixed point. Hold the other end.",
          "mechanism": "Move your hand up and down slowly to create waves. Observe wavelength and amplitude.",
          "result": "Moving faster increases frequency (more waves per second) and decreases wavelength. Moving your hand higher increases amplitude.",
          "applications": [
            "See how frequency and wavelength relate",
            "Observe that amplitude is independent",
            "Feel how more amplitude takes more energy"
          ]
        },
        {
          "step": "2",
          "process": "Water wave tank",
          "description": "Use a shallow pan of water. Create waves by tapping the surface.",
          "mechanism": "Tap gently for small amplitude; tap harder for larger amplitude. Tap faster for higher frequency.",
          "result": "Observe how ripples change with different tapping. Use a ruler to estimate wavelength.",
          "applications": [
            "Measure approximate wavelength",
            "Observe amplitude affecting wave energy",
            "Count waves per minute for frequency"
          ]
        },
        {
          "step": "3",
          "process": "Sound wave demonstration",
          "description": "Use a tuning fork or musical instrument.",
          "mechanism": "Strike a tuning fork and observe. Listen to pitch (frequency) and volume (amplitude).",
          "result": "Different tuning forks produce different frequencies. Hitting harder increases amplitude (volume) without changing pitch.",
          "applications": [
            "Hear that pitch depends on frequency",
            "Notice amplitude affects loudness only",
            "Different instruments have different wave patterns"
          ]
        }
      ]
    },
    {
      "section_title": "Practice Problems",
      "introduction": "Apply your understanding of amplitude, wavelength, and frequency.",
      "worked_examples": [
        {
          "title": "Problem 1: Finding Amplitude",
          "problem": "A wave on a graph has crests at +8 cm and troughs at -8 cm. What is the amplitude?",
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "Equilibrium is midway: (+8 + -8)/2 = 0 cm"
            },
            {
              "step": "Measure to crest",
              "explanation": "From 0 cm to +8 cm = 8 cm"
            }
          ],
          "final_answer": "The amplitude is 8 cm.",
          "concept_applied": "Amplitude is maximum displacement from equilibrium."
        },
        {
          "title": "Problem 2: Finding Wavelength",
          "problem": "You measure the distance between 5 consecutive wave crests as 2 meters. What is the wavelength?",
          "step_by_step": [
            {
              "step": "Understand what was measured",
              "explanation": "Between 5 crests there are 4 wavelengths (crest 1 to 2, 2 to 3, 3 to 4, 4 to 5)"
            },
            {
              "step": "Calculate wavelength",
              "explanation": "2 meters ÷ 4 wavelengths = 0.5 meters per wavelength"
            }
          ],
          "final_answer": "The wavelength is 0.5 m.",
          "concept_applied": "Wavelength is distance between consecutive identical points."
        },
        {
          "title": "Problem 3: Finding Frequency",
          "problem": "40 wave cycles pass a point in 8 seconds. What is the frequency?",
          "step_by_step": [
            {
              "step": "Use frequency formula",
              "explanation": "$f = \\text{cycles} / \\text{time}$"
            },
            {
              "step": "Insert values",
              "explanation": "$f = 40 \\div 8 = 5$ Hz"
            }
          ],
          "final_answer": "The frequency is 5 Hz.",
          "concept_applied": "Frequency is cycles per second."
        },
        {
          "title": "Problem 4: Finding Period",
          "problem": "A wave has frequency 25 Hz. What is its period?",
          "step_by_step": [
            {
              "step": "Use period formula",
              "explanation": "$T = 1/f$"
            },
            {
              "step": "Insert value",
              "explanation": "$T = 1/25 = 0.04$ seconds"
            }
          ],
          "final_answer": "The period is 0.04 seconds.",
          "concept_applied": "Period is the inverse of frequency."
        },
        {
          "title": "Problem 5: Energy Comparison",
          "problem": "Wave A has amplitude 3 cm, Wave B has amplitude 9 cm. How many times more energy does Wave B carry?",
          "step_by_step": [
            {
              "step": "Recall energy relationship",
              "explanation": "$E \\propto A^2$"
            },
            {
              "step": "Find amplitude ratio",
              "explanation": "$9 \\div 3 = 3$"
            },
            {
              "step": "Square the ratio",
              "explanation": "$3^2 = 9$"
            }
          ],
          "final_answer": "Wave B carries 9 times more energy.",
          "concept_applied": "Energy is proportional to amplitude squared."
        },
        {
          "title": "Problem 6: Complete Wave Description",
          "problem": "A wave has frequency 10 Hz, amplitude 0.2 m, and wavelength 0.5 m. How many cycles occur in 3 seconds? What is the period?",
          "step_by_step": [
            {
              "step": "Find cycles from frequency",
              "explanation": "Cycles = $f \\times t = 10 \\times 3 = 30$ cycles"
            },
            {
              "step": "Find period",
              "explanation": "$T = 1/f = 1/10 = 0.1$ seconds"
            }
          ],
          "final_answer": "30 cycles occur; the period is 0.1 seconds.",
          "concept_applied": "Using frequency to find both total cycles and period."
        }
      ]
    },
    {
      "section_title": "Common Misconceptions",
      "introduction": "Here are frequent misunderstandings about wave properties.",
      "principles": [
        {
          "principle": "Misconception: Amplitude affects wave speed",
          "statement": "Students sometimes think bigger waves travel faster.",
          "application": "Wave speed depends on the medium, not amplitude. Bigger waves carry more energy but don't move faster.",
          "example": "Ocean waves don't arrive at shore faster just because they're taller—they travel at the same speed as smaller waves."
        },
        {
          "principle": "Misconception: Frequency and wavelength are the same thing",
          "statement": "Some confuse frequency (how often) with wavelength (how long).",
          "application": "They're related but different: frequency is cycles per second (time), wavelength is distance per cycle (space).",
          "example": "High frequency means many cycles per second, which means short wavelength—but they're not the same measurement."
        },
        {
          "principle": "Misconception: Amplitude is measured from crest to trough",
          "statement": "Students often measure from bottom to top instead of from equilibrium.",
          "application": "Amplitude is half the total height from trough to crest. Crest-to-trough distance is twice the amplitude.",
          "example": "If a wave goes from -4 cm to +4 cm, amplitude is 4 cm, not 8 cm."
        },
        {
          "principle": "Misconception: All waves of same frequency have same amplitude",
          "statement": "Some think frequency determines amplitude.",
          "application": "Frequency and amplitude are independent. You can have loud high notes (high frequency, high amplitude) or soft high notes (high frequency, low amplitude).",
          "example": "A flute can play the same note (same frequency) loudly or softly (different amplitude)."
        }
      ]
    }
  ],
  "key_terms": [
    "Amplitude",
    "Wavelength",
    "Frequency",
    "Hertz (Hz)",
    "Period",
    "Crest",
    "Trough",
    "Equilibrium",
    "Cycle",
    "Energy and amplitude",
    "λ (lambda)",
    "$f = 1/T$",
    "$T = 1/f$"
  ],
  "summary": "Every wave is described by three fundamental properties: amplitude, wavelength, and frequency. Amplitude is the maximum displacement from equilibrium—it determines the wave's energy (energy ∝ amplitude²) and, for sound and light, corresponds to loudness and brightness. Wavelength (λ) is the distance between consecutive identical points on a wave—it determines, along with frequency, the type of wave and how it interacts with obstacles. Frequency (f) is the number of complete cycles per second, measured in hertz (Hz)—it determines pitch in sound and color in light. Frequency and period are inverses: $f = 1/T$ and $T = 1/f$. These properties are independent: you can change amplitude without affecting frequency or wavelength. Understanding amplitude, wavelength, and frequency is essential for describing waves quantitatively and prepares us for calculating wave speed using the wave equation $v = fλ$ in the next section."
}
