{
  "title": "9.7 Causes of Inflation",
  "expanded_description": "Comprehensive analysis of the fundamental causes of inflation, focusing on demand-pull and cost-push mechanisms, and examining how different economic conditions and policies generate sustained increases in the general price level.",
  "core_concept": {
    "principle": "Inflation arises from two primary mechanisms: demand-pull inflation occurs when aggregate demand exceeds the economy's productive capacity, while cost-push inflation results from increases in production costs that force businesses to raise prices. Both mechanisms can interact through expectations and institutional factors to create sustained inflationary pressures.",
    "explanation": "Understanding the distinct causes of inflation is crucial for designing appropriate policy responses. Demand-pull inflation typically requires demand management policies, while cost-push inflation presents more difficult policy trade-offs between inflation control and economic output.",
    "image": {
      "url": "/images/economics/causes-inflation.svg",
      "alt": "Causes of Inflation",
      "caption": "Demand-pull and cost-push mechanisms driving price increases"
    }
  },
  "sections": [
    {
      "section_title": "Demand-Pull Inflation",
      "introduction": "Examining how excessive aggregate demand relative to productive capacity creates upward pressure on prices across the economy.",
      "key_concept": {
        "definition": "Demand-pull inflation occurs when total spending in the economy (aggregate demand) grows faster than the economy's ability to produce goods and services (aggregate supply), creating a situation where 'too much money chases too few goods.' This typically happens during economic booms when resources are fully utilized.",
        "context": "Demand-pull inflation is associated with strong economic growth, low unemployment, and capacity constraints. It represents the classic inflation scenario described by the Phillips curve trade-off between inflation and unemployment.",
        "image": {
          "url": "/images/economics/demand-pull-inflation.svg",
          "alt": "Demand-Pull Inflation",
          "caption": "How excess aggregate demand creates inflationary pressures"
        }
      },
      "classifications": [
        {
          "type": "Sources of Excess Demand",
          "value": "Components of aggregate demand driving inflation",
          "characteristics": ["Consumer Spending", "Investment Boom", "Government Expenditure", "Net Exports"],
          "behavior": "Any component of aggregate demand can initiate demand-pull inflation if it grows rapidly while the economy operates near full capacity. The specific source influences the inflation's sectoral pattern and persistence.",
          "examples": [
            {
              "process": "Consumer-Led Demand Inflation",
              "explanation": "When households increase consumption spending due to rising confidence, wealth effects, or credit availability, demand for goods and services outpaces production capacity, allowing businesses to raise prices.",
              "image": {
                "url": "/images/economics/consumer-led-demand-inflation.svg",
                "alt": "Consumer-Led Demand Inflation",
                "caption": "Household spending driving price increases"
              }
            },
            {
              "process": "Investment and Government Demand",
              "explanation": "Business investment surges or increased government spending can strain productive capacity, particularly in capital goods and construction sectors, creating broad inflationary pressures as resources are bid away from other uses.",
              "image": {
                "url": "/images/economics/investment-government-demand.svg",
                "alt": "Investment and Government Demand",
                "caption": "Business and public spending contributing to inflation"
              }
            }
          ]
        },
        {
          "type": "Transmission Mechanisms",
          "value": "How excess demand translates to price increases",
          "characteristics": ["Output Gap", "Capacity Constraints", "Labor Market Tightness", "Pricing Power"],
          "behavior": "As the economy approaches and exceeds potential output, production bottlenecks emerge, unemployment falls below natural rates, and businesses gain increased pricing power, enabling sustained price increases.",
          "examples": [
            {
              "process": "Negative Output Gap Dynamics",
              "explanation": "When actual GDP exceeds potential GDP, production constraints force businesses to raise prices rather than increase output. Labor shortages also emerge, pushing up wages that are then passed through to prices.",
              "image": {
                "url": "/images/economics/negative-output-gap-dynamics.svg",
                "alt": "Negative Output Gap Dynamics",
                "caption": "How economic overheating generates inflation"
              }
            },
            {
              "process": "Sectoral Bottlenecks and Spillovers",
              "explanation": "Inflation often begins in specific sectors with limited short-run supply elasticity (like housing or commodities) then spreads through the economy as higher costs in one sector affect production costs in others.",
              "image": {
                "url": "/images/economics/sectoral-bottlenecks-spillovers.svg",
                "alt": "Sectoral Bottlenecks and Spillovers",
                "caption": "How inflation spreads from constrained sectors"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Demand-Pull Inflation Analysis",
          "problem": "Economy at full employment (5% unemployment). Government increases spending by $500B (10% of GDP) without tax increases. Potential GDP = $5T, actual GDP = $5T initially. With spending multiplier of 1.5 and inflation starting when unemployment falls below 4.5%, analyze inflationary impact.",
          "step_by_step": [
            {
              "step": "Calculate Initial Output Gap",
              "explanation": "Compare actual to potential GDP",
              "calculation": "Initial output gap = ($5T - $5T)/$5T = 0%\nEconomy initially at full capacity"
            },
            {
              "step": "Calculate Demand Impact",
              "explanation": "Effect of government spending increase",
              "calculation": "Demand increase = $500B × 1.5 = $750B\nNew aggregate demand = $5T + $0.75T = $5.75T"
            },
            {
              "step": "Calculate New Output Gap",
              "explanation": "Excess demand relative to capacity",
              "calculation": "Output gap = ($5.75T - $5T)/$5T = 15%\nSubstantial positive output gap"
            },
            {
              "step": "Estimate Unemployment Impact",
              "explanation": "Relationship between output and unemployment",
              "calculation": "Okun's Law: 1% output gap ≈ 0.5% unemployment change\nUnemployment decrease = 15% × 0.5 = 7.5 percentage points\nNew unemployment = 5% - 7.5% = -2.5% (theoretical)"
            },
            {
              "step": "Analyze Practical Constraints",
              "explanation": "Real-world limitations on unemployment decline",
              "calculation": "Unemployment cannot fall below ~3-4% practically\nMassive labor shortages would develop\nSubstantial wage and price pressures inevitable"
            },
            {
              "step": "Estimate Inflationary Pressure",
              "explanation": "Magnitude of potential inflation",
              "calculation": "With 15% excess demand, inflation could reach 10-20%\nPhillips curve relationship suggests strong pressure\nCould trigger wage-price spiral"
            },
            {
              "step": "Policy Implications",
              "explanation": "Appropriate policy response",
              "calculation": "Substantial fiscal or monetary tightening needed\nGradual approach to avoid recession\nCoordination between fiscal and monetary authorities"
            }
          ],
          "final_answer": "The $500 billion government spending increase (10% of GDP) with a 1.5 multiplier would create $750 billion in additional aggregate demand, generating a 15% positive output gap. This substantial excess demand would push unemployment far below sustainable levels, creating severe labor shortages and capacity constraints. The economy would experience significant demand-pull inflation, potentially reaching 10-20% annually as businesses raise prices amid excess demand and rising production costs. This scenario demonstrates classic demand-pull inflation where fiscal stimulus applied to an already fully-employed economy creates overwhelming inflationary pressures rather than increased output. Substantial policy tightening would be required to control inflation, though careful implementation would be needed to avoid causing a recession.",
          "concept_applied": "Analysis of demand-pull inflation using output gap calculations, multiplier effects, and labor market relationships, with estimation of inflationary consequences and policy implications.",
          "image": {
            "url": "/images/economics/demand-pull-analysis.svg",
            "alt": "Demand-Pull Inflation Analysis",
            "caption": "Quantifying excess demand and inflationary pressure"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Capacity Constraint Principle",
          "statement": "Demand-pull inflation emerges when the economy bumps against its productive capacity constraints. As resources—particularly labor and capital—become fully utilized, additional demand cannot be met by increased production, leading instead to price increases. This principle explains why inflation typically accelerates when unemployment falls below the natural rate and why there are limits to how much demand stimulus can increase real output in the short run.",
          "application": "This principle guides countercyclical policy, explains the inflation-unemployment tradeoff, and highlights why demand management must consider the economy's position relative to its productive potential.",
          "example": "In the late 1990s U.S. tech boom, unemployment fell below 4% while inflation remained moderate, initially challenging this principle. However, this was explained by temporary productivity gains and global factors that expanded effective capacity.",
          "analogy": "Like a theater that's completely full—no matter how many additional people want to buy tickets (demand), the theater cannot create more seats (supply), so it could raise ticket prices (inflation) instead of turning people away.",
          "image": {
            "url": "/images/economics/capacity-constraint-principle.svg",
            "alt": "Capacity Constraint Principle",
            "caption": "How limited productive capacity generates inflation"
          }
        }
      ]
    },
    {
      "section_title": "Cost-Push Inflation",
      "introduction": "Analyzing how increases in production costs independent of demand conditions create inflationary pressures, often presenting difficult policy dilemmas.",
      "key_concept": {
        "definition": "Cost-push inflation occurs when rising production costs—such as wages, raw materials, or import prices—force businesses to increase prices, even in the absence of excess demand. This can create stagflation, where high inflation coincides with high unemployment and slow growth.",
        "context": "Cost-push inflation presents particular challenges for policymakers because conventional demand-restraint policies to control inflation may worsen unemployment, while accommodation risks embedding inflation expectations.",
        "image": {
          "url": "/images/economics/cost-push-inflation.svg",
          "alt": "Cost-Push Inflation",
          "caption": "How rising production costs drive price increases"
        }
      },
      "classifications": [
        {
          "type": "Sources of Cost Increases",
          "value": "Factors that raise production costs",
          "characteristics": ["Commodity Price Shocks", "Wage Pressures", "Import Prices", "Tax and Regulatory Costs"],
          "behavior": "Cost-push inflation can originate from various sources including supply shocks, institutional wage pressures, exchange rate movements, or government policies that increase business costs.",
          "examples": [
            {
              "process": "Commodity Supply Shocks",
              "explanation": "Sharp increases in key commodity prices—such as oil, food, or industrial materials—raise production costs across multiple sectors, forcing businesses to increase prices even when demand is weak.",
              "image": {
                "url": "/images/economics/commodity-supply-shocks.svg",
                "alt": "Commodity Supply Shocks",
                "caption": "How resource price spikes cause inflation"
              }
            },
            {
              "process": "Wage-Cost Pressures",
              "explanation": "When wages rise faster than productivity, unit labor costs increase. This can occur through strong union bargaining, minimum wage increases, or tight labor markets creating wage pressures beyond productivity growth.",
              "image": {
                "url": "/images/economics/wage-cost-pressures.svg",
                "alt": "Wage-Cost Pressures",
                "caption": "Labor costs driving inflation"
              }
            }
          ]
        },
        {
          "type": "Transmission and Amplification",
          "value": "How cost shocks spread through the economy",
          "characteristics": ["Cost Pass-Through", "Second-Round Effects", "Expectations Channel", "Sectoral Spillovers"],
          "behavior": "Initial cost increases are transmitted through production chains and can be amplified through expectations and institutional responses, particularly when central banks face difficult trade-offs between inflation control and output stabilization.",
          "examples": [
            {
              "process": "Supply Chain Transmission",
              "explanation": "Cost increases in upstream industries (like energy or raw materials) are passed through to downstream producers and ultimately to consumers, creating broad-based inflation even when the initial shock was sector-specific.",
              "image": {
                "url": "/images/economics/supply-chain-transmission.svg",
                "alt": "Supply Chain Transmission",
                "caption": "How cost shocks propagate through the economy"
              }
            },
            {
              "process": "Wage-Price Spiral Dynamics",
              "explanation": "When workers demand higher wages to compensate for inflation, and businesses pass these costs to consumers through higher prices, a self-reinforcing cycle can develop that sustains inflation even after the initial shock dissipates.",
              "image": {
                "url": "/images/economics/wage-price-spiral-dynamics.svg",
                "alt": "Wage-Price Spiral Dynamics",
                "caption": "Self-reinforcing cycle of wages and prices"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Cost-Push Inflation Analysis",
          "problem": "Oil price doubles from $60 to $120/barrel. Economy uses 0.5 barrels of oil per $1000 of GDP. Initial inflation = 2%, unemployment = 6%. With 50% cost pass-through and wage-price spiral starting if inflation exceeds 4%, analyze impact.",
          "step_by_step": [
            {
              "step": "Calculate Direct Oil Cost Impact",
              "explanation": "Increased energy costs as percentage of GDP",
              "calculation": "Oil cost/GDP = 0.5 barrels × $120 = $60 per $1000 = 6% of GDP\nPrevious cost = 0.5 × $60 = $30 (3% of GDP)\nIncrease = 3% of GDP additional cost"
            },
            {
              "step": "Calculate Initial Price Impact",
              "explanation": "Direct inflation from cost pass-through",
              "calculation": "With 50% pass-through: 3% × 0.5 = 1.5% additional inflation\nNew inflation = 2% + 1.5% = 3.5%"
            },
            {
              "step": "Analyze Second-Round Effects",
              "explanation": "Indirect impacts through production chains",
              "calculation": "Transportation, plastics, chemicals costs rise\nAdditional 0.5-1.0% inflation possible\nPotential inflation: 4.0-4.5%"
            },
            {
              "step": "Evaluate Wage-Price Spiral Risk",
              "explanation": "Threshold for sustained inflation dynamics",
              "calculation": "Inflation threshold = 4%\nProjected inflation (4.0-4.5%) above threshold\nWage-price spiral risk: High"
            },
            {
              "step": "Estimate Spiral Amplification",
              "explanation": "Potential inflation acceleration from spiral",
              "calculation": "If workers demand 4% wage increases\nBusinesses pass through costs\nInflation could rise to 5-6% sustained"
            },
            {
              "step": "Analyze Policy Dilemma",
              "explanation": "Challenges for monetary policy",
              "calculation": "Tightening to control inflation: worsens unemployment\nAccommodation: risks embedded inflation\nClassic stagflation dilemma"
            },
            {
              "step": "Calculate Output and Employment Impact",
              "explanation": "Effect on real economic activity",
              "calculation": "Higher costs reduce production\nUnemployment may rise to 6.5-7.0%\nReal GDP growth reduced 1-2%"
            }
          ],
          "final_answer": "The oil price doubling from $60 to $120 would directly increase production costs by 3% of GDP. With 50% cost pass-through, this generates 1.5% additional inflation, raising the inflation rate from 2% to 3.5%. Second-round effects through supply chains could push inflation to 4.0-4.5%, breaching the 4% threshold that risks triggering a wage-price spiral. If such a spiral develops, sustained inflation of 5-6% is possible. Meanwhile, the cost shock would reduce real GDP growth by 1-2% and increase unemployment to 6.5-7.0%, creating classic stagflation conditions. Policymakers face a severe dilemma: tightening policy to control inflation would worsen unemployment, while accommodation risks embedding high inflation expectations. This demonstrates the particularly challenging nature of cost-push inflation compared to demand-pull inflation.",
          "concept_applied": "Analysis of cost-push inflation from commodity price shocks, calculation of direct and indirect inflationary impacts, assessment of wage-price spiral risks, and examination of the policy dilemmas created by stagflation conditions.",
          "image": {
            "url": "/images/economics/cost-push-analysis.svg",
            "alt": "Cost-Push Inflation Analysis",
            "caption": "Quantifying cost shocks and their inflationary consequences"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Policy Dilemma Principle",
          "statement": "Cost-push inflation creates a fundamental policy dilemma because the tools to control inflation (demand restraint) exacerbate the output and employment losses caused by the supply shock, while accommodating the inflation risks embedding expectations of higher inflation. This trade-off explains why cost-push inflation is particularly damaging and difficult to manage compared to demand-pull inflation.",
          "application": "This principle explains the severe challenges of 1970s stagflation, why central banks sometimes 'look through' temporary supply shocks, and how inflation expectations management becomes crucial during cost-push episodes.",
          "example": "During the 1970s oil shocks, the Federal Reserve initially accommodated the inflation to avoid worsening unemployment, but this embedded high inflation expectations that later required extremely painful monetary tightening to reverse.",
          "analogy": "Like being between a rock and a hard place—policymakers facing cost-push inflation must choose between accepting higher inflation (the rock) or causing higher unemployment (the hard place), with no painless options available.",
          "image": {
            "url": "/images/economics/policy-dilemma-principle.svg",
            "alt": "Policy Dilemma Principle",
            "caption": "The difficult trade-offs in cost-push inflation"
          }
        }
      ]
    },
    {
      "section_title": "Built-In and Expectations-Driven Inflation",
      "introduction": "Examining how inflation can become self-sustaining through expectations, institutional arrangements, and inertial patterns independent of current economic conditions.",
      "key_concept": {
        "definition": "Built-in inflation occurs when expectations of future inflation become embedded in economic decisions—particularly wage and price setting—creating a self-perpetuating cycle. This inflation inertia can persist even after the initial causes have disappeared, making disinflation economically costly.",
        "context": "Understanding expectations-driven inflation is crucial because it explains why inflation can be persistent, why central bank credibility matters, and why reducing established inflation often requires creating economic slack.",
        "image": {
          "url": "/images/economics/built-in-inflation.svg",
          "alt": "Built-In and Expectations-Driven Inflation",
          "caption": "How expectations and institutions sustain inflation"
        }
      },
      "classifications": [
        {
          "type": "Inflation Expectations Mechanisms",
          "value": "How expectations influence actual inflation",
          "characteristics": ["Adaptive Expectations", "Wage Indexation", "Price Setting Behavior", "Central Bank Credibility"],
          "behavior": "When businesses, workers, and consumers expect continued inflation, they build these expectations into price and wage decisions, contracts, and financial arrangements, making expected inflation self-fulfilling.",
          "examples": [
            {
              "process": "Adaptive Expectations Formation",
              "explanation": "If people form expectations based on recent inflation experience, any temporary inflation can become persistent as expectations adjust upward, feeding into wage and price decisions for the next period.",
              "image": {
                "url": "/images/economics/adaptive-expectations-formation.svg",
                "alt": "Adaptive Expectations Formation",
                "caption": "How past inflation influences future expectations"
              }
            },
            {
              "process": "Wage and Price Setting Institutions",
              "explanation": "Multi-year wage contracts with cost-of-living adjustments, scheduled price increases in long-term contracts, and institutionalized pricing practices can build inflation inertia into the economic structure.",
              "image": {
                "url": "/images/economics/wage-price-setting-institutions.svg",
                "alt": "Wage and Price Setting Institutions",
                "caption": "How contractual arrangements sustain inflation"
              }
            }
          ]
        },
        {
          "type": "Inflation Persistence Factors",
          "value": "Why inflation tends to persist once established",
          "characteristics": ["Menu Costs", "Coordination Problems", "Institutional Rigidities", "Credibility Gaps"],
          "behavior": "Various economic frictions and institutional factors make inflation difficult to reduce once established, including the costs of changing prices, difficulties in coordinating expectations, and lack of policy credibility.",
          "examples": [
            {
              "process": "Menu Cost Dynamics",
              "explanation": "The costs of changing prices mean businesses adjust prices infrequently. When they do adjust, they incorporate expected future inflation, building persistence into the price level even if current conditions change.",
              "image": {
                "url": "/images/economics/menu-cost-dynamics.svg",
                "alt": "Menu Cost Dynamics",
                "caption": "How price adjustment costs create inertia"
              }
            },
            {
              "process": "Central Bank Credibility Gaps",
              "explanation": "If the public doubts the central bank's commitment to low inflation, they will maintain high inflation expectations, making actual inflation more persistent and requiring more severe policy to reduce it.",
              "image": {
                "url": "/images/economics/central-bank-credibility-gaps.svg",
                "alt": "Central Bank Credibility Gaps",
                "caption": "How policy credibility affects inflation persistence"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Inflation Expectations Analysis",
          "problem": "Economy has 6% inflation. Inflation expectations are adaptive: expected inflation = 0.7 × past inflation + 0.3 × target. Central bank target = 2%. Wage growth = expected inflation + 1%. Analyze persistence and disinflation costs.",
          "step_by_step": [
            {
              "step": "Calculate Current Inflation Expectations",
              "explanation": "Expected inflation based on adaptive formula",
              "calculation": "Expected inflation = 0.7 × 6% + 0.3 × 2% = 4.2% + 0.6% = 4.8%"
            },
            {
              "step": "Calculate Wage Growth Implications",
              "explanation": "How expectations affect wage settlements",
              "calculation": "Wage growth = 4.8% + 1% = 5.8%\nSubstantially above productivity growth\nBuilt-in cost pressure"
            },
            {
              "step": "Project Inflation Persistence",
              "explanation": "How long high inflation might continue",
              "calculation": "If wages grow 5.8% with 2% productivity\nUnit labor costs rise ~3.8%\nInflation likely to persist around 4-5%"
            },
            {
              "step": "Calculate Sacrifice Ratio",
              "explanation": "Cost of reducing inflation",
              "calculation": "Typical sacrifice ratio: 1% unemployment for 1 year reduces inflation 0.5%\nTo reduce from 6% to 2%: 4 percentage points\nRequired unemployment: 4/0.5 = 8 percentage point-years"
            },
            {
              "step": "Estimate Economic Cost",
              "explanation": "Output loss from disinflation",
              "calculation": "Okun's Law: 1% unemployment ≈ 2% output gap\n8 percentage point-years unemployment ≈ 16% of annual GDP lost\nSubstantial economic cost"
            },
            {
              "step": "Analyze Credibility Solutions",
              "explanation": "How credibility could reduce costs",
              "calculation": "If expectations immediately adjusted to 2% target\nWage growth = 2% + 1% = 3%\nMuch smaller built-in pressure\nDisinflation could occur with minimal output loss"
            },
            {
              "step": "Policy Recommendations",
              "explanation": "Optimal approach to disinflation",
              "calculation": "Clear communication of 2% target\nConsistent policy actions\nPossible temporary incomes policies\nGradual but credible approach"
            }
          ],
          "final_answer": "With current 6% inflation, adaptive expectations produce 4.8% expected inflation, which feeds into 5.8% wage growth—creating built-in inflation pressure that would maintain inflation around 4-5% even without excess demand. Reducing inflation to the 2% target through conventional demand restraint would require approximately 8 percentage point-years of excess unemployment, costing about 16% of annual GDP in lost output due to the high sacrifice ratio. However, if the central bank could immediately establish credibility and anchor expectations at the 2% target, wage growth would fall to 3%, allowing much less costly disinflation. This demonstrates the crucial role of central bank credibility in managing inflation expectations and reducing the real economic costs of disinflationary policies.",
          "concept_applied": "Analysis of inflation expectations formation, calculation of built-in inflation pressures, estimation of disinflation costs through sacrifice ratios, and examination of how policy credibility affects the inflation-output tradeoff.",
          "image": {
            "url": "/images/economics/expectations-analysis.svg",
            "alt": "Inflation Expectations Analysis",
            "caption": "How expectations create inflation persistence"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Expectations Anchoring Principle",
          "statement": "When inflation expectations become firmly anchored to the central bank's target, actual inflation becomes more stable and less responsive to temporary economic shocks. Well-anchored expectations reduce the sacrifice ratio of disinflation, make monetary policy more effective, and help avoid costly inflation-deflation cycles. Central bank credibility is the key mechanism for anchoring expectations.",
          "application": "This principle explains why inflation targeting has been successful in many countries, why central banks invest heavily in communication, and how forward guidance can be an effective policy tool independent of current interest rates.",
          "example": "Since adopting inflation targeting in the early 1990s, many countries including Canada, the UK, and Sweden have experienced both lower average inflation and reduced inflation volatility, with expectations remaining anchored despite economic shocks.",
          "analogy": "Like a ship's anchor in rough seas—well-anchored inflation expectations keep the price level stable despite economic waves, while unanchored expectations allow inflation to drift with every current and wind.",
          "image": {
            "url": "/images/economics/expectations-anchoring-principle.svg",
            "alt": "Expectations Anchoring Principle",
            "caption": "How anchored expectations stabilize inflation"
          }
        }
      ]
    }
  ],
  "key_terms": [
    "Demand-Pull Inflation",
    "Cost-Push Inflation",
    "Built-In Inflation",
    "Aggregate Demand",
    "Aggregate Supply",
    "Output Gap",
    "Stagflation",
    "Wage-Price Spiral",
    "Inflation Expectations",
    "Sacrifice Ratio",
    "Phillips Curve",
    "Supply Shock",
    "Capacity Constraints",
    "Menu Costs",
    "Adaptive Expectations",
    "Policy Credibility",
    "Inflation Inertia",
    "Cost Pass-Through",
    "Excess Demand",
    "Production Costs"
  ],
  "summary": "Inflation arises through three interconnected mechanisms: demand-pull inflation from excess aggregate demand relative to productive capacity; cost-push inflation from rising production costs independent of demand conditions; and built-in inflation from expectations and institutional arrangements that create persistence. Demand-pull inflation typically occurs during economic booms when low unemployment and capacity constraints give businesses pricing power. Cost-push inflation results from supply shocks, wage pressures, or import price increases, often creating the difficult policy dilemma of stagflation. Built-in inflation emerges when expectations of future inflation become embedded in wage and price setting, creating inertia that makes disinflation economically costly. These mechanisms frequently interact, with initial shocks potentially triggering self-reinforcing cycles through expectations and institutional responses. Understanding these distinct causes is essential for designing appropriate policy responses, with demand-pull inflation typically addressed through demand management, while cost-push and built-in inflation require more nuanced approaches including expectations management and credibility building."
}
