{
  "expanded_description": "Why do prices rise? Sometimes it's because people have more money to spend and bid up prices. Sometimes it's because the costs of production increase and businesses pass them along. Sometimes it's because people expect prices to rise, so they raise prices preemptively. Understanding the causes of inflation is essential for knowing how to control it. If inflation is caused by too much spending, the solution is to cool demand. If it's caused by rising costs, the solution is more complicated. If it's caused by expectations, the solution is to restore confidence in the currency. This section explores the two main types of inflation - demand-pull and cost-push - and the role of expectations in driving inflation.",
  
  "core_concept": {
    "principle": "Inflation can be caused by three main factors: demand-pull (excess aggregate demand pulling up prices), cost-push (rising production costs pushing up prices), and built-in inflation (adaptive expectations creating a self-fulfilling spiral). In practice, most inflationary episodes involve a combination of factors, and the relative importance determines the appropriate policy response.",
    "explanation": "Imagine a crowded auction. If many people have money and want to buy, they'll bid up prices - that's demand-pull inflation. Now imagine the cost of materials for making bread rises - bakeries raise prices to cover their costs - that's cost-push inflation. Now imagine everyone expects bread prices to rise next month, so bakers raise prices today and workers demand higher wages today - that's built-in inflation. In reality, these forces interact. A demand-pull episode can lead to cost-push as wages rise, and expectations can keep inflation going even after the original cause is gone. Understanding which force is dominant is crucial for knowing whether to raise interest rates, address supply constraints, or try to change expectations.",
    "image": {
      "src": "images/unit9/causes_inflation.png",
      "alt": "Diagram showing three causes of inflation: demand-pull (excess spending), cost-push (rising costs), and built-in (expectations)",
      "caption": "Inflation can be caused by excess demand, rising costs, or self-fulfilling expectations"
    }
  },

  "sections": [
    {
      "section_title": "9.7 Causes of Inflation",
      "introduction": "Why does a cup of coffee cost $\\$4$ today when it cost $\\$1$ thirty years ago? Partly because people have more money to spend, partly because coffee beans and rent and labor cost more, and partly because everyone expects prices to keep rising. In this section, we'll explore the three main causes of inflation and how they interact to drive prices upward over time.",
      
      "key_concept": {
        "definition": "Inflation can be classified by its cause. Demand-pull inflation occurs when aggregate demand exceeds aggregate supply at full employment, pulling up prices. It's often described as 'too much money chasing too few goods.' Cost-push inflation occurs when the costs of production (wages, raw materials, energy) rise, pushing firms to raise prices to maintain profit margins. Built-in inflation occurs when expectations of future inflation lead to preemptive price and wage increases, creating a self-fulfilling spiral. These causes often interact: demand-pull can lead to cost-push as wages rise, and cost-push can become embedded in expectations.",
        "context": "The distinction between demand-pull and cost-push inflation was developed in the mid-20th century as economists tried to understand the different inflationary episodes of the post-war period. The 1960s saw demand-pull inflation from high government spending. The 1970s saw cost-push inflation from oil price shocks. The 1980s and beyond have seen more complex interactions. Understanding the cause is crucial for policy: demand-pull calls for contractionary monetary or fiscal policy; cost-push presents a dilemma because tightening demand may not address supply shocks and could cause unemployment; built-in inflation requires credibility and expectations management. Central banks today pay close attention to inflation expectations as a key determinant of future inflation."
      },

      "categories": [
        {
          "type": "Demand-Pull Inflation",
          "description": "Inflation caused by excess aggregate demand - when spending grows faster than the economy's ability to produce.",
          "examples": [
            {
              "process": "How it works",
              "explanation": "When households, businesses, or government try to buy more than the economy can produce at full employment, they bid up prices. This typically happens when the economy is operating near or above full capacity. The aggregate demand curve shifts right along an upward-sloping or vertical aggregate supply curve, raising the price level."
            },
            {
              "process": "Common causes",
              "explanation": "Expansionary monetary policy (low interest rates, increased money supply), expansionary fiscal policy (tax cuts, increased government spending), strong consumer confidence, export booms, or any factor that increases spending faster than productive capacity."
            },
            {
              "process": "Historical example",
              "explanation": "The late 1960s in the U.S. saw demand-pull inflation as government spending on the Vietnam War and social programs, combined with strong consumer spending, pushed the economy beyond full employment. Unemployment fell to 3.5%, but inflation rose from 1.5% to nearly 6%."
            },
            {
              "process": "Graphical representation",
              "explanation": "In the AD-AS model, the aggregate demand curve shifts right. At full employment, this primarily raises prices rather than output. The economy moves up along the short-run aggregate supply curve, with higher prices and temporarily higher output, but in the long run, only prices increase."
            }
          ]
        },
        {
          "type": "Cost-Push Inflation",
          "description": "Inflation caused by increases in production costs that are passed on to consumers.",
          "examples": [
            {
              "process": "How it works",
              "explanation": "When the cost of key inputs rises - oil, raw materials, wages - firms face higher costs. To maintain profit margins, they raise prices. This can happen even when aggregate demand isn't excessive. The aggregate supply curve shifts left, raising prices while reducing output - a painful combination called stagflation."
            },
            {
              "process": "Common causes",
              "explanation": "Oil price shocks, crop failures, currency depreciation (making imports more expensive), wage increases exceeding productivity growth, supply chain disruptions, and monopoly power (firms with market power raising prices)."
            },
            {
              "process": "Historical example",
              "explanation": "The 1970s oil crises are classic examples of cost-push inflation. When OPEC quadrupled oil prices in 1973-74, the cost of everything from gasoline to plastics to transportation soared. Inflation reached double digits, while output fell and unemployment rose - stagflation that puzzled economists who thought inflation and unemployment moved in opposite directions."
            },
            {
              "process": "Graphical representation",
              "explanation": "In the AD-AS model, the short-run aggregate supply curve shifts left. At the original price level, firms supply less. The new equilibrium has higher prices and lower output - exactly what happened in the 1970s."
            }
          ]
        },
        {
          "type": "Built-In Inflation (Expectations)",
          "description": "Inflation caused by adaptive expectations, creating a self-fulfilling spiral.",
          "examples": [
            {
              "process": "How it works",
              "explanation": "If workers expect prices to rise, they demand higher wages. If firms expect costs to rise, they raise prices preemptively. These expectations can become self-fulfilling: expectations of inflation lead to actions that cause inflation. This is sometimes called a wage-price spiral."
            },
            {
              "process": "Role of expectations",
              "explanation": "Once inflation becomes embedded in expectations, it can persist even after the original cause is gone. If everyone expects 5% inflation, they'll set wages and prices accordingly, creating 5% inflation. This is why central banks work so hard to anchor expectations."
            },
            {
              "process": "Historical example",
              "explanation": "In the 1970s, after the first oil shock, inflation expectations became unanchored. Workers demanded cost-of-living adjustments in contracts. Firms built inflation into their pricing. Even after oil prices stabilized, inflation continued because of this expectations dynamic. It took a severe recession in the early 1980s to break the cycle and re-anchor expectations at a lower level."
            },
            {
              "process": "Graphical representation",
              "explanation": "In the AD-AS model, built-in inflation appears as continuing leftward shifts of the short-run aggregate supply curve as workers and firms adjust to expected inflation. The economy can experience persistent inflation without further demand or supply shocks."
            }
          ]
        },
        {
          "type": "The Interaction of Causes",
          "description": "In practice, inflationary episodes often involve multiple causes.",
          "examples": [
            {
              "process": "Demand-pull leading to cost-push",
              "explanation": "Strong demand can lead to tight labor markets, pushing up wages (cost-push). This can create a cycle: demand-pull inflation raises prices, workers demand higher wages to keep up, firms raise prices further to cover higher wages, etc."
            },
            {
              "process": "Cost-push leading to built-in inflation",
              "explanation": "A one-time cost shock (like an oil price spike) can become embedded in expectations. If workers and firms expect the higher inflation to continue, they'll build it into their behavior, creating ongoing inflation even after the shock fades."
            },
            {
              "process": "Policy dilemmas",
              "explanation": "Demand-pull inflation can be addressed by cooling demand (raising interest rates). Cost-push inflation presents a dilemma: tightening demand may reduce inflation but at the cost of higher unemployment, and it doesn't address the supply shock directly. Built-in inflation requires credibility and expectations management."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Demand-Pull Inflation Results from Excess Aggregate Demand",
          "statement": "When the economy operates above full employment, with aggregate demand exceeding potential output, prices are pulled upward. This typically happens during booms when spending is strong. The solution is to reduce demand through contractionary monetary or fiscal policy.",
          "application": "This principle guides policy during overheating. If inflation is rising and unemployment is below the natural rate, central banks raise interest rates to cool demand. The goal is to slow spending enough to bring inflation back to target without causing a recession.",
          "example": "In the late 1990s, the U.S. economy was booming with low unemployment. The Federal Reserve raised interest rates preemptively to head off demand-pull inflation. Because productivity growth was strong, inflation remained low despite tight labor markets, showing that demand-pull isn't automatic - it depends on the economy's capacity to expand."
        },
        {
          "principle": "Cost-Push Inflation Creates a Policy Dilemma",
          "statement": "When inflation is caused by supply shocks (like oil price increases), traditional demand-side policies face a tradeoff. Tightening demand can reduce inflation but will also increase unemployment. Loosening demand may exacerbate inflation. Policy makers must decide how much weight to put on inflation vs. unemployment.",
          "application": "This principle explains why central banks may sometimes tolerate temporary cost-push inflation if they believe it's transitory. They may 'look through' the shock and focus on core inflation. However, if cost-push becomes embedded in expectations, they may need to act even at the cost of higher unemployment.",
          "example": "In 2008, oil prices surged to $\\$140$ per barrel, pushing headline inflation to 5.6%. The Federal Reserve recognized this as a supply shock and did not raise rates aggressively, correctly judging that the shock was temporary and that tightening would worsen the emerging financial crisis. When oil prices crashed in late 2008, inflation fell sharply."
        },
        {
          "principle": "Inflation Expectations Can Become Self-Fulfilling",
          "statement": "If workers and firms expect high inflation, they will act in ways that create high inflation - demanding higher wages, raising prices preemptively. This is why anchoring expectations at a low level is a central goal of monetary policy. Once expectations become unanchored, it's costly to bring them back down.",
          "application": "This principle explains why central banks communicate so carefully about their inflation targets and policy intentions. They want the public to expect 2% inflation. If expectations drift higher, they may need to prove their commitment by raising rates even if it causes a recession, as Paul Volcker did in the early 1980s.",
          "example": "In the 1970s, U.S. inflation expectations became unanchored, with surveys showing people expected 5-6% inflation indefinitely. This made inflation persist even after the oil shocks faded. It took a severe recession in 1981-82, with unemployment over 10%, to break inflationary psychology and re-anchor expectations at a lower level."
        },
        {
          "principle": "The Money Supply and Inflation Are Closely Linked in the Long Run",
          "statement": "In the long run, inflation is primarily a monetary phenomenon. Persistent inflation requires sustained growth in the money supply beyond the economy's ability to produce. While short-run fluctuations can be driven by demand or supply shocks, long-run inflation is controlled by central banks through their control of the money supply.",
          "application": "This principle, associated with Milton Friedman, implies that controlling inflation ultimately requires controlling money growth. Modern central banks use interest rates rather than money supply targets, but the principle holds: sustained inflation cannot occur without accommodative monetary policy. This is why central banks are ultimately responsible for inflation.",
          "example": "Zimbabwe in the 2000s experienced hyperinflation because the government printed money to finance spending. The money supply grew astronomically, and prices followed. This extreme case illustrates the long-run relationship between money and inflation, even though most inflation episodes are more complex."
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Causes of Inflation",
          "problem": "For each of the following scenarios, identify whether the inflation is primarily demand-pull, cost-push, or built-in (expectations). Explain your reasoning. a) The economy is booming with unemployment at 3.5% (below the natural rate). Wages are rising rapidly, and businesses report they can't keep up with orders. b) Oil prices double due to geopolitical instability. Transportation costs soar, and businesses across many industries raise prices. c) After several years of high inflation, workers now expect 5% annual price increases and demand cost-of-living adjustments in their contracts. Businesses build 5% price increases into their plans. d) The government cuts taxes and increases spending during a strong economy, pushing aggregate demand further above potential output. e) A drought destroys crops, causing food prices to spike. Other prices are stable.",
          "step_by_step": [
            {
              "step": "Analyze booming economy scenario",
              "explanation": "This is **demand-pull inflation**. Unemployment below the natural rate indicates the economy is operating above full employment. Excess demand is pulling up wages and prices. Businesses can't keep up with orders, confirming strong demand."
            },
            {
              "step": "Analyze oil price scenario",
              "explanation": "This is **cost-push inflation**. The trigger is an increase in production costs (oil), not excess demand. Businesses raise prices to cover higher costs. This could happen even if the economy is weak."
            },
            {
              "step": "Analyze expectations scenario",
              "explanation": "This is **built-in inflation** driven by expectations. There's no new demand or cost shock - inflation persists because people expect it and act accordingly. This is the wage-price spiral."
            },
            {
              "step": "Analyze tax cut scenario",
              "explanation": "This is **demand-pull inflation**. Tax cuts and spending increases boost aggregate demand. In an already strong economy, this pushes demand further above potential, pulling up prices."
            },
            {
              "step": "Analyze drought scenario",
              "explanation": "This is **cost-push inflation** for food prices. However, if other prices are stable, this may not cause general inflation - just a one-time adjustment in relative prices. It becomes inflation if it spreads to wages and other sectors."
            }
          ],
          "final_answer": "a) Demand-pull, b) Cost-push, c) Built-in, d) Demand-pull, e) Cost-push (but possibly temporary/isolated).",
          "concept_applied": "Inflation can have different causes. Identifying the cause is important for choosing the right policy response."
        },
        {
          "title": "Analyzing a Cost-Push Shock",
          "problem": "An economy is initially at full employment with stable prices. Oil prices suddenly double, causing a significant increase in production costs across many industries. a) Using the AD-AS model, explain what happens to output and prices in the short run. b) What happens to unemployment? c) If the central bank does nothing, what might happen to inflation expectations? d) If the central bank tries to offset the output loss by stimulating demand, what happens to prices? e) What policy dilemma does this create?",
          "step_by_step": [
            {
              "step": "Short-run effects of oil shock",
              "explanation": "The shock shifts the short-run aggregate supply (SRAS) curve left. At the original price level, firms supply less. The new equilibrium has higher prices (inflation) and lower output (recession). This is stagflation."
            },
            {
              "step": "Effect on unemployment",
              "explanation": "With lower output, firms need fewer workers. Unemployment rises above the natural rate. So we have both higher inflation and higher unemployment - a combination that traditional Phillips curve analysis thought impossible."
            },
            {
              "step": "Expectations effects",
              "explanation": "If the shock is large and persistent, people may start expecting higher future inflation. This can shift SRAS further left as workers demand higher wages and firms raise prices preemptively, creating built-in inflation."
            },
            {
              "step": "Central bank response",
              "explanation": "If the central bank stimulates demand to reduce unemployment (shift AD right), output returns toward potential, but prices rise further. This trades off lower unemployment for even higher inflation. If the bank tightens to fight inflation, unemployment rises further."
            },
            {
              "step": "Policy dilemma",
              "explanation": "The central bank faces a painful tradeoff: fight inflation (tightening, higher unemployment) or fight unemployment (stimulus, higher inflation). There's no good option. This is why cost-push shocks are so challenging for policy makers."
            }
          ],
          "final_answer": "a) Prices rise, output falls. b) Unemployment rises. c) Expectations may become unanchored, causing further inflation. d) Stimulus raises prices further. e) Dilemma: fighting inflation worsens unemployment; fighting unemployment worsens inflation.",
          "concept_applied": "Cost-push inflation creates stagflation (higher inflation + higher unemployment) and poses a difficult policy dilemma. This is what happened in the 1970s."
        },
        {
          "title": "Demand-Pull vs. Cost-Push Policy Responses",
          "problem": "Consider two scenarios: Scenario A: Inflation is at 5% and unemployment is at 3%, well below the estimated natural rate of 5%. Scenario B: Inflation is at 5% and unemployment is at 7%, above the natural rate. In both cases, the central bank's inflation target is 2%. a) In which scenario is inflation likely demand-pull? Cost-push? b) What policy would you recommend in Scenario A? c) What policy would you recommend in Scenario B? d) Why are the recommendations different?",
          "step_by_step": [
            {
              "step": "Identify type of inflation",
              "explanation": "Scenario A: Low unemployment (below natural rate) suggests the economy is overheating. Inflation here is likely **demand-pull**. Scenario B: High unemployment suggests the economy is weak. Inflation here is likely **cost-push** (or possibly built-in from past expectations)."
            },
            {
              "step": "Recommend policy for Scenario A",
              "explanation": "With demand-pull inflation, the appropriate policy is **contractionary**: raise interest rates to cool demand. This will reduce inflationary pressure and, over time, bring unemployment back toward the natural rate. The central bank should tighten."
            },
            {
              "step": "Recommend policy for Scenario B",
              "explanation": "This is much harder. If inflation is cost-push, tightening demand would further increase unemployment without necessarily addressing the supply shock. The central bank might 'look through' the inflation if it's temporary, or might tighten if expectations are becoming unanchored. There's no easy answer."
            },
            {
              "step": "Explain difference",
              "explanation": "In Scenario A, inflation is caused by excess demand, so reducing demand addresses the cause. In Scenario B, inflation is not caused by excess demand, so reducing demand may not be effective and will cause additional pain. Policy must consider the source."
            }
          ],
          "final_answer": "a) Scenario A: demand-pull; Scenario B: cost-push. b) Scenario A: contractionary policy (raise rates). c) Scenario B: complex - possibly look through if temporary, or tighten if expectations unanchored. d) Different causes require different responses; fighting cost-push with demand contraction can cause unnecessary unemployment.",
          "concept_applied": "The appropriate policy response to inflation depends on its cause. Demand-pull calls for contractionary policy; cost-push presents a dilemma. This is why central banks analyze inflation carefully before acting."
        }
      ],

      "image": {
        "src": "images/unit9/demand_pull_cost_push.png",
        "alt": "AD-AS graphs showing demand-pull (AD shifts right, prices up, output up) and cost-push (AS shifts left, prices up, output down)",
        "caption": "Demand-pull inflation shifts AD right, raising both prices and output. Cost-push inflation shifts AS left, raising prices but lowering output."
      }
    }
  ],

  "key_terms": [
    "Demand-pull inflation",
    "Cost-push inflation",
    "Built-in inflation",
    "Wage-price spiral",
    "Inflation expectations",
    "Aggregate demand (AD)",
    "Aggregate supply (AS)",
    "Stagflation",
    "Supply shock",
    "Full employment",
    "Output gap",
    "Monetary policy",
    "Fiscal policy",
    "Adaptive expectations",
    "Rational expectations",
    "Money supply",
    "Quantity theory of money",
    "Phillips curve",
    "Oil shock",
    "Wage indexation"
  ],

  "summary": "Inflation can be classified into three main types based on its cause. Demand-pull inflation occurs when aggregate demand exceeds aggregate supply at full employment - 'too much money chasing too few goods.' It typically happens during economic booms, with low unemployment and strong spending. The solution is contractionary monetary or fiscal policy to cool demand. Cost-push inflation occurs when production costs rise - from oil price shocks, wage increases exceeding productivity, currency depreciation, or supply disruptions. Firms pass higher costs to consumers in higher prices. Cost-push creates stagflation (higher inflation + higher unemployment) and poses a policy dilemma because tightening demand may not address the supply shock and could increase unemployment. Built-in inflation (or expectations inflation) occurs when adaptive expectations create a self-fulfilling spiral. If workers expect prices to rise, they demand higher wages; if firms expect costs to rise, they raise prices preemptively. This wage-price spiral can persist even after the original cause of inflation is gone, which is why anchoring expectations is a central goal of monetary policy. In practice, inflationary episodes often involve multiple causes. Demand-pull can lead to cost-push as tight labor markets push up wages. Cost-push can become embedded in expectations, creating built-in inflation. The 1970s saw all three: demand-pull from policy, cost-push from oil shocks, and built-in from unanchored expectations. The appropriate policy response depends on the cause. Demand-pull calls for contractionary policy. Cost-push presents a tradeoff between fighting inflation and fighting unemployment. Built-in inflation requires credibility and expectations management. In the long run, sustained inflation is primarily a monetary phenomenon - it requires persistent growth in the money supply beyond the economy's productive capacity. This is why central banks are ultimately responsible for controlling inflation."
}
