{
  "title": "9.9 The Phillips Curve",
  "expanded_description": "Comprehensive analysis of the Phillips Curve relationship between inflation and unemployment, examining its theoretical foundations, empirical evidence, policy implications, and evolution from a stable trade-off to expectations-augmented and natural rate frameworks.",
  "core_concept": {
    "principle": "The Phillips Curve represents the historical inverse relationship between inflation and unemployment, suggesting a trade-off where policymakers could achieve lower unemployment by accepting higher inflation, or lower inflation by tolerating higher unemployment. However, this relationship proved unstable over time as expectations adjusted.",
    "explanation": "The Phillips Curve has evolved from an apparently stable empirical relationship to a more complex theoretical framework incorporating expectations, supply shocks, and the natural rate of unemployment. Understanding this evolution is crucial for modern macroeconomic policy.",
    "image": {
      "url": "/images/economics/phillips-curve.svg",
      "alt": "The Phillips Curve",
      "caption": "The relationship between inflation and unemployment and its evolution"
    }
  },
  "sections": [
    {
      "section_title": "Original Phillips Curve and Empirical Foundations",
      "introduction": "Examining the original empirical discovery of the inflation-unemployment relationship and its initial interpretation as a stable policy trade-off.",
      "key_concept": {
        "definition": "The original Phillips Curve, identified by A.W. Phillips in 1958, showed an inverse relationship between wage inflation and unemployment in UK data from 1861-1957. This was later extended to price inflation and became interpreted as a stable menu of policy options for choosing between inflation and unemployment outcomes.",
        "context": "The apparent stability of the Phillips Curve relationship in the early postwar period led many economists and policymakers to believe they could permanently reduce unemployment through expansionary policies that accepted modestly higher inflation.",
        "image": {
          "url": "/images/economics/original-phillips-curve.svg",
          "alt": "Original Phillips Curve",
          "caption": "Phillips' original wage inflation-unemployment relationship"
        }
      },
      "classifications": [
        {
          "type": "Empirical Discovery",
          "value": "Phillips' original findings and methodology",
          "characteristics": ["UK Data 1861-1957", "Wage Inflation Focus", "Non-linear Relationship", "Statistical Regularity"],
          "behavior": "Phillips found a consistent negative correlation between the rate of wage inflation and the unemployment rate, with the relationship being non-linear—wage changes were more sensitive to unemployment at low unemployment rates.",
          "examples": [
            {
              "process": "Original Statistical Analysis",
              "explanation": "Phillips plotted wage inflation against unemployment and found a smooth curve that fit the data remarkably well across nearly a century, suggesting a fundamental economic relationship.",
              "image": {
                "url": "/images/economics/original-statistical-analysis.svg",
                "alt": "Original Statistical Analysis",
                "caption": "Phillips' empirical methodology and findings"
              }
            },
            {
              "process": "Non-linear Relationship Characteristics",
              "explanation": "The curve was convex to the origin, meaning that at very low unemployment rates, further reductions in unemployment required increasingly large increases in wage inflation.",
              "image": {
                "url": "/images/economics/non-linear-relationship.svg",
                "alt": "Non-linear Relationship Characteristics",
                "caption": "The convex shape of the original Phillips Curve"
              }
            }
          ]
        },
        {
          "type": "Policy Interpretation and Application",
          "value": "How the Phillips Curve was used for policy planning",
          "characteristics": ["Policy Trade-off", "Menu of Choices", "Fine-tuning", "Cost-Benefit Analysis"],
          "behavior": "Economists like Paul Samuelson and Robert Solow popularized the Phillips Curve as representing a stable trade-off between inflation and unemployment that policymakers could exploit through demand management.",
          "examples": [
            {
              "process": "Policy Menu Framework",
              "explanation": "Policymakers could supposedly choose their preferred combination of inflation and unemployment along the curve—lower unemployment could be 'purchased' by accepting higher inflation, or vice versa.",
              "image": {
                "url": "/images/economics/policy-menu-framework.svg",
                "alt": "Policy Menu Framework",
                "caption": "The Phillips Curve as a policy choice menu"
              }
            },
            {
              "process": "Fine-tuning Ambitions",
              "explanation": "The apparent stability of the relationship encouraged beliefs that sophisticated demand management could precisely control the economy, maintaining low unemployment with only modest inflation.",
              "image": {
                "url": "/images/economics/fine-tuning-ambitions.svg",
                "alt": "Fine-tuning Ambitions",
                "caption": "Attempts at precise economic management"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Original Phillips Curve Analysis",
          "problem": "Using Phillips Curve: Unemployment = 6% - 0.5 × Inflation. If current unemployment is 5% with 2% inflation, calculate the inflation rate needed to reduce unemployment to 4%. What does this imply for policy?",
          "step_by_step": [
            {
              "step": "Understand the Phillips Curve Equation",
              "explanation": "Interpret the given relationship",
              "calculation": "Unemployment = 6% - 0.5 × Inflation\nThis suggests natural rate of 6% with zero inflation\nEach 1% inflation reduces unemployment by 0.5%"
            },
            {
              "step": "Calculate Current Position",
              "explanation": "Verify current point lies on curve",
              "calculation": "At 2% inflation: Unemployment = 6% - 0.5 × 2% = 5% ✓\nConsistent with given current situation"
            },
            {
              "step": "Calculate Required Inflation for 4% Unemployment",
              "explanation": "Solve for inflation that gives target unemployment",
              "calculation": "4% = 6% - 0.5 × Inflation\n0.5 × Inflation = 6% - 4% = 2%\nInflation = 2% / 0.5 = 4%"
            },
            {
              "step": "Interpret Policy Implication",
              "explanation": "What the calculation means for policymakers",
              "calculation": "To reduce unemployment from 5% to 4%\nInflation must increase from 2% to 4%\nTrade-off: 1% unemployment reduction costs 2% additional inflation"
            },
            {
              "step": "Calculate Sacrifice Ratio",
              "explanation": "Inflation cost per unemployment reduction",
              "calculation": "Sacrifice ratio = ΔInflation / ΔUnemployment\n= (4% - 2%) / (5% - 4%) = 2% / 1% = 2\nEach 1% unemployment reduction requires 2% additional inflation"
            },
            {
              "step": "Evaluate Policy Attractiveness",
              "explanation": "Whether this trade-off seems reasonable",
              "calculation": "Reducing unemployment benefits many workers\n2% additional inflation may be acceptable cost\nClassic Phillips Curve policy calculation"
            }
          ],
          "final_answer": "To reduce unemployment from 5% to 4% according to this Phillips Curve relationship, inflation would need to increase from 2% to 4%. This represents a sacrifice ratio of 2, meaning each 1 percentage point reduction in unemployment requires accepting 2 percentage points of additional inflation. From a policy perspective, this trade-off might appear attractive—the benefits of lower unemployment for workers could outweigh the costs of moderately higher inflation. However, this analysis assumes a stable Phillips Curve relationship, which empirical evidence later showed was unreliable over the long run as inflation expectations adjust.",
          "concept_applied": "Application of the original Phillips Curve framework to calculate inflation-unemployment trade-offs, determination of sacrifice ratios, and analysis of policy implications assuming a stable relationship.",
          "image": {
            "url": "/images/economics/original-phillips-analysis.svg",
            "alt": "Original Phillips Curve Analysis",
            "caption": "Calculating policy trade-offs using Phillips Curve"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Stable Trade-off Illusion Principle",
          "statement": "The original Phillips Curve created the illusion of a stable, exploitable trade-off between inflation and unemployment that policymakers could permanently exploit. This illusion arose from observing the relationship during periods when inflation expectations were stable. Once policymakers attempted to systematically exploit this trade-off, expectations adjusted and the relationship broke down, demonstrating that the apparent menu of choices was not permanently available.",
          "application": "This principle explains the failure of 1960s fine-tuning policies, why attempts to permanently reduce unemployment through inflation ultimately failed, and why economists now understand the inflation-unemployment relationship as more complex and expectations-dependent.",
          "example": "In the late 1960s, U.S. policymakers tried to push unemployment below 4% through expansionary policies, initially achieving lower unemployment with moderate inflation. However, by the 1970s, inflation accelerated while unemployment rose, creating stagflation that contradicted the original Phillips Curve.",
          "analogy": "Like a vending machine that dispenses snacks when you put in coins—initially it seems you can get whatever snack you want by putting in the right coins, but if too many people use it, the mechanism breaks and you get neither snacks nor your coins back.",
          "image": {
            "url": "/images/economics/stable-tradeoff-illusion.svg",
            "alt": "Stable Trade-off Illusion Principle",
            "caption": "The breakdown of the apparent policy menu"
          }
        }
      ]
    },
    {
      "section_title": "Expectations-Augmented Phillips Curve",
      "introduction": "Analyzing how the incorporation of inflation expectations transformed the Phillips Curve from a stable relationship to a dynamic framework where the trade-off depends on expected inflation.",
      "key_concept": {
        "definition": "The expectations-augmented Phillips Curve, developed by Milton Friedman and Edmund Phelps, incorporates inflation expectations into the relationship: Inflation = Expected Inflation - β(Unemployment - Natural Rate) + Supply Shocks. This framework explains why the simple Phillips Curve relationship broke down in the 1970s.",
        "context": "The expectations-augmented Phillips Curve represents a fundamental advance in macroeconomic understanding, explaining why there is no long-run trade-off between inflation and unemployment and why the natural rate hypothesis holds.",
        "image": {
          "url": "/images/economics/expectations-augmented-phillips.svg",
          "alt": "Expectations-Augmented Phillips Curve",
          "caption": "How inflation expectations transform the Phillips Curve"
        }
      },
      "classifications": [
        {
          "type": "Theoretical Foundations",
          "value": "Key insights from Friedman and Phelps",
          "characteristics": ["Natural Rate Hypothesis", "Adaptive Expectations", "No Long-Run Trade-off", "Vertical Long-Run Phillips Curve"],
          "behavior": "Friedman and Phelps independently argued that workers and firms care about real variables, not nominal ones. Once inflation expectations fully adjust, unemployment returns to its natural rate regardless of the inflation rate.",
          "examples": [
            {
              "process": "Natural Rate Hypothesis",
              "explanation": "There exists a natural rate of unemployment determined by real economic factors (technology, institutions, demographics). Attempts to push unemployment below this rate through inflation will only cause accelerating inflation without permanent employment gains.",
              "image": {
                "url": "/images/economics/natural-rate-hypothesis.svg",
                "alt": "Natural Rate Hypothesis",
                "caption": "The concept of natural unemployment rate"
              }
            },
            {
              "process": "Adaptive Expectations Formation",
              "explanation": "In the expectations-augmented framework, people form expectations based on past inflation. If policymakers try to exploit the Phillips Curve, expectations eventually catch up, eliminating any temporary employment gains.",
              "image": {
                "url": "/images/economics/adaptive-expectations-formation.svg",
                "alt": "Adaptive Expectations Formation",
                "caption": "How past inflation influences current expectations"
              }
            }
          ]
        },
        {
          "type": "Policy Implications",
          "value": "How expectations change policy effectiveness",
          "characteristics": ["Short-run vs Long-run", "Policy Credibility", "Inflation Acceleration", "Sacrifice Ratio"],
          "behavior": "The expectations-augmented Phillips Curve implies that expansionary policies can only temporarily reduce unemployment until expectations adjust. Maintaining unemployment below the natural rate requires continuously accelerating inflation.",
          "examples": [
            {
              "process": "Short-run vs Long-run Trade-offs",
              "explanation": "There is a short-run trade-off between inflation and unemployment when expectations haven't adjusted, but no long-run trade-off once expectations fully incorporate actual inflation.",
              "image": {
                "url": "/images/economics/short-long-run-tradeoffs.svg",
                "alt": "Short-run vs Long-run Trade-offs",
                "caption": "Temporary versus permanent policy effects"
              }
            },
            {
              "process": "Accelerationist Hypothesis",
              "explanation": "To keep unemployment permanently below the natural rate, inflation must continuously accelerate as expectations repeatedly adjust upward. This creates an unsustainable situation that eventually collapses.",
              "image": {
                "url": "/images/economics/accelerationist-hypothesis.svg",
                "alt": "Accelerationist Hypothesis",
                "caption": "The need for ever-increasing inflation"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Expectations-Augmented Phillips Curve Analysis",
          "problem": "Economy has natural rate = 5%, Phillips Curve: π = πᵉ - 0.5(u - 5%). Initially: π = 2%, πᵉ = 2%, u = 5%. Policy aims for u = 4% permanently. Trace inflation for 3 years with adaptive expectations: πᵉ = π₋₁.",
          "step_by_step": [
            {
              "step": "Year 1 Analysis",
              "explanation": "Initial policy expansion",
              "calculation": "To achieve u = 4%: π = 2% - 0.5(4 - 5) = 2% - 0.5(-1) = 2% + 0.5% = 2.5%\nActual inflation = 2.5%, Expected was 2%\nUnexpected inflation reduces unemployment to 4%"
            },
            {
              "step": "Year 2 Expectations Adjustment",
              "explanation": "Expectations catch up to past inflation",
              "calculation": "πᵉ = π₋₁ = 2.5%\nTo maintain u = 4%: π = 2.5% - 0.5(4 - 5) = 2.5% + 0.5% = 3.0%\nInflation must increase to maintain low unemployment"
            },
            {
              "step": "Year 3 Expectations Adjustment",
              "explanation": "Further expectations adjustment",
              "calculation": "πᵉ = π₋₁ = 3.0%\nTo maintain u = 4%: π = 3.0% - 0.5(4 - 5) = 3.0% + 0.5% = 3.5%\nInflation continues accelerating"
            },
            {
              "step": "Identify the Pattern",
              "explanation": "Recognize the acceleration dynamic",
              "calculation": "Each year, inflation increases by 0.5%\nTo maintain u = 4%, must accept ever-higher inflation\nAccelerationist hypothesis confirmed"
            },
            {
              "step": "Calculate Long-run Implication",
              "explanation": "Where this process leads",
              "calculation": "After 10 years: inflation = 2% + 10 × 0.5% = 7%\nClearly unsustainable\nEventually policy must abandon unemployment target"
            },
            {
              "step": "Policy Lesson",
              "explanation": "What this demonstrates for policy",
              "calculation": "Cannot permanently reduce unemployment below natural rate\nAttempts only create accelerating inflation\nNatural rate is binding constraint"
            }
          ],
          "final_answer": "Attempting to maintain unemployment at 4% (below the 5% natural rate) requires continuously accelerating inflation: Year 1: 2.5%, Year 2: 3.0%, Year 3: 3.5%, with inflation increasing by 0.5% annually. This pattern demonstrates the accelerationist hypothesis—maintaining unemployment below the natural rate requires ever-increasing inflation as expectations continuously adjust to past inflation. After 10 years, inflation would reach 7%, creating clearly unsustainable conditions. This analysis shows why there is no long-run trade-off between inflation and unemployment and why the natural rate represents a binding constraint on employment policy. Attempts to permanently reduce unemployment through inflation only succeed in embedding higher inflation expectations without lasting employment gains.",
          "concept_applied": "Analysis of the expectations-augmented Phillips Curve with adaptive expectations, demonstration of the accelerationist hypothesis, and illustration of why there is no long-run inflation-unemployment trade-off.",
          "image": {
            "url": "/images/economics/expectations-augmented-analysis.svg",
            "alt": "Expectations-Augmented Phillips Curve Analysis",
            "caption": "How expectations adjustment eliminates long-run trade-offs"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Natural Rate Constraint Principle",
          "statement": "The natural rate of unemployment represents a fundamental constraint on macroeconomic policy—attempts to maintain unemployment below this rate through demand stimulus will only produce accelerating inflation without permanent employment gains. This principle explains why there is no long-run trade-off between inflation and unemployment and why sustainable full employment policies must address the structural determinants of the natural rate rather than relying on aggregate demand management.",
          "application": "This principle guides modern central banking, explains the failure of 1970s macroeconomic policies, and highlights why structural reforms (education, labor market flexibility, competition policy) are necessary for sustainably lower unemployment.",
          "example": "The Volcker disinflation of the early 1980s demonstrated this principle—reducing inflation from double digits required accepting unemployment rising above 10%, but once inflation expectations were reanchored, unemployment returned to its natural rate around 6%.",
          "analogy": "Like trying to push a car beyond its maximum speed—pushing the accelerator harder (expansionary policy) initially increases speed (lowers unemployment), but eventually you only burn more fuel (create inflation) without going faster, and may damage the engine (create economic instability).",
          "image": {
            "url": "/images/economics/natural-rate-constraint.svg",
            "alt": "Natural Rate Constraint Principle",
            "caption": "The natural rate as binding employment constraint"
          }
        }
      ]
    },
    {
      "section_title": "Modern Phillips Curve and Policy Applications",
      "introduction": "Examining contemporary Phillips Curve frameworks incorporating rational expectations, supply shocks, and their implications for modern monetary policy.",
      "key_concept": {
        "definition": "Modern Phillips Curve frameworks incorporate rational expectations, forward-looking behavior, and supply shocks. The New Keynesian Phillips Curve emphasizes nominal rigidities and forward-looking expectations, while recognizing that short-run trade-offs still exist due to price and wage stickiness.",
        "context": "While the simple Phillips Curve relationship has weakened in recent decades, modern versions remain important for understanding inflation dynamics, conducting monetary policy, and explaining why disinflation remains costly even with credible central banks.",
        "image": {
          "url": "/images/economics/modern-phillips-curve.svg",
          "alt": "Modern Phillips Curve",
          "caption": "Contemporary Phillips Curve frameworks and applications"
        }
      },
      "classifications": [
        {
          "type": "New Keynesian Phillips Curve",
          "value": "Modern synthesis incorporating microfoundations",
          "characteristics": ["Forward-looking Expectations", "Nominal Rigidities", "Calvo Pricing", "Marginal Cost Dynamics"],
          "behavior": "The New Keynesian Phillips Curve derives inflation dynamics from optimizing behavior of firms with staggered price setting. Inflation depends on expected future inflation and real marginal costs.",
          "examples": [
            {
              "process": "Forward-looking Price Setting",
              "explanation": "Firms set prices based on expected future economic conditions rather than just past inflation. This makes inflation dynamics more forward-looking and dependent on policy credibility.",
              "image": {
                "url": "/images/economics/forward-looking-pricing.svg",
                "alt": "Forward-looking Price Setting",
                "caption": "How expectations affect current price decisions"
              }
            },
            {
              "process": "Role of Nominal Rigidities",
              "explanation": "Sticky prices and wages create short-run non-neutrality of money, allowing monetary policy to affect real variables temporarily. The degree of rigidity determines the slope of the Phillips Curve.",
              "image": {
                "url": "/images/economics/nominal-rigidities-role.svg",
                "alt": "Role of Nominal Rigidities",
                "caption": "How price stickiness enables short-run trade-offs"
              }
            }
          ]
        },
        {
          "type": "Empirical Challenges and Policy Uses",
          "value": "Current evidence and central bank applications",
          "characteristics": ["Flattening Phillips Curve", "Anchored Expectations", "Supply Shock Dominance", "Inflation Forecasting"],
          "behavior": "Recent empirical evidence suggests the Phillips Curve has flattened, with inflation becoming less responsive to unemployment changes. However, it remains important for inflation forecasting and understanding inflation persistence.",
          "examples": [
            {
              "process": "The Flattening Phillips Curve",
              "explanation": "Since the 1990s, the empirical relationship between unemployment and inflation has weakened, with inflation showing less response to labor market slack. Possible explanations include anchored expectations, globalization, and changed monetary policy.",
              "image": {
                "url": "/images/economics/flattening-phillips-curve.svg",
                "alt": "The Flattening Phillips Curve",
                "caption": "Weakening inflation-unemployment relationship"
              }
            },
            {
              "process": "Central Bank Forecasting Models",
              "explanation": "Despite empirical challenges, Phillips Curve relationships remain embedded in central bank forecasting models, though often with additional variables like import prices, commodity prices, and inflation expectations.",
              "image": {
                "url": "/images/economics/central-bank-forecasting.svg",
                "alt": "Central Bank Forecasting Models",
                "caption": "Phillips Curve in policy analysis"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Modern Phillips Curve Policy Analysis",
          "problem": "New Keynesian Phillips Curve: π = 0.7E[π₊₁] + 0.2mc + 0.1π₋₁, where mc = -0.4(u - u*). Natural rate u* = 4%, current u = 3.5%, π = 2%, E[π₊₁] = 2%. Central bank wants to reduce inflation to 2% permanently. Calculate required unemployment path.",
          "step_by_step": [
            {
              "step": "Calculate Current Marginal Cost",
              "explanation": "Current economic pressure",
              "calculation": "mc = -0.4(3.5 - 4) = -0.4(-0.5) = +0.2\nPositive marginal cost indicates inflationary pressure"
            },
            {
              "step": "Verify Current Inflation Consistency",
              "explanation": "Check if current data fits the model",
              "calculation": "π = 0.7×2% + 0.2×0.2 + 0.1×2% = 1.4% + 0.04% + 0.2% = 1.64%\nBut actual π = 2%, suggesting model misspecification or other factors"
            },
            {
              "step": "Calculate Long-run Equilibrium",
              "explanation": "Conditions for stable 2% inflation",
              "calculation": "In long run: π = E[π] = π₋₁\nSo: π = 0.7π + 0.2mc + 0.1π\nπ = 0.8π + 0.2mc\n0.2π = 0.2mc → π = mc\nFor π = 2%, need mc = 2%"
            },
            {
              "step": "Calculate Required Unemployment Gap",
              "explanation": "Unemployment needed for mc = 2%",
              "calculation": "mc = -0.4(u - u*) = 2%\n-0.4(u - 4) = 2\nu - 4 = -5\nu = -1% (impossible)\nThis suggests other factors must change"
            },
            {
              "step": "Alternative Interpretation",
              "explanation": "Reinterpret with more reasonable parameters",
              "calculation": "Assume mc measured in percentage points from steady state\nFor inflation stability, need mc = 0\nSo: -0.4(u - 4) = 0 → u = 4%\nNeed unemployment at natural rate"
            },
            {
              "step": "Calculate Disinflation Path",
              "explanation": "Transition to lower inflation",
              "calculation": "To reduce inflation, need u > u*\nIf u = 5%: mc = -0.4(1) = -0.4\nWith E[π] = 2%: π = 0.7×2 + 0.2×(-0.4) + 0.1×2 = 1.4 - 0.08 + 0.2 = 1.52%\nGradual disinflation possible"
            },
            {
              "step": "Policy Implications",
              "explanation": "What this means for monetary policy",
              "calculation": "Forward-looking expectations reduce disinflation costs\nCredible policy can achieve disinflation with smaller unemployment increases\nBut some short-run trade-off remains due to rigidities"
            }
          ],
          "final_answer": "The New Keynesian Phillips Curve analysis shows that with forward-looking expectations (70% weight on expected future inflation), achieving disinflation requires smaller increases in unemployment than under adaptive expectations. To reduce inflation from current levels, unemployment would need to rise above the 4% natural rate, but the required increase is moderated by the forward-looking nature of expectations. With credible policy that anchors expected inflation at 2%, raising unemployment to 5% would reduce inflation to approximately 1.52%. This demonstrates how policy credibility and the expectations channel reduce the sacrifice ratio compared to traditional Phillips Curve models. However, the presence of backward-looking elements (10% weight on past inflation) and real rigidities means some short-run trade-off between inflation and unemployment still exists, requiring careful policy management.",
          "concept_applied": "Analysis of New Keynesian Phillips Curve dynamics, calculation of disinflation paths with forward-looking expectations, and examination of how modern Phillips Curve frameworks inform monetary policy decisions.",
          "image": {
            "url": "/images/economics/modern-phillips-analysis.svg",
            "alt": "Modern Phillips Curve Policy Analysis",
            "caption": "Policy implications of contemporary Phillips Curve models"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Credibility-Enhanced Trade-off Principle",
          "statement": "When central banks have strong credibility for maintaining low inflation, the short-run trade-off between inflation and unemployment improves significantly. With anchored inflation expectations, supply shocks and demand fluctuations have smaller and more temporary effects on inflation, allowing for more stabilization of real economic activity. This principle explains why independent, transparent central banks with clear inflation targets can achieve better macroeconomic outcomes than discretionary policymakers.",
          "application": "This principle underpins inflation targeting regimes, explains the Great Moderation period of stable growth with low inflation, and guides central bank communication strategies designed to manage expectations.",
          "example": "During the 2008 financial crisis, many inflation-targeting central banks were able to implement massive stimulus without triggering inflation expectations because their credibility anchored expectations despite unusual policy actions.",
          "analogy": "Like a well-respected captain navigating stormy seas—the crew (market participants) trusts the captain's (central bank's) ability to reach the destination (price stability), so they don't panic and make destabilizing moves at every wave (economic shock), making the journey smoother for everyone.",
          "image": {
            "url": "/images/economics/credibility-enhanced-tradeoff.svg",
            "alt": "Credibility-Enhanced Trade-off Principle",
            "caption": "How policy credibility improves economic outcomes"
          }
        }
      ]
    }
  ],
  "key_terms": [
    "Phillips Curve",
    "Inflation-Unemployment Trade-off",
    "Natural Rate of Unemployment",
    "Expectations-Augmented Phillips Curve",
    "Adaptive Expectations",
    "Accelerationist Hypothesis",
    "Sacrifice Ratio",
    "Stagflation",
    "New Keynesian Phillips Curve",
    "Nominal Rigidities",
    "Policy Credibility",
    "Inflation Expectations",
    "Short-run vs Long-run",
    "Vertical Long-run Phillips Curve",
    "Marginal Cost",
    "Forward-looking Expectations",
    "Flattening Phillips Curve",
    "Disinflation",
    "Supply Shocks",
    "Fine-tuning"
  ],
  "summary": "The Phillips Curve has evolved from an apparently stable empirical relationship between wage inflation and unemployment to a sophisticated framework incorporating expectations, supply shocks, and nominal rigidities. The original Phillips Curve suggested a stable trade-off that policymakers could exploit, but this relationship broke down in the 1970s with the emergence of stagflation. The expectations-augmented Phillips Curve developed by Friedman and Phelps explained this breakdown by incorporating inflation expectations, demonstrating that there is no long-run trade-off between inflation and unemployment. Modern New Keynesian Phillips Curves incorporate forward-looking expectations and microfoundations, while recognizing that short-run trade-offs persist due to price and wage stickiness. Despite empirical challenges including the apparent flattening of the Phillips Curve in recent decades, the framework remains essential for understanding inflation dynamics, conducting monetary policy, and explaining why disinflation remains costly even with credible central banks. The evolution of the Phillips Curve represents one of the most important developments in macroeconomic theory, with profound implications for economic policy design and implementation."
}
