{
  "expanded_description": "For decades, economists believed there was a stable tradeoff between inflation and unemployment: lower unemployment meant higher inflation, and vice versa. This relationship, captured by the Phillips Curve, guided economic policy for years. Then, in the 1970s, both inflation and unemployment rose together - something the simple Phillips Curve said couldn't happen. This led to a revolution in macroeconomic thinking, with economists distinguishing between the short-run and long-run Phillips curves. Understanding this evolution is essential for grasping modern monetary policy and the limits of what policy can achieve.",
  
  "core_concept": {
    "principle": "The Phillips Curve illustrates the relationship between inflation and unemployment. In the short run, there is typically an inverse relationship: lower unemployment is associated with higher inflation. In the long run, however, the curve is vertical at the natural rate of unemployment - there is no permanent tradeoff between inflation and unemployment. Attempts to keep unemployment below the natural rate only lead to ever-accelerating inflation.",
    "explanation": "Imagine an economy with some slack. If the central bank stimulates demand, unemployment falls, but wages and prices begin to rise - that's the short-run Phillips Curve. But if the economy is already at full employment, more stimulus just creates inflation without reducing unemployment. Worse, if people come to expect that inflation, they'll demand higher wages, shifting the short-run curve. In the long run, unemployment returns to its natural rate, but at a higher inflation rate. This insight, developed by Milton Friedman and Edmund Phelps, revolutionized how we think about the inflation-unemployment relationship. It explains why the 1970s saw both high inflation and high unemployment (stagflation) - expectations had become unanchored.",
    "image": {
      "src": "images/unit9/phillips_curve.png",
      "alt": "Graph showing short-run Phillips curves (downward sloping) at different expected inflation rates, and the long-run Phillips curve (vertical) at the natural rate of unemployment",
      "caption": "The short-run Phillips curve slopes down, but the long-run Phillips curve is vertical at the natural rate of unemployment."
    }
  },

  "sections": [
    {
      "section_title": "9.9 The Phillips Curve",
      "introduction": "In the 1950s, economist A.W. Phillips noticed something interesting: when unemployment was low, wages tended to rise quickly; when unemployment was high, wages rose slowly. This relationship - lower unemployment, higher inflation - became known as the Phillips Curve. For years, policy makers thought they could choose their preferred point on the curve: accept a little more inflation to get lower unemployment. Then the 1970s proved them wrong. In this section, we'll explore the Phillips Curve, why it broke down, and what modern economics says about the inflation-unemployment relationship.",
      
      "key_concept": {
        "definition": "The Phillips Curve represents the inverse relationship between the rate of inflation and the rate of unemployment. In its original form (the short-run Phillips curve), lower unemployment is associated with higher inflation. The long-run Phillips curve is vertical at the natural rate of unemployment, indicating no permanent tradeoff. The relationship can be expressed as: $\\pi = \\pi^e - \\beta(U - U_n) + \\epsilon$, where $\\pi$ is actual inflation, $\\pi^e$ is expected inflation, $U$ is unemployment, $U_n$ is the natural rate, and $\\epsilon$ represents supply shocks.",
        "context": "The Phillips Curve was originally an empirical relationship discovered by A.W. Phillips in 1958 based on UK data. It seemed to offer policy makers a menu of choices: they could accept higher inflation to achieve lower unemployment. In the 1960s, Milton Friedman and Edmund Phelps argued that this tradeoff was only temporary - that in the long run, unemployment would return to its natural rate regardless of inflation. The 1970s stagflation proved them right: both inflation and unemployment rose together, something the simple Phillips Curve couldn't explain. This led to the expectations-augmented Phillips Curve, which distinguishes between short-run and long-run relationships. Today, the Phillips Curve remains a key framework for monetary policy, though its stability is debated."
      },

      "categories": [
        {
          "type": "The Original Phillips Curve",
          "description": "The empirical relationship discovered by A.W. Phillips in 1958.",
          "examples": [
            {
              "process": "Phillips' discovery",
              "explanation": "A.W. Phillips plotted data on unemployment and wage inflation in the UK from 1861-1957 and found a clear inverse relationship: when unemployment was low, wages rose quickly; when unemployment was high, wage increases were modest. This relationship seemed stable over long periods."
            },
            {
              "process": "Policy implications",
              "explanation": "The Phillips Curve suggested policy makers faced a tradeoff. They could choose lower unemployment at the cost of higher inflation, or lower inflation at the cost of higher unemployment. This seemed to offer a menu of policy options."
            },
            {
              "process": "Graphical representation",
              "explanation": "The original Phillips Curve is a downward-sloping curve with unemployment on the horizontal axis and inflation on the vertical axis. It appeared to be stable and reliable."
            }
          ]
        },
        {
          "type": "The Expectations-Augmented Phillips Curve",
          "description": "Friedman and Phelps' insight that expectations matter, distinguishing short-run from long-run.",
          "examples": [
            {
              "process": "Role of expectations",
              "explanation": "Friedman and Phelps argued that the Phillips Curve tradeoff was only temporary because it depended on inflation expectations. If the central bank tried to reduce unemployment below the natural rate, inflation would rise. Once people expected that higher inflation, the short-run curve would shift, and unemployment would return to the natural rate at the new, higher inflation."
            },
            {
              "process": "Short-run vs. long-run",
              "explanation": "In the short run, there is a tradeoff because expectations are fixed. In the long run, expectations adjust, and the curve is vertical at the natural rate. There is no permanent tradeoff between inflation and unemployment."
            },
            {
              "process": "The equation",
              "explanation": "$\\pi = \\pi^e - \\beta(U - U_n) + \\epsilon$. When actual inflation equals expected inflation ($\\pi = \\pi^e$) and there are no supply shocks ($\\epsilon = 0$), then $U = U_n$ - unemployment equals the natural rate."
            }
          ]
        },
        {
          "type": "The Breakdown of the 1970s",
          "description": "The 1970s stagflation challenged the simple Phillips Curve and validated the expectations-augmented version.",
          "examples": [
            {
              "process": "Stagflation",
              "explanation": "In the 1970s, both inflation and unemployment rose together - stagflation. This was impossible on the simple Phillips Curve, which showed a tradeoff. But it's exactly what the expectations-augmented Phillips Curve predicts when inflation expectations rise and supply shocks hit."
            },
            {
              "process": "Role of oil shocks",
              "explanation": "The 1973 and 1979 oil shocks were negative supply shocks ($\\epsilon$), which raised both inflation and unemployment. At the same time, inflation expectations became unanchored, shifting the short-run Phillips curve upward."
            },
            {
              "process": "Policy lessons",
              "explanation": "The experience taught policy makers that trying to keep unemployment below the natural rate would only lead to ever-accelerating inflation. This led to the natural rate hypothesis and the focus on inflation targeting."
            }
          ]
        },
        {
          "type": "Modern Phillips Curve",
          "description": "Today's Phillips Curve incorporates expectations, supply shocks, and is used for policy analysis.",
          "examples": [
            {
              "process": "Central bank use",
              "explanation": "Central banks use Phillips Curve models to forecast inflation and guide policy. If unemployment is below the natural rate, they expect inflation to rise and may tighten policy. If unemployment is above the natural rate, they expect inflation to fall and may ease."
            },
            {
              "process": "Flatness debate",
              "explanation": "In recent decades, the Phillips Curve appears to have flattened - inflation responds less to changes in unemployment than in the past. This may be due to anchored expectations, globalization, or structural changes. It's a subject of active debate."
            },
            {
              "process": "Role of expectations",
              "explanation": "With well-anchored expectations, the short-run Phillips curve is relatively stable, and the costs of reducing inflation are lower. This is why central banks work so hard to maintain credibility."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "There Is a Short-Run Tradeoff Between Inflation and Unemployment",
          "statement": "In the short run, when expectations are fixed, there is an inverse relationship between inflation and unemployment. Expansionary policy can reduce unemployment below the natural rate, but at the cost of higher inflation. Contractionary policy can reduce inflation, but at the cost of higher unemployment.",
          "application": "This principle guides short-term policy decisions. If the economy is in a recession with high unemployment, central banks can stimulate demand, accepting temporarily higher inflation to reduce unemployment. If the economy is overheating, they can cool it, accepting temporarily higher unemployment to reduce inflation.",
          "example": "During the 2008 financial crisis, the Federal Reserve cut interest rates to near zero and engaged in quantitative easing to stimulate the economy. This was expected to increase inflation, but with unemployment soaring, the tradeoff was worth it. In fact, inflation remained low, showing that the short-run tradeoff can be weak in deep recessions."
        },
        {
          "principle": "There Is No Long-Run Tradeoff - The Long-Run Phillips Curve Is Vertical",
          "statement": "In the long run, unemployment returns to its natural rate regardless of inflation. Attempts to keep unemployment below the natural rate through expansionary policy will only lead to ever-accelerating inflation. The natural rate is determined by real factors (labor market structure, technology, demographics), not by monetary policy.",
          "application": "This principle sets the limits of monetary policy. Central banks can smooth business cycles and keep inflation low, but they cannot permanently reduce unemployment below its natural rate. Attempts to do so will fail and cause high inflation. This is why central banks focus on price stability and let real factors determine long-run unemployment.",
          "example": "In the 1960s, policy makers believed they could maintain 4% unemployment permanently. They ran expansionary policies to achieve this. Initially, unemployment fell and inflation rose modestly. But by the 1970s, inflation expectations had risen, and unemployment returned to its natural rate (estimated at 6%) while inflation remained high. The attempt to beat the natural rate failed."
        },
        {
          "principle": "Inflation Expectations Shift the Short-Run Phillips Curve",
          "statement": "The short-run Phillips curve is positioned by expected inflation. If people expect higher inflation, the entire curve shifts up - any given unemployment rate is associated with higher actual inflation. Anchoring expectations at a low level is crucial for maintaining low inflation.",
          "application": "This principle explains why central banks communicate so carefully. If the public believes the central bank will keep inflation at 2%, then the short-run Phillips curve will be positioned at 2% expected inflation. This makes it easier to keep actual inflation low. If expectations become unanchored, it's costly to bring them back down.",
          "example": "In the early 1980s, Fed Chair Paul Volcker needed to reduce inflation from double digits. To do so, he had to break inflation expectations. He raised interest rates dramatically, causing a severe recession. Unemployment peaked at 10.8% in 1982. But the recession broke the wage-price spiral and re-anchored expectations at a lower level, allowing the recovery that followed."
        },
        {
          "principle": "Supply Shifts Can Cause Both Inflation and Unemployment to Rise",
          "statement": "The Phillips Curve framework includes supply shocks ($\\epsilon$) that can move inflation and unemployment in the same direction. An adverse supply shock (like an oil price increase) raises both inflation and unemployment - stagflation. This cannot be explained by the simple Phillips Curve but is captured in the modern version.",
          "application": "This principle helps policy makers distinguish between demand-driven and supply-driven inflation. Supply shocks create a dilemma because the usual policy tools can't address both problems simultaneously. This is why central banks may 'look through' temporary supply shocks if they believe they won't affect expectations.",
          "example": "In 2021-2022, supply chain disruptions and energy price increases contributed to rising inflation while the economy was recovering from the pandemic. This looked like stagflation. The Fed faced a dilemma: tighten to fight inflation (risking recession) or wait for supply chains to heal. Initially they waited, then tightened aggressively as inflation persisted."
        }
      ],

      "worked_examples": [
        {
          "title": "Understanding the Short-Run Phillips Curve",
          "problem": "An economy has a natural rate of unemployment of 5%. The short-run Phillips curve is given by $\\pi = \\pi^e - 0.5(U - 5) + \\epsilon$, where $\\pi$ and $\\pi^e$ are in percentage points. Expected inflation is 2%. a) If actual unemployment is 4%, what is the inflation rate (assuming no supply shocks)? b) If actual unemployment is 6%, what is the inflation rate? c) If expected inflation rises to 4%, what happens to the inflation rate at 4% unemployment? d) Graph the short-run Phillips curves for both expected inflation rates.",
          "step_by_step": [
            {
              "step": "Calculate inflation at 4% unemployment with 2% expected inflation",
              "explanation": "$\\pi = 2 - 0.5(4 - 5) + 0 = 2 - 0.5(-1) = 2 + 0.5 = 2.5\\%$."
            },
            {
              "step": "Calculate inflation at 6% unemployment with 2% expected inflation",
              "explanation": "$\\pi = 2 - 0.5(6 - 5) = 2 - 0.5(1) = 2 - 0.5 = 1.5\\%$."
            },
            {
              "step": "Calculate inflation with higher expected inflation",
              "explanation": "With $\\pi^e = 4\\%$, at 4% unemployment: $\\pi = 4 - 0.5(4 - 5) = 4 + 0.5 = 4.5\\%$."
            },
            {
              "step": "Graph interpretation",
              "explanation": "The short-run Phillips curve with $\\pi^e = 2\\%$ passes through points (4%, 2.5%) and (6%, 1.5%). With $\\pi^e = 4\\%$, the curve shifts up by 2 percentage points, passing through (4%, 4.5%) and (6%, 3.5%). The natural rate (5%) is the same, but inflation at the natural rate rises from 2% to 4%."
            }
          ],
          "final_answer": "a) At 4% unemployment, inflation = 2.5%. b) At 6% unemployment, inflation = 1.5%. c) With higher expected inflation, inflation at 4% unemployment = 4.5%. d) Higher expected inflation shifts the short-run Phillips curve upward.",
          "concept_applied": "The short-run Phillips curve shows the tradeoff between inflation and unemployment for a given expected inflation rate. Higher expected inflation shifts the curve upward."
        },
        {
          "title": "The Long-Run Phillips Curve",
          "problem": "The natural rate of unemployment is 5%. The central bank wants to reduce unemployment to 4% permanently. a) According to the expectations-augmented Phillips curve, what will happen in the short run if they succeed? b) What will happen to inflation expectations over time? c) What will be the long-run outcome? d) Why can't the central bank permanently reduce unemployment below the natural rate?",
          "step_by_step": [
            {
              "step": "Short-run effect",
              "explanation": "In the short run, with fixed expectations, reducing unemployment to 4% will increase inflation. From the Phillips curve $\\pi = \\pi^e - 0.5(U - U_n)$, with $U=4$, $U_n=5$, $\\pi = \\pi^e + 0.5$. Inflation rises by 0.5 percentage points above expected inflation."
            },
            {
              "step": "Expectations adjustment",
              "explanation": "Over time, people will observe higher inflation and revise their expectations upward. Expected inflation will rise toward actual inflation. This shifts the short-run Phillips curve upward."
            },
            {
              "step": "Long-run outcome",
              "explanation": "In the long run, expectations fully adjust until expected inflation equals actual inflation. At that point, the Phillips curve equation gives $U = U_n$ regardless of inflation. Unemployment returns to 5%, but at a higher inflation rate than initially."
            },
            {
              "step": "Explanation of limit",
              "explanation": "The central bank cannot permanently reduce unemployment below the natural rate because there is no long-run tradeoff. Any attempt to do so only leads to higher and higher inflation as expectations adjust. Eventually, unemployment returns to the natural rate at whatever inflation rate people have come to expect."
            }
          ],
          "final_answer": "a) Short run: inflation rises. b) Expectations will rise over time. c) Long run: unemployment returns to 5% with higher inflation. d) No long-run tradeoff because expectations adjust, making the long-run Phillips curve vertical.",
          "concept_applied": "The long-run Phillips curve is vertical at the natural rate. Attempts to keep unemployment below the natural rate only cause ever-accelerating inflation as expectations adjust."
        },
        {
          "title": "Analyzing a Supply Shock",
          "problem": "An economy has a natural rate of 5% and expected inflation of 2%. The Phillips curve is $\\pi = \\pi^e - 0.5(U - 5) + \\epsilon$. A negative supply shock ($\\epsilon = 3$) hits the economy. a) If unemployment remains at 5%, what happens to inflation? b) If the central bank tries to keep inflation at 2%, what must happen to unemployment? c) What policy dilemma does this create? d) How does this relate to the 1970s experience?",
          "step_by_step": [
            {
              "step": "Calculate inflation with shock at natural rate",
              "explanation": "$\\pi = 2 - 0.5(5 - 5) + 3 = 2 + 0 + 3 = 5\\%$. Inflation rises to 5% even though unemployment is at the natural rate."
            },
            {
              "step": "Calculate unemployment needed to keep inflation at 2%",
              "explanation": "Set $\\pi = 2$: $2 = 2 - 0.5(U - 5) + 3$ → $0 = -0.5(U - 5) + 3$ → $0.5(U - 5) = 3$ → $U - 5 = 6$ → $U = 11\\%$."
            },
            {
              "step": "Identify policy dilemma",
              "explanation": "The central bank faces a choice: accept higher inflation (5%) with unemployment at the natural rate (5%), or fight inflation by raising unemployment to 11% (a severe recession). There's no good option. This is the dilemma of supply shocks."
            },
            {
              "step": "Connect to 1970s",
              "explanation": "In the 1970s, oil shocks acted like this supply shock. Inflation rose even though unemployment was not below the natural rate. Policy makers faced exactly this dilemma. Some tried to fight inflation with contractionary policy, increasing unemployment. Others accommodated, letting inflation rise. The result was stagflation - both high inflation and high unemployment."
            }
          ],
          "final_answer": "a) At U=5%, inflation rises to 5%. b) To keep inflation at 2%, unemployment must rise to 11%. c) Dilemma: accept higher inflation or cause a recession. d) The 1970s oil shocks created exactly this situation, leading to stagflation.",
          "concept_applied": "Supply shocks shift the Phillips curve, creating stagflation (higher inflation and higher unemployment) and posing a difficult policy dilemma. This cannot be explained by the simple Phillips curve but is captured in the expectations-augmented version."
        }
      ],

      "image": {
        "src": "images/unit9/phillips_curve_shifts.png",
        "alt": "Graph showing multiple short-run Phillips curves at different expected inflation levels, with the long-run vertical Phillips curve intersecting them at the natural rate",
        "caption": "The short-run Phillips curve shifts with expected inflation. The long-run Phillips curve is vertical at the natural rate of unemployment."
      }
    }
  ],

  "key_terms": [
    "Phillips Curve",
    "Short-run Phillips curve",
    "Long-run Phillips curve",
    "Natural rate of unemployment",
    "NAIRU",
    "Expectations-augmented Phillips curve",
    "Inflation expectations",
    "Stagflation",
    "Supply shock",
    "Demand shock",
    "Tradeoff",
    "Vertical long-run curve",
    "Natural rate hypothesis",
    "Adaptive expectations",
    "Rational expectations",
    "A.W. Phillips",
    "Milton Friedman",
    "Edmund Phelps",
    "Sacrifice ratio",
    "Disinflation"
  ],

  "summary": "The Phillips Curve illustrates the relationship between inflation and unemployment. Discovered by A.W. Phillips in 1958, the original curve showed a stable inverse relationship: lower unemployment was associated with higher inflation. This seemed to offer policy makers a menu of choices. However, in the 1960s, Milton Friedman and Edmund Phelps argued that this tradeoff was only temporary because it depended on inflation expectations. They developed the expectations-augmented Phillips curve, which distinguishes between short-run and long-run relationships. In the short run, when expectations are fixed, there is an inverse relationship: expansionary policy can reduce unemployment below the natural rate at the cost of higher inflation. In the long run, however, expectations adjust, and the Phillips curve is vertical at the natural rate of unemployment. There is no permanent tradeoff between inflation and unemployment. Attempts to keep unemployment below the natural rate only lead to ever-accelerating inflation as expectations rise. The 1970s stagflation - simultaneous high inflation and high unemployment - validated this view. The oil shocks were negative supply shocks that raised both inflation and unemployment, while unanchored expectations shifted the short-run curve upward. The modern Phillips curve is expressed as: $\\pi = \\pi^e - \\beta(U - U_n) + \\epsilon$, where $\\pi$ is actual inflation, $\\pi^e$ is expected inflation, $U$ is unemployment, $U_n$ is the natural rate, and $\\epsilon$ represents supply shocks. This framework is central to monetary policy. Central banks use Phillips curve models to forecast inflation and guide policy. When unemployment is below the natural rate, they expect inflation to rise and may tighten. When above, they expect inflation to fall and may ease. The curve also explains why anchoring inflation expectations is crucial: with well-anchored expectations, the short-run curve is stable, and the costs of reducing inflation are lower. The Phillips curve remains a key concept in macroeconomics, though its stability and slope are subjects of ongoing debate."
}
