{
  "course": "AP Macroeconomics",
  "topic": "Development and Global Economics",
  "problems": [
    {
      "number": 1,
      "problem": "Define economic development.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Economic development refers to improvements in standards of living, health, education, and income levels, not just growth in GDP."
        }
      ],
      "final_answer": "Economic development: improvement in living standards, health, education, and income, beyond GDP growth."
    },
    {
      "number": 2,
      "problem": "Differentiate economic growth and economic development.",
      "image": null,
      "step_by_step": [
        {
          "step": "Economic growth",
          "explanation": "Increase in a country's output of goods and services, measured by GDP."
        },
        {
          "step": "Economic development",
          "explanation": "Improvement in overall well-being, including social and economic indicators, not just output."
        }
      ],
      "final_answer": "Growth: ↑ GDP; Development: ↑ well-being (income, health, education)."
    },
    {
      "number": 3,
      "problem": "Explain the role of institutions in economic development.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "Strong institutions (rule of law, property rights, transparent governance) encourage investment, innovation, and equitable resource allocation."
        }
      ],
      "final_answer": "Institutions: rule of law, property rights, governance → ↑ investment, innovation, equitable growth."
    },
    {
      "number": 4,
      "problem": "Define human development index (HDI) and its components.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "HDI measures a country's social and economic development using life expectancy, education, and per capita income."
        }
      ],
      "final_answer": "HDI: composite index of life expectancy, education, and per capita income."
    },
    {
      "number": 5,
      "problem": "Explain the role of foreign aid in development.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "Foreign aid provides financial resources, technology, and expertise to support infrastructure, education, health, and economic growth in developing countries."
        }
      ],
      "final_answer": "Foreign aid: financial & technical support to boost growth, infrastructure, and human development."
    },
    {
      "number": 6,
      "problem": "Explain the role of international trade in development.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "Trade allows countries to specialize according to comparative advantage, gain access to larger markets, and increase income and employment."
        }
      ],
      "final_answer": "International trade: specialization + access to markets → ↑ income, employment, development."
    },
    {
      "number": 7,
      "problem": "Explain the concept of sustainable development.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Sustainable development meets present needs without compromising the ability of future generations to meet their needs, balancing economic, social, and environmental goals."
        }
      ],
      "final_answer": "Sustainable development: meet present needs without harming future generations, balance economy, society, environment."
    },
    {
      "number": 8,
      "problem": "Explain the role of globalization in economic development.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "Globalization increases trade, investment, technology transfer, and knowledge sharing, promoting faster economic development, but may also create inequality."
        }
      ],
      "final_answer": "Globalization: ↑ trade, investment, tech transfer → faster development, potential inequality."
    },
    {
      "number": 9,
      "problem": "Explain the impact of income inequality on development.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "High income inequality can reduce social cohesion, limit access to education and health for the poor, and hinder sustainable development."
        }
      ],
      "final_answer": "Income inequality: ↓ social cohesion, ↓ access to services → hinders development."
    },
    {
      "number": 10,
      "problem": "Explain the difference between nominal and PPP-adjusted GDP in comparing countries' development.",
      "image": null,
      "step_by_step": [
        {
          "step": "Nominal GDP",
          "explanation": "Measured in current exchange rates; may misrepresent living standards due to price level differences."
        },
        {
          "step": "PPP-adjusted GDP",
          "explanation": "Adjusted for differences in cost of living; provides better comparison of real purchasing power and development."
        }
      ],
      "final_answer": "Nominal GDP: current exchange rates; PPP GDP: adjusts for price differences → better measure of development."
    }
  ]
}
