{
  "course": "AP Macroeconomics",
  "topic": "Economic Growth and Productivity",
  "problems": [
    {
      "number": 1,
      "problem": "Define economic growth.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Economic growth is the increase in a country's output of goods and services over time, usually measured by growth in real GDP."
        }
      ],
      "final_answer": "Economic growth: increase in a country's real GDP over time."
    },
    {
      "number": 2,
      "problem": "Differentiate short-run and long-run economic growth.",
      "image": null,
      "step_by_step": [
        {
          "step": "Short-run growth",
          "explanation": "Occurs due to increases in aggregate demand or utilization of idle resources; may be temporary."
        },
        {
          "step": "Long-run growth",
          "explanation": "Sustained increase in potential output due to improvements in factors like capital, labor, technology, and productivity."
        }
      ],
      "final_answer": "Short-run: temporary, AD-driven; Long-run: sustained, due to capital, labor, technology improvements."
    },
    {
      "number": 3,
      "problem": "Define productivity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Productivity measures output per unit of input, often labor productivity (output per worker)."
        }
      ],
      "final_answer": "Productivity: output per unit of input (e.g., output per worker)."
    },
    {
      "number": 4,
      "problem": "Explain factors that contribute to economic growth.",
      "image": null,
      "step_by_step": [
        {
          "step": "Factors",
          "explanation": "1) Capital accumulation, 2) Labor force growth, 3) Technological progress, 4) Human capital development, 5) Infrastructure investment, 6) Institutions and policies."
        }
      ],
      "final_answer": "Growth factors: capital, labor, technology, human capital, infrastructure, institutions."
    },
    {
      "number": 5,
      "problem": "Explain the role of human capital in productivity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "Investment in education, skills, and training improves worker efficiency and output, raising overall productivity and economic growth."
        }
      ],
      "final_answer": "Human capital: education/skills → ↑ worker efficiency → ↑ productivity & growth."
    },
    {
      "number": 6,
      "problem": "Explain the role of technological progress in economic growth.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "Advances in technology increase output from the same inputs, shift production possibilities frontier outward, and raise long-run growth."
        }
      ],
      "final_answer": "Technology: ↑ output from same inputs → outward PPF → long-run growth."
    },
    {
      "number": 7,
      "problem": "Explain the effect of capital accumulation on productivity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "More physical capital (machines, equipment) allows workers to produce more output per hour, increasing productivity and economic growth."
        }
      ],
      "final_answer": "Capital accumulation: ↑ machinery/equipment → ↑ output per worker → ↑ productivity."
    },
    {
      "number": 8,
      "problem": "Explain the concept of catch-up growth.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Economies with lower initial productivity can grow faster than developed economies by adopting existing technologies and practices."
        }
      ],
      "final_answer": "Catch-up growth: lower-productivity economies grow faster by adopting existing tech and practices."
    },
    {
      "number": 9,
      "problem": "Explain the impact of institutions on economic growth.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "Strong institutions (rule of law, property rights, efficient bureaucracy) create an environment conducive to investment, innovation, and sustained growth."
        }
      ],
      "final_answer": "Institutions: rule of law, property rights, efficient governance → ↑ investment & growth."
    },
    {
      "number": 10,
      "problem": "Explain the difference between nominal and real GDP growth in measuring economic growth.",
      "image": null,
      "step_by_step": [
        {
          "step": "Nominal GDP growth",
          "explanation": "Measured in current prices; affected by inflation."
        },
        {
          "step": "Real GDP growth",
          "explanation": "Adjusted for inflation; reflects true increase in output and economic growth."
        }
      ],
      "final_answer": "Nominal GDP growth: current prices, includes inflation; Real GDP growth: adjusted for inflation, shows true output increase."
    }
  ]
}
