{
  "course": "AP Macroeconomics",
  "topic": "Money, Banking, and Financial Systems",
  "problems": [
    {
      "number": 1,
      "problem": "Define money and its functions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Money is any item or record widely accepted as payment for goods and services."
        },
        {
          "step": "Functions",
          "explanation": "Money serves as a medium of exchange, a unit of account, a store of value, and sometimes a standard of deferred payment."
        }
      ],
      "final_answer": "Money: accepted payment medium; functions: exchange, unit of account, store of value, deferred payment."
    },
    {
      "number": 2,
      "problem": "Differentiate M1 and M2 money supply.",
      "image": null,
      "step_by_step": [
        {
          "step": "M1",
          "explanation": "M1 includes currency, coins, and checkable deposits; money that is highly liquid."
        },
        {
          "step": "M2",
          "explanation": "M2 includes M1 plus savings deposits, time deposits, and money market funds; less liquid but accessible."
        }
      ],
      "final_answer": "M1 = currency + checkable deposits; M2 = M1 + savings/time deposits + money market funds."
    },
    {
      "number": 3,
      "problem": "Define central bank and its roles.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "A central bank is a national institution that manages the country's money supply and monetary policy."
        },
        {
          "step": "Roles",
          "explanation": "Regulates banks, issues currency, controls interest rates, acts as lender of last resort, and stabilizes economy."
        }
      ],
      "final_answer": "Central bank: manages money supply and monetary policy; roles: regulate banks, issue currency, control rates, lender of last resort, stabilize economy."
    },
    {
      "number": 4,
      "problem": "Define commercial banks and their functions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Commercial banks are financial institutions that accept deposits, provide loans, and offer financial services to the public."
        },
        {
          "step": "Functions",
          "explanation": "Accept deposits, provide loans, facilitate payments, and create credit."
        }
      ],
      "final_answer": "Commercial banks: accept deposits, provide loans, facilitate payments, create credit."
    },
    {
      "number": 5,
      "problem": "Explain the money creation process by commercial banks.",
      "image": null,
      "step_by_step": [
        {
          "step": "Process",
          "explanation": "When banks receive deposits, they keep a fraction as reserves and lend out the rest; the lent money is deposited and re-lent, creating money through the multiplier effect."
        }
      ],
      "final_answer": "Banks create money by lending deposits → deposits re-lent → multiplier effect increases money supply."
    },
    {
      "number": 6,
      "problem": "Define fractional reserve banking.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Fractional reserve banking is a system where banks keep only a fraction of deposits as reserves and lend the rest to create credit."
        }
      ],
      "final_answer": "Fractional reserve banking: banks hold fraction of deposits as reserves, lend the rest."
    },
    {
      "number": 7,
      "problem": "Define reserve requirement ratio.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The reserve requirement ratio is the fraction of deposits that banks are legally required to keep as reserves."
        }
      ],
      "final_answer": "Reserve requirement ratio: fraction of deposits banks must keep as reserves."
    },
    {
      "number": 8,
      "problem": "Explain the role of the financial system in the economy.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "The financial system channels funds from savers to borrowers, facilitates investment, provides liquidity, and supports economic growth."
        }
      ],
      "final_answer": "Financial system: channels funds, facilitates investment, provides liquidity, supports growth."
    },
    {
      "number": 9,
      "problem": "Define interest rate and its economic significance.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Interest rate is the cost of borrowing money or the return on savings."
        },
        {
          "step": "Significance",
          "explanation": "It influences borrowing, lending, consumption, investment, and overall economic activity."
        }
      ],
      "final_answer": "Interest rate: cost of borrowing/return on savings; affects consumption, investment, and economy."
    },
    {
      "number": 10,
      "problem": "Explain the difference between money market and capital market.",
      "image": null,
      "step_by_step": [
        {
          "step": "Money market",
          "explanation": "Short-term debt instruments (maturity < 1 year); highly liquid; e.g., treasury bills, commercial paper."
        },
        {
          "step": "Capital market",
          "explanation": "Long-term securities (maturity > 1 year); includes stocks and bonds; used for long-term financing."
        }
      ],
      "final_answer": "Money market = short-term, liquid instruments; Capital market = long-term securities for financing."
    }
  ]
}
