{
  "course": "AP Biology",
  "topic": "Biotechnology",
  "problems": [
    {
      "number": 1,
      "problem": "Explain the basic steps of recombinant DNA technology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Isolate DNA",
          "explanation": "Extract the gene of interest from an organism."
        },
        {
          "step": "Cut DNA",
          "explanation": "Use restriction enzymes to cut DNA at specific sequences."
        },
        {
          "step": "Insert into vector",
          "explanation": "Ligate the gene into a plasmid or other vector."
        },
        {
          "step": "Introduce into host",
          "explanation": "Transform bacteria or other cells with the recombinant DNA."
        }
      ],
      "final_answer": "Recombinant DNA involves isolating a gene, cutting it, inserting into a vector, and introducing it into a host."
    },
    {
      "number": 2,
      "problem": "Describe the function of restriction enzymes in biotechnology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify function",
          "explanation": "Restriction enzymes recognize specific DNA sequences and cut the DNA at those sites."
        },
        {
          "step": "Significance",
          "explanation": "They allow precise insertion or removal of genes for cloning and analysis."
        }
      ],
      "final_answer": "Restriction enzymes cut DNA at specific sequences, enabling gene cloning and recombinant DNA technology."
    },
    {
      "number": 3,
      "problem": "Explain how gel electrophoresis separates DNA fragments.",
      "image": null,
      "step_by_step": [
        {
          "step": "Prepare gel",
          "explanation": "Agarose gel is used as a medium for DNA migration."
        },
        {
          "step": "Apply electric current",
          "explanation": "DNA fragments, negatively charged, move toward the positive electrode."
        },
        {
          "step": "Separation by size",
          "explanation": "Smaller fragments move faster, larger fragments move slower."
        }
      ],
      "final_answer": "Gel electrophoresis separates DNA fragments by size as negatively charged DNA moves through agarose toward the positive electrode."
    },
    {
      "number": 4,
      "problem": "Explain the polymerase chain reaction (PCR) and its purpose.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define PCR",
          "explanation": "PCR is a technique used to amplify a specific DNA segment."
        },
        {
          "step": "Steps",
          "explanation": "1) Denaturation: separate DNA strands, 2) Annealing: primers bind target sequence, 3) Extension: DNA polymerase synthesizes new strands."
        },
        {
          "step": "Purpose",
          "explanation": "Produces millions of copies of a DNA fragment for analysis or cloning."
        }
      ],
      "final_answer": "PCR amplifies DNA by repeated cycles of denaturation, primer annealing, and extension, producing many copies of a target sequence."
    },
    {
      "number": 5,
      "problem": "Describe the use of plasmids in genetic engineering.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define plasmid",
          "explanation": "A small circular DNA molecule in bacteria that can replicate independently."
        },
        {
          "step": "Use in biotechnology",
          "explanation": "Plasmids serve as vectors to carry foreign genes into host cells."
        }
      ],
      "final_answer": "Plasmids are vectors that carry foreign genes into host cells for cloning or protein production."
    },
    {
      "number": 6,
      "problem": "Explain the principle of DNA sequencing.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify target",
          "explanation": "DNA sequencing determines the precise order of nucleotides in a DNA molecule."
        },
        {
          "step": "Method",
          "explanation": "Methods like Sanger sequencing use chain-terminating nucleotides to generate fragments of different lengths."
        },
        {
          "step": "Read sequence",
          "explanation": "Fragments are separated by size, and the nucleotide sequence is determined from the pattern."
        }
      ],
      "final_answer": "DNA sequencing determines the nucleotide order by using chain-terminating nucleotides and analyzing fragment sizes."
    },
    {
      "number": 7,
      "problem": "Explain the purpose of CRISPR-Cas9 in genome editing.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify system",
          "explanation": "CRISPR-Cas9 is a bacterial immune system adapted to edit DNA precisely."
        },
        {
          "step": "Mechanism",
          "explanation": "Guide RNA directs Cas9 nuclease to a specific DNA sequence, where Cas9 makes a double-stranded cut."
        },
        {
          "step": "Outcome",
          "explanation": "The cut can be repaired to introduce mutations or insert desired sequences."
        }
      ],
      "final_answer": "CRISPR-Cas9 edits genomes by using guide RNA to direct Cas9 to cut DNA at precise locations for mutation or insertion."
    },
    {
      "number": 8,
      "problem": "Describe the role of genetically modified organisms (GMOs) in agriculture.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define GMOs",
          "explanation": "Organisms with altered genomes to express desired traits."
        },
        {
          "step": "Applications",
          "explanation": "Crops engineered for pest resistance, herbicide tolerance, or improved nutrition."
        }
      ],
      "final_answer": "GMOs in agriculture are engineered to improve traits like pest resistance, herbicide tolerance, and nutritional content."
    },
    {
      "number": 9,
      "problem": "Explain how DNA fingerprinting is used in forensic science.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify principle",
          "explanation": "DNA fingerprinting analyzes unique patterns of DNA sequences in individuals."
        },
        {
          "step": "Method",
          "explanation": "Uses restriction enzymes and gel electrophoresis to generate fragment patterns."
        },
        {
          "step": "Application",
          "explanation": "Matching DNA from crime scenes to suspects or identifying individuals."
        }
      ],
      "final_answer": "DNA fingerprinting identifies individuals by analyzing unique DNA fragment patterns, useful in forensics and paternity testing."
    },
    {
      "number": 10,
      "problem": "Describe the ethical considerations associated with biotechnology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Consider human health",
          "explanation": "Potential risks from GMOs or gene editing must be assessed."
        },
        {
          "step": "Environmental impact",
          "explanation": "GMOs may affect biodiversity or cause unintended ecological effects."
        },
        {
          "step": "Societal concerns",
          "explanation": "Issues of consent, access, and equity in biotechnology applications."
        }
      ],
      "final_answer": "Biotechnology raises ethical concerns including human health, environmental impact, and societal issues of equity and consent."
    }
  ]
}
