{
  "course": "AP Biology",
  "topic": "Cell Structure and Function",
  "problems": [
    {
      "number": 1,
      "problem": "Describe the structure and function of the cell membrane.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify components",
          "explanation": "The cell membrane is composed of a phospholipid bilayer with embedded proteins, cholesterol, and carbohydrates."
        },
        {
          "step": "Explain functions",
          "explanation": "It regulates the passage of substances in and out of the cell, provides structural support, and facilitates communication with other cells."
        }
      ],
      "final_answer": "The cell membrane is a phospholipid bilayer with proteins and carbohydrates, controlling transport, communication, and structural integrity."
    },
    {
      "number": 2,
      "problem": "Compare prokaryotic and eukaryotic cells.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify prokaryotic features",
          "explanation": "No nucleus, no membrane-bound organelles, DNA in nucleoid, smaller size."
        },
        {
          "step": "Identify eukaryotic features",
          "explanation": "Nucleus, membrane-bound organelles, linear DNA in chromosomes, larger size."
        },
        {
          "step": "Summarize differences",
          "explanation": "Eukaryotes are more complex with compartmentalized functions; prokaryotes are simpler and smaller."
        }
      ],
      "final_answer": "Prokaryotic cells lack a nucleus and organelles; eukaryotic cells have a nucleus and organelles, making them larger and more complex."
    },
    {
      "number": 3,
      "problem": "Explain the function of the nucleus.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify structure",
          "explanation": "The nucleus is surrounded by a double membrane called the nuclear envelope and contains chromatin."
        },
        {
          "step": "Describe function",
          "explanation": "It stores genetic material (DNA), controls cell activities, and directs protein synthesis through transcription."
        }
      ],
      "final_answer": "The nucleus stores DNA and controls cellular activities, directing protein synthesis."
    },
    {
      "number": 4,
      "problem": "What is the role of mitochondria in a cell?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify structure",
          "explanation": "Mitochondria have a double membrane; inner membrane is folded into cristae."
        },
        {
          "step": "Describe function",
          "explanation": "They generate ATP through cellular respiration by converting glucose and oxygen into energy."
        }
      ],
      "final_answer": "Mitochondria produce ATP through cellular respiration, supplying energy for cell activities."
    },
    {
      "number": 5,
      "problem": "Explain the function of ribosomes and where they are found.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify location",
          "explanation": "Ribosomes are found free in the cytoplasm or attached to the rough endoplasmic reticulum."
        },
        {
          "step": "Describe function",
          "explanation": "They synthesize proteins by translating mRNA into polypeptide chains."
        }
      ],
      "final_answer": "Ribosomes are protein synthesis machines, found in the cytoplasm or on the rough ER."
    },
    {
      "number": 6,
      "problem": "Describe the endoplasmic reticulum and differentiate between rough and smooth ER.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify ER structure",
          "explanation": "ER is a network of membranes; rough ER has ribosomes, smooth ER does not."
        },
        {
          "step": "Describe functions",
          "explanation": "Rough ER synthesizes and modifies proteins; smooth ER synthesizes lipids and detoxifies chemicals."
        }
      ],
      "final_answer": "Rough ER synthesizes proteins with ribosomes attached; smooth ER produces lipids and detoxifies substances."
    },
    {
      "number": 7,
      "problem": "Explain the role of lysosomes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify structure",
          "explanation": "Lysosomes are membrane-bound organelles containing digestive enzymes."
        },
        {
          "step": "Describe function",
          "explanation": "They break down macromolecules, recycle cellular components, and destroy pathogens."
        }
      ],
      "final_answer": "Lysosomes digest macromolecules, recycle cell components, and destroy harmful materials."
    },
    {
      "number": 8,
      "problem": "What is the function of the Golgi apparatus?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify structure",
          "explanation": "Golgi apparatus is a stack of flattened membranous sacs."
        },
        {
          "step": "Describe function",
          "explanation": "It modifies, sorts, and packages proteins and lipids for storage or transport."
        }
      ],
      "final_answer": "The Golgi apparatus processes and packages proteins and lipids for transport within or out of the cell."
    },
    {
      "number": 9,
      "problem": "Describe the cytoskeleton and its functions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify components",
          "explanation": "The cytoskeleton is made of microtubules, microfilaments, and intermediate filaments."
        },
        {
          "step": "Describe functions",
          "explanation": "It maintains cell shape, provides support, aids in intracellular transport, and facilitates cell movement."
        }
      ],
      "final_answer": "The cytoskeleton supports cell shape, aids movement, and facilitates transport of organelles."
    },
    {
      "number": 10,
      "problem": "Explain the differences between plant and animal cells.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify plant cell features",
          "explanation": "Plant cells have a cell wall, chloroplasts, and large central vacuole."
        },
        {
          "step": "Identify animal cell features",
          "explanation": "Animal cells lack cell walls and chloroplasts, have smaller vacuoles, and contain centrioles."
        },
        {
          "step": "Compare",
          "explanation": "Plant cells are rigid and perform photosynthesis; animal cells are flexible and rely on other energy sources."
        }
      ],
      "final_answer": "Plant cells have cell walls, chloroplasts, and large vacuoles; animal cells lack these structures and have centrioles."
    }
  ]
}
