{
  "course": "AP Biology",
  "topic": "Cell Communication",
  "problems": [
    {
      "number": 1,
      "problem": "Explain the difference between autocrine, paracrine, and endocrine signaling.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define autocrine signaling",
          "explanation": "Cells release signals that bind to receptors on themselves."
        },
        {
          "step": "Define paracrine signaling",
          "explanation": "Signals are released to affect nearby cells."
        },
        {
          "step": "Define endocrine signaling",
          "explanation": "Signals (hormones) travel through the bloodstream to distant cells."
        }
      ],
      "final_answer": "Autocrine affects the same cell, paracrine affects nearby cells, and endocrine affects distant cells via the blood."
    },
    {
      "number": 2,
      "problem": "Describe the stages of signal transduction.",
      "image": null,
      "step_by_step": [
        {
          "step": "Reception",
          "explanation": "A signaling molecule binds to a receptor on the target cell."
        },
        {
          "step": "Transduction",
          "explanation": "The receptor activates a series of intracellular molecules that amplify the signal."
        },
        {
          "step": "Response",
          "explanation": "The cell performs a specific action, such as gene expression, enzyme activation, or cytoskeletal changes."
        }
      ],
      "final_answer": "Signal transduction involves reception, transduction, and response to convert a signal into a cellular action."
    },
    {
      "number": 3,
      "problem": "Explain how G-protein coupled receptors (GPCRs) work.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify receptor type",
          "explanation": "GPCRs are membrane receptors that interact with G-proteins."
        },
        {
          "step": "Signal binding",
          "explanation": "Ligand binding activates the GPCR."
        },
        {
          "step": "G-protein activation",
          "explanation": "The GPCR activates a G-protein, which exchanges GDP for GTP."
        },
        {
          "step": "Trigger downstream effects",
          "explanation": "The G-protein activates or inhibits target enzymes or ion channels to generate a cellular response."
        }
      ],
      "final_answer": "GPCRs activate G-proteins upon ligand binding, triggering downstream signaling pathways."
    },
    {
      "number": 4,
      "problem": "Describe receptor tyrosine kinases (RTKs) and their role in cell signaling.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify receptor type",
          "explanation": "RTKs are membrane receptors with enzymatic activity that phosphorylate tyrosine residues."
        },
        {
          "step": "Ligand binding and dimerization",
          "explanation": "Two RTKs bind ligands, forming a dimer."
        },
        {
          "step": "Autophosphorylation",
          "explanation": "Each receptor phosphorylates tyrosine residues on the other, activating signaling pathways."
        }
      ],
      "final_answer": "RTKs phosphorylate tyrosines after ligand-induced dimerization, activating downstream signaling for growth and differentiation."
    },
    {
      "number": 5,
      "problem": "Explain the role of second messengers in signal transduction.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define second messengers",
          "explanation": "Small molecules or ions that relay signals from receptors to target molecules inside the cell."
        },
        {
          "step": "Give examples",
          "explanation": "cAMP, Ca²⁺, IP₃, DAG."
        },
        {
          "step": "Explain amplification",
          "explanation": "One signaling molecule can produce many second messenger molecules, amplifying the signal."
        }
      ],
      "final_answer": "Second messengers like cAMP and Ca²⁺ amplify and transmit signals from receptors to intracellular targets."
    },
    {
      "number": 6,
      "problem": "Describe how ion-channel receptors function.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify receptor type",
          "explanation": "Ion-channel receptors are membrane proteins that open or close in response to a signal."
        },
        {
          "step": "Explain function",
          "explanation": "Binding of a ligand opens the channel, allowing specific ions to flow into or out of the cell, changing membrane potential."
        }
      ],
      "final_answer": "Ion-channel receptors open in response to a signal, allowing ions to enter or exit the cell and generate a response."
    },
    {
      "number": 7,
      "problem": "Explain how cAMP acts in the signal transduction pathway.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify pathway",
          "explanation": "cAMP is a second messenger generated by adenylyl cyclase."
        },
        {
          "step": "Activation",
          "explanation": "cAMP activates protein kinase A (PKA)."
        },
        {
          "step": "Cellular response",
          "explanation": "PKA phosphorylates target proteins, leading to metabolic or transcriptional changes."
        }
      ],
      "final_answer": "cAMP activates PKA, which phosphorylates proteins to generate a cellular response."
    },
    {
      "number": 8,
      "problem": "Describe the role of calcium ions (Ca²⁺) in cell signaling.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify function",
          "explanation": "Ca²⁺ acts as a second messenger in many signaling pathways."
        },
        {
          "step": "Mechanism",
          "explanation": "Release of Ca²⁺ from the ER or influx from extracellular space activates proteins and enzymes."
        },
        {
          "step": "Examples",
          "explanation": "Muscle contraction, neurotransmitter release, and enzyme activation."
        }
      ],
      "final_answer": "Ca²⁺ serves as a second messenger that triggers cellular responses like contraction, secretion, and enzyme activation."
    },
    {
      "number": 9,
      "problem": "Explain how signal transduction can result in a gene expression response.",
      "image": null,
      "step_by_step": [
        {
          "step": "Reception and transduction",
          "explanation": "Signal molecules activate intracellular pathways that reach the nucleus."
        },
        {
          "step": "Activation of transcription factors",
          "explanation": "Phosphorylation or conformational changes activate transcription factors."
        },
        {
          "step": "Gene expression",
          "explanation": "Transcription factors bind DNA and initiate transcription, producing proteins as a response."
        }
      ],
      "final_answer": "Signals can activate transcription factors that turn on genes, resulting in specific protein production."
    },
    {
      "number": 10,
      "problem": "Describe apoptosis and the role of cell signaling in programmed cell death.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define apoptosis",
          "explanation": "Programmed cell death that eliminates damaged or unneeded cells."
        },
        {
          "step": "Signal triggers",
          "explanation": "Internal or external signals activate caspases, the enzymes that execute apoptosis."
        },
        {
          "step": "Cellular changes",
          "explanation": "DNA fragmentation, membrane blebbing, and cell shrinkage occur, leading to controlled cell removal."
        }
      ],
      "final_answer": "Apoptosis is programmed cell death triggered by signaling pathways activating caspases, ensuring damaged or unnecessary cells are safely removed."
    }
  ]
}
