{
  "course": "AP Biology",
  "topic": "Cellular Energetics",
  "problems": [
    {
      "number": 1,
      "problem": "Explain the first and second laws of thermodynamics in biological systems.",
      "image": null,
      "step_by_step": [
        {
          "step": "State the first law",
          "explanation": "Energy cannot be created or destroyed; it can only change forms."
        },
        {
          "step": "Apply to cells",
          "explanation": "Cells convert chemical energy from food into ATP and heat."
        },
        {
          "step": "State the second law",
          "explanation": "Every energy transfer increases the entropy of the universe."
        },
        {
          "step": "Apply to cells",
          "explanation": "Energy transformations in cells are never 100% efficient; some energy is lost as heat."
        }
      ],
      "final_answer": "The first law: energy is conserved; the second law: energy transformations increase entropy. Cells obey both, converting food to ATP with some energy lost as heat."
    },
    {
      "number": 2,
      "problem": "Describe the structure and function of ATP.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify structure",
          "explanation": "ATP consists of adenine, ribose sugar, and three phosphate groups."
        },
        {
          "step": "Explain function",
          "explanation": "ATP stores and transfers energy by hydrolyzing the terminal phosphate to release energy."
        }
      ],
      "final_answer": "ATP is the energy currency of the cell, releasing energy when its terminal phosphate is removed."
    },
    {
      "number": 3,
      "problem": "Explain the role of enzymes in cellular reactions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify enzyme function",
          "explanation": "Enzymes are biological catalysts that speed up reactions without being consumed."
        },
        {
          "step": "Describe mechanism",
          "explanation": "They lower the activation energy needed for a reaction, allowing it to proceed faster."
        },
        {
          "step": "Relate to cells",
          "explanation": "Enzymes enable metabolic processes to occur efficiently at physiological temperatures."
        }
      ],
      "final_answer": "Enzymes accelerate chemical reactions by lowering activation energy, enabling efficient metabolism."
    },
    {
      "number": 4,
      "problem": "Describe the process of cellular respiration and its overall equation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify stages",
          "explanation": "Glycolysis, pyruvate oxidation, Krebs cycle, and oxidative phosphorylation."
        },
        {
          "step": "Write overall equation",
          "explanation": "C₆H₁₂O₆ + 6O₂ → 6CO₂ + 6H₂O + ATP"
        },
        {
          "step": "Explain ATP yield",
          "explanation": "One glucose molecule yields about 30–32 ATP in eukaryotic cells."
        }
      ],
      "final_answer": "Cellular respiration converts glucose and oxygen into CO₂, water, and ATP: C₆H₁₂O₆ + 6O₂ → 6CO₂ + 6H₂O + ATP."
    },
    {
      "number": 5,
      "problem": "Compare aerobic and anaerobic respiration.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define aerobic respiration",
          "explanation": "Uses oxygen to fully oxidize glucose to CO₂ and water."
        },
        {
          "step": "Define anaerobic respiration",
          "explanation": "Occurs without oxygen, partially oxidizing glucose, producing lactic acid or ethanol."
        },
        {
          "step": "Compare ATP yield",
          "explanation": "Aerobic respiration produces ~30–32 ATP; anaerobic produces 2 ATP per glucose."
        }
      ],
      "final_answer": "Aerobic respiration requires oxygen and yields more ATP; anaerobic does not require oxygen and yields less ATP with byproducts like lactic acid or ethanol."
    },
    {
      "number": 6,
      "problem": "Describe the light-dependent reactions of photosynthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify location",
          "explanation": "Occurs in the thylakoid membranes of chloroplasts."
        },
        {
          "step": "Explain process",
          "explanation": "Light energy excites electrons in chlorophyll, generating ATP and NADPH while splitting water to release O₂."
        }
      ],
      "final_answer": "Light-dependent reactions convert light energy into chemical energy (ATP and NADPH) and produce oxygen from water."
    },
    {
      "number": 7,
      "problem": "Describe the Calvin cycle (light-independent reactions) of photosynthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify location",
          "explanation": "Occurs in the stroma of the chloroplast."
        },
        {
          "step": "Explain process",
          "explanation": "Uses ATP and NADPH to fix CO₂ into glucose through carbon fixation, reduction, and regeneration of RuBP."
        }
      ],
      "final_answer": "The Calvin cycle uses ATP and NADPH to fix CO₂ into glucose in the chloroplast stroma."
    },
    {
      "number": 8,
      "problem": "Explain the chemiosmotic mechanism of ATP production.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define chemiosmosis",
          "explanation": "Movement of protons (H⁺) across a membrane down their electrochemical gradient to drive ATP synthesis."
        },
        {
          "step": "Relate to mitochondria",
          "explanation": "Protons pumped into the intermembrane space during electron transport flow back through ATP synthase, producing ATP."
        }
      ],
      "final_answer": "Chemiosmosis generates ATP as protons flow through ATP synthase down their gradient, coupling electron transport to energy production."
    },
    {
      "number": 9,
      "problem": "Describe the role of NAD⁺ and FAD in cellular respiration.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify coenzymes",
          "explanation": "NAD⁺ and FAD are electron carriers."
        },
        {
          "step": "Explain function",
          "explanation": "They accept electrons during glycolysis, pyruvate oxidation, and Krebs cycle, becoming NADH and FADH₂, which then donate electrons to the electron transport chain."
        }
      ],
      "final_answer": "NAD⁺ and FAD carry electrons from metabolic pathways to the electron transport chain, facilitating ATP production."
    },
    {
      "number": 10,
      "problem": "Compare the energy yield of glucose metabolism in aerobic respiration versus fermentation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify aerobic yield",
          "explanation": "Complete oxidation of glucose in the presence of oxygen produces ~30–32 ATP per glucose."
        },
        {
          "step": "Identify fermentation yield",
          "explanation": "Partial oxidation without oxygen produces 2 ATP per glucose along with lactic acid or ethanol."
        }
      ],
      "final_answer": "Aerobic respiration yields ~30–32 ATP per glucose; fermentation yields only 2 ATP per glucose."
    }
  ]
}
