{
  "course": "AP Biology",
  "topic": "Chemistry of Life",
  "problems": [
    {
      "number": 1,
      "problem": "Explain why water is considered a polar molecule.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify the atoms in water",
          "explanation": "Water has two hydrogen atoms covalently bonded to one oxygen atom."
        },
        {
          "step": "Examine electron distribution",
          "explanation": "Oxygen is more electronegative than hydrogen, pulling electrons closer to itself."
        },
        {
          "step": "Determine polarity",
          "explanation": "Unequal sharing of electrons creates a partial negative charge on oxygen and partial positive charges on hydrogens."
        }
      ],
      "final_answer": "Water is polar because of its bent shape and unequal electron distribution, resulting in partial charges."
    },
    {
      "number": 2,
      "problem": "Describe the properties of water that support life.",
      "image": null,
      "step_by_step": [
        {
          "step": "List major properties",
          "explanation": "Cohesion, adhesion, high specific heat, solvent ability, and density behavior upon freezing."
        },
        {
          "step": "Explain cohesion and adhesion",
          "explanation": "Cohesion allows water molecules to stick together; adhesion allows water to stick to other surfaces."
        },
        {
          "step": "Explain high specific heat",
          "explanation": "Water absorbs a lot of heat before increasing in temperature, stabilizing temperatures."
        },
        {
          "step": "Explain solvent ability",
          "explanation": "Water dissolves many substances, facilitating biochemical reactions."
        },
        {
          "step": "Explain density behavior",
          "explanation": "Ice floats because it is less dense than liquid water, insulating aquatic life."
        }
      ],
      "final_answer": "Water supports life due to cohesion, adhesion, high specific heat, solvent ability, and ice's lower density than liquid water."
    },
    {
      "number": 3,
      "problem": "Explain the role of carbon in organic molecules.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify carbon properties",
          "explanation": "Carbon has four valence electrons and can form four covalent bonds."
        },
        {
          "step": "Describe versatility",
          "explanation": "Carbon can form chains, rings, and complex structures."
        },
        {
          "step": "Relate to biological molecules",
          "explanation": "This allows formation of carbohydrates, lipids, proteins, and nucleic acids."
        }
      ],
      "final_answer": "Carbon's four covalent bonds and versatility allow it to form the backbone of all organic macromolecules essential for life."
    },
    {
      "number": 4,
      "problem": "Differentiate between dehydration synthesis and hydrolysis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define dehydration synthesis",
          "explanation": "Joining molecules by removing a water molecule."
        },
        {
          "step": "Define hydrolysis",
          "explanation": "Breaking molecules by adding a water molecule."
        },
        {
          "step": "Compare",
          "explanation": "Dehydration builds polymers; hydrolysis breaks polymers into monomers."
        }
      ],
      "final_answer": "Dehydration synthesis builds molecules by removing water; hydrolysis breaks molecules by adding water."
    },
    {
      "number": 5,
      "problem": "List the four major macromolecules and their monomers.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify macromolecules",
          "explanation": "Carbohydrates, lipids, proteins, nucleic acids."
        },
        {
          "step": "Identify monomers",
          "explanation": "Monosaccharides for carbohydrates, glycerol + fatty acids for lipids, amino acids for proteins, nucleotides for nucleic acids."
        }
      ],
      "final_answer": "Carbohydrates → monosaccharides, Lipids → glycerol + fatty acids, Proteins → amino acids, Nucleic acids → nucleotides."
    },
    {
      "number": 6,
      "problem": "Explain the difference between acids and bases and give an example of each.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define acids",
          "explanation": "Acids release H⁺ ions in solution, lowering pH."
        },
        {
          "step": "Define bases",
          "explanation": "Bases accept H⁺ ions or release OH⁻ ions, raising pH."
        },
        {
          "step": "Provide examples",
          "explanation": "Acid: HCl; Base: NaOH"
        }
      ],
      "final_answer": "Acids release H⁺ (e.g., HCl); bases accept H⁺ or release OH⁻ (e.g., NaOH)."
    },
    {
      "number": 7,
      "problem": "Describe the function of buffers in biological systems.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define buffer",
          "explanation": "A buffer is a substance that minimizes pH changes in a solution."
        },
        {
          "step": "Explain mechanism",
          "explanation": "Buffers absorb excess H⁺ or OH⁻ to maintain stable pH."
        },
        {
          "step": "Give example",
          "explanation": "Bicarbonate buffer in blood maintains pH around 7.4."
        }
      ],
      "final_answer": "Buffers maintain stable pH in biological systems by absorbing excess H⁺ or OH⁻, e.g., bicarbonate in blood."
    },
    {
      "number": 8,
      "problem": "Explain the role of hydrogen bonds in the properties of water.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify hydrogen bonds",
          "explanation": "Hydrogen bonds form between the partial positive hydrogen of one water molecule and the partial negative oxygen of another."
        },
        {
          "step": "Relate to cohesion",
          "explanation": "Hydrogen bonding allows water molecules to stick together, enabling surface tension."
        },
        {
          "step": "Relate to temperature regulation",
          "explanation": "Hydrogen bonds require energy to break, giving water a high specific heat."
        },
        {
          "step": "Relate to ice formation",
          "explanation": "Hydrogen bonds hold water molecules apart in ice, making it less dense than liquid water."
        }
      ],
      "final_answer": "Hydrogen bonds in water contribute to cohesion, high specific heat, and ice's lower density, all crucial for life."
    },
    {
      "number": 9,
      "problem": "Describe the structure of an amino acid and identify its functional groups.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify components",
          "explanation": "Amino acids have a central carbon (alpha carbon) bonded to an amino group (NH₂), a carboxyl group (COOH), a hydrogen atom, and an R group (side chain)."
        },
        {
          "step": "Describe functional groups",
          "explanation": "Amino group is basic, carboxyl group is acidic, R group determines chemical properties."
        }
      ],
      "final_answer": "Amino acids consist of a central carbon bonded to an amino group, carboxyl group, hydrogen, and an R group; functional groups determine reactivity and properties."
    },
    {
      "number": 10,
      "problem": "Explain why carbon forms the backbone of all macromolecules in living organisms.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify carbon bonding",
          "explanation": "Carbon can form four stable covalent bonds, allowing for complex and diverse structures."
        },
        {
          "step": "Explain versatility",
          "explanation": "Carbon forms chains, rings, and branches, enabling large molecules with specific functions."
        },
        {
          "step": "Relate to macromolecules",
          "explanation": "This versatility allows formation of carbohydrates, proteins, lipids, and nucleic acids."
        }
      ],
      "final_answer": "Carbon's ability to form four covalent bonds and diverse structures makes it the backbone of all macromolecules essential for life."
    }
  ]
}
