{
  "course": "AP Biology",
  "topic": "Evolution",
  "problems": [
    {
      "number": 1,
      "problem": "Explain natural selection and its role in evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define natural selection",
          "explanation": "Process where individuals with advantageous traits are more likely to survive and reproduce."
        },
        {
          "step": "Role in evolution",
          "explanation": "Favorable traits increase in frequency over generations, leading to adaptation of populations."
        }
      ],
      "final_answer": "Natural selection favors advantageous traits, leading to evolutionary changes in populations over time."
    },
    {
      "number": 2,
      "problem": "Explain the difference between homologous and analogous structures.",
      "image": null,
      "step_by_step": [
        {
          "step": "Homologous structures",
          "explanation": "Structures with similar anatomy due to shared ancestry, may have different functions."
        },
        {
          "step": "Analogous structures",
          "explanation": "Structures with similar function but different ancestry and anatomy."
        }
      ],
      "final_answer": "Homologous: same ancestry, different function; Analogous: different ancestry, similar function."
    },
    {
      "number": 3,
      "problem": "Define genetic drift and give an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define genetic drift",
          "explanation": "Random changes in allele frequencies in a population, not due to selection."
        },
        {
          "step": "Example",
          "explanation": "Bottleneck effect: a natural disaster drastically reduces population size, altering allele frequencies."
        }
      ],
      "final_answer": "Genetic drift is random allele frequency change; e.g., bottleneck effect after a natural disaster."
    },
    {
      "number": 4,
      "problem": "Explain the concept of speciation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define speciation",
          "explanation": "The formation of new species from a common ancestor."
        },
        {
          "step": "Mechanisms",
          "explanation": "Can occur via geographic isolation (allopatric) or reproductive isolation (sympatric)."
        }
      ],
      "final_answer": "Speciation is the evolution of new species through mechanisms like geographic or reproductive isolation."
    },
    {
      "number": 5,
      "problem": "Explain the evidence for evolution provided by the fossil record.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify fossil evidence",
          "explanation": "Fossils show transitional forms and chronological sequences of organismal changes."
        },
        {
          "step": "Significance",
          "explanation": "Shows gradual changes and supports common ancestry of species."
        }
      ],
      "final_answer": "The fossil record shows transitional forms and sequences, supporting gradual evolution and common ancestry."
    },
    {
      "number": 6,
      "problem": "Explain the Hardy-Weinberg principle and its assumptions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define principle",
          "explanation": "Allele and genotype frequencies remain constant in a population if no evolution occurs."
        },
        {
          "step": "List assumptions",
          "explanation": "Large population, random mating, no mutation, no migration, no selection."
        }
      ],
      "final_answer": "Hardy-Weinberg principle predicts constant allele frequencies under no evolution; assumptions include large population, random mating, no mutation, migration, or selection."
    },
    {
      "number": 7,
      "problem": "Describe the role of mutation in evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define mutation",
          "explanation": "Random changes in DNA sequence."
        },
        {
          "step": "Significance",
          "explanation": "Mutations create new alleles, providing raw material for natural selection and evolution."
        }
      ],
      "final_answer": "Mutations introduce new genetic variation, driving evolution by providing material for natural selection."
    },
    {
      "number": 8,
      "problem": "Explain adaptive radiation with an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define adaptive radiation",
          "explanation": "Rapid evolution of multiple species from a common ancestor into different ecological niches."
        },
        {
          "step": "Example",
          "explanation": "Darwin’s finches evolved different beak shapes to exploit different food sources."
        }
      ],
      "final_answer": "Adaptive radiation is rapid diversification into ecological niches, e.g., Darwin’s finches with varied beaks."
    },
    {
      "number": 9,
      "problem": "Explain the difference between stabilizing, directional, and disruptive selection.",
      "image": null,
      "step_by_step": [
        {
          "step": "Stabilizing selection",
          "explanation": "Favors intermediate phenotypes, reduces extremes."
        },
        {
          "step": "Directional selection",
          "explanation": "Favors one extreme phenotype."
        },
        {
          "step": "Disruptive selection",
          "explanation": "Favors both extremes, can lead to speciation."
        }
      ],
      "final_answer": "Stabilizing: favors intermediates; Directional: favors one extreme; Disruptive: favors both extremes."
    },
    {
      "number": 10,
      "problem": "Explain coevolution and provide an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define coevolution",
          "explanation": "Reciprocal evolutionary changes between interacting species."
        },
        {
          "step": "Example",
          "explanation": "Predator-prey dynamics, e.g., cheetahs and gazelles evolving faster speeds."
        }
      ],
      "final_answer": "Coevolution is reciprocal evolution between species, e.g., predator-prey adaptations in cheetahs and gazelles."
    }
  ]
}
