{
  "course": "AP Biology",
  "topic": "Mendelian Genetics",
  "problems": [
{
  "number": 1,
  "problem": "Give five differences between mitosis and meiosis.",
  "image": null,
  "step_by_step": [
    {
      "step": "Number of divisions",
      "explanation": "Mitosis involves a single nuclear division, where chromosomes are duplicated and then separated into two new nuclei. In contrast, meiosis consists of two consecutive divisions: Meiosis I separates homologous chromosome pairs, and Meiosis II separates sister chromatids. This is why meiosis is sometimes called a 'reduction division.'"
    },
    {
      "step": "Number of daughter cells",
      "explanation": "Mitosis produces two daughter cells from one parent cell. These are somatic (body) cells used for growth and repair. Meiosis produces four daughter cells from one parent cell. These become gametes (sperm or eggs) in animals or spores in plants."
    },
    {
      "step": "Chromosome number in daughter cells",
      "explanation": "Mitosis results in daughter cells that are diploid (2n), meaning they have the same number of chromosome sets as the original parent cell. Meiosis results in daughter cells that are haploid (n), meaning they have half the number of chromosomes. This halving is essential for sexual reproduction so that fertilization restores the diploid number."
    },
    {
      "step": "Genetic similarity",
      "explanation": "Daughter cells from mitosis are genetically identical clones of the parent cell. This ensures consistency in tissues. In meiosis, daughter cells are genetically unique. This variation arises from two key processes in Meiosis I: 1) Crossing over, where homologous chromosomes exchange segments, and 2) Independent assortment, where chromosome pairs align randomly, creating many possible combinations."
    },
    {
      "step": "Purpose / function",
      "explanation": "Mitosis is primarily for growth (increasing the number of cells in an organism), tissue repair (replacing damaged cells), and asexual reproduction (producing offspring genetically identical to the parent). Meiosis is exclusively for sexual reproduction—it creates genetically diverse haploid gametes, which drives evolution and adaptation in populations."
    }
  ],
  "final_answer": "1. Mitosis: one division. Meiosis: two divisions (Meiosis I & II). 2. Mitosis: produces 2 diploid daughter cells. Meiosis: produces 4 haploid daughter cells. 3. Mitosis: daughter cells are genetically identical. Meiosis: daughter cells are genetically unique due to crossing over and independent assortment. 4. Mitosis: functions in growth, repair, and asexual reproduction. Meiosis: functions in sexual reproduction to create genetic variation."
},
    {
  "number": 2,
  "problem": "Give 5 functions of Mitosis.",
  "image": null,
  "step_by_step": [
    {
      "step": "Growth of Multicellular Organisms",
      "explanation": "Mitosis is the primary mechanism that allows a single-celled zygote to develop into a complex multicellular organism. Through repeated rounds of mitosis, cells proliferate, increasing the total number of cells and allowing tissues and organs to form."
    },
    {
      "step": "Tissue Repair and Regeneration",
      "explanation": "When tissues are damaged (e.g., a cut or a broken bone), mitosis produces new cells to replace the ones that were lost or injured. This is crucial for healing wounds and maintaining the integrity of organs."
    },
    {
      "step": "Replacement of Worn-Out Cells",
      "explanation": "Many tissues in the body, such as the skin epidermis, the lining of the gut, and blood cells, have a limited lifespan. Mitosis continuously generates new cells to replace old, dead, or dying cells, ensuring the tissue remains functional."
    },
    {
      "step": "Asexual Reproduction",
      "explanation": "In many organisms (like bacteria, some plants, fungi, and animals), mitosis is the basis of asexual reproduction. Examples include binary fission in bacteria, budding in yeast, and vegetative propagation in plants. This produces offspring that are genetically identical clones of the parent."
    },
    {
      "step": "Maintenance of Genome Integrity in Somatic Cells",
      "explanation": "Mitosis ensures that each new daughter cell receives an exact copy of the parent cell's DNA. This fidelity in chromosome distribution is critical for maintaining a consistent, diploid genome in all somatic (body) cells throughout an organism's life."
    }
  ],
  "final_answer": "The five key functions of mitosis are: 1. Growth of multicellular organisms. 2. Tissue repair and regeneration after injury. 3. Replacement of worn-out or dead cells. 4. Asexual reproduction in various organisms. 5. Maintenance of a consistent, diploid genome in somatic cells."
},
    {
  "number": 3,
  "problem": "In your own words, what is the DNA, and what roles does it play? Does each cell contain a DNA?",
  "image": null,
  "step_by_step": [
    {
      "step": "Definition of DNA",
      "explanation": "DNA, or deoxyribonucleic acid, is the molecule that carries the genetic instructions for life. It's like a biological blueprint or a recipe book that is passed from parents to offspring. Structurally, it is a double helix made of two long strands that are composed of repeating units called nucleotides. Each nucleotide contains a sugar, a phosphate, and one of four nitrogenous bases: adenine (A), thymine (T), cytosine (C), or guanine (G). The specific order, or sequence, of these bases forms the genetic code."
    },
    {
      "step": "Key Roles of DNA",
      "explanation": "DNA has three primary roles: 1. **Storage of Genetic Information:** It holds all the instructions needed to build and maintain an organism. 2. **Transmission of Information:** It can be accurately copied and passed from cell to cell during cell division (mitosis/meiosis) and from generation to generation (inheritance). 3. **Expression of Information:** Sections of DNA called genes provide the code to build proteins, which carry out most of the work in cells and determine an organism's traits."
    },
    {
      "step": "Does each cell contain DNA?",
      "explanation": "Yes, nearly every cell in an organism contains a complete copy of that organism's DNA. There are a few specific exceptions: Mature red blood cells in mammals (like humans) eject their nucleus and therefore lack DNA. Also, cells like platelets and the cornified (dead) outer layer of skin cells do not contain functional nuclei with DNA. However, the foundational rule in biology is that all nucleated cells—which includes the vast majority of cells—contain the organism's full genome within the nucleus."
    }
  ],
  "final_answer": "DNA is the molecule that stores the genetic blueprint for life, with roles in information storage, transmission, and expression. Yes, essentially all cells in an organism contain a full copy of its DNA, with key exceptions like mature mammalian red blood cells."
},
    {
  "number": 4,
  "problem": "In your own words, how would you explain the Interphase stage of Mitosis?",
  "image": null,
  "step_by_step": [
    {
      "step": "What Interphase Is",
      "explanation": "Interphase is the long, active preparatory stage of the cell cycle that occurs *before* mitosis.\n\nThink of it as the cell's 'everyday life' phase—the time when it is not actually dividing, but instead growing, carrying out its normal functions, and getting ready for division. It is the longest phase of the cell cycle, often taking up about 90% of a cell's life."
    },
    {
      "step": "The Three Sub-phases of Interphase",
      "explanation": "Interphase is divided into three key parts:\n\n1. **G1 Phase (First Gap):** The cell grows in size, makes new proteins and organelles, and performs its specialized job (e.g., a liver cell detoxifying blood).\n\n2. **S Phase (Synthesis):** This is the most critical preparatory step. The cell's entire DNA is **replicated** (synthesized). Each chromosome is duplicated, resulting in two identical sister chromatids attached at a centromere.\n\n3. **G2 Phase (Second Gap):** The cell continues to grow, makes final preparations for division (like producing proteins needed for mitosis), and performs a 'quality check' to ensure DNA replication occurred without errors."
    },
    {
      "step": "Why Interphase Matters for Mitosis",
      "explanation": "Interphase is absolutely essential for successful mitosis. You cannot split a cell correctly if you haven't first:\n- Grown large enough\n- Made a complete and accurate copy of all the genetic material (DNA)\n\nInterphase ensures that when mitosis begins, the cell has two full sets of chromosomes ready to be pulled apart into two separate daughter cells. It’s the crucial 'planning and preparation' stage that makes the 'execution' (mitosis) possible."
    }
  ],
  "final_answer": "Interphase is the preparatory stage before cell division, where the cell grows, performs its normal functions, and most importantly, duplicates its DNA (during S phase). It consists of:\n1. G1 Phase - Cell growth and normal function\n2. S Phase - DNA replication (synthesis)\n3. G2 Phase - Final preparations and quality checks\n\nWithout interphase, mitosis could not occur because the cell would not have two complete sets of chromosomes to divide."
},
    {
  "number": 5,
  "problem": "What is a chromosome?",
  "image": null,
  "step_by_step": [
    {
      "step": "Basic Definition",
      "explanation": "A chromosome is a long, tightly coiled molecule of DNA that carries genetic information in the form of genes. It is the packaged, organized form of DNA that cells can efficiently store, copy, and distribute during cell division."
    },
    {
      "step": "Structure and Composition",
      "explanation": "Think of a chromosome's structure in three key parts:\n\n1. **DNA Molecule:** The chromosome's core is a single, extremely long double-stranded DNA molecule.\n2. **Histone Proteins:** The DNA is wrapped around special proteins called histones, like thread around a spool. This creates a compact, bead-like structure called chromatin.\n3. **Condensed Form:** When a cell prepares to divide, this chromatin coils and supercoils further into the dense, X-shaped structures we recognize as chromosomes under a microscope. The 'X' shape is actually two identical copies called **sister chromatids**, joined at the **centromere**."
    },
    {
      "step": "Function and Importance",
      "explanation": "Chromosomes serve three crucial functions:\n\n1. **Organization:** They package an immense length of DNA (about 2 meters per human cell!) neatly inside the tiny nucleus.\n2. **Protection:** The coiled structure helps protect the delicate DNA from damage.\n3. **Accurate Distribution:** During cell division (mitosis and meiosis), chromosomes condense so they can be neatly and equally pulled apart into the new daughter cells. This ensures each cell gets a complete, correct set of genetic instructions."
    },
    {
      "step": "Chromosome Number and Types",
      "explanation": "The number of chromosomes is constant for a species but varies between species.\n\n- **Humans:** Most body (somatic) cells have 46 chromosomes, organized into 23 pairs (one from each parent).\n- **Types:**\n  1. **Autosomes:** The first 22 pairs control most body traits.\n  2. **Sex Chromosomes:** The 23rd pair (XX for female, XY for male) determines biological sex."
    }
  ],
  "final_answer": "A chromosome is a tightly packaged structure of DNA and protein that contains an organism's genes. It serves to organize, protect, and accurately distribute genetic material during cell division. In humans, somatic cells contain 46 chromosomes (23 pairs), which become visible as condensed, X-shaped structures only when the cell is dividing."
},
    {
  "number": 6,
  "problem": "What is Mutation, and how does it occur? Is Mutation harmful, beneficial, or harmless?",
  "image": null,
  "step_by_step": [
    {
      "step": "Definition of a Mutation",
      "explanation": "A mutation is a permanent change in the DNA sequence of an organism. Think of DNA as an instruction manual written in a four-letter code (A, T, C, G). A mutation is like a typo, insertion, deletion, or rearrangement in that manual. It can happen in a single gene or involve larger segments of chromosomes."
    },
    {
      "step": "How Mutations Occur",
      "explanation": "Mutations can happen in two main ways:\n\n1. **Errors During DNA Replication:** When a cell copies its DNA before dividing, the molecular machinery can make a mistake—like adding the wrong nucleotide. Most of these are caught and fixed by the cell's proofreading enzymes, but some slip through.\n\n2. **Damage from Environmental Factors (Mutagens):** External agents can damage DNA, causing changes. Examples include:\n   - **UV Radiation:** Causes adjacent thymine bases to bond incorrectly (forming thymine dimers).\n   - **Chemicals:** (e.g., in tobacco smoke) can alter DNA's structure.\n   - **High-Energy Radiation:** (e.g., X-rays) can break DNA strands."
    },
    {
      "step": "Effects: Harmful, Beneficial, or Harmless?",
      "explanation": "The effect of a mutation depends entirely on where it happens and what it changes.\n\n- **Harmful (Deleterious):** Most mutations are harmful because they disrupt a normal, important function. They can cause genetic disorders (e.g., sickle cell anemia, cystic fibrosis) or cancer if they affect genes that control cell division.\n- **Beneficial:** Rarely, a mutation creates a new, advantageous trait. This is the raw material for evolution. Example: A mutation in bacteria that confers antibiotic resistance.\n- **Harmless (Neutral):** Many mutations have no observable effect. They might occur in non-coding DNA (\"junk DNA\") or change a gene in a way that doesn't alter the protein's function (due to the redundancy of the genetic code)."
    },
    {
      "step": "Importance in Biology",
      "explanation": "Despite their often negative connotation, mutations are fundamentally important:\n- **For Evolution:** They provide the genetic variation that natural selection acts upon.\n- **For Individuals:** While somatic mutations can cause diseases, germline mutations (in sperm or egg cells) are the ones passed to offspring and drive species change over generations."
    }
  ],
  "final_answer": "A mutation is a permanent change in an organism's DNA sequence. It occurs due to errors during DNA replication or damage from environmental mutagens (like UV radiation). Mutations can be harmful (causing disease), beneficial (providing an evolutionary advantage), or harmless (having no effect), with neutral and harmful mutations being the most common."
},
    {
  "number": 7,
  "problem": "What happens in the Prophase phase of Mitosis?",
  "image": "images/prophase1.png",
  "step_by_step": [
    {
      "step": "The Start of Mitosis",
      "explanation": "Prophase is the first and longest stage of mitosis. It marks the end of interphase and the beginning of active cell division. The main goal of prophase is to prepare the cell's genetic material and machinery for accurate separation."
    },
    {
      "step": "Key Event 1: Chromosome Condensation",
      "explanation": "The diffuse, thread-like chromatin (DNA and proteins) from interphase begins to coil and supercoil tightly into distinct, visible structures. By the end of prophase, the duplicated chromosomes are visible under a light microscope as X-shaped bodies. Each 'X' consists of two identical sister chromatids joined at the centromere."
    },
    {
      "step": "Key Event 2: Disassembly of the Nucleolus and Nuclear Envelope",
      "explanation": "The nucleolus (the site of ribosome assembly) disappears.\nThe nuclear envelope, which separates the nucleus from the cytoplasm, breaks down into small vesicles. This dismantling allows the spindle fibers (which will guide chromosome movement) to access the chromosomes."
    },
    {
      "step": "Key Event 3: Formation of the Mitotic Spindle",
      "explanation": "In the cytoplasm, structures called centrosomes begin to move to opposite poles (ends) of the cell. As they move apart, they organize a network of protein filaments called the **mitotic spindle**. This structure is made of microtubules and will later attach to the chromosomes to pull them apart."
    }
  ],
  "final_answer": "In prophase, the chromatin condenses into visible, X-shaped chromosomes; the nucleolus disappears; the nuclear envelope breaks down; and the mitotic spindle begins to form from centrosomes moving to opposite poles of the cell."
},
    {
  "number": 8,
  "problem": "What happens in the Metaphase during Mitosis?",
  "image": "images/prophase2.png",
  "step_by_step": [
    {
      "step": "Overview of Metaphase",
      "explanation": "Metaphase is the second stage of mitosis and follows prophase. It is a short phase, but not the shortest. Metaphase is all about **alignment**—it's the stage where the cell ensures that all chromosomes are perfectly positioned for an equal split in the next phase."
    },
    {
      "step": "Key Event 1: Spindle Attachment and Alignment",
      "explanation": "By the start of metaphase, the nuclear envelope is completely gone, and the mitotic spindle is fully formed.\n\nEach duplicated chromosome (made of two sister chromatids) has a protein structure called a **kinetochore** at its centromere. Spindle microtubules from opposite poles attach to these kinetochores. Tension from these opposing attachments pulls the chromosomes back and forth until they all line up single-file along the **metaphase plate** (an imaginary plane at the cell's equator)."
    },
    {
      "step": "Key Event 2: The Metaphase Checkpoint",
      "explanation": "This alignment is not passive—it is a critical quality control point in the cell cycle called the **M checkpoint** or **spindle assembly checkpoint**.\n\nThe cell will **not proceed** to the next phase (anaphase) until **every single chromosome** is properly attached to spindle fibers from both poles. This checkpoint prevents errors that could lead to daughter cells with missing or extra chromosomes, a condition called aneuploidy."
    },
    {
      "step": "Visual Description",
      "explanation": "If you looked at a cell in metaphase under a microscope, you would see the chromosomes in their most condensed, distinct form, all lined up neatly at the center of the cell, with the spindle fibers extending from the poles to each chromosome. This organized lineup is the hallmark of metaphase."
    }
  ],
  "final_answer": "In metaphase, all duplicated chromosomes align at the cell's equator (the metaphase plate), attached by their kinetochores to spindle fibers from opposite poles. This stage features a crucial checkpoint that ensures all chromosomes are correctly attached before the cell proceeds to separate them."
},
    {
  "number": 9,
  "problem": "What happens in the Anaphase of Mitosis?",
  "image": null,
  "step_by_step": [
    {
      "step": "Overview of Anaphase",
      "explanation": "Anaphase is the third and shortest stage of mitosis. It is the stage of **separation**, where the cell physically splits the duplicated genetic material. The main goal is to ensure that each future daughter cell receives an identical and complete set of chromosomes."
    },
    {
      "step": "Key Event 1: Separation of Sister Chromatids",
      "explanation": "The protein complex called **cohesin**, which holds the two sister chromatids together at their centromeres, is cleaved (cut) by an enzyme called **separase**.\n\nOnce released, each sister chromatid is now considered an individual **daughter chromosome**."
    },
    {
      "step": "Key Event 2: Movement to Opposite Poles",
      "explanation": "The spindle microtubules attached to the kinetochores shorten, pulling the daughter chromosomes apart toward opposite poles (ends) of the cell.\n\nSimultaneously, the spindle poles themselves move farther apart, and the cell begins to elongate. This is powered by motor proteins and the lengthening of non-kinetochore microtubules."
    },
    {
      "step": "Why This Phase Is Critical",
      "explanation": "Anaphase ensures the **equal distribution** of genetic material. The precise, simultaneous separation of all sister chromatids guarantees that each pole receives one copy of every chromosome. Any failure in this process (called **nondisjunction**) results in daughter cells with incorrect chromosome numbers, which can lead to severe genetic disorders."
    }
  ],
  "final_answer": "In anaphase, sister chromatids are separated and pulled to opposite poles of the cell. The cohesin proteins holding them together are cleaved, and the spindle fibers shorten, moving the now-independent daughter chromosomes toward the poles, ensuring each future cell gets a full set of chromosomes."
},
    {
  "number": 10,
  "problem": "What is Cancer, and how does it happen?",
  "image": null,
  "step_by_step": [
    {
      "step": "Definition of Cancer",
      "explanation": "Cancer is a group of diseases characterized by **uncontrolled cell division** and **spread** of abnormal cells. It happens when the body's normal control mechanisms that regulate cell growth and death break down. Instead of dying or stopping, these abnormal cells keep dividing and can form masses called **tumors**, invade nearby tissues, or spread to other parts of the body (metastasis)."
    },
    {
      "step": "The Root Cause: DNA Mutations",
      "explanation": "Cancer begins with damage (mutations) in a cell's DNA. These mutations disrupt the normal instructions that control the cell cycle. Mutations can be:\n\n- **Inherited** from a parent (germline mutation).\n- **Acquired** during a person's lifetime due to environmental factors or random errors in DNA replication (somatic mutation).\n\nMost cancers result from a combination of both inherited risks and accumulated lifetime exposures."
    },
    {
      "step": "Key Genes Affected: Oncogenes and Tumor Suppressors",
      "explanation": "Mutations that lead to cancer typically affect two main classes of genes:\n\n1. **Oncogenes:** These are like a stuck accelerator. Normally, they promote controlled cell growth (proto-oncogenes), but mutations can turn them permanently \"ON,\" driving excessive division.\n\n2. **Tumor Suppressor Genes:** These are like brakes. Normally, they slow down cell division, repair DNA mistakes, or tell cells when to die (apoptosis). Mutations here inactivate the \"brakes,\" allowing unchecked growth.\n\nFor cancer to develop, **multiple mutations** usually accumulate over time, disabling several controls."
    },
    {
      "step": "The Process: From Mutation to Tumor",
      "explanation": "Cancer development is a multi-step process:\n\n1. **Initiation:** A mutation occurs in a single cell's DNA.\n2. **Promotion:** The mutated cell divides more than its neighbors, forming a small, benign growth.\n3. **Progression:** Additional mutations accumulate, making the cells more aggressive. They may become invasive (malignant) and gain the ability to spread.\n4. **Metastasis:** Cancer cells break away, enter the bloodstream or lymphatic system, and form new tumors in distant organs."
    },
    {
      "step": "Common Risk Factors (Carcinogens)",
      "explanation": "Substances or exposures that increase mutation rates are called carcinogens. Major categories include:\n- **Chemical:** Tobacco smoke, asbestos, certain pollutants.\n- **Physical:** UV radiation, ionizing radiation (X-rays, radon).\n- **Biological:** Certain viruses (HPV, hepatitis B) and bacteria.\n- **Lifestyle:** Poor diet, lack of exercise, chronic inflammation."
    }
  ],
  "final_answer": "Cancer is a disease of uncontrolled cell division caused by accumulated DNA mutations. These mutations typically affect two types of genes: oncogenes (accelerating growth) and tumor suppressor genes (disabling brakes). The process involves multiple steps—initiation, promotion, progression, and metastasis—often driven by exposure to carcinogens like tobacco, radiation, or viruses."
},
    {
  "number": 11,
  "problem": "What does the term 'Haploid' mean? Give four ways it is different from Diploid.",
  "image": null,
  "step_by_step": [
    {
      "step": "Definition of Haploid",
      "explanation": "Haploid refers to a cell or organism that has one complete set of chromosomes, denoted as 'n'. In humans, the haploid number is 23. Gametes (sperm and egg cells) are haploid, while somatic (body) cells are diploid (2n)."
    },
    {
      "step": "Reason 1 – Number of Chromosome Sets",
      "explanation": "Haploid cells contain one set of chromosomes (n), whereas diploid cells contain two sets (2n). For example, human somatic cells are diploid with 46 chromosomes, while human gametes are haploid with 23 chromosomes."
    },
    {
      "step": "Reason 2 – Cell Types Where Found",
      "explanation": "Haploid cells are primarily gametes (sperm and egg) in animals, and they represent the dominant life stage in some fungi and algae. Diploid cells make up the somatic (body) tissues of animals and the sporophyte generation in plants."
    },
    {
      "step": "Reason 3 – Role in the Life Cycle and Reproduction",
      "explanation": "Haploid cells are produced through meiosis from diploid cells and are essential for sexual reproduction. When two haploid gametes fuse during fertilization, they form a diploid zygote. Diploid cells undergo mitosis for growth and repair, and meiosis to produce haploid gametes."
    },
    {
      "step": "Reason 4 – Genetic Composition and Expression",
      "explanation": "Because haploid cells have only one allele per gene (no homologous pair), traits are expressed directly without dominance/recessiveness interactions within the cell. In diploid cells, the presence of two alleles per gene (one on each homologous chromosome) allows for heterozygous conditions, dominance/recessiveness relationships, and Mendelian inheritance patterns."
    }
  ],
  "final_answer": "Haploid means having one set of chromosomes (n). Four key differences from diploid (2n) are: 1. Chromosome number: haploid has one set, diploid has two. 2. Cell type: haploid are gametes; diploid are somatic cells. 3. Reproductive role: haploid are for fusion in fertilization; diploid undergo meiosis to produce haploids. 4. Genetics: haploid have one allele per gene; diploid have two, allowing dominance/recessiveness."
},
    {
  "number": 12,
  "problem": "In sexually reproducing organisms, haploid gametes from two parents fuse to form a diploid zygote. If mitosis is the process that produces diploid cells from diploid cells, why does sexual reproduction require two parents instead of just mitosis alone?",
  "image": null,
  "step_by_step": [
    {
      "step": "Role of Mitosis in Diploid Organisms",
      "explanation": "Mitosis is a conservative process: it produces genetically identical diploid daughter cells from a diploid parent cell. It is essential for growth, repair, and asexual reproduction, but it does not create new genetic combinations or restore diploidy from haploid cells."
    },
    {
      "step": "Genetic Contribution from Two Parents",
      "explanation": "Sexual reproduction involves two parents because each contributes one set of chromosomes (haploid gametes). This ensures the offspring inherits genetic material from both, promoting genetic diversity. Mitosis alone cannot combine DNA from two different individuals."
    },
    {
      "step": "Fertilization Restores Diploidy",
      "explanation": "When haploid sperm (n) and haploid egg (n) fuse during fertilization, they form a diploid zygote (2n). This zygote is genetically unique, containing one chromosome set from each parent. From there, mitosis takes over to build the multicellular diploid body."
    },
    {
      "step": "Why Not Just Use Mitosis for Reproduction?",
      "explanation": "If organisms reproduced only through mitosis (asexually), all offspring would be clones of the parent. Sexual reproduction, through meiosis and fertilization, introduces genetic variation via crossing over, independent assortment, and random fusion of gametes. This variation is crucial for adaptation and evolution in changing environments."
    }
  ],
  "final_answer": "Sexual reproduction requires two parents because each contributes unique haploid gametes, which fuse to form a genetically diverse diploid zygote. Mitosis alone cannot merge genomes from two individuals or create new genetic combinations; it only duplicates existing diploid cells. Thus, two parents ensure genetic variation, while mitosis then propagates that unique diploid genome throughout the organism's body."
}
  ]
}


