{
  "course": "AP Biology",
  "topic": "Molecular Genetics",
  "problems": [
    {
      "number": 1,
      "problem": "Explain the structure of DNA.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify components",
          "explanation": "DNA is composed of nucleotides, each with a phosphate group, deoxyribose sugar, and nitrogenous base."
        },
        {
          "step": "Describe double helix",
          "explanation": "Two complementary strands form a right-handed double helix with antiparallel orientation."
        }
      ],
      "final_answer": "DNA consists of nucleotides forming a double helix with complementary, antiparallel strands."
    },
    {
      "number": 2,
      "problem": "Explain complementary base pairing in DNA.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify base pairs",
          "explanation": "Adenine pairs with Thymine via 2 hydrogen bonds; Cytosine pairs with Guanine via 3 hydrogen bonds."
        },
        {
          "step": "Significance",
          "explanation": "Complementary pairing allows accurate DNA replication and transcription."
        }
      ],
      "final_answer": "A-T and C-G base pairing ensures DNA strands are complementary for replication and transcription."
    },
    {
      "number": 3,
      "problem": "Describe the process of DNA replication.",
      "image": null,
      "step_by_step": [
        {
          "step": "Initiation",
          "explanation": "Helicase unwinds the DNA double helix at origins of replication."
        },
        {
          "step": "Elongation",
          "explanation": "DNA polymerase synthesizes new strands by adding complementary nucleotides."
        },
        {
          "step": "Termination",
          "explanation": "Replication ends when the entire molecule is copied; ligase joins fragments on the lagging strand."
        }
      ],
      "final_answer": "DNA replication unwinds the helix, adds complementary nucleotides, and seals fragments, producing two identical DNA molecules."
    },
    {
      "number": 4,
      "problem": "Explain the central dogma of molecular biology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define central dogma",
          "explanation": "Information flows from DNA → RNA → Protein."
        },
        {
          "step": "Describe processes",
          "explanation": "Transcription converts DNA to RNA; translation converts RNA to a polypeptide chain."
        }
      ],
      "final_answer": "The central dogma states that DNA is transcribed into RNA, which is translated into proteins."
    },
    {
      "number": 5,
      "problem": "Describe transcription in eukaryotes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Initiation",
          "explanation": "RNA polymerase binds the promoter region of a gene."
        },
        {
          "step": "Elongation",
          "explanation": "RNA polymerase synthesizes RNA complementary to the DNA template strand."
        },
        {
          "step": "Termination",
          "explanation": "RNA synthesis stops at a terminator sequence."
        }
      ],
      "final_answer": "Transcription produces RNA from DNA by RNA polymerase binding, elongating, and terminating at specific sequences."
    },
    {
      "number": 6,
      "problem": "Explain the process of RNA splicing.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify pre-mRNA",
          "explanation": "Eukaryotic pre-mRNA contains exons and introns."
        },
        {
          "step": "Splicing mechanism",
          "explanation": "Spliceosomes remove introns and join exons together."
        },
        {
          "step": "Result",
          "explanation": "Mature mRNA is ready for translation."
        }
      ],
      "final_answer": "RNA splicing removes introns and joins exons to produce mature mRNA for translation."
    },
    {
      "number": 7,
      "problem": "Describe translation and the role of tRNA.",
      "image": null,
      "step_by_step": [
        {
          "step": "Initiation",
          "explanation": "Ribosome assembles on the start codon of mRNA."
        },
        {
          "step": "Elongation",
          "explanation": "tRNAs bring amino acids to the ribosome, matching codons with anticodons."
        },
        {
          "step": "Termination",
          "explanation": "Ribosome reaches a stop codon, releasing the completed polypeptide."
        }
      ],
      "final_answer": "Translation uses tRNAs to match codons with amino acids, producing a polypeptide from mRNA at the ribosome."
    },
    {
      "number": 8,
      "problem": "Explain the difference between point mutations and frameshift mutations.",
      "image": null,
      "step_by_step": [
        {
          "step": "Point mutation",
          "explanation": "A single nucleotide is substituted; may result in silent, missense, or nonsense changes."
        },
        {
          "step": "Frameshift mutation",
          "explanation": "Insertion or deletion of nucleotides shifts the reading frame, altering downstream amino acids."
        }
      ],
      "final_answer": "Point mutations change one nucleotide; frameshift mutations insert or delete nucleotides, shifting the reading frame."
    },
    {
      "number": 9,
      "problem": "Explain the function of operons in prokaryotic gene regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define operon",
          "explanation": "A cluster of genes under a single promoter regulated together."
        },
        {
          "step": "Example",
          "explanation": "The lac operon in E. coli is activated in the presence of lactose to produce enzymes for lactose metabolism."
        }
      ],
      "final_answer": "Operons allow coordinated gene regulation in prokaryotes, such as the lac operon activating genes in response to lactose."
    },
    {
      "number": 10,
      "problem": "Describe the roles of DNA and RNA polymerases in molecular genetics.",
      "image": null,
      "step_by_step": [
        {
          "step": "DNA polymerase",
          "explanation": "Synthesizes DNA strands during replication, adding nucleotides complementary to the template."
        },
        {
          "step": "RNA polymerase",
          "explanation": "Synthesizes RNA from a DNA template during transcription."
        }
      ],
      "final_answer": "DNA polymerase replicates DNA; RNA polymerase transcribes DNA into RNA."
    }
  ]
}
