{
  "course": "AP Biology",
  "topic": "Review Practice",
  "problems": [
    {
      "number": 1,
      "problem": "Explain why water is polar and list two properties that make it essential for life.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify polarity",
          "explanation": "Oxygen is more electronegative than hydrogen, creating partial charges."
        },
        {
          "step": "Explain bent shape",
          "explanation": "The bent molecular shape prevents charge cancellation, making the molecule polar."
        },
        {
          "step": "List two properties",
          "explanation": "Cohesion, high specific heat, solvent ability, or ice's lower density."
        }
      ],
      "final_answer": "Water is polar due to its bent shape and unequal electron sharing; properties include cohesion and high specific heat."
    },
    {
      "number": 2,
      "problem": "Compare prokaryotic and eukaryotic cells.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify prokaryotic features",
          "explanation": "No nucleus, DNA in nucleoid, no membrane-bound organelles."
        },
        {
          "step": "Identify eukaryotic features",
          "explanation": "Nucleus, membrane-bound organelles, linear DNA in chromosomes."
        }
      ],
      "final_answer": "Prokaryotes lack a nucleus and organelles; eukaryotes have a nucleus and organelles."
    },
    {
      "number": 3,
      "problem": "Describe ATP structure and explain why it is called the energy currency of the cell.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify structure",
          "explanation": "ATP consists of adenine, ribose, and three phosphate groups."
        },
        {
          "step": "Explain energy release",
          "explanation": "Hydrolysis of the terminal phosphate releases energy for cellular work."
        }
      ],
      "final_answer": "ATP stores and releases energy via phosphate bonds, serving as the cell’s energy currency."
    },
    {
      "number": 4,
      "problem": "Describe the process of glycolysis and indicate where it occurs in the cell.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify location",
          "explanation": "Glycolysis occurs in the cytoplasm."
        },
        {
          "step": "Explain process",
          "explanation": "One glucose is broken into two pyruvate molecules, generating 2 ATP and 2 NADH."
        }
      ],
      "final_answer": "Glycolysis in the cytoplasm converts glucose into 2 pyruvate molecules, producing 2 ATP and 2 NADH."
    },
    {
      "number": 5,
      "problem": "Explain the function of the mitochondria in cellular respiration.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify structure",
          "explanation": "Double-membrane organelle with cristae."
        },
        {
          "step": "Describe function",
          "explanation": "Mitochondria produce ATP via the Krebs cycle and oxidative phosphorylation."
        }
      ],
      "final_answer": "Mitochondria generate ATP by oxidizing nutrients in the Krebs cycle and electron transport chain."
    },
    {
      "number": 6,
      "problem": "Explain the difference between autocrine, paracrine, and endocrine signaling.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define autocrine",
          "explanation": "Cell signals itself."
        },
        {
          "step": "Define paracrine",
          "explanation": "Signals affect nearby cells."
        },
        {
          "step": "Define endocrine",
          "explanation": "Hormones travel via blood to distant cells."
        }
      ],
      "final_answer": "Autocrine: self, Paracrine: nearby cells, Endocrine: distant cells."
    },
    {
      "number": 7,
      "problem": "Describe the structure and function of the cell membrane.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify components",
          "explanation": "Phospholipid bilayer with proteins, cholesterol, and carbohydrates."
        },
        {
          "step": "Explain function",
          "explanation": "Controls movement of substances, provides support, and mediates cell signaling."
        }
      ],
      "final_answer": "Cell membrane regulates transport, provides structure, and facilitates communication."
    },
    {
      "number": 8,
      "problem": "Explain how signal transduction pathways can alter gene expression.",
      "image": null,
      "step_by_step": [
        {
          "step": "Signal reception",
          "explanation": "Ligand binds receptor to initiate pathway."
        },
        {
          "step": "Activation of transcription factors",
          "explanation": "Second messengers or kinases modify transcription factors."
        },
        {
          "step": "Gene expression",
          "explanation": "Transcription factors bind DNA to initiate RNA synthesis and protein production."
        }
      ],
      "final_answer": "Signals can activate transcription factors that induce gene expression, producing specific proteins."
    },
    {
      "number": 9,
      "problem": "Compare aerobic respiration and fermentation in terms of ATP yield.",
      "image": null,
      "step_by_step": [
        {
          "step": "Aerobic respiration",
          "explanation": "Requires O₂ and produces ~30–32 ATP per glucose."
        },
        {
          "step": "Fermentation",
          "explanation": "Occurs without O₂ and produces 2 ATP per glucose."
        }
      ],
      "final_answer": "Aerobic respiration yields ~30–32 ATP; fermentation yields 2 ATP per glucose."
    },
    {
      "number": 10,
      "problem": "Explain the role of hydrogen bonds in water and their biological significance.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify hydrogen bonds",
          "explanation": "Attraction between the partial positive hydrogen of one water molecule and partial negative oxygen of another."
        },
        {
          "step": "Explain significance",
          "explanation": "Cohesion, surface tension, high specific heat, and ice’s lower density support life."
        }
      ],
      "final_answer": "Hydrogen bonds allow water to maintain cohesion, resist temperature changes, and float as ice, supporting life."
    }
  ]
}
