{
  "expanded_description": "This section introduces the fundamental concepts of static electricity—the behavior of electric charges at rest. Students will learn about the structure of atoms, how charges are created, the difference between conductors and insulators, and the basic principles of electric attraction and repulsion. This foundation is essential for understanding all subsequent topics in electricity.",
  "core_concept": {
    "principle": "Static electricity involves electric charges that are stationary. Like charges repel each other, unlike charges attract. These forces arise from an imbalance of protons (positive) and electrons (negative) in materials.",
    "explanation": "Everything around you is made of atoms containing positively charged protons, negatively charged electrons, and neutral neutrons. Normally, atoms have equal numbers of protons and electrons, making them neutral. When materials rub together, electrons can transfer from one to the other, creating an imbalance. The object that gains electrons becomes negatively charged; the object that loses electrons becomes positively charged. These unbalanced charges then exert forces on each other—pulling together if opposite, pushing apart if the same.",
    "image": {
      "src": "images/unit10/static_electricity_intro.png",
      "alt": "Diagram showing atoms with protons and electrons, and two objects after rubbing—one with extra electrons (negative) and one with fewer electrons (positive)",
      "caption": "Static electricity results from an imbalance of electrons between objects"
    }
  },
  "sections": [
    {
      "section_title": "What Is Static Electricity?",
      "introduction": "Have you ever walked across a carpet and gotten a shock when touching a doorknob? Or pulled a sweater over your head and heard crackling sounds? These are everyday experiences of static electricity—electric charges that build up and stay in place until they find a path to discharge.",
      "key_concept": {
        "definition": "Static electricity is the study of electric charges that are at rest. It involves the buildup of excess positive or negative charge on objects, and the forces these charges exert on each other.",
        "context": "The word 'static' means not moving. Unlike the electricity that flows through wires in circuits, static electricity involves charges that remain in place until they suddenly move (discharge)."
      },
      "principles": [
        {
          "principle": "Charges Come from Atoms",
          "statement": "All matter is made of atoms containing positively charged protons, negatively charged electrons, and neutral neutrons. Protons are fixed in the nucleus; electrons can sometimes move.",
          "application": "When electrons transfer from one material to another, the material losing electrons becomes positively charged, and the material gaining electrons becomes negatively charged.",
          "example": "Rubbing a balloon on your hair transfers electrons from your hair to the balloon. Your hair becomes positive, the balloon becomes negative.",
          "analogy": "Think of electrons like marbles in a room. If you move marbles from one box to another, the first box has fewer marbles (positive), the second has extra marbles (negative)."
        },
        {
          "principle": "Like Charges Repel, Unlike Charges Attract",
          "statement": "The fundamental law of electrostatics: objects with the same type of charge (both positive or both negative) push each other apart. Objects with opposite charges (one positive, one negative) pull together.",
          "application": "This principle explains all electrostatic phenomena—why a charged balloon sticks to a wall, why your hair stands up after rubbing a balloon, and why you get a shock from a doorknob.",
          "example": "Two negatively charged balloons hung from strings will push away from each other. A negatively charged balloon brought near a positively charged wall will stick to it."
        }
      ],
      "classifications": [
        {
          "type": "Positive Charge",
          "value": "Deficiency of electrons",
          "characteristics": [
            "Has fewer electrons than protons",
            "Attracts negative charges",
            "Repels other positive charges",
            "Created by losing electrons"
          ],
          "behavior": "Positively charged objects have lost electrons to another material. They are attracted to anything negative and repelled by anything positive.",
          "examples": [
            {
              "process": "Glass rod rubbed with silk",
              "explanation": "Glass loses electrons to silk, becoming positively charged."
            },
            {
              "process": "Your hair after rubbing a balloon",
              "explanation": "Hair loses electrons to the balloon, leaving each strand positively charged—they repel each other, making hair stand up."
            }
          ]
        },
        {
          "type": "Negative Charge",
          "value": "Excess of electrons",
          "characteristics": [
            "Has more electrons than protons",
            "Attracts positive charges",
            "Repels other negative charges",
            "Created by gaining electrons"
          ],
          "behavior": "Negatively charged objects have gained extra electrons from another material. They attract anything positive and repel anything negative.",
          "examples": [
            {
              "process": "Plastic comb rubbed with wool",
              "explanation": "Comb gains electrons from wool, becoming negatively charged—it can then attract small pieces of paper."
            },
            {
              "process": "Balloon rubbed on hair",
              "explanation": "Balloon gains electrons from hair, becoming negatively charged—it sticks to walls by inducing opposite charge."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit10/attraction_repulsion.png",
        "alt": "Diagram showing two positive charges repelling, two negative charges repelling, and opposite charges attracting",
        "caption": "Like charges repel; unlike charges attract—the fundamental law of electrostatics"
      }
    },
    {
      "section_title": "Conductors and Insulators",
      "introduction": "Not all materials handle electric charges the same way. Some allow charges to move freely; others trap charges in place. This difference is crucial to understanding static electricity and eventually electric circuits.",
      "key_concept": {
        "definition": "Conductors are materials that allow electric charges to move through them easily. Insulators are materials that resist the flow of electric charges, trapping them in place.",
        "context": "The difference lies in atomic structure—conductors have loosely held outer electrons that can move; insulators hold their electrons tightly."
      },
      "classifications": [
        {
          "type": "Conductors",
          "value": "Materials that allow charge flow",
          "characteristics": [
            "Electrons can move freely",
            "Metals are excellent conductors (copper, aluminum, silver)",
            "Charge spreads evenly over surface",
            "Can be charged by contact, but charge quickly leaks away if grounded"
          ],
          "behavior": "In conductors, excess charge redistributes itself evenly. If you touch a charged conductor, charge flows through you to ground—that's the shock you feel.",
          "examples": [
            {
              "process": "Copper wire",
              "explanation": "Copper's outer electrons are loosely bound, allowing them to drift through the metal—perfect for electrical wiring."
            },
            {
              "process": "Human body",
              "explanation": "Our bodies are conductors (mostly water with dissolved salts)—that's why we get shocks when touching grounded objects."
            },
            {
              "process": "Aluminum foil",
              "explanation": "Aluminum conducts charge readily—you can use it to demonstrate charge distribution."
            }
          ]
        },
        {
          "type": "Insulators",
          "value": "Materials that resist charge flow",
          "characteristics": [
            "Electrons are tightly bound",
            "Rubber, plastic, glass, wood are good insulators",
            "Charge stays where it's placed (doesn't spread)",
            "Can hold static charge for long periods"
          ],
          "behavior": "In insulators, excess charge remains localized. This is why rubbing a plastic rod charges only the rubbed area, and why static electricity builds up on insulators.",
          "examples": [
            {
              "process": "Plastic comb",
              "explanation": "After combing hair, charge stays on the comb—it can attract small pieces of paper for minutes."
            },
            {
              "process": "Balloon",
              "explanation": "Rubber is an excellent insulator—a charged balloon can stick to a wall for hours because charge can't move."
            },
            {
              "process": "Glass rod",
              "explanation": "Glass holds charge well, making it useful for electrostatic experiments."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit10/conductors_insulators.png",
        "alt": "Diagram comparing atomic structure of conductors (loose electrons) and insulators (tightly bound electrons)",
        "caption": "Conductors allow charge movement; insulators trap charge in place"
      },
      "note": "Semiconductors (like silicon) are materials that conduct electricity under some conditions but not others—they're the basis of modern electronics."
    },
    {
      "section_title": "Charging by Friction",
      "introduction": "The simplest way to create static charge is by rubbing two different materials together. This is called charging by friction, and it's what happens when you walk across a carpet or comb your hair.",
      "key_concept": {
        "definition": "Charging by friction occurs when two different materials are rubbed together, causing electrons to transfer from one material to the other. One material becomes positively charged (loses electrons); the other becomes negatively charged (gains electrons).",
        "context": "Different materials have different affinities for electrons. The triboelectric series lists materials in order of their tendency to gain or lose electrons."
      },
      "principles": [
        {
          "principle": "The Triboelectric Series",
          "statement": "Materials are ranked by their tendency to gain or lose electrons. When two materials are rubbed, the one higher on the series loses electrons (becomes positive), and the one lower gains electrons (becomes negative).",
          "application": "This explains why some material pairs produce strong static charges while others produce little effect.",
          "example": "Glass rubbed with silk: glass is higher on the series, so it loses electrons to silk—glass becomes positive, silk negative."
        },
        {
          "principle": "Electron Transfer",
          "statement": "Only electrons move during charging by friction. Protons remain fixed in the nucleus and never transfer.",
          "application": "The total number of electrons in the universe remains constant—they're just redistributed between materials.",
          "example": "When you rub a balloon on your hair, electrons move from hair to balloon. Hair has fewer electrons (positive), balloon has extra electrons (negative)."
        }
      ],
      "classifications": [
        {
          "type": "Common Material Pairs",
          "value": "Results of rubbing different materials",
          "characteristics": [
            "Glass + silk → Glass positive, silk negative",
            "Plastic + wool → Plastic negative, wool positive",
            "Ebonite + fur → Ebonite negative, fur positive",
            "Acetate + wool → Acetate positive, wool negative"
          ],
          "behavior": "The material that holds electrons more tightly (lower in triboelectric series) gains electrons and becomes negative.",
          "examples": [
            {
              "process": "Balloon on hair",
              "explanation": "Hair loses electrons to balloon → hair positive, balloon negative."
            },
            {
              "process": "Plastic comb through dry hair",
              "explanation": "Comb gains electrons → comb negative, hair positive—why hair strands repel each other."
            },
            {
              "process": "Walking on carpet with socks",
              "explanation": "Soles of feet rub against carpet, transferring electrons—you build up charge, then get a shock touching a doorknob."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit10/charging_by_friction.png",
        "alt": "Diagram showing electrons transferring from hair to balloon during rubbing, with resulting charges labeled",
        "caption": "Rubbing transfers electrons, creating positive and negative charges"
      }
    },
    {
      "section_title": "Charging by Contact",
      "introduction": "Once an object is charged, it can transfer charge to another object simply by touching it. This is called charging by contact (or conduction).",
      "key_concept": {
        "definition": "Charging by contact occurs when a charged object touches a neutral object, causing charge to spread between them. Both objects end up with the same type of charge.",
        "context": "Charge is conserved—the total amount of charge before contact equals the total after contact. The charge distributes based on the objects' sizes and shapes."
      },
      "principles": [
        {
          "principle": "Charge Sharing",
          "statement": "When a charged conductor touches a neutral conductor, charge spreads evenly over both objects (if identical). They end up with the same type of charge, each with half the original charge if identical.",
          "application": "This is how charge can be transferred and shared between objects.",
          "example": "A negatively charged metal sphere touched to an identical neutral sphere: after contact, both spheres have half the original negative charge."
        },
        {
          "principle": "Charge Conservation",
          "statement": "The total charge before and after contact remains the same. Charge is neither created nor destroyed, only transferred.",
          "application": "You can calculate final charges by averaging the initial charges (with signs considered).",
          "example": "If a +6 μC sphere touches a -2 μC sphere, total charge = +4 μC, so each ends with +2 μC after separation."
        }
      ],
      "worked_examples": [
        {
          "title": "Charging by Contact Calculation",
          "problem": "A metal sphere with a charge of +8 μC touches an identical neutral sphere. What is the charge on each after they are separated?",
          "step_by_step": [
            {
              "step": "Identify initial charges",
              "explanation": "Sphere A: +8 μC, Sphere B: 0 μC"
            },
            {
              "step": "Total charge",
              "explanation": "+8 μC + 0 μC = +8 μC"
            },
            {
              "step": "After contact",
              "explanation": "Charge distributes equally between identical spheres: +8 μC ÷ 2 = +4 μC each"
            }
          ],
          "final_answer": "Each sphere has +4 μC after separation.",
          "concept_applied": "Charge sharing between identical conductors."
        },
        {
          "title": "Charge Conservation with Opposite Charges",
          "problem": "A +12 μC sphere touches a -4 μC identical sphere. What is the final charge on each?",
          "step_by_step": [
            {
              "step": "Calculate total charge",
              "explanation": "+12 μC + (-4 μC) = +8 μC"
            },
            {
              "step": "Divide equally",
              "explanation": "+8 μC ÷ 2 = +4 μC each"
            }
          ],
          "final_answer": "Each sphere ends with +4 μC.",
          "concept_applied": "Charge averaging with opposite signs."
        }
      ]
    },
    {
      "section_title": "Electroscopes: Detecting Charge",
      "introduction": "How do we know if something is charged? An electroscope is a simple device that detects electric charge.",
      "key_concept": {
        "definition": "An electroscope is an instrument used to detect the presence and sign of electric charge. The simplest type has two thin metal leaves (or a single leaf attached to a metal rod) that repel each other when charged.",
        "context": "The electroscope works because like charges repel—when charge is transferred to the metal leaves, they push apart, indicating the presence of charge."
      },
      "principles": [
        {
          "principle": "How It Works",
          "statement": "When a charged object touches the metal knob, charge spreads down the metal rod to the leaves. Both leaves receive the same charge, so they repel each other and diverge.",
          "application": "The amount of divergence indicates the amount of charge. Bringing a known charge near can also test the sign of an unknown charge.",
          "example": "Touch a negatively charged rod to the knob—leaves both become negative and repel, spreading apart."
        },
        {
          "principle": "Determining Charge Sign",
          "statement": "To determine the sign of an unknown charge, first give the electroscope a known charge. Then bring the unknown charge near—if leaves diverge more, the unknown charge is the same; if they collapse, it's opposite.",
          "application": "This uses the principle that like charges repel (more divergence) and unlike charges attract (pulling charge away from leaves).",
          "example": "If an electroscope is negatively charged and a positive rod approaches, electrons are attracted upward, leaves become less negative and collapse."
        }
      ],
      "image": {
        "src": "images/unit10/electroscope.png",
        "alt": "Diagram of a gold-leaf electroscope showing metal knob, rod, and thin metal leaves diverging when charged",
        "caption": "An electroscope detects charge—leaves diverge when like charges repel"
      }
    },
    {
      "section_title": "Real-World Static Electricity",
      "introduction": "Static electricity isn't just a lab curiosity—it has important real-world effects, both helpful and hazardous.",
      "categories": [
        {
          "type": "Everyday Phenomena",
          "description": "Common experiences of static electricity.",
          "examples": [
            {
              "process": "Clothes sticking together",
              "explanation": "In a dryer, different fabrics rub together, transferring charge. Oppositely charged clothes attract and stick."
            },
            {
              "process": "Hair standing up",
              "explanation": "When you remove a sweater, friction charges your hair strands alike—they repel, making hair stand out."
            },
            {
              "process": "Car door shocks",
              "explanation": "Sliding across a car seat builds up charge; touching the metal door provides a path to ground, causing a shock."
            },
            {
              "process": "Dust attraction",
              "explanation": "TV screens and computer monitors become charged and attract dust particles through induction."
            }
          ]
        },
        {
          "type": "Industrial Applications",
          "description": "Using static electricity deliberately.",
          "examples": [
            {
              "process": "Electrostatic precipitators",
              "explanation": "Power plants use charged plates to attract and remove pollutant particles from smoke before it leaves the smokestack."
            },
            {
              "process": "Photocopiers and laser printers",
              "explanation": "A charged drum attracts toner particles in a pattern, then transfers them to paper—static electricity at work!"
            },
            {
              "process": "Paint spraying",
              "explanation": "Car parts are given an opposite charge to sprayed paint, making paint stick evenly and reducing waste."
            },
            {
              "process": "Static eliminators",
              "explanation": "In electronics manufacturing, ionizing devices neutralize static to prevent damage to sensitive components."
            }
          ]
        },
        {
          "type": "Hazards and Prevention",
          "description": "Managing dangerous static electricity.",
          "examples": [
            {
              "process": "Lightning",
              "explanation": "The ultimate static discharge—charge buildup in clouds discharges as a massive spark we call lightning."
            },
            {
              "process": "Fueling fires",
              "explanation": "Static sparks can ignite flammable vapors at gas pumps. That's why you should touch metal before fueling and never get back in your car during fueling."
            },
            {
              "process": "Electronics damage",
              "explanation": "Static discharges can destroy computer chips. Workers wear grounding straps to prevent buildup."
            },
            {
              "process": "Explosive environments",
              "explanation": "Hospitals use conductive flooring and antistatic equipment in operating rooms to prevent sparks near flammable anesthetics."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit10/static_applications.png",
        "alt": "Collage showing electrostatic precipitator, photocopier, lightning, and grounding strap",
        "caption": "Static electricity has many applications—and can be hazardous if not controlled"
      }
    },
    {
      "section_title": "Simple Static Electricity Experiments",
      "introduction": "You can explore static electricity with common household items.",
      "process_flow": [
        {
          "step": "1",
          "process": "Balloon and hair",
          "description": "Blow up a balloon and rub it vigorously on your hair (or a wool sweater) for about 10 seconds.",
          "mechanism": "Rubbing transfers electrons from hair to balloon, charging both.",
          "result": "The balloon becomes negatively charged and will stick to a wall (by inducing opposite charge). Your hair strands become positively charged and repel each other, standing up.",
          "applications": [
            "Demonstrates charging by friction",
            "Shows attraction and repulsion"
          ]
        },
        {
          "step": "2",
          "process": "Charged comb and water",
          "description": "Run a plastic comb through dry hair several times to charge it. Turn on a faucet so a thin stream of water flows.",
          "mechanism": "Comb becomes negatively charged. Water molecules are polar (slightly positive end, slightly negative end).",
          "result": "Bring the comb near the water stream—it will bend toward the comb because the positive ends of water molecules are attracted.",
          "applications": [
            "Demonstrates attraction between charged object and neutral matter",
            "Shows polarization in action"
          ]
        },
        {
          "step": "3",
          "process": "Making an electroscope",
          "description": "Push a paper clip through a plastic lid. Bend the top into a hook and the bottom into an L. Hang two small aluminum foil balls from the L with thread.",
          "mechanism": "Bring a charged object near the paper clip—charge transfers to the foil balls.",
          "result": "The foil balls will repel each other when charged, just like a real electroscope.",
          "applications": [
            "Build a simple charge detector",
            "Demonstrates like charges repel"
          ]
        },
        {
          "step": "4",
          "process": "Separating salt and pepper",
          "description": "Mix salt and pepper on a plate. Charge a plastic comb by rubbing it on wool or hair.",
          "mechanism": "Bring the charged comb close to the mixture (without touching).",
          "result": "Lighter pepper particles will jump up to the comb first, separating from the salt.",
          "applications": [
            "Shows that charge attracts light objects",
            "Practical demonstration of electrostatic attraction"
          ]
        }
      ]
    },
    {
      "section_title": "Practice Questions",
      "introduction": "Apply your understanding of static electricity.",
      "worked_examples": [
        {
          "title": "Problem 1: Charge Types",
          "problem": "A plastic ruler is rubbed with a wool cloth and becomes negatively charged. a) What happened to the electrons? b) What is the charge on the wool?",
          "step_by_step": [
            {
              "step": "Part a",
              "explanation": "The ruler gained electrons from the wool, so electrons transferred from wool to ruler."
            },
            {
              "step": "Part b",
              "explanation": "The wool lost electrons, so it has a positive charge."
            }
          ],
          "final_answer": "a) Electrons moved from wool to ruler. b) Wool is positively charged.",
          "concept_applied": "Charging by friction."
        },
        {
          "title": "Problem 2: Attraction and Repulsion",
          "problem": "Two balloons are both negatively charged. Will they attract or repel? What if one is positive and one negative?",
          "step_by_step": [
            {
              "step": "Same charges",
              "explanation": "Like charges repel, so two negative balloons repel."
            },
            {
              "step": "Opposite charges",
              "explanation": "Unlike charges attract, so positive and negative attract."
            }
          ],
          "final_answer": "Two negatives repel; opposite charges attract.",
          "concept_applied": "Fundamental charge interaction."
        },
        {
          "title": "Problem 3: Conductors vs Insulators",
          "problem": "Why can you charge a plastic rod by rubbing it, but you cannot easily charge a metal rod held in your hand the same way?",
          "step_by_step": [
            {
              "step": "Plastic rod",
              "explanation": "Plastic is an insulator—charge stays where it's placed and cannot flow away."
            },
            {
              "step": "Metal rod",
              "explanation": "Metal is a conductor—charge would flow through your body to ground, so it cannot build up."
            },
            {
              "step": "Solution",
              "explanation": "To charge a metal rod, you must hold it with an insulating handle so charge cannot escape."
            }
          ],
          "final_answer": "Insulators trap charge; conductors allow it to flow away to ground.",
          "concept_applied": "Conductor vs insulator in static charging."
        },
        {
          "title": "Problem 4: Charging by Contact",
          "problem": "A metal sphere with charge +15 μC touches an identical neutral sphere. What is the charge on each after they are separated?",
          "step_by_step": [
            {
              "step": "Total charge",
              "explanation": "+15 μC + 0 μC = +15 μC"
            },
            {
              "step": "Divide equally",
              "explanation": "+15 μC ÷ 2 = +7.5 μC each"
            }
          ],
          "final_answer": "Each sphere has +7.5 μC.",
          "concept_applied": "Charge sharing."
        },
        {
          "title": "Problem 5: Charge Conservation",
          "problem": "A +6 μC sphere touches a -10 μC identical sphere. What is the final charge on each?",
          "step_by_step": [
            {
              "step": "Total charge",
              "explanation": "+6 μC + (-10 μC) = -4 μC"
            },
            {
              "step": "Divide equally",
              "explanation": "-4 μC ÷ 2 = -2 μC each"
            }
          ],
          "final_answer": "Each sphere ends with -2 μC.",
          "concept_applied": "Charge averaging with opposite signs."
        },
        {
          "title": "Problem 6: Electroscope",
          "problem": "A positively charged rod is brought near (but not touching) the knob of a neutral electroscope. What happens to the leaves? Explain.",
          "step_by_step": [
            {
              "step": "Induction effect",
              "explanation": "The positive rod attracts electrons upward into the knob, leaving the leaves temporarily positive."
            },
            {
              "step": "Result",
              "explanation": "Both leaves become positively charged and repel each other, so they diverge even though no contact occurred."
            }
          ],
          "final_answer": "Leaves diverge because electrons are attracted upward, leaving leaves with a temporary positive charge.",
          "concept_applied": "Electroscope response to charged object."
        }
      ]
    },
    {
      "section_title": "Common Misconceptions",
      "introduction": "Here are frequent misunderstandings about static electricity.",
      "principles": [
        {
          "principle": "Misconception: Rubbing creates charge",
          "statement": "Students often think rubbing creates electric charge from nothing.",
          "application": "Rubbing doesn't create charge—it transfers electrons from one material to another. Charge is conserved, just redistributed.",
          "example": "The total charge of the balloon and hair together is still zero—one gained electrons, the other lost them."
        },
        {
          "principle": "Misconception: Only electrons move",
          "statement": "Some think protons can also move during charging.",
          "application": "Protons are fixed in atomic nuclei and never move during electrostatic charging. Only electrons transfer.",
          "example": "When glass becomes positive, it's because it lost electrons, not because it gained protons."
        },
        {
          "principle": "Misconception: Insulators can't conduct at all",
          "statement": "Students may think insulators block all charge movement completely.",
          "application": "Insulators resist charge flow but can still be charged and can still allow some movement under extreme conditions. They just don't conduct easily.",
          "example": "A plastic ruler can be charged and will hold charge, but if you touch it, charge doesn't flow away instantly."
        },
        {
          "principle": "Misconception: Static electricity is weak and unimportant",
          "statement": "Some dismiss static electricity as a minor curiosity.",
          "application": "Static electricity can involve enormous voltages (lightning is millions of volts) and has major industrial applications and safety implications.",
          "example": "Electrostatic precipitators remove pollutants from power plant emissions—saving lives and cleaning air."
        },
        {
          "principle": "Misconception: Charge stays forever",
          "statement": "Students think once an object is charged, it stays charged.",
          "application": "Charge gradually leaks off objects, especially in humid air where water molecules provide a path for charge to escape.",
          "example": "Static experiments work better on dry days because humidity allows charge to leak away."
        }
      ]
    }
  ],
  "key_terms": [
    "Static electricity",
    "Electric charge",
    "Proton",
    "Electron",
    "Neutron",
    "Positive charge",
    "Negative charge",
    "Like charges repel",
    "Unlike charges attract",
    "Conductor",
    "Insulator",
    "Charging by friction",
    "Charging by contact",
    "Triboelectric series",
    "Electroscope",
    "Charge conservation",
    "Grounding",
    "Discharge",
    "Electrostatic precipitator",
    "Lightning"
  ],
  "summary": "Static electricity involves stationary electric charges resulting from an imbalance of electrons in materials. The fundamental principle is that like charges repel and unlike charges attract. All matter is made of atoms containing positive protons and negative electrons—when electrons transfer between materials, one becomes positive (electron deficiency) and the other negative (electron excess). Conductors (like metals) allow charges to move freely; insulators (like plastic and rubber) trap charges in place. Charging can occur by friction (rubbing materials together), by contact (touching a charged object to a neutral one), or by induction (without direct contact). The triboelectric series ranks materials by their tendency to gain or lose electrons. An electroscope detects charge using the principle of like-charge repulsion. Static electricity has important real-world applications: electrostatic precipitators clean industrial emissions, photocopiers use charged drums, and paint spraying uses attraction to coat surfaces evenly. It also presents hazards: lightning is a massive static discharge, and static sparks can ignite flammable materials. Understanding static electricity is essential for grasping more advanced topics like current electricity, circuits, and Coulomb's law, which quantifies the force between charges."
}
