{
  "expanded_description": "Drawing inferences and making arguments from data is the ultimate goal of statistics. After collecting, organizing, and analyzing data, we must interpret what the results mean in context, draw reasonable conclusions, and communicate our findings effectively. This involves understanding the difference between correlation and causation, recognizing potential biases and lurking variables, evaluating the strength of evidence, and making predictions with appropriate caveats. Statistical arguments must be supported by data, acknowledge uncertainty, and avoid overgeneralization. This final section brings together all the concepts from the unit to develop critical thinking skills for evaluating statistical claims and making data-informed decisions.",
  
  "core_concept": {
    "principle": "Key principles for drawing inferences from data:<br><br>• **Context matters**: Always interpret results in the context of how data was collected<br>• **Association ≠ causation**: Correlations may have alternative explanations<br>• **Consider lurking variables**: Hidden factors may explain observed relationships<br>• **Acknowledge uncertainty**: Sample statistics vary; results are estimates<br>• **Avoid overgeneralization**: Conclusions apply only to the population sampled<br>• **Evaluate strength of evidence**: Consider sample size, effect size, and consistency<br>• **Communicate clearly**: Present findings with appropriate caveats and limitations",
    
    "explanation": "Think of yourself as a detective presenting a case. You've gathered evidence (data), analyzed it (statistics), and now you need to convince others of your conclusions. But a good detective also acknowledges weaknesses in the case, considers alternative explanations, and doesn't claim more than the evidence supports. Drawing inferences from data is about making the strongest case the evidence allows while being honest about its limitations.",
    
    "image": {
      "src": "images/unit14/data_inferences_overview.png",
      "alt": "Process of drawing conclusions from data: evidence → analysis → inference → communication",
      "caption": "Figure 14.10.1: From data to informed conclusions: the inference process."
    }
  },

  "sections": [
    {
      "section_title": "14.10.1 The Difference Between Association and Causation",
      
      "introduction": "One of the most common errors in interpreting data is confusing association with causation. Understanding this distinction is crucial.",
      
      "introduction_image": {
        "src": "images/unit14/association_vs_causation_intro.png",
        "alt": "Association vs causation",
        "caption": "Figure 14.10.2: Association means two variables are related; causation means one causes the other."
      },
      
      "key_concept": {
        "definition": "**Association** (correlation) means two variables tend to change together. They are related in some way.<br><br>**Causation** means changes in one variable directly produce changes in the other.<br><br>Association can occur without causation due to:<br>• **Lurking variables**: A third variable affects both<br>• **Coincidence**: Random chance<br>• **Reverse causation**: The direction of cause might be opposite<br>• **Confounding**: Multiple factors intertwined",
        
        "context": "To establish causation, we typically need controlled experiments, not just observational data. Random assignment to treatment groups helps eliminate alternative explanations.",
        
        "image": {
          "src": "images/unit14/association_vs_causation_example.png",
          "alt": "Examples of association without causation",
          "caption": "Figure 14.10.3: Ice cream sales and drowning are associated but not causally related."
        }
      },

      "worked_examples": [
        {
          "title": "Identifying Association vs Causation Claims",
          
          "image": {
            "src": "images/unit14/association_vs_causation_practice.png",
            "alt": "Practice distinguishing association and causation",
            "caption": "Figure 14.10.4: For each claim, determine if causation is justified."
          },
          
          "problem": "For each statement, decide whether causation is reasonably claimed or if it's just association:<br>a) A study finds that people who exercise more have lower blood pressure. Researchers conclude exercise reduces blood pressure.<br>b) Data shows that cities with more firefighters have more fire damage. A news report says hiring more firefighters causes more damage.<br>c) A randomized experiment gives one group a new drug and another a placebo. The drug group has fewer headaches. Researchers conclude the drug reduces headaches.<br>d) A survey finds that students who eat breakfast have higher grades. A principal mandates breakfast for all students to improve grades.",
          
          "step_by_step": [
            {
              "step": "a) Exercise and blood pressure",
              "explanation": "Observational study, possible lurking variables (diet, genetics, etc.)",
              "calculation": "Association observed, but causation not proven - could be other factors"
            },
            {
              "step": "b) Firefighters and fire damage",
              "explanation": "Clearly reverse causation - more firefighters respond to bigger fires",
              "calculation": "Association, but causation claim is absurd"
            },
            {
              "step": "c) Drug experiment",
              "explanation": "Randomized controlled experiment - strongest evidence for causation",
              "calculation": "Causation claim is reasonable"
            },
            {
              "step": "d) Breakfast and grades",
              "explanation": "Observational study; could be motivated students eat breakfast and study more",
              "calculation": "Association only; mandating breakfast may not help"
            }
          ],
          
          "final_answer": "a) Association only; b) Association only (reverse causation); c) Causation reasonable; d) Association only",
          "concept_applied": "Randomized experiments can support causation; observational studies generally only show association."
        }
      ],

      "image": {
        "src": "images/unit14/association_vs_causation_summary.png",
        "alt": "Summary of association vs causation",
        "caption": "Figure 14.10.5: Association vs causation summary."
      }
    },

    {
      "section_title": "14.10.2 Identifying Lurking Variables",
      
      "introduction": "Lurking variables are hidden factors that can create or obscure relationships between the variables we study.",
      
      "introduction_image": {
        "src": "images/unit14/lurking_variables_intro.png",
        "alt": "Lurking variable concept",
        "caption": "Figure 14.10.6: A lurking variable affects both variables, creating a false impression."
      },
      
      "key_concept": {
        "definition": "A **lurking variable** is a variable not included in the study that affects both variables being studied, potentially creating a false association or masking a real one.<br><br>Characteristics:<br>• Not measured in the study<br>• Related to both the explanatory and response variables<br>• Can create spurious correlations<br>• Can hide true relationships<br><br>Example: The positive correlation between ice cream sales and drowning deaths is explained by the lurking variable \"temperature\" - hot weather increases both.",
        
        "context": "Identifying potential lurking variables is a critical thinking skill in statistics. Always ask: \"What else might explain this relationship?\"",
        
        "image": {
          "src": "images/unit14/lurking_variables_example.png",
          "alt": "Examples of lurking variables",
          "caption": "Figure 14.10.7: Temperature is a lurking variable explaining ice cream-drowning correlation."
        }
      },

      "worked_examples": [
        {
          "title": "Identifying Lurking Variables",
          
          "image": {
            "src": "images/unit14/lurking_variables_practice.png",
            "alt": "Practice identifying lurking variables",
            "caption": "Figure 14.10.8: Suggest a possible lurking variable for each correlation."
          },
          
          "problem": "For each observed correlation, suggest a possible lurking variable that might explain it:<br>a) Number of churches in a city and number of crimes are positively correlated.<br>b) Children with larger shoe sizes have higher reading scores.<br>c) Countries with more chocolate consumption have more Nobel laureates.<br>d) People who take vitamins have better health outcomes.",
          
          "step_by_step": [
            {
              "step": "a) Churches and crimes",
              "explanation": "Both relate to city size",
              "calculation": "Lurking variable: Population (larger cities have more of both)"
            },
            {
              "step": "b) Shoe size and reading",
              "explanation": "Both increase with age",
              "calculation": "Lurking variable: Age (older children have larger feet and better reading)"
            },
            {
              "step": "c) Chocolate and Nobel laureates",
              "explanation": "Both relate to country wealth/development",
              "calculation": "Lurking variable: Economic development (wealthier countries have more chocolate consumption and more research funding)"
            },
            {
              "step": "d) Vitamins and health",
              "explanation": "Health-conscious people do many healthy things",
              "calculation": "Lurking variable: Overall health consciousness (diet, exercise, not smoking)"
            }
          ],
          
          "final_answer": "a) Population; b) Age; c) Economic development; d) Overall health consciousness",
          "concept_applied": "Look for factors that could affect both variables in the observed correlation."
        }
      ],

      "image": {
        "src": "images/unit14/lurking_variables_summary.png",
        "alt": "Summary of lurking variables",
        "caption": "Figure 14.10.9: Lurking variables summary."
      }
    },

    {
      "section_title": "14.10.3 Evaluating Statistical Claims",
      
      "introduction": "We are constantly bombarded with statistical claims in media, advertising, and research. Learning to evaluate them critically is essential.",
      
      "introduction_image": {
        "src": "images/unit14/evaluate_claims_intro.png",
        "alt": "Evaluating statistical claims",
        "caption": "Figure 14.10.10: Critical questions to ask about any statistical claim."
      },
      
      "key_concept": {
        "definition": "When evaluating a statistical claim, ask:<br><br>1. **Who sponsored the research?** Any potential bias?<br>2. **How was data collected?** Survey, experiment, observational study?<br>3. **Sample size and selection?** Representative? Large enough?<br>4. **What statistics are reported?** Means, percentages, correlations?<br>5. **Are conclusions appropriate?** Do they overstate findings?<br>6. **Are alternative explanations considered?** Lurking variables?<br>7. **Is causation claimed?** Is it justified?<br>8. **Are results consistent with other studies?**<br>9. **What is the margin of error?** How precise are estimates?",
        
        "context": "Being statistically literate means not taking every number at face value. Ask questions, look for hidden assumptions, and consider the source.",
        
        "image": {
          "src": "images/unit14/evaluate_claims_checklist.png",
          "alt": "Checklist for evaluating statistical claims",
          "caption": "Figure 14.10.11: Critical evaluation checklist."
        }
      },

      "worked_examples": [
        {
          "title": "Evaluating a Statistical Claim",
          
          "image": {
            "src": "images/unit14/evaluate_claims_practice.png",
            "alt": "Practice evaluating claims",
            "caption": "Figure 14.10.12: Evaluate this advertising claim."
          },
          
          "problem": "A toothpaste advertisement claims: \"Clinical study shows that 90% of dentists recommend our brand!\" The fine print says: \"Survey of 100 dentists sponsored by our company. Dentists were asked to choose their preferred brand from a list of three.\" Evaluate this claim.",
          
          "step_by_step": [
            {
              "step": "Sponsorship",
              "explanation": "Company-sponsored research may have bias",
              "calculation": "Potential conflict of interest"
            },
            {
              "step": "Sample size",
              "explanation": "100 dentists is a reasonable sample size",
              "calculation": "Adequate, but depends on total dentist population"
            },
            {
              "step": "Question wording",
              "explanation": "Asked to choose from only three brands - may not reflect real preferences",
              "calculation": "Limited options could inflate percentage"
            },
            {
              "step": "Interpretation of 'recommend'",
              "explanation": "'Preferred' is not the same as 'recommend'",
              "calculation": "Subtle wording difference matters"
            },
            {
              "step": "Overall assessment",
              "explanation": "Claim likely exaggerates true recommendation rate",
              "calculation": "Useful but with significant caveats"
            }
          ],
          
          "final_answer": "The claim has several issues: company sponsorship bias, limited choice set (only 3 brands), and potential wording manipulation ('preferred' vs 'recommend'). While not necessarily false, it likely overstates actual recommendation rates.",
          "concept_applied": "Critical evaluation involves examining methodology, not just the headline number."
        }
      ],

      "image": {
        "src": "images/unit14/evaluate_claims_summary.png",
        "alt": "Summary of evaluating statistical claims",
        "caption": "Figure 14.10.13: Evaluating claims summary."
      }
    },

    {
      "section_title": "14.10.4 Making Predictions and Generalizations",
      
      "introduction": "When we make predictions or generalize from data, we must be clear about the limitations of our conclusions.",
      
      "introduction_image": {
        "src": "images/unit14/generalizations_intro.png",
        "alt": "Making predictions and generalizations",
        "caption": "Figure 14.10.14: Predictions are only valid for similar populations and conditions."
      },
      
      "key_concept": {
        "definition": "Key considerations when generalizing:<br><br>• **Population**: Results only apply to the population from which the sample was drawn<br>• **Time period**: Relationships may change over time<br>• **Context**: Conditions matter - what's true in one setting may not hold in another<br>• **Extrapolation**: Predictions far outside observed data are unreliable<br>• **Variability**: Individual predictions have uncertainty; group averages are more stable",
        
        "context": "A study of college students in 2020 may not generalize to older adults or to students in 2030. Always consider the scope of your data.",
        
        "image": {
          "src": "images/unit14/generalizations_example.png",
          "alt": "Generalization limits example",
          "caption": "Figure 14.10.15: Results only apply to the population sampled."
        }
      },

      "worked_examples": [
        {
          "title": "Identifying Generalization Limits",
          
          "image": {
            "src": "images/unit14/generalizations_practice.png",
            "alt": "Practice identifying generalization limits",
            "caption": "Figure 14.10.16: What are the limitations of each generalization?"
          },
          
          "problem": "For each situation, identify limitations of generalizing the results:<br>a) A study of 500 smartphone users aged 18-25 finds they spend average 4 hours/day on social media. Conclusion: \"Young adults spend 4 hours daily on social media.\"<br>b) A 2010 study finds a strong correlation between social media use and anxiety. Conclusion used in 2025.<br>c) A study of college students at a private university in New York finds they prefer coffee over tea. Conclusion: \"American college students prefer coffee.\"<br>d) A regression model based on data from x=10 to x=50 predicts y for x=100.",
          
          "step_by_step": [
            {
              "step": "a) Smartphone users aged 18-25",
              "explanation": "Sample limited to smartphone users in that age range",
              "calculation": "May not generalize to all young adults (some don't have smartphones) or other age groups"
            },
            {
              "step": "b) 2010 study used in 2025",
              "explanation": "Social media landscape has changed dramatically",
              "calculation": "Results may be outdated; generalization across time is risky"
            },
            {
              "step": "c) Private university in NY",
              "explanation": "Not representative of all US college students (region, socioeconomic status)",
              "calculation": "Cannot generalize to all American college students"
            },
            {
              "step": "d) Predict at x=100",
              "explanation": "Far outside observed data range",
              "calculation": "Extrapolation is highly unreliable; relationship may change"
            }
          ],
          
          "final_answer": "a) Limited to smartphone users 18-25; b) Temporal limitations; c) Geographic and institutional bias; d) Extrapolation beyond data range",
          "concept_applied": "Generalizations are only valid within the scope of the original data - consider population, time, and range."
        }
      ],

      "image": {
        "src": "images/unit14/generalizations_summary.png",
        "alt": "Summary of making predictions and generalizations",
        "caption": "Figure 14.10.17: Generalizations summary."
      }
    },

    {
      "section_title": "14.10.5 Understanding Margin of Error and Confidence",
      
      "introduction": "Statistical estimates are never exact. Understanding margin of error helps us interpret poll results and survey findings appropriately.",
      
      "introduction_image": {
        "src": "images/unit14/margin_error_intro.png",
        "alt": "Margin of error concept",
        "caption": "Figure 14.10.18: Estimates have a range of plausible values."
      },
      
      "key_concept": {
        "definition": "**Margin of error** quantifies the uncertainty in a sample estimate. For a poll reporting 60% with ±3% margin of error:<br><br>• The true population value is likely between 57% and 63%<br>• The interval is usually at a 95% confidence level<br>• Larger samples have smaller margins of error<br>• Margin of error doesn't cover all errors (bias, wording effects, etc.)<br><br>When comparing two estimates, differences smaller than the margin of error may not be meaningful.",
        
        "context": "News reports often say \"Candidate leads 52% to 48%, within the margin of error\" - meaning the race is too close to call because the intervals overlap.",
        
        "image": {
          "src": "images/unit14/margin_error_example.png",
          "alt": "Margin of error visualization",
          "caption": "Figure 14.10.19: Margin of error creates a range of plausible values."
        }
      },

      "worked_examples": [
        {
          "title": "Interpreting Margin of Error",
          
          "image": {
            "src": "images/unit14/margin_error_practice.png",
            "alt": "Practice with margin of error",
            "caption": "Figure 14.10.20: Interpret these poll results."
          },
          
          "problem": "A political poll of 1000 likely voters shows: Candidate A: 52%, Candidate B: 48%, with a margin of error of ±3%.<br>a) What does the margin of error tell us?<br>b) Can we say Candidate A is definitely leading?<br>c) How would your answer change if the margin of error were ±2%?",
          
          "step_by_step": [
            {
              "step": "a) Interpret margin of error",
              "explanation": "The true support for each candidate is likely within 3% of the reported value",
              "calculation": "Candidate A: 49-55%, Candidate B: 45-51%"
            },
            {
              "step": "b) Is A definitely leading?",
              "explanation": "The intervals overlap: A could be as low as 49%, B as high as 51%",
              "calculation": "Race is too close to call - A may not actually lead"
            },
            {
              "step": "c) If margin were ±2%",
              "explanation": "A: 50-54%, B: 46-50% - intervals still slightly overlap at 50%",
              "calculation": "Still not definite, but stronger evidence for A"
            }
          ],
          
          "final_answer": "a) The true values are likely within ±3% of reported percentages. b) No, the intervals overlap, so we cannot be confident A is ahead. c) With ±2%, intervals still slightly overlap, so still not definitive, but evidence for A is stronger.",
          "concept_applied": "Margin of error creates confidence intervals; overlapping intervals mean differences aren't statistically significant."
        }
      ],

      "image": {
        "src": "images/unit14/margin_error_summary.png",
        "alt": "Summary of margin of error",
        "caption": "Figure 14.10.21: Margin of error summary."
      }
    },

    {
      "section_title": "14.10.6 Bias in Data Collection",
      
      "introduction": "Bias in how data is collected can make any inference invalid, no matter how sophisticated the analysis.",
      
      "introduction_image": {
        "src": "images/unit14/bias_intro.png",
        "alt": "Types of bias in data collection",
        "caption": "Figure 14.10.22: Bias can distort results in predictable directions."
      },
      
      "key_concept": {
        "definition": "Common sources of bias:<br><br>• **Selection bias**: Sample not representative of population (e.g., online poll only reaches internet users)<br>• **Nonresponse bias**: Those who respond differ from those who don't<br>• **Response bias**: Respondents give inaccurate answers (social desirability, leading questions)<br>• **Voluntary response bias**: Self-selected participants have strong opinions<br>• **Recall bias**: People remember events inaccurately<br>• **Sponsorship bias**: Research funded by interested parties may be skewed",
        
        "context": "The best statistical analysis cannot fix biased data. Always consider how data was collected before drawing conclusions.",
        
        "image": {
          "src": "images/unit14/bias_examples.png",
          "alt": "Examples of different biases",
          "caption": "Figure 14.10.23: Common bias types."
        }
      },

      "worked_examples": [
        {
          "title": "Identifying Bias",
          
          "image": {
            "src": "images/unit14/bias_practice.png",
            "alt": "Practice identifying bias",
            "caption": "Figure 14.10.24: Identify the type of bias in each scenario."
          },
          
          "problem": "Identify the type of bias in each scenario:<br>a) A radio station asks listeners to call in and vote on a local issue. The results show 80% support.<br>b) A survey asks: \"Don't you agree that smoking should be banned in public places?\" 95% say yes.<br>c) A mail survey about community satisfaction gets only 10% response rate, mostly from retirees.<br>d) A study on exercise habits asks people to recall how many times they exercised last month.",
          
          "step_by_step": [
            {
              "step": "a) Radio call-in poll",
              "explanation": "Only listeners with strong opinions call in",
              "calculation": "Voluntary response bias"
            },
            {
              "step": "b) Leading question",
              "explanation": "\"Don't you agree\" pushes respondents toward agreement",
              "calculation": "Response bias (question wording)"
            },
            {
              "step": "c) Low response rate",
              "explanation": "Respondents differ from non-respondents",
              "calculation": "Nonresponse bias"
            },
            {
              "step": "d) Recall of exercise",
              "explanation": "People may misremember or exaggerate",
              "calculation": "Recall bias"
            }
          ],
          
          "final_answer": "a) Voluntary response bias; b) Response bias (leading question); c) Nonresponse bias; d) Recall bias",
          "concept_applied": "Different types of bias affect data quality in different ways."
        }
      ],

      "image": {
        "src": "images/unit14/bias_summary.png",
        "alt": "Summary of bias types",
        "caption": "Figure 14.10.25: Bias summary."
      }
    },

    {
      "section_title": "14.10.7 Making a Statistical Argument",
      
      "introduction": "Presenting statistical findings effectively requires clear communication of evidence, reasoning, and limitations.",
      
      "introduction_image": {
        "src": "images/unit14/statistical_argument_intro.png",
        "alt": "Structure of a statistical argument",
        "caption": "Figure 14.10.26: A strong statistical argument includes claim, evidence, reasoning, and caveats."
      },
      
      "key_concept": {
        "definition": "A strong statistical argument includes:<br><br>1. **Claim**: What you're trying to show<br>2. **Evidence**: Data and statistical summaries<br>3. **Reasoning**: How the evidence supports the claim<br>4. **Caveats**: Limitations, assumptions, and alternative explanations<br>5. **Conclusion**: What can reasonably be concluded<br><br>Always acknowledge uncertainty and avoid overstating findings.",
        
        "context": "This structure is similar to scientific writing and helps build credibility by being transparent about both strengths and weaknesses.",
        
        "image": {
          "src": "images/unit14/statistical_argument_structure.png",
          "alt": "Structure of a statistical argument",
          "caption": "Figure 14.10.27: Components of a statistical argument."
        }
      },

      "worked_examples": [
        {
          "title": "Constructing a Statistical Argument",
          
          "image": {
            "src": "images/unit14/statistical_argument_practice.png",
            "alt": "Practice constructing argument",
            "caption": "Figure 14.10.28: Build a statistical argument from the given information."
          },
          
          "problem": "You have data from a random sample of 200 high school students showing that students who participate in extracurricular activities have average GPA 3.4, while non-participants have average GPA 3.0. The difference is statistically significant. Construct a statistical argument about whether extracurricular activities cause higher grades.",
          
          "step_by_step": [
            {
              "step": "State the claim",
              "explanation": "We want to argue about the relationship between activities and grades",
              "calculation": "Claim: Extracurricular participation is associated with higher GPAs"
            },
            {
              "step": "Present evidence",
              "explanation": "Sample of 200 students, random selection",
              "calculation": "Participants GPA: 3.4, Non-participants: 3.0, difference statistically significant"
            },
            {
              "step": "Reasoning",
              "explanation": "The difference is large and unlikely due to chance",
              "calculation": "Strong evidence of association"
            },
            {
              "step": "Add caveats",
              "explanation": "Observational study - cannot prove causation",
              "calculation": "Possible lurking variables: motivation, family support, prior academic ability"
            },
            {
              "step": "Conclusion",
              "explanation": "There is a clear association, but we cannot definitively say activities cause higher grades",
              "calculation": "Further research with controlled conditions would be needed"
            }
          ],
          
          "final_answer": "Claim: Extracurricular participation is associated with higher GPAs. Evidence: Random sample of 200 students shows 0.4 GPA difference, statistically significant. Reasoning: The difference is unlikely due to chance. Caveats: Observational study; lurking variables like motivation could explain the relationship. Conclusion: Strong association exists, but causation cannot be proven from this data alone.",
          "concept_applied": "A good statistical argument presents evidence honestly, acknowledges limitations, and doesn't overclaim."
        }
      ],

      "image": {
        "src": "images/unit14/statistical_argument_summary.png",
        "alt": "Summary of making statistical arguments",
        "caption": "Figure 14.10.29: Statistical argument summary."
      }
    },

    {
      "section_title": "14.10.8 Common Errors in Statistical Reasoning",
      
      "introduction": "Students often make predictable mistakes when drawing inferences from data.",
      
      "classifications": [
        {
          "type": "Confusing Statistical Significance with Practical Significance",
          "value": "Thinking a statistically significant result is always important or meaningful.",
          "characteristics": [
            "Ignoring effect size",
            "Focusing only on p-values"
          ],
          "behavior": "Overemphasizing trivial differences with large samples.",
          
          "image": {
            "src": "images/unit14/error_significance.png",
            "alt": "Statistical vs practical significance",
            "caption": "Figure 14.10.30: Error - confusing statistical and practical significance."
          },
          
          "examples": [
            {
              "process": "Error: With a huge sample, a 0.1 point GPA difference is statistically significant - concluding it's important",
              "explanation": "Correct: Consider whether the difference matters in practice"
            }
          ]
        },
        {
          "type": "Post Hoc Reasoning",
          "value": "Finding patterns in data and then inventing explanations after the fact.",
          "characteristics": [
            "Data mining without hypothesis",
            "Overinterpreting random patterns"
          ],
          "behavior": "Finding spurious correlations and treating them as meaningful.",
          
          "image": {
            "src": "images/unit14/error_posthoc.png",
            "alt": "Post hoc reasoning fallacy",
            "caption": "Figure 14.10.31: Error - post hoc reasoning."
          },
          
          "examples": [
            {
              "process": "Error: Noticing that sales increase on days the marketing manager wears blue, concluding blue shirts cause more sales",
              "explanation": "Correct: Random patterns occur; need hypothesis testing"
            }
          ]
        },
        {
          "type": "Ecological Fallacy",
          "value": "Assuming group-level relationships apply to individuals within the group.",
          "characteristics": [
            "Using aggregate data to make individual claims",
            "Ignoring within-group variation"
          ],
          "behavior": "Incorrect conclusions about individuals.",
          
          "image": {
            "src": "images/unit14/error_ecological.png",
            "alt": "Ecological fallacy",
            "caption": "Figure 14.10.32: Error - ecological fallacy."
          },
          
          "examples": [
            {
              "process": "Error: Richer countries have higher average happiness, so a rich person in a poor country must be unhappy",
              "explanation": "Correct: Group averages don't determine individual outcomes"
            }
          ]
        }
      ],

      "worked_examples": [
        {
          "title": "Correcting Statistical Reasoning Errors",
          
          "image": {
            "src": "images/unit14/reasoning_errors_example.png",
            "alt": "Student's incorrect reasoning",
            "caption": "Figure 14.10.33: Find and correct the error."
          },
          
          "problem": "A student looks at data showing that states with higher literacy rates have higher average incomes. They conclude that if you want to increase your income, you should move to a state with high literacy rates. What's wrong with this reasoning?",
          
          "step_by_step": [
            {
              "step": "Identify the reasoning",
              "explanation": "Student is applying a group-level correlation to individual decisions",
              "calculation": "This is the ecological fallacy"
            },
            {
              "step": "Explain the error",
              "explanation": "The correlation at state level doesn't guarantee that moving to a high-literacy state will increase an individual's income",
              "calculation": "Many other factors determine individual income"
            },
            {
              "step": "Correct approach",
              "explanation": "The data shows association, not causation, and applies to averages, not individuals",
              "calculation": "Individual outcomes depend on personal characteristics, not just state averages"
            }
          ],
          
          "final_answer": "The error is the ecological fallacy - assuming a group-level correlation applies to individuals. The data doesn't support the conclusion that moving will increase an individual's income.",
          "concept_applied": "Group averages don't determine individual outcomes; be careful applying aggregate data to individual cases."
        }
      ],

      "image": {
        "src": "images/unit14/reasoning_errors_summary.png",
        "alt": "Summary table of common statistical reasoning errors",
        "caption": "Figure 14.10.34: Common errors summary."
      }
    },

    {
      "section_title": "14.10.9 Practice with Data Inferences",
      
      "introduction": "Apply your critical thinking skills to evaluate data-based arguments.",
      
      "worked_examples": [
        {
          "title": "Mixed Practice Set",
          
          "image": {
            "src": "images/unit14/inferences_practice.png",
            "alt": "Multiple practice problems",
            "caption": "Figure 14.10.35: Practice problems."
          },
          
          "problem": "1) A study of 10,000 people finds that those who drink coffee live 2 years longer on average. The study controlled for age, gender, and smoking. Can we conclude coffee causes longer life? What additional information would help?<br><br>2) A poll of 500 registered voters shows Candidate X at 48%, Candidate Y at 45%, with ±4% margin of error. What can you conclude about the election?<br><br>3) Identify the lurking variable: A study shows that students who take SAT prep courses score higher on the SAT than those who don't.<br><br>4) A news headline says: \"Study finds that children who play video games have better problem-solving skills.\" The study was funded by a video game company and surveyed parents about their children's gaming habits and skills. Evaluate this claim.<br><br>5) A school implements a new teaching method and test scores increase by 5%. Can we conclude the new method caused the improvement? What else might explain it?",
          
          "step_by_step": [
            {
              "step": "1) Coffee and longevity",
              "explanation": "Controlled for some variables, but observational study",
              "calculation": "Cannot conclude causation; possible lurking variables: health consciousness, diet, exercise, genetics<br>Need randomized controlled trial for causation"
            },
            {
              "step": "2) Poll results",
              "explanation": "X: 48% ±4% → 44-52%, Y: 45% ±4% → 41-49%",
              "calculation": "Intervals overlap substantially; race is too close to call"
            },
            {
              "step": "3) SAT prep lurking variable",
              "explanation": "Students who take prep courses may be more motivated, have more resources, or higher prior achievement",
              "calculation": "Lurking variable: motivation or socioeconomic status"
            },
            {
              "step": "4) Video game study evaluation",
              "explanation": "Funding source bias, parent reporting bias (may overestimate), no control group",
              "calculation": "Weak evidence; association only, possible confounding"
            },
            {
              "step": "5) Teaching method",
              "explanation": "Observational study without control group",
              "calculation": "Could be other factors: different students, teaching quality, test difficulty, Hawthorne effect"
            }
          ],
          
          "final_answer": "1) Cannot conclude causation; need randomized controlled trial. 2) Race too close to call; intervals overlap. 3) Motivation or socioeconomic status. 4) Weak evidence due to bias and confounding; association only. 5) Cannot conclude causation; many alternative explanations possible.",
          "concept_applied": "Practice critical evaluation of statistical claims and inferences."
        }
      ],

      "image": {
        "src": "images/unit14/inferences_practice_solutions.png",
        "alt": "Complete solutions to practice problems",
        "caption": "Figure 14.10.36: Practice solutions."
      }
    }
  ],

  "key_terms": [
    "Inference",
    "Association",
    "Causation",
    "Lurking Variable",
    "Confounding",
    "Margin of Error",
    "Confidence Interval",
    "Statistical Significance",
    "Practical Significance",
    "Bias",
    "Selection Bias",
    "Nonresponse Bias",
    "Response Bias",
    "Voluntary Response Bias",
    "Ecological Fallacy",
    "Post Hoc Reasoning",
    "Generalization",
    "Extrapolation",
    "Statistical Argument"
  ],

  "summary": "Drawing inferences from data requires critical thinking and awareness of statistical principles. The fundamental distinction between association and causation means observational studies can only show relationships, not prove causes. Lurking variables may explain observed correlations. When evaluating statistical claims, consider the source, methodology, sample size, and potential biases. Margin of error quantifies uncertainty in estimates; overlapping intervals mean differences aren't significant. Generalizations apply only to the population sampled and time period studied. Bias in data collection - selection bias, nonresponse bias, response bias - can invalidate any analysis. Strong statistical arguments include clear claims, evidence, reasoning, and appropriate caveats. Common reasoning errors include confusing statistical with practical significance, post hoc reasoning, and the ecological fallacy. Developing statistical literacy means questioning numbers, considering alternative explanations, and being honest about what data can and cannot tell us. These skills are essential for making informed decisions in a data-rich world.",

  "review_questions_image": {
    "src": "images/unit14/data_inferences_summary.png",
    "alt": "Comprehensive summary: association vs causation, lurking variables, evaluating claims, margin of error, bias, statistical arguments, common reasoning errors",
    "caption": "Figure 14.10.37: Data inferences and arguments summary."
  }
}
