{
  "expanded_description": "This section introduces circular motion, the motion of an object along a circular path. Unlike straight-line motion, circular motion involves continuous changes in direction, which means the velocity vector is constantly changing even if the speed remains constant. We define key quantities for describing circular motion: period, frequency, tangential speed, and angular displacement.",
  "core_concept": {
    "principle": "Circular motion is motion along a circular path. Even at constant speed, an object in circular motion is accelerating because its direction is continuously changing. The motion can be described using linear quantities (like tangential speed) or angular quantities (like angular displacement).",
    "explanation": "To describe circular motion, we need both the radius of the circle and how fast the object is moving around it. The time for one complete revolution is the period $T$, and the number of revolutions per second is the frequency $f$, related by $f = 1/T$. The tangential speed $v$ (speed along the circular path) is related to the period by $v = 2\\pi r / T$.",
    "image": {
      "src": "images/unit5/circular_motion_intro.png",
      "alt": "Diagram showing an object moving in a circular path with radius r, velocity vectors tangent to the circle at different points",
      "caption": "In circular motion, the velocity vector is always tangent to the circle, changing direction continuously."
    }
  },
  "sections": [
    {
      "section_title": "Describing Circular Motion",
      "introduction": "When an object moves in a circle, we need special quantities to describe its motion. While we could use the ordinary speed along the path, it's often more convenient to use angular quantities that relate to the angle swept out by the object.",
      "key_concept": {
        "definition": "Circular motion is motion along a circular path. The object's distance from the center (radius $r$) remains constant, but its direction changes continuously. The motion can be described by its period, frequency, tangential speed, and angular displacement.",
        "context": "Understanding how to describe circular motion is essential for analyzing everything from a car turning a corner to planets orbiting the Sun."
      },
      "principles": [
        {
          "principle": "Period and Frequency",
          "statement": "The period $T$ is the time required for one complete revolution (cycle). The frequency $f$ is the number of revolutions per second. They are related by $f = \\frac{1}{T}$.",
          "application": "If an object completes 10 revolutions in 5 seconds, its frequency is $10/5 = 2$ Hz and its period is $1/2 = 0.5$ s.",
          "example": "A merry-go-round that completes one rotation every 4 seconds has $T = 4$ s and $f = 0.25$ Hz."
        },
        {
          "principle": "Tangential Speed",
          "statement": "Tangential speed $v$ is the speed of the object along the circular path. For uniform circular motion (constant speed), $v = \\frac{2\\pi r}{T} = 2\\pi r f$.",
          "application": "The circumference of the circle is $2\\pi r$, and the object covers that distance in one period, so speed = distance/time.",
          "example": "A 2 m radius merry-go-round with $T = 4$ s has tangential speed $v = 2\\pi(2)/4 = \\pi \\approx 3.14$ m/s."
        },
        {
          "principle": "Angular Displacement",
          "statement": "As the object moves along the circle, it sweeps out an angle $\\theta$ measured in radians. One complete revolution corresponds to $\\theta = 2\\pi$ radians.",
          "application": "Angular displacement is the angle through which the object has moved, measured from a reference direction.",
          "example": "If an object moves one-quarter of the way around a circle, its angular displacement is $\\pi/2$ radians (90°)."
        }
      ],
      "classifications": [
        {
          "type": "Linear vs. Angular Quantities",
          "value": "Two ways to describe circular motion",
          "characteristics": [
            "Linear: tangential speed $v$ (m/s), arc length $s$ (m)",
            "Angular: angular speed $\\omega$ (rad/s), angular displacement $\\theta$ (rad)",
            "Relationship: $s = r\\theta$, $v = r\\omega$"
          ],
          "behavior": "Angular quantities describe the rotational aspect of motion independent of radius. Linear quantities depend on both angular motion and radius.",
          "examples": [
            {
              "process": "Arc length",
              "explanation": "A point on a 0.5 m radius wheel rotating through 3 radians moves $s = 0.5 \\times 3 = 1.5$ m."
            },
            {
              "process": "Tangential speed",
              "explanation": "If the wheel rotates at 10 rad/s, a point on the rim has $v = 0.5 \\times 10 = 5$ m/s."
            }
          ]
        },
        {
          "type": "Uniform vs. Non-uniform Circular Motion",
          "value": "Types of circular motion",
          "characteristics": [
            "Uniform: constant speed, only direction changes",
            "Non-uniform: speed changes as well as direction"
          ],
          "behavior": "In uniform circular motion, the magnitude of velocity is constant, but there is still acceleration (centripetal) because direction changes. In non-uniform circular motion, there is also tangential acceleration.",
          "examples": [
            {
              "process": "Uniform",
              "explanation": "A car rounding a curve at constant speed (idealized)."
            },
            {
              "process": "Non-uniform",
              "explanation": "A car speeding up while going around a curve."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Finding Period and Tangential Speed",
          "problem": "A 0.8 m radius wheel rotates at 120 revolutions per minute. Find (a) the frequency in Hz, (b) the period, and (c) the tangential speed of a point on the rim.",
          "step_by_step": [
            {
              "step": "Convert rpm to Hz",
              "explanation": "$120 \\text{ rev/min} = 120/60 = 2 \\text{ rev/s} = 2$ Hz. So $f = 2$ Hz."
            },
            {
              "step": "Find period",
              "explanation": "$T = 1/f = 1/2 = 0.5$ s."
            },
            {
              "step": "Find tangential speed",
              "explanation": "$v = 2\\pi r f = 2\\pi(0.8)(2) = 3.2\\pi \\approx 10.05$ m/s."
            }
          ],
          "final_answer": "(a) $f = 2$ Hz, (b) $T = 0.5$ s, (c) $v \\approx 10.1$ m/s.",
          "concept_applied": "Frequency in Hz = rpm/60; period = 1/f; tangential speed = circumference × frequency."
        },
        {
          "title": "Relating Arc Length and Angle",
          "problem": "A point on the rim of a 0.3 m radius disk moves through an arc length of 0.75 m. What is its angular displacement in radians and degrees?",
          "step_by_step": [
            {
              "step": "Use $s = r\\theta$",
              "explanation": "$0.75 = 0.3 \\times \\theta$ → $\\theta = 0.75/0.3 = 2.5$ radians."
            },
            {
              "step": "Convert to degrees",
              "explanation": "$2.5 \\text{ rad} \\times (180°/\\pi) = 2.5 \\times 57.3° \\approx 143.2°$."
            }
          ],
          "final_answer": "$\\theta = 2.5$ rad ($143°$).",
          "concept_applied": "Arc length = radius × angle in radians."
        },
        {
          "title": "Finding Radius from Speed and Period",
          "problem": "An object in uniform circular motion has a tangential speed of 12 m/s and a period of 2.5 s. What is the radius of the circle?",
          "step_by_step": [
            {
              "step": "Recall $v = 2\\pi r / T$",
              "explanation": "$12 = 2\\pi r / 2.5$"
            },
            {
              "step": "Solve for $r$",
              "explanation": "$r = (12 \\times 2.5) / (2\\pi) = 30 / (2\\pi) = 15/\\pi \\approx 4.77$ m."
            }
          ],
          "final_answer": "$r \\approx 4.77$ m.",
          "concept_applied": "Rearrange $v = 2\\pi r/T$ to solve for $r$."
        }
      ],
      "image": {
        "src": "images/unit5/circular_quantities.png",
        "alt": "Diagram showing a circle with radius r, arc length s, and angle θ in radians",
        "caption": "Angular displacement θ (in radians) is related to arc length s by s = rθ."
      }
    },
    {
      "section_title": "Radians: The Natural Unit for Angles",
      "introduction": "In circular motion problems, angles must be measured in radians, not degrees. The radian is defined based on the geometry of the circle itself.",
      "key_concept": {
        "definition": "One radian is the angle subtended at the center of a circle by an arc equal in length to the radius. Since the full circumference is $2\\pi r$, there are $2\\pi$ radians in a full circle.",
        "context": "Using radians simplifies relationships like $s = r\\theta$ and $v = r\\omega$ because they have no extra conversion factors."
      },
      "principles": [
        {
          "principle": "Conversion Between Radians and Degrees",
          "statement": "$2\\pi \\text{ rad} = 360°$, so $1 \\text{ rad} = 180°/\\pi \\approx 57.3°$.",
          "application": "To convert degrees to radians, multiply by $\\pi/180$. To convert radians to degrees, multiply by $180/\\pi$.",
          "example": "$30° = 30 \\times \\pi/180 = \\pi/6$ rad."
        }
      ]
    }
  ],
  "key_terms": [
    "Circular Motion",
    "Period (T)",
    "Frequency (f)",
    "Hertz (Hz)",
    "Tangential Speed",
    "Arc Length",
    "Angular Displacement",
    "Radian",
    "Uniform Circular Motion",
    "Non-uniform Circular Motion",
    "Radius"
  ],
  "summary": "Circular motion is motion along a circular path. Even at constant speed, it involves acceleration due to changing direction. Key descriptive quantities include: period $T$ (time for one revolution), frequency $f$ (revolutions per second, related by $f = 1/T$), tangential speed $v = 2\\pi r/T = 2\\pi r f$, and angular displacement $\\theta$ measured in radians. Arc length $s$ is related to angular displacement by $s = r\\theta$. Radians are the natural unit for angles in circular motion because they simplify relationships. Uniform circular motion has constant speed; non-uniform circular motion involves changing speed. Understanding these basic descriptors is essential for analyzing centripetal acceleration and force in the following sections."
}
