{
  "expanded_description": "This section introduces vertical circular motion, where an object moves in a circular path in a vertical plane. Unlike horizontal circular motion, the speed is generally not constant because gravity does work on the object as it rises and falls. This leads to varying tension (or normal force) at different points in the circle, with critical conditions at the top and bottom where the force requirements are most extreme.",
  "core_concept": {
    "principle": "In vertical circular motion, the combined effects of gravity and the centripetal requirement cause the speed and the tension (or normal force) to vary around the circle. At the top, gravity helps provide centripetal force, reducing the required tension. At the bottom, gravity opposes the centripetal force, requiring larger tension. The minimum speed to complete the circle occurs at the top, where tension can approach zero.",
    "explanation": "Analyzing vertical circular motion involves applying Newton's second law at key points (top, bottom) while accounting for energy conservation to relate speeds at different heights. For an object on a string or in a loop, the critical condition for completing the circle is that the speed at the top must be sufficient to provide the needed centripetal acceleration with tension (or normal force) possibly zero. This leads to the concept of 'minimum speed at the top' and 'critical speed'.",
    "image": {
      "src": "images/unit5/vertical_circular_motion.png",
      "alt": "Diagram of an object moving in a vertical circle, showing forces (tension and weight) at the top, bottom, and sides",
      "caption": "In vertical circular motion, tension varies around the circle, with the greatest tension at the bottom and the least at the top."
    }
  },
  "sections": [
    {
      "section_title": "Forces in Vertical Circular Motion",
      "introduction": "When an object moves in a vertical circle, both centripetal requirements and gravity affect the forces. The net force toward the center is always $mv^2/r$, but this net force comes from a combination of tension (or normal force) and the component of weight along the radial direction.",
      "key_concept": {
        "definition": "For an object of mass $m$ moving in a vertical circle of radius $r$ with speed $v$, the radial component of Newton's second law gives $\\sum F_{\\text{radial}} = mv^2/r$, where the radial direction points toward the center. The forces contributing to this sum are tension $T$ (or normal force $N$) and the radial component of weight ($mg\\cos\\theta$ or $mg\\sin\\theta$, depending on position).",
        "context": "Because gravity does work, the speed $v$ varies with height. This coupling between force and speed makes vertical circular motion more complex than horizontal cases."
      },
      "principles": [
        {
          "principle": "Forces at the Bottom",
          "statement": "At the bottom of the circle, both tension (or normal force) and the centripetal requirement point upward. Weight points downward. The radial equation is $T_{\\text{bottom}} - mg = mv^2/r$, so $T_{\\text{bottom}} = mg + mv^2/r$.",
          "application": "Tension (or normal force) is greatest at the bottom because it must support the weight and provide the centripetal force.",
          "example": "A 2 kg object at the bottom of a 1.5 m radius vertical circle moving at 4 m/s has $T = 2(9.8) + 2(16)/1.5 = 19.6 + 21.33 = 40.9$ N."
        },
        {
          "principle": "Forces at the Top",
          "statement": "At the top of the circle, both tension and weight point downward toward the center. The radial equation is $T_{\\text{top}} + mg = mv^2/r$, so $T_{\\text{top}} = mv^2/r - mg$.",
          "application": "Tension is least at the top; it can even become zero if $v^2/r = g$. If the speed is lower than this critical value, the object will not maintain circular motion (it will fall).",
          "example": "For the same object at the top, if its speed is 3 m/s, $T = 2(9)/1.5 - 19.6 = 12 - 19.6 = -7.6$ N (impossible; the object would have fallen already)."
        },
        {
          "principle": "Minimum Speed to Complete the Circle",
          "statement": "The minimum speed at the top for the object to just maintain circular motion occurs when $T_{\\text{top}} = 0$. Then $mg = mv_{\\text{top,min}}^2/r$, giving $v_{\\text{top,min}} = \\sqrt{g r}$.",
          "application": "This is the critical speed at the top. If the speed is less than this, the object will not remain in contact with the track (or the string will go slack).",
          "example": "For a 2 m radius loop, the minimum speed at the top is $\\sqrt{9.8 \\times 2} = \\sqrt{19.6} \\approx 4.43$ m/s."
        }
      ],
      "classifications": [
        {
          "type": "Rigid Track vs. String",
          "value": "Different constraints at the top",
          "characteristics": [
            "String: tension can only pull (cannot push). At the top, tension must be ≥ 0, so $v_{\\text{top}} \\ge \\sqrt{gr}$.",
            "Rigid track (e.g., roller coaster): normal force can push in either direction. The car can go slower at the top as long as it maintains contact, but the condition $N \\ge 0$ still gives $v_{\\text{top}} \\ge \\sqrt{gr}$ for contact."
          ],
          "behavior": "For a string, if speed at top is less than $\\sqrt{gr}$, the string goes slack and the object falls. For a rigid track, the car could potentially lose contact if speed is too low, but if it's on a track that also has a safety restraint, the analysis differs. Typically, the same condition applies for minimum speed to maintain circular motion.",
          "examples": [
            {
              "process": "String",
              "explanation": "A bucket swung in a vertical circle must have $v_{\\text{top}} \\ge \\sqrt{gr}$ to keep water from falling out."
            },
            {
              "process": "Roller coaster loop",
              "explanation": "The cars must enter the loop with sufficient speed so that at the top $v \\ge \\sqrt{gr}$ to maintain contact with the track."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit5/vertical_forces.png",
        "alt": "Free body diagrams at top and bottom of vertical circle: at bottom, tension up and weight down; at top, both tension and weight down",
        "caption": "Forces at the top and bottom differ: at bottom, tension must overcome weight; at top, weight helps tension provide centripetal force."
      }
    },
    {
      "section_title": "Energy Conservation in Vertical Circular Motion",
      "introduction": "Because gravity is a conservative force, we can use energy conservation to relate the speed at different points in the circle. This is essential because the speed is not constant.",
      "key_concept": {
        "definition": "For an object moving in a vertical circle under gravity, mechanical energy is conserved (ignoring friction). The total mechanical energy $E = \\frac{1}{2}mv^2 + mgh$ is constant, where $h$ is the height above some reference level.",
        "context": "By setting the reference level at the bottom of the circle, the height at the top is $2r$. This allows us to relate the speed at the bottom to the speed at the top: $\\frac{1}{2}mv_{\\text{bottom}}^2 = \\frac{1}{2}mv_{\\text{top}}^2 + mg(2r)$."
      },
      "principles": [
        {
          "principle": "Relating Top and Bottom Speeds",
          "statement": "If the object starts at the bottom with speed $v_b$ and reaches the top with speed $v_t$, conservation of energy gives $v_b^2 = v_t^2 + 4gr$.",
          "application": "This relationship is crucial for determining the minimum speed at the bottom needed to just reach the top with $v_t = \\sqrt{gr}$.",
          "example": "To just make it around a loop of radius 3 m, $v_t = \\sqrt{9.8 \\times 3} \\approx 5.42$ m/s. Then $v_b^2 = (5.42)^2 + 4(9.8)(3) = 29.4 + 117.6 = 147$, so $v_b \\approx 12.1$ m/s."
        },
        {
          "principle": "Minimum Speed at the Bottom",
          "statement": "Using $v_t = \\sqrt{gr}$ for the minimum speed at the top, the minimum speed at the bottom is $v_{b,\\min} = \\sqrt{5gr}$.",
          "application": "This is the speed needed at the bottom to just complete the circle (for a string or track with no extra push).",
          "example": "For a 2 m radius loop, $v_{b,\\min} = \\sqrt{5 \\times 9.8 \\times 2} = \\sqrt{98} \\approx 9.9$ m/s."
        }
      ],
      "worked_examples": [
        {
          "title": "Minimum Speed at the Bottom",
          "problem": "A roller coaster loop has a radius of 5 m. What minimum speed must the cars have at the bottom of the loop to just make it over the top without falling? (Assume no friction and that the cars are on a track so they don't need tension, just contact at the top.)",
          "step_by_step": [
            {
              "step": "Find minimum speed at top",
              "explanation": "$v_{\\text{top}} = \\sqrt{gr} = \\sqrt{9.8 \\times 5} = \\sqrt{49} = 7$ m/s"
            },
            {
              "step": "Apply energy conservation",
              "explanation": "$\\frac{1}{2}mv_b^2 = \\frac{1}{2}mv_t^2 + mg(2r)$ → $v_b^2 = v_t^2 + 4gr$"
            },
            {
              "step": "Substitute",
              "explanation": "$v_b^2 = 7^2 + 4(9.8)(5) = 49 + 196 = 245$ → $v_b = \\sqrt{245} = 15.65$ m/s"
            }
          ],
          "final_answer": "$v_b = 15.7$ m/s",
          "concept_applied": "Minimum speed at bottom is $\\sqrt{5gr}$."
        },
        {
          "title": "Tension at the Bottom Given Top Speed",
          "problem": "A 0.5 kg object is swung in a vertical circle of radius 0.8 m. At the top of its path, its speed is 3 m/s. Find (a) the tension at the top, and (b) the tension at the bottom, assuming no energy loss.",
          "step_by_step": [
            {
              "step": "Tension at top",
              "explanation": "$T_{\\text{top}} = m v_t^2 / r - mg = 0.5 \\times 9 / 0.8 - 0.5 \\times 9.8 = 5.625 - 4.9 = 0.725$ N"
            },
            {
              "step": "Find speed at bottom using energy conservation",
              "explanation": "$v_b^2 = v_t^2 + 4gr = 9 + 4(9.8)(0.8) = 9 + 31.36 = 40.36$ → $v_b = 6.35$ m/s"
            },
            {
              "step": "Tension at bottom",
              "explanation": "$T_{\\text{bottom}} = m v_b^2 / r + mg = 0.5 \\times 40.36 / 0.8 + 4.9 = 25.225 + 4.9 = 30.125$ N"
            }
          ],
          "final_answer": "$T_{\\text{top}} = 0.73$ N, $T_{\\text{bottom}} = 30.1$ N",
          "concept_applied": "Tension is much larger at bottom because it must provide centripetal force AND support weight."
        },
        {
          "title": "Critical Condition for String",
          "problem": "A 1.2 kg mass is tied to a string of length 1.5 m and whirled in a vertical circle. What is the minimum speed at the top required to keep the string taut? What is the corresponding speed at the bottom?",
          "step_by_step": [
            {
              "step": "Minimum speed at top",
              "explanation": "$v_{\\text{top,min}} = \\sqrt{gr} = \\sqrt{9.8 \\times 1.5} = \\sqrt{14.7} = 3.83$ m/s"
            },
            {
              "step": "Find speed at bottom",
              "explanation": "$v_b^2 = v_t^2 + 4gr = 14.7 + 4(9.8)(1.5) = 14.7 + 58.8 = 73.5$ → $v_b = 8.57$ m/s"
            }
          ],
          "final_answer": "$v_{\\text{top,min}} = 3.83$ m/s, $v_b = 8.57$ m/s",
          "concept_applied": "For a string, the condition at top is $v_t \\ge \\sqrt{gr}$ to avoid slack."
        },
        {
          "title": "Finding Speed at a Given Point",
          "problem": "A 2 kg object moves in a vertical circle of radius 2 m. At a point 60° above the horizontal (measured from the bottom), its speed is 5 m/s. Find the tension in the string at that point.",
          "step_by_step": [
            {
              "step": "Draw diagram and identify angle",
              "explanation": "At 60° above horizontal, the radial direction is toward the center. The angle from the vertical is 30°? Let's be careful: If the point is 60° above the horizontal from the bottom, that means from the bottom (0°), it has rotated 60° along the circle. At that point, the radius makes a 60° angle with the vertical? Actually, if bottom is 0°, then at angle θ measured from bottom, the radial line is at angle θ from vertical. So here θ = 60°, so the radial line is 60° from vertical."
            },
            {
              "step": "Determine radial component of weight",
              "explanation": "Weight points down. Its component along the radial direction (toward center) is $mg\\cos\\theta$? Actually, at angle θ from bottom, the radial direction is at angle θ from the vertical. The angle between the radial direction (toward center) and the vertical is θ. So the component of weight in the radial direction is $mg\\cos\\theta$ pointing toward the center? At θ=60°, cos60=0.5, so radial component of weight = 0.5mg toward center? That would mean weight helps tension at the top? Wait, need to be systematic."
            },
            {
              "step": "Alternative: Use energy to find speed if needed, but here speed is given.",
              "explanation": "At this point, the forces are tension T along the string toward center, and weight down. The radial direction is along the string. The component of weight along the radial direction is $mg\\cos\\phi$ where φ is the angle between the radial direction and the vertical. At 60° from bottom, the radial direction makes a 60° angle with the vertical, so $mg\\cos60° = 0.5mg$ acts outward? Actually, at that point, the weight component along the radial is $mg\\cos\\theta$ but careful with sign: if θ is measured from vertical, then at θ=60°, the radial component of weight is $mg\\cos60°$ pointing away from center? Let's think: At the top (θ=180°), weight points toward center, so radial component should be +mg (positive inward). At θ=180°, cos180° = -1, so $mg\\cos\\theta$ = -mg, which would be negative inward if we define inward positive. So the correct expression is: radial component of weight = $-mg\\cos\\theta$ where θ is measured from vertical (0° at top). That's getting messy. Let's use the standard formula: At an angle θ measured from the downward vertical (so θ=0 at bottom, θ=180° at top), the radial component of weight is $mg\\cos\\theta$ pointing toward the center? At bottom, θ=0, cos0=1, weight points opposite center (down, away), so that would be -mg inward. So the correct equation is $T - mg\\cos\\theta = mv^2/r$? At bottom, θ=0, $T - mg = mv^2/r$, so $T = mg + mv^2/r$, correct. At top, θ=180°, cos180° = -1, so $T - (-mg) = T + mg = mv^2/r$, so $T = mv^2/r - mg$, correct. So the general equation for a point at angle θ measured from the downward vertical is: $T - mg\\cos\\theta = mv^2/r$. For θ=60°, cos60°=0.5, so $T - 0.5mg = mv^2/r$."
            },
            {
              "step": "Apply the equation",
              "explanation": "$T - 0.5(2)(9.8) = 2(5)^2/2$ → $T - 9.8 = 50/2 = 25$ → $T = 34.8$ N"
            }
          ],
          "final_answer": "$T = 34.8$ N",
          "concept_applied": "The general radial equation for vertical circular motion is $T - mg\\cos\\theta = mv^2/r$, with θ measured from the downward vertical."
        }
      ],
      "image": {
        "src": "images/unit5/vertical_worked.png",
        "alt": "Diagrams for worked examples: loop with minimum speed, tension at top and bottom, point at angle",
        "caption": "Worked examples illustrate the application of force and energy principles in vertical circular motion."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when analyzing vertical circular motion.",
      "classifications": [
        {
          "type": "Forgetting That Speed Varies",
          "value": "Treating vertical circular motion as if speed is constant",
          "characteristics": [
            "Using same speed at top and bottom",
            "Ignoring energy conservation"
          ],
          "behavior": "In vertical circles under gravity, speed changes because gravity does work. Always relate speeds using energy conservation unless told otherwise.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses same v in equations at top and bottom without considering height change."
            },
            {
              "process": "Correct",
              "explanation": "Use $v_b^2 = v_t^2 + 4gr$ to relate speeds."
            }
          ]
        },
        {
          "type": "Wrong Force Direction at Top",
          "value": "Thinking tension or normal force always points up at the top",
          "characteristics": [
            "Drawing tension upward at top",
            "Forgetting that both tension and weight point down at top"
          ],
          "behavior": "At the top of a vertical circle, both the weight and the tension (or normal force) point downward toward the center. The radial equation is $T + mg = mv^2/r$.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Writing $T - mg = mv^2/r$ at the top."
            },
            {
              "process": "Correct",
              "explanation": "$T + mg = mv^2/r$ at the top."
            }
          ]
        },
        {
          "type": "Incorrect Minimum Speed Condition",
          "value": "Using $v_{\\text{min}} = \\sqrt{gr}$ at the bottom or misapplying it",
          "characteristics": [
            "Thinking the minimum speed at bottom is $\\sqrt{gr}$",
            "Not recognizing that $\\sqrt{gr}$ is the minimum at the top"
          ],
          "behavior": "The condition $v \\ge \\sqrt{gr}$ applies at the top for maintaining circular motion. The minimum speed at the bottom is larger: $v_{b,\\min} = \\sqrt{5gr}$ for a complete loop.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a loop with radius 5 m requires $v_b \\ge \\sqrt{49} = 7$ m/s."
            },
            {
              "process": "Correct",
              "explanation": "$v_b \\ge \\sqrt{5gr} = \\sqrt{245} = 15.7$ m/s."
            }
          ]
        },
        {
          "type": "Sign Errors in Radial Equation",
          "value": "Misidentifying which forces contribute positively to centripetal force",
          "characteristics": [
            "Inconsistent sign conventions",
            "Not defining inward as positive"
          ],
          "behavior": "Always define the inward radial direction as positive. Then forces pointing inward are positive; forces pointing outward are negative. The sum of inward force components equals $mv^2/r$.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "At the bottom, writing $-T + mg = -mv^2/r$ with up positive (inward) would give $T - mg = mv^2/r$ after rearranging, but confusion arises."
            },
            {
              "process": "Correct",
              "explanation": "Set inward positive. At bottom, $T - mg = mv^2/r$. At top, $T + mg = mv^2/r$ (both T and mg point inward)."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit5/vertical_mistakes.png",
        "alt": "Common mistakes: assuming constant speed, wrong force direction at top, misapplying minimum speed condition",
        "caption": "Avoid these common errors when analyzing vertical circular motion."
      }
    }
  ],
  "key_terms": [
    "Vertical Circular Motion",
    "Centripetal Force",
    "Tension",
    "Normal Force",
    "Weight",
    "Minimum Speed",
    "Critical Speed",
    "Top of Circle",
    "Bottom of Circle",
    "Energy Conservation",
    "$v_{\\text{top,min}} = \\sqrt{gr}$",
    "$v_{\\text{bottom,min}} = \\sqrt{5gr}$",
    "Loop-the-Loop",
    "Slack String"
  ],
  "summary": "Vertical circular motion involves an object moving in a circular path in a vertical plane. Unlike horizontal circular motion, the speed varies due to the work done by gravity. The forces (tension or normal force) also vary around the circle, with the greatest force at the bottom ($T_{\\text{bottom}} = mg + mv^2/r$) and the least at the top ($T_{\\text{top}} = mv^2/r - mg$). The critical condition for completing the circle is that the speed at the top must be at least $\\sqrt{gr}$ to maintain tension (or contact). Using energy conservation, the speeds at top and bottom are related by $v_b^2 = v_t^2 + 4gr$, leading to a minimum speed at the bottom of $\\sqrt{5gr}$ for a full loop. Common mistakes include assuming constant speed, drawing forces incorrectly at the top, misapplying the minimum speed condition, and sign errors in radial equations. Understanding vertical circular motion is essential for analyzing roller coasters, pendulum-like systems, and any object moving in a vertical loop."
}
