{
  "expanded_description": "Can policymakers permanently trade higher inflation for lower unemployment? For decades, economists believed they could. But the stagflation of the 1970s proved otherwise. In the long run, there is no trade-off between inflation and unemployment. The economy always returns to the natural rate of unemployment—the rate consistent with potential GDP—regardless of the inflation rate. This insight, developed by Milton Friedman and Edmund Phelps, fundamentally changed macroeconomic thinking. The long-run Phillips Curve is vertical at the natural rate of unemployment. Understanding why the long-run Phillips Curve is vertical, what determines the natural rate, and how expectations adjust is essential for analyzing the limits of monetary policy and the causes of inflation.",
  
  "core_concept": {
    "principle": "The long-run Phillips Curve (LRPC) shows the relationship between inflation and unemployment after all wages and prices have fully adjusted and expectations are realized. It is vertical at the natural rate of unemployment, indicating that in the long run, there is no trade-off between inflation and unemployment. The natural rate of unemployment (also called the NAIRU—Non-Accelerating Inflation Rate of Unemployment) is the unemployment rate that prevails when the economy is producing at potential GDP. It consists of frictional unemployment (workers between jobs) and structural unemployment (mismatch between workers' skills and job requirements). It does not include cyclical unemployment. The LRPC is vertical because, in the long run, any attempt to keep unemployment below the natural rate through expansionary policy will only lead to higher inflation, not permanently lower unemployment. The reasoning is based on expectations. In the short run, if the Fed increases aggregate demand, unemployment falls below the natural rate and inflation rises. But workers and firms eventually adjust their expectations. Workers, seeing higher inflation, demand higher wages to maintain their real purchasing power. Firms, facing higher wage costs, raise prices further. This shifts the short-run Phillips Curve upward. The process continues until the economy returns to the natural rate of unemployment, but at a higher inflation rate. If policymakers persist in trying to keep unemployment below the natural rate, inflation will continue to accelerate. Conversely, if unemployment is above the natural rate, inflation will decelerate. Only at the natural rate is inflation stable. This is why the natural rate is also called the NAIRU—the rate at which inflation does not accelerate or decelerate. The long-run Phillips Curve is vertical at this rate. The position of the LRPC can shift over time if the natural rate itself changes due to changes in labor market structure, demographics, technology, or policies (e.g., unemployment benefits, training programs). However, it does not shift with changes in inflation or expected inflation. The vertical LRPC implies that monetary policy cannot permanently affect real variables like unemployment. In the long run, money is neutral—changes in the money supply affect only nominal variables (prices, inflation), not real variables (output, employment). This is a key implication of the classical dichotomy in the long run. The long-run Phillips Curve is a fundamental concept for understanding the limits of stabilization policy and the importance of central bank credibility.",
    
    "explanation": "Imagine trying to push a string. You can push it forward for a little while, but eventually it will go slack and return to its original position. The short-run Phillips Curve is like the string moving forward—you can temporarily push unemployment below the natural rate with higher inflation. But in the long run, expectations adjust, the string goes slack, and unemployment returns to the natural rate. The only lasting effect is higher inflation. The long-run Phillips Curve is vertical because you can't permanently push the string—unemployment always returns to its natural level. This is why central banks don't try to keep unemployment artificially low. They know that in the long run, they can't beat the natural rate—they can only choose the inflation rate at which the economy settles there.",
    
    "image": {
      "src": "images/unit8/lrpc_overview.png",
      "alt": "Graph showing vertical long-run Phillips Curve at natural rate of unemployment, with short-run Phillips Curves crossing it",
      "caption": "Figure 8.2.1: The long-run Phillips Curve is vertical at the natural rate of unemployment, showing no permanent trade-off between inflation and unemployment."
    }
  },

  "sections": [
    {
      "section_title": "8.2 Long Run Phillips Curve",
      "introduction": "The short-run Phillips Curve suggests policymakers can choose among different combinations of inflation and unemployment. But can they permanently achieve lower unemployment by accepting higher inflation? The answer, as economists learned in the 1970s, is no. In the long run, the Phillips Curve is vertical—there is no trade-off. Unemployment returns to its natural rate regardless of inflation. In this section, we'll explore the long-run Phillips Curve: why it's vertical, what determines the natural rate of unemployment, how expectations drive the adjustment from short run to long run, and the implications for monetary policy.",
      
      "introduction_image": {
        "src": "images/unit8/lrpc_intro.png",
        "alt": "Graph showing vertical LRPC with SRPCs crossing it at different inflation rates",
        "caption": "Figure 8.2.2: The long-run Phillips Curve is vertical. Different short-run curves cross it at different expected inflation rates."
      },
      
      "key_concept": {
        "definition": "The long-run Phillips Curve (LRPC) is a vertical line at the natural rate of unemployment, showing that in the long run there is no relationship between inflation and unemployment. The natural rate of unemployment ($u_n$) is the unemployment rate that prevails when the economy is producing at potential GDP. It consists of frictional unemployment (workers temporarily between jobs) and structural unemployment (mismatch between workers' skills and available jobs). It does not include cyclical unemployment, which is the deviation of actual unemployment from the natural rate. The LRPC is vertical because, in the long run, after all wages and prices have fully adjusted and expectations are realized, the economy returns to the natural rate regardless of the inflation rate. The reasoning derives from the expectations-augmented Phillips Curve: $\\pi = \\pi^e - \\beta(u - u_n) + v$. In the long run, expectations adjust so that actual inflation equals expected inflation ($\\pi = \\pi^e$). Assuming no supply shocks ($v = 0$), the equation becomes $0 = -\\beta(u - u_n)$, which implies $u = u_n$. The economy settles at the natural rate. The only lasting effect of sustained expansionary policy is higher inflation, not lower unemployment. If policymakers attempt to keep unemployment below the natural rate, inflation will continue to rise, and expectations will keep adjusting upward—a process of accelerating inflation. This is why the natural rate is also called the NAIRU (Non-Accelerating Inflation Rate of Unemployment). It is the rate at which inflation is stable—neither accelerating nor decelerating. The LRPC can shift over time if the natural rate itself changes. Factors that shift the natural rate include: demographic changes (aging population, changing labor force participation), technological changes (automation affecting skill requirements), institutional changes (unemployment insurance generosity, union power, labor market regulations), and structural policies (job training programs, education). However, the LRPC does not shift with changes in inflation or expected inflation. The vertical LRPC implies that monetary policy is neutral in the long run—changes in the money supply affect only nominal variables (prices, inflation), not real variables (output, unemployment). This is a key implication of the classical dichotomy applied to the long run.",
        
        "context": "The concept of a vertical long-run Phillips Curve was developed independently by Milton Friedman and Edmund Phelps in the late 1960s, challenging the then-prevailing view that the Phillips Curve represented a permanent trade-off. Their analysis predicted that attempts to exploit the trade-off would lead to accelerating inflation without permanently lower unemployment—a prediction dramatically confirmed by the stagflation of the 1970s. This earned Phelps the Nobel Prize (Friedman had already won). The natural rate hypothesis is now a cornerstone of macroeconomics. Central banks use estimates of the natural rate (NAIRU) to guide policy—if unemployment is below the estimated natural rate, they worry about rising inflation; if above, they see slack. In AP Macroeconomics, the long-run Phillips Curve is essential for understanding the limits of monetary policy and the causes of inflation.",
        
        "image": {
          "src": "images/unit8/lrpc_explanation.png",
          "alt": "Graph showing LRPC vertical at u_n, with arrows showing adjustment from short-run to long-run",
          "caption": "Figure 8.2.3: In the long run, the economy returns to the natural rate. Attempts to keep u below u_n lead to higher inflation, not permanently lower u."
        }
      },

      "classifications": [
        {
          "type": "Natural Rate of Unemployment",
          "value": "The unemployment rate at potential GDP",
          "characteristics": ["Not zero", "Includes frictional + structural", "Excludes cyclical", "Changes over time", "Estimated by policymakers"],
          "behavior": "The natural rate of unemployment is the rate that prevails when the economy is operating at potential GDP. It is not zero because in any dynamic economy, there will always be some frictional unemployment (workers moving between jobs) and structural unemployment (mismatch between workers' skills and job requirements). The natural rate can change over time due to demographic shifts, technological change, institutional factors, and public policies. For example, an aging population may lower the natural rate as older workers have lower unemployment rates; generous unemployment benefits may raise it by reducing incentives to take new jobs quickly; improved job training programs may lower it by reducing structural mismatches. Policymakers estimate the natural rate to gauge the stance of the economy—whether unemployment is below or above its sustainable level. In the U.S., estimates of the natural rate have varied from around 6% in the 1980s to around 4-5% in recent decades. The natural rate is also called the NAIRU—the Non-Accelerating Inflation Rate of Unemployment—because when unemployment equals the natural rate, inflation is stable (neither accelerating nor decelerating).",
          
          "image": {
            "src": "images/unit8/natural_rate.png",
            "alt": "Graph showing components of natural rate: frictional and structural unemployment",
            "caption": "Figure 8.2.4: The natural rate of unemployment consists of frictional and structural unemployment. It changes over time due to various factors."
          },
          
          "examples": [
            {
              "process": "1980s natural rate",
              "explanation": "Estimates of the U.S. natural rate in the 1980s were around 6-7%, reflecting demographic factors (baby boomers entering workforce) and structural changes."
            },
            {
              "process": "1990s-2000s natural rate",
              "explanation": "The natural rate fell to around 5% or lower by the late 1990s and 2000s, due to aging workforce, improved job matching technology, and other factors."
            }
          ]
        },
        {
          "type": "Long-Run Adjustment Process",
          "value": "How the economy moves from short-run to long-run equilibrium",
          "characteristics": ["Expectations adjust", "SRPC shifts", "Returns to natural rate", "Inflation changes", "No permanent real effects"],
          "behavior": "The transition from short-run to long-run equilibrium is driven by expectations adjustment. Suppose the economy starts at long-run equilibrium with unemployment at the natural rate and inflation at expected inflation. The Fed then implements expansionary policy, increasing aggregate demand. In the short run, the economy moves along the SRPC: unemployment falls below the natural rate, inflation rises above expected inflation. But this situation is unsustainable. Workers, seeing higher inflation, revise their expectations upward and demand higher wages. Firms, facing higher wage costs, raise prices further. This shifts the SRPC upward. The economy moves up along the new SRPC, with unemployment rising back toward the natural rate. The process continues until expectations fully adjust to the new inflation rate. At that point, unemployment returns to the natural rate, and inflation stabilizes at a higher level. The economy is now on a new SRPC (with higher expected inflation) at the point where it crosses the LRPC. The same logic applies in reverse for contractionary policy: unemployment rises above natural rate, inflation falls below expectations, expectations adjust downward, SRPC shifts down, and economy returns to natural rate at lower inflation. The speed of adjustment depends on how quickly expectations adapt—which depends on the credibility of policy, the persistence of shocks, and institutional factors.",
          
          "image": {
            "src": "images/unit8/lr_adjustment.png",
            "alt": "Graph showing SRPC shifting up over time as expectations adjust, with economy moving back to natural rate",
            "caption": "Figure 8.2.5: The long-run adjustment process: expectations shift the SRPC until the economy returns to the natural rate."
          },
          
          "examples": [
            {
              "process": "1960s expansion",
              "explanation": "In the 1960s, expansionary policy pushed unemployment below estimates of the natural rate. Inflation rose from 1% to 5%. Eventually, expectations adjusted, and by the 1970s, unemployment returned to the natural rate, but inflation remained high."
            },
            {
              "process": "Volcker disinflation",
              "explanation": "In the early 1980s, contractionary policy pushed unemployment above the natural rate. Inflation fell from over 10% to around 3%. Expectations eventually adjusted downward, and unemployment returned to the natural rate by the mid-1980s."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "In the Long Run, the Phillips Curve Is Vertical",
          "statement": "The long-run Phillips Curve is vertical at the natural rate of unemployment, demonstrating that there is no permanent trade-off between inflation and unemployment. This verticality arises because, in the long run, expectations fully adjust to actual inflation. Any attempt to keep unemployment below the natural rate through expansionary policy will only lead to higher and higher inflation as expectations continually adjust upward. Conversely, allowing unemployment to rise above the natural rate will lead to falling inflation as expectations adjust downward. The only unemployment rate consistent with stable inflation is the natural rate. This is why the natural rate is also called the NAIRU (Non-Accelerating Inflation Rate of Unemployment). The vertical LRPC implies that monetary policy cannot permanently affect real variables like unemployment. In the long run, money is neutral.",
          "application": "When evaluating long-run policy effects, remember that the LRPC is vertical. Expansionary policy may temporarily reduce unemployment, but in the long run, it only raises inflation. This is why central banks focus on price stability in the long run while using policy to smooth short-run fluctuations.",
          "example": "In the 1960s, policymakers believed they could permanently lower unemployment by accepting higher inflation. They were wrong. By the 1970s, unemployment was back to its natural rate, but inflation was much higher. The long-run trade-off did not exist.",
          
          "image": {
            "src": "images/unit8/lrpc_vertical.png",
            "alt": "Vertical LRPC with arrow showing that higher inflation does not change unemployment in long run",
            "caption": "Figure 8.2.6: The long-run Phillips Curve is vertical—changes in inflation do not affect unemployment in the long run."
          }
        },
        {
          "principle": "The Natural Rate Can Change Over Time",
          "statement": "While the long-run Phillips Curve is vertical, its position—the natural rate of unemployment—is not fixed. It can shift due to changes in the structure of the labor market, demographics, technology, and public policies. Factors that can lower the natural rate include: improved job matching technology (e.g., online job boards), increased labor force flexibility, demographic shifts toward age groups with lower unemployment rates, reduced union power, and policies that encourage work (e.g., earned income tax credit). Factors that can raise the natural rate include: generous unemployment benefits that reduce job search intensity, minimum wage laws that price low-skilled workers out of jobs, structural changes that create skill mismatches (e.g., automation displacing workers without retraining), and demographic shifts toward groups with higher unemployment rates. Changes in the natural rate have important policy implications. If the natural rate falls, the economy can sustain lower unemployment without inflationary pressure. If it rises, the same unemployment rate may now be below the natural rate, signaling overheating even with higher measured unemployment.",
          "application": "When analyzing the economy, remember that estimates of the natural rate are uncertain and can change. The Fed monitors a range of indicators—not just unemployment—to gauge whether the economy is at potential. A falling natural rate explains why the economy could sustain very low unemployment in the late 1990s without rising inflation.",
          "example": "In the late 1990s, unemployment fell to 4% without rising inflation, leading many to conclude that the natural rate had fallen. Possible reasons: aging workforce, improved job matching via internet, welfare reform, and increased labor force attachment.",
          
          "image": {
            "src": "images/unit8/natural_rate_shifts.png",
            "alt": "LRPC shifting left (lower natural rate) and right (higher natural rate) over time",
            "caption": "Figure 8.2.7: The natural rate of unemployment can change over time, shifting the vertical LRPC."
          }
        },
        {
          "principle": "Expectations Drive the Transition from Short Run to Long Run",
          "statement": "The key to understanding why the Phillips Curve is vertical in the long run but downward-sloping in the short run lies in expectations. In the short run, expectations are fixed. When aggregate demand changes, the economy moves along a given SRPC. But in the long run, expectations adjust to actual inflation. This adjustment shifts the SRPC until the economy returns to the natural rate. The process is driven by workers and firms revising their inflation expectations based on actual experience. If inflation is persistently above expectations, workers demand higher wages, and firms raise prices more—shifting the SRPC up. If inflation is persistently below expectations, the SRPC shifts down. The speed of adjustment depends on how quickly expectations adapt. Under adaptive expectations, people base their expectations on past inflation, so adjustment is gradual. Under rational expectations, people use all available information, including policy announcements, so adjustment can be faster. Central bank credibility matters: if the Fed is credible, expectations may adjust quickly to policy changes, reducing the short-run trade-off.",
          "application": "When analyzing policy, consider how expectations will respond. A credible disinflation may be less costly if expectations adjust quickly. A policy that surprises people may have larger short-run effects but also risk unanchoring expectations.",
          "example": "Paul Volcker's disinflation in the early 1980s was costly—unemployment rose sharply—partly because expectations were slow to adjust after years of high inflation. By contrast, the Fed's credibility in the 1990s meant that expectations remained anchored even as unemployment fell.",
          
          "image": {
            "src": "images/unit8/expectations_adjustment.png",
            "alt": "Graph showing SRPC shifting over time as expectations adjust, with path of economy",
            "caption": "Figure 8.2.8: Expectations drive the transition from short run to long run. As expectations adjust, the SRPC shifts."
          }
        },
        {
          "principle": "Monetary Policy Is Neutral in the Long Run",
          "statement": "The vertical long-run Phillips Curve is a manifestation of the classical dichotomy and the neutrality of money in the long run. In the long run, changes in the money supply affect only nominal variables—the price level and inflation—not real variables like output and unemployment. Real GDP is determined by real factors: technology, capital stock, labor force, and productivity. Monetary policy cannot permanently increase output or reduce unemployment. This is why central banks focus on price stability as their primary long-run goal. They recognize that while they can smooth short-run fluctuations, they cannot permanently improve real economic outcomes through monetary expansion. Attempts to do so lead only to higher inflation. The long-run neutrality of money is a fundamental principle of macroeconomics, supported by decades of evidence.",
          "application": "When evaluating the long-run effects of monetary policy, remember that money is neutral. A one-time increase in the money supply will eventually lead to proportionally higher prices, with no lasting effect on output or unemployment. Sustained money growth leads to sustained inflation, not permanently lower unemployment.",
          "example": "Countries that have experienced hyperinflation—like Zimbabwe or Venezuela—demonstrate the long-run neutrality of money. Massive increases in the money supply led to astronomical inflation, but unemployment remained high. The real economy was not permanently improved by money creation.",
          
          "image": {
            "src": "images/unit8/monetary_neutrality.png",
            "alt": "Graph showing long-run vertical Phillips Curve with arrow indicating that money growth affects only inflation",
            "caption": "Figure 8.2.9: Monetary policy is neutral in the long run—changes in money growth affect only inflation, not unemployment."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Tracking the Transition from Short Run to Long Run",
          
          "image": {
            "src": "images/unit8/lr_transition_example.png",
            "alt": "Graph with SRPC and LRPC showing transition path",
            "caption": "Figure 8.2.10: Trace the transition from short-run to long-run equilibrium after an expansionary policy."
          },
          
          "problem": "The economy is initially in long-run equilibrium with unemployment at the natural rate of 5% and inflation at 2%. The Fed implements expansionary policy, reducing unemployment to 4% in the short run. a) Using the Phillips Curve graph, show the initial long-run equilibrium (point A). b) Show the short-run effect of expansionary policy (point B). Label inflation at point B as 4%. c) Explain what happens to expectations. d) Show the new short-run Phillips Curve after expectations adjust (SRPC2) and the new long-run equilibrium (point C). e) What are unemployment and inflation at point C?",
          
          "step_by_step": [
            {
              "step": "Draw initial equilibrium",
              "explanation": "Draw LRPC vertical at 5% u. Draw SRPC1 crossing LRPC at point A (5% u, 2% $\\pi$). This is long-run equilibrium with $\\pi = \\pi^e$."
            },
            {
              "step": "Show short-run effect",
              "explanation": "Expansionary policy moves economy along SRPC1 to point B: u = 4%, $\\pi$ = 4%. At B, $\\pi > \\pi^e$."
            },
            {
              "step": "Explain expectations adjustment",
              "explanation": "With inflation above expectations, workers and firms revise their expectations upward. They now expect higher future inflation. This shifts the SRPC upward."
            },
            {
              "step": "Show new SRPC and long-run equilibrium",
              "explanation": "Draw SRPC2 shifted up, crossing LRPC at a higher inflation rate. The economy moves along SRPC2 as expectations adjust, with u rising back toward natural rate. Eventually, it reaches point C at intersection of SRPC2 and LRPC: u = 5% (natural rate), $\\pi$ = higher, say 5% (depending on magnitude). At C, $\\pi = \\pi^e$ again."
            },
            {
              "step": "Identify point C values",
              "explanation": "At point C, unemployment returns to 5% (natural rate). Inflation is higher than initially—say 5%. The exact inflation depends on how much expectations adjusted."
            }
          ],
          
          "final_answer": "a) Point A: 5% u, 2% $\\pi$. b) Point B: 4% u, 4% $\\pi$. c) Expectations rise. d) SRPC shifts up. e) Point C: 5% u, higher $\\pi$ (e.g., 5%).",
          "concept_applied": "Expansionary policy temporarily lowers unemployment, but expectations adjust, shifting SRPC up and returning u to natural rate at higher inflation."
        },
        {
          "title": "Calculating the Natural Rate from Phillips Curve",
          
          "image": {
            "src": "images/unit8/natural_rate_calc.png",
            "alt": "Phillips Curve equation with given values",
            "caption": "Figure 8.2.11: Use the Phillips Curve equation to find the natural rate."
          },
          
          "problem": "The Phillips Curve is given by: $\\pi = \\pi^e - 0.4(u - u_n) + v$. In a given year, actual inflation is 3%, expected inflation is 2%, unemployment is 4%, and there are no supply shocks ($v = 0$). a) What is the natural rate of unemployment? b) Is the economy above or below potential GDP? c) What will happen to inflation in the future if unemployment remains at 4%? d) If the natural rate later rises to 5.5%, what inflation would you expect at unemployment of 4% with expected inflation still 2%? e) Graph the initial situation and the situation after the natural rate increases.",
          
          "step_by_step": [
            {
              "step": "Solve for u_n",
              "explanation": "Plug values into equation: $3 = 2 - 0.4(4 - u_n) + 0$. Simplify: $3 - 2 = -0.4(4 - u_n)$ → $1 = -0.4(4 - u_n)$ → $1 = -1.6 + 0.4u_n$ → $1 + 1.6 = 0.4u_n$ → $2.6 = 0.4u_n$ → $u_n = 2.6 / 0.4 = 6.5\\%$."
            },
            {
              "step": "Interpret",
              "explanation": "Actual unemployment (4%) is below the natural rate (6.5%). The economy is operating above potential GDP—an inflationary gap."
            },
            {
              "step": "Future inflation",
              "explanation": "With unemployment below natural rate, inflation will tend to rise. Expectations will adjust upward, shifting the SRPC up and leading to higher actual inflation."
            },
            {
              "step": "New natural rate scenario",
              "explanation": "With $u_n = 5.5$, $u = 4$, $\\pi^e = 2$, $v=0$: $\\pi = 2 - 0.4(4 - 5.5) = 2 - 0.4(-1.5) = 2 + 0.6 = 2.6\\%$. Inflation is lower than before because the natural rate is lower, so the unemployment gap is smaller."
            },
            {
              "step": "Graph",
              "explanation": "Draw LRPC1 at 6.5% and LRPC2 at 5.5%. Draw SRPC for given $\\pi^e$. Points show different inflation at same unemployment."
            }
          ],
          
          "final_answer": "a) 6.5%. b) Above potential (inflationary gap). c) Inflation will rise. d) 2.6%. e) Graphs as described.",
          "concept_applied": "The natural rate can be inferred from the Phillips Curve. Changes in the natural rate affect inflation at any given unemployment level."
        },
        {
          "title": "Policy Implications of Vertical LRPC",
          
          "image": {
            "src": "images/unit8/policy_implications.png",
            "alt": "Graph showing LRPC and policy options",
            "caption": "Figure 8.2.12: Analyze policy options given the vertical LRPC."
          },
          
          "problem": "A country has a natural rate of unemployment of 6%. Current unemployment is 6% and inflation is 3%. a) If the central bank wants to permanently reduce unemployment to 4%, what will happen? Trace the short-run and long-run effects. b) If the central bank wants to reduce inflation to 2%, what will happen? Trace the effects. c) What does the vertical LRPC imply about the long-run effectiveness of monetary policy? d) Why might a central bank still care about the short run if the long run returns to natural rate? e) How does credibility affect the cost of reducing inflation?",
          
          "step_by_step": [
            {
              "step": "Attempt to permanently reduce unemployment",
              "explanation": "The central bank cannot permanently reduce unemployment below the natural rate. If it tries, expansionary policy will temporarily lower u to 4%, but inflation will rise. Expectations will adjust upward, shifting SRPC up. Eventually, u returns to 6% at higher inflation. The only permanent effect is higher inflation."
            },
            {
              "step": "Attempt to reduce inflation",
              "explanation": "To reduce inflation from 3% to 2%, the central bank must implement contractionary policy. This temporarily raises u above 6% (say to 8%). Inflation falls below expected inflation. Expectations eventually adjust downward, shifting SRPC down. U returns to 6% at 2% inflation. The cost is temporarily higher unemployment."
            },
            {
              "step": "Long-run effectiveness",
              "explanation": "The vertical LRPC implies monetary policy cannot permanently affect real variables like unemployment. In the long run, money is neutral. Policy affects only inflation."
            },
            {
              "step": "Why care about short run",
              "explanation": "The short run matters because people experience the costs of recessions and booms. Temporarily high unemployment causes real suffering. Temporarily low unemployment may be desirable. Policymakers use policy to smooth these fluctuations, even though they can't permanently improve outcomes."
            },
            {
              "step": "Role of credibility",
              "explanation": "If the central bank is credible, expectations may adjust quickly to policy announcements. A credible disinflation might require less increase in unemployment because expectations fall before policy fully takes effect. If credibility is low, expectations are slow to adjust, and the unemployment cost is higher."
            }
          ],
          
          "final_answer": "a) Temporary u drop, then return to 6% with higher $\\pi$. b) Temporary u rise, then return to 6% with lower $\\pi$. c) Monetary policy neutral in long run. d) Short-run fluctuations cause real costs. e) Credibility reduces cost of disinflation.",
          "concept_applied": "The vertical LRPC implies policy cannot permanently improve real outcomes, but short-run stabilization still matters. Credibility helps."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Initial Long-Run Equilibrium",
          "description": "The economy is at potential GDP with unemployment at the natural rate and inflation equal to expected inflation.",
          "mechanism": "On the Phillips Curve graph, this is at the intersection of the SRPC and the vertical LRPC.",
          "result": "Stable equilibrium.",
          
          "image": {
            "src": "images/unit8/lrpc_step1.png",
            "alt": "Phillips Curve graph showing intersection of SRPC and LRPC",
            "caption": "Figure 8.2.13: Step 1 - Economy in long-run equilibrium at natural rate u_n with $\\pi = \\pi^e$."
          }
        },
        {
          "step": 2,
          "process": "Policy Action Changes Aggregate Demand",
          "description": "The Fed implements expansionary or contractionary policy, shifting AD.",
          "mechanism": "Expansionary policy moves economy along SRPC to lower u, higher $\\pi$. Contractionary policy moves to higher u, lower $\\pi$.",
          "result": "Movement along SRPC to new short-run equilibrium.",
          
          "image": {
            "src": "images/unit8/lrpc_step2.png",
            "alt": "Phillips Curve graph showing movement along SRPC",
            "caption": "Figure 8.2.14: Step 2 - Policy moves the economy along the SRPC to a new short-run equilibrium."
          }
        },
        {
          "step": 3,
          "process": "Expectations Begin to Adjust",
          "description": "If inflation differs from expected inflation, workers and firms revise their expectations.",
          "mechanism": "Higher inflation leads to higher expected inflation; lower inflation leads to lower expected inflation. This begins to shift the SRPC.",
          "result": "SRPC begins to shift.",
          
          "image": {
            "src": "images/unit8/lrpc_step3.png",
            "alt": "Arrow showing SRPC beginning to shift",
            "caption": "Figure 8.2.15: Step 3 - As expectations adjust, the SRPC begins to shift."
          }
        },
        {
          "step": 4,
          "process": "Economy Moves Along New SRPC",
          "description": "As the SRPC shifts, the economy moves along it, with unemployment returning toward the natural rate.",
          "mechanism": "If SRPC shifts up, unemployment rises as inflation remains high. If SRPC shifts down, unemployment falls as inflation remains low.",
          "result": "Unemployment approaches natural rate.",
          
          "image": {
            "src": "images/unit8/lrpc_step4.png",
            "alt": "Phillips Curve graph showing economy moving along shifting SRPC toward LRPC",
            "caption": "Figure 8.2.16: Step 4 - As the SRPC shifts, the economy moves along it, returning toward the natural rate."
          }
        },
        {
          "step": 5,
          "process": "New Long-Run Equilibrium Established",
          "description": "When expectations have fully adjusted, the economy returns to the natural rate at the new inflation level.",
          "mechanism": "The SRPC stops shifting when $\\pi = \\pi^e$. The economy is again at the intersection of SRPC and LRPC.",
          "result": "New long-run equilibrium with same u_n, different $\\pi$.",
          
          "image": {
            "src": "images/unit8/lrpc_step5.png",
            "alt": "Phillips Curve graph showing new long-run equilibrium at natural rate with higher inflation",
            "caption": "Figure 8.2.17: Step 5 - New long-run equilibrium established at natural rate with new inflation level."
          }
        }
      ],

      "image": {
        "src": "images/unit8/lrpc_summary.png",
        "alt": "Comprehensive summary diagram of long-run Phillips Curve: vertical LRPC, natural rate components, adjustment process, and policy implications",
        "caption": "Figure 8.2.18: Long-run Phillips Curve summary - vertical at natural rate, adjustment through expectations, and implications for policy."
      }
    }
  ],

  "key_terms": [
    "Long-run Phillips Curve (LRPC)",
    "Natural rate of unemployment",
    "NAIRU",
    "Frictional unemployment",
    "Structural unemployment",
    "Cyclical unemployment",
    "Potential GDP",
    "Full employment",
    "Expectations adjustment",
    "Adaptive expectations",
    "Rational expectations",
    "Inflation expectations",
    "Expected inflation",
    "Monetary neutrality",
    "Classical dichotomy",
    "Long-run neutrality of money",
    "Accelerating inflation",
    "Decelerating inflation",
    "Stable inflation",
    "Sacrifice ratio",
    "Disinflation",
    "Deflation",
    "Credibility",
    "Central bank credibility",
    "Time inconsistency",
    "Rules vs discretion",
    "Inflation targeting",
    "Natural rate hypothesis",
    "Friedman-Phelps analysis",
    "Vertical LRPC",
    "Long-run trade-off (lack thereof)",
    "Hysteresis",
    "Labor market flexibility",
    "Demographic effects",
    "Structural change",
    "Job matching",
    "Unemployment insurance",
    "Minimum wage",
    "Union power"
  ],

  "summary": "The long-run Phillips Curve (LRPC) is vertical at the natural rate of unemployment, showing that in the long run there is no trade-off between inflation and unemployment. The natural rate of unemployment ($u_n$) is the unemployment rate that prevails when the economy is producing at potential GDP. It consists of frictional unemployment (workers between jobs) and structural unemployment (skill mismatches), and excludes cyclical unemployment. The natural rate is also called the NAIRU—the Non-Accelerating Inflation Rate of Unemployment—because when unemployment equals the natural rate, inflation is stable (neither accelerating nor decelerating). The LRPC is vertical because, in the long run, expectations fully adjust to actual inflation. If policymakers attempt to keep unemployment below the natural rate through expansionary policy, inflation rises, expectations adjust upward, and the short-run Phillips Curve shifts up. The economy returns to the natural rate, but at a higher inflation rate. Continued attempts lead to accelerating inflation. Conversely, if unemployment is above the natural rate, inflation falls, expectations adjust downward, and the economy returns to the natural rate at lower inflation. The transition from short run to long run is driven by expectations adjustment. When actual inflation differs from expected inflation, workers and firms revise their expectations, shifting the SRPC. The speed of adjustment depends on how expectations are formed and on central bank credibility. The natural rate itself can change over time due to demographic shifts, technological change, institutional factors, and public policies. Factors that lower the natural rate include improved job matching, aging workforce, reduced union power, and policies that encourage work. Factors that raise it include generous unemployment benefits, minimum wage laws, and structural mismatches. The vertical LRPC implies that monetary policy is neutral in the long run—changes in the money supply affect only nominal variables (inflation, price level), not real variables (output, unemployment). This is a key implication of the classical dichotomy applied to the long run. However, the short run still matters because fluctuations cause real costs, and policy can smooth these fluctuations. Understanding the long-run Phillips Curve is essential for recognizing the limits of monetary policy, the importance of anchoring inflation expectations, and the causes of sustained inflation."
}
