{
  "expanded_description": "What causes the Phillips Curve to move? Why did the 1970s see both high inflation and high unemployment, contradicting the simple Phillips Curve trade-off? The answer lies in shifts of the Phillips Curve—changes in its position that alter the relationship between inflation and unemployment. These shifts are caused by two main factors: changes in inflation expectations and supply shocks. When inflation expectations rise, the short-run Phillips Curve shifts upward—inflation is higher at every unemployment rate. When a negative supply shock hits, the curve also shifts upward, causing stagflation. Understanding what shifts the Phillips Curve is essential for explaining historical episodes like the 1970s stagflation, for predicting how policy changes will affect the economy, and for understanding the limits of stabilization policy.",
  
  "core_concept": {
    "principle": "The short-run Phillips Curve can shift due to two primary factors: changes in inflation expectations and supply shocks. (1) Changes in inflation expectations: When people expect higher inflation, they adjust their behavior accordingly. Workers demand higher wages to maintain their real purchasing power. Firms, anticipating higher costs and higher competitor prices, raise prices more aggressively. This shifts the entire short-run Phillips Curve upward—at every unemployment rate, inflation is higher. Conversely, when expected inflation falls, the SRPC shifts downward. Expected inflation is influenced by past inflation (adaptive expectations) and by central bank credibility and policy announcements (rational expectations). If the central bank is credible and committed to low inflation, expectations remain anchored, keeping the SRPC stable. If credibility is lost, expectations can become unanchored, causing the SRPC to shift. (2) Supply shocks: A supply shock is an event that directly affects production costs or the economy's productive capacity, independent of aggregate demand. Negative supply shocks (oil price increases, natural disasters, pandemics, supply chain disruptions) increase costs, forcing firms to raise prices even if demand hasn't changed. This shifts the SRPC upward—inflation rises at every unemployment rate. Positive supply shocks (technological breakthroughs, productivity improvements, falling commodity prices) reduce costs, shifting the SRPC downward. Supply shocks also affect the economy's potential output and can change the natural rate of unemployment in the long run. The 1970s oil shocks are the classic example of negative supply shocks shifting the SRPC upward and causing stagflation—simultaneously high inflation and high unemployment. Shifts of the Phillips Curve have important policy implications. When the SRPC shifts upward, the trade-off worsens: reducing unemployment causes even higher inflation, and fighting inflation causes even higher unemployment. Policymakers face more difficult choices. When the SRPC shifts downward, the trade-off improves: lower inflation can coexist with lower unemployment. Understanding these shifts is essential for interpreting economic history and for designing appropriate policy responses.",
    
    "explanation": "Imagine the Phillips Curve as a seesaw. Movements along the curve are like sliding along the seesaw—you can trade off inflation and unemployment. But shifts are like someone raising or lowering the entire seesaw. If people expect higher inflation, they raise the whole seesaw up—now the same unemployment gives higher inflation. If a supply shock hits, it also raises the seesaw. The 1970s were like someone repeatedly jacking up the seesaw while also sliding along it—inflation and unemployment both rose. That's a shift, not a movement. Understanding shifts tells you why the old trade-off sometimes breaks down.",
    
    "image": {
      "src": "images/unit8/shifts_overview.png",
      "alt": "Phillips Curve graph showing upward shift from higher expected inflation or negative supply shock, and downward shift from lower expected inflation or positive supply shock",
      "caption": "Figure 8.3.1: The short-run Phillips Curve shifts due to changes in inflation expectations and supply shocks."
    }
  },

  "sections": [
    {
      "section_title": "8.3 Shifts in Phillips Curve",
      "introduction": "The short-run Phillips Curve is not a stable, permanent relationship. It can shift—moving up or down—in response to changes in inflation expectations and supply shocks. These shifts explain why the simple inflation-unemployment trade-off sometimes breaks down, as it did dramatically in the 1970s. In this section, we'll explore what causes the Phillips Curve to shift, how expectations and supply shocks operate, the phenomenon of stagflation, and the policy implications of shifting curves.",
      
      "introduction_image": {
        "src": "images/unit8/shifts_intro.png",
        "alt": "Historical graph showing 1970s data with both inflation and unemployment rising",
        "caption": "Figure 8.3.2: The 1970s saw both inflation and unemployment rise—a shift of the Phillips Curve, not a movement along it."
      },
      
      "key_concept": {
        "definition": "The short-run Phillips Curve can shift due to two main factors: changes in inflation expectations and supply shocks. (1) Changes in inflation expectations ($\\pi^e$): In the expectations-augmented Phillips Curve equation $\\pi = \\pi^e - \\beta(u - u_n) + v$, expected inflation appears directly. An increase in $\\pi^e$ raises actual inflation at every unemployment rate, shifting the SRPC upward. A decrease in $\\pi^e$ shifts it downward. Expected inflation is determined by past inflation (adaptive expectations) and by central bank credibility and policy announcements (rational expectations). When the central bank is credible and commits to low inflation, expectations become anchored, stabilizing the SRPC. When credibility is lost, expectations become unanchored, and the SRPC becomes more volatile. (2) Supply shocks ($v$): The $v$ term in the equation represents supply shocks—exogenous events that directly affect inflation independently of demand and unemployment. A positive $v$ (negative supply shock) increases inflation, shifting the SRPC upward. A negative $v$ (positive supply shock) decreases inflation, shifting the SRPC downward. Examples of negative supply shocks include: sharp increases in oil or commodity prices, natural disasters, pandemics, supply chain disruptions, and increases in import prices due to currency depreciation. Examples of positive supply shocks include: technological breakthroughs, productivity improvements, falling commodity prices, and favorable weather for agriculture. Supply shocks also affect the economy's potential output and can, in some cases, alter the natural rate of unemployment over time. The combination of shifting expectations and supply shocks explains complex episodes like the 1970s stagflation, where the SRPC shifted upward repeatedly, causing both higher inflation and higher unemployment. Understanding these shifts is crucial for policy: when the SRPC shifts upward, the trade-off worsens, making it more costly to fight either inflation or unemployment. When it shifts downward, the trade-off improves.",
        
        "context": "The recognition that the Phillips Curve can shift revolutionized macroeconomics. In the 1960s, policymakers thought the trade-off was stable. The stagflation of the 1970s—which could not be explained by movements along a stable curve—forced a rethinking. Milton Friedman and Edmund Phelps argued that the curve would shift with expectations. The oil shocks of 1973 and 1979 provided dramatic evidence of supply-side shifts. Today, central banks carefully monitor inflation expectations and watch for supply shocks to gauge how the Phillips Curve is evolving. In AP Macroeconomics, understanding shifts of the Phillips Curve is essential for analyzing historical episodes and for predicting the effects of policy and external events.",
        
        "image": {
          "src": "images/unit8/shifts_explanation.png",
          "alt": "Phillips Curve graph showing both upward and downward shifts with labeled causes",
          "caption": "Figure 8.3.3: Shifts of the SRPC are caused by changes in expected inflation and supply shocks."
        }
      },

      "classifications": [
        {
          "type": "Expectations-Driven Shifts",
          "value": "Changes in expected inflation shift the SRPC",
          "characteristics": ["Caused by changes in $\\pi^e$", "Upward shift when $\\pi^e$ rises", "Downward shift when $\\pi^e$ falls", "Related to credibility", "Can be gradual or rapid"],
          "behavior": "When people expect higher inflation, they adjust their behavior. Workers demand higher wages to maintain purchasing power. Firms, expecting higher costs and that competitors will raise prices, increase their own prices more aggressively. This raises actual inflation at every unemployment rate, shifting the SRPC upward. When expected inflation falls, the opposite occurs: wage demands moderate, price increases slow, and the SRPC shifts downward. Expected inflation is influenced by several factors. Under adaptive expectations, people base their expectations on past inflation—so high past inflation leads to high expected inflation, creating persistence. Under rational expectations, people use all available information, including policy announcements and central bank credibility. A credible central bank committed to low inflation can anchor expectations, keeping the SRPC stable even if actual inflation fluctuates temporarily. If credibility is lost, expectations can become unanchored, and the SRPC may shift sharply in response to policy or events. The speed of expectations adjustment determines how quickly the SRPC shifts. Rapid adjustment means the short-run trade-off is brief; slow adjustment means policy can have longer-lasting real effects.",
          
          "image": {
            "src": "images/unit8/expectations_shifts.png",
            "alt": "Phillips Curve graph showing SRPC shifting up as expected inflation rises",
            "caption": "Figure 8.3.4: Higher expected inflation shifts the SRPC upward; lower expected inflation shifts it downward."
          },
          
          "examples": [
            {
              "process": "1970s expectations spiral",
              "explanation": "As inflation rose in the late 1960s and 1970s, expectations adjusted upward. Each time the Fed tried to stimulate the economy, the SRPC had already shifted up, requiring even more inflation to reduce unemployment."
            },
            {
              "process": "1990s anchored expectations",
              "explanation": "By the 1990s, the Fed had built credibility. Expectations became anchored around 2-3%, so the SRPC remained stable even as unemployment fell."
            }
          ]
        },
        {
          "type": "Supply Shock Shifts",
          "value": "Exogenous events affecting production costs shift the SRPC",
          "characteristics": ["Caused by $v$ term", "Upward shift from negative shocks", "Downward shift from positive shocks", "Can cause stagflation", "Independent of demand"],
          "behavior": "Supply shocks directly affect inflation without changing unemployment, at least initially. A negative supply shock (oil price spike, crop failure, supply chain disruption, pandemic) increases production costs. Firms raise prices to maintain profit margins, increasing inflation at every unemployment rate. This shifts the SRPC upward. A positive supply shock (technological breakthrough, productivity improvement, falling commodity prices) reduces costs, allowing firms to lower prices or raise them less, shifting the SRPC downward. Supply shocks are particularly challenging because they affect both inflation and the real economy. A negative supply shock typically also reduces potential output and increases unemployment (at least temporarily), creating stagflation—simultaneously high inflation and high unemployment. This is exactly what happened in the 1970s: oil shocks raised costs, shifting the SRPC upward, while also reducing output and raising unemployment. Standard demand-side policies cannot address both problems—fighting inflation would worsen unemployment; fighting unemployment would worsen inflation. Supply shocks also differ in their persistence. Some are temporary (like a one-time oil price spike) and may reverse as conditions normalize. Others are more permanent (like a technological shift) and can alter the long-run structure of the economy, potentially changing the natural rate of unemployment as well.",
          
          "image": {
            "src": "images/unit8/supply_shock_shifts.png",
            "alt": "Phillips Curve graph showing SRPC shifting up from negative supply shock, with stagflation point",
            "caption": "Figure 8.3.5: Negative supply shocks shift the SRPC upward, causing stagflation (higher inflation and higher unemployment)."
          },
          
          "examples": [
            {
              "process": "1973 oil shock",
              "explanation": "OPEC oil embargo caused oil prices to quadruple. This negative supply shock shifted the SRPC sharply upward, contributing to stagflation—inflation rose to double digits while unemployment also rose."
            },
            {
              "process": "2021-22 supply chain disruptions",
              "explanation": "Post-pandemic supply chain problems and energy price increases acted as negative supply shocks, shifting the SRPC upward and contributing to high inflation even as unemployment fell."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Inflation Expectations Shift the Phillips Curve",
          "statement": "The position of the short-run Phillips Curve depends crucially on what people expect inflation to be. When expected inflation rises, the entire curve shifts upward—inflation is higher at every unemployment rate. When expected inflation falls, the curve shifts downward. This occurs because expectations are self-fulfilling: if workers expect higher inflation, they demand higher wages; if firms expect higher inflation, they raise prices more. These behaviors directly increase actual inflation regardless of the state of the labor market. The sensitivity of the SRPC to expectations means that central bank credibility is paramount. A credible central bank can anchor expectations, keeping the SRPC stable and making the trade-off more favorable. A central bank that loses credibility faces a shifting SRPC that makes policy more difficult.",
          "application": "When analyzing policy, consider the state of inflation expectations. If expectations are anchored, the SRPC is stable—policy can move along the curve with predictable effects. If expectations are unanchored, the curve may shift in response to policy, complicating the task. This is why the Fed monitors inflation expectations closely.",
          "example": "In the early 1980s, after years of high inflation, expectations were unanchored. The SRPC was high, and reducing inflation required a severe recession to shift expectations downward. By contrast, in the 1990s, anchored expectations meant the SRPC remained stable even as unemployment fell.",
          
          "image": {
            "src": "images/unit8/expectations_principle.png",
            "alt": "Graph showing SRPC shifting up with higher expected inflation, with arrows from expectations to curve",
            "caption": "Figure 8.3.6: Inflation expectations determine the position of the SRPC. Higher expectations shift it up; lower expectations shift it down."
          }
        },
        {
          "principle": "Supply Shocks Shift the Phillips Curve and Create Stagflation",
          "statement": "Supply shocks shift the short-run Phillips Curve independently of demand conditions. A negative supply shock increases production costs, forcing firms to raise prices even if demand hasn't changed. This shifts the SRPC upward—inflation rises at every unemployment rate. Moreover, supply shocks typically also reduce output and increase unemployment, at least temporarily. The result is stagflation: simultaneously higher inflation and higher unemployment. This combination cannot be explained by movements along a stable Phillips Curve, which would show inflation and unemployment moving in opposite directions. Stagflation is definitive evidence of a shift. Positive supply shocks have the opposite effect: they shift the SRPC downward, reducing inflation and often increasing output and reducing unemployment—a welcome combination.",
          "application": "When observing high inflation and high unemployment together, recognize that a supply shock has likely shifted the SRPC. Standard demand-side analysis would be misleading. Policy responses must account for the supply-side nature of the shock, which may require different tools (like supply-side policies) or difficult trade-offs.",
          "example": "The 1970s oil shocks are the classic example. In 1973-74, inflation surged while unemployment also rose—stagflation. This was not a movement along a stable Phillips Curve but an upward shift caused by the supply shock. Similarly, the 2021-22 period saw supply chain disruptions and energy price increases contributing to high inflation even as unemployment fell—a combination of demand recovery and supply shifts.",
          
          "image": {
            "src": "images/unit8/stagflation.png",
            "alt": "Phillips Curve graph showing upward shift and stagflation point with both higher inflation and higher unemployment",
            "caption": "Figure 8.3.7: Negative supply shocks shift the SRPC upward, causing stagflation—higher inflation and higher unemployment."
          }
        },
        {
          "principle": "Expectations and Supply Shocks Can Interact",
          "statement": "Expectations and supply shocks do not operate in isolation—they can interact, amplifying or dampening each other's effects. For example, a negative supply shock that raises inflation can, if persistent, lead to higher expected inflation. This further shifts the SRPC upward, creating a wage-price spiral. This is what happened in the 1970s: the oil shocks raised inflation, expectations adjusted upward, and the SRPC shifted further, making stagflation worse and more persistent. Conversely, if the central bank responds credibly to a supply shock, it may prevent expectations from becoming unanchored, limiting the shift. The interaction between expectations and supply shocks explains why similar shocks can have different effects depending on the policy environment and the state of expectations. When expectations are well-anchored, a temporary supply shock may cause only a temporary blip in inflation. When expectations are unanchored, the same shock can set off a spiral of rising inflation and expectations.",
          "application": "When analyzing the effects of a supply shock, consider the state of expectations. If expectations are anchored, the shock's effects may be limited. If expectations are unanchored, the shock could trigger a much larger and more persistent shift in the Phillips Curve.",
          "example": "The 1970s oil shocks occurred after a decade of rising inflation and eroding Fed credibility. Expectations were already drifting upward, so the shocks triggered a full-blown wage-price spiral. In contrast, the 2021-22 supply disruptions occurred after decades of anchored expectations around 2%. While inflation rose sharply, expectations remained relatively anchored, and inflation began to fall as supply conditions improved.",
          
          "image": {
            "src": "images/unit8/interaction.png",
            "alt": "Diagram showing supply shock raising inflation, which then raises expectations, further shifting SRPC",
            "caption": "Figure 8.3.8: Expectations and supply shocks can interact. A supply shock that raises inflation can, if persistent, raise expectations and cause further shifts."
          }
        },
        {
          "principle": "Shifts of the Phillips Curve Alter Policy Trade-Offs",
          "statement": "When the short-run Phillips Curve shifts, the policy trade-off facing policymakers changes. An upward shift worsens the trade-off: reducing unemployment by one percentage point now causes a larger increase in inflation than before; reducing inflation by one percentage point now requires a larger increase in unemployment. This makes policy more difficult and costly. A downward shift improves the trade-off: lower inflation can coexist with lower unemployment, and policy actions have smaller side effects. Policymakers must therefore adapt their strategies to the position of the SRPC. When the curve has shifted upward due to negative supply shocks or rising expectations, they may need to accept temporarily higher unemployment to bring inflation down and re-anchor expectations. When the curve shifts downward, they may be able to achieve better outcomes with less pain. Understanding shifts is essential for evaluating policy options and for predicting the consequences of policy actions.",
          "application": "When evaluating policy, assess whether the SRPC has shifted and in which direction. An upward shift means policy tightening will be more costly in terms of unemployment; policy easing will cause more inflation. A downward shift means both goals may be easier to achieve.",
          "example": "In the early 1980s, the SRPC had shifted upward after years of high inflation and expectations. Reducing inflation required a severe recession—unemployment peaked at nearly 11%. The trade-off was very costly. In the 1990s, with the SRPC stable or shifted downward, the Fed could allow unemployment to fall without worrying much about inflation.",
          
          "image": {
            "src": "images/unit8/policy_tradeoff_shifts.png",
            "alt": "Two Phillips Curve graphs showing steeper trade-off after upward shift and flatter trade-off after downward shift",
            "caption": "Figure 8.3.9: Shifts of the SRPC alter the policy trade-off. Upward shifts make the trade-off more costly; downward shifts improve it."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Causes of Shifts",
          
          "image": {
            "src": "images/unit8/shift_identification.png",
            "alt": "Scenarios for identifying shift causes",
            "caption": "Figure 8.3.10: Determine whether each event causes a movement along or shift of the SRPC."
          },
          
          "problem": "For each scenario, determine whether it causes a movement along the short-run Phillips Curve or a shift of the curve. If a shift, state whether it is up or down and whether it is caused by expectations or a supply shock. a) The Fed increases the money supply, reducing unemployment. b) Oil prices rise sharply due to geopolitical conflict. c) The central bank announces a new, credible 2% inflation target, and people believe it. d) Productivity increases dramatically due to new technology. e) A hurricane destroys major port facilities, disrupting supply chains. f) After a decade of low inflation, people's inflation expectations rise because of recent policy mistakes.",
          
          "step_by_step": [
            {
              "step": "Analyze scenario a",
              "explanation": "Fed increases money supply → aggregate demand increases → movement along SRPC to lower u, higher $\\pi$. This is a movement, not a shift."
            },
            {
              "step": "Analyze scenario b",
              "explanation": "Oil price rise → negative supply shock → SRPC shifts up. Caused by supply shock."
            },
            {
              "step": "Analyze scenario c",
              "explanation": "Credible announcement lowers expected inflation → SRPC shifts down. Caused by expectations."
            },
            {
              "step": "Analyze scenario d",
              "explanation": "Productivity increase → positive supply shock → SRPC shifts down. Caused by supply shock."
            },
            {
              "step": "Analyze scenario e",
              "explanation": "Hurricane disrupts supply chains → negative supply shock → SRPC shifts up."
            },
            {
              "step": "Analyze scenario f",
              "explanation": "Rising expectations due to policy mistakes → expected inflation up → SRPC shifts up. Caused by expectations."
            }
          ],
          
          "final_answer": "a) Movement. b) Shift up (supply shock). c) Shift down (expectations). d) Shift down (supply shock). e) Shift up (supply shock). f) Shift up (expectations).",
          "concept_applied": "Movements along SRPC come from demand changes; shifts come from expectations changes or supply shocks."
        },
        {
          "title": "Analyzing the 1970s Stagflation",
          
          "image": {
            "src": "images/unit8/1970s_analysis.png",
            "alt": "Graph showing U.S. inflation and unemployment data from 1960s-1980s",
            "caption": "Figure 8.3.11: Analyze the 1970s stagflation using the Phillips Curve framework."
          },
          
          "problem": "In the late 1960s, U.S. inflation was around 1-2% and unemployment around 3.5-4%. By 1975, inflation was over 9% and unemployment over 8%. By 1980, inflation was over 13% and unemployment around 7%. a) Could these observations be explained by movements along a stable Phillips Curve? Why or why not? b) What caused the Phillips Curve to shift during this period? c) Explain the role of expectations. d) Explain the role of supply shocks. e) What policy dilemma did this create, and how was it eventually resolved?",
          
          "step_by_step": [
            {
              "step": "Evaluate movement explanation",
              "explanation": "No, movements along a stable Phillips Curve would show inflation and unemployment moving in opposite directions. In the 1970s, they moved together—both up. This indicates shifts of the curve, not movements along it."
            },
            {
              "step": "Identify causes",
              "explanation": "Two factors shifted the SRPC upward: (1) Rising inflation expectations as the Fed lost credibility; (2) Negative supply shocks from oil price increases in 1973 and 1979."
            },
            {
              "step": "Role of expectations",
              "explanation": "After years of rising inflation, expectations became unanchored. Workers demanded higher wages; firms raised prices more. This shifted the SRPC upward repeatedly."
            },
            {
              "step": "Role of supply shocks",
              "explanation": "The 1973 and 1979 oil shocks directly increased costs, shifting the SRPC up and also reducing output, raising unemployment—stagflation."
            },
            {
              "step": "Policy dilemma and resolution",
              "explanation": "Policymakers faced a dilemma: fighting inflation would worsen unemployment; fighting unemployment would worsen inflation. The eventual resolution came under Paul Volcker (1979-82), who raised interest rates sharply to break inflation. This caused a severe recession but eventually lowered inflation and re-anchored expectations."
            }
          ],
          
          "final_answer": "a) No—inflation and u both rose. b) Expectations and supply shocks. c) Unanchored expectations shifted SRPC up. d) Oil shocks shifted SRPC up and reduced output. e) Dilemma: fighting one worsens other. Resolved by Volcker's tight policy.",
          "concept_applied": "The 1970s stagflation was caused by upward shifts of the SRPC from expectations and supply shocks."
        },
        {
          "title": "Policy Response to a Supply Shock",
          
          "image": {
            "src": "images/unit8/supply_shock_response.png",
            "alt": "Phillips Curve graph showing upward shift from supply shock",
            "caption": "Figure 8.3.12: Analyze policy options after a negative supply shock."
          },
          
          "problem": "An economy is initially in long-run equilibrium with unemployment at 5% and inflation at 2%. A negative supply shock hits, shifting the SRPC upward by 3 percentage points. a) Show the initial situation and the shift on a Phillips Curve graph. b) If the Fed does nothing, what will happen to unemployment and inflation in the short run? (Hint: The shock also reduces output.) c) What are the Fed's policy options? d) What are the trade-offs of each option? e) How might the Fed's choice affect inflation expectations and future shifts?",
          
          "step_by_step": [
            {
              "step": "Draw initial and shifted curves",
              "explanation": "Draw LRPC at 5%. Draw SRPC1 crossing at (5%, 2%). Shift SRPC up by 3 points to SRPC2, now crossing LRPC at (5%, 5%)—but note this is just the curve, not equilibrium."
            },
            {
              "step": "No policy outcome",
              "explanation": "The supply shock also reduces aggregate supply, shifting SRAS left. This causes output to fall (unemployment rises) and prices to rise further. The economy moves to a point on SRPC2 with higher u (say 7%) and higher $\\pi$ (say 6%). This is stagflation."
            },
            {
              "step": "Policy options",
              "explanation": "Option 1: Do nothing, accept stagflation, hope supply shock reverses. Option 2: Contractionary policy to fight inflation—shift AD left, further raising u but lowering $\\pi$ back toward target. Option 3: Expansionary policy to fight unemployment—shift AD right, further raising $\\pi$ but lowering u. Option 4: Supply-side policies (outside Fed's control) to address shock directly."
            },
            {
              "step": "Trade-offs",
              "explanation": "Option 2: Lower inflation at cost of even higher u. Option 3: Lower u at cost of even higher $\\pi$. Option 1: Accept both high u and high $\\pi$ temporarily. No good choice."
            },
            {
              "step": "Expectations effects",
              "explanation": "If the Fed does nothing or expands, inflation remains high, potentially raising expectations and causing further upward shifts. If the Fed tightens credibly, it may prevent expectations from becoming unanchored, limiting long-run damage."
            }
          ],
          
          "final_answer": "a) SRPC shifts up. b) u rises, $\\pi$ rises (stagflation). c) Do nothing, tighten, ease, supply-side. d) Each involves trade-offs. e) Policy affects expectations and future shifts.",
          "concept_applied": "Supply shocks force difficult policy choices. The response affects both current outcomes and future expectations."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Initial SRPC Position",
          "description": "The economy has a given short-run Phillips Curve determined by current expected inflation and recent supply conditions.",
          "mechanism": "The SRPC is drawn for a specific $\\pi^e$ and $v$. Its position reflects these factors.",
          "result": "Baseline SRPC established.",
          
          "image": {
            "src": "images/unit8/shift_step1.png",
            "alt": "Phillips Curve graph showing initial SRPC",
            "caption": "Figure 8.3.13: Step 1 - Initial SRPC position based on current expected inflation."
          }
        },
        {
          "step": 2,
          "process": "Expectations Change or Supply Shock Occurs",
          "description": "An event changes expected inflation or directly affects costs through a supply shock.",
          "mechanism": "Expected inflation rises or falls. Or a supply shock (positive or negative) occurs, changing $v$.",
          "result": "Pressure to shift SRPC.",
          
          "image": {
            "src": "images/unit8/shift_step2.png",
            "alt": "Arrow pointing to SRPC with labels 'expectations change' and 'supply shock'",
            "caption": "Figure 8.3.14: Step 2 - A change in expectations or a supply shock occurs."
          }
        },
        {
          "step": 3,
          "process": "SRPC Shifts",
          "description": "The short-run Phillips Curve shifts in response to the change.",
          "mechanism": "Higher $\\pi^e$ or negative supply shock shifts SRPC up. Lower $\\pi^e$ or positive supply shock shifts SRPC down.",
          "result": "New SRPC position.",
          
          "image": {
            "src": "images/unit8/shift_step3.png",
            "alt": "Phillips Curve graph showing SRPC shifting up or down",
            "caption": "Figure 8.3.15: Step 3 - The SRPC shifts to its new position."
          }
        },
        {
          "step": 4,
          "process": "Economy Moves to New Short-Run Equilibrium",
          "description": "Depending on whether the shift is accompanied by other changes (like the supply shock also affecting output), the economy moves to a new point on the shifted SRPC.",
          "mechanism": "If only expectations changed, the economy may be at the same u with higher $\\pi$. If a supply shock occurred, u may also change as output adjusts.",
          "result": "New short-run equilibrium.",
          
          "image": {
            "src": "images/unit8/shift_step4.png",
            "alt": "Phillips Curve graph showing new equilibrium on shifted SRPC",
            "caption": "Figure 8.3.16: Step 4 - The economy reaches a new short-run equilibrium on the shifted SRPC."
          }
        },
        {
          "step": 5,
          "process": "Policy May Respond",
          "description": "Policymakers may respond to the new situation, which can cause further movements or shifts.",
          "mechanism": "Policy actions affect AD, causing movements along the new SRPC. If policy affects expectations, further shifts may occur.",
          "result": "Ongoing adjustment process.",
          
          "image": {
            "src": "images/unit8/shift_step5.png",
            "alt": "Phillips Curve graph showing policy response and potential further adjustments",
            "caption": "Figure 8.3.17: Step 5 - Policy may respond, causing movements or further shifts."
          }
        }
      ],

      "image": {
        "src": "images/unit8/shifts_summary.png",
        "alt": "Comprehensive summary diagram of Phillips Curve shifts: causes (expectations, supply shocks), directions, and policy implications",
        "caption": "Figure 8.3.18: Shifts in Phillips Curve summary - causes, effects, and policy responses."
      }
    }
  ],

  "key_terms": [
    "Phillips Curve shifts",
    "Inflation expectations",
    "Expected inflation",
    "Adaptive expectations",
    "Rational expectations",
    "Anchored expectations",
    "Unanchored expectations",
    "Supply shocks",
    "Negative supply shock",
    "Positive supply shock",
    "Stagflation",
    "Cost-push inflation",
    "Demand-pull inflation",
    "Oil shock",
    "Commodity prices",
    "Supply chain disruption",
    "Productivity shock",
    "Technology shock",
    "Wage-price spiral",
    "Expectations spiral",
    "Credibility",
    "Central bank credibility",
    "Inflation targeting",
    "Policy trade-off",
    "Sacrifice ratio",
    "Disinflation",
    "Re-anchoring expectations",
    "Volcker disinflation",
    "1970s stagflation",
    "Great Inflation",
    "Great Moderation",
    "NAIRU",
    "Natural rate",
    "Potential GDP",
    "Aggregate supply",
    "Short-run aggregate supply",
    "Long-run aggregate supply"
  ],

  "summary": "The short-run Phillips Curve can shift due to two primary factors: changes in inflation expectations and supply shocks. (1) Changes in inflation expectations ($\\pi^e$): When expected inflation rises, the SRPC shifts upward—inflation is higher at every unemployment rate. When expected inflation falls, the SRPC shifts downward. Expected inflation is influenced by past inflation (adaptive expectations) and by central bank credibility and policy announcements (rational expectations). A credible central bank can anchor expectations, keeping the SRPC stable. (2) Supply shocks ($v$): A negative supply shock (oil price increase, natural disaster, supply chain disruption) increases production costs, shifting the SRPC upward. A positive supply shock (productivity improvement, technology breakthrough, falling commodity prices) shifts the SRPC downward. Supply shocks also affect output and unemployment, often creating stagflation—simultaneously high inflation and high unemployment—as in the 1970s. Expectations and supply shocks can interact. A negative supply shock that raises inflation can, if persistent, lead to higher expected inflation, causing further upward shifts and a wage-price spiral. Conversely, anchored expectations can limit the damage from temporary supply shocks. Shifts of the Phillips Curve alter policy trade-offs. An upward shift worsens the trade-off: reducing unemployment causes more inflation, and reducing inflation causes more unemployment. A downward shift improves the trade-off. The 1970s stagflation was caused by a combination of rising inflation expectations (as Fed credibility eroded) and negative supply shocks (oil price increases). This created a policy dilemma: fighting inflation would worsen unemployment; fighting unemployment would worsen inflation. The eventual resolution under Paul Volcker involved tight monetary policy that caused a severe recession but eventually lowered inflation and re-anchored expectations. Understanding shifts of the Phillips Curve is essential for interpreting economic history, predicting the effects of policy and external events, and evaluating policy options."
}
