{
  "expanded_description": "Is there a trade-off between inflation and unemployment? For decades, policymakers believed there was—that lower unemployment could be achieved at the cost of higher inflation, and vice versa. This relationship, captured by the Phillips Curve, was one of the most influential ideas in macroeconomics. In the short run, an inverse relationship between inflation and unemployment does appear to hold: when aggregate demand increases, unemployment falls and inflation rises; when demand decreases, unemployment rises and inflation falls. This short-run trade-off presents policymakers with choices—how much inflation are they willing to accept to achieve lower unemployment? Understanding the short-run Phillips Curve is essential for analyzing the effects of monetary and fiscal policy and for evaluating policy trade-offs.",
  
  "core_concept": {
    "principle": "The short-run Phillips Curve (SRPC) illustrates the inverse relationship between the inflation rate and the unemployment rate. When unemployment is low, inflation tends to be high; when unemployment is high, inflation tends to be low. This relationship arises because changes in aggregate demand affect both unemployment and inflation. When aggregate demand increases (e.g., through expansionary monetary or fiscal policy), the economy moves along the short-run aggregate supply curve: output rises, unemployment falls, and the price level rises (inflation increases). When aggregate demand decreases, output falls, unemployment rises, and inflation decreases. The short-run Phillips Curve is downward sloping, reflecting this trade-off. The equation for the SRPC can be written as: $\pi = \pi^e - \beta(u - u_n) + v$, where $\pi$ is actual inflation, $\pi^e$ is expected inflation, $u$ is the actual unemployment rate, $u_n$ is the natural rate of unemployment, $\beta$ is a positive parameter measuring the sensitivity of inflation to unemployment, and $v$ represents supply shocks. This equation shows that inflation depends on expected inflation, the cyclical unemployment gap ($u - u_n$), and supply shocks. When unemployment is below the natural rate ($u < u_n$), the term $- \beta(u - u_n)$ becomes positive, adding to inflation. When unemployment is above the natural rate, inflation decreases. The position of the short-run Phillips Curve depends on expected inflation. Higher expected inflation shifts the SRPC upward (higher inflation at every unemployment rate); lower expected inflation shifts it downward. The short-run trade-off means policymakers face a choice: they can achieve lower unemployment in the short run by accepting higher inflation, or they can reduce inflation by accepting higher unemployment. However, this trade-off exists only in the short run. In the long run, expectations adjust, and the economy returns to the natural rate of unemployment regardless of inflation. The short-run Phillips Curve is a key tool for analyzing policy trade-offs and for understanding the dynamics of inflation and unemployment.",
    
    "explanation": "Imagine you're managing a factory. When demand for your product increases, you hire more workers (unemployment falls) and raise prices (inflation rises). When demand falls, you lay off workers (unemployment rises) and cut prices or stop raising them (inflation falls). This is the short-run trade-off. The Phillips Curve captures this relationship for the whole economy. The curve slopes down: lower unemployment goes with higher inflation. But the curve can shift. If people expect higher inflation, they'll demand higher wages, and firms will raise prices more, shifting the curve up. So the same unemployment rate can have different inflation rates depending on expectations. This is why the trade-off isn't stable—it depends on what people expect to happen to prices.",
    
    "image": {
      "src": "images/unit8/srpc_overview.png",
      "alt": "Graph showing downward-sloping short-run Phillips Curve with inflation on vertical axis and unemployment on horizontal axis",
      "caption": "Figure 8.1.1: The short-run Phillips Curve shows an inverse relationship between inflation and unemployment."
    }
  },

  "sections": [
    {
      "section_title": "8.1 Short Run Phillips Curve",
      "introduction": "For much of the 20th century, economists believed that policymakers faced a stable trade-off between inflation and unemployment. Lower unemployment could be bought at the cost of higher inflation, and vice versa. This relationship—the Phillips Curve—became a cornerstone of macroeconomic policy. In this section, we'll explore the short-run Phillips Curve: what it is, why it slopes downward, how it relates to the AD-AS model, what causes it to shift, and why the trade-off it represents is only temporary. Understanding the short-run Phillips Curve is essential for analyzing policy choices and their effects on inflation and unemployment.",
      
      "introduction_image": {
        "src": "images/unit8/srpc_intro.png",
        "alt": "Historical scatter plot showing inverse relationship between inflation and unemployment in various decades",
        "caption": "Figure 8.1.2: Empirical data often shows a downward-sloping relationship between inflation and unemployment in the short run."
      },
      
      "key_concept": {
        "definition": "The short-run Phillips Curve (SRPC) is a curve that shows the inverse relationship between the inflation rate and the unemployment rate in the short run. It is based on the observation that when aggregate demand increases, the economy moves along the short-run aggregate supply curve: real GDP rises, unemployment falls, and the price level rises (inflation increases). When aggregate demand decreases, real GDP falls, unemployment rises, and inflation decreases. This relationship can be derived from the aggregate demand-aggregate supply model. The SRPC is downward sloping, reflecting the trade-off between inflation and unemployment. The position of the SRPC depends on expected inflation. The augmented Phillips Curve equation is: $\pi = \pi^e - \beta(u - u_n) + v$, where $\pi$ is actual inflation, $\pi^e$ is expected inflation, $u$ is the actual unemployment rate, $u_n$ is the natural rate of unemployment (the rate consistent with potential GDP), $\beta$ is a positive parameter measuring how strongly inflation responds to cyclical unemployment, and $v$ represents supply shocks (positive $v$ increases inflation, negative $v$ decreases it). This equation shows that: (1) Actual inflation equals expected inflation when unemployment is at its natural rate ($u = u_n$) and there are no supply shocks ($v = 0$). (2) When unemployment is below the natural rate ($u < u_n$), actual inflation exceeds expected inflation. (3) When unemployment is above the natural rate ($u > u_n$), actual inflation is below expected inflation. (4) Supply shocks ($v$) directly affect inflation, shifting the SRPC. The short-run Phillips Curve implies that policymakers face a trade-off: they can reduce unemployment below the natural rate in the short run, but only at the cost of higher inflation. Conversely, they can reduce inflation below expected levels, but only at the cost of higher unemployment. However, this trade-off exists only in the short run. In the long run, expectations adjust, and the economy returns to the natural rate of unemployment regardless of inflation. The SRPC is a key tool for understanding the dynamics of inflation and unemployment and for analyzing the effects of monetary and fiscal policy.",
        
        "context": "The Phillips Curve is named after A.W. Phillips, who in 1958 documented an inverse relationship between wage inflation and unemployment in the United Kingdom from 1861-1957. Later economists extended this to price inflation. In the 1960s, policymakers believed the trade-off was stable and could be exploited. However, the stagflation of the 1970s—high inflation and high unemployment simultaneously—showed that the relationship could shift. Milton Friedman and Edmund Phelps argued that the trade-off exists only in the short run; in the long run, the Phillips Curve is vertical at the natural rate of unemployment. This insight, now standard, earned Phelps the Nobel Prize. In AP Macroeconomics, the short-run Phillips Curve is essential for analyzing policy trade-offs and for understanding the dynamics of inflation and unemployment.",
        
        "image": {
          "src": "images/unit8/srpc_equation.png",
          "alt": "Graph showing SRPC with equation and labeled axes, showing natural rate of unemployment",
          "caption": "Figure 8.1.3: The short-run Phillips Curve equation: $\pi = \pi^e - \beta(u - u_n) + v$. The curve shifts with expected inflation and supply shocks."
        }
      },

      "classifications": [
        {
          "type": "Movement Along the SRPC",
          "value": "Changes in aggregate demand cause movements along the curve",
          "characteristics": ["Caused by AD shifts", "Inflation and unemployment move in opposite directions", "Expected inflation unchanged", "Position of curve fixed", "Temporary effect"],
          "behavior": "Movements along the short-run Phillips Curve are caused by changes in aggregate demand. When aggregate demand increases (e.g., from expansionary monetary or fiscal policy), the economy moves up along the SRPC: unemployment falls, inflation rises. When aggregate demand decreases, the economy moves down along the SRPC: unemployment rises, inflation falls. These movements occur because the position of the SRPC—determined by expected inflation and supply shocks—is fixed in the short run. The magnitude of the movement depends on the slope of the SRPC, which reflects how strongly inflation responds to changes in unemployment. Movements along the SRPC represent the short-run trade-off: policymakers can temporarily reduce unemployment by accepting higher inflation, or reduce inflation by accepting higher unemployment.",
          
          "image": {
            "src": "images/unit8/srpc_movement.png",
            "alt": "SRPC graph showing arrow moving up and down along the curve",
            "caption": "Figure 8.1.4: Movements along the SRPC occur when aggregate demand changes. AD increase moves up (lower u, higher $\pi$); AD decrease moves down."
          },
          
          "examples": [
            {
              "process": "Expansionary policy",
              "explanation": "The Fed cuts interest rates, increasing aggregate demand. Unemployment falls from 6% to 4%, inflation rises from 2% to 4%. This is a movement along the SRPC."
            },
            {
              "process": "Contractionary policy",
              "explanation": "The Fed raises rates to fight inflation. Unemployment rises from 4% to 6%, inflation falls from 4% to 2%. A movement down along the SRPC."
            }
          ]
        },
        {
          "type": "Shifts of the SRPC",
          "value": "Changes in expected inflation or supply shocks shift the curve",
          "characteristics": ["Caused by expectations changes", "Caused by supply shocks", "Same unemployment rate can have different inflation rates", "Position of curve changes", "Can worsen or improve trade-off"],
          "behavior": "The short-run Phillips Curve can shift due to two main factors: changes in expected inflation and supply shocks. (1) Changes in expected inflation: If people expect higher inflation, they will demand higher wages, and firms will raise prices more. This shifts the SRPC upward—at every unemployment rate, inflation is higher. If expected inflation falls, the SRPC shifts downward. Expected inflation is influenced by past inflation, central bank credibility, and policy announcements. (2) Supply shocks: A negative supply shock (e.g., oil price increase) shifts the SRPC upward—inflation rises at every unemployment rate. A positive supply shock (e.g., productivity improvement) shifts it downward. Supply shocks directly affect inflation independently of demand conditions. When the SRPC shifts, the trade-off facing policymakers changes. An upward shift means that reducing unemployment below the natural rate causes even higher inflation; a downward shift means lower inflation for any given unemployment rate.",
          
          "image": {
            "src": "images/unit8/srpc_shifts.png",
            "alt": "SRPC graph showing curve shifting up (higher expected inflation or negative supply shock) and down (lower expected inflation or positive supply shock)",
            "caption": "Figure 8.1.5: Shifts of the SRPC occur when expected inflation changes or supply shocks occur."
          },
          
          "examples": [
            {
              "process": "1970s oil shocks",
              "explanation": "Negative supply shocks from OPEC oil price increases shifted the SRPC upward, causing stagflation—higher inflation and higher unemployment simultaneously."
            },
            {
              "process": "Anchored expectations",
              "explanation": "In the 1990s and 2000s, well-anchored inflation expectations kept the SRPC stable, allowing low unemployment without rising inflation."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Short-Run Phillips Curve Shows the Trade-off from Demand Changes",
          "statement": "The short-run Phillips Curve illustrates the inverse relationship between inflation and unemployment that results from changes in aggregate demand. When aggregate demand increases, firms increase production and hire more workers, reducing unemployment. But as the economy approaches capacity, firms also raise prices, increasing inflation. When aggregate demand decreases, firms reduce production and lay off workers, increasing unemployment, and they reduce price increases, lowering inflation. This demand-driven trade-off means that policymakers face a choice: they can stimulate demand to reduce unemployment, but at the cost of higher inflation; they can restrain demand to reduce inflation, but at the cost of higher unemployment. The steepness of the SRPC determines how much inflation changes for a given change in unemployment—a steeper curve means inflation is more sensitive to unemployment changes.",
          "application": "When analyzing the effects of demand-side policies, use the SRPC to predict the inflation-unemployment outcome. Expansionary policy moves the economy up along the SRPC (lower u, higher $\pi$). Contractionary policy moves it down (higher u, lower $\pi$). The magnitude depends on the slope.",
          "example": "In the late 1990s, strong demand from the tech boom pushed unemployment down to 4% without much inflation rise—the SRPC was relatively flat. In the 1970s, small changes in unemployment were associated with large inflation changes—the SRPC was steeper.",
          
          "image": {
            "src": "images/unit8/srpc_tradeoff.png",
            "alt": "SRPC graph highlighting the trade-off: moving to lower u increases $\pi$, moving to lower $\pi$ increases u",
            "caption": "Figure 8.1.6: The SRPC illustrates the policy trade-off: lower unemployment comes with higher inflation, and vice versa."
          }
        },
        {
          "principle": "Expected Inflation Determines the Position of the SRPC",
          "statement": "The short-run Phillips Curve is not fixed—its position depends on what people expect inflation to be. If people expect higher inflation, they will incorporate those expectations into wage demands and price-setting behavior. Workers demand higher wages to compensate for expected inflation; firms raise prices more to cover higher wage costs. This shifts the SRPC upward—at every unemployment rate, actual inflation is higher. If expected inflation falls, the SRPC shifts downward. Expected inflation is influenced by past inflation (adaptive expectations) and by central bank credibility and policy announcements (rational expectations). When the central bank is credible and commits to low inflation, expectations become anchored, keeping the SRPC stable. When credibility is lost, expectations can become unanchored, causing the SRPC to shift.",
          "application": "When evaluating policy, consider the role of expectations. If the Fed is credible, expansionary policy may not shift expectations much, so the SRPC remains stable. If credibility is low, expansionary policy may raise expected inflation, shifting the SRPC upward and worsening the trade-off.",
          "example": "In the 1970s, repeated inflation eroded Fed credibility. Expectations became unanchored, and the SRPC shifted upward. By the 1990s, the Fed had rebuilt credibility, expectations became anchored around 2%, and the SRPC stabilized.",
          
          "image": {
            "src": "images/unit8/srpc_expectations.png",
            "alt": "SRPC graph showing upward shift with higher expected inflation",
            "caption": "Figure 8.1.7: Higher expected inflation shifts the SRPC upward; lower expected inflation shifts it downward."
          }
        },
        {
          "principle": "Supply Shifts the SRPC Independently of Demand",
          "statement": "Not all changes in inflation come from demand. Supply shocks—events that directly affect production costs or capacity—can shift the short-run Phillips Curve independently of demand conditions. A negative supply shock (oil price spike, crop failure, pandemic disruption) increases costs, forcing firms to raise prices even if demand hasn't changed. This shifts the SRPC upward: at every unemployment rate, inflation is higher. A positive supply shock (productivity improvement, technology breakthrough, falling commodity prices) reduces costs, shifting the SRPC downward. Supply shocks create policy dilemmas because they cause both higher inflation and higher unemployment (stagflation) or lower inflation and lower unemployment simultaneously. Standard demand-side policies cannot address both problems at once.",
          "application": "When analyzing inflation, distinguish between demand-driven and supply-driven inflation. Demand-driven inflation is associated with low unemployment (movement along SRPC). Supply-driven inflation can occur with any unemployment rate and shifts the SRPC. This distinction is crucial for policy.",
          "example": "The 1970s oil shocks shifted the SRPC upward, causing stagflation. The 2021-22 supply chain disruptions and energy price increases also shifted the SRPC upward, contributing to high inflation even as unemployment fell.",
          
          "image": {
            "src": "images/unit8/srpc_supply_shock.png",
            "alt": "SRPC graph showing upward shift from negative supply shock, with both inflation and unemployment higher",
            "caption": "Figure 8.1.8: Negative supply shocks shift the SRPC upward, causing higher inflation at every unemployment rate."
          }
        },
        {
          "principle": "The Short-Run Trade-off Is Temporary",
          "statement": "The inverse relationship between inflation and unemployment shown by the SRPC exists only in the short run. In the long run, after expectations fully adjust, there is no trade-off—the economy returns to the natural rate of unemployment regardless of the inflation rate. This is the concept of the vertical long-run Phillips Curve. If policymakers try to keep unemployment below the natural rate by stimulating demand, inflation will rise. Eventually, expectations adjust upward, shifting the SRPC up, and the economy returns to the natural rate at a higher inflation rate. The temporary nature of the trade-off means that policymakers cannot permanently buy lower unemployment with higher inflation. Attempts to do so lead only to ever-accelerating inflation. This insight, from Friedman and Phelps, revolutionized macroeconomic thinking and led to the emphasis on central bank credibility and inflation expectations.",
          "application": "When evaluating policy, remember that the short-run trade-off is temporary. Stimulus can temporarily reduce unemployment below the natural rate, but only at the cost of higher inflation that will persist even after unemployment returns to normal. This is why the Fed focuses on the long run and on anchoring expectations.",
          "example": "In the late 1960s, policymakers tried to keep unemployment below the natural rate. Inflation rose from 1% to 5%, and expectations eventually adjusted. By the 1970s, unemployment was back to the natural rate, but inflation remained high—the temporary trade-off had disappeared, leaving only higher inflation.",
          
          "image": {
            "src": "images/unit8/srpc_temporary.png",
            "alt": "Graph showing movement along SRPC, then SRPC shifting up as expectations adjust, returning to natural rate at higher inflation",
            "caption": "Figure 8.1.9: The short-run trade-off is temporary. As expectations adjust, the SRPC shifts, and the economy returns to the natural rate."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Inflation from the Phillips Curve Equation",
          
          "image": {
            "src": "images/unit8/srpc_calc.png",
            "alt": "Phillips Curve equation with variables",
            "caption": "Figure 8.1.10: Use the Phillips Curve equation to calculate inflation."
          },
          
          "problem": "The Phillips Curve is given by: $\pi = \pi^e - 0.5(u - u_n) + v$. The natural rate of unemployment is 5%. Expected inflation is 2%. There are no supply shocks ($v = 0$). a) If actual unemployment is 4%, what is inflation? b) If actual unemployment is 6%, what is inflation? c) If expected inflation rises to 4% and unemployment is at the natural rate, what is inflation? d) If a negative supply shock occurs with $v = 2$, unemployment is at the natural rate, and expected inflation is 2%, what is inflation? e) Graph the SRPC for expected inflation of 2% and 4%, showing the points from (a), (b), and (c).",
          
          "step_by_step": [
            {
              "step": "Calculate for u = 4%",
              "explanation": "$\pi = 2 - 0.5(4 - 5) + 0 = 2 - 0.5(-1) = 2 + 0.5 = 2.5\%$."
            },
            {
              "step": "Calculate for u = 6%",
              "explanation": "$\pi = 2 - 0.5(6 - 5) + 0 = 2 - 0.5(1) = 2 - 0.5 = 1.5\%$."
            },
            {
              "step": "Calculate with higher expected inflation",
              "explanation": "$\pi^e = 4$, $u = u_n = 5$, so $\pi = 4 - 0.5(0) + 0 = 4\%$."
            },
            {
              "step": "Calculate with supply shock",
              "explanation": "$\pi^e = 2$, $u = u_n = 5$, $v = 2$, so $\pi = 2 - 0.5(0) + 2 = 4\%$."
            },
            {
              "step": "Graph",
              "explanation": "Draw two SRPCs: SRPC1 at $\pi^e = 2$ passes through (5%, 2%), (4%, 2.5%), (6%, 1.5%). SRPC2 at $\pi^e = 4$ is parallel and shifted up by 2 percentage points, passing through (5%, 4%)."
            }
          ],
          
          "final_answer": "a) 2.5%. b) 1.5%. c) 4%. d) 4%. e) Graphs as described.",
          "concept_applied": "The Phillips Curve equation shows how inflation depends on expected inflation, the unemployment gap, and supply shocks."
        },
        {
          "title": "Linking AD-AS to the Phillips Curve",
          
          "image": {
            "src": "images/unit8/ad_as_to_phillips.png",
            "alt": "AD-AS graph and corresponding Phillips Curve graph side by side",
            "caption": "Figure 8.1.11: Show the relationship between the AD-AS model and the Phillips Curve."
          },
          
          "problem": "The economy is initially in long-run equilibrium at potential GDP with inflation at 2% and unemployment at 5% (natural rate). The Fed then implements expansionary monetary policy, increasing aggregate demand. a) Show the short-run effects on an AD-AS graph. b) Show the corresponding movement on a Phillips Curve graph. c) What happens to unemployment and inflation in the short run? d) In the long run, after expectations adjust, what happens to the Phillips Curve and to unemployment and inflation? e) Explain why the short-run trade-off disappears in the long run.",
          
          "step_by_step": [
            {
              "step": "AD-AS short-run effect",
              "explanation": "Draw AD-AS with LRAS at potential, SRAS upward sloping, AD1 intersecting at potential with price level P1. Expansionary policy shifts AD right to AD2. New short-run equilibrium at higher output (above potential) and higher price level P2."
            },
            {
              "step": "Phillips Curve short-run effect",
              "explanation": "Draw SRPC1 at expected inflation 2%. Initial point at natural rate (5% u, 2% $\pi$). Expansionary policy moves economy along SRPC1 to lower unemployment (say 4%) and higher inflation (say 3%)."
            },
            {
              "step": "Short-run outcomes",
              "explanation": "Unemployment falls below natural rate; inflation rises above expected level. This is the short-run trade-off."
            },
            {
              "step": "Long-run adjustment",
              "explanation": "With unemployment below natural rate, inflation persists above expectations. Eventually, expectations adjust upward. SRPC shifts up to SRPC2 at higher expected inflation. The economy returns to natural rate unemployment but at higher inflation (say 4%). In AD-AS, SRAS shifts left as wages rise, returning output to potential at higher price level."
            },
            {
              "step": "Why trade-off disappears",
              "explanation": "In the long run, expectations fully adjust to actual inflation. Once expectations adjust, unemployment returns to natural rate regardless of inflation. The only permanent effect is higher inflation."
            }
          ],
          
          "final_answer": "a) AD right, output up, prices up. b) Move up along SRPC. c) u down, $\pi$ up. d) SRPC shifts up, u returns to natural rate, $\pi$ higher. e) Expectations adjust, eliminating temporary trade-off.",
          "concept_applied": "The short-run Phillips Curve is linked to the AD-AS model. Policy moves along SRPC in short run; expectations shifts SRPC in long run."
        },
        {
          "title": "Analyzing Supply Shocks with the Phillips Curve",
          
          "image": {
            "src": "images/unit8/supply_shock_phillips.png",
            "alt": "Phillips Curve graph showing shift from supply shock",
            "caption": "Figure 8.1.12: Analyze the effects of a supply shock on the Phillips Curve."
          },
          
          "problem": "An oil price shock increases energy costs across the economy. The economy was initially in long-run equilibrium with unemployment at the natural rate (5%) and inflation at 2%. a) Using the Phillips Curve equation, what happens to inflation if the shock is represented by $v = 3$ and unemployment remains at 5% initially? b) What happens to the SRPC? c) If the Fed does nothing, what will happen to unemployment and inflation in the short run? (Hint: The shock also reduces aggregate supply, affecting output and unemployment.) d) What policy dilemma does this create? e) How might the Fed respond, and what would be the trade-offs?",
          
          "step_by_step": [
            {
              "step": "Initial effect from equation",
              "explanation": "With $u = u_n$, $\pi^e = 2$, $v = 3$, $\pi = 2 + 3 = 5\%$. The shock directly raises inflation by 3 percentage points even without any change in unemployment."
            },
            {
              "step": "SRPC shift",
              "explanation": "The SRPC shifts upward by the amount of the supply shock. At every unemployment rate, inflation is 3 percentage points higher."
            },
            {
              "step": "Short-run adjustment with no policy",
              "explanation": "The supply shock also reduces aggregate supply, shifting SRAS left. In AD-AS, this causes output to fall (unemployment rises) and prices to rise further. So the economy moves to higher unemployment AND higher inflation—stagflation. This is a movement along the new SRPC to a point with higher u and higher $\pi$."
            },
            {
              "step": "Policy dilemma",
              "explanation": "Standard demand-side policies cannot solve both problems. Expansionary policy to reduce unemployment would worsen inflation. Contractionary policy to reduce inflation would worsen unemployment. The Fed faces a painful trade-off."
            },
            {
              "step": "Policy options",
              "explanation": "The Fed could: (1) Do nothing and accept stagflation, hoping supply adjusts. (2) Tighten policy to reduce inflation, accepting even higher unemployment. (3) Ease policy to reduce unemployment, accepting even higher inflation. (4) Use supply-side policies (outside Fed's control) to address the shock directly. There's no good option."
            }
          ],
          
          "final_answer": "a) Inflation rises to 5% at same u. b) SRPC shifts up. c) u rises, $\pi$ rises further (stagflation). d) Dilemma: fighting one worsens the other. e) All options involve trade-offs.",
          "concept_applied": "Supply shocks shift the SRPC and create stagflation, forcing policymakers to choose between fighting inflation or unemployment."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Initial Long-Run Equilibrium",
          "description": "The economy is at potential GDP with unemployment at the natural rate and inflation at expected levels.",
          "mechanism": "AD and SRAS intersect at LRAS. On the Phillips Curve, the economy is at the natural rate with inflation equal to expected inflation.",
          "result": "Stable equilibrium.",
          
          "image": {
            "src": "images/unit8/srpc_step1.png",
            "alt": "AD-AS and Phillips Curve graphs showing initial equilibrium at natural rate",
            "caption": "Figure 8.1.13: Step 1 - Economy in long-run equilibrium with u = u_n and $\pi = \pi^e$."
          }
        },
        {
          "step": 2,
          "process": "Aggregate Demand Shifts",
          "description": "Expansionary or contractionary policy shifts aggregate demand.",
          "mechanism": "Expansionary policy shifts AD right; contractionary policy shifts AD left. In the short run, the economy moves along SRAS.",
          "result": "Output and price level change.",
          
          "image": {
            "src": "images/unit8/srpc_step2.png",
            "alt": "AD-AS graph showing AD shift right or left",
            "caption": "Figure 8.1.14: Step 2 - Policy shifts AD, moving the economy along SRAS."
          }
        },
        {
          "step": 3,
          "process": "Movement Along SRPC",
          "description": "The change in output and prices translates into a movement along the short-run Phillips Curve.",
          "mechanism": "Higher AD means higher output (lower unemployment) and higher inflation—movement up SRPC. Lower AD means lower output (higher unemployment) and lower inflation—movement down SRPC.",
          "result": "New short-run equilibrium with different u and $\pi$.",
          
          "image": {
            "src": "images/unit8/srpc_step3.png",
            "alt": "Phillips Curve graph showing movement up or down along SRPC",
            "caption": "Figure 8.1.15: Step 3 - The change in AD causes a movement along the SRPC."
          }
        },
        {
          "step": 4,
          "process": "Expectations Adjust (Long Run)",
          "description": "If inflation differs from expected inflation, expectations gradually adjust.",
          "mechanism": "Workers demand higher wages; firms raise prices more. Expected inflation rises (if actual > expected) or falls (if actual < expected). This shifts the SRPC.",
          "result": "SRPC shifts up or down.",
          
          "image": {
            "src": "images/unit8/srpc_step4.png",
            "alt": "Phillips Curve graph showing SRPC shifting up as expectations adjust",
            "caption": "Figure 8.1.16: Step 4 - If inflation differs from expectations, the SRPC shifts as expectations adjust."
          }
        },
        {
          "step": 5,
          "process": "Return to Natural Rate",
          "description": "The economy returns to the natural rate of unemployment, but at a new inflation rate consistent with the new expected inflation.",
          "mechanism": "The adjustment continues until unemployment returns to natural rate and inflation equals expected inflation. In the long run, no trade-off remains.",
          "result": "Long-run equilibrium at natural rate.",
          
          "image": {
            "src": "images/unit8/srpc_step5.png",
            "alt": "Phillips Curve graph showing final equilibrium at natural rate with higher inflation",
            "caption": "Figure 8.1.17: Step 5 - In the long run, the economy returns to natural rate at new inflation level."
          }
        }
      ],

      "image": {
        "src": "images/unit8/srpc_summary.png",
        "alt": "Comprehensive summary diagram of short-run Phillips Curve: movements, shifts, expectations, supply shocks, and long-run adjustment",
        "caption": "Figure 8.1.18: Short-run Phillips Curve summary - movements along the curve, shifts from expectations and supply shocks, and long-run adjustment."
      }
    }
  ],

  "key_terms": [
    "Phillips Curve",
    "Short-run Phillips Curve (SRPC)",
    "Long-run Phillips Curve (LRPC)",
    "Inflation rate",
    "Unemployment rate",
    "Natural rate of unemployment",
    "Expected inflation",
    "Adaptive expectations",
    "Rational expectations",
    "Supply shocks",
    "Demand shocks",
    "Stagflation",
    "Trade-off",
    "Policy trade-off",
    "Augmented Phillips Curve",
    "Expectations-augmented Phillips Curve",
    "NAIRU (Non-Accelerating Inflation Rate of Unemployment)",
    "Cyclical unemployment",
    "Inflationary gap",
    "Recessionary gap",
    "Aggregate demand",
    "Aggregate supply",
    "Cost-push inflation",
    "Demand-pull inflation",
    "Sacrifice ratio",
    "Disinflation",
    "Deflation",
    "Inflation expectations",
    "Anchored expectations",
    "Credibility",
    "Central bank credibility",
    "Friedman-Phelps analysis",
    "Monetary neutrality",
    "Vertical long-run Phillips Curve",
    "Hysteresis"
  ],

  "summary": "The short-run Phillips Curve (SRPC) illustrates the inverse relationship between the inflation rate and the unemployment rate that exists in the short run. When aggregate demand increases, unemployment falls and inflation rises; when aggregate demand decreases, unemployment rises and inflation falls. This trade-off arises because changes in aggregate demand move the economy along the short-run aggregate supply curve. The SRPC is downward sloping. Its position depends on expected inflation and supply shocks. The augmented Phillips Curve equation is $\pi = \pi^e - \beta(u - u_n) + v$, where $\pi$ is actual inflation, $\pi^e$ is expected inflation, $u$ is the unemployment rate, $u_n$ is the natural rate of unemployment, $\beta$ measures the sensitivity of inflation to cyclical unemployment, and $v$ represents supply shocks. When unemployment is below the natural rate ($u < u_n$), actual inflation exceeds expected inflation. When unemployment is above the natural rate, actual inflation is below expected inflation. Movements along the SRPC occur when aggregate demand changes, with expected inflation and supply shocks constant. Shifts of the SRPC occur when expected inflation changes (shifting the curve up or down) or when supply shocks occur (shifting the curve up for negative shocks, down for positive shocks). The short-run trade-off implies that policymakers can temporarily reduce unemployment below the natural rate by accepting higher inflation, or reduce inflation by accepting higher unemployment. However, this trade-off is temporary. In the long run, expectations adjust, shifting the SRPC until the economy returns to the natural rate of unemployment. The long-run Phillips Curve is vertical at the natural rate, showing no permanent trade-off between inflation and unemployment. Supply shocks create particular policy dilemmas because they shift the SRPC and can cause stagflation—simultaneously high inflation and high unemployment. Understanding the short-run Phillips Curve is essential for analyzing the effects of monetary and fiscal policy, for evaluating policy trade-offs, and for understanding the dynamics of inflation and unemployment."
}
