{
  "expanded_description": "Why does the total amount of goods and services demanded in an economy fall when the price level rises? This question might seem backwards—after all, microeconomics tells us that demand for a single product falls when its price rises. But at the macroeconomic level, the relationship between the overall price level and total spending is more complex. The aggregate demand (AD) curve shows the inverse relationship between the price level and the quantity of real GDP demanded. When the price level rises, real GDP demanded falls—not because people want less, but because of three key effects: the wealth effect, the interest rate effect, and the international trade effect. Understanding aggregate demand is essential for analyzing business cycles, inflation, and the effects of monetary and fiscal policy. In this section, we'll break down the components of aggregate demand—consumption, investment, government spending, and net exports—and explore why the AD curve slopes downward. You'll learn how changes in the price level affect spending decisions and how to distinguish movements along the AD curve from shifts of the curve.",
  
  "core_concept": {
    "principle": "Aggregate demand (AD) is the total quantity of goods and services demanded in an economy at different price levels, holding all other factors constant. The aggregate demand curve shows the inverse relationship between the price level and real GDP demanded. This downward slope arises from three effects: (1) The wealth effect: When the price level rises, the real value of money holdings falls, reducing consumer wealth and thus consumption spending; (2) The interest rate effect: Higher price levels increase money demand, raising interest rates, which reduces investment and interest-sensitive consumption; (3) The international trade effect: Higher domestic price levels make domestic goods more expensive relative to foreign goods, reducing exports and increasing imports, thus lowering net exports. The components of aggregate demand are the same as GDP: $AD = C + I + G + NX$, where C is consumption spending by households, I is investment spending by businesses (plus residential construction and inventory changes), G is government purchases of goods and services, and NX is net exports (exports minus imports). Changes in the price level cause movements along the AD curve. Changes in any of the components due to factors other than the price level—consumer confidence, tax policy, technology, foreign income—shift the entire AD curve.",
    
    "explanation": "Imagine you have $\\$1,000$ in your wallet. If the price level doubles, your $\\$1,000$ now buys only half as much. You feel poorer, so you spend less. That's the wealth effect. Now imagine businesses want to borrow to invest in new equipment. When the price level rises, people need more money for transactions, so they borrow more or sell bonds, driving up interest rates. Higher interest rates make borrowing more expensive, so businesses invest less. That's the interest rate effect. Finally, suppose the U.S. price level rises while other countries' prices stay constant. American goods become more expensive to foreigners, so exports fall. Foreign goods become cheaper to Americans, so imports rise. Net exports fall. That's the international trade effect. These three effects together explain why the aggregate demand curve slopes downward: higher price level means lower total spending. But the AD curve can also shift. If the government cuts taxes, people have more disposable income and spend more—the entire AD curve shifts right. If businesses become pessimistic about the future, they cut investment—AD shifts left. Understanding these movements and shifts is key to analyzing the economy.",
    
    "image": {
      "src": "images/unit3/ad_curve.png",
      "alt": "Downward-sloping aggregate demand curve with price level on vertical axis and real GDP on horizontal axis",
      "caption": "Figure 3.1.1: The aggregate demand curve slopes downward, showing the inverse relationship between the price level and real GDP demanded."
    }
  },

  "sections": [
    {
      "section_title": "3.1 Aggregate Demand",
      "introduction": "Aggregate demand is the total spending in an economy—the sum of all purchases by households, businesses, government, and foreigners. Understanding aggregate demand is essential for analyzing economic fluctuations, inflation, and the effects of policy. In this section, we'll break down the components of aggregate demand, explore why the AD curve slopes downward, and distinguish between movements along the curve and shifts of the curve. You'll learn how changes in the price level affect spending through the wealth, interest rate, and international trade effects, and how factors like consumer confidence, tax policy, and foreign income can shift the entire AD curve.",
      
      "introduction_image": {
        "src": "images/unit3/ad_components.png",
        "alt": "Pie chart showing components of aggregate demand: C, I, G, NX with typical percentages",
        "caption": "Figure 3.1.2: Aggregate demand is the sum of consumption (C), investment (I), government spending (G), and net exports (NX)."
      },
      
      "key_concept": {
        "definition": "Aggregate demand (AD) is the total quantity of goods and services demanded in an economy at different price levels, ceteris paribus. The AD curve plots this relationship, with the price level (measured by the GDP deflator or CPI) on the vertical axis and real GDP on the horizontal axis. The curve slopes downward because of three effects: (1) Wealth effect: A higher price level reduces the real value of money holdings, decreasing consumer wealth and thus consumption. (2) Interest rate effect: A higher price level increases money demand, raising interest rates, which reduces investment and interest-sensitive consumption. (3) International trade effect: A higher domestic price level makes domestic goods more expensive relative to foreign goods, reducing exports and increasing imports, thus lowering net exports. The components of aggregate demand are the same as GDP: $AD = C + I + G + NX$. Consumption (C) is household spending on goods and services, about 68% of GDP. Investment (I) is business spending on capital goods, residential construction, and inventory changes, about 17% of GDP. Government spending (G) is purchases of goods and services by all levels of government, about 18% of GDP. Net exports (NX) is exports minus imports, typically negative for the U.S. at about -3% of GDP. Changes in the price level cause movements along the AD curve. Changes in any component due to factors other than the price level—such as changes in consumer confidence, tax policy, technology, or foreign income—shift the entire AD curve.",
        
        "context": "The concept of aggregate demand emerged from Keynesian economics during the Great Depression. John Maynard Keynes argued that insufficient aggregate demand caused prolonged unemployment and that government policy could stimulate demand to restore full employment. The AD-AS model, developed in the mid-20th century, became the standard framework for analyzing economic fluctuations and policy. In AP Macroeconomics, aggregate demand is fundamental to understanding business cycles, inflation, and the effects of fiscal and monetary policy. The distinction between movements along the AD curve and shifts of the AD curve is crucial for policy analysis—policies that affect the price level cause movements; policies that affect spending directly cause shifts.",
        
        "image": {
          "src": "images/unit3/ad_curve_explained.png",
          "alt": "AD curve with arrows showing wealth effect, interest rate effect, and international trade effect",
          "caption": "Figure 3.1.3: The AD curve slopes downward due to three effects: wealth, interest rate, and international trade."
        }
      },

      "classifications": [
        {
          "type": "Consumption (C)",
          "value": "Household spending on goods and services",
          "characteristics": ["Largest component (~68% of GDP)", "Relatively stable", "Depends on disposable income", "Affected by wealth and confidence", "Includes durables, nondurables, services"],
          "behavior": "Consumption is the largest and most stable component of aggregate demand. It depends primarily on disposable income—income after taxes. The marginal propensity to consume (MPC) measures how much consumption increases when disposable income rises by $\\$1$. Consumption also depends on household wealth (the wealth effect), consumer confidence, interest rates (for durable goods), and expectations about the future. The consumption function is $C = a + MPC × (Y - T)$, where $a$ is autonomous consumption (independent of income).",
          
          "image": {
            "src": "images/unit3/consumption.png",
            "alt": "Pie chart showing consumption categories: durable goods, nondurable goods, services",
            "caption": "Figure 3.1.4: Consumption includes durable goods (cars, appliances), nondurable goods (food, clothing), and services (healthcare, education)."
          },
          
          "examples": [
            {
              "process": "Durable goods",
              "explanation": "Long-lasting goods like cars, furniture, appliances. Purchases can be delayed, making this component sensitive to interest rates and consumer confidence."
            },
            {
              "process": "Nondurable goods",
              "explanation": "Short-lived goods like food, clothing, gasoline. More stable than durables because these purchases are harder to delay."
            },
            {
              "process": "Services",
              "explanation": "Intangible items like haircuts, medical care, education. The largest and most stable category of consumption."
            }
          ]
        },
        {
          "type": "Investment (I)",
          "value": "Business spending on capital goods, residential construction, inventory changes",
          "characteristics": ["Most volatile component (~17% of GDP)", "Drives business cycles", "Depends on interest rates", "Affected by expectations", "Includes fixed and inventory investment"],
          "behavior": "Investment is the most volatile component of aggregate demand. It includes business fixed investment (machinery, equipment, factories), residential investment (new housing construction), and inventory investment (changes in stocks of goods). Investment depends primarily on the real interest rate (the cost of borrowing), expected future profits (business confidence), and technology. Higher interest rates reduce investment; lower rates stimulate it. Optimistic expectations increase investment; pessimism reduces it. Investment is the key link between financial markets and the real economy.",
          
          "image": {
            "src": "images/unit3/investment.png",
            "alt": "Diagram showing types of investment: business fixed, residential, inventory",
            "caption": "Figure 3.1.5: Investment includes business equipment and structures, residential construction, and changes in inventories."
          },
          
          "examples": [
            {
              "process": "Business fixed investment",
              "explanation": "Firms buy machinery, equipment, computers, and build factories and offices. This expands productive capacity and is sensitive to interest rates and profit expectations."
            },
            {
              "process": "Residential investment",
              "explanation": "Construction of new homes and apartment buildings. Highly sensitive to interest rates (mortgage rates) and demographic trends."
            },
            {
              "process": "Inventory investment",
              "explanation": "Changes in stocks of finished goods, raw materials, and work-in-progress. Can be positive (building inventories) or negative (selling from inventories). Often volatile and driven by unexpected sales changes."
            }
          ]
        },
        {
          "type": "Government Spending (G)",
          "value": "Government purchases of goods and services",
          "characteristics": ["About 18% of GDP", "Includes federal, state, local", "Excludes transfer payments", "Policy-driven", "Less sensitive to market conditions"],
          "behavior": "Government spending includes purchases of goods and services by all levels of government: defense spending, roads and bridges, schools, police, and salaries of public employees. It does NOT include transfer payments like Social Security, unemployment benefits, or welfare—these are transfers of income, not purchases of goods and services. Government spending is determined by policy decisions, not market forces, so it's less sensitive to economic conditions. It can be used as a policy tool (fiscal policy) to stabilize the economy.",
          
          "image": {
            "src": "images/unit3/government_spending.png",
            "alt": "Pie chart showing government spending categories: defense, education, infrastructure, etc.",
            "caption": "Figure 3.1.6: Government spending includes purchases of goods and services at federal, state, and local levels."
          },
          
          "examples": [
            {
              "process": "Federal spending",
              "explanation": "National defense, homeland security, federal highways, NASA, national parks, and salaries of federal employees."
            },
            {
              "process": "State and local spending",
              "explanation": "Education (public schools and universities), police and fire protection, roads and bridges, parks, and sanitation."
            },
            {
              "process": "Excluded transfers",
              "explanation": "Social Security, Medicare, Medicaid, unemployment insurance, and food stamps are transfer payments—they redistribute income but don't directly purchase goods or services, so they're not counted in G."
            }
          ]
        },
        {
          "type": "Net Exports (NX)",
          "value": "Exports minus imports",
          "characteristics": ["Typically negative for U.S. (~-3% of GDP)", "Depends on foreign and domestic income", "Affected by exchange rates", "Volatile", "Links to global economy"],
          "behavior": "Net exports equal exports (goods and services sold to foreigners) minus imports (goods and services bought from foreigners). Exports depend primarily on foreign income and exchange rates—higher foreign income increases demand for U.S. goods; a weaker dollar makes U.S. goods cheaper abroad, increasing exports. Imports depend on domestic income and exchange rates—higher U.S. income increases imports; a stronger dollar makes foreign goods cheaper, increasing imports. Net exports can be positive (trade surplus) or negative (trade deficit).",
          
          "image": {
            "src": "images/unit3/net_exports.png",
            "alt": "Diagram showing exports flowing out, imports flowing in, with net exports calculation",
            "caption": "Figure 3.1.7: Net exports = Exports - Imports. Exports add to AD; imports subtract."
          },
          
          "examples": [
            {
              "process": "Exports",
              "explanation": "U.S. soybeans sold to China, Boeing airplanes sold to European airlines, software and movies sold globally. These add to U.S. aggregate demand."
            },
            {
              "process": "Imports",
              "explanation": "Japanese cars, Korean electronics, Mexican produce, Saudi oil purchased by U.S. residents. These subtract from U.S. aggregate demand because spending leaves the country."
            },
            {
              "process": "Exchange rate effects",
              "explanation": "If the U.S. dollar strengthens (appreciates), U.S. goods become more expensive to foreigners (exports fall) and foreign goods become cheaper to Americans (imports rise), reducing net exports."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The AD Curve Slopes Downward Due to Three Effects",
          "statement": "The aggregate demand curve slopes downward because of the wealth effect, the interest rate effect, and the international trade effect. These effects explain why a higher price level reduces the quantity of real GDP demanded. The wealth effect: When the price level rises, the real value of money holdings falls, reducing consumer wealth and thus consumption. The interest rate effect: A higher price level increases the demand for money, raising interest rates, which reduces investment and interest-sensitive consumption. The international trade effect: A higher domestic price level makes domestic goods more expensive relative to foreign goods, reducing exports and increasing imports, thus lowering net exports. Together, these three effects create the inverse relationship between the price level and real GDP demanded.",
          "application": "When analyzing the economy, remember that changes in the price level affect spending through these channels. If the price level rises, expect consumption, investment, and net exports to fall—but these are movements along the AD curve, not shifts. Policy that affects the price level (like monetary policy) will cause movements along the AD curve. Policy that affects spending directly (like fiscal policy) will shift the curve.",
          "example": "Suppose the price level rises by 10%. Through the wealth effect, households' real wealth falls, so they reduce consumption. Through the interest rate effect, money demand rises, interest rates increase, and businesses cut investment. Through the international trade effect, domestic goods become more expensive abroad, reducing exports, while imports become cheaper, increasing imports. Net exports fall. All three effects reduce real GDP demanded, moving the economy leftward along the AD curve.",
          
          "image": {
            "src": "images/unit3/ad_slope.png",
            "alt": "AD curve with arrows showing each of the three effects contributing to downward slope",
            "caption": "Figure 3.1.8: Three effects cause the AD curve to slope downward: wealth, interest rate, and international trade."
          }
        },
        {
          "principle": "The AD Curve Shifts When Components Change for Reasons Other Than Price Level",
          "statement": "Changes in the price level cause movements along the AD curve. Changes in any component of aggregate demand due to factors other than the price level shift the entire curve. A rightward shift (increase in AD) means more real GDP is demanded at every price level. A leftward shift (decrease in AD) means less real GDP is demanded at every price level. Factors that shift AD include: changes in consumer confidence (affecting C), changes in tax policy (affecting disposable income and thus C), changes in interest rates independent of price level (monetary policy affects I), changes in business confidence (affecting I), changes in government spending (fiscal policy affects G), changes in foreign income (affecting exports), and changes in exchange rates (affecting NX).",
          "application": "When analyzing economic events, ask: Does this change affect spending directly, or does it work through the price level? A tax cut increases disposable income, raising consumption at every price level—AD shifts right. A stock market crash reduces household wealth, reducing consumption—AD shifts left. Foreign recession reduces demand for U.S. exports—AD shifts left. These shifts are the focus of stabilization policy.",
          "example": "Suppose the government cuts personal income taxes. Households have more disposable income, so they spend more at every price level. The entire AD curve shifts right. At the original price level, real GDP demanded is higher. If the economy is in a recession, this can help restore full employment. If the economy is already at full employment, it may cause inflation. The distinction between movements and shifts is crucial for policy analysis.",
          
          "image": {
            "src": "images/unit3/ad_shift.png",
            "alt": "AD curve shifting right and left with arrows showing shift factors",
            "caption": "Figure 3.1.9: AD shifts right when C, I, G, or NX increase for reasons other than price level changes. AD shifts left when they decrease."
          }
        },
        {
          "principle": "Consumption Is the Largest and Most Stable Component of AD",
          "statement": "Consumption accounts for about 68% of GDP in the U.S., making it by far the largest component of aggregate demand. It is also relatively stable compared to investment and net exports. This stability comes from the fact that consumption depends primarily on disposable income, which itself is relatively stable. The marginal propensity to consume (MPC) measures how much consumption changes when disposable income changes—typically between 0.5 and 0.9 in developed economies. Consumption also depends on household wealth, consumer confidence, and interest rates, but these effects are secondary to income.",
          "application": "Because consumption is large and stable, changes in consumption can have significant effects on the economy. Policy that affects disposable income—like tax cuts or transfers—can stimulate consumption and shift AD. Changes in consumer confidence can also affect consumption—during recessions, confidence falls, reducing consumption and worsening the downturn. This is why policymakers关注 consumer sentiment.",
          "example": "During the 2008 financial crisis, household wealth plummeted as housing prices and stock markets crashed. The wealth effect reduced consumption sharply, shifting AD left and deepening the recession. Policy responses included tax rebates and increased transfers to support consumption. The stability of consumption relative to investment meant that consumption fell less than investment, but the drop was still significant.",
          
          "image": {
            "src": "images/unit3/consumption_stability.png",
            "alt": "Graph showing consumption relatively stable compared to volatile investment over time",
            "caption": "Figure 3.1.10: Consumption is the largest and most stable component of AD. Investment is more volatile."
          }
        },
        {
          "principle": "Investment Is the Most Volatile Component and Drives Business Cycles",
          "statement": "Investment accounts for only about 17% of GDP, but it is the most volatile component and the primary driver of business cycles. Investment fluctuates sharply with interest rates, business confidence, and technological change. During expansions, investment grows rapidly as firms expand capacity. During recessions, investment collapses as firms cancel projects and cut spending. This volatility means that changes in investment often lead the economy into and out of recessions. Understanding what drives investment—interest rates, expectations, technology—is key to understanding economic fluctuations.",
          "application": "Policy often targets investment to stabilize the economy. Monetary policy lowers interest rates to stimulate investment during recessions. Fiscal policy may include investment tax credits or accelerated depreciation to encourage business spending. Because investment is volatile, even small changes in policy can have significant effects. Conversely, a collapse in investment can trigger a recession even if other components are stable.",
          "example": "During the 2001 recession, the bursting of the dot-com bubble led to a sharp drop in business investment in technology. The Federal Reserve cut interest rates aggressively, helping to stimulate investment and housing, which led the recovery. During the 2008 financial crisis, investment collapsed as credit froze and businesses canceled projects. It took years for investment to recover, and the recession was correspondingly severe.",
          
          "image": {
            "src": "images/unit3/investment_volatility.png",
            "alt": "Graph showing investment rising and falling sharply with recessions shaded",
            "caption": "Figure 3.1.11: Investment is highly volatile and drives business cycles. It falls sharply during recessions."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Movements Along vs. Shifts of AD",
          
          "image": {
            "src": "images/unit3/ad_movement_shift.png",
            "alt": "AD graph with arrows showing movement along curve and shift of curve",
            "caption": "Figure 3.1.12: Distinguish between movements along AD (due to price level changes) and shifts of AD (due to other factors)."
          },
          
          "problem": "For each of the following events, determine whether it causes a movement along the aggregate demand curve or a shift of the curve. If it shifts, indicate whether AD shifts right or left. a) The price level rises by 5%. b) The government cuts personal income taxes. c) A stock market boom increases household wealth. d) The Federal Reserve raises interest rates to fight inflation. e) A recession in Europe reduces demand for U.S. exports. f) Businesses become optimistic about future profits and increase investment spending. g) The price level falls due to technological progress.",
          
          "step_by_step": [
            {
              "step": "Analyze price level increase",
              "explanation": "A rise in the price level causes a movement along the AD curve—specifically, a decrease in the quantity of real GDP demanded (leftward movement along the curve). This is not a shift because the change is in the price level itself."
            },
            {
              "step": "Analyze tax cut",
              "explanation": "A tax cut increases disposable income, leading to higher consumption at every price level. This shifts the entire AD curve to the right. The change is in a component (C) due to policy, not the price level."
            },
            {
              "step": "Analyze stock market boom",
              "explanation": "Increased household wealth boosts consumption through the wealth effect—but this wealth effect is different from the price-level wealth effect. Higher wealth increases C at every price level, shifting AD right."
            },
            {
              "step": "Analyze Fed rate hike",
              "explanation": "Higher interest rates reduce investment and interest-sensitive consumption. This is a change in I (and perhaps C) due to monetary policy, not the price level, so AD shifts left."
            },
            {
              "step": "Analyze European recession",
              "explanation": "Reduced foreign income lowers demand for U.S. exports, reducing NX at every price level. AD shifts left."
            },
            {
              "step": "Analyze business optimism",
              "explanation": "Increased business confidence raises investment spending at every price level. AD shifts right."
            },
            {
              "step": "Analyze price level fall",
              "explanation": "A fall in the price level causes a movement along the AD curve—an increase in the quantity of real GDP demanded (rightward movement along the curve). This is not a shift."
            }
          ],
          
          "final_answer": "a) Movement along. b) Shift right. c) Shift right. d) Shift left. e) Shift left. f) Shift right. g) Movement along.",
          "concept_applied": "Changes in price level cause movements along AD. Changes in C, I, G, or NX due to other factors shift AD."
        },
        {
          "title": "Calculating Changes in Aggregate Demand Components",
          
          "image": {
            "src": "images/unit3/ad_calculation.png",
            "alt": "Table showing initial AD components and changes",
            "caption": "Figure 3.1.13: Use this data to calculate the new level of aggregate demand."
          },
          
          "problem": "An economy has the following initial aggregate demand components (in billions): Consumption = $\\$5,000$, Investment = $\\$1,500$, Government spending = $\\$1,800$, Exports = $\\$600$, Imports = $\\$700$. Then the following changes occur: Consumer confidence rises, increasing consumption by $\\$200$. Businesses become pessimistic, reducing investment by $\\$150$. The government increases defense spending by $\\$100$. A recession in Asia reduces exports by $\\$50$. The price level remains constant. a) Calculate initial aggregate demand. b) Calculate net exports initially and after the changes. c) Calculate the new level of each component and new aggregate demand. d) Did AD increase or decrease? By how much? e) If the price level had risen during this period, how would that affect your analysis?",
          
          "step_by_step": [
            {
              "step": "Calculate initial AD",
              "explanation": "Initial AD = C + I + G + (X - M) = $5,000 + 1,500 + 1,800 + (600 - 700) = 5,000 + 1,500 + 1,800 - 100 = \\$8,200$ billion."
            },
            {
              "step": "Calculate initial net exports",
              "explanation": "Initial NX = Exports - Imports = $600 - 700 = -\\$100$ billion (trade deficit)."
            },
            {
              "step": "Apply changes to components",
              "explanation": "New C = $5,000 + 200 = \\$5,200$. New I = $1,500 - 150 = \\$1,350$. New G = $1,800 + 100 = \\$1,900$. New Exports = $600 - 50 = \\$550$. Imports unchanged at $\\$700$."
            },
            {
              "step": "Calculate new net exports",
              "explanation": "New NX = $550 - 700 = -\\$150$ billion. Trade deficit worsened by $\\$50$ billion."
            },
            {
              "step": "Calculate new AD",
              "explanation": "New AD = $5,200 + 1,350 + 1,900 + (-150) = 5,200 + 1,350 + 1,900 - 150 = \\$8,300$ billion."
            },
            {
              "step": "Determine change in AD",
              "explanation": "AD increased by $\\$8,300 - \\$8,200 = \\$100$ billion. The increases in C and G outweighed the decreases in I and NX."
            },
            {
              "step": "Consider price level effects",
              "explanation": "If the price level had risen, there would be movements along the AD curve in addition to these shifts. The actual change in real GDP demanded would depend on both the shifts and the price level change. Our calculation shows the shift at a constant price level."
            }
          ],
          
          "final_answer": "a) Initial AD = $\\$8,200$B. b) Initial NX = -$\\$100$B, new NX = -$\\$150$B. c) New C=$\\$5,200$B, I=$\\$1,350$B, G=$\\$1,900$B, NX=-$\\$150$B, AD=$\\$8,300$B. d) AD increased by $\\$100$B. e) Price level change would cause movement along curve in addition to shift.",
          "concept_applied": "AD shifts when components change at a constant price level. The net effect depends on the sum of changes in C, I, G, and NX."
        },
        {
          "title": "The Interest Rate Effect in Action",
          
          "image": {
            "src": "images/unit3/interest_rate_effect.png",
            "alt": "Diagram showing money market and AD curve with interest rate effect",
            "caption": "Figure 3.1.14: The interest rate effect links the money market to aggregate demand."
          },
          
          "problem": "Suppose the price level increases by 10%. Initially, the money supply is $\\$1,000$ billion, and the velocity of money is constant. Real GDP is $\\$5,000$ billion. a) According to the quantity equation ($MV = PY$), what was the initial price level? b) After the price level increases by 10%, what happens to money demand? c) If the money supply is fixed, what happens to interest rates? d) How does this affect investment spending? e) Trace through the full interest rate effect on aggregate demand.",
          
          "step_by_step": [
            {
              "step": "Calculate initial price level",
              "explanation": "Quantity equation: $MV = PY$. With $M = 1,000$, $V$ constant, $Y = 5,000$, we have $1,000V = P × 5,000$. We don't know V, but we can find P relative. Actually, we need another piece. Let's assume V=5 for simplicity. Then $1,000 × 5 = P × 5,000$, so $5,000 = 5,000P$, thus $P = 1$ (price level index = 100)."
            },
            {
              "step": "Determine effect on money demand",
              "explanation": "When the price level rises by 10% to 1.1 (or 110), people need more money for transactions. Nominal GDP rises from $5,000$ to $5,500$. With constant velocity, money demand would need to rise to $M = PY/V = 5,500/5 = 1,100$. So money demand increases by $\\$100$ billion."
            },
            {
              "step": "Analyze interest rate effect with fixed money supply",
              "explanation": "If the money supply is fixed at $\\$1,000$ billion, the increase in money demand creates excess demand for money. People sell bonds to get more money, which lowers bond prices and raises interest rates. Interest rates rise until money demand falls back to equal the fixed supply."
            },
            {
              "step": "Effect on investment",
              "explanation": "Higher interest rates increase the cost of borrowing. Businesses cancel or postpone investment projects. Consumption of durable goods (often financed) also falls. So investment (I) decreases."
            },
            {
              "step": "Trace to aggregate demand",
              "explanation": "The decrease in investment reduces aggregate demand. This is the interest rate effect: higher price level → higher money demand → higher interest rates → lower investment → lower quantity of real GDP demanded. This is one reason the AD curve slopes downward."
            }
          ],
          
          "final_answer": "a) Initial P = 1 (price index 100). b) Money demand increases by $\\$100$B. c) Interest rates rise. d) Investment falls. e) Higher P → higher money demand → higher interest rates → lower I → lower real GDP demanded.",
          "concept_applied": "The interest rate effect links price level changes to money markets and investment, contributing to the downward slope of AD."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Initial Price Level",
          "description": "Start with a given price level (P₀) and the corresponding quantity of real GDP demanded (Y₀) on the AD curve.",
          "mechanism": "The AD curve shows the relationship between P and Y. At P₀, the economy demands Y₀ of real GDP, given by $Y₀ = C(P₀) + I(P₀) + G + NX(P₀)$, where C, I, and NX depend on P through the three effects.",
          "result": "Initial point on AD curve.",
          
          "image": {
            "src": "images/unit3/ad_step1.png",
            "alt": "AD graph with initial point labeled",
            "caption": "Figure 3.1.15: Step 1 - Start with a given price level and corresponding real GDP demanded."
          }
        },
        {
          "step": 2,
          "process": "Apply Wealth Effect",
          "description": "When the price level changes, the real value of money holdings changes, affecting consumer wealth and thus consumption.",
          "mechanism": "Real wealth = Nominal wealth / Price level. If P rises, real wealth falls → consumers feel poorer → consumption falls. If P falls, real wealth rises → consumption rises. This is the wealth effect on consumption.",
          "result": "Change in C due to price level change.",
          
          "image": {
            "src": "images/unit3/ad_step2.png",
            "alt": "Diagram showing wealth effect: higher P reduces real wealth, reducing C",
            "caption": "Figure 3.1.16: Step 2 - Wealth effect: Higher price level reduces real wealth, lowering consumption."
          }
        },
        {
          "step": 3,
          "process": "Apply Interest Rate Effect",
          "description": "When the price level changes, money demand changes, affecting interest rates and thus investment and interest-sensitive consumption.",
          "mechanism": "Higher P → higher money demand (need more money for transactions). With fixed money supply, interest rates rise → cost of borrowing increases → investment falls. Also, consumption of durable goods (often financed) falls. This is the interest rate effect.",
          "result": "Change in I and interest-sensitive C due to price level change.",
          
          "image": {
            "src": "images/unit3/ad_step3.png",
            "alt": "Diagram showing interest rate effect: higher P increases money demand, raising interest rates, reducing I",
            "caption": "Figure 3.1.17: Step 3 - Interest rate effect: Higher price level increases money demand, raising interest rates, reducing investment."
          }
        },
        {
          "step": 4,
          "process": "Apply International Trade Effect",
          "description": "When the domestic price level changes relative to foreign prices, net exports change.",
          "mechanism": "Higher domestic P → domestic goods more expensive relative to foreign goods → exports fall, imports rise → net exports fall. Lower domestic P has opposite effect. This is the international trade effect.",
          "result": "Change in NX due to price level change.",
          
          "image": {
            "src": "images/unit3/ad_step4.png",
            "alt": "Diagram showing international trade effect: higher domestic P reduces exports, increases imports",
            "caption": "Figure 3.1.18: Step 4 - International trade effect: Higher domestic price level reduces net exports."
          }
        },
        {
          "step": 5,
          "process": "Determine New Quantity Demanded",
          "description": "Combine the three effects to find the new quantity of real GDP demanded at the new price level.",
          "mechanism": "The change in real GDP demanded is the sum of the changes in C (wealth effect), I and interest-sensitive C (interest rate effect), and NX (international trade effect). This gives a new point on the same AD curve.",
          "result": "Movement along AD curve to new point.",
          
          "image": {
            "src": "images/unit3/ad_step5.png",
            "alt": "AD graph showing movement along curve from initial to new point",
            "caption": "Figure 3.1.19: Step 5 - The three effects together determine the new quantity demanded, moving along the AD curve."
          }
        }
      ],

      "image": {
        "src": "images/unit3/ad_summary.png",
        "alt": "Comprehensive summary diagram showing AD curve, components, shift factors, and slope effects",
        "caption": "Figure 3.1.20: Aggregate demand summary - components, slope determinants, and shift factors."
      }
    }
  ],

  "key_terms": [
    "Aggregate demand (AD)",
    "Aggregate demand curve",
    "Price level",
    "Real GDP",
    "Wealth effect",
    "Interest rate effect",
    "International trade effect",
    "Consumption (C)",
    "Investment (I)",
    "Government spending (G)",
    "Net exports (NX)",
    "Durable goods",
    "Nondurable goods",
    "Services",
    "Business fixed investment",
    "Residential investment",
    "Inventory investment",
    "Disposable income",
    "Marginal propensity to consume (MPC)",
    "Autonomous consumption",
    "Consumer confidence",
    "Business confidence",
    "Expected future profits",
    "Real interest rate",
    "Nominal interest rate",
    "Money demand",
    "Money supply",
    "Exchange rate",
    "Foreign income",
    "Trade deficit",
    "Trade surplus",
    "Movement along AD curve",
    "Shift of AD curve",
    "Expansionary policy",
    "Contractionary policy",
    "Fiscal policy",
    "Monetary policy",
    "Quantity equation",
    "Velocity of money"
  ],

  "summary": "Aggregate demand (AD) is the total quantity of goods and services demanded in an economy at different price levels. The AD curve slopes downward, showing an inverse relationship between the price level and real GDP demanded. This downward slope results from three effects: (1) The wealth effect: A higher price level reduces the real value of money holdings, decreasing consumer wealth and thus consumption. (2) The interest rate effect: A higher price level increases money demand, raising interest rates, which reduces investment and interest-sensitive consumption. (3) The international trade effect: A higher domestic price level makes domestic goods more expensive relative to foreign goods, reducing exports and increasing imports, thus lowering net exports. The components of aggregate demand are the same as GDP: $AD = C + I + G + NX$. Consumption (C) is household spending on goods and services—the largest and most stable component, about 68% of GDP. Investment (I) is business spending on capital goods, residential construction, and inventory changes—the most volatile component, about 17% of GDP, and a key driver of business cycles. Government spending (G) is purchases of goods and services by all levels of government—about 18% of GDP, determined by policy. Net exports (NX) is exports minus imports—typically negative for the U.S., about -3% of GDP. Changes in the price level cause movements along the AD curve. Changes in any component due to factors other than the price level—such as changes in consumer confidence, tax policy, interest rates (independent of price level), technology, foreign income, or exchange rates—shift the entire AD curve. A rightward shift (increase in AD) means more real GDP is demanded at every price level; a leftward shift (decrease in AD) means less. Understanding aggregate demand is fundamental to analyzing economic fluctuations, inflation, and the effects of fiscal and monetary policy. The AD curve is the demand side of the AD-AS model, which we'll complete with aggregate supply in the following sections."
}
