{
  "expanded_description": "In the short run, output can deviate from its potential due to sticky wages and prices. But in the long run, wages and prices adjust fully, and the economy returns to its productive capacity. This is the realm of long-run aggregate supply (LRAS). The LRAS curve is vertical at potential GDP—the maximum sustainable output the economy can produce when all resources are fully employed. It shows that in the long run, the price level does not affect the quantity of goods and services supplied. Instead, output is determined by the economy's factors of production: labor, capital, natural resources, and technology. Understanding long-run aggregate supply is essential for analyzing economic growth, the natural rate of unemployment, and the effects of policy in the long run. It also explains why there is no permanent tradeoff between inflation and unemployment—the Phillips Curve is vertical in the long run. In this section, we'll explore what determines potential output, why the LRAS curve is vertical, what causes it to shift, and how the economy transitions from short-run to long-run equilibrium. You'll learn to distinguish between factors that affect short-run supply and those that affect long-run productive capacity.",
  
  "core_concept": {
    "principle": "Long-run aggregate supply (LRAS) is the total quantity of goods and services that firms are willing and able to supply when all prices, including wages, are fully flexible and have fully adjusted. The LRAS curve is vertical at potential GDP (also called full-employment output or Y*). This vertical shape reflects the classical dichotomy: in the long run, real variables (output, employment) are independent of nominal variables (the price level). The price level affects only nominal variables, not real output. Potential GDP is determined by the economy's factors of production: (1) The quantity and quality of labor (labor force size, education, skills); (2) The stock of capital (machinery, equipment, infrastructure); (3) Natural resources (land, energy, minerals); (4) Technology and productivity (knowledge, efficiency, innovation). The LRAS curve shifts when any of these factors change. An increase in labor, capital, natural resources, or technology shifts LRAS right, increasing potential output. A decrease shifts LRAS left. Economic growth is the process of the LRAS curve shifting right over time. In the long run, the economy tends to return to potential GDP. If aggregate demand increases, in the short run output may rise above potential, but wages and prices will eventually adjust, shifting SRAS left until output returns to potential at a higher price level. If aggregate demand decreases, the opposite occurs. This self-correcting mechanism means that in the long run, monetary and fiscal policy affect only the price level, not real output.",
    
    "explanation": "Imagine an economy's productive capacity is like a factory's maximum output when running at full capacity with all shifts staffed. That maximum—potential GDP—depends on how many workers there are, how much capital they have, the resources available, and how efficiently they work. The price level doesn't affect this maximum. Whether prices are high or low, the factory can still produce the same number of goods if all resources are employed. That's why the LRAS curve is vertical. Now suppose the factory gets new equipment—capital increases. Potential output rises, and LRAS shifts right. If workers gain new skills—human capital improves—LRAS shifts right. If a war destroys factories, LRAS shifts left. These are the determinants of long-run supply. In the short run, the economy might produce more than potential if demand is strong and wages haven't adjusted yet. But eventually, wages will rise, costs will increase, and firms will cut back to potential. The long run is when all adjustments have happened, and the economy is producing at its sustainable capacity.",
    
    "image": {
      "src": "images/unit3/lras_curve.png",
      "alt": "Vertical long-run aggregate supply curve at potential GDP, with price level on vertical axis and real GDP on horizontal axis",
      "caption": "Figure 3.4.1: The long-run aggregate supply curve is vertical at potential GDP. In the long run, output is independent of the price level."
    }
  },

  "sections": [
    {
      "section_title": "3.4 Long Run Aggregate Supply",
      "introduction": "In the long run, the economy's output is determined not by demand but by its productive capacity—the amount of labor, capital, natural resources, and technology it possesses. This is the domain of long-run aggregate supply (LRAS). The LRAS curve is vertical because, in the long run, the price level does not affect the economy's ability to produce. Understanding LRAS is essential for analyzing economic growth, the natural rate of unemployment, and the limits of monetary and fiscal policy. In this section, we'll explore what determines potential output, why the LRAS curve is vertical, what causes it to shift, and how the economy transitions from short-run to long-run equilibrium.",
      
      "introduction_image": {
        "src": "images/unit3/lras_intro.png",
        "alt": "Graph showing vertical LRAS curve and upward-sloping SRAS curve together",
        "caption": "Figure 3.4.2: The LRAS curve is vertical at potential GDP. SRAS slopes upward in the short run but returns to LRAS in the long run."
      },
      
      "key_concept": {
        "definition": "Long-run aggregate supply (LRAS) is the relationship between the price level and the quantity of real GDP supplied when all prices, including nominal wages, are fully flexible and have fully adjusted. The LRAS curve is vertical at potential GDP (Y*), also called full-employment output. This vertical shape reflects the classical dichotomy: in the long run, real variables are determined by real factors, not nominal ones. Potential GDP is determined by four key factors: (1) Labor: The size and quality of the labor force. More workers and higher skills (human capital) increase potential output. (2) Capital: The stock of physical capital—machinery, equipment, factories, infrastructure. More capital increases productivity and potential output. (3) Natural resources: Land, energy, minerals, and other resources. More abundant resources increase potential output. (4) Technology: Knowledge and efficiency in production. Technological progress increases potential output without using more inputs. The LRAS curve shifts when any of these factors change. Rightward shifts represent economic growth; leftward shifts represent economic decline. In the long run, the economy self-corrects: if output is above potential, wages and prices rise, shifting SRAS left until output returns to potential; if output is below potential, wages and prices fall, shifting SRAS right until output returns to potential. This means that in the long run, monetary and fiscal policy affect only the price level, not real output.",
        
        "context": "The concept of long-run aggregate supply emerged from classical economics and was incorporated into modern macroeconomics through the work of Milton Friedman and Edmund Phelps, who argued that there is no long-run tradeoff between inflation and unemployment. This insight—that the Phillips Curve is vertical in the long run—revolutionized macroeconomic policy. It implies that policymakers cannot permanently reduce unemployment below the natural rate by accepting higher inflation; they can only cause accelerating inflation. In AP Macroeconomics, understanding LRAS is essential for analyzing economic growth, the limits of stabilization policy, and the long-run effects of policy. The distinction between short-run and long-run supply is central to the AD-AS model.",
        
        "image": {
          "src": "images/unit3/lras_determinants.png",
          "alt": "Diagram showing determinants of LRAS: labor, capital, natural resources, technology",
          "caption": "Figure 3.4.3: LRAS is determined by labor, capital, natural resources, and technology. Changes in these factors shift the LRAS curve."
        }
      },

      "classifications": [
        {
          "type": "Labor Force Determinants",
          "value": "Factors affecting the quantity and quality of workers",
          "characteristics": ["Population growth", "Labor force participation rate", "Education and training", "Health and nutrition", "Immigration"],
          "behavior": "The labor force is a key determinant of potential output. More workers mean more output can be produced. Labor force growth comes from population growth, immigration, and changes in participation rates (more people working or seeking work). The quality of labor—human capital—also matters. Education, training, and experience make workers more productive, increasing potential output even without more workers. Investments in human capital shift LRAS right.",
          
          "image": {
            "src": "images/unit3/labor_determinants.png",
            "alt": "Diagram showing labor force growth and human capital development shifting LRAS right",
            "caption": "Figure 3.4.4: Increases in labor quantity or quality shift LRAS right. More workers or more skilled workers increase potential output."
          },
          
          "examples": [
            {
              "process": "Population growth",
              "explanation": "A higher birth rate or increased immigration expands the labor force over time, increasing potential output. LRAS shifts right."
            },
            {
              "process": "Education investment",
              "explanation": "Government funding for schools and universities improves worker skills. More educated workers are more productive, increasing potential output. LRAS shifts right."
            },
            {
              "process": "Labor force participation",
              "explanation": "Policies that encourage more people to work—like childcare subsidies or tax reforms—increase the labor force and potential output. LRAS shifts right."
            }
          ]
        },
        {
          "type": "Capital Stock Determinants",
          "value": "Factors affecting the quantity and quality of physical capital",
          "characteristics": ["Investment in machinery", "Infrastructure spending", "Research and development", "Depreciation", "Capital deepening"],
          "behavior": "The capital stock—machinery, equipment, factories, infrastructure—determines how much each worker can produce. More and better capital increases productivity and potential output. Capital accumulates through investment. When firms buy new equipment or build new factories, the capital stock grows. Government investment in infrastructure (roads, bridges, ports) also adds to the capital stock. Depreciation (wear and tear) reduces the capital stock and must be replaced just to maintain capacity. Capital deepening—increasing capital per worker—is a key source of productivity growth.",
          
          "image": {
            "src": "images/unit3/capital_determinants.png",
            "alt": "Diagram showing investment increasing capital stock, shifting LRAS right",
            "caption": "Figure 3.4.5: Investment in physical capital increases the capital stock, shifting LRAS right. Depreciation shifts LRAS left if not replaced."
          },
          
          "examples": [
            {
              "process": "Business investment",
              "explanation": "Firms invest in new machinery and equipment. This increases the capital stock, making workers more productive. LRAS shifts right."
            },
            {
              "process": "Infrastructure spending",
              "explanation": "Government builds new highways, bridges, and ports. This improves the economy's infrastructure, increasing potential output. LRAS shifts right."
            },
            {
              "process": "Technological embodied capital",
              "explanation": "New capital often embodies new technology. Replacing old machines with newer, more efficient ones increases productivity and shifts LRAS right."
            }
          ]
        },
        {
          "type": "Natural Resources Determinants",
          "value": "Factors affecting availability of land, energy, and raw materials",
          "characteristics": ["Land availability", "Energy resources", "Mineral deposits", "Climate and geography", "Resource discovery"],
          "behavior": "Natural resources—land, energy, minerals, water—affect potential output. More abundant resources increase the economy's productive capacity. New discoveries of oil, minerals, or other resources shift LRAS right. Depletion of resources shifts LRAS left. Improvements in extraction technology can also effectively increase resource availability. Climate and geography matter for agriculture, tourism, and other industries. While natural resources are less important in advanced economies than labor and capital, they still matter, especially for resource-dependent countries.",
          
          "image": {
            "src": "images/unit3/resources_determinants.png",
            "alt": "Diagram showing resource discovery shifting LRAS right, depletion shifting left",
            "caption": "Figure 3.4.6: New resource discoveries shift LRAS right; resource depletion shifts LRAS left."
          },
          
          "examples": [
            {
              "process": "Oil discovery",
              "explanation": "A new oil field is discovered, increasing the country's energy resources. Potential output increases. LRAS shifts right."
            },
            {
              "process": "Resource depletion",
              "explanation": "A coal mine is exhausted, reducing available resources. Potential output decreases. LRAS shifts left."
            },
            {
              "process": "Climate change",
              "explanation": "Long-term climate changes affect agricultural productivity, potentially reducing potential output in affected regions. LRAS may shift left."
            }
          ]
        },
        {
          "type": "Technology Determinants",
          "value": "Factors affecting productivity and efficiency",
          "characteristics": ["Technological progress", "Innovation", "Research and development", "Management practices", "Institutional quality"],
          "behavior": "Technology is the most important source of long-run economic growth. Technological progress allows more output to be produced with the same inputs. It comes from innovation, research and development, and diffusion of new ideas. Better management practices, improved organization, and institutional quality (property rights, rule of law) also affect productivity. Technological progress shifts LRAS right continuously over time, raising living standards. It's the reason economies grow even without increasing labor or capital.",
          
          "image": {
            "src": "images/unit3/technology_determinants.png",
            "alt": "Diagram showing technological progress shifting LRAS right over time",
            "caption": "Figure 3.4.7: Technological progress is the main driver of long-run economic growth, shifting LRAS right over time."
          },
          
          "examples": [
            {
              "process": "Information technology",
              "explanation": "The IT revolution of the late 20th century dramatically increased productivity across many industries. LRAS shifted right."
            },
            {
              "process": "Automation and AI",
              "explanation": "Advances in automation and artificial intelligence are increasing productivity, shifting LRAS right."
            },
            {
              "process": "Better management",
              "explanation": "Improved management practices—like lean manufacturing or quality control—increase output without new inputs, shifting LRAS right."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The LRAS Curve Is Vertical at Potential GDP",
          "statement": "In the long run, the price level does not affect the quantity of goods and services supplied. The LRAS curve is vertical because all prices, including wages, are fully flexible. If the price level rises, all prices—including wages—eventually rise proportionally, leaving real variables (real wages, relative prices, profitability) unchanged. Firms have no incentive to change production. Output remains at potential GDP, determined by the economy's factors of production. This vertical shape embodies the classical dichotomy: nominal variables (price level) do not affect real variables (output) in the long run.",
          "application": "When analyzing the long-run effects of policy, remember that changes in aggregate demand affect only the price level, not output. An increase in the money supply, for example, will eventually lead to higher prices but not higher output. This is why monetary policy is neutral in the long run. The only way to increase output in the long run is to shift LRAS right through policies that increase labor, capital, natural resources, or technology.",
          "example": "Suppose the money supply doubles. In the short run, AD shifts right, output rises above potential, and prices rise. But in the long run, wages and prices adjust fully. SRAS shifts left until output returns to potential. The long-run result is a doubling of the price level, with output unchanged. The LRAS curve is vertical—output is independent of the price level.",
          
          "image": {
            "src": "images/unit3/lras_vertical.png",
            "alt": "AD-AS graph showing AD increase leading to higher prices but same output in long run",
            "caption": "Figure 3.4.8: In the long run, changes in AD affect only the price level, not output. The LRAS curve is vertical."
          }
        },
        {
          "principle": "Economic Growth Shifts LRAS Right",
          "statement": "Long-run economic growth is the process of the LRAS curve shifting right over time. This happens when the economy's factors of production increase: more labor, more capital, more natural resources, or better technology. Growth in potential output determines the long-run trend of the economy—the path around which short-run fluctuations occur. Understanding what shifts LRAS is essential for growth policy. Countries that invest in education, infrastructure, research and development, and institutions that support innovation tend to experience faster LRAS growth and rising living standards.",
          "application": "When evaluating policies for long-run growth, look at their effects on labor, capital, natural resources, and technology. Education spending increases human capital, shifting LRAS right. Investment tax credits encourage capital formation, shifting LRAS right. Research subsidies promote technological progress, shifting LRAS right. Policies that discourage work, investment, or innovation shift LRAS left or slow its growth.",
          "example": "South Korea in the 1960s-1990s experienced rapid LRAS growth through investment in education, high rates of physical capital investment, and technological catch-up. Potential output grew rapidly, shifting LRAS right and raising living standards dramatically. In contrast, countries with stagnant LRAS experience little improvement in living standards even if demand management policies stabilize short-run fluctuations.",
          
          "image": {
            "src": "images/unit3/economic_growth.png",
            "alt": "Graph showing LRAS shifting right over time, with potential GDP increasing",
            "caption": "Figure 3.4.9: Economic growth shifts LRAS right over time. Potential GDP increases as labor, capital, and technology grow."
          }
        },
        {
          "principle": "The Economy Self-Corrects to LRAS in the Long Run",
          "statement": "If short-run output deviates from potential, the economy has a self-correcting mechanism that returns it to LRAS. If output is above potential (positive output gap), unemployment is below the natural rate. Tight labor markets put upward pressure on wages. Higher wages increase costs, shifting SRAS left. Output falls back toward potential, and the price level rises further. If output is below potential (negative output gap), unemployment is above the natural rate. High unemployment puts downward pressure on wages. Lower wages reduce costs, shifting SRAS right. Output rises back toward potential, and the price level falls (or rises more slowly). This self-correction means that in the long run, the economy returns to potential regardless of where it started.",
          "application": "The self-correcting mechanism implies that policymakers don't have to intervene to return the economy to full employment—it will happen on its own, though possibly slowly. This is a key debate in macroeconomics: should policymakers actively stabilize the economy, or should they rely on self-correction? The answer depends on how long the adjustment takes and how costly the deviations are. If wages and prices are very sticky, self-correction may be slow, and active policy may be justified.",
          "example": "During the Great Recession, output fell far below potential. According to the self-correcting mechanism, high unemployment should eventually put downward pressure on wages, shifting SRAS right and returning output to potential. But this process was expected to take years. Policymakers chose to use fiscal and monetary stimulus to speed the return to potential, rather than waiting for self-correction.",
          
          "image": {
            "src": "images/unit3/self_correction.png",
            "alt": "AD-AS graph showing economy above potential, then wages rising shifting SRAS left back to potential",
            "caption": "Figure 3.4.10: The economy self-corrects. Above potential, wages rise, SRAS shifts left; below potential, wages fall, SRAS shifts right."
          }
        },
        {
          "principle": "LRAS Shifts Determine Long-Run Trends; AD Determines Fluctuations",
          "statement": "The AD-AS model distinguishes between long-run trends and short-run fluctuations. LRAS shifts determine the economy's long-run growth path—the trend in potential output. AD and SRAS shifts determine short-run fluctuations around that trend. A useful analogy is a walking person: LRAS is the path they're following; AD and SRAS are the wobbles side to side. Policy has different roles: supply-side policies (education, infrastructure, R&D) aim to shift LRAS right and raise long-run growth. Demand-side policies (fiscal and monetary policy) aim to stabilize short-run fluctuations around the trend.",
          "application": "When analyzing the economy, distinguish between trend and cycle. Is the economy growing below trend because of a temporary demand shortfall (recession) or because potential output growth has slowed? The policy response differs. Demand stimulus can address a recession but cannot fix slow potential growth. Supply-side policies are needed to boost LRAS. This distinction is crucial for policy design.",
          "example": "In the 1970s, potential output growth slowed in many developed countries due to productivity slowdown and oil shocks. This was a supply-side problem, not just a demand shortfall. Policies that focused only on demand stimulus would have caused inflation without addressing the underlying growth problem. In the 1990s, productivity accelerated, shifting LRAS right faster and allowing faster non-inflationary growth.",
          
          "image": {
            "src": "images/unit3/trend_vs_cycle.png",
            "alt": "Graph showing long-run trend of potential GDP and short-run fluctuations around it",
            "caption": "Figure 3.4.11: LRAS shifts determine the long-run trend; AD and SRAS shifts cause fluctuations around the trend."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying LRAS Shift Factors",
          
          "image": {
            "src": "images/unit3/lras_shifts_example.png",
            "alt": "List of events for LRAS shift classification",
            "caption": "Figure 3.4.12: For each event, determine whether LRAS shifts right, left, or stays the same."
          },
          
          "problem": "For each of the following events, determine whether LRAS shifts right, left, or remains unchanged. Explain your reasoning. a) The government invests heavily in education and job training programs. b) A major earthquake destroys factories and infrastructure. c) Immigration increases the labor force significantly. d) A technological breakthrough increases productivity in manufacturing. e) The population ages, and many workers retire. f) The discovery of new oil reserves increases energy resources. g) The central bank increases the money supply. h) New environmental regulations require expensive pollution control equipment that doesn't increase output.",
          
          "step_by_step": [
            {
              "step": "Analyze education investment",
              "explanation": "Education improves worker skills (human capital). This increases productivity and potential output. LRAS shifts right."
            },
            {
              "step": "Analyze earthquake destruction",
              "explanation": "The earthquake destroys physical capital (factories) and infrastructure. This reduces the economy's productive capacity. LRAS shifts left."
            },
            {
              "step": "Analyze immigration increase",
              "explanation": "More workers increase the labor force, expanding productive capacity. LRAS shifts right."
            },
            {
              "step": "Analyze technological breakthrough",
              "explanation": "Technology increases productivity, allowing more output with the same inputs. LRAS shifts right."
            },
            {
              "step": "Analyze population aging and retirements",
              "explanation": "Fewer workers in the labor force reduce productive capacity. LRAS shifts left."
            },
            {
              "step": "Analyze oil discovery",
              "explanation": "New natural resources increase the economy's productive capacity. LRAS shifts right."
            },
            {
              "step": "Analyze money supply increase",
              "explanation": "Monetary policy affects nominal variables, not real factors of production. LRAS is unchanged. This is a demand-side change, not supply-side."
            },
            {
              "step": "Analyze environmental regulations",
              "explanation": "If regulations require resources to be used for pollution control rather than producing output, they may reduce productive capacity. LRAS shifts left (or grows more slowly). However, if they improve health or long-term sustainability, there may be offsetting effects."
            }
          ],
          
          "final_answer": "a) Right. b) Left. c) Right. d) Right. e) Left. f) Right. g) No change. h) Left (or slower growth).",
          "concept_applied": "LRAS shifts when factors of production—labor, capital, natural resources, or technology—change. Demand-side changes do not shift LRAS."
        },
        {
          "title": "Calculating Potential GDP Growth",
          
          "image": {
            "src": "images/unit3/potential_gdp_growth.png",
            "alt": "Table showing growth rates of labor, capital, and productivity",
            "caption": "Figure 3.4.13: Use this data to calculate potential GDP growth."
          },
          
          "problem": "An economy has the following growth rates: Labor force grows at 1% per year. Capital stock grows at 3% per year. Total factor productivity (technology) grows at 1.5% per year. Labor's share of income is 70%, capital's share is 30%. a) Using the growth accounting formula ($\\%\\Delta Y = \\%\\Delta A + \\alpha \\%\\Delta L + (1-\\alpha)\\%\\Delta K$), calculate the growth rate of potential GDP. b) If the labor force growth increases to 2%, what happens to potential GDP growth? c) If productivity growth increases to 2.5%, what happens? d) If the capital stock growth falls to 1%, what happens? e) What policy implications do these calculations suggest?",
          
          "step_by_step": [
            {
              "step": "Apply growth accounting formula",
              "explanation": "Potential GDP growth = Productivity growth + (Labor share × Labor growth) + (Capital share × Capital growth) = $1.5\\% + (0.7 × 1\\%) + (0.3 × 3\\%) = 1.5\\% + 0.7\\% + 0.9\\% = 3.1\\%$."
            },
            {
              "step": "Calculate with higher labor growth",
              "explanation": "Labor growth increases to 2%: $1.5\\% + (0.7 × 2\\%) + (0.3 × 3\\%) = 1.5\\% + 1.4\\% + 0.9\\% = 3.8\\%$."
            },
            {
              "step": "Calculate with higher productivity",
              "explanation": "Productivity growth increases to 2.5%: $2.5\\% + (0.7 × 1\\%) + (0.3 × 3\\%) = 2.5\\% + 0.7\\% + 0.9\\% = 4.1\\%$."
            },
            {
              "step": "Calculate with lower capital growth",
              "explanation": "Capital growth falls to 1%: $1.5\\% + (0.7 × 1\\%) + (0.3 × 1\\%) = 1.5\\% + 0.7\\% + 0.3\\% = 2.5\\%$."
            },
            {
              "step": "Discuss policy implications",
              "explanation": "To increase potential GDP growth, policies should target the factors with the largest impact. Here, productivity growth has the largest coefficient and can be increased through R&D, education, and innovation. Labor growth can be increased through immigration or higher participation. Capital growth can be increased through investment incentives."
            }
          ],
          
          "final_answer": "a) 3.1%. b) 3.8%. c) 4.1%. d) 2.5%. e) Policies to boost productivity, labor force, and investment can increase potential growth.",
          "concept_applied": "Potential GDP growth depends on growth in labor, capital, and productivity. Growth accounting quantifies the contributions of each factor."
        },
        {
          "title": "Long-Run Adjustment to Demand Shock",
          
          "image": {
            "src": "images/unit3/long_run_adjustment.png",
            "alt": "AD-AS graph showing short-run and long-run effects of demand increase",
            "caption": "Figure 3.4.14: An increase in AD raises output above potential in the short run, but wages adjust and output returns to potential in the long run."
          },
          
          "problem": "An economy is initially in long-run equilibrium at potential GDP. The government increases spending significantly, shifting AD right. a) Show the short-run effects on output and the price level using the AD-AS model. b) Describe the adjustment process that returns the economy to long-run equilibrium. c) What are the long-run effects on output and the price level? d) If wages are very sticky, how does this affect the adjustment process? e) How would your answer differ if the shock were a decrease in AD?",
          
          "step_by_step": [
            {
              "step": "Show short-run effects",
              "explanation": "The increase in government spending shifts AD right. In the short run, with sticky wages and prices, the economy moves along the SRAS curve to a new intersection. Output rises above potential, and the price level increases. There's a positive output gap."
            },
            {
              "step": "Describe adjustment process",
              "explanation": "With output above potential, unemployment is below the natural rate. Tight labor markets put upward pressure on wages. As wages rise, firms' costs increase, shifting SRAS left. The price level rises further, and output begins to fall back toward potential. The adjustment continues until SRAS has shifted enough that the economy returns to potential GDP at the intersection of the new AD and the original LRAS."
            },
            {
              "step": "Identify long-run effects",
              "explanation": "In the long run, output returns to potential GDP—unchanged from the initial level. The price level is higher. The only long-run effect of the demand increase is a higher price level."
            },
            {
              "step": "Consider sticky wages",
              "explanation": "If wages are very sticky, the adjustment process takes longer. The economy may remain above potential for an extended period. This is the rationale for active stabilization policy—if self-correction is slow, policy might be needed to return the economy to potential faster."
            },
            {
              "step": "Consider AD decrease",
              "explanation": "If AD decreased, the short-run effect would be output below potential and a lower price level. With output below potential, unemployment above natural rate puts downward pressure on wages. As wages fall, SRAS shifts right, returning output to potential at a lower price level."
            }
          ],
          
          "final_answer": "a) Short run: output above potential, price level higher. b) Wages rise, SRAS shifts left, output returns to potential. c) Long run: output unchanged, price level higher. d) Slower adjustment. e) AD decrease: short-run output below potential, price lower; wages fall, SRAS shifts right, returns to potential at lower price.",
          "concept_applied": "In the long run, the economy returns to potential GDP. Demand shocks affect only the price level in the long run, not output."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Initial LRAS Position",
          "description": "The LRAS curve is vertical at potential GDP, determined by the economy's factors of production: labor, capital, natural resources, and technology.",
          "mechanism": "Potential GDP is the maximum sustainable output when all resources are fully employed. It's not fixed—it grows over time as factors of production increase.",
          "result": "Initial LRAS curve at Y*.",
          
          "image": {
            "src": "images/unit3/lras_step1.png",
            "alt": "LRAS graph showing vertical curve at potential GDP",
            "caption": "Figure 3.4.15: Step 1 - LRAS is vertical at potential GDP, determined by labor, capital, resources, and technology."
          }
        },
        {
          "step": 2,
          "process": "Determine Changes in Factors of Production",
          "description": "LRAS shifts when any of the factors of production change: labor, capital, natural resources, or technology.",
          "mechanism": "Increases in any factor shift LRAS right; decreases shift LRAS left. These changes can be gradual (population growth, capital accumulation) or sudden (resource discovery, natural disaster).",
          "result": "New LRAS position.",
          
          "image": {
            "src": "images/unit3/lras_step2.png",
            "alt": "Diagram showing factors of production and their effects on LRAS",
            "caption": "Figure 3.4.16: Step 2 - Changes in labor, capital, resources, or technology shift LRAS."
          }
        },
        {
          "step": 3,
          "process": "Compare Short-Run Output to Potential",
          "description": "In the short run, output may be above, below, or at potential GDP, depending on AD and SRAS.",
          "mechanism": "If output > potential, there's a positive output gap (inflationary gap). If output < potential, there's a negative output gap (recessionary gap). If output = potential, the economy is in long-run equilibrium.",
          "result": "Identification of output gap.",
          
          "image": {
            "src": "images/unit3/lras_step3.png",
            "alt": "AD-AS graph showing output above, below, and at potential",
            "caption": "Figure 3.4.17: Step 3 - Compare short-run output to potential to identify output gaps."
          }
        },
        {
          "step": 4,
          "process": "Describe Adjustment Process",
          "description": "The economy self-corrects through wage and price adjustments that shift SRAS until output returns to potential.",
          "mechanism": "If output > potential: wages rise, SRAS shifts left, output falls, prices rise further. If output < potential: wages fall, SRAS shifts right, output rises, prices fall. Adjustment continues until output = potential.",
          "result": "Movement back to LRAS.",
          
          "image": {
            "src": "images/unit3/lras_step4.png",
            "alt": "AD-AS graph showing SRAS shifting back to LRAS",
            "caption": "Figure 3.4.18: Step 4 - Wage adjustments shift SRAS until output returns to potential."
          }
        },
        {
          "step": 5,
          "process": "Determine New Long-Run Equilibrium",
          "description": "After full adjustment, the economy is back at potential GDP, but the price level may have changed.",
          "mechanism": "The new long-run equilibrium is at the intersection of AD and LRAS. Output is at potential; the price level depends on the cumulative shifts in AD and SRAS.",
          "result": "Long-run equilibrium with potential output and adjusted price level.",
          
          "image": {
            "src": "images/unit3/lras_step5.png",
            "alt": "AD-AS graph showing new long-run equilibrium at potential with higher price level",
            "caption": "Figure 3.4.19: Step 5 - New long-run equilibrium at potential GDP with adjusted price level."
          }
        }
      ],

      "image": {
        "src": "images/unit3/lras_summary.png",
        "alt": "Comprehensive summary diagram showing LRAS curve, determinants, shifts, and self-correction mechanism",
        "caption": "Figure 3.4.20: Long-run aggregate supply summary - vertical curve, determinants, and role in self-correction."
      }
    }
  ],

  "key_terms": [
    "Long-run aggregate supply (LRAS)",
    "LRAS curve",
    "Potential GDP",
    "Full-employment output",
    "Natural rate of unemployment",
    "Factors of production",
    "Labor force",
    "Human capital",
    "Physical capital",
    "Capital stock",
    "Natural resources",
    "Technology",
    "Productivity",
    "Total factor productivity",
    "Economic growth",
    "Growth accounting",
    "Labor's share",
    "Capital's share",
    "Classical dichotomy",
    "Monetary neutrality",
    "Long-run equilibrium",
    "Short-run equilibrium",
    "Output gap",
    "Positive output gap",
    "Inflationary gap",
    "Negative output gap",
    "Recessionary gap",
    "Self-correction mechanism",
    "Wage adjustment",
    "Price adjustment",
    "Sticky wages",
    "Flexible wages",
    "Long-run Phillips Curve",
    "Supply-side policies",
    "Investment",
    "Depreciation",
    "Capital deepening",
    "Innovation",
    "Research and development",
    "Infrastructure",
    "Education",
    "Training"
  ],

  "summary": "Long-run aggregate supply (LRAS) is the relationship between the price level and the quantity of real GDP supplied when all prices, including wages, are fully flexible and have fully adjusted. The LRAS curve is vertical at potential GDP (full-employment output), reflecting the classical dichotomy: in the long run, real variables are independent of nominal variables. The price level does not affect the economy's productive capacity. Potential GDP is determined by the economy's factors of production: (1) Labor: The size and quality of the workforce. More workers and higher skills increase potential output. (2) Capital: The stock of machinery, equipment, factories, and infrastructure. More capital increases productivity and potential output. (3) Natural resources: Land, energy, minerals. More abundant resources increase potential output. (4) Technology: Knowledge and efficiency in production. Technological progress increases potential output without using more inputs. The LRAS curve shifts right when these factors increase—representing economic growth—and shifts left when they decrease. In the long run, the economy self-corrects: if output is above potential, tight labor markets push wages up, shifting SRAS left until output returns to potential; if output is below potential, high unemployment pushes wages down, shifting SRAS right until output returns to potential. This self-correction means that in the long run, changes in aggregate demand affect only the price level, not real output. Monetary policy is neutral in the long run. The distinction between short-run and long-run supply is crucial for understanding business cycles, inflation, and the limits of stabilization policy. LRAS shifts determine the economy's long-run growth trend; AD and SRAS shifts cause short-run fluctuations around that trend. Policies to increase long-run growth—supply-side policies—focus on increasing labor (education, immigration, participation), capital (investment incentives, infrastructure), and technology (R&D, innovation, institutions). Understanding LRAS is essential for analyzing economic growth, the natural rate of unemployment, and the long-run effects of policy."
}
