{
  "expanded_description": "How do economies experience booms and recessions? What determines whether an economy is operating above or below its potential? The aggregate demand-aggregate supply (AD-AS) model provides the answers. By combining the AD curve, the short-run aggregate supply (SRAS) curve, and the long-run aggregate supply (LRAS) curve, we can analyze the causes and consequences of economic fluctuations. The model shows how shocks to demand or supply affect output, employment, and prices in the short run, and how the economy adjusts back to potential in the long run. It also illustrates the effects of stabilization policy—fiscal and monetary policy aimed at reducing the severity of recessions and controlling inflation. Understanding macroeconomic equilibrium is essential for interpreting economic news, evaluating policy debates, and understanding the business cycle. In this section, we'll explore short-run and long-run equilibrium, output gaps, the adjustment process, and the effects of various shocks and policies. You'll learn to use the AD-AS model to analyze real-world economic events and policy proposals.",
  
  "core_concept": {
    "principle": "Macroeconomic equilibrium occurs at the intersection of aggregate demand and aggregate supply. In the short run, equilibrium is where the AD curve and the SRAS curve intersect, determining the current price level and real GDP. This short-run equilibrium may be at, above, or below potential GDP (LRAS). If above potential, there's an inflationary gap (positive output gap); if below, a recessionary gap (negative output gap); if at potential, long-run equilibrium. In the long run, equilibrium occurs where AD, SRAS, and LRAS all intersect. The economy self-corrects: if there's an inflationary gap, wages rise, SRAS shifts left until output returns to potential; if there's a recessionary gap, wages fall, SRAS shifts right until output returns to potential. This self-correction implies that in the long run, output returns to potential regardless of demand. Shocks to the economy—demand shocks (changes in C, I, G, NX) or supply shocks (changes in input prices, productivity, technology)—cause short-run fluctuations. Policy responses can speed adjustment: expansionary fiscal or monetary policy can close recessionary gaps; contractionary policy can close inflationary gaps. However, policy lags, uncertainty, and supply-side effects complicate implementation. The AD-AS model provides a framework for analyzing these dynamics and evaluating policy options.",
    
    "explanation": "Imagine an economy as a bathtub with water flowing in and out. The water level is output. AD is the faucet—it determines how much demand is coming in. SRAS is the drain—it determines how much supply is flowing out, but the drain size can change temporarily. LRAS is the tub's capacity—the maximum sustainable water level. When the faucet is open wide (high AD) and the drain is partly clogged (sticky prices), water rises above capacity—that's an inflationary gap. When the faucet is turned down (low AD), water falls below capacity—a recessionary gap. Over time, the drain adjusts (wages change) until the water level returns to capacity. If the tub's capacity grows (economic growth), the water level can rise sustainably. Policymakers can adjust the faucet (fiscal and monetary policy) to help stabilize the water level around capacity. The AD-AS model is this simple but powerful framework for understanding the economy's fluctuations and the role of policy.",
    
    "image": {
      "src": "images/unit3/ad_as_model.png",
      "alt": "Complete AD-AS model showing AD, SRAS, and LRAS curves with equilibrium at intersection",
      "caption": "Figure 3.5.1: The AD-AS model combines aggregate demand, short-run aggregate supply, and long-run aggregate supply to determine output and prices."
    }
  },

  "sections": [
    {
      "section_title": "3.5 Macroeconomic Equilibrium",
      "introduction": "The AD-AS model is the workhorse of macroeconomics. It brings together everything we've learned—aggregate demand, short-run aggregate supply, and long-run aggregate supply—to analyze how the economy behaves in the short run and the long run. With this model, we can understand why economies experience booms and recessions, what causes inflation, and how policy can stabilize the economy. In this section, we'll learn to identify short-run and long-run equilibrium, distinguish between recessionary and inflationary gaps, trace the adjustment process, and analyze the effects of demand shocks, supply shocks, and policy responses. By the end, you'll be able to use the AD-AS model to interpret economic events and evaluate policy proposals.",
      
      "introduction_image": {
        "src": "images/unit3/ad_as_intro.png",
        "alt": "Basic AD-AS graph with all three curves labeled",
        "caption": "Figure 3.5.2: The AD-AS model shows short-run equilibrium at AD-SRAS intersection and long-run equilibrium where all three curves meet."
      },
      
      "key_concept": {
        "definition": "Macroeconomic equilibrium in the AD-AS model occurs at the intersection of aggregate demand and aggregate supply. Short-run equilibrium is at the intersection of AD and SRAS, determining the current price level (P) and real GDP (Y). This short-run equilibrium may be at three possible positions relative to long-run aggregate supply (LRAS): (1) Long-run equilibrium: AD and SRAS intersect at LRAS. Y = potential GDP, unemployment = natural rate, no pressure for wages or prices to change. (2) Inflationary gap (positive output gap): AD and SRAS intersect to the right of LRAS. Y > potential GDP, unemployment < natural rate, upward pressure on wages and prices. (3) Recessionary gap (negative output gap): AD and SRAS intersect to the left of LRAS. Y < potential GDP, unemployment > natural rate, downward pressure on wages and prices. In the long run, the economy self-corrects through wage and price adjustments that shift SRAS until output returns to potential. For an inflationary gap, rising wages shift SRAS left, increasing P and decreasing Y back to potential. For a recessionary gap, falling wages shift SRAS right, decreasing P and increasing Y back to potential. Shocks to the economy—demand shocks (changes in C, I, G, NX) or supply shocks (changes in input prices, productivity, technology)—create output gaps and initiate the adjustment process. Policy can be used to close gaps more quickly: expansionary policy (increasing AD) to close recessionary gaps; contractionary policy (decreasing AD) to close inflationary gaps. However, policy lags, uncertainty, and potential side effects complicate implementation.",
        
        "context": "The AD-AS model synthesizes Keynesian and classical insights. In the short run, sticky wages and prices mean that demand shocks affect output—the Keynesian view. In the long run, flexibility means output returns to potential—the classical view. This synthesis, developed in the mid-20th century, became the dominant framework for macroeconomic analysis. It's used by policymakers, forecasters, and economists worldwide to analyze business cycles, inflation, and policy. In AP Macroeconomics, mastering the AD-AS model is essential for understanding economic fluctuations and the effects of fiscal and monetary policy.",
        
        "image": {
          "src": "images/unit3/equilibrium_types.png",
          "alt": "Three AD-AS graphs showing long-run equilibrium, inflationary gap, and recessionary gap",
          "caption": "Figure 3.5.3: Three possible short-run equilibria: at potential (long-run equilibrium), above potential (inflationary gap), and below potential (recessionary gap)."
        }
      },

      "classifications": [
        {
          "type": "Long-Run Equilibrium",
          "value": "Economy at potential GDP with stable prices",
          "characteristics": ["Y = potential GDP", "Unemployment = natural rate", "No output gap", "No pressure for wage/price changes", "AD = SRAS = LRAS"],
          "behavior": "In long-run equilibrium, the economy is producing at its sustainable capacity. All resources are fully employed (with frictional and structural unemployment at natural rate). There's no tendency for wages or prices to rise or fall. The price level is stable. This is the economy's normal state, though shocks constantly push it away. Long-run equilibrium is the anchor to which the economy returns after adjustments.",
          
          "image": {
            "src": "images/unit3/long_run_eq.png",
            "alt": "AD-AS graph showing all three curves intersecting at same point",
            "caption": "Figure 3.5.4: Long-run equilibrium occurs where AD, SRAS, and LRAS all intersect. Output = potential, unemployment = natural rate."
          },
          
          "examples": [
            {
              "process": "Stable growth",
              "explanation": "An economy growing at its potential rate with low, stable inflation is likely near long-run equilibrium. The U.S. in the late 1990s (after the initial recovery) or mid-2010s approximated this state."
            },
            {
              "process": "Neutral policy",
              "explanation": "When the economy is in long-run equilibrium, policy is often neutral—neither stimulating nor contracting demand—aiming to maintain stability."
            }
          ]
        },
        {
          "type": "Inflationary Gap (Positive Output Gap)",
          "value": "Economy producing above potential, overheating",
          "characteristics": ["Y > potential GDP", "Unemployment < natural rate", "Tight labor markets", "Upward wage pressure", "Inflation tends to rise"],
          "behavior": "An inflationary gap occurs when aggregate demand is strong enough to push output above potential. Unemployment falls below the natural rate, creating labor shortages. Firms compete for workers, driving wages up. Higher wages increase costs, leading firms to raise prices. The economy experiences rising inflation. The gap is unsustainable—eventually, rising wages will shift SRAS left, reducing output back to potential, but with a permanently higher price level. Policymakers may try to close the gap with contractionary policy to prevent inflation from accelerating.",
          
          "image": {
            "src": "images/unit3/inflationary_gap.png",
            "alt": "AD-AS graph showing AD and SRAS intersecting to right of LRAS",
            "caption": "Figure 3.5.5: An inflationary gap occurs when output exceeds potential. Unemployment is below natural rate, causing wages and prices to rise."
          },
          
          "examples": [
            {
              "process": "Late 1990s U.S.",
              "explanation": "In the late 1990s, strong demand from the tech boom pushed unemployment below 4%, below most estimates of the natural rate. The Fed worried about inflation and raised interest rates to cool the economy."
            },
            {
              "process": "Post-WWII boom",
              "explanation": "After WWII, pent-up consumer demand and government spending created a large inflationary gap. Inflation rose sharply until wages and prices adjusted."
            },
            {
              "process": "2021-22 recovery",
              "explanation": "Massive fiscal stimulus and rapid recovery from COVID-19 pushed output above potential in 2021-22, contributing to the highest inflation in decades."
            }
          ]
        },
        {
          "type": "Recessionary Gap (Negative Output Gap)",
          "value": "Economy producing below potential, slack",
          "characteristics": ["Y < potential GDP", "Unemployment > natural rate", "Labor market slack", "Downward wage pressure", "Inflation tends to fall"],
          "behavior": "A recessionary gap occurs when aggregate demand is insufficient to sustain production at potential. Unemployment rises above the natural rate, creating labor market slack. Workers compete for scarce jobs, putting downward pressure on wages. Lower wages reduce costs, allowing firms to lower prices. Inflation falls (disinflation) or may even become negative (deflation). The gap creates economic hardship—lost output, unemployment, and suffering. Eventually, falling wages shift SRAS right, increasing output back to potential, but the process can be slow. Policymakers often use expansionary policy to close recessionary gaps more quickly.",
          
          "image": {
            "src": "images/unit3/recessionary_gap.png",
            "alt": "AD-AS graph showing AD and SRAS intersecting to left of LRAS",
            "caption": "Figure 3.5.6: A recessionary gap occurs when output falls below potential. Unemployment is above natural rate, causing wages and prices to fall."
          },
          
          "examples": [
            {
              "process": "Great Recession",
              "explanation": "In 2008-09, the financial crisis caused AD to collapse, creating a massive recessionary gap. Unemployment peaked at 10%, far above the natural rate. Inflation fell, and the Fed feared deflation."
            },
            {
              "process": "COVID-19 recession",
              "explanation": "In early 2020, lockdowns caused AD to plummet, creating a sharp recessionary gap. Unemployment spiked to 14.8%, and inflation initially fell."
            },
            {
              "process": "Early 1980s",
              "explanation": "The Fed's contractionary policy to fight inflation created a deep recessionary gap in 1981-82, with unemployment reaching 10.8%. This brought inflation down from double digits."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Economy Self-Corrects, but Slowly",
          "statement": "The AD-AS model shows that the economy has a built-in self-correcting mechanism. When output is above potential, tight labor markets push wages up, shifting SRAS left until output returns to potential. When output is below potential, high unemployment pushes wages down, shifting SRAS right until output returns to potential. However, this adjustment can be slow—estimates suggest it may take several years for wages to fully adjust. During that time, the economy suffers from either inflation (above potential) or unemployment (below potential). The speed of adjustment depends on wage and price flexibility, which varies across countries and over time. This is the key debate: should policymakers rely on self-correction, or should they actively stabilize the economy?",
          "application": "When evaluating whether to use stabilization policy, consider the speed of self-correction. If wages are very sticky, self-correction will be slow, and active policy may be justified to reduce suffering. If wages are flexible, the economy will adjust quickly, and policy may be unnecessary or even destabilizing. Most economists believe that self-correction is too slow to rely on entirely, especially in deep recessions.",
          "example": "During the Great Depression, the economy did not self-correct for a decade. Wages and prices fell, but output remained far below potential. This experience led Keynes to argue that active policy was necessary. During the 2008 recession, policymakers acted aggressively, fearing that self-correction would be too slow. The recovery was still slow, but faster than in the 1930s.",
          
          "image": {
            "src": "images/unit3/self_correction_speed.png",
            "alt": "Graph showing slow return to potential with sticky wages vs faster return with flexible wages",
            "caption": "Figure 3.5.7: Self-correction can be slow if wages and prices are sticky. This is the rationale for stabilization policy."
          }
        },
        {
          "principle": "Demand Shocks Cause Output to Fluctuate in the Short Run",
          "statement": "Shocks to aggregate demand—changes in consumption, investment, government spending, or net exports—cause short-run fluctuations in output and employment. A positive demand shock (increase in AD) shifts AD right, raising output and prices in the short run, creating an inflationary gap. A negative demand shock (decrease in AD) shifts AD left, reducing output and prices, creating a recessionary gap. These demand shocks are a primary source of business cycles. Examples include changes in consumer confidence (affecting C), changes in business confidence (affecting I), fiscal policy changes (affecting G or taxes), monetary policy changes (affecting interest rates and thus I and C), and changes in foreign demand or exchange rates (affecting NX).",
          "application": "When analyzing economic fluctuations, look for demand-side causes. A sudden drop in consumer confidence or investment spending can trigger a recession. Policy can offset these shocks: expansionary policy can counter negative shocks; contractionary policy can counter positive shocks. The effectiveness of policy depends on timing and magnitude.",
          "example": "The 2008 financial crisis was a massive negative demand shock. Household wealth collapsed, reducing consumption. Business confidence plummeted, reducing investment. AD shifted left sharply, creating a deep recessionary gap. Policy responded with fiscal stimulus and monetary easing to shift AD back right.",
          
          "image": {
            "src": "images/unit3/demand_shocks.png",
            "alt": "AD-AS graph showing AD shifts right and left with effects on output and prices",
            "caption": "Figure 3.5.8: Demand shocks shift AD. Positive shocks create inflationary gaps; negative shocks create recessionary gaps."
          }
        },
        {
          "principle": "Supply Shocks Cause Stagflation and Policy Dilemmas",
          "statement": "Supply shocks—changes in input prices, productivity, or technology—shift SRAS. Adverse supply shocks (higher input prices, natural disasters, pandemics) shift SRAS left, reducing output and raising prices simultaneously—stagflation. Favorable supply shocks (technological breakthroughs, lower input prices) shift SRAS right, raising output and lowering prices. Supply shocks create policy dilemmas because the tools that address one problem worsen the other. Expansionary policy to fight the output loss would worsen inflation; contractionary policy to fight inflation would worsen the output loss. Policymakers must choose which problem to prioritize, or use targeted policies to address the shock directly.",
          "application": "When a supply shock hits, recognize that standard demand management policies cannot solve both problems. Policy may need to focus on mitigating the shock's effects—releasing strategic reserves, providing disaster relief, supporting affected industries—or accept that some combination of inflation and unemployment will persist during adjustment. Understanding supply shocks helps explain episodes like the 1970s stagflation and the 2021-22 inflation.",
          "example": "The 1970s oil shocks shifted SRAS left repeatedly, causing both high inflation and high unemployment. Policymakers struggled, with some favoring expansion to fight unemployment and others favoring contraction to fight inflation. The experience led to new thinking about supply shocks and the limits of demand management.",
          
          "image": {
            "src": "images/unit3/supply_shocks_ad_as.png",
            "alt": "AD-AS graph showing left SRAS shift causing higher prices and lower output",
            "caption": "Figure 3.5.9: Adverse supply shocks shift SRAS left, causing stagflation—higher prices and lower output."
          }
        },
        {
          "principle": "Fiscal and Monetary Policy Can Stabilize the Economy",
          "statement": "The AD-AS model provides the rationale for stabilization policy. If the economy is in a recessionary gap, expansionary fiscal policy (increased G or tax cuts) or expansionary monetary policy (lower interest rates) can shift AD right, moving the economy back toward potential more quickly than waiting for self-correction. If the economy is in an inflationary gap, contractionary policy (reduced G, tax increases, higher interest rates) can shift AD left, reducing inflationary pressure. However, policy has limitations: lags (recognition, implementation, impact), uncertainty about the size of multipliers and the natural rate, and potential side effects (crowding out, inflation expectations). There's also debate about whether policymakers should actively stabilize or follow rules.",
          "application": "When evaluating policy proposals, consider the current output gap and the likely effects of the policy. In a recession, expansionary policy is appropriate; in a boom, contractionary policy. But also consider lags—policy that takes effect after the economy has already recovered may be destabilizing. And consider supply-side effects—some policies (like tax reforms) may affect both AD and LRAS.",
          "example": "In response to the 2008 recession, the U.S. used both fiscal stimulus (the Recovery Act) and monetary policy (near-zero interest rates, quantitative easing) to shift AD right. In response to the 2021-22 inflation surge, the Fed raised interest rates aggressively to shift AD left and reduce inflationary pressure.",
          
          "image": {
            "src": "images/unit3/stabilization_policy.png",
            "alt": "AD-AS graph showing policy shifting AD to close output gaps",
            "caption": "Figure 3.5.10: Stabilization policy shifts AD to close output gaps. Expansionary policy fights recessions; contractionary policy fights inflation."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Output Gaps and Policy Responses",
          
          "image": {
            "src": "images/unit3/output_gaps_example.png",
            "alt": "Three AD-AS graphs showing different equilibrium positions",
            "caption": "Figure 3.5.11: Identify the type of gap in each graph and the appropriate policy response."
          },
          
          "problem": "For each of the following scenarios, identify whether the economy is in long-run equilibrium, an inflationary gap, or a recessionary gap. Then recommend an appropriate policy response (expansionary, contractionary, or neutral). a) Current unemployment is 4%, natural rate is 5%, inflation is rising. b) Current unemployment is 8%, natural rate is 5%, inflation is falling. c) Current unemployment is 5%, natural rate is 5%, inflation is stable. d) Output is $\\$22$ trillion, potential GDP is $\\$21$ trillion. e) Output is $\\$20$ trillion, potential GDP is $\\$21$ trillion.",
          
          "step_by_step": [
            {
              "step": "Analyze scenario a",
              "explanation": "Unemployment (4%) is below natural rate (5%), so economy is above potential. Inflation rising confirms inflationary gap. Policy response: Contractionary policy to reduce AD and cool the economy."
            },
            {
              "step": "Analyze scenario b",
              "explanation": "Unemployment (8%) is above natural rate (5%), so economy is below potential. Inflation falling confirms recessionary gap. Policy response: Expansionary policy to increase AD and stimulate the economy."
            },
            {
              "step": "Analyze scenario c",
              "explanation": "Unemployment equals natural rate, inflation stable. Economy is in long-run equilibrium. Policy response: Neutral—no need for stabilization policy. Focus on long-run growth."
            },
            {
              "step": "Analyze scenario d",
              "explanation": "Output ($\\$22$T) exceeds potential ($\\$21$T), so positive output gap (inflationary gap). Policy response: Contractionary policy."
            },
            {
              "step": "Analyze scenario e",
              "explanation": "Output ($\\$20$T) is below potential ($\\$21$T), so negative output gap (recessionary gap). Policy response: Expansionary policy."
            }
          ],
          
          "final_answer": "a) Inflationary gap, contractionary policy. b) Recessionary gap, expansionary policy. c) Long-run equilibrium, neutral policy. d) Inflationary gap, contractionary. e) Recessionary gap, expansionary.",
          "concept_applied": "Output gaps are identified by comparing actual unemployment to natural rate or actual output to potential. Policy should be countercyclical: expansionary in recessions, contractionary in booms."
        },
        {
          "title": "Analyzing a Demand Shock",
          
          "image": {
            "src": "images/unit3/demand_shock_example.png",
            "alt": "AD-AS graph showing initial equilibrium and effects of demand shock",
            "caption": "Figure 3.5.12: Trace the effects of a negative demand shock through the AD-AS model."
          },
          
          "problem": "An economy is initially in long-run equilibrium at potential GDP. Consumer confidence plummets due to a stock market crash, reducing consumption spending significantly. a) Using the AD-AS model, show the short-run effects on output and the price level. b) What type of gap emerges? c) Describe the self-correction process that would occur if the government took no action. d) What fiscal policy could the government use to offset the shock? e) What monetary policy could the central bank use?",
          
          "step_by_step": [
            {
              "step": "Show short-run effects",
              "explanation": "The drop in consumption reduces AD, shifting the AD curve left. In the short run, with sticky wages and prices, the economy moves along the SRAS curve to a new intersection. Output falls below potential, and the price level decreases. This is a recessionary gap."
            },
            {
              "step": "Identify the gap",
              "explanation": "Output below potential means a recessionary gap (negative output gap). Unemployment rises above the natural rate."
            },
            {
              "step": "Describe self-correction",
              "explanation": "With output below potential, unemployment is above natural rate. Labor market slack puts downward pressure on wages. As wages fall, firms' costs decrease, shifting SRAS right. Output begins to rise back toward potential, and the price level falls further. The process continues until output returns to potential at a lower price level."
            },
            {
              "step": "Recommend fiscal policy",
              "explanation": "The government could use expansionary fiscal policy: increase government spending, cut taxes, or increase transfer payments. These would increase AD, shifting it right, and could return the economy to potential more quickly."
            },
            {
              "step": "Recommend monetary policy",
              "explanation": "The central bank could use expansionary monetary policy: lower interest rates, which would stimulate investment and interest-sensitive consumption, increasing AD and shifting it right."
            }
          ],
          
          "final_answer": "a) Short run: output falls, price level falls. b) Recessionary gap. c) Wages fall, SRAS shifts right, output returns to potential at lower price level. d) Expansionary fiscal policy (increase G, cut taxes). e) Expansionary monetary policy (lower interest rates).",
          "concept_applied": "Negative demand shocks create recessionary gaps. Policy can offset them by increasing AD; self-correction works through falling wages shifting SRAS."
        },
        {
          "title": "Analyzing a Supply Shock and Policy Dilemma",
          
          "image": {
            "src": "images/unit3/supply_shock_dilemma.png",
            "alt": "AD-AS graph showing left SRAS shift with policy options",
            "caption": "Figure 3.5.13: An adverse supply shock creates stagflation. Policy choices involve tradeoffs."
          },
          
          "problem": "An economy is initially in long-run equilibrium. A sudden increase in oil prices shifts SRAS left. a) Show the short-run effects on output and the price level. b) What is this combination called? c) If policymakers do nothing, describe the self-correction process. d) If policymakers use expansionary policy to return output to potential, what happens to the price level? e) If policymakers use contractionary policy to reduce inflation, what happens to output? f) What does this illustrate about policy choices?",
          
          "step_by_step": [
            {
              "step": "Show short-run effects",
              "explanation": "The leftward shift of SRAS means that at the initial price level, firms supply less. The new short-run equilibrium is at the intersection of the unchanged AD and the new SRAS. Output falls below potential, and the price level rises. This is stagflation."
            },
            {
              "step": "Name the combination",
              "explanation": "Stagflation—the combination of falling output (stagnation) and rising prices (inflation)."
            },
            {
              "step": "Describe self-correction",
              "explanation": "With output below potential, unemployment is above natural rate. This puts downward pressure on wages. As wages fall, costs decrease, shifting SRAS right back toward its original position. Output gradually returns to potential, and the price level falls back toward its original level. Self-correction solves both problems but slowly."
            },
            {
              "step": "Analyze expansionary policy",
              "explanation": "Expansionary policy would increase AD, shifting it right. The new equilibrium would be at the intersection of the new AD and the left-shifted SRAS. Output returns to potential, but the price level rises even further. Inflation is permanently higher."
            },
            {
              "step": "Analyze contractionary policy",
              "explanation": "Contractionary policy would decrease AD, shifting it left. Output falls even further below potential, but the price level may fall. Unemployment worsens, but inflation is reduced."
            },
            {
              "step": "Explain policy dilemma",
              "illustrates": "Supply shocks create a dilemma because the same policy cannot solve both problems. Expansionary policy solves the output loss but worsens inflation. Contractionary policy solves inflation but worsens output loss. Policymakers must choose which problem to prioritize, or rely on slow self-correction."
            }
          ],
          
          "final_answer": "a) Output falls, price level rises. b) Stagflation. c) Wages fall, SRAS shifts right, output and price return to original. d) Output returns to potential, price level higher. e) Output falls further, price level lower. f) Policy dilemma: can't solve both problems simultaneously.",
          "concept_applied": "Supply shocks create stagflation and policy dilemmas. There's no policy that can simultaneously return output to potential and keep prices stable."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Determine Initial Equilibrium",
          "description": "Start with the economy in some initial position—long-run equilibrium, inflationary gap, or recessionary gap.",
          "mechanism": "Identify the intersection of AD and SRAS. Compare to LRAS to determine if there's an output gap. Note the current price level and output relative to potential.",
          "result": "Initial short-run equilibrium.",
          
          "image": {
            "src": "images/unit3/eq_step1.png",
            "alt": "AD-AS graph showing initial equilibrium",
            "caption": "Figure 3.5.14: Step 1 - Identify the initial short-run equilibrium and compare to potential GDP."
          }
        },
        {
          "step": 2,
          "process": "Identify the Shock or Policy Change",
          "description": "Determine what is changing—a demand shock, supply shock, or policy intervention—and which curve it affects.",
          "mechanism": "Demand shocks (changes in C, I, G, NX) shift AD. Supply shocks (changes in input prices, productivity, technology) shift SRAS. Policy changes can affect AD (fiscal, monetary) or SRAS (supply-side policies).",
          "result": "Identification of curve to shift and direction.",
          
          "image": {
            "src": "images/unit3/eq_step2.png",
            "alt": "Diagram showing arrows pointing to AD and SRAS with shock types",
            "caption": "Figure 3.5.15: Step 2 - Identify whether the shock affects AD or SRAS, and in which direction."
          }
        },
        {
          "step": 3,
          "process": "Shift the Curve and Find New Short-Run Equilibrium",
          "description": "Shift the appropriate curve and find the new intersection of AD and SRAS.",
          "mechanism": "AD right → higher output and prices. AD left → lower output and prices. SRAS right → higher output, lower prices. SRAS left → lower output, higher prices.",
          "result": "New short-run equilibrium with new output and price level.",
          
          "image": {
            "src": "images/unit3/eq_step3.png",
            "alt": "AD-AS graph showing shifted curve and new equilibrium",
            "caption": "Figure 3.5.16: Step 3 - Shift the curve and find the new short-run equilibrium."
          }
        },
        {
          "step": 4,
          "process": "Compare to Potential and Identify New Output Gap",
          "description": "Compare new output to potential GDP to determine if there's an inflationary or recessionary gap.",
          "mechanism": "If new Y > Y*, inflationary gap. If new Y < Y*, recessionary gap. If new Y = Y*, long-run equilibrium restored.",
          "result": "Identification of output gap and pressure for wage adjustment.",
          
          "image": {
            "src": "images/unit3/eq_step4.png",
            "alt": "AD-AS graph showing new equilibrium relative to LRAS",
            "caption": "Figure 3.5.17: Step 4 - Compare new output to potential to identify the gap."
          }
        },
        {
          "step": 5,
          "process": "Analyze Adjustment or Policy Response",
          "description": "Determine how the economy will adjust in the long run (self-correction) or how policy could respond.",
          "mechanism": "Self-correction: wages adjust, shifting SRAS until output returns to potential. Policy: AD can be shifted to close the gap more quickly. Consider tradeoffs and lags.",
          "result": "Prediction of long-run equilibrium or policy outcome.",
          
          "image": {
            "src": "images/unit3/eq_step5.png",
            "alt": "AD-AS graph showing self-correction or policy adjustment path",
            "caption": "Figure 3.5.18: Step 5 - Analyze the adjustment process through self-correction or policy intervention."
          }
        }
      ],

      "image": {
        "src": "images/unit3/ad_as_summary.png",
        "alt": "Comprehensive AD-AS diagram showing all concepts: equilibrium, gaps, shifts, and adjustments",
        "caption": "Figure 3.5.19: Complete AD-AS model summary - equilibrium, output gaps, shocks, and adjustment processes."
      }
    }
  ],

  "key_terms": [
    "Macroeconomic equilibrium",
    "Short-run equilibrium",
    "Long-run equilibrium",
    "Output gap",
    "Positive output gap",
    "Inflationary gap",
    "Negative output gap",
    "Recessionary gap",
    "Potential GDP",
    "Natural rate of unemployment",
    "Demand shock",
    "Positive demand shock",
    "Negative demand shock",
    "Supply shock",
    "Adverse supply shock",
    "Favorable supply shock",
    "Stagflation",
    "Self-correction mechanism",
    "Wage adjustment",
    "Price adjustment",
    "Stabilization policy",
    "Expansionary policy",
    "Contractionary policy",
    "Fiscal policy",
    "Monetary policy",
    "Policy lag",
    "Recognition lag",
    "Implementation lag",
    "Impact lag",
    "Automatic stabilizers",
    "Discretionary policy",
    "Policy dilemma",
    "Tradeoff",
    "Long-run neutrality",
    "Classical dichotomy",
    "Keynesian range",
    "Classical range",
    "Business cycle",
    "Boom",
    "Recession",
    "Recovery",
    "Inflation",
    "Deflation",
    "Disinflation"
  ],

  "summary": "Macroeconomic equilibrium in the AD-AS model occurs at the intersection of aggregate demand and short-run aggregate supply. This short-run equilibrium may be at, above, or below long-run aggregate supply (potential GDP). Long-run equilibrium occurs when AD and SRAS intersect at LRAS: output equals potential GDP, unemployment equals the natural rate, and there's no pressure for wages or prices to change. An inflationary gap (positive output gap) occurs when output exceeds potential: unemployment is below the natural rate, putting upward pressure on wages and prices, leading to rising inflation. A recessionary gap (negative output gap) occurs when output falls below potential: unemployment exceeds the natural rate, putting downward pressure on wages and prices, leading to falling inflation or deflation. The economy has a self-correcting mechanism: in an inflationary gap, rising wages shift SRAS left until output returns to potential; in a recessionary gap, falling wages shift SRAS right until output returns to potential. However, this adjustment can be slow, justifying stabilization policy. Demand shocks—changes in consumption, investment, government spending, or net exports—shift AD, creating output gaps. Positive demand shocks cause inflationary gaps; negative demand shocks cause recessionary gaps. Supply shocks—changes in input prices, productivity, or technology—shift SRAS. Adverse supply shocks (like oil price increases) cause stagflation—higher prices and lower output—creating policy dilemmas because expansionary policy to fight the output loss worsens inflation, while contractionary policy to fight inflation worsens the output loss. Fiscal and monetary policy can be used to stabilize the economy. Expansionary policy (increased government spending, tax cuts, lower interest rates) shifts AD right, closing recessionary gaps. Contractionary policy (reduced spending, tax increases, higher interest rates) shifts AD left, closing inflationary gaps. However, policy lags, uncertainty about multipliers and the natural rate, and potential side effects complicate implementation. The AD-AS model synthesizes Keynesian and classical insights: in the short run, sticky wages and prices mean that demand affects output; in the long run, flexibility means output returns to potential. This framework is essential for understanding business cycles, inflation, and the effects of economic policy."
}
