{
  "expanded_description": "Why does the total quantity of goods and services supplied in an economy increase when the price level rises? In microeconomics, a firm's supply curve slopes upward because higher prices make production more profitable. But at the macroeconomic level, the short-run aggregate supply (SRAS) curve also slopes upward, though for different reasons. In the short run, some prices are sticky—wages may be fixed by contracts, menu costs may prevent immediate price adjustments, and producers may mistake general inflation for relative price increases. These rigidities mean that when the overall price level rises, firms increase production because their costs don't rise as quickly, making each unit more profitable. Understanding short-run aggregate supply is essential for analyzing business cycles, inflation, and the effects of policy. The SRAS curve, together with aggregate demand, determines output and prices in the short run. In this section, we'll explore why the SRAS curve slopes upward, what causes it to shift, and how sticky wages and prices create the conditions for short-run fluctuations.",
  
  "core_concept": {
    "principle": "Short-run aggregate supply (SRAS) is the total quantity of goods and services that firms are willing and able to produce at different price levels in the short run, holding all other factors constant. The SRAS curve slopes upward, showing a positive relationship between the price level and real GDP supplied. This upward slope arises from three key theories: (1) Sticky-wage theory: Nominal wages are slow to adjust due to long-term contracts. When the price level rises, real wages fall, making labor cheaper for firms, so they hire more workers and increase production. (2) Sticky-price theory: Some firms are slow to adjust prices due to menu costs (costs of changing prices). When the price level rises, firms with sticky prices sell more because their relative prices are lower, increasing production. (3) Misperceptions theory: Firms may mistake a general increase in the price level for an increase in the relative price of their own product, leading them to increase production. All three theories imply that output deviates from its long-run level when the price level deviates from expectations. The SRAS curve shifts when factors other than the price level change firms' willingness to produce. These include: changes in input prices (wages, raw materials), changes in productivity (technology, worker skills), changes in supply shocks (weather, natural disasters, geopolitical events), and changes in expectations about future prices. A rightward shift (increase in SRAS) means more output is supplied at every price level; a leftward shift (decrease) means less.",
    
    "explanation": "Imagine a bakery that sells bread. The baker has a contract with workers that sets wages for the next year. If the price of bread rises, the baker's revenue per loaf increases, but wages don't change immediately. The baker's profit margin rises, so she hires more workers and bakes more bread. That's the sticky-wage theory. Now imagine a restaurant with printed menus. Changing menu prices costs money—printing new menus, updating website, etc. If the price level rises generally, the restaurant may delay raising prices to avoid these menu costs. Meanwhile, customers see the restaurant's prices as relatively cheaper than before, so they buy more. The restaurant produces more to meet demand. That's the sticky-price theory. Finally, imagine a farmer who notices the price of wheat rising. She might think demand for wheat has increased specifically, so she plants more wheat. But if all prices are rising, it's general inflation, not just wheat demand. That's the misperceptions theory. All three theories explain why firms produce more when the price level rises in the short run. But the SRAS curve can also shift. If the price of flour (an input) rises, the baker's costs increase, so she supplies less bread at every price—SRAS shifts left. If a new oven increases productivity, she supplies more—SRAS shifts right. Understanding these shifts is crucial for analyzing inflation, recessions, and policy.",
    
    "image": {
      "src": "images/unit3/sras_curve.png",
      "alt": "Upward-sloping short-run aggregate supply curve with price level on vertical axis and real GDP on horizontal axis",
      "caption": "Figure 3.3.1: The short-run aggregate supply curve slopes upward, showing a positive relationship between the price level and real GDP supplied."
    }
  },

  "sections": [
    {
      "section_title": "3.3 Short Run Aggregate Supply",
      "introduction": "In the short run, the total quantity of goods and services that firms produce depends on the price level. When prices rise, firms increase production; when prices fall, they cut back. This positive relationship is captured by the short-run aggregate supply (SRAS) curve. But why does this relationship exist? And what makes the SRAS curve shift? In this section, we'll explore the theories behind the upward-sloping SRAS curve—sticky wages, sticky prices, and misperceptions. We'll also examine the factors that shift SRAS: changes in input prices, productivity, supply shocks, and expectations. Understanding SRAS is essential for analyzing business cycles, inflation, and the effects of policy on output and employment.",
      
      "introduction_image": {
        "src": "images/unit3/sras_intro.png",
        "alt": "Graph showing upward-sloping SRAS curve with labeled axes",
        "caption": "Figure 3.3.2: The SRAS curve slopes upward. Higher price levels lead to higher real GDP supplied in the short run."
      },
      
      "key_concept": {
        "definition": "Short-run aggregate supply (SRAS) is the relationship between the price level and the quantity of real GDP supplied by firms in the short run, holding all other factors constant. The SRAS curve slopes upward because of three key theories: (1) Sticky-wage theory: Nominal wages are slow to adjust due to contracts. When the price level rises, real wages fall, reducing labor costs and increasing profitability, so firms hire more and increase production. (2) Sticky-price theory: Some firms are slow to adjust prices due to menu costs. When the price level rises, firms with sticky prices have relatively lower prices, so demand for their products increases, and they increase production. (3) Misperceptions theory: Firms may misinterpret general price level changes as changes in relative prices. If they think their product's price has risen relative to others, they increase production. All three theories imply that output deviates from its long-run level when the price level deviates from expectations. The SRAS curve shifts when factors other than the price level affect firms' willingness to produce. These include: (1) Input prices: Wages, raw materials, energy costs. Higher input prices reduce profitability and decrease SRAS (shift left); lower input prices increase SRAS (shift right). (2) Productivity: Advances in technology, better worker skills, improved management. Higher productivity reduces costs and increases SRAS (shift right). (3) Supply shocks: Unexpected events that affect production—weather, natural disasters, geopolitical events, pandemics. Adverse shocks decrease SRAS (shift left); favorable shocks increase SRAS (shift right). (4) Expectations: If firms expect higher future prices, they may reduce current supply to sell later, decreasing SRAS; expectations of lower future prices may increase current supply.",
        
        "context": "The distinction between short-run and long-run aggregate supply is central to macroeconomics. In the long run, prices and wages are fully flexible, and output is determined by the economy's productive capacity—not by the price level. But in the short run, rigidities mean that output can deviate from potential. This insight, developed by Keynes and refined by later economists, explains why economies experience booms and recessions. The SRAS curve, combined with aggregate demand, determines output and prices in the short run. Understanding what shifts SRAS is crucial for analyzing inflation, stagflation, and the effects of supply shocks like oil price increases or pandemics.",
        
        "image": {
          "src": "images/unit3/sras_theories.png",
          "alt": "Diagram showing three theories: sticky wages, sticky prices, and misperceptions",
          "caption": "Figure 3.3.3: Three theories explain the upward slope of SRAS: sticky wages, sticky prices, and misperceptions."
        }
      },

      "classifications": [
        {
          "type": "Sticky-Wage Theory",
          "value": "Nominal wages adjust slowly, affecting real labor costs",
          "characteristics": ["Long-term wage contracts", "Wages set in nominal terms", "Real wages fluctuate with price level", "Labor demand responds to real wages", "Employment changes in short run"],
          "behavior": "When the price level rises, nominal wages are fixed in the short run, so real wages fall. Labor becomes cheaper for firms, so they hire more workers and increase production. When the price level falls, real wages rise, labor becomes more expensive, so firms reduce hiring and cut production. This creates a positive relationship between the price level and output. The sticky-wage theory assumes that workers and firms negotiate wages in advance, and these wages don't adjust immediately to changes in the price level.",
          
          "image": {
            "src": "images/unit3/sticky_wage.png",
            "alt": "Diagram showing wage contract, then price level increase reducing real wage, increasing employment",
            "caption": "Figure 3.3.4: Sticky-wage theory: Fixed nominal wages mean higher price level reduces real wages, increasing employment and output."
          },
          
          "examples": [
            {
              "process": "Union contracts",
              "explanation": "Many workers have multi-year union contracts that set nominal wages. If the price level rises during the contract period, real wages fall, and firms hire more workers or increase hours."
            },
            {
              "process": "Annual salaries",
              "explanation": "Many employees have annual salaries that are fixed for the year. If inflation is higher than expected, real wages fall, benefiting employers who may increase production."
            },
            {
              "process": "Minimum wage",
              "explanation": "The minimum wage is set in nominal terms and changes only occasionally. When the price level rises, the real minimum wage falls, potentially increasing employment of low-wage workers."
            }
          ]
        },
        {
          "type": "Sticky-Price Theory",
          "value": "Some firms adjust prices slowly due to menu costs",
          "characteristics": ["Menu costs of changing prices", "Firms adjust prices periodically", "Relative prices change with general inflation", "Demand responds to relative prices", "Output adjusts to demand"],
          "behavior": "Not all firms adjust prices instantly when the overall price level changes. Changing prices costs money—printing new menus, catalogs, updating computer systems, informing customers. These are menu costs. Firms with sticky prices keep their prices constant in the short run. When the overall price level rises, these firms' prices become relatively lower, so demand for their products increases, and they increase production. When the overall price level falls, their prices become relatively higher, demand falls, and they cut production. This creates a positive relationship between the price level and output.",
          
          "image": {
            "src": "images/unit3/sticky_price.png",
            "alt": "Diagram showing restaurant with menu costs, price level increase makes their prices relatively cheaper",
            "caption": "Figure 3.3.5: Sticky-price theory: Firms with menu costs don't adjust prices immediately. When general price level rises, their relative prices fall, increasing demand and output."
          },
          
          "examples": [
            {
              "process": "Restaurant menus",
              "explanation": "A restaurant prints menus with prices. Changing menus costs money. If general inflation occurs, the restaurant's prices become relatively cheaper, attracting more customers and increasing production."
            },
            {
              "process": "Mail-order catalogs",
              "explanation": "Companies print catalogs with prices for the season. If inflation is higher than expected, their prices are relatively low, increasing orders and production."
            },
            {
              "process": "Online retailers",
              "explanation": "Even online, changing prices takes time and effort. Some firms adjust prices only periodically, leading to similar effects."
            }
          ]
        },
        {
          "type": "Misperceptions Theory",
          "value": "Firms mistake general inflation for relative price changes",
          "characteristics": ["Imperfect information", "Firms observe own prices first", "General vs. relative confusion", "Temporary supply response", "Expectations matter"],
          "behavior": "Firms may not immediately know whether a price increase for their product reflects general inflation or increased relative demand. If they see their price rising, they might think demand for their specific product has increased, so they increase production. But if all prices are rising together, it's general inflation, and the relative price hasn't changed. The misperception leads to a temporary increase in output. When firms realize that all prices are rising, they adjust expectations and reduce production back to normal. This theory emphasizes the role of expectations and imperfect information in short-run supply.",
          
          "image": {
            "src": "images/unit3/misperceptions.png",
            "alt": "Diagram showing farmer seeing wheat price rise, thinking demand increased, planting more, but all prices are rising",
            "caption": "Figure 3.3.6: Misperceptions theory: Firms mistake general inflation for increased relative demand, temporarily increasing production."
          },
          
          "examples": [
            {
              "process": "Farmer's dilemma",
              "explanation": "A farmer sees the price of wheat rising. She thinks demand for wheat has increased, so she plants more. But if all agricultural prices are rising due to general inflation, her relative price hasn't changed. She'll only realize later."
            },
            {
              "process": "Manufacturer",
              "explanation": "A manufacturer sees orders increasing and prices rising. She assumes demand for her product is strong and increases production. If it's just general inflation, she'll eventually have to cut back."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "SRAS Slopes Upward Due to Price and Wage Rigidities",
          "statement": "The short-run aggregate supply curve slopes upward because nominal wages and prices are sticky in the short run. When the price level rises, sticky wages mean real wages fall, reducing labor costs and increasing profitability, so firms hire more and increase output. Sticky prices mean some firms' relative prices fall, increasing demand for their products and thus output. Misperceptions lead firms to temporarily increase output when they see prices rising. All three mechanisms imply that output deviates from its long-run level when the price level deviates from expectations. The slope of SRAS reflects the degree of stickiness—more stickiness means a flatter SRAS (larger output response to price changes); less stickiness means a steeper SRAS.",
          "application": "When analyzing short-run fluctuations, remember that output can deviate from potential because of price and wage rigidities. A rise in aggregate demand will increase both output and prices in the short run—how much of each depends on the slope of SRAS. If SRAS is steep, prices rise a lot and output rises little; if SRAS is flat, output rises a lot and prices rise little. This is why the slope matters for policy.",
          "example": "Suppose aggregate demand increases sharply. With sticky wages and prices, firms increase production in response to higher demand and higher prices. Real GDP rises above potential, and the price level rises. Over time, as wages and prices adjust, the economy returns to potential output with a higher price level. The short-run effect is a combination of output and price increases, determined by the slope of SRAS.",
          
          "image": {
            "src": "images/unit3/sras_slope.png",
            "alt": "AD-AS graph showing different SRAS slopes: flat, steep, and normal",
            "caption": "Figure 3.3.7: The slope of SRAS determines how much of an AD increase goes to output vs. prices. Flatter SRAS means larger output effects."
          }
        },
        {
          "principle": "Changes in Input Prices Shift SRAS",
          "statement": "The most important factor shifting SRAS is changes in the prices of inputs—wages, raw materials, energy, and other costs of production. When input prices rise, producing any given level of output becomes more expensive, so firms supply less at every price level—SRAS shifts left. When input prices fall, production becomes cheaper, so firms supply more—SRAS shifts right. Input prices can change for many reasons: wage negotiations, commodity price fluctuations (oil, metals, agricultural products), exchange rate changes (affecting imported inputs), and supply shocks. Because wages are a large part of costs, changes in nominal wages are particularly important for SRAS.",
          "application": "When analyzing inflation, consider both demand and supply factors. An increase in oil prices shifts SRAS left, causing stagflation—higher prices and lower output. A decrease in oil prices shifts SRAS right, lowering inflation and raising output. Wage increases can also shift SRAS, which is why policymakers關注 wage pressures. Supply shocks are often beyond policymakers' control but have major effects on the economy.",
          "example": "In the 1970s, OPEC oil price shocks dramatically increased input prices for energy-intensive industries. SRAS shifted left, causing both higher inflation and higher unemployment—stagflation. This combination puzzled Keynesian economists and led to new thinking about supply shocks. In 2014-15, oil prices collapsed, shifting SRAS right, contributing to lower inflation and stronger growth.",
          
          "image": {
            "src": "images/unit3/input_prices.png",
            "alt": "SRAS graph showing left shift from higher input prices, right shift from lower input prices",
            "caption": "Figure 3.3.8: Higher input prices (wages, oil, raw materials) shift SRAS left; lower input prices shift SRAS right."
          }
        },
        {
          "principle": "Productivity Growth Shifts SRAS Right",
          "statement": "Productivity—the amount of output produced per unit of input—is a key determinant of aggregate supply. When productivity increases, firms can produce more with the same inputs, reducing costs and increasing profitability. This shifts SRAS right: more output is supplied at every price level. Productivity growth comes from technological progress, better worker skills (human capital), improved management, and more efficient organization of production. Productivity growth is the main source of long-run increases in living standards, but it also affects short-run supply. Periods of rapid productivity growth can shift SRAS right, lowering inflation and boosting output simultaneously.",
          "application": "When evaluating economic performance, consider productivity trends. Strong productivity growth can offset wage increases, keeping unit labor costs stable and inflation low. It can also allow the economy to grow faster without inflation. Policy that promotes productivity—education, infrastructure, research and development, competition—shifts SRAS right and improves long-run living standards.",
          "example": "In the late 1990s, rapid productivity growth from information technology shifted SRAS right. This allowed the economy to grow rapidly with low inflation, a phenomenon that puzzled many economists at the time. The Fed under Alan Greenspan recognized that productivity gains were shifting supply, allowing faster growth without inflationary pressure.",
          
          "image": {
            "src": "images/unit3/productivity.png",
            "alt": "SRAS graph showing right shift from productivity growth, with lower costs and higher output",
            "caption": "Figure 3.3.9: Productivity growth reduces costs and shifts SRAS right, allowing more output at every price level."
          }
        },
        {
          "principle": "Supply Shocks Cause SRAS to Shift Abruptly",
          "statement": "Supply shocks are unexpected events that dramatically affect production costs or capacity. Adverse supply shocks—like oil price spikes, natural disasters, wars, or pandemics—reduce SRAS (shift left), causing stagflation: higher prices and lower output. Favorable supply shocks—like bumper harvests, technological breakthroughs, or discovery of cheap resources—increase SRAS (shift right), lowering prices and raising output. Supply shocks are important because they create policy dilemmas: fighting the resulting inflation with contractionary policy would worsen the output loss; fighting the output loss with expansionary policy would worsen inflation. Policymakers must often choose which problem to address.",
          "application": "When a supply shock hits, recognize that it creates a tradeoff between inflation and output that standard demand management policies cannot easily resolve. Policy may need to focus on mitigating the shock's effects—for example, releasing strategic petroleum reserves during an oil shock, providing disaster relief, or supporting affected industries. In severe cases, the shock may require structural policies to address underlying vulnerabilities.",
          "example": "The COVID-19 pandemic in 2020 was a massive adverse supply shock. Lockdowns and illness reduced labor supply, supply chains were disrupted, and production collapsed. SRAS shifted left, causing both lower output and higher prices (though initially demand collapsed even more). The recovery involved both demand stimulus and gradual resolution of supply chain issues. The 2021-22 inflation surge was partly due to these supply disruptions.",
          
          "image": {
            "src": "images/unit3/supply_shocks.png",
            "alt": "SRAS graph showing left shift from adverse supply shock (oil spike, pandemic) and right shift from favorable shock",
            "caption": "Figure 3.3.10: Supply shocks shift SRAS. Adverse shocks (oil spikes, pandemics) shift left; favorable shocks shift right."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying SRAS Shifts",
          
          "image": {
            "src": "images/unit3/sras_shifts_example.png",
            "alt": "List of events for SRAS shift classification",
            "caption": "Figure 3.3.11: For each event, determine whether SRAS shifts right, left, or stays the same."
          },
          
          "problem": "For each of the following events, determine whether SRAS shifts right, left, or remains unchanged. Explain your reasoning. a) Oil prices increase sharply due to geopolitical tensions. b) A major technological breakthrough increases productivity in manufacturing. c) Workers unionize and negotiate a 10% wage increase. d) The government provides subsidies for renewable energy, reducing energy costs. e) A hurricane destroys factories along the Gulf Coast. f) The price level rises by 5%. g) Immigration increases the labor force significantly. h) Firms expect higher future prices and reduce current supply to sell later.",
          
          "step_by_step": [
            {
              "step": "Analyze oil price increase",
              "explanation": "Oil is a key input for many industries. Higher oil prices increase production costs, so firms supply less at every price level. SRAS shifts left."
            },
            {
              "step": "Analyze technological breakthrough",
              "explanation": "Technology increases productivity, allowing firms to produce more with the same inputs. Costs fall, so SRAS shifts right."
            },
            {
              "step": "Analyze wage increase",
              "explanation": "Wages are a major cost of production. Higher wages increase costs, reducing profitability and supply at every price level. SRAS shifts left."
            },
            {
              "step": "Analyze energy subsidies",
              "explanation": "Subsidies reduce energy costs for firms. Lower input costs increase profitability and supply. SRAS shifts right."
            },
            {
              "step": "Analyze hurricane destruction",
              "explanation": "The hurricane destroys factories, reducing productive capacity. Even at the same prices, less can be produced. SRAS shifts left."
            },
            {
              "step": "Analyze price level increase",
              "explanation": "A change in the price level causes a movement along the SRAS curve, not a shift. The curve itself doesn't move; we move to a different point on the same curve."
            },
            {
              "step": "Analyze immigration increase",
              "explanation": "More workers increase the labor force, expanding productive capacity. Firms can produce more at every price level. SRAS shifts right."
            },
            {
              "step": "Analyze expectations of higher future prices",
              "explanation": "If firms expect higher prices in the future, they may reduce current supply to sell more later at higher prices. Current SRAS shifts left."
            }
          ],
          
          "final_answer": "a) Left. b) Right. c) Left. d) Right. e) Left. f) No shift (movement along). g) Right. h) Left.",
          "concept_applied": "SRAS shifts when factors other than the price level affect firms' willingness to produce: input prices, productivity, supply shocks, expectations, and productive capacity."
        },
        {
          "title": "Calculating Effects of Input Price Changes",
          
          "image": {
            "src": "images/unit3/input_price_calc.png",
            "alt": "Table showing cost structure and price changes",
            "caption": "Figure 3.3.12: Use this cost data to calculate the effect of input price changes on supply."
          },
          
          "problem": "A typical firm in an economy has the following cost structure: Labor costs account for 60% of total costs, energy costs 20%, raw materials 15%, and other costs 5%. a) If wages increase by 10%, by what percentage do total costs increase, assuming other costs unchanged? b) If energy prices increase by 20%, by what percentage do total costs increase? c) If both wages increase by 10% and energy prices increase by 20%, what is the total cost increase? d) How would these cost increases affect SRAS? e) If productivity increases by 5% at the same time, offsetting some of the cost increases, what is the net effect on costs per unit of output?",
          
          "step_by_step": [
            {
              "step": "Calculate wage increase effect",
              "explanation": "Wages are 60% of costs. A 10% wage increase raises total costs by $60\\% × 10\\% = 6\\%$."
            },
            {
              "step": "Calculate energy price effect",
              "explanation": "Energy is 20% of costs. A 20% energy price increase raises total costs by $20\\% × 20\\% = 4\\%$."
            },
            {
              "step": "Calculate combined effect",
              "explanation": "Combined cost increase = $6\\% + 4\\% = 10\\%$ (assuming no interactions). Total costs rise by 10%."
            },
            {
              "step": "Interpret effect on SRAS",
              "explanation": "A 10% increase in costs means firms need higher prices to supply the same output. At every price level, they supply less. SRAS shifts left. The magnitude depends on how much costs rise."
            },
            {
              "step": "Add productivity increase",
              "explanation": "Productivity increase of 5% means firms can produce 5% more output with the same inputs, effectively reducing costs per unit by about 5%. Net cost increase = $10\\% - 5\\% = 5\\%$. SRAS still shifts left, but by less."
            }
          ],
          
          "final_answer": "a) 6%. b) 4%. c) 10%. d) SRAS shifts left. e) Net cost increase = 5%, SRAS shifts left less.",
          "concept_applied": "Input price increases raise costs and shift SRAS left. Productivity gains offset cost increases and shift SRAS right."
        },
        {
          "title": "Stagflation from Supply Shocks",
          
          "image": {
            "src": "images/unit3/stagflation.png",
            "alt": "AD-AS graph showing left SRAS shift causing higher prices and lower output",
            "caption": "Figure 3.3.13: An adverse supply shock shifts SRAS left, causing stagflation—higher prices and lower output."
          },
          
          "problem": "An economy is initially in long-run equilibrium at potential GDP with stable prices. Then an adverse supply shock occurs: oil prices triple, significantly increasing production costs. a) Using the AD-AS model, show the short-run effects on output and the price level. b) What happens to unemployment? c) What policy dilemma does this create for policymakers? d) If the government does nothing, what will happen in the long run? e) How would expansionary policy affect the outcome? Contractionary policy?",
          
          "step_by_step": [
            {
              "step": "Show short-run effects",
              "explanation": "The oil price shock shifts SRAS left. At the initial price level, firms supply less. The new short-run equilibrium is at the intersection of the unchanged AD curve and the new SRAS curve. Output falls below potential, and the price level rises. This combination of falling output and rising prices is stagflation."
            },
            {
              "step": "Determine unemployment effect",
              "explanation": "Output falling below potential means unemployment rises above the natural rate. The economy experiences higher unemployment along with higher inflation."
            },
            {
              "step": "Identify policy dilemma",
              "explanation": "Policymakers face a dilemma: expansionary policy to fight unemployment would worsen inflation. Contractionary policy to fight inflation would worsen unemployment. There's no policy that can simultaneously solve both problems because the shock affects supply, not demand."
            },
            {
              "step": "Analyze no-policy outcome",
              "explanation": "In the long run, as wages and prices adjust, SRAS will gradually shift back to the right. High unemployment puts downward pressure on wages, reducing costs. Eventually, the economy returns to potential GDP at the original price level, but the adjustment may take years and involve sustained high unemployment."
            },
            {
              "step": "Evaluate policy options",
              "explanation": "Expansionary policy (increasing AD) would shift AD right, moving the economy to a new equilibrium with even higher prices but output back to potential. This avoids the prolonged unemployment but at the cost of permanently higher prices. Contractionary policy (decreasing AD) would shift AD left, lowering prices but worsening the output loss and unemployment. Neither is attractive; policymakers must choose which problem to address."
            }
          ],
          
          "final_answer": "a) Output falls, price level rises. b) Unemployment rises. c) Dilemma: fighting unemployment worsens inflation, fighting inflation worsens unemployment. d) Long run: gradual return to potential with price level back to original. e) Expansionary: output back to potential, higher prices permanently. Contractionary: lower prices, worse unemployment.",
          "concept_applied": "Adverse supply shocks cause stagflation and create policy dilemmas because they affect both output and prices in opposite directions."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Determine Initial SRAS Position",
          "description": "Start with the SRAS curve based on current input prices, productivity, and expectations.",
          "mechanism": "The SRAS curve shows the relationship between the price level and output given current costs and technology. Its position reflects the economy's short-run supply conditions.",
          "result": "Initial SRAS curve.",
          
          "image": {
            "src": "images/unit3/sras_step1.png",
            "alt": "SRAS graph with initial curve",
            "caption": "Figure 3.3.14: Step 1 - Start with the initial SRAS curve based on current input prices and productivity."
          }
        },
        {
          "step": 2,
          "process": "Identify Changes in Input Prices",
          "description": "Changes in wages, raw material prices, energy costs, or other inputs shift SRAS.",
          "mechanism": "Higher input prices increase costs, reducing profitability and supply at every price level—SRAS shifts left. Lower input prices reduce costs, increasing supply—SRAS shifts right.",
          "result": "Shift in SRAS from input price changes.",
          
          "image": {
            "src": "images/unit3/sras_step2.png",
            "alt": "Diagram showing input price increase shifting SRAS left",
            "caption": "Figure 3.3.15: Step 2 - Higher input prices shift SRAS left; lower input prices shift SRAS right."
          }
        },
        {
          "step": 3,
          "process": "Identify Changes in Productivity",
          "description": "Advances in technology, better worker skills, or improved organization shift SRAS.",
          "mechanism": "Higher productivity reduces costs per unit, increasing supply at every price level—SRAS shifts right. Lower productivity (rare) would shift SRAS left.",
          "result": "Shift in SRAS from productivity changes.",
          
          "image": {
            "src": "images/unit3/sras_step3.png",
            "alt": "Diagram showing productivity increase shifting SRAS right",
            "caption": "Figure 3.3.16: Step 3 - Higher productivity shifts SRAS right; lower productivity shifts SRAS left."
          }
        },
        {
          "step": 4,
          "process": "Consider Supply Shocks and Expectations",
          "description": "Unexpected events and changes in expectations about future prices also shift SRAS.",
          "mechanism": "Adverse supply shocks (oil spikes, natural disasters, pandemics) shift SRAS left. Favorable shocks shift SRAS right. If firms expect higher future prices, they may reduce current supply, shifting SRAS left.",
          "result": "Additional shifts from shocks and expectations.",
          
          "image": {
            "src": "images/unit3/sras_step4.png",
            "alt": "Diagram showing supply shock shifting SRAS left",
            "caption": "Figure 3.3.17: Step 4 - Adverse supply shocks (oil spikes, disasters) shift SRAS left; favorable shocks shift right."
          }
        },
        {
          "step": 5,
          "process": "Combine with AD to Determine Short-Run Equilibrium",
          "description": "The new SRAS curve, together with aggregate demand, determines short-run output and price level.",
          "mechanism": "The intersection of AD and the new SRAS gives the short-run equilibrium. Compare to potential GDP to see if economy is in recession (output below potential), boom (above potential), or long-run equilibrium (at potential).",
          "result": "Short-run equilibrium output and price level.",
          
          "image": {
            "src": "images/unit3/sras_step5.png",
            "alt": "AD-AS graph showing new equilibrium after SRAS shift",
            "caption": "Figure 3.3.18: Step 5 - New SRAS intersects AD to determine short-run output and price level."
          }
        }
      ],

      "image": {
        "src": "images/unit3/sras_summary.png",
        "alt": "Comprehensive summary diagram showing SRAS curve, theories, shift factors, and effects",
        "caption": "Figure 3.3.19: Short-run aggregate supply summary - upward slope theories, shift factors, and economic effects."
      }
    }
  ],

  "key_terms": [
    "Short-run aggregate supply (SRAS)",
    "SRAS curve",
    "Sticky-wage theory",
    "Sticky-price theory",
    "Misperceptions theory",
    "Menu costs",
    "Nominal wages",
    "Real wages",
    "Relative prices",
    "Input prices",
    "Wage costs",
    "Raw material prices",
    "Energy prices",
    "Productivity",
    "Technological progress",
    "Supply shocks",
    "Adverse supply shock",
    "Favorable supply shock",
    "Stagflation",
    "Expectations",
    "Expected future prices",
    "Unit labor costs",
    "Profit margins",
    "Potential output",
    "Natural rate of unemployment",
    "Long-run equilibrium",
    "Short-run equilibrium",
    "Inflation",
    "Recession",
    "Boom",
    "Output gap",
    "Policy dilemma",
    "Accommodating policy",
    "Fighting inflation",
    "Fighting unemployment"
  ],

  "summary": "Short-run aggregate supply (SRAS) is the relationship between the price level and the quantity of real GDP supplied by firms in the short run. The SRAS curve slopes upward because of three key theories. The sticky-wage theory holds that nominal wages are slow to adjust due to long-term contracts. When the price level rises, real wages fall, reducing labor costs and increasing profitability, so firms hire more and increase production. The sticky-price theory holds that some firms are slow to adjust prices due to menu costs. When the price level rises, firms with sticky prices have relatively lower prices, so demand increases and they increase production. The misperceptions theory holds that firms may mistake general price level increases for increases in the relative demand for their products, leading them to increase production temporarily. All three theories imply that output deviates from potential when the price level deviates from expectations. The SRAS curve shifts when factors other than the price level affect firms' willingness to produce. The most important shift factors are: (1) Input prices: Higher wages, raw material prices, or energy costs increase production costs and shift SRAS left; lower input prices shift SRAS right. (2) Productivity: Advances in technology, better worker skills, and improved organization reduce costs and shift SRAS right. (3) Supply shocks: Unexpected events like oil price spikes, natural disasters, or pandemics shift SRAS left; favorable shocks like bumper harvests or technological breakthroughs shift SRAS right. (4) Expectations: If firms expect higher future prices, they may reduce current supply to sell later, shifting SRAS left. The SRAS curve, combined with aggregate demand, determines short-run output and the price level. Understanding SRAS is essential for analyzing business cycles, inflation, and the effects of policy. Adverse supply shocks cause stagflation—higher prices and lower output—creating policy dilemmas because expansionary policy to fight unemployment worsens inflation, while contractionary policy to fight inflation worsens unemployment. The slope of SRAS determines how much of an AD increase goes to output versus prices. In the next section, we'll explore long-run aggregate supply, where prices and wages are fully flexible and output is determined by the economy's productive capacity."
}
