{
  "expanded_description": "Elasticity isn't just an abstract concept—it has powerful real-world applications that affect everything from government tax policy to business pricing strategies to international trade. Understanding elasticity helps answer practical questions: Who really pays a tax—consumers or producers? Why do some agricultural policies create surpluses while others lead to shortages? How do firms determine the optimal price for their products? In this section, we'll explore how elasticity concepts are applied to analyze tax incidence, price controls, business pricing decisions, and international trade. These applications demonstrate why elasticity is one of the most useful tools in economics.",
  
  "core_concept": {
    "principle": "Elasticity has numerous real-world applications that help explain market outcomes and guide decision-making. (1) Tax incidence: The burden of a tax is shared between consumers and producers based on relative elasticities. The more inelastic side of the market bears more of the tax burden. When demand is inelastic relative to supply, consumers bear more of the tax. When supply is inelastic relative to demand, producers bear more. (2) Price controls: The effectiveness and consequences of price ceilings and floors depend on elasticities. Inelastic demand or supply leads to larger shortages or surpluses under price controls. (3) Business pricing: Firms use elasticity to set prices. If demand is elastic, lowering prices increases revenue; if inelastic, raising prices increases revenue. (4) International trade: Elasticities determine how much trade volumes change with tariffs and exchange rates. (5) Agricultural policy: Inelastic demand for food explains why bumper crops can reduce farmers' revenue (the paradox of the harvest). (6) Public policy: Elasticities help predict the effects of minimum wage laws, environmental taxes, and other regulations.",
    
    "explanation": "Think of elasticity applications like a Swiss Army knife—a single tool with many uses. The same basic concept helps analyze taxes, predict business revenue, understand farm policy, and evaluate international trade. Once you understand elasticity, you can apply it to almost any economic question about how people respond to changes.",
    
    "image": {
      "src": "images/unit3/applications_overview.png",
      "alt": "Collage of applications: tax forms, price tags, farm fields, world map",
      "caption": "Figure 3.5.1: Elasticity applies to taxes, business decisions, agriculture, and trade."
    }
  },

  "sections": [
    {
      "section_title": "3.5 Applications of Elasticity",
      "introduction": "Elasticity isn't just an abstract concept—it has powerful real-world applications that affect everything from government tax policy to business pricing strategies to international trade. Understanding elasticity helps answer practical questions: Who really pays a tax—consumers or producers? Why do some agricultural policies create surpluses while others lead to shortages? How do firms determine the optimal price for their products? In this section, we'll explore how elasticity concepts are applied to analyze tax incidence, price controls, business pricing decisions, and international trade. These applications demonstrate why elasticity is one of the most useful tools in economics.",
      
      "introduction_image": {
        "src": "images/unit3/applications_intro.png",
        "alt": "Decision-makers: government official, business owner, farmer, trade negotiator",
        "caption": "Figure 3.5.2: Elasticity helps guide decisions across many domains."
      },
      
      "key_concept": {
        "definition": "Elasticity concepts are applied across numerous real-world contexts: (1) Tax incidence analysis: When a tax is imposed, the price consumers pay rises and the price producers receive falls. The division of this tax burden—who pays more—depends on elasticities. The general rule: the more inelastic side of the market bears the larger share of the tax. If demand is more inelastic than supply, consumers bear more. If supply is more inelastic than demand, producers bear more. (2) Price controls: The size of shortages (from price ceilings) or surpluses (from price floors) depends on elasticities. More inelastic demand or supply leads to larger shortages or surpluses. (3) Business pricing: Firms use knowledge of elasticity to maximize revenue or profit. The optimal price depends on elasticity—firms with inelastic demand can raise prices; firms with elastic demand should keep prices competitive. (4) Agricultural economics: The paradox of the harvest—because food demand is inelastic, a bumper crop (increased supply) can actually reduce farmers' total revenue. Good harvests can be bad for farmers' incomes. (5) International trade: Elasticities determine how much trade volumes respond to tariffs, exchange rate changes, and trade agreements. More elastic demand and supply lead to larger trade flow changes. (6) Labor markets: The elasticity of labor demand and supply affects the impact of minimum wage laws, immigration, and training programs. (7) Environmental policy: Elasticities help predict the effectiveness of pollution taxes, fuel efficiency standards, and other environmental regulations.",
        
        "context": "These applications demonstrate why elasticity is a fundamental tool in economics. Policymakers use elasticity estimates to design effective taxes and regulations. Businesses use elasticity to set prices and forecast demand. International organizations use elasticity to predict trade patterns. Understanding these applications connects the theoretical concept of elasticity to real-world decisions and outcomes. In AP Microeconomics, you'll be expected to apply elasticity concepts to analyze policy proposals and market scenarios.",
        
        "image": {
          "src": "images/unit3/applications_diagram.png",
          "alt": "Diagram showing elasticity connecting to various applications",
          "caption": "Figure 3.5.3: Elasticity is a versatile tool with many applications."
        }
      },

      "classifications": [
        {
          "type": "Tax Incidence",
          "value": "Who bears the burden of a tax depends on elasticities",
          "characteristics": ["More inelastic side bears more tax", "Statutory incidence ≠ economic incidence", "Tax wedge between price paid and price received", "Deadweight loss increases with elasticity", "Revenue depends on elasticities"],
          "behavior": "When a tax is imposed on a good, the price consumers pay increases and the price producers receive decreases. The difference is the tax. Who actually bears the burden—consumers or producers—depends on the relative elasticities of demand and supply. If demand is more inelastic than supply, consumers bear most of the tax (price paid rises nearly by the full tax amount). If supply is more inelastic than demand, producers bear most of the tax (price received falls nearly by the full tax amount). If elasticities are equal, the burden is shared equally. This holds regardless of whether the tax is legally collected from consumers or producers—the economic incidence depends on elasticities, not statutory incidence. Governments consider this when designing taxes: taxing goods with inelastic demand (like gasoline) generates revenue with less quantity reduction but falls heavily on consumers; taxing goods with inelastic supply (like land) falls on producers.",
          
          "image": {
            "src": "images/unit3/tax_incidence_detail.png",
            "alt": "Tax incidence graphs showing burden shifting with relative elasticities",
            "caption": "Figure 3.5.4: Tax burden falls on the more inelastic side of the market."
          },
          
          "examples": [
            {
              "process": "Gasoline tax",
              "explanation": "Gasoline demand is relatively inelastic in the short run. When a gas tax is imposed, consumers pay most of it—prices at the pump rise nearly by the full tax amount. Producers bear little."
            },
            {
              "process": "Tax on beachfront property",
              "explanation": "Supply of beachfront land is perfectly inelastic. A property tax falls entirely on landowners—they cannot reduce the quantity supplied, so they bear the full burden."
            },
            {
              "process": "Cigarette taxes",
              "explanation": "Cigarette demand is inelastic due to addiction. Most of the tax is passed to consumers, which is why cigarette taxes are effective at raising revenue but less effective at reducing smoking."
            }
          ]
        },
        {
          "type": "Paradox of the Harvest (Agricultural Economics)",
          "value": "Bumper crops can reduce farmers' total revenue",
          "characteristics": ["Food demand is inelastic", "Supply increase → large price drop", "Price drop outweighs quantity increase", "TR falls for farmers", "Good for consumers, bad for farmers"],
          "behavior": "The paradox of the harvest (also called the paradox of plenty) arises because the demand for most agricultural products is inelastic $(|PED| < 1)$. When a bumper crop occurs (supply increases), the price falls significantly due to inelastic demand. The percentage price drop exceeds the percentage quantity increase, so total revenue for farmers $(P \\times Q)$ actually falls. This explains why good harvests can be bad news for farmers—they produce more but earn less. Conversely, poor harvests (supply decreases) can increase farmers' revenue. This paradox has important implications for agricultural policy, explaining why governments sometimes pay farmers not to plant or why they implement price supports to stabilize farm incomes.",
          
          "image": {
            "src": "images/unit3/paradox_harvest.png",
            "alt": "Supply shift right with inelastic demand showing price drop and TR decrease",
            "caption": "Figure 3.5.5: The paradox of the harvest—bumper crops reduce farmers' revenue when demand is inelastic."
          },
          
          "examples": [
            {
              "process": "Corn harvest",
              "explanation": "A record corn harvest increases supply by 20%. Because corn demand is inelastic $(PED = 0.5)$, price falls by 40%. Farmers' total revenue falls by 20% × -40% = -20% (approximately). Farmers earn less despite producing more."
            },
            {
              "process": "Wine grapes",
              "explanation": "A frost damages grape crops, reducing supply. Wine prices rise significantly due to inelastic demand. Surviving vineyards may earn higher revenue despite producing less."
            }
          ]
        },
        {
          "type": "Business Pricing Strategy",
          "value": "Firms use elasticity to set optimal prices",
          "characteristics": ["Elastic demand → price decrease increases TR", "Inelastic demand → price increase increases TR", "Revenue maximization at unit elastic point", "Profit maximization considers costs too", "Price discrimination based on elasticity"],
          "behavior": "Businesses use knowledge of elasticity to make pricing decisions. The relationship between elasticity and total revenue provides clear guidance: (1) If demand is elastic $(|PED| > 1)$, lowering prices increases total revenue; raising prices decreases total revenue. (2) If demand is inelastic $(|PED| < 1)$, raising prices increases total revenue; lowering prices decreases total revenue. (3) Revenue is maximized at the price where demand is unit elastic $(|PED| = 1)$. For profit maximization, firms also consider costs—they produce where marginal revenue equals marginal cost. Elasticity also enables price discrimination: charging different prices to different customer segments based on their elasticities (e.g., student discounts, senior citizen discounts, airline pricing). Understanding customer elasticity helps firms capture more consumer surplus and increase profits.",
          
          "image": {
            "src": "images/unit3/pricing_strategy_detail.png",
            "alt": "Pricing decision tree based on elasticity",
            "caption": "Figure 3.5.6: Elasticity guides business pricing decisions."
          },
          
          "examples": [
            {
              "process": "Movie theater pricing",
              "explanation": "Theaters charge lower prices for matinees (students, seniors have more elastic demand) and higher prices for evening shows (less elastic demand). This price discrimination increases revenue."
            },
            {
              "process": "Airline tickets",
              "explanation": "Airlines charge different prices based on elasticity: business travelers (inelastic demand) pay high last-minute fares; leisure travelers (elastic demand) get discounts for booking early."
            },
            {
              "process": "Software pricing",
              "explanation": "Companies offer student discounts because students have more elastic demand (lower income, more price-sensitive)."
            }
          ]
        },
        {
          "type": "Price Controls and Elasticity",
          "value": "Elasticity affects the impact of price ceilings and floors",
          "characteristics": ["More inelastic demand → larger shortage from price ceiling", "More inelastic supply → larger surplus from price floor", "Deadweight loss increases with elasticity", "Black markets more likely when demand inelastic"],
          "behavior": "The effectiveness and consequences of price controls depend on elasticities. For a price ceiling below equilibrium: (1) The size of the shortage depends on how responsive consumers and producers are. If demand is inelastic, quantity demanded doesn't fall much when price is capped, so the shortage is larger. If supply is inelastic, quantity supplied doesn't fall much, so the shortage is smaller. (2) The deadweight loss from the price ceiling increases with elasticity—more elastic demand and supply mean more forgone transactions. (3) Black markets are more likely when demand is inelastic—consumers are willing to pay much more than the ceiling price. For price floors above equilibrium: (1) The size of the surplus depends on elasticities. Inelastic demand means quantity demanded doesn't fall much, reducing the surplus. Inelastic supply means quantity supplied doesn't increase much, also reducing the surplus. (2) Government costs to purchase surpluses are higher when supply is elastic (more surplus created).",
          
          "image": {
            "src": "images/unit3/price_controls_elasticity.png",
            "alt": "Price ceiling graphs with different elasticities showing different shortage sizes",
            "caption": "Figure 3.5.7: Elasticity affects the size of shortages and surpluses from price controls."
          },
          
          "examples": [
            {
              "process": "Rent control",
              "explanation": "In cities with inelastic housing supply (can't build quickly) and inelastic demand (people need to live there), rent controls create large shortages and long waiting lists."
            },
            {
              "process": "Agricultural price supports",
              "explanation": "Price supports for crops with elastic supply create large surpluses that governments must buy, leading to costly storage programs."
            }
          ]
        },
        {
          "type": "International Trade Applications",
          "value": "Elasticities determine trade flow responses",
          "characteristics": ["Tariffs: more elastic demand → larger trade reduction", "Exchange rates: elasticities determine trade balance effects", "Marshall-Lerner condition", "Pass-through of exchange rates", "Trade agreement impacts"],
          "behavior": "In international economics, elasticities play crucial roles: (1) Tariffs: The more elastic demand for imports, the more a tariff reduces import volume. If import demand is inelastic, tariffs raise revenue with little quantity reduction; if elastic, tariffs are effective at protecting domestic industries but raise less revenue. (2) Exchange rates: The Marshall-Lerner condition states that currency depreciation improves a country's trade balance only if the sum of export and import demand elasticities exceeds 1. This determines whether a weaker currency helps or hurts trade. (3) Pass-through: How much of an exchange rate change gets passed through to consumer prices depends on elasticities. (4) Trade agreements: The trade creation and diversion effects of agreements depend on elasticities of demand for different products.",
          
          "image": {
            "src": "images/unit3/trade_elasticity.png",
            "alt": "Tariff graph and exchange rate diagram with elasticity notes",
            "caption": "Figure 3.5.8: Elasticities determine how tariffs and exchange rates affect trade."
          },
          
          "examples": [
            {
              "process": "Tariff on foreign cars",
              "explanation": "If demand for foreign cars is elastic, a tariff will significantly reduce imports, protecting domestic automakers. If demand is inelastic, the tariff will raise revenue but not reduce imports much."
            },
            {
              "process": "Currency depreciation",
              "explanation": "If export demand is elastic, a weaker currency increases export revenue. If inelastic, exporters may earn less despite selling more units."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Tax Incidence Depends on Relative Elasticities, Not Who Writes the Check",
          "statement": "A fundamental insight from elasticity analysis is that the economic burden of a tax is determined by the relative elasticities of demand and supply, not by whether the tax is legally collected from consumers or producers. The more inelastic side of the market bears more of the tax burden because they cannot easily change their behavior in response to the tax. If demand is highly inelastic (consumers will buy nearly the same quantity even at higher prices), consumers bear most of the tax. If supply is highly inelastic (producers cannot easily reduce quantity supplied), producers bear most of the tax. This principle is crucial for policy design. For example, a tax on cigarettes (inelastic demand) will be borne mainly by smokers, making it effective for revenue but less effective for reducing smoking. A tax on land (perfectly inelastic supply) is borne entirely by landowners and causes no deadweight loss.",
          "application": "When evaluating a tax proposal, consider the elasticities. Ask: Who is less able to change their behavior? That side will bear the tax burden. Use this to predict the actual distributional effects, regardless of who writes the check.",
          "example": "A city imposes a tax on rental apartments collected from landlords. If housing supply is inelastic (can't build quickly) but demand is somewhat elastic (renters can move to nearby cities), landlords will bear most of the tax—they can't reduce supply, so they must absorb the tax in lower net rents.",
          
          "image": {
            "src": "images/unit3/tax_principle.png",
            "alt": "Balance scale with inelastic side lower (bearing more tax burden)",
            "caption": "Figure 3.5.9: Tax burden falls on the more inelastic side of the market."
          }
        },
        {
          "principle": "The Paradox of the Harvest Shows Why Farmers Can Suffer from Good Harvests",
          "statement": "The paradox of the harvest (also called the paradox of plenty) demonstrates a counterintuitive application of elasticity. Because demand for most agricultural products is inelastic $(|PED| < 1)$, an increase in supply (a bumper crop) actually reduces total revenue for farmers. The price falls by a larger percentage than the quantity increases, so $P \\times Q$ decreases. This explains why farmers sometimes hope for poor harvests elsewhere or why governments implement policies to reduce supply (paying farmers not to plant). It also explains why agricultural prices are so volatile—small changes in supply cause large price changes due to inelastic demand. For consumers, this is great—bumper crops mean lower food prices. For farmers, it creates an income stabilization problem.",
          "application": "When analyzing agricultural markets, remember that inelastic demand means supply shifts have amplified price effects. Predict that good harvests will lower prices significantly and may reduce farmer revenue. This helps explain farm policy and price volatility.",
          "example": "A 10% increase in apple supply might lead to a 15% price drop if demand elasticity is 0.67. Apple farmers' revenue falls by about 5% despite producing more apples.",
          
          "image": {
            "src": "images/unit3/paradox_principle.png",
            "alt": "Graph showing supply shift right with inelastic demand causing revenue decrease",
            "caption": "Figure 3.5.10: With inelastic demand, increased supply reduces total revenue."
          }
        },
        {
          "principle": "Firms Can Use Elasticity to Implement Price Discrimination",
          "statement": "Price discrimination—charging different prices to different customers for the same product—is possible when firms can identify groups with different price elasticities of demand and prevent resale. Firms charge higher prices to groups with more inelastic demand and lower prices to groups with more elastic demand. This allows firms to capture more consumer surplus and increase profits. Examples include: student and senior discounts (students and seniors have more elastic demand due to lower incomes), airline ticket pricing (business travelers have inelastic demand, leisure travelers have elastic demand), and coupon promotions (consumers willing to clip coupons have more elastic demand). Price discrimination requires that the firm can segment the market and that arbitrage (reselling) is difficult. Understanding elasticity helps firms identify which customer segments to target with discounts and which to charge premium prices.",
          "application": "When setting prices, consider whether you can identify customer segments with different elasticities. Offer discounts to price-sensitive groups (students, seniors, budget-conscious) while maintaining higher prices for less sensitive groups.",
          "example": "Museums often charge lower prices for students and seniors (more elastic demand) and full prices for adults (less elastic demand). This increases total revenue compared to a single price.",
          
          "image": {
            "src": "images/unit3/price_discrimination.png",
            "alt": "Different customer segments with different demand curves and prices",
            "caption": "Figure 3.5.11: Price discrimination charges different prices based on different elasticities."
          }
        },
        {
          "principle": "The Marshall-Lerner Condition Links Elasticities to Trade Balance",
          "statement": "In international economics, the Marshall-Lerner condition states that a currency depreciation (devaluation) will improve a country's trade balance (exports minus imports) only if the sum of the absolute values of the price elasticities of demand for exports and imports is greater than 1. That is, if $|PED_{exports}| + |PED_{imports}| > 1$. If the sum is less than 1, depreciation actually worsens the trade balance. If equal to 1, the trade balance is unchanged. This condition matters because countries sometimes devalue their currency to boost exports and reduce imports. Whether this strategy works depends entirely on elasticities. If both export and import demand are inelastic, devaluation can backfire—export revenue falls (because quantity increases less than price decreases) and import spending rises (because quantity decreases less than price increases).",
          "application": "When evaluating currency policy, consider trade elasticities. A country with inelastic export and import demand may not benefit from devaluation. Use the Marshall-Lerner condition to predict whether devaluation will help or hurt the trade balance.",
          "example": "A country devalues its currency by 10%. Export demand elasticity is 0.4, import demand elasticity is 0.3. Sum = 0.7 < 1. Devaluation worsens the trade balance—export revenue falls, import spending rises.",
          
          "image": {
            "src": "images/unit3/marshall_lerner.png",
            "alt": "Formula and graph showing Marshall-Lerner condition",
            "caption": "Figure 3.5.12: The Marshall-Lerner condition determines if devaluation improves trade balance."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Tax Incidence Analysis",
          
          "image": {
            "src": "images/unit3/app_example1.png",
            "alt": "Tax scenario with elasticity information",
            "caption": "Figure 3.5.13: Determine tax incidence using elasticities."
          },
          
          "problem": "A government is considering a $\\$1$ per unit tax on two different products:<br>Product X: Demand elasticity = 0.3, Supply elasticity = 1.2<br>Product Y: Demand elasticity = 1.5, Supply elasticity = 0.4<br>a) For each product, determine whether consumers or producers will bear more of the tax burden.<br>b) Calculate approximate tax burden shares (percentage).<br>c) Which product will have larger deadweight loss from the tax?<br>d) If the government wants to raise revenue with minimal distortion, which product should they tax?",
          
          "step_by_step": [
            {
              "step": "Product X analysis",
              "explanation": "Demand elasticity (0.3) is much smaller than supply elasticity (1.2). Demand is more inelastic, so consumers will bear most of the tax burden. Approximate share: Consumers bear $\\frac{1.2}{0.3+1.2} = \\frac{1.2}{1.5} = 80\\%$. Producers bear 20%."
            },
            {
              "step": "Product Y analysis",
              "explanation": "Supply elasticity (0.4) is smaller than demand elasticity (1.5). Supply is more inelastic, so producers will bear most of the tax burden. Approximate share: Producers bear $\\frac{1.5}{1.5+0.4} = \\frac{1.5}{1.9} = 79\\%$. Consumers bear 21%."
            },
            {
              "step": "Deadweight loss comparison",
              "explanation": "Deadweight loss increases with elasticities. Product Y has higher elasticities overall (1.5 and 0.4 vs 0.3 and 1.2? Actually need to compare: The sum of elasticities is larger for Product Y (1.9 > 1.5), so Product Y will have larger deadweight loss. More elastic means more behavior change and more forgone transactions."
            },
            {
              "step": "Revenue with minimal distortion",
              "explanation": "To raise revenue with minimal deadweight loss, tax the product with more inelastic demand and supply—Product X. Its lower elasticities mean less behavior change and smaller deadweight loss per dollar of revenue."
            }
          ],
          
          "final_answer": "a) Product X: consumers bear more; Product Y: producers bear more. b) Product X: consumers 80%, producers 20%; Product Y: producers 79%, consumers 21%. c) Product Y. d) Product X.",
          "concept_applied": "Tax burden falls on more inelastic side. Deadweight loss increases with elasticity. Revenue efficiency favors taxing inelastic goods."
        },
        {
          "title": "Paradox of the Harvest Calculation",
          
          "image": {
            "src": "images/unit3/app_example2.png",
            "alt": "Wheat market scenario",
            "caption": "Figure 3.5.14: Analyze the effect of a bumper crop on farmer revenue."
          },
          
          "problem": "The wheat market has a demand elasticity of 0.4. Initially, price is $\\$5$ per bushel and quantity is 1,000 bushels. A bumper crop increases supply by 25%.<br>a) Calculate the approximate percentage change in price.<br>b) Calculate the new price and quantity.<br>c) Calculate total revenue before and after. What happened to farmer revenue?<br>d) Explain why this occurs and what it implies for agricultural policy.",
          
          "step_by_step": [
            {
              "step": "Find price change using elasticity",
              "explanation": "With inelastic demand, $PED = \\frac{\\%\\Delta Q}{\\%\\Delta P} = 0.4$. Supply shift of +25% means quantity increases by 25% along demand curve. So $25\\% / \\%\\Delta P = 0.4$. Solve: $\\%\\Delta P = 25\\% / 0.4 = 62.5\\%$ decrease in price."
            },
            {
              "step": "Calculate new price and quantity",
              "explanation": "Price decrease of 62.5%: New price $= \\$5 \\times (1 - 0.625) = \\$5 \\times 0.375 = \\$1.875$<br>New quantity $= 1,000 \\times 1.25 = 1,250$ bushels"
            },
            {
              "step": "Calculate revenue change",
              "explanation": "Initial revenue $= \\$5 \\times 1,000 = \\$5,000$<br>New revenue $= \\$1.875 \\times 1,250 = \\$2,343.75$<br>Revenue decreased by $\\$2,656.25$ or 53.1%"
            },
            {
              "step": "Explain and policy implications",
              "explanation": "Because demand is inelastic, the 25% quantity increase caused a 62.5% price drop, reducing total revenue. This explains why farmers may favor policies that restrict supply (like acreage reduction programs) to maintain prices and revenue. It also explains price support programs that buy surpluses to keep prices up."
            }
          ],
          
          "final_answer": "a) Price decreases by 62.5%. b) New price $= \\$1.875$, new quantity $= 1,250$. c) Revenue falls from $\\$5,000$ to $\\$2,344$. d) Inelastic demand means quantity increase causes proportionally larger price drop, reducing revenue. Farmers may support supply restrictions.",
          "concept_applied": "With inelastic demand, supply increases reduce total revenue—the paradox of the harvest."
        },
        {
          "title": "Business Pricing Decision",
          
          "image": {
            "src": "images/unit3/app_example3.png",
            "alt": "Pricing scenario for a business",
            "caption": "Figure 3.5.15: Use elasticity to make pricing recommendations."
          },
          
          "problem": "A coffee shop currently sells 1,000 cups per month at $\\$3.00$ each. The owner estimates the price elasticity of demand is 1.8.<br>a) Is demand elastic or inelastic?<br>b) If the owner raises prices to $\\$3.30$, what will happen to quantity demanded? To total revenue?<br>c) If the owner lowers prices to $\\$2.70$, what will happen to quantity demanded? To total revenue?<br>d) What pricing strategy would you recommend? Why?",
          
          "step_by_step": [
            {
              "step": "Classify elasticity",
              "explanation": "$PED = 1.8 > 1$, so demand is elastic."
            },
            {
              "step": "Price increase to $\\$3.30$",
              "explanation": "$\\%\\Delta P = (3.30 - 3.00)/3.00 = 10\\%$ (using simple percentage). With $PED = 1.8$, $\\%\\Delta Q = -1.8 \\times 10\\% = -18\\%$. New quantity $= 1,000 \\times 0.82 = 820$ cups. New revenue $= 820 \\times \\$3.30 = \\$2,706$. Old revenue $= \\$3,000$. Revenue decreases."
            },
            {
              "step": "Price decrease to $\\$2.70$",
              "explanation": "$\\%\\Delta P = -10\\%$. $\\%\\Delta Q = -1.8 \\times (-10\\%) = +18\\%$. New quantity $= 1,000 \\times 1.18 = 1,180$ cups. New revenue $= 1,180 \\times \\$2.70 = \\$3,186$. Revenue increases."
            },
            {
              "step": "Recommendation",
              "explanation": "With elastic demand, lowering prices increases total revenue. The coffee shop should consider lowering prices (or at least not raising them). They might experiment with even lower prices to find the revenue-maximizing point where $PED = 1$."
            }
          ],
          
          "final_answer": "a) Elastic. b) Quantity falls to 820, revenue falls to $\\$2,706$. c) Quantity rises to 1,180, revenue rises to $\\$3,186$. d) Lower prices to increase revenue—demand is elastic.",
          "concept_applied": "With elastic demand, price and total revenue move opposite. Lower prices increase revenue."
        },
        {
          "title": "Marshall-Lerner Condition Application",
          
          "image": {
            "src": "images/unit3/app_example4.png",
            "alt": "International trade scenario",
            "caption": "Figure 3.5.16: Apply Marshall-Lerner condition to currency devaluation."
          },
          
          "problem": "A country is considering devaluing its currency by 15% to improve its trade balance. Estimated elasticities:<br>Export demand elasticity = 0.6<br>Import demand elasticity = 0.3<br>a) Calculate the sum of the absolute elasticities.<br>b) Will devaluation improve or worsen the trade balance?<br>c) What would happen to export revenue and import spending?<br>d) If the elasticities were 1.2 and 0.8 instead, how would your answer change?",
          
          "step_by_step": [
            {
              "step": "Calculate sum",
              "explanation": "$|PED_{exports}| + |PED_{imports}| = 0.6 + 0.3 = 0.9$"
            },
            {
              "step": "Apply Marshall-Lerner",
              "explanation": "Sum = 0.9 < 1. The Marshall-Lerner condition is NOT satisfied. Devaluation will worsen the trade balance."
            },
            {
              "step": "Explain effects",
              "explanation": "Export demand is inelastic (0.6), so a 15% price decrease from devaluation increases export quantity by only 9% (0.6 × 15%). Export revenue may fall because price effect dominates. Import demand is inelastic (0.3), so quantity falls by only 4.5%, not enough to offset higher import prices. Trade balance worsens."
            },
            {
              "step": "Alternative elasticities",
              "explanation": "With elasticities 1.2 and 0.8, sum = 2.0 > 1. Marshall-Lerner satisfied. Devaluation would improve trade balance—export revenue rises, import spending falls."
            }
          ],
          
          "final_answer": "a) Sum = 0.9. b) Worsen trade balance. c) Export revenue likely falls, import spending rises. d) With 1.2 and 0.8, devaluation would improve trade balance.",
          "concept_applied": "The Marshall-Lerner condition determines whether devaluation helps or hurts trade balance based on elasticity sum."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Application Context",
          "description": "Determine which real-world application you're analyzing: tax, pricing, agriculture, trade, etc.",
          "mechanism": "Read the scenario carefully. Is it about taxes, business decisions, farm policy, international trade, or something else?",
          "result": "Clear context for analysis.",
          
          "image": {
            "src": "images/unit3/app_step1.png",
            "alt": "Icons representing different applications",
            "caption": "Figure 3.5.17: Step 1 - Identify the application context."
          }
        },
        {
          "step": 2,
          "process": "Identify Relevant Elasticities",
          "description": "Determine which elasticities matter for this application.",
          "mechanism": "For tax: PED and PES. For pricing: PED. For agriculture: PED. For trade: export and import elasticities.",
          "result": "List of relevant elasticities.",
          
          "image": {
            "src": "images/unit3/app_step2.png",
            "alt": "Elasticity types with checkmarks",
            "caption": "Figure 3.5.18: Step 2 - Identify which elasticities are relevant."
          }
        },
        {
          "step": 3,
          "process": "Apply the Appropriate Rule",
          "description": "Use the relevant elasticity principle to analyze the situation.",
          "mechanism": "Tax: more inelastic side bears burden. Pricing: elastic → lower price increases revenue. Agriculture: inelastic demand → supply ↑ revenue ↓. Trade: Marshall-Lerner condition.",
          "result": "Preliminary conclusion.",
          
          "image": {
            "src": "images/unit3/app_step3.png",
            "alt": "Rule cards for different applications",
            "caption": "Figure 3.5.19: Step 3 - Apply the appropriate elasticity rule."
          }
        },
        {
          "step": 4,
          "process": "Calculate Quantitative Effects",
          "description": "If needed, use elasticity formulas to calculate specific outcomes.",
          "mechanism": "Use $\\%\\Delta Q = PED \\times \\%\\Delta P$ or similar relationships. Calculate revenue changes, tax burdens, etc.",
          "result": "Quantitative predictions.",
          
          "image": {
            "src": "images/unit3/app_step4.png",
            "alt": "Calculations with percentage changes",
            "caption": "Figure 3.5.20: Step 4 - Calculate quantitative effects if needed."
          }
        },
        {
          "step": 5,
          "process": "Draw Conclusions and Recommend",
          "description": "Summarize findings and suggest actions or policy implications.",
          "mechanism": "Based on analysis, state what will happen and what should be done. Consider distributional effects, efficiency, and trade-offs.",
          "result": "Final conclusion and recommendations.",
          
          "image": {
            "src": "images/unit3/app_step5.png",
            "alt": "Conclusion and recommendations",
            "caption": "Figure 3.5.21: Step 5 - Draw conclusions and make recommendations."
          }
        }
      ],

      "image": {
        "src": "images/unit3/applications_summary.png",
        "alt": "Comprehensive summary: tax incidence, paradox of harvest, pricing strategy, price controls, trade applications",
        "caption": "Figure 3.5.22: Elasticity applications summary."
      }
    }
  ],

  "key_terms": [
    "Tax incidence",
    "Statutory incidence",
    "Economic incidence",
    "Tax burden",
    "Deadweight loss",
    "Paradox of the harvest",
    "Paradox of plenty",
    "Bumper crop",
    "Price discrimination",
    "Revenue maximization",
    "Marshall-Lerner condition",
    "Currency devaluation",
    "Trade balance",
    "Exchange rate pass-through",
    "Tariff incidence",
    "Price controls and elasticity",
    "Agricultural policy",
    "Price supports",
    "Student discounts",
    "Senior discounts",
    "Elasticity and business strategy",
    "Elasticity and public policy"
  ],

  "summary": "Elasticity has numerous real-world applications across economics. (1) Tax incidence: The burden of a tax falls on the more inelastic side of the market. If demand is more inelastic than supply, consumers bear most of the tax; if supply is more inelastic, producers bear most. This holds regardless of who legally pays the tax. (2) Paradox of the harvest: Because food demand is inelastic, bumper crops (supply increases) reduce farmers' total revenue. Price falls more than quantity rises, so $P \\times Q$ decreases. This explains agricultural price volatility and farm policy. (3) Business pricing: Firms use elasticity to set prices. With elastic demand, lowering prices increases revenue; with inelastic demand, raising prices increases revenue. Price discrimination charges different prices to groups with different elasticities. (4) Price controls: The size of shortages or surpluses from price controls depends on elasticities. More inelastic demand or supply leads to larger effects. (5) International trade: The Marshall-Lerner condition states that currency devaluation improves trade balance only if the sum of export and import demand elasticities exceeds 1. These applications demonstrate why elasticity is one of the most practical and widely used concepts in economics."
}
