{
  "expanded_description": "How does the demand for one product change when the price of another product changes? And how does demand change when consumer incomes rise or fall? These questions are answered by two other elasticity concepts: cross-price elasticity of demand and income elasticity of demand. These measures help economists understand relationships between goods—whether they're substitutes or complements—and how sensitive products are to economic cycles. Businesses use this information to forecast demand, set product strategies, and understand their competitive position. In this section, we'll explore how to calculate and interpret cross-price and income elasticity, and what these measures tell us about consumer behavior.",
  
  "core_concept": {
    "principle": "Cross-price elasticity of demand (XED) measures how the quantity demanded of one good responds to a change in the price of another good. Income elasticity of demand (YED) measures how quantity demanded responds to a change in consumer income. (1) Cross-price elasticity: $XED = \\frac{\\% \\Delta Q_d \\text{ of Good A}}{\\% \\Delta P \\text{ of Good B}}$. The sign of XED tells us the relationship between goods: Positive XED means goods are substitutes (price increase in B increases demand for A). Negative XED means goods are complements (price increase in B decreases demand for A). Zero XED means goods are unrelated. (2) Income elasticity: $YED = \\frac{\\% \\Delta Q_d}{\\% \\Delta I}$. The sign and magnitude of YED tell us about the type of good: Positive YED means normal good. Within normal goods, $YED > 1$ indicates luxury (income elastic), $0 < YED < 1$ indicates necessity (income inelastic). Negative YED means inferior good (demand falls as income rises).",
    
    "explanation": "Think of cross-price elasticity like friendship. Some goods are friends—they're used together, so when one gets more expensive, people buy less of both (complements). Other goods are rivals—they compete, so when one gets more expensive, people switch to the other (substitutes). Income elasticity is like how your shopping list changes when you get a raise. For some things, you buy more (normal goods). For others, you buy fancier versions and drop the cheap stuff (inferior goods).",
    
    "image": {
      "src": "images/unit3/xed_yed_overview.png",
      "alt": "Three pairs: peanut butter and jelly (complements), Coke and Pepsi (substitutes), generic and name brand (inferior vs normal)",
      "caption": "Figure 3.3.1: Cross-price elasticity reveals relationships between goods; income elasticity reveals how goods respond to income changes."
    }
  },

  "sections": [
    {
      "section_title": "3.3 Cross Price and Income Elasticity",
      "introduction": "How does the demand for one product change when the price of another product changes? And how does demand change when consumer incomes rise or fall? These questions are answered by two other elasticity concepts: cross-price elasticity of demand and income elasticity of demand. These measures help economists understand relationships between goods—whether they're substitutes or complements—and how sensitive products are to economic cycles. Businesses use this information to forecast demand, set product strategies, and understand their competitive position. In this section, we'll explore how to calculate and interpret cross-price and income elasticity, and what these measures tell us about consumer behavior.",
      
      "introduction_image": {
        "src": "images/unit3/xed_yed_intro.png",
        "alt": "Shopping cart with various items, some affected by prices of other items, some affected by income",
        "caption": "Figure 3.3.2: Cross-price and income elasticity reveal different dimensions of consumer demand."
      },
      
      "key_concept": {
        "definition": "Cross-price elasticity of demand (XED) measures the responsiveness of quantity demanded for one good to a change in the price of another good. It is calculated as: $XED = \\frac{\\% \\Delta Q_d \\text{ of Good A}}{\\% \\Delta P \\text{ of Good B}}$. The sign of XED is crucial for interpretation: (1) Positive XED ($XED > 0$): Goods are substitutes. An increase in price of Good B leads consumers to switch to Good A, increasing quantity demanded of A. Examples: Coke and Pepsi, butter and margarine. The larger the positive value, the closer the substitutes. (2) Negative XED ($XED < 0$): Goods are complements. An increase in price of Good B makes the combination more expensive, reducing demand for both. Examples: printers and ink cartridges, cars and gasoline. The more negative, the stronger the complementary relationship. (3) Zero XED ($XED = 0$): Goods are unrelated. Price changes in one have no effect on demand for the other. Income elasticity of demand (YED) measures the responsiveness of quantity demanded to a change in consumer income: $YED = \\frac{\\% \\Delta Q_d}{\\% \\Delta I}$. The sign and magnitude classify goods: (1) Positive YED ($YED > 0$): Normal good. Demand increases as income rises. (2) $YED > 1$: Luxury good (income elastic). Demand increases more than proportionally with income. Examples: restaurant meals, luxury cars, international travel. (3) $0 < YED < 1$: Necessity (income inelastic). Demand increases less than proportionally with income. Examples: basic food, utilities, gasoline. (4) Negative YED ($YED < 0$): Inferior good. Demand decreases as income rises. Examples: generic brands, public transit, instant noodles. Both XED and YED are important for business forecasting, market analysis, and understanding consumer behavior.",
        
        "context": "Cross-price elasticity helps firms understand their competitive position. A high positive XED means your product faces strong competition—consumers will switch easily if you raise prices. A negative XED helps identify complementary products—useful for bundling strategies and understanding ecosystem effects. Income elasticity helps businesses forecast demand over the business cycle. Luxury goods (high YED) boom in expansions and crash in recessions. Necessities (low YED) are stable. Inferior goods may actually do better in recessions. This information guides production planning, inventory management, and marketing strategies.",
        
        "image": {
          "src": "images/unit3/xed_yed_formulas.png",
          "alt": "Formulas for XED and YED with sign interpretation charts",
          "caption": "Figure 3.3.3: XED sign reveals substitute/complement; YED sign and magnitude reveal normal/luxury/necessity/inferior."
        }
      },

      "classifications": [
        {
          "type": "Substitutes (Positive XED)",
          "value": "$XED > 0$",
          "characteristics": ["Price of B ↑ → Demand for A ↑", "Competing goods", "Similar products", "High XED = close substitutes", "Cross-price sensitive"],
          "behavior": "When goods are substitutes, they compete for the same consumer needs. An increase in the price of one good makes the other relatively cheaper, leading consumers to switch. The magnitude of XED indicates how close the substitutes are. If $XED$ is large (e.g., 0.8 or higher), the goods are close substitutes—consumers will switch readily. If $XED$ is small but positive (e.g., 0.2), they are weak substitutes—some switching occurs but not dramatically. For firms, knowing XED helps assess competitive threats. If your product has a high positive XED with a competitor's product, you must watch their pricing closely. For policymakers, XED helps define relevant markets in antitrust cases—if two products have high positive XED, they're in the same market.",
          
          "image": {
            "src": "images/unit3/substitutes_xed.png",
            "alt": "Two products with arrow showing switching when price changes",
            "caption": "Figure 3.3.4: Substitutes have positive XED—price increase in one increases demand for the other."
          },
          
          "examples": [
            {
              "process": "Coke and Pepsi",
              "explanation": "If Pepsi price increases by 10% and Coke quantity demanded increases by 8%, $XED = 0.8$. These are close substitutes."
            },
            {
              "process": "Butter and margarine",
              "explanation": "Butter price increase leads consumers to buy more margarine. Positive XED indicates they're substitutes."
            },
            {
              "process": "Coffee and tea",
              "explanation": "When coffee prices rise, some consumers switch to tea. Positive XED, though perhaps not as high as Coke/Pepsi."
            }
          ]
        },
        {
          "type": "Complements (Negative XED)",
          "value": "$XED < 0$",
          "characteristics": ["Price of B ↑ → Demand for A ↓", "Goods used together", "Joint demand", "More negative = stronger complement", "Ecosystem effects"],
          "behavior": "When goods are complements, they are consumed together. An increase in the price of one good makes the combined consumption more expensive, reducing demand for both. The magnitude of negative XED indicates how strong the complementary relationship is. Highly negative values (e.g., -0.8) mean the goods are strong complements—changes in one price significantly affect the other. Less negative values (e.g., -0.2) indicate weak complementarity. For firms, understanding complements is important for bundling strategies, cross-selling, and understanding how changes in one product affect the entire product ecosystem. For example, printer companies may sell printers at low prices because they know demand for ink (a complement) will generate ongoing revenue.",
          
          "image": {
            "src": "images/unit3/complements_xed.png",
            "alt": "Two products used together with arrow showing linked demand",
            "caption": "Figure 3.3.5: Complements have negative XED—price increase in one decreases demand for the other."
          },
          
          "examples": [
            {
              "process": "Printers and ink cartridges",
              "explanation": "If printer prices increase by 10% and ink cartridge demand falls by 15%, $XED = -1.5$. Strong complements."
            },
            {
              "process": "Cars and gasoline",
              "explanation": "Higher gas prices reduce demand for gas-guzzling cars. Negative XED indicates they're complements."
            },
            {
              "process": "Smartphones and apps",
              "explanation": "More smartphone sales increase demand for apps. Negative XED (treating phones as Good B, apps as Good A)."
            }
          ]
        },
        {
          "type": "Unrelated Goods (Zero XED)",
          "value": "$XED = 0$",
          "characteristics": ["Price of B ↑ → Demand for A unchanged", "No relationship", "Independent goods", "Different markets", "No cross-effect"],
          "behavior": "When goods are unrelated, changes in the price of one have no effect on demand for the other. This is common for goods that serve completely different purposes and are not used together. For example, the price of shoes has no effect on demand for bread. In practice, XED is rarely exactly zero, but values close to zero indicate that any relationship is economically insignificant. For firms, unrelated goods mean you don't need to monitor pricing in those markets. For economists, identifying unrelated goods helps define market boundaries.",
          
          "image": {
            "src": "images/unit3/unrelated_xed.png",
            "alt": "Two completely different products with no connection",
            "caption": "Figure 3.3.6: Unrelated goods have XED near zero—price changes don't affect each other."
          },
          
          "examples": [
            {
              "process": "Shoes and bread",
              "explanation": "The price of shoes has no effect on demand for bread. XED is approximately zero."
            },
            {
              "process": "Laptops and oranges",
              "explanation": "These are in completely different markets. Price changes in one don't affect demand for the other."
            }
          ]
        },
        {
          "type": "Normal Goods (Positive YED)",
          "value": "$YED > 0$",
          "characteristics": ["Income ↑ → Demand ↑", "Most goods", "Further divided into luxuries and necessities", "Pro-cyclical demand"],
          "behavior": "Normal goods are those for which demand increases as income increases. This includes the vast majority of goods. Within normal goods, we distinguish between necessities and luxuries based on the magnitude of YED. For all normal goods, demand moves with the business cycle—rising in expansions, falling in recessions. The strength of this relationship depends on the YED value. Firms selling normal goods need to forecast economic conditions to plan production and inventory.",
          
          "image": {
            "src": "images/unit3/normal_goods_yed.png",
            "alt": "Upward-sloping line showing demand increasing with income",
            "caption": "Figure 3.3.7: Normal goods have positive YED—demand rises with income."
          },
          
          "examples": [
            {
              "process": "Clothing",
              "explanation": "As incomes rise, people buy more clothes. Positive YED, typically in the necessity range for basic clothing."
            },
            {
              "process": "Electronics",
              "explanation": "Higher incomes lead to more electronics purchases. Positive YED, often in the luxury range for new devices."
            }
          ]
        },
        {
          "type": "Luxury Goods (Income Elastic)",
          "value": "$YED > 1$",
          "characteristics": ["Demand increases more than income", "Discretionary spending", "Highly pro-cyclical", "Boom in expansions", "Crash in recessions"],
          "behavior": "Luxury goods (also called income-elastic goods) are those for which demand increases more than proportionally with income. A 10% increase in income leads to more than a 10% increase in demand. These are typically discretionary items—things people want but don't need. Examples include restaurant meals, luxury cars, international travel, high-end electronics, and entertainment. Luxury goods businesses are highly sensitive to economic cycles. During booms, they thrive. During recessions, they suffer disproportionately as consumers cut back on discretionary spending. This volatility requires careful financial management and forecasting.",
          
          "image": {
            "src": "images/unit3/luxury_yed.png",
            "alt": "Steep line showing demand rising faster than income",
            "caption": "Figure 3.3.8: Luxury goods have YED > 1—demand increases more than income."
          },
          
          "examples": [
            {
              "process": "Restaurant meals",
              "explanation": "A 10% income increase might lead to a 15% increase in restaurant spending. $YED = 1.5$, luxury."
            },
            {
              "process": "Sports cars",
              "explanation": "Luxury vehicle sales are highly sensitive to income changes. High YED values (often >2) indicate strong luxury status."
            }
          ]
        },
        {
          "type": "Necessities (Income Inelastic)",
          "value": "$0 < YED < 1$",
          "characteristics": ["Demand increases less than income", "Basic needs", "Stable demand", "Low sensitivity to cycles", "Budget share falls as income rises"],
          "behavior": "Necessities (income-inelastic goods) are those for which demand increases less than proportionally with income. A 10% increase in income leads to less than a 10% increase in demand. These are basic items people need regardless of income—food staples, utilities, basic clothing, gasoline. As people get richer, they spend a smaller share of their income on necessities (Engel's Law). Necessities are relatively stable through economic cycles. Recessions cause only small declines in demand; expansions cause only small increases. This stability makes them attractive for investors seeking steady returns, though growth potential is limited.",
          
          "image": {
            "src": "images/unit3/necessity_yed.png",
            "alt": "Shallow line showing demand rising slower than income",
            "caption": "Figure 3.3.9: Necessities have 0 < YED < 1—demand increases less than income."
          },
          
          "examples": [
            {
              "process": "Basic food items",
              "explanation": "A 10% income increase might lead to only a 2% increase in spending on staples like rice or bread. $YED = 0.2$."
            },
            {
              "process": "Electricity",
              "explanation": "Electricity usage rises with income but much slower. People may add a few appliances but don't increase usage proportionally."
            }
          ]
        },
        {
          "type": "Inferior Goods (Negative YED)",
          "value": "$YED < 0$",
          "characteristics": ["Income ↑ → Demand ↓", "Lower-quality alternatives", "Counter-cyclical", "Better in recessions", "Examples: generic brands, public transit"],
          "behavior": "Inferior goods are those for which demand decreases as income rises. Consumers switch to better alternatives when they can afford them. This doesn't mean the goods are low quality in an absolute sense—they're goods that people replace with something else as they get richer. Examples include generic/store brands, public transportation, instant noodles, and used clothing. Inferior goods have counter-cyclical demand: they may do better in recessions as consumers trade down, and worse in expansions as consumers trade up. For firms selling inferior goods, marketing strategies often emphasize value and affordability. They need to be prepared for declining demand as economies grow, unless they can upgrade their brand positioning.",
          
          "image": {
            "src": "images/unit3/inferior_yed.png",
            "alt": "Downward-sloping line showing demand falling as income rises",
            "caption": "Figure 3.3.10: Inferior goods have negative YED—demand falls as income rises."
          },
          
          "examples": [
            {
              "process": "Generic cereal",
              "explanation": "As incomes rise, consumers switch from generic to name-brand cereal. Demand for generic falls—negative YED."
            },
            {
              "process": "Public transit",
              "explanation": "Higher incomes lead people to buy cars, reducing bus and subway ridership. Public transit is often an inferior good."
            },
            {
              "process": "Instant noodles",
              "explanation": "College students eat instant noodles when budgets are tight. After graduation with higher income, they switch to better food."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Cross-Price Elasticity Sign Reveals Relationship Between Goods",
          "statement": "The sign of cross-price elasticity of demand tells us whether goods are substitutes or complements. A positive sign indicates substitutes—the goods compete for the same consumer needs. A negative sign indicates complements—the goods are used together. This information is crucial for businesses to understand their competitive landscape and for policymakers to define relevant markets. The magnitude matters too: large positive values mean close substitutes, making demand highly sensitive to competitors' prices. Large negative values mean strong complements, creating interdependencies that can be exploited through bundling or ecosystem strategies. Zero or near-zero values mean goods are unrelated, allowing firms to ignore pricing in those markets.",
          "application": "When analyzing market relationships, calculate XED or interpret given values. Positive XED means watch your competitors' prices. Negative XED means consider complementary products in your strategy.",
          "example": "A company finds that its product has XED = 0.9 with a competitor's product. This indicates very close substitutes—a small price cut by the competitor could steal significant market share. The company must monitor that competitor closely.",
          
          "image": {
            "src": "images/unit3/xed_sign.png",
            "alt": "Number line: negative = complements, zero = unrelated, positive = substitutes",
            "caption": "Figure 3.3.11: XED sign tells the relationship between goods."
          }
        },
        {
          "principle": "Income Elasticity Classifies Goods and Predicts Cyclical Sensitivity",
          "statement": "Income elasticity of demand tells us how sensitive a good is to economic cycles. Luxury goods ($YED > 1$) are highly sensitive—they boom in expansions and crash in recessions. Necessities ($0 < YED < 1$) are stable—demand changes little with income. Inferior goods ($YED < 0$) are counter-cyclical—they may actually do better in recessions as consumers trade down. This information is vital for business planning. Luxury goods firms need strong balance sheets to survive downturns. Necessity producers can rely on steady demand. Inferior goods firms may need to upgrade brands as economies grow. For investors, YED helps construct portfolios with appropriate risk profiles.",
          "application": "When evaluating a business or industry, consider YED. High YED means high growth potential but high risk. Low YED means stability but limited upside. Negative YED means the business may shrink as the economy grows.",
          "example": "A luxury car manufacturer has YED = 2.5. In a boom with 5% income growth, sales might increase 12.5%. In a recession with 5% income decline, sales might fall 12.5%—high volatility. A utility company with YED = 0.2 sees only 1% changes—much more stable.",
          
          "image": {
            "src": "images/unit3/yed_cyclical.png",
            "alt": "Graph showing luxury goods volatile, necessities stable, inferior goods counter-cyclical over business cycle",
            "caption": "Figure 3.3.12: YED predicts how sensitive demand is to economic cycles."
          }
        },
        {
          "principle": "Engel's Law: As Income Rises, Share Spent on Food Falls",
          "statement": "Engel's Law, named after statistician Ernst Engel, states that as household income increases, the percentage of income spent on food decreases, even though total food expenditure may rise. This reflects that food is a necessity with income elasticity less than 1. More broadly, the budget share of necessities tends to fall with income, while the share of luxuries rises. This principle has important implications for economic development: as countries grow, agriculture becomes a smaller share of GDP, and industries producing luxuries and services grow. It also explains why poverty measures often focus on food spending—poor households spend a large share of income on food, so food price increases hit them hardest.",
          "application": "When analyzing consumer behavior or economic development, consider how spending patterns change with income. Use YED to predict which sectors will grow fastest as incomes rise.",
          "example": "A family earning $\\$20,000$ spends 40% on food. When income rises to $\\$40,000$, food spending might increase to $\\$12,000$ (30% of income). The share fell even though total spending rose, confirming food as a necessity.",
          
          "image": {
            "src": "images/unit3/engels_law.png",
            "alt": "Pie charts showing food share decreasing as income increases",
            "caption": "Figure 3.3.13: Engel's Law—food share of budget falls as income rises."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating and Interpreting Cross-Price Elasticity",
          
          "image": {
            "src": "images/unit3/xed_example1.png",
            "alt": "Table of price and quantity changes for two goods",
            "caption": "Figure 3.3.14: Calculate XED and determine relationship between goods."
          },
          
          "problem": "When the price of coffee increases from $\\$4$ to $\\$5$ per pound, the quantity demanded of tea increases from 10,000 to 12,000 units per month.<br>a) Calculate the cross-price elasticity of demand using the midpoint formula.<br>b) Are coffee and tea substitutes or complements? Explain.<br>c) If the price of coffee increased by 8%, what would happen to tea demand?<br>d) How close of substitutes are they?",
          
          "step_by_step": [
            {
              "step": "Identify values",
              "explanation": "Good A (tea): $Q_1 = 10,000$, $Q_2 = 12,000$. Good B (coffee): $P_1 = \\$4$, $P_2 = \\$5$."
            },
            {
              "step": "Calculate % change in quantity of tea",
              "explanation": "Midpoint Q $= (10,000 + 12,000)/2 = 11,000$. Change Q $= 2,000$. $\\%\\Delta Q_{tea} = (2,000/11,000) \\times 100 = 18.18\\%$"
            },
            {
              "step": "Calculate % change in price of coffee",
              "explanation": "Midpoint P $= (4 + 5)/2 = 4.5$. Change P $= 1$. $\\%\\Delta P_{coffee} = (1/4.5) \\times 100 = 22.22\\%$"
            },
            {
              "step": "Calculate XED",
              "explanation": "$XED = \\%\\Delta Q_{tea} / \\%\\Delta P_{coffee} = 18.18\\% / 22.22\\% = 0.818$"
            },
            {
              "step": "Interpret sign",
              "explanation": "XED is positive (0.818), so coffee and tea are substitutes. The positive sign means when coffee price increases, tea demand increases."
            },
            {
              "step": "Predict 8% coffee price increase",
              "explanation": "Using XED = 0.818, $\\%\\Delta Q_{tea} = XED \\times \\%\\Delta P_{coffee} = 0.818 \\times 8\\% = 6.54\\%$. Tea demand would increase by about 6.54%."
            },
            {
              "step": "Assess closeness",
              "explanation": "XED of 0.818 is relatively high, indicating fairly close substitutes. Consumers respond significantly to coffee price changes."
            }
          ],
          
          "final_answer": "a) $XED = 0.818$. b) Substitutes (positive XED). c) Tea demand would increase by 6.54%. d) Relatively close substitutes.",
          "concept_applied": "Positive XED indicates substitutes. The magnitude indicates how close the substitutes are—higher values mean closer substitutes."
        },
        {
          "title": "Calculating and Interpreting Income Elasticity",
          
          "image": {
            "src": "images/unit3/yed_example1.png",
            "alt": "Income and quantity data for three goods",
            "caption": "Figure 3.3.15: Calculate YED and classify each good."
          },
          
          "problem": "Average income in a city increases from $\\$50,000$ to $\\$55,000$ per year. During this period:<br>- Quantity demanded of restaurant meals increases from 8,000 to 9,200 per month.<br>- Quantity demanded of basic groceries increases from 20,000 to 21,000 per month.<br>- Quantity demanded of instant noodles decreases from 5,000 to 4,500 per month.<br>a) Calculate income elasticity for each good.<br>b) Classify each good as luxury, necessity, or inferior.<br>c) Predict what would happen to demand for each if income fell by 10%.",
          
          "step_by_step": [
            {
              "step": "Calculate % change in income",
              "explanation": "Midpoint income $= (50,000 + 55,000)/2 = 52,500$. Change income $= 5,000$. $\\%\\Delta I = (5,000/52,500) \\times 100 = 9.52\\%$"
            },
            {
              "step": "Restaurant meals",
              "explanation": "Midpoint Q $= (8,000 + 9,200)/2 = 8,600$. Change Q $= 1,200$. $\\%\\Delta Q = (1,200/8,600) \\times 100 = 13.95\\%$. $YED = 13.95\\% / 9.52\\% = 1.47$. Since $YED > 1$, restaurant meals are a luxury."
            },
            {
              "step": "Basic groceries",
              "explanation": "Midpoint Q $= (20,000 + 21,000)/2 = 20,500$. Change Q $= 1,000$. $\\%\\Delta Q = (1,000/20,500) \\times 100 = 4.88\\%$. $YED = 4.88\\% / 9.52\\% = 0.51$. Since $0 < YED < 1$, groceries are a necessity."
            },
            {
              "step": "Instant noodles",
              "explanation": "Midpoint Q $= (5,000 + 4,500)/2 = 4,750$. Change Q $= -500$. $\\%\\Delta Q = (-500/4,750) \\times 100 = -10.53\\%$. $YED = -10.53\\% / 9.52\\% = -1.11$. Since $YED < 0$, instant noodles are an inferior good."
            },
            {
              "step": "Predict 10% income decrease",
              "explanation": "Restaurant meals: $\\%\\Delta Q = YED \\times \\%\\Delta I = 1.47 \\times (-10\\%) = -14.7\\%$<br>Groceries: $0.51 \\times (-10\\%) = -5.1\\%$<br>Noodles: $-1.11 \\times (-10\\%) = +11.1\\%$"
            }
          ],
          
          "final_answer": "a) Restaurant meals: $YED = 1.47$, Groceries: $YED = 0.51$, Noodles: $YED = -1.11$. b) Restaurant meals = luxury, Groceries = necessity, Noodles = inferior. c) Restaurant meals -14.7%, Groceries -5.1%, Noodles +11.1%.",
          "concept_applied": "YED > 1 = luxury, 0 < YED < 1 = necessity, YED < 0 = inferior. Magnitude indicates sensitivity."
        },
        {
          "title": "Using Elasticities for Business Strategy",
          
          "image": {
            "src": "images/unit3/xed_yed_example3.png",
            "alt": "Business scenario with elasticity data",
            "caption": "Figure 3.3.16: Use elasticity information to guide business decisions."
          },
          
          "problem": "A company sells two products: Premium coffee and generic coffee. Research provides the following elasticities:<br>- Income elasticity for premium coffee: $YED = 1.8$<br>- Income elasticity for generic coffee: $YED = -0.6$<br>- Cross-price elasticity between premium and generic: $XED = 0.7$<br>a) Classify each coffee type.<br>b) If the economy is entering a recession with expected 5% income decline, how will demand for each coffee change?<br>c) If the company raises premium coffee price by 10%, how will generic coffee demand change?<br>d) What pricing strategy would you recommend during the recession?",
          
          "step_by_step": [
            {
              "step": "Classify coffees",
              "explanation": "Premium coffee: $YED = 1.8 > 1$, so it's a luxury good.<br>Generic coffee: $YED = -0.6 < 0$, so it's an inferior good.<br>Positive XED (0.7) means they are substitutes."
            },
            {
              "step": "Recession impact (5% income decline)",
              "explanation": "Premium coffee: $\\%\\Delta Q = 1.8 \\times (-5\\%) = -9\\%$<br>Generic coffee: $\\%\\Delta Q = -0.6 \\times (-5\\%) = +3\\%$"
            },
            {
              "step": "Premium price increase effect on generic",
              "explanation": "$\\%\\Delta Q_{generic} = XED \\times \\%\\Delta P_{premium} = 0.7 \\times 10\\% = 7\\%$ increase in generic coffee demand."
            },
            {
              "step": "Pricing strategy recommendation",
              "explanation": "During recession, premium coffee demand will fall sharply (-9%). The company could consider: (1) Promoting generic coffee to capture the +3% organic increase and additional customers switching from premium if premium prices are raised. (2) Possibly raising premium prices slightly to capture revenue from remaining loyal customers while pushing more customers to generic. (3) Bundling strategies or loyalty programs to retain premium customers."
            }
          ],
          
          "final_answer": "a) Premium = luxury, Generic = inferior, Substitutes. b) Premium -9%, Generic +3%. c) Generic demand +7%. d) Consider promoting generic coffee, possibly raising premium prices slightly to shift customers to generic while maintaining revenue.",
          "concept_applied": "Elasticities guide business strategy: YED predicts cyclical sensitivity, XED predicts cross-effects of pricing decisions."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Goods and Variables",
          "description": "Determine which goods are involved and whether you're analyzing cross-price or income elasticity.",
          "mechanism": "For XED: Good A (quantity) and Good B (price). For YED: Good (quantity) and income (I).",
          "result": "Clear definition of variables.",
          
          "image": {
            "src": "images/unit3/xed_yed_step1.png",
            "alt": "Labels for goods and variables",
            "caption": "Figure 3.3.17: Step 1 - Identify goods and which elasticity to calculate."
          }
        },
        {
          "step": 2,
          "process": "Gather Data",
          "description": "Collect initial and new values for quantity and either other price (XED) or income (YED).",
          "mechanism": "Record $Q_1$, $Q_2$, and either $P_{other1}$, $P_{other2}$ for XED or $I_1$, $I_2$ for YED.",
          "result": "Data points for calculation.",
          
          "image": {
            "src": "images/unit3/xed_yed_step2.png",
            "alt": "Table with before and after values",
            "caption": "Figure 3.3.18: Step 2 - Gather data on quantities and either other price or income."
          }
        },
        {
          "step": 3,
          "process": "Calculate Percentage Changes Using Midpoint Formula",
          "description": "Find percentage changes for quantity and the independent variable.",
          "mechanism": "$\\%\\Delta Q = \\frac{Q_2 - Q_1}{(Q_2 + Q_1)/2} \\times 100$. Same for $P_{other}$ or $I$.",
          "result": "Percentage changes.",
          
          "image": {
            "src": "images/unit3/xed_yed_step3.png",
            "alt": "Midpoint formula calculations",
            "caption": "Figure 3.3.19: Step 3 - Calculate percentage changes using midpoint formula."
          }
        },
        {
          "step": 4,
          "process": "Compute Elasticity",
          "description": "Divide percentage change in quantity by percentage change in independent variable.",
          "mechanism": "$XED = \\%\\Delta Q_A / \\%\\Delta P_B$ or $YED = \\%\\Delta Q / \\%\\Delta I$.",
          "result": "Elasticity value.",
          
          "image": {
            "src": "images/unit3/xed_yed_step4.png",
            "alt": "Division of percentage changes",
            "caption": "Figure 3.3.20: Step 4 - Compute elasticity."
          }
        },
        {
          "step": 5,
          "process": "Interpret the Result",
          "description": "Use sign and magnitude to classify the relationship or good type.",
          "mechanism": "For XED: positive = substitutes, negative = complements, zero = unrelated. For YED: >1 = luxury, 0-1 = necessity, <0 = inferior.",
          "result": "Economic interpretation and business implications.",
          
          "image": {
            "src": "images/unit3/xed_yed_step5.png",
            "alt": "Interpretation charts for XED and YED",
            "caption": "Figure 3.3.21: Step 5 - Interpret sign and magnitude."
          }
        }
      ],

      "image": {
        "src": "images/unit3/xed_yed_summary.png",
        "alt": "Comprehensive summary: XED signs with examples, YED classifications with examples",
        "caption": "Figure 3.3.22: Cross-price and income elasticity summary."
      }
    }
  ],

  "key_terms": [
    "Cross-price elasticity of demand (XED)",
    "Income elasticity of demand (YED)",
    "Substitutes",
    "Complements",
    "Unrelated goods",
    "Normal goods",
    "Luxury goods",
    "Necessities",
    "Inferior goods",
    "Income elastic",
    "Income inelastic",
    "Engel's Law",
    "Budget share",
    "Cyclical sensitivity",
    "Pro-cyclical",
    "Counter-cyclical",
    "Midpoint formula",
    "Percentage change",
    "Sign interpretation",
    "Magnitude interpretation"
  ],

  "summary": "Cross-price elasticity of demand $(XED = \\frac{\\%\\Delta Q_A}{\\%\\Delta P_B})$ measures how demand for one good responds to price changes in another. Positive XED indicates substitutes (Coke and Pepsi); negative XED indicates complements (printers and ink); zero XED means unrelated goods. The magnitude indicates the strength of the relationship. Income elasticity of demand $(YED = \\frac{\\%\\Delta Q}{\\%\\Delta I})$ measures how demand responds to income changes. Positive YED indicates normal goods, with $YED > 1$ for luxuries (income elastic) and $0 < YED < 1$ for necessities (income inelastic). Negative YED indicates inferior goods. These elasticities have important business applications: XED helps understand competitive dynamics and identify complementary products; YED helps forecast demand over the business cycle and classify products for strategic planning. Engel's Law states that as income rises, the share spent on food (a necessity) falls. Understanding these concepts is essential for market analysis, business strategy, and predicting consumer behavior."
}
