{
  "expanded_description": "Why do some goods, like gasoline, see only small changes in consumption when prices rise, while others, like restaurant meals, see dramatic drops? The answer lies in elasticity—a measure of how responsive buyers and sellers are to price changes. Elasticity is one of the most practical concepts in economics, used by businesses to set prices, by governments to predict tax revenues, and by policymakers to understand the impact of regulations. In this unit, we'll explore different types of elasticity, how to calculate them, what they tell us about markets, and how they apply to real-world decisions.",
  
  "core_concept": {
    "principle": "Elasticity measures the responsiveness of one variable to changes in another variable. In economics, we use several types of elasticity: (1) Price elasticity of demand (PED): Measures how much quantity demanded responds to a change in price. $PED = (\\% \\Delta Q_d) / (\\% \\Delta P)$. (2) Price elasticity of supply (PES): Measures how much quantity supplied responds to a change in price. $PES = (\\% \\Delta Q_s) / (\\% \\Delta P)$. (3) Cross-price elasticity of demand (XED): Measures how quantity demanded of one good responds to a change in price of another good. $XED = (\\% \\Delta Q_d \\text{ of Good A}) / (\\% \\Delta P \\text{ of Good B})$. (4) Income elasticity of demand (YED): Measures how quantity demanded responds to a change in consumer income. $YED = (\\% \\Delta Q_d) / (\\% \\Delta I)$. Elasticity values tell us whether demand is elastic $(|PED| > 1)$, inelastic $(|PED| < 1)$, or unit elastic $(|PED| = 1)$. These concepts help predict consumer behavior, business revenue, and market outcomes.",
    
    "explanation": "Think of elasticity like a rubber band. Some rubber bands stretch a lot when you pull them—they're elastic. Others barely stretch at all—they're inelastic. Demand works the same way: for some goods, quantity changes a lot when price changes (elastic demand). For others, quantity barely changes (inelastic demand). The elasticity depends on factors like whether the good has substitutes, whether it's a necessity, and how much time consumers have to adjust.",
    
    "image": {
      "src": "images/unit3/elasticity_overview.png",
      "alt": "Rubber band stretching comparison: one stretches easily (elastic), one barely stretches (inelastic)",
      "caption": "Figure 3.0.1: Elasticity measures responsiveness—like how much a rubber band stretches."
    }
  },

  "sections": [
    {
      "section_title": "3.1 Price Elasticity of Demand",
      "introduction": "Why do some goods, like gasoline, see only small changes in consumption when prices rise, while others, like restaurant meals, see dramatic drops? The answer lies in price elasticity of demand—a measure of how responsive consumers are to price changes. Understanding elasticity helps businesses set prices, governments predict tax revenue, and economists analyze market behavior. In this section, we'll explore what price elasticity means, how to calculate it, the factors that determine it, and how to interpret different elasticity values.",
      
      "introduction_image": {
        "src": "images/unit3/ped_intro.png",
        "alt": "Comparison of two products: gasoline (small consumption change when price rises) and restaurant meals (large consumption change)",
        "caption": "Figure 3.1.1: Price elasticity varies—gasoline demand is inelastic, restaurant meals are more elastic."
      },
      
      "key_concept": {
        "definition": "Price elasticity of demand (PED) measures the responsiveness of quantity demanded to a change in price. It is calculated as the percentage change in quantity demanded divided by the percentage change in price. $PED = \\frac{\\% \\Delta Q_d}{\\% \\Delta P}$. Since price and quantity move in opposite directions (law of demand), PED is usually negative, but economists often use the absolute value for interpretation. (1) Elastic demand: $|PED| > 1$. Quantity demanded changes proportionally more than price. Consumers are responsive to price changes. (2) Inelastic demand: $|PED| < 1$. Quantity demanded changes proportionally less than price. Consumers are not very responsive. (3) Unit elastic demand: $|PED| = 1$. Quantity demanded changes proportionally the same as price. (4) Perfectly elastic demand: $|PED| = \\infty$. Consumers will buy any amount at a given price but nothing at a higher price (horizontal demand curve). (5) Perfectly inelastic demand: $|PED| = 0$. Quantity demanded does not change when price changes (vertical demand curve). (6) Midpoint formula: To calculate percentage changes, use the midpoint formula to avoid direction bias: $\\% \\Delta = \\frac{\\text{New} - \\text{Old}}{(\\text{New} + \\text{Old})/2} \\times 100$. (7) Determinants of PED: (a) Availability of substitutes: More substitutes → more elastic. (b) Necessity vs luxury: Necessities tend to be inelastic; luxuries elastic. (c) Share of budget: Goods that take a large share of income tend to be more elastic. (d) Time horizon: Demand is more elastic in the long run as consumers can adjust behavior. (e) Definition of market: Narrowly defined goods have more elastic demand than broadly defined goods.",
        
        "context": "The concept of elasticity was developed by Alfred Marshall in the late 19th century to quantify the intuitive idea of responsiveness. It remains one of the most widely used tools in applied economics. Businesses use elasticity to set prices—if demand is inelastic, raising prices increases revenue; if elastic, raising prices decreases revenue. Governments use elasticity to predict the effects of taxes and to design policies. Understanding elasticity is essential for any real-world application of supply and demand.",
        
        "image": {
          "src": "images/unit3/ped_curve_comparison.png",
          "alt": "Comparison of steep demand curve (inelastic) and flat demand curve (elastic)",
          "caption": "Figure 3.1.2: Steeper demand curves are more inelastic; flatter curves are more elastic."
        }
      },

      "classifications": [
        {
          "type": "Elastic Demand",
          "value": "$|PED| > 1$",
          "characteristics": ["Quantity changes more than price", "Flat demand curve", "Many substitutes", "Luxury goods", "Large budget share", "Long time horizon"],
          "behavior": "When demand is elastic, consumers are highly responsive to price changes. A small price increase leads to a large drop in quantity demanded. A small price decrease leads to a large increase in quantity demanded. This typically occurs for goods with many close substitutes (like specific brands of cereal), luxury items (like restaurant meals), goods that take a large share of income (like cars), and in the long run when consumers have time to adjust. For businesses with elastic demand, raising prices will reduce total revenue because the quantity drop outweighs the price increase. Lowering prices will increase total revenue.",
          
          "image": {
            "src": "images/unit3/elastic_demand.png",
            "alt": "Relatively flat demand curve showing large quantity change for small price change",
            "caption": "Figure 3.1.3: Elastic demand—quantity changes more than price."
          },
          
          "examples": [
            {
              "process": "Soda brands",
              "explanation": "If Coca-Cola raises its price by 10% while Pepsi stays the same, many consumers will switch to Pepsi. Quantity demanded of Coke might fall by 20%—elastic demand $(PED = 2.0)$."
            },
            {
              "process": "Restaurant meals",
              "explanation": "A 10% increase in restaurant prices might lead to a 15% decrease in meals eaten out. Restaurant meals are elastic $(PED = 1.5)$ because they're a luxury with alternatives (cooking at home)."
            }
          ]
        },
        {
          "type": "Inelastic Demand",
          "value": "$|PED| < 1$",
          "characteristics": ["Quantity changes less than price", "Steep demand curve", "Few substitutes", "Necessities", "Small budget share", "Short time horizon"],
          "behavior": "When demand is inelastic, consumers are not very responsive to price changes. A large price increase leads to only a small drop in quantity demanded. A large price decrease leads to only a small increase in quantity demanded. This typically occurs for goods with few substitutes (like insulin), necessities (like basic food), goods that take a small share of income (like salt), and in the short run when consumers can't easily adjust. For businesses with inelastic demand, raising prices will increase total revenue because the price increase outweighs the small quantity drop. Lowering prices will decrease total revenue.",
          
          "image": {
            "src": "images/unit3/inelastic_demand.png",
            "alt": "Relatively steep demand curve showing small quantity change for large price change",
            "caption": "Figure 3.1.4: Inelastic demand—quantity changes less than price."
          },
          
          "examples": [
            {
              "process": "Gasoline",
              "explanation": "A 20% increase in gas prices might lead to only a 5% decrease in gallons purchased in the short run. Gasoline is inelastic $(PED = 0.25)$ because people still need to drive to work."
            },
            {
              "process": "Prescription medications",
              "explanation": "Life-saving drugs have few substitutes. A price increase leads to little change in quantity demanded—highly inelastic demand."
            }
          ]
        },
        {
          "type": "Unit Elastic Demand",
          "value": "$|PED| = 1$",
          "characteristics": ["Quantity changes same percent as price", "Revenue unchanged by price changes", "Boundary between elastic/inelastic", "Theoretical midpoint"],
          "behavior": "When demand is unit elastic, the percentage change in quantity demanded exactly equals the percentage change in price. A 10% price increase leads to a 10% decrease in quantity demanded. For businesses with unit elastic demand, total revenue remains constant when price changes—the price effect and quantity effect exactly offset each other. Unit elasticity is a theoretical boundary between elastic and inelastic regions of a demand curve. Most real-world goods are not perfectly unit elastic across all prices, but every demand curve has a point where it is unit elastic.",
          
          "image": {
            "src": "images/unit3/unit_elastic.png",
            "alt": "Demand curve with point of unit elasticity marked",
            "caption": "Figure 3.1.5: Unit elastic demand—quantity changes by same percentage as price."
          },
          
          "examples": [
            {
              "process": "Theoretical boundary",
              "explanation": "A 10% price increase leads to exactly 10% quantity decrease. Total revenue stays the same. This is rare for an entire curve but occurs at specific points."
            }
          ]
        },
        {
          "type": "Perfectly Inelastic Demand",
          "value": "$PED = 0$",
          "characteristics": ["Vertical demand curve", "Quantity doesn't change with price", "No substitutes", "Absolute necessity", "Theoretical extreme"],
          "behavior": "Perfectly inelastic demand means quantity demanded does not change at all when price changes. The demand curve is vertical. Consumers will buy the same amount regardless of price. This is a theoretical extreme—in reality, even life-saving drugs have some price responsiveness if people cannot afford them. However, some goods approach perfect inelasticity for very small price changes or for essential goods with no substitutes. For a perfectly inelastic good, any price increase (up to the point of affordability) generates more revenue, and any price decrease reduces revenue.",
          
          "image": {
            "src": "images/unit3/perfectly_inelastic.png",
            "alt": "Vertical demand curve showing no quantity change with price",
            "caption": "Figure 3.1.6: Perfectly inelastic demand—quantity doesn't respond to price."
          },
          
          "examples": [
            {
              "process": "Life-saving insulin",
              "explanation": "For a diabetic, insulin is essential. In the short run, they will pay whatever price necessary to get the quantity they need, approaching perfectly inelastic demand."
            },
            {
              "process": "Addictive substances",
              "explanation": "For addicts, certain substances may have nearly perfectly inelastic demand in the short run—they will sacrifice almost anything to obtain them."
            }
          ]
        },
        {
          "type": "Perfectly Elastic Demand",
          "value": "$PED = \\infty$",
          "characteristics": ["Horizontal demand curve", "Any quantity at one price", "Zero quantity at higher price", "Perfect substitutes", "Theoretical extreme"],
          "behavior": "Perfectly elastic demand means consumers will buy any quantity at a specific price, but nothing at any higher price. The demand curve is horizontal. This occurs for goods with perfect substitutes—if a firm raises its price even slightly above the market price, consumers instantly switch to competitors. In perfectly competitive markets, each firm faces perfectly elastic demand for its product. For a perfectly elastic good, raising price even a little causes quantity demanded to drop to zero, so firms must accept the market price.",
          
          "image": {
            "src": "images/unit3/perfectly_elastic.png",
            "alt": "Horizontal demand curve showing infinite responsiveness at a given price",
            "caption": "Figure 3.1.7: Perfectly elastic demand—any quantity at one price, zero at higher prices."
          },
          
          "examples": [
            {
              "process": "Wheat farmer",
              "explanation": "An individual wheat farmer faces perfectly elastic demand. If they try to charge even 1 cent above the market price, buyers will instantly buy from other farmers selling identical wheat."
            },
            {
              "process": "Generic products",
              "explanation": "For identical generic products, consumers will buy from the cheapest source. Any price above the market leads to zero sales."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Elasticity Is Calculated Using Percentage Changes",
          "statement": "Price elasticity of demand is calculated as the percentage change in quantity demanded divided by the percentage change in price. Using percentage changes rather than absolute changes allows comparison across different goods and price levels. The midpoint formula is preferred to avoid the problem of getting different elasticity values depending on whether price increases or decreases. Midpoint formula: $PED = \\frac{(Q_2 - Q_1) / ((Q_2 + Q_1)/2)}{(P_2 - P_1) / ((P_2 + P_1)/2)}$. This gives the same elasticity regardless of direction. The result is usually negative (since price and quantity move opposite), but economists often use the absolute value for discussion. Understanding how to calculate and interpret elasticity correctly is essential for all applications.",
          "application": "When calculating elasticity, always use the midpoint formula for accuracy. For interpretation, remember that $|PED| > 1$ means elastic, $|PED| < 1$ means inelastic, and $|PED| = 1$ means unit elastic.",
          "example": "Price rises from \\$4 to \\$6 (50% increase using simple formula, but using midpoint: $(6-4)/((6+4)/2) = 2/5 = 40\\%$). Quantity falls from 100 to 60 (40% decrease using simple formula, but using midpoint: $(60-100)/((60+100)/2) = -40/80 = -50\\%$). $PED = -50\\%/40\\% = -1.25$, so elastic $(|1.25| > 1)$.",
          
          "image": {
            "src": "images/unit3/midpoint_formula.png",
            "alt": "Midpoint formula with example calculation",
            "caption": "Figure 3.1.8: Use the midpoint formula to calculate elasticity accurately."
          }
        },
        {
          "principle": "Availability of Substitutes Is the Key Determinant of Elasticity",
          "statement": "The most important factor affecting price elasticity of demand is the availability of substitutes. Goods with many close substitutes tend to have elastic demand because consumers can easily switch when price rises. Goods with few or no substitutes tend to have inelastic demand because consumers have no alternatives. This explains why narrowly defined goods (like a specific brand of cereal) have more elastic demand than broadly defined goods (like all food). It also explains why necessities (which by definition have few substitutes) are inelastic, while luxuries (which we can do without) are elastic. Other determinants matter, but substitutes are the primary driver.",
          "application": "When predicting elasticity, first ask: How many substitutes does this good have? More substitutes → more elastic. Also consider how close the substitutes are—perfect substitutes lead to perfectly elastic demand.",
          "example": "Demand for a specific brand of bottled water is highly elastic because many other brands are nearly identical. Demand for all bottled water is less elastic because substitutes (tap water) are less perfect. Demand for all beverages is even less elastic.",
          
          "image": {
            "src": "images/unit3/substitutes_elasticity.png",
            "alt": "Diagram showing more substitutes leading to flatter (more elastic) demand curve",
            "caption": "Figure 3.1.9: More substitutes = more elastic demand."
          }
        },
        {
          "principle": "Time Horizon Affects Elasticity—Long Run Is More Elastic",
          "statement": "Demand becomes more elastic over time. In the short run, consumers may be locked into habits, contracts, or existing capital (like cars that need gasoline). They cannot easily change their behavior. As time passes, they can adjust—buy more fuel-efficient cars, find alternatives, change habits. This means the same good can have inelastic demand in the short run but elastic demand in the long run. For example, a price increase for gasoline leads to small short-run reductions (people still drive), but over several years, people buy more fuel-efficient cars, move closer to work, or use public transit, leading to larger long-run reductions.",
          "application": "When analyzing policy or business decisions, consider the time frame. Short-run effects may differ dramatically from long-run effects. Taxes on gasoline may raise revenue in the short run but lead to larger behavioral changes over time.",
          "example": "A 10% increase in gasoline prices might reduce quantity by only 2% in the first year (inelastic, $PED = 0.2$). Over five years, as people replace cars and adjust habits, quantity might fall by 8% (more elastic, $PED = 0.8$).",
          
          "image": {
            "src": "images/unit3/time_horizon.png",
            "alt": "Two demand curves: steep short-run, flatter long-run",
            "caption": "Figure 3.1.10: Demand becomes more elastic over time as consumers adjust."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating PED Using Midpoint Formula",
          
          "image": {
            "src": "images/unit3/ped_example1.png",
            "alt": "Price and quantity data table",
            "caption": "Figure 3.1.11: Calculate PED using midpoint formula."
          },
          
          "problem": "When the price of a product increases from \\$8 to \\$12, quantity demanded falls from 200 to 150 units.<br>a) Calculate the price elasticity of demand using the midpoint formula.<br>b) Is demand elastic, inelastic, or unit elastic?<br>c) Interpret what this elasticity means.",
          
          "step_by_step": [
            {
              "step": "Identify values",
              "explanation": "$P_1 = \\$8$, $P_2 = \\$12$, $Q_1 = 200$, $Q_2 = 150$"
            },
            {
              "step": "Calculate percentage change in price",
              "explanation": "Midpoint price $= (8 + 12)/2 = 10$. Change in price $= 12 - 8 = 4$. $\\%\\Delta P = (4/10) \\times 100 = 40\\%$"
            },
            {
              "step": "Calculate percentage change in quantity",
              "explanation": "Midpoint quantity $= (200 + 150)/2 = 175$. Change in quantity $= 150 - 200 = -50$. $\\%\\Delta Q = (-50/175) \\times 100 = -28.57\\%$"
            },
            {
              "step": "Calculate PED",
              "explanation": "$PED = \\%\\Delta Q / \\%\\Delta P = -28.57\\% / 40\\% = -0.714$"
            },
            {
              "step": "Interpret absolute value",
              "explanation": "$|PED| = 0.714$, which is less than 1. Demand is inelastic."
            },
            {
              "step": "Interpret meaning",
              "explanation": "A 1% increase in price leads to a 0.714% decrease in quantity demanded. Consumers are not very responsive to price changes."
            }
          ],
          
          "final_answer": "a) $PED = -0.714$. b) Inelastic. c) Quantity demanded changes less than proportionally to price.",
          "concept_applied": "The midpoint formula gives consistent elasticity regardless of direction. $|PED| < 1$ means inelastic demand."
        },
        {
          "title": "Comparing Elasticity Across Price Ranges",
          
          "image": {
            "src": "images/unit3/ped_example2.png",
            "alt": "Demand schedule with multiple price points",
            "caption": "Figure 3.1.12: Calculate elasticity between different price ranges."
          },
          
          "problem": "A demand schedule shows:<br>At \\$10, Qd = 100<br>At \\$8, Qd = 120<br>At \\$6, Qd = 140<br>At \\$4, Qd = 160<br>At \\$2, Qd = 180<br>a) Calculate PED between \\$10 and \\$8 using midpoint formula.<br>b) Calculate PED between \\$4 and \\$2.<br>c) Compare and explain why they differ.",
          
          "step_by_step": [
            {
              "step": "Between \\$10 and \\$8",
              "explanation": "$P_1=10$, $P_2=8$, $Q_1=100$, $Q_2=120$. Midpoint P $= 9$, change P $= -2$, $\\%\\Delta P = -2/9 = -22.22\\%$. Midpoint Q $= 110$, change Q $= 20$, $\\%\\Delta Q = 20/110 = 18.18\\%$. $PED = 18.18\\% / -22.22\\% = -0.818$. $|PED| = 0.818$"
            },
            {
              "step": "Between \\$4 and \\$2",
              "explanation": "$P_1=4$, $P_2=2$, $Q_1=160$, $Q_2=180$. Midpoint P $= 3$, change P $= -2$, $\\%\\Delta P = -2/3 = -66.67\\%$. Midpoint Q $= 170$, change Q $= 20$, $\\%\\Delta Q = 20/170 = 11.76\\%$. $PED = 11.76\\% / -66.67\\% = -0.176$. $|PED| = 0.176$"
            },
            {
              "step": "Compare",
              "explanation": "Elasticity is 0.818 at higher prices and 0.176 at lower prices. Demand is more elastic at higher prices along a linear demand curve because the same absolute change represents a larger percentage change at lower price levels."
            }
          ],
          
          "final_answer": "a) $0.818$. b) $0.176$. c) Elasticity varies along a linear demand curve—more elastic at higher prices, less elastic at lower prices.",
          "concept_applied": "Elasticity is not constant along a linear demand curve. It changes as price changes because percentage changes differ."
        },
        {
          "title": "Determinants of Elasticity Analysis",
          
          "image": {
            "src": "images/unit3/ped_example3.png",
            "alt": "List of goods to classify by elasticity",
            "caption": "Figure 3.1.13: Predict relative elasticity of each good."
          },
          
          "problem": "For each pair, predict which good has more elastic demand and explain why:<br>a) Gasoline vs. restaurant meals<br>b) Salt vs. steak<br>c) Insulin vs. allergy medication (multiple brands)<br>d) Coca-Cola vs. all soft drinks<br>e) Electricity in the short run vs. long run",
          
          "step_by_step": [
            {
              "step": "Gasoline vs. restaurant meals",
              "explanation": "Restaurant meals are more elastic. Gasoline has few substitutes in the short run; restaurant meals are a luxury with many alternatives (cooking at home)."
            },
            {
              "step": "Salt vs. steak",
              "explanation": "Steak is more elastic. Salt takes a tiny share of budget and has no substitutes for its purpose; steak is a luxury with many substitutes."
            },
            {
              "step": "Insulin vs. allergy medication",
              "explanation": "Allergy medication is more elastic. Insulin is life-saving with no substitutes; allergy medication has many brands and non-medical alternatives."
            },
            {
              "step": "Coca-Cola vs. all soft drinks",
              "explanation": "Coca-Cola is more elastic. It has many close substitutes (Pepsi, other colas); all soft drinks has fewer substitutes (water, juice, milk)."
            },
            {
              "step": "Electricity short run vs. long run",
              "explanation": "Long run is more elastic. In short run, people can't easily change usage; in long run, they can buy efficient appliances, insulate homes, install solar."
            }
          ],
          
          "final_answer": "a) Restaurant meals. b) Steak. c) Allergy medication. d) Coca-Cola. e) Long run.",
          "concept_applied": "Elasticity determinants: substitutes, necessity vs luxury, budget share, time horizon, and market definition."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Price and Quantity Values",
          "description": "Determine the initial and new prices and quantities.",
          "mechanism": "From data, table, or scenario, identify $P_1$, $P_2$, $Q_1$, $Q_2$.",
          "result": "Four key numbers.",
          
          "image": {
            "src": "images/unit3/ped_step1.png",
            "alt": "Table with price and quantity columns",
            "caption": "Figure 3.1.14: Step 1 - Identify price and quantity values."
          }
        },
        {
          "step": 2,
          "process": "Calculate Percentage Changes Using Midpoint Formula",
          "description": "Find percentage change in price and quantity using midpoint method.",
          "mechanism": "Midpoint P $= (P_1 + P_2)/2$. $\\%\\Delta P = (P_2 - P_1)/\\text{Midpoint P} \\times 100$. Same for quantity.",
          "result": "Percentage changes.",
          
          "image": {
            "src": "images/unit3/ped_step2.png",
            "alt": "Midpoint formula calculation",
            "caption": "Figure 3.1.15: Step 2 - Calculate percentage changes using midpoint formula."
          }
        },
        {
          "step": 3,
          "process": "Compute PED",
          "description": "Divide percentage change in quantity by percentage change in price.",
          "mechanism": "$PED = \\%\\Delta Q / \\%\\Delta P$. Result is typically negative.",
          "result": "Numerical PED value.",
          
          "image": {
            "src": "images/unit3/ped_step3.png",
            "alt": "Division of percentage changes",
            "caption": "Figure 3.1.16: Step 3 - Compute PED = %ΔQ / %ΔP."
          }
        },
        {
          "step": 4,
          "process": "Take Absolute Value for Interpretation",
          "description": "Ignore the negative sign for elasticity classification.",
          "mechanism": "Use $|PED|$ to classify as elastic, inelastic, or unit elastic.",
          "result": "Elasticity classification.",
          
          "image": {
            "src": "images/unit3/ped_step4.png",
            "alt": "Number line showing elastic (>1), unit elastic (=1), inelastic (<1)",
            "caption": "Figure 3.1.17: Step 4 - Classify using absolute value."
          }
        },
        {
          "step": 5,
          "process": "Interpret Economic Meaning",
          "description": "Explain what the elasticity value means for consumer behavior.",
          "mechanism": "If elastic: consumers responsive; if inelastic: consumers not very responsive. Consider determinants.",
          "result": "Economic interpretation.",
          
          "image": {
            "src": "images/unit3/ped_step5.png",
            "alt": "Speech bubble with interpretation",
            "caption": "Figure 3.1.18: Step 5 - Interpret what the elasticity means."
          }
        }
      ],

      "image": {
        "src": "images/unit3/ped_summary.png",
        "alt": "Comprehensive PED summary: formula, classifications, determinants, examples",
        "caption": "Figure 3.1.19: Price elasticity of demand summary."
      }
    }
  ],

  "key_terms": [
    "Price elasticity of demand (PED)",
    "Elastic demand",
    "Inelastic demand",
    "Unit elastic demand",
    "Perfectly elastic demand",
    "Perfectly inelastic demand",
    "Midpoint formula",
    "Percentage change",
    "Determinants of elasticity",
    "Substitutes",
    "Necessities",
    "Luxuries",
    "Budget share",
    "Time horizon",
    "Market definition",
    "Absolute value",
    "Elasticity coefficient",
    "Demand curve slope",
    "Horizontal demand",
    "Vertical demand"
  ],

  "summary": "Price elasticity of demand (PED) measures how responsive quantity demanded is to price changes. It is calculated as the percentage change in quantity demanded divided by the percentage change in price, using the midpoint formula for accuracy: $PED = \\frac{(Q_2 - Q_1) / ((Q_2 + Q_1)/2)}{(P_2 - P_1) / ((P_2 + P_1)/2)}$. Elastic demand $(|PED| > 1)$ means quantity changes proportionally more than price—consumers are responsive. Inelastic demand $(|PED| < 1)$ means quantity changes proportionally less than price—consumers are not very responsive. Unit elastic demand $(|PED| = 1)$ means they change proportionally equally. Perfectly inelastic demand $(PED = 0)$ is a vertical line; perfectly elastic demand $(PED = \\infty)$ is a horizontal line. Key determinants of elasticity include: availability of substitutes (more substitutes = more elastic), whether the good is a necessity or luxury (necessities are inelastic), share of consumer budget (larger share = more elastic), time horizon (longer run = more elastic), and how narrowly the market is defined (narrower = more elastic). Understanding PED is essential for predicting consumer behavior and analyzing market outcomes."
}
