{
  "expanded_description": "Just as we measure consumer responsiveness to price changes with price elasticity of demand, we measure producer responsiveness with price elasticity of supply. This concept tells us how easily and quickly producers can increase or decrease production when prices change. Some industries can ramp up production quickly—think of a t-shirt manufacturer that can add extra shifts. Others take years—think of a vineyard that needs years for new vines to mature. Understanding price elasticity of supply helps explain how markets respond to demand shifts, how prices behave over time, and how taxes and regulations affect different industries.",
  
  "core_concept": {
    "principle": "Price elasticity of supply (PES) measures the responsiveness of quantity supplied to a change in price. It is calculated as the percentage change in quantity supplied divided by the percentage change in price: $PES = \\frac{\\% \\Delta Q_s}{\\% \\Delta P}$. Unlike demand elasticity, supply elasticity is typically positive because price and quantity supplied move in the same direction (law of supply). (1) Elastic supply $(PES > 1)$: Quantity supplied changes proportionally more than price. Producers are highly responsive. (2) Inelastic supply $(PES < 1)$: Quantity supplied changes proportionally less than price. Producers are not very responsive. (3) Unit elastic supply $(PES = 1)$: Quantity supplied changes proportionally the same as price. (4) Perfectly inelastic supply $(PES = 0)$: Quantity supplied does not change when price changes (vertical supply curve). (5) Perfectly elastic supply $(PES = \\infty)$: Producers will supply any quantity at a given price (horizontal supply curve). Key determinants of PES include: time horizon (longer run = more elastic), availability of inputs, spare production capacity, ease of storage, and complexity of production.",
    
    "explanation": "Think of supply elasticity like a factory's ability to respond to orders. If a company gets a big order, can it immediately produce more? If yes, supply is elastic. If it takes years to build new factories or train workers, supply is inelastic. Time is the key—over time, producers can adjust more easily, so supply becomes more elastic.",
    
    "image": {
      "src": "images/unit3/pes_overview.png",
      "alt": "Factory with adjustable production: easy to increase output (elastic) vs fixed capacity (inelastic)",
      "caption": "Figure 3.4.1: Price elasticity of supply measures how easily producers can respond to price changes."
    }
  },

  "sections": [
    {
      "section_title": "3.4 Price Elasticity of Supply",
      "introduction": "Just as we measure consumer responsiveness to price changes with price elasticity of demand, we measure producer responsiveness with price elasticity of supply. This concept tells us how easily and quickly producers can increase or decrease production when prices change. Some industries can ramp up production quickly—think of a t-shirt manufacturer that can add extra shifts. Others take years—think of a vineyard that needs years for new vines to mature. Understanding price elasticity of supply helps explain how markets respond to demand shifts, how prices behave over time, and how taxes and regulations affect different industries.",
      
      "introduction_image": {
        "src": "images/unit3/pes_intro.png",
        "alt": "Comparison: factory easily adding workers (elastic supply) vs farm waiting for crops to grow (inelastic supply)",
        "caption": "Figure 3.4.2: Supply elasticity varies—some industries can respond quickly, others take time."
      },
      
      "key_concept": {
        "definition": "Price elasticity of supply (PES) measures the responsiveness of quantity supplied to a change in price. It is calculated as: $PES = \\frac{\\% \\Delta Q_s}{\\% \\Delta P}$. Since price and quantity supplied move in the same direction (law of supply), PES is typically positive. (1) Elastic supply $(PES > 1)$: Quantity supplied changes proportionally more than price. The supply curve is relatively flat. Producers can increase output easily when price rises. (2) Inelastic supply $(PES < 1)$: Quantity supplied changes proportionally less than price. The supply curve is relatively steep. Producers cannot easily increase output when price rises. (3) Unit elastic supply $(PES = 1)$: Quantity supplied changes proportionally the same as price. (4) Perfectly inelastic supply $(PES = 0)$: Quantity supplied does not change when price changes. Supply curve is vertical. Example: fixed number of seats in a stadium, land in a city. (5) Perfectly elastic supply $(PES = \\infty)$: Producers will supply any quantity at a given price. Supply curve is horizontal. Example: firms in perfectly competitive markets with constant costs. Key determinants of PES: (a) Time horizon: Supply is more elastic in the long run as firms can adjust capacity, enter, or exit. (b) Availability of inputs: If additional inputs are readily available, supply is more elastic. (c) Spare capacity: Firms with idle factories and workers can increase output quickly (elastic). (d) Complexity of production: Simple production processes are more elastic than complex ones. (e) Storage ability: Goods that can be stored easily have more elastic supply (firms can sell from inventory). (f) Geographic scope: Global supply can be more elastic than local supply.",
        
        "context": "The concept of supply elasticity is crucial for understanding market dynamics. When demand increases, the resulting price increase depends heavily on supply elasticity. Inelastic supply leads to large price increases; elastic supply leads to small price increases. This explains why housing prices soar in cities where supply is inelastic, while prices of manufactured goods often fall as technology improves. Supply elasticity also determines who bears the burden of taxes—when supply is inelastic, producers bear more of the tax burden. Understanding PES helps predict market outcomes and design effective policies.",
        
        "image": {
          "src": "images/unit3/pes_curves.png",
          "alt": "Comparison of steep (inelastic) and flat (elastic) supply curves",
          "caption": "Figure 3.4.3: Steeper supply curves are more inelastic; flatter supply curves are more elastic."
        }
      },

      "classifications": [
        {
          "type": "Elastic Supply",
          "value": "$PES > 1$",
          "characteristics": ["Quantity changes more than price", "Flat supply curve", "Easy to increase production", "Spare capacity", "Simple production", "Long time horizon"],
          "behavior": "When supply is elastic, producers can respond substantially to price changes. A small price increase leads to a large increase in quantity supplied. This typically occurs in industries with: (1) Spare production capacity (factories not running at full capacity). (2) Readily available inputs (can hire more workers, buy more materials easily). (3) Simple production processes that can be scaled up quickly. (4) Ability to store goods and sell from inventory. (5) Long time horizons allowing full adjustment. For businesses with elastic supply, price increases lead to significant output expansion, which can capture market share but may require careful cost management.",
          
          "image": {
            "src": "images/unit3/elastic_supply.png",
            "alt": "Flat supply curve showing large quantity increase for small price increase",
            "caption": "Figure 3.4.4: Elastic supply—quantity changes more than price."
          },
          
          "examples": [
            {
              "process": "T-shirt manufacturing",
              "explanation": "A t-shirt factory with idle capacity can easily add shifts when prices rise. Supply is elastic—a 10% price increase might lead to 20% more output $(PES = 2.0)$."
            },
            {
              "process": "Software development",
              "explanation": "Once software is developed, additional copies can be produced at near-zero cost. Supply is highly elastic—even a small price increase can lead to large quantity increases."
            }
          ]
        },
        {
          "type": "Inelastic Supply",
          "value": "$PES < 1$",
          "characteristics": ["Quantity changes less than price", "Steep supply curve", "Difficult to increase production", "Capacity constraints", "Long production times", "Limited inputs"],
          "behavior": "When supply is inelastic, producers cannot easily respond to price changes. A large price increase leads to only a small increase in quantity supplied. This typically occurs in industries with: (1) Capacity constraints (factories running at full capacity). (2) Limited availability of key inputs (skilled labor, specialized materials). (3) Long production times (agriculture, construction). (4) Fixed factors in the short run. (5) Geographic constraints (land in desirable locations). For businesses with inelastic supply, price increases lead to windfall profits (since output can't expand much), while price decreases may cause losses. This is why agricultural prices are volatile—supply is inelastic in the short run, so demand shifts cause large price swings.",
          
          "image": {
            "src": "images/unit3/inelastic_supply.png",
            "alt": "Steep supply curve showing small quantity increase for large price increase",
            "caption": "Figure 3.4.5: Inelastic supply—quantity changes less than price."
          },
          
          "examples": [
            {
              "process": "Farmland",
              "explanation": "The amount of farmland in a city is fixed. Even if prices triple, no new land can be created. Supply is perfectly inelastic $(PES = 0)$ in the short run."
            },
            {
              "process": "Concert tickets",
              "explanation": "The number of seats in a venue is fixed. Higher prices won't create more seats—supply is perfectly inelastic."
            },
            {
              "process": "Wine production",
              "explanation": "Wine requires years for vines to mature. In the short run, supply is inelastic—a price increase won't immediately increase quantity."
            }
          ]
        },
        {
          "type": "Perfectly Inelastic Supply",
          "value": "$PES = 0$",
          "characteristics": ["Vertical supply curve", "Quantity fixed regardless of price", "No response to price", "Absolute constraints", "Short-run extreme"],
          "behavior": "Perfectly inelastic supply means quantity supplied does not change at all when price changes. The supply curve is vertical. This occurs when there is an absolute constraint on production—the quantity is fixed regardless of price. Examples include: the number of seats in a stadium for a single event, the amount of original Picasso paintings, land in a specific location in the short run. With perfectly inelastic supply, any change in demand is fully reflected in price changes, with no quantity adjustment. This creates maximum price volatility. For sellers, this means any increase in demand generates windfall gains; any decrease causes sharp losses.",
          
          "image": {
            "src": "images/unit3/perfectly_inelastic_supply.png",
            "alt": "Vertical supply curve showing no quantity change with price",
            "caption": "Figure 3.4.6: Perfectly inelastic supply—quantity doesn't respond to price."
          },
          
          "examples": [
            {
              "process": "Stadium seats for Super Bowl",
              "explanation": "The number of seats is fixed. Higher ticket prices won't create more seats. Supply is perfectly inelastic."
            },
            {
              "process": "Original artworks by deceased artist",
              "explanation": "No more can be created. Supply is fixed regardless of price."
            }
          ]
        },
        {
          "type": "Perfectly Elastic Supply",
          "value": "$PES = \\infty$",
          "characteristics": ["Horizontal supply curve", "Any quantity at given price", "Zero quantity at lower price", "Constant costs", "Perfect competition"],
          "behavior": "Perfectly elastic supply means producers will supply any quantity at a specific price, but nothing at any lower price. The supply curve is horizontal. This occurs when firms can produce any amount at constant cost—typical in perfectly competitive markets with many firms and no capacity constraints in the long run. For example, a wheat farmer faces perfectly elastic supply from the market perspective—they can sell any amount at the market price. With perfectly elastic supply, any change in demand affects quantity but not price. Consumers get all the benefit of increased demand through more consumption, not higher prices.",
          
          "image": {
            "src": "images/unit3/perfectly_elastic_supply.png",
            "alt": "Horizontal supply curve showing infinite responsiveness at given price",
            "caption": "Figure 3.4.7: Perfectly elastic supply—any quantity at one price."
          },
          
          "examples": [
            {
              "process": "Generic manufacturing",
              "explanation": "Many manufacturers can produce generic products at constant cost. Supply is perfectly elastic at the market price."
            },
            {
              "process": "Perfectly competitive firm",
              "explanation": "An individual firm in perfect competition faces perfectly elastic demand, but from the market perspective, long-run supply can be perfectly elastic in constant-cost industries."
            }
          ]
        },
        {
          "type": "Time Horizon and Supply Elasticity",
          "value": "Supply becomes more elastic over time",
          "characteristics": ["Short run: inelastic", "Long run: more elastic", "Adjustment takes time", "Entry/exit matters", "Capacity can expand"],
          "behavior": "Time is the most important determinant of supply elasticity. In the short run, many factors are fixed—factory size, number of firms, trained workers. Producers can only make limited adjustments (overtime, using existing inventory). Supply is relatively inelastic. In the long run, all factors can be adjusted—new factories can be built, new firms can enter, workers can be trained. Supply becomes more elastic. This is why the same market can have very different supply elasticities depending on the time frame considered. For example, oil supply is inelastic in the short run (existing wells can only pump so fast), but more elastic in the long run (new wells can be drilled, new technologies developed). Understanding time horizon is crucial for predicting price behavior after demand shocks.",
          
          "image": {
            "src": "images/unit3/time_horizon_supply.png",
            "alt": "Two supply curves: steep short-run, flatter long-run",
            "caption": "Figure 3.4.8: Supply becomes more elastic over time as producers can adjust."
          },
          
          "examples": [
            {
              "process": "Oil production",
              "explanation": "Short run: existing wells can increase output only slightly if price rises (inelastic). Long run: new wells drilled, fracking expands, supply becomes more elastic."
            },
            {
              "process": "Housing construction",
              "explanation": "Short run: limited new construction (inelastic). Long run: builders can construct more homes, supply becomes more elastic."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Time Horizon Is the Most Important Determinant of Supply Elasticity",
          "statement": "The elasticity of supply depends critically on the time period considered. In the short run, at least one factor of production is fixed (typically capital—factories, equipment). Producers can only make limited adjustments, so supply is relatively inelastic. In the long run, all factors are variable—firms can build new factories, train workers, and new firms can enter the industry. Supply becomes more elastic. This is why economists distinguish between short-run and long-run supply curves. The short-run supply curve is steeper (more inelastic); the long-run supply curve is flatter (more elastic). Understanding this distinction is crucial for predicting how markets respond to persistent vs. temporary price changes.",
          "application": "When analyzing a market, always consider the time frame. A temporary price increase will have different effects than a permanent one because supply elasticity differs. Short-run analysis uses inelastic supply; long-run analysis uses more elastic supply.",
          "example": "After a hurricane damages refineries, gasoline prices spike. In the short run, supply is inelastic—other refineries are already at capacity, so prices rise sharply. Over time, more gasoline can be imported, refineries repaired, and supply increases, bringing prices down.",
          
          "image": {
            "src": "images/unit3/time_determinant.png",
            "alt": "Timeline showing supply becoming more elastic as time passes",
            "caption": "Figure 3.4.9: Time is the key determinant—supply becomes more elastic in the long run."
          }
        },
        {
          "principle": "Supply Elasticity Determines How Much Price Changes When Demand Shifts",
          "statement": "When demand shifts, the resulting price change depends heavily on supply elasticity. If supply is inelastic, a demand increase leads to a large price increase and small quantity increase. If supply is elastic, the same demand increase leads to a small price increase and large quantity increase. This relationship is crucial for predicting market outcomes. For example, the dramatic rise in housing prices in many cities reflects inelastic supply—demand increased but new construction couldn't keep up. In contrast, prices of many manufactured goods have fallen over time despite increased demand because elastic supply (and technological progress) kept prices down.",
          "application": "To predict price effects of demand changes, assess supply elasticity. Inelastic supply → price volatility. Elastic supply → price stability. This helps businesses forecast and policymakers design interventions.",
          "example": "A new health study increases demand for avocados. If avocado supply is inelastic (trees take years to mature), prices will spike. If supply is elastic (can quickly import from multiple regions), prices will rise only slightly.",
          
          "image": {
            "src": "images/unit3/demand_shift_effects.png",
            "alt": "Two graphs: same demand shift with inelastic supply (large P increase) and elastic supply (small P increase)",
            "caption": "Figure 3.4.10: Supply elasticity determines price impact of demand shifts."
          }
        },
        {
          "principle": "Supply Elasticity Affects Tax Incidence",
          "statement": "When a tax is imposed on a good, the burden is shared between consumers and producers depending on the relative elasticities of demand and supply. The more inelastic side of the market bears more of the tax burden. If supply is highly inelastic (producers can't easily reduce quantity supplied), producers bear most of the tax. If supply is highly elastic (producers can easily reduce output or exit), consumers bear most of the tax. This principle has important implications for tax policy—taxing goods with inelastic supply (like land) falls mainly on producers/sellers; taxing goods with elastic supply falls mainly on consumers.",
          "application": "When designing taxes, consider who you want to bear the burden. To tax producers directly, target goods with inelastic supply. To tax consumers, target goods with inelastic demand. The actual incidence depends on elasticities, not on who writes the check.",
          "example": "A tax on beachfront property (perfectly inelastic supply) will be borne almost entirely by landowners—they can't reduce the quantity supplied. A tax on t-shirts (elastic supply) will be borne mostly by consumers as producers can reduce output or exit the industry.",
          
          "image": {
            "src": "images/unit3/tax_incidence.png",
            "alt": "Tax incidence diagrams showing burden shifting with supply elasticity",
            "caption": "Figure 3.4.11: Supply elasticity affects who bears the burden of a tax."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Price Elasticity of Supply",
          
          "image": {
            "src": "images/unit3/pes_example1.png",
            "alt": "Price and quantity supplied data",
            "caption": "Figure 3.4.12: Calculate PES using midpoint formula."
          },
          
          "problem": "When the price of wheat increases from $\\$4$ to $\\$6$ per bushel, the quantity supplied increases from 10,000 to 13,000 bushels per month.<br>a) Calculate the price elasticity of supply using the midpoint formula.<br>b) Is supply elastic, inelastic, or unit elastic?<br>c) Interpret what this elasticity means.",
          
          "step_by_step": [
            {
              "step": "Identify values",
              "explanation": "$P_1 = \\$4$, $P_2 = \\$6$, $Q_1 = 10,000$, $Q_2 = 13,000$"
            },
            {
              "step": "Calculate percentage change in price",
              "explanation": "Midpoint P $= (4 + 6)/2 = 5$. Change P $= 2$. $\\%\\Delta P = (2/5) \\times 100 = 40\\%$"
            },
            {
              "step": "Calculate percentage change in quantity",
              "explanation": "Midpoint Q $= (10,000 + 13,000)/2 = 11,500$. Change Q $= 3,000$. $\\%\\Delta Q = (3,000/11,500) \\times 100 = 26.09\\%$"
            },
            {
              "step": "Calculate PES",
              "explanation": "$PES = \\%\\Delta Q / \\%\\Delta P = 26.09\\% / 40\\% = 0.652$"
            },
            {
              "step": "Interpret",
              "explanation": "$PES = 0.652$, which is less than 1. Supply is inelastic. A 1% increase in price leads to a 0.652% increase in quantity supplied. Producers are not very responsive to price changes."
            }
          ],
          
          "final_answer": "a) $PES = 0.652$. b) Inelastic. c) Quantity supplied changes less than proportionally to price.",
          "concept_applied": "PES measures producer responsiveness. $PES < 1$ means inelastic supply—producers can't easily increase output."
        },
        {
          "title": "Comparing Supply Elasticity Across Industries",
          
          "image": {
            "src": "images/unit3/pes_example2.png",
            "alt": "Descriptions of different industries",
            "caption": "Figure 3.4.13: Predict relative supply elasticity for each industry."
          },
          
          "problem": "For each pair, predict which has more elastic supply and explain why:<br>a) Beachfront housing vs. t-shirt manufacturing<br>b) Agricultural products in the short run vs. long run<br>c) Concert tickets for one night vs. concert tickets for a tour with multiple dates<br>d) Oil production from existing wells vs. oil production including new drilling<br>e) Handcrafted furniture vs. mass-produced furniture",
          
          "step_by_step": [
            {
              "step": "Beachfront housing vs. t-shirt manufacturing",
              "explanation": "T-shirt manufacturing has more elastic supply. Beachfront land is fixed (perfectly inelastic). T-shirts can be produced quickly with available inputs."
            },
            {
              "step": "Agricultural products short run vs. long run",
              "explanation": "Long run is more elastic. In short run, crops are already planted—can't increase. Long run, farmers can plant more."
            },
            {
              "step": "Concert tickets: one night vs. tour",
              "explanation": "Tour has more elastic supply. One night has fixed seats. Tour can add dates in response to high demand."
            },
            {
              "step": "Oil: existing wells vs. including new drilling",
              "explanation": "Including new drilling is more elastic. Existing wells have limited capacity. New drilling can add significant supply over time."
            },
            {
              "step": "Handcrafted vs. mass-produced furniture",
              "explanation": "Mass-produced is more elastic. Handcrafted requires skilled artisans who can't be quickly trained or hired."
            }
          ],
          
          "final_answer": "a) T-shirt manufacturing. b) Long run. c) Tour. d) Including new drilling. e) Mass-produced furniture.",
          "concept_applied": "Supply elasticity depends on time horizon, input availability, capacity constraints, and production complexity."
        },
        {
          "title": "Analyzing Market Impact Using Supply Elasticity",
          
          "image": {
            "src": "images/unit3/pes_example3.png",
            "alt": "Market scenarios with different supply elasticities",
            "caption": "Figure 3.4.14: Predict market outcomes based on supply elasticity."
          },
          
          "problem": "Two markets experience the same increase in demand (shift right by 20%). Market A has highly inelastic supply $(PES = 0.2)$. Market B has highly elastic supply $(PES = 2.0)$.<br>a) In which market will price increase more? Why?<br>b) In which market will quantity increase more?<br>c) Draw rough graphs showing the different outcomes.<br>d) Which market would you expect to see more price volatility over time?",
          
          "step_by_step": [
            {
              "step": "Price increase comparison",
              "explanation": "Market A (inelastic supply) will have a larger price increase. With inelastic supply, producers cannot increase quantity much, so the demand increase mostly pushes up price. With elastic supply, quantity increases easily, so price rises less."
            },
            {
              "step": "Quantity increase comparison",
              "explanation": "Market B (elastic supply) will have a larger quantity increase. Producers can respond substantially to the higher demand, increasing output significantly."
            },
            {
              "step": "Graphs",
              "explanation": "Market A: Steep supply curve, demand shifts right → large price increase, small quantity increase. Market B: Flat supply curve, same demand shift → small price increase, large quantity increase."
            },
            {
              "step": "Price volatility",
              "explanation": "Market A will have more price volatility. Any demand shift (up or down) will cause large price changes because supply can't adjust. Market B will have stable prices with quantity adjusting instead."
            }
          ],
          
          "final_answer": "a) Market A (inelastic). b) Market B (elastic). c) Graphs as described. d) Market A (inelastic) will have more price volatility.",
          "concept_applied": "Supply elasticity determines how demand shifts affect prices vs. quantities. Inelastic supply → price effects; elastic supply → quantity effects."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Price and Quantity Supplied Values",
          "description": "Determine the initial and new prices and quantities supplied.",
          "mechanism": "From data, identify $P_1$, $P_2$, $Q_{s1}$, $Q_{s2}$.",
          "result": "Four key numbers.",
          
          "image": {
            "src": "images/unit3/pes_step1.png",
            "alt": "Table with price and quantity supplied columns",
            "caption": "Figure 3.4.15: Step 1 - Identify price and quantity supplied values."
          }
        },
        {
          "step": 2,
          "process": "Calculate Percentage Changes Using Midpoint Formula",
          "description": "Find percentage change in price and quantity supplied using midpoint method.",
          "mechanism": "$\\%\\Delta P = \\frac{P_2 - P_1}{(P_2 + P_1)/2} \\times 100$, $\\%\\Delta Q_s = \\frac{Q_{s2} - Q_{s1}}{(Q_{s2} + Q_{s1})/2} \\times 100$",
          "result": "Percentage changes.",
          
          "image": {
            "src": "images/unit3/pes_step2.png",
            "alt": "Midpoint formula calculations",
            "caption": "Figure 3.4.16: Step 2 - Calculate percentage changes using midpoint formula."
          }
        },
        {
          "step": 3,
          "process": "Compute PES",
          "description": "Divide percentage change in quantity supplied by percentage change in price.",
          "mechanism": "$PES = \\%\\Delta Q_s / \\%\\Delta P$",
          "result": "Numerical PES value (positive).",
          
          "image": {
            "src": "images/unit3/pes_step3.png",
            "alt": "Division of percentage changes",
            "caption": "Figure 3.4.17: Step 3 - Compute PES = %ΔQs / %ΔP."
          }
        },
        {
          "step": 4,
          "process": "Classify Elasticity",
          "description": "Compare PES to 1 to classify.",
          "mechanism": "If $PES > 1$: elastic. If $PES < 1$: inelastic. If $PES = 1$: unit elastic. If $PES = 0$: perfectly inelastic. If $PES = \\infty$: perfectly elastic.",
          "result": "Elasticity classification.",
          
          "image": {
            "src": "images/unit3/pes_step4.png",
            "alt": "Number line showing elastic (>1), unit elastic (=1), inelastic (<1)",
            "caption": "Figure 3.4.18: Step 4 - Classify using value relative to 1."
          }
        },
        {
          "step": 5,
          "process": "Interpret and Apply",
          "description": "Explain what the elasticity means and consider implications.",
          "mechanism": "Consider time horizon, industry characteristics, and implications for price volatility, tax incidence, etc.",
          "result": "Economic interpretation and applications.",
          
          "image": {
            "src": "images/unit3/pes_step5.png",
            "alt": "Business implications of supply elasticity",
            "caption": "Figure 3.4.19: Step 5 - Interpret and apply to real-world contexts."
          }
        }
      ],

      "image": {
        "src": "images/unit3/pes_summary.png",
        "alt": "Comprehensive PES summary: formula, classifications, determinants, time horizon effects",
        "caption": "Figure 3.4.20: Price elasticity of supply summary."
      }
    }
  ],

  "key_terms": [
    "Price elasticity of supply (PES)",
    "Elastic supply",
    "Inelastic supply",
    "Unit elastic supply",
    "Perfectly inelastic supply",
    "Perfectly elastic supply",
    "Midpoint formula",
    "Time horizon",
    "Short run",
    "Long run",
    "Spare capacity",
    "Input availability",
    "Production complexity",
    "Storage ability",
    "Supply curve slope",
    "Vertical supply",
    "Horizontal supply",
    "Producer responsiveness",
    "Market adjustment",
    "Price volatility",
    "Tax incidence"
  ],

  "summary": "Price elasticity of supply $(PES = \\frac{\\%\\Delta Q_s}{\\%\\Delta P})$ measures how responsive producers are to price changes. Elastic supply $(PES > 1)$ means quantity supplied changes more than proportionally to price—producers can easily increase output. Inelastic supply $(PES < 1)$ means quantity supplied changes less than proportionally—producers cannot easily respond. Perfectly inelastic supply $(PES = 0)$ is a vertical line (fixed quantity); perfectly elastic supply $(PES = \\infty)$ is a horizontal line (any quantity at one price). The most important determinant of supply elasticity is time—supply becomes more elastic in the long run as firms can adjust capacity and new firms can enter. Other determinants include availability of inputs, spare production capacity, complexity of production, and storage ability. Supply elasticity has important implications: (1) It determines how much price changes when demand shifts—inelastic supply leads to large price changes, elastic supply leads to small price changes. (2) It affects tax incidence—more inelastic supply means producers bear more of a tax burden. (3) It explains price volatility across industries—inelastic supply markets are more volatile. Understanding PES is essential for predicting market outcomes and designing business and policy strategies."
}
