{
  "expanded_description": "In economics, costs of production determine firm profitability, pricing decisions, and market supply. Understanding different cost measures and how to calculate them is essential for analyzing firm behavior, market structures, and economic efficiency. Cost calculations form the foundation for determining optimal production levels and competitive strategies.",
  "core_concept": {
    "principle": "Production costs can be categorized and calculated in multiple ways: fixed versus variable, total versus per-unit, and short-run versus long-run. Accurate cost calculation enables firms to make optimal production decisions, set appropriate prices, and maximize profits.",
    "explanation": "Cost calculation involves transforming input usage (labor, materials, capital) into monetary values that reflect opportunity costs—what must be sacrificed to produce goods. Different cost measures serve different analytical purposes: total costs determine profitability, average costs inform pricing, marginal costs guide production quantity decisions. These calculations depend critically on time horizon (short run vs. long run) and the production function's technical relationships between inputs and outputs. Proper cost analysis requires distinguishing between explicit monetary payments and implicit opportunity costs, as both affect economic decision-making. Firms that miscalculate costs risk producing too much or too little, pricing incorrectly, or ultimately failing in competitive markets.",
    "image": {
      "src": "images/unit5/cost_calculation_framework.png",
      "alt": "Flowchart showing how different cost measures are calculated from production inputs and input prices",
      "caption": "Cost calculation framework: From production inputs to various cost measures"
    }
  },
  "sections": [
    {
      "section_title": "5.5 Calculating Costs",
      "introduction": "This section provides the mathematical formulas and practical methods for calculating different types of production costs. Mastery of these calculations is essential for determining profitability, making production decisions, and analyzing firm behavior.",
      "key_concept": {
        "definition": "Cost calculation involves quantifying all resources used in production, assigning appropriate monetary values, and organizing these values into meaningful measures for decision-making: total costs, average costs, and marginal costs.",
        "context": "Firms must accurately calculate costs to answer fundamental questions: Should we produce? How much should we produce? What price should we charge? Cost calculations transform physical production data (labor hours, materials used) into economic information that guides these decisions. Different cost measures serve different purposes in economic analysis."
      },
      "categories": [
        {
          "type": "Basic Cost Components",
          "description": "Fundamental building blocks of cost calculation",
          "examples": [
            {
              "process": "Total Fixed Cost (TFC)",
              "explanation": "Costs that do not vary with output level in the short run. Calculated by summing all fixed expenses. Formula: $TFC = \\sum Fixed\\ Costs$. Must be paid even if output is zero. Examples: Rent, insurance, administrative salaries, equipment depreciation."
            },
            {
              "process": "Total Variable Cost (TVC)",
              "explanation": "Costs that change with production quantity. Calculated by summing variable expenses at each output level. Formula: $TVC = \\sum (Variable\\ Input\\ Price \\times Quantity\\ Used)$. Examples: Raw materials, hourly labor wages, utilities for production, shipping costs."
            },
            {
              "process": "Total Cost (TC)",
              "explanation": "Sum of all fixed and variable costs at a given output level. Formula: $TC = TFC + TVC$. Represents the complete economic cost of producing a specific quantity of output."
            },
            {
              "process": "Marginal Cost (MC)",
              "explanation": "The additional cost of producing one more unit of output. Calculated as change in total cost divided by change in quantity. Formula: $MC = \\frac{\\Delta TC}{\\Delta Q}$ or $MC = \\frac{\\Delta TVC}{\\Delta Q}$ since fixed costs don't change with output. Critical for determining optimal production level."
            }
          ]
        },
        {
          "type": "Per-Unit Cost Measures",
          "description": "Costs expressed per unit of output, essential for pricing and efficiency analysis",
          "examples": [
            {
              "process": "Average Fixed Cost (AFC)",
              "explanation": "Fixed cost per unit of output. Calculated by dividing total fixed cost by quantity. Formula: $AFC = \\frac{TFC}{Q}$. Always declines as output increases because fixed costs are spread over more units."
            },
            {
              "process": "Average Variable Cost (AVC)",
              "explanation": "Variable cost per unit of output. Calculated by dividing total variable cost by quantity. Formula: $AVC = \\frac{TVC}{Q}$. Typically U-shaped due to diminishing returns then possible rising input prices at high output."
            },
            {
              "process": "Average Total Cost (ATC)",
              "explanation": "Total cost per unit of output, also called unit cost. Calculated by dividing total cost by quantity or summing AFC and AVC. Formula: $ATC = \\frac{TC}{Q} = AFC + AVC$. Key for determining price relative to cost."
            }
          ]
        },
        {
          "type": "Cost Calculation Methods",
          "description": "Practical approaches to computing different cost measures from production data",
          "examples": [
            {
              "process": "From production function",
              "explanation": "Given production function $Q = f(L,K)$ and input prices ($w$ for labor, $r$ for capital), calculate: $TVC = w \\times L$, $TFC = r \\times K$, $TC = wL + rK$. Then derive per-unit and marginal costs. Example: If $Q = 10\\sqrt{L}$ with $w = \\$20$, then to produce Q=50: $L = 25$, $TVC = \\$20 \\times 25 = \\$500$."
            },
            {
              "process": "From accounting data",
              "explanation": "Start with financial statements, classify expenses as fixed or variable, sum by category, then apply cost formulas. Challenge: Some costs are semi-variable; must estimate variable portion."
            },
            {
              "process": "Incremental calculation",
              "explanation": "For marginal cost, calculate additional costs of production increases: Labor, materials, energy for extra units. Formula: $MC = \\frac{Cost\\ of\\ Additional\\ Inputs}{Additional\\ Output}$."
            }
          ]
        },
        {
          "type": "Special Cost Concepts",
          "description": "Important economic cost measures beyond basic accounting",
          "examples": [
            {
              "process": "Sunk Costs",
              "explanation": "Costs already incurred that cannot be recovered. Should be ignored in forward-looking decisions. Calculation challenge: Identifying truly sunk versus recoverable costs."
            },
            {
              "process": "Opportunity Cost",
              "explanation": "Value of the next best alternative forgone. For owned resources: Calculate what they could earn in best alternative use. Example: Owner's time worth \\$50/hour used in business has opportunity cost even if no cash payment."
            },
            {
              "process": "Economic vs. Accounting Cost",
              "explanation": "Accounting cost = explicit monetary payments. Economic cost = accounting cost + implicit opportunity costs. Formula: $Economic\\ Cost = Explicit\\ Costs + Implicit\\ Costs$."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Marginal Cost Determines Optimal Output",
          "statement": "Profit-maximizing firms produce where marginal cost equals marginal revenue (MR). MC calculation is therefore crucial for determining optimal production quantity.",
          "application": "Calculate MC at different output levels, compare to MR (price in perfect competition), identify where $MC = MR$.",
          "example": "If MC = \\$8 for next unit and price = \\$10, produce it (adds \\$2 profit). If next unit's MC = \\$11 and price = \\$10, don't produce it (would lose \\$1). Optimal output: last unit where MC ≤ price."
        },
        {
          "principle": "Average Cost Determines Profitability",
          "statement": "Comparing price to average total cost shows whether firm earns economic profit, normal profit, or loss.",
          "application": "Calculate ATC at chosen output. If P > ATC → economic profit. If P = ATC → normal profit (zero economic profit). If P < ATC → economic loss.",
          "example": "Firm produces 100 units with TC = \\$5,000. ATC = \\$50. If market price = \\$60, economic profit = (\\$60 - \\$50) × 100 = \\$1,000. If price = \\$50, normal profit. If price = \\$40, loss = \\$1,000."
        },
        {
          "principle": "Fixed Costs Are Irrelevant for Short-Run Production Decisions",
          "statement": "In short run, fixed costs must be paid regardless of output. Production decisions should consider only variable costs and marginal costs.",
          "application": "When deciding whether to produce in short run, compare price to AVC, not ATC. As long as P > AVC, produce (covers variable costs and contributes to fixed costs).",
          "example": "Restaurant with monthly fixed costs \\$10,000 (rent, etc.). If AVC = \\$8/meal and price = \\$10, should operate even though losing money overall (P > AVC covers some fixed costs). Shutting down would mean losing full \\$10,000 instead of partial loss."
        }
      ],
      "worked_examples": [
        {
          "title": "Complete Cost Table Calculation",
          "problem": "A factory has monthly fixed costs of \\$12,000. Variable costs increase with output as shown. Complete the cost table and calculate all cost measures.\n\n| Output (Q) | TVC | TC | AFC | AVC | ATC | MC |\n|------------|-----|----|-----|-----|-----|----|\n| 0          | 0   |    |     |     |     |    |\n| 100        | 2,000 |    |     |     |     |    |\n| 200        | 3,800 |    |     |     |     |    |\n| 300        | 5,400 |    |     |     |     |    |\n| 400        | 7,200 |    |     |     |     |    |\n| 500        | 9,500 |    |     |     |     |    |",
          "step_by_step": [
            {
              "step": "Calculate TC",
              "explanation": "$TC = TFC + TVC$. TFC = \\$12,000 at all output levels.\n- Q=0: TC = 12,000 + 0 = \\$12,000\n- Q=100: TC = 12,000 + 2,000 = \\$14,000\n- Q=200: TC = 12,000 + 3,800 = \\$15,800\n- Q=300: TC = 12,000 + 5,400 = \\$17,400\n- Q=400: TC = 12,000 + 7,200 = \\$19,200\n- Q=500: TC = 12,000 + 9,500 = \\$21,500"
            },
            {
              "step": "Calculate AFC",
              "explanation": "$AFC = \\frac{TFC}{Q}$\n- Q=100: AFC = 12,000 / 100 = \\$120\n- Q=200: AFC = 12,000 / 200 = \\$60\n- Q=300: AFC = 12,000 / 300 = \\$40\n- Q=400: AFC = 12,000 / 400 = \\$30\n- Q=500: AFC = 12,000 / 500 = \\$24\n- Q=0: AFC undefined (division by zero)"
            },
            {
              "step": "Calculate AVC",
              "explanation": "$AVC = \\frac{TVC}{Q}$\n- Q=100: AVC = 2,000 / 100 = \\$20\n- Q=200: AVC = 3,800 / 200 = \\$19\n- Q=300: AVC = 5,400 / 300 = \\$18\n- Q=400: AVC = 7,200 / 400 = \\$18\n- Q=500: AVC = 9,500 / 500 = \\$19"
            },
            {
              "step": "Calculate ATC",
              "explanation": "$ATC = \\frac{TC}{Q}$ or $ATC = AFC + AVC$\n- Q=100: ATC = 14,000 / 100 = \\$140 (or 120 + 20 = \\$140)\n- Q=200: ATC = 15,800 / 200 = \\$79 (or 60 + 19 = \\$79)\n- Q=300: ATC = 17,400 / 300 = \\$58 (or 40 + 18 = \\$58)\n- Q=400: ATC = 19,200 / 400 = \\$48 (or 30 + 18 = \\$48)\n- Q=500: ATC = 21,500 / 500 = \\$43 (or 24 + 19 = \\$43)"
            },
            {
              "step": "Calculate MC",
              "explanation": "$MC = \\frac{\\Delta TC}{\\Delta Q}$ between output levels\n- 0→100: MC = (14,000 - 12,000) / (100 - 0) = 2,000/100 = \\$20\n- 100→200: MC = (15,800 - 14,000) / (200 - 100) = 1,800/100 = \\$18\n- 200→300: MC = (17,400 - 15,800) / (300 - 200) = 1,600/100 = \\$16\n- 300→400: MC = (19,200 - 17,400) / (400 - 300) = 1,800/100 = \\$18\n- 400→500: MC = (21,500 - 19,200) / (500 - 400) = 2,300/100 = \\$23"
            }
          ],
          "final_answer": "Completed cost table:\n\n| Output (Q) | TVC   | TC     | AFC  | AVC | ATC | MC  |\n|------------|-------|--------|------|-----|-----|-----|\n| 0          | 0     | 12,000 | —    | —   | —   | —   |\n| 100        | 2,000 | 14,000 | 120  | 20  | 140 | 20  |\n| 200        | 3,800 | 15,800 | 60   | 19  | 79  | 18  |\n| 300        | 5,400 | 17,400 | 40   | 18  | 58  | 16  |\n| 400        | 7,200 | 19,200 | 30   | 18  | 48  | 18  |\n| 500        | 9,500 | 21,500 | 24   | 19  | 43  | 23  |\n\nKey patterns: AFC always falls. AVC initially falls then rises (U-shaped). ATC follows U-shape but falls longer due to declining AFC. MC initially falls then rises, intersecting AVC and ATC at their minimum points.",
          "concept_applied": "All cost measures are mathematically related. AFC declines continuously as fixed costs are spread over more units. AVC typically shows U-shape due to diminishing returns. ATC = AFC + AVC, so it also shows U-shape but minimum occurs at higher output than AVC minimum. MC intersects both AVC and ATC at their minimum points."
        },
        {
          "title": "Production Decision Using Cost Calculations",
          "problem": "A perfectly competitive firm has cost structure: TFC = \\$1,000, TVC = $10Q + 0.1Q^2$. Market price = \\$50. Calculate: (1) Profit-maximizing output, (2) Should firm produce in short run? (3) Economic profit or loss at optimal output.",
          "step_by_step": [
            {
              "step": "Derive cost functions",
              "explanation": "$TC = TFC + TVC = 1,000 + 10Q + 0.1Q^2$\n$MC = \\frac{d(TC)}{dQ} = 10 + 0.2Q$ (derivative of TC with respect to Q)\n$AVC = \\frac{TVC}{Q} = \\frac{10Q + 0.1Q^2}{Q} = 10 + 0.1Q$"
            },
            {
              "step": "Find profit-maximizing output",
              "explanation": "Perfect competition: P = MR = \\$50\nSet MR = MC: $50 = 10 + 0.2Q$\nSolve: $0.2Q = 40$, so $Q = 200$ units"
            },
            {
              "step": "Check short-run production condition",
              "explanation": "Compare P to AVC at Q=200:\n$AVC = 10 + 0.1(200) = 10 + 20 = \\$30$\nSince P = \\$50 > AVC = \\$30, firm should produce in short run (covers variable costs plus contributes to fixed costs)."
            },
            {
              "step": "Calculate profit/loss",
              "explanation": "$TR = P \\times Q = 50 \\times 200 = \\$10,000$\n$TC = 1,000 + 10(200) + 0.1(200^2) = 1,000 + 2,000 + 4,000 = \\$7,000$\nEconomic Profit = TR - TC = 10,000 - 7,000 = \\$3,000$"
            },
            {
              "step": "Verify with per-unit calculation",
              "explanation": "$ATC = \\frac{TC}{Q} = \\frac{7,000}{200} = \\$35$\nSince P = \\$50 > ATC = \\$35, firm earns economic profit.\nProfit per unit = \\$50 - \\$35 = \\$15\nTotal profit = \\$15 × 200 = \\$3,000 (matches above)"
            }
          ],
          "final_answer": "(1) Profit-maximizing output: Q = 200 units (where P = MC).\n(2) Yes, firm should produce in short run because P = \\$50 > AVC = \\$30 at Q=200.\n(3) Economic profit = \\$3,000 at optimal output.\n\nInterpretation: The firm earns substantial economic profit because market price exceeds average total cost at the optimal production level. Even if price fell below \\$35 (ATC), firm would still produce in short run as long as price remained above \\$30 (AVC).",
          "concept_applied": "Cost calculations enable production decisions: MC determines optimal quantity, AVC determines short-run shutdown decision, and ATC determines profitability. These calculations transform cost information into actionable business decisions."
        }
      ],
      "image": {
        "src": "images/unit5/cost_calculations_example.png",
        "alt": "Table and graphs showing relationships between different cost measures as calculated in worked example",
        "caption": "Cost calculation example showing mathematical relationships between different cost measures"
      }
    },
    {
      "section_title": "5.6 Short Run Cost Curves",
      "introduction": "Short run cost curves graphically represent the relationships between output and different cost measures when at least one input is fixed. Understanding these curves' shapes and relationships is crucial for analyzing firm behavior and market outcomes.",
      "key_concept": {
        "definition": "Short run cost curves show how total, average, and marginal costs change with output when some inputs (typically capital) are fixed. These curves have predictable shapes determined by the production function and the law of diminishing marginal returns.",
        "context": "In the short run, firms face fixed constraints (factory size, equipment) that create distinctive cost patterns. Fixed costs spread over more output (declining AFC), while variable costs exhibit U-shaped average curves due to initially increasing then diminishing returns. Marginal cost plays a key role, intersecting both average variable cost and average total cost at their minimum points. These relationships hold regardless of industry or technology."
      },
      "categories": [
        {
          "type": "Total Cost Curves",
          "description": "Graphical representations of total fixed, variable, and total costs",
          "examples": [
            {
              "process": "Total Fixed Cost (TFC) curve",
              "explanation": "Horizontal straight line at the level of fixed costs. Doesn't change with output. On graph: TFC is constant at all output levels, showing fixed commitment regardless of production."
            },
            {
              "process": "Total Variable Cost (TVC) curve",
              "explanation": "Starts at origin (zero output = zero variable cost), initially increases at decreasing rate (due to increasing returns), then increases at increasing rate (due to diminishing returns). Shape reflects production function: initially concave (bending downward), then convex (bending upward)."
            },
            {
              "process": "Total Cost (TC) curve",
              "explanation": "Vertical sum of TFC and TVC curves. Same shape as TVC but shifted upward by amount of TFC. Parallel to TVC at every output level (vertical distance = TFC)."
            }
          ]
        },
        {
          "type": "Average and Marginal Cost Curves",
          "description": "Per-unit cost curves showing efficiency patterns",
          "examples": [
            {
              "process": "Average Fixed Cost (AFC) curve",
              "explanation": "Rectangular hyperbola that continuously declines as output increases. Approaches zero asymptotically but never reaches it. Mathematical form: $AFC = \\frac{TFC}{Q}$, inverse relationship."
            },
            {
              "process": "Average Variable Cost (AVC) curve",
              "explanation": "U-shaped curve. Initially declines (increasing returns to variable input), reaches minimum, then rises (diminishing returns). Minimum point where MC = AVC. Shape determined by productivity of variable inputs."
            },
            {
              "process": "Average Total Cost (ATC) curve",
              "explanation": "U-shaped curve, always above AVC (by amount of AFC). Vertical distance between ATC and AVC equals AFC, which shrinks as output increases. Minimum point occurs at higher output than AVC minimum."
            },
            {
              "process": "Marginal Cost (MC) curve",
              "explanation": "U-shaped curve that intersects both AVC and ATC at their minimum points. Initially falls due to increasing returns, then rises due to diminishing returns. When MC < AVC, AVC falling; when MC > AVC, AVC rising. Same relationship with ATC."
            }
          ]
        },
        {
          "type": "Key Relationships Between Curves",
          "description": "Mathematical and graphical connections among cost curves",
          "examples": [
            {
              "process": "MC intersects AVC and ATC at minimum points",
              "explanation": "Mathematical property: When marginal is below average, average falls; when marginal is above average, average rises; when marginal equals average, average is at minimum. Graphically: MC curve cuts through lowest points of both AVC and ATC curves."
            },
            {
              "process": "Vertical distance between ATC and AVC equals AFC",
              "explanation": "Since $ATC = AVC + AFC$, the vertical gap between ATC and AVC curves at any output equals AFC at that output. This gap shrinks as output increases because AFC declines."
            },
            {
              "process": "TC slope equals MC",
              "explanation": "Marginal cost is slope of total cost curve: $MC = \\frac{d(TC)}{dQ}$. Steep TC slope means high MC; shallow slope means low MC. TVC has identical slope pattern (same MC)."
            }
          ]
        },
        {
          "type": "Graphical Analysis Applications",
          "description": "Using cost curves to analyze firm decisions",
          "examples": [
            {
              "process": "Profit/loss determination",
              "explanation": "On ATC curve diagram: Economic profit = (P - ATC) × Q. Graphically: Rectangle with height (P - ATC) and width Q. Loss if P < ATC."
            },
            {
              "process": "Shutdown decision analysis",
              "explanation": "Short-run shutdown point: Where P = minimum AVC. Below this price, firm minimizes loss by shutting down (producing zero). On graph: Price line touching bottom of AVC curve."
            },
            {
              "process": "Supply curve derivation",
              "explanation": "Firm's short-run supply curve is portion of MC curve above minimum AVC. For prices below min AVC, quantity supplied = 0. Above min AVC, firm supplies quantity where P = MC."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Law of Diminishing Returns Determines Cost Curve Shapes",
          "statement": "The U-shapes of MC, AVC, and ATC curves result from the law of diminishing marginal returns in production.",
          "application": "Initially, adding variable inputs to fixed inputs increases marginal product (decreasing MC). Eventually, marginal product declines (increasing MC). This creates U-shaped cost curves.",
          "example": "Small restaurant with fixed kitchen: Adding first cooks greatly increases output (MC falls). Adding tenth cook to crowded kitchen increases output little (MC rises). This explains why AVC and MC curves eventually turn upward."
        },
        {
          "principle": "Marginal-Average Relationships Are Mathematical Certainties",
          "statement": "When MC < AVC, AVC is falling. When MC > AVC, AVC is rising. MC crosses AVC at AVC's minimum. Same relationship holds for ATC.",
          "application": "Use MC position relative to average curves to predict whether average costs are increasing or decreasing.",
          "example": "If firm produces where MC = \\$10 and ATC = \\$12, then MC < ATC, so ATC must be falling. Firm should increase output to lower average costs (if market allows)."
        },
        {
          "principle": "Fixed Costs Affect ATC But Not Production Decisions in Short Run",
          "statement": "Fixed costs determine ATC level but don't affect MC or profit-maximizing output. In short run, only variable costs matter for production quantity decisions.",
          "application": "When deciding how much to produce, ignore fixed costs—consider only MC and variable costs. Fixed costs matter only for long-run entry/exit decisions.",
          "example": "Two firms with identical variable costs but different fixed costs will produce same quantity at given price (same MC curves). Higher fixed cost firm has higher ATC and may earn less profit or incur loss, but both choose same Q where P = MC."
        }
      ],
      "worked_examples": [
        {
          "title": "Graphical Analysis of Firm Costs and Decisions",
          "problem": "A firm has cost curves as shown. Market price = \\$40. Using the graph (described verbally), determine: (1) Profit-maximizing output, (2) Total revenue, total cost, and profit, (3) Should firm produce or shut down in short run? (4) Identify shutdown price.\n\nGraph description: MC curve is U-shaped with minimum at \\$15 at Q=50. AVC curve is U-shaped with minimum at \\$20 at Q=100. ATC curve is U-shaped with minimum at \\$35 at Q=150. All curves have typical relationships.",
          "step_by_step": [
            {
              "step": "Find profit-maximizing output",
              "explanation": "Firm produces where P = MC (assuming perfect competition). Price = \\$40. Find where MC = \\$40 on MC curve. Since MC is rising after its minimum of \\$15, and MC = ATC min at \\$35 at Q=150, then MC = \\$40 would occur at Q > 150. Estimate Q = 160 (where MC reaches \\$40 on rising portion)."
            },
            {
              "step": "Calculate TR, TC, profit",
              "explanation": "$TR = P \\times Q = 40 \\times 160 = \\$6,400$\nFind ATC at Q=160: Since ATC min = \\$35 at Q=150, and ATC is rising after minimum, at Q=160, ATC > \\$35. Estimate ATC = \\$36 at Q=160.\n$TC = ATC \\times Q = 36 \\times 160 = \\$5,760$\nProfit = TR - TC = 6,400 - 5,760 = \\$640$\nOr profit per unit = P - ATC = 40 - 36 = \\$4/unit × 160 units = \\$640"
            },
            {
              "step": "Check shutdown decision",
              "explanation": "Compare P to AVC at Q=160. AVC min = \\$20 at Q=100. Since AVC is rising after minimum, at Q=160, AVC > \\$20. Estimate AVC = \\$24 at Q=160.\nSince P = \\$40 > AVC = \\$24, firm should produce in short run (covers all variable costs plus contributes \\$16/unit to fixed costs)."
            },
            {
              "step": "Identify shutdown price",
              "explanation": "Shutdown price = minimum AVC = \\$20. At any price below \\$20, firm minimizes loss by producing zero (shutting down). At P = \\$20, firm indifferent between producing 100 units (where P = MC = min AVC) and shutting down."
            }
          ],
          "final_answer": "(1) Profit-maximizing output: Q = 160 units (where P = MC = \\$40).\n(2) TR = \\$6,400, TC ≈ \\$5,760, Economic Profit ≈ \\$640.\n(3) Yes, produce in short run because P = \\$40 > AVC ≈ \\$24 at Q=160.\n(4) Shutdown price = \\$20 (minimum AVC). Below \\$20, firm should shut down; at \\$20, indifferent.\n\nGraphical insight: The firm operates on the rising portion of its MC curve (beyond where MC crosses ATC minimum), which is typical for firms earning economic profit in perfect competition when price exceeds ATC minimum.",
          "concept_applied": "Cost curves provide complete information for firm decisions: MC determines quantity, AVC determines shutdown, ATC determines profitability. The graphical relationships (MC intersecting AVC and ATC at minimums, U-shapes) enable analysis even without exact numbers."
        },
        {
          "title": "Deriving Cost Curves from Production Function",
          "problem": "A firm has production function $Q = 10L^{0.5}$ (L = labor hours, capital fixed). Wage rate = \\$20/hour. Fixed costs = \\$500. Derive and sketch: TVC, TC, AVC, ATC, MC curves. Identify key points.",
          "step_by_step": [
            {
              "step": "Express L in terms of Q",
              "explanation": "$Q = 10\\sqrt{L}$ → $\\sqrt{L} = Q/10$ → $L = Q^2/100$"
            },
            {
              "step": "Derive TVC and TC",
              "explanation": "$TVC = wL = 20 \\times (Q^2/100) = 0.2Q^2$\n$TC = TFC + TVC = 500 + 0.2Q^2$"
            },
            {
              "step": "Derive AVC and ATC",
              "explanation": "$AVC = TVC/Q = 0.2Q^2/Q = 0.2Q$\n$ATC = TC/Q = 500/Q + 0.2Q$"
            },
            {
              "step": "Derive MC",
              "explanation": "$MC = d(TC)/dQ = d(500 + 0.2Q^2)/dQ = 0.4Q$"
            },
            {
              "step": "Identify key points",
              "explanation": "AVC minimum: Since AVC = 0.2Q is straight line from origin (not U-shaped in this case), minimum is at Q=0, AVC=0. But typically AVC would eventually rise with diminishing returns—our simplified production function doesn't show this.\nATC minimum: Set derivative of ATC = 0: $d(500/Q + 0.2Q)/dQ = -500/Q^2 + 0.2 = 0$ → $500/Q^2 = 0.2$ → $Q^2 = 2,500$ → $Q = 50$\nATC at Q=50: $500/50 + 0.2(50) = 10 + 10 = \\$20$\nMC at Q=50: $0.4(50) = \\$20$ (MC = ATC at ATC minimum, as expected)"
            },
            {
              "step": "Describe curves",
              "explanation": "TVC and TC: Upward-sloping parabolas (increasing at increasing rate).\nAVC: Straight line through origin, slope 0.2.\nATC: U-shaped, high at low Q (high AFC dominates), reaches minimum at Q=50, ATC=20, then rises slowly.\nMC: Straight line through origin, slope 0.4 (steeper than AVC). MC > AVC for all Q>0, so AVC always rising in this specific case."
            }
          ],
          "final_answer": "Cost functions:\n- TVC = 0.2Q²\n- TC = 500 + 0.2Q²\n- AVC = 0.2Q\n- ATC = 500/Q + 0.2Q\n- MC = 0.4Q\n\nKey points: ATC minimum at Q=50, ATC=MC=\\$20. AVC increases linearly from origin (simplified case). MC always above AVC (no initial declining MC due to simplified production function).\n\nNote: This is a simplified example with constantly diminishing returns (no initial increasing returns phase). Real-world cost curves would show MC and AVC initially falling then rising, creating U-shapes.",
          "concept_applied": "Cost curves are derived from production function and input prices. The shape of production function (in this case, $Q = 10\\sqrt{L}$ with diminishing returns throughout) determines cost curve shapes. Fixed costs affect ATC but not MC or AVC. The mathematical relationships hold: MC intersects ATC at its minimum."
        }
      ],
      "image": {
        "src": "images/unit5/short_run_cost_curves.png",
        "alt": "Graph showing typical short run cost curves: TC, TVC, TFC curves on top panel; MC, ATC, AVC, AFC curves on bottom panel with key relationships marked",
        "caption": "Short run cost curves and their relationships: MC intersects AVC and ATC at their minimum points"
      }
    },
    {
      "section_title": "5.7 Long Run Costs",
      "introduction": "In the long run, all inputs are variable—firms can adjust plant size, technology, and all factors of production. Long run cost analysis examines how costs behave when firms have complete flexibility to choose optimal input combinations.",
      "key_concept": {
        "definition": "Long run costs represent the minimum cost of producing each output level when all inputs can be varied optimally. The long run average cost (LRAC) curve shows the lowest possible average cost for each output when firms can choose any plant size and input combination.",
        "context": "While short run analysis examines costs with fixed constraints, long run analysis removes these constraints. Firms can build larger or smaller factories, adopt different technologies, and adjust all inputs simultaneously. This allows true cost minimization without being trapped by previous fixed commitments. The long run average cost curve is the envelope of all possible short run average cost curves—each point represents the optimal plant size for that output level. Understanding long run costs explains industry structure, firm size decisions, and potential for economies of scale."
      },
      "categories": [
        {
          "type": "Long Run Cost Concepts",
          "description": "Key measures and relationships in long run cost analysis",
          "examples": [
            {
              "process": "Long Run Total Cost (LRTC)",
              "explanation": "Minimum total cost of producing each output level when all inputs are variable. Always less than or equal to short run total cost for same output (more flexibility). Derived by finding optimal input combination for each output."
            },
            {
              "process": "Long Run Average Cost (LRAC)",
              "explanation": "Long run total cost per unit: $LRAC = LRTC/Q$. Also called the 'planning curve' or 'envelope curve' because it envelopes all possible short run ATC curves. Shows whether average costs fall, remain constant, or rise as firm expands."
            },
            {
              "process": "Long Run Marginal Cost (LRMC)",
              "explanation": "Additional cost of producing one more unit when all inputs can be varied: $LRMC = \\Delta LRTC/\\Delta Q$. Intersects LRAC at LRAC's minimum point (same marginal-average relationship as short run)."
            },
            {
              "process": "Planning vs. Operating",
              "explanation": "LRAC is planning curve—shows costs if firm could choose optimal plant size for each output. Once plant built, firm operates on particular short run cost curve. Long run is planning horizon; short run is operating period."
            }
          ]
        },
        {
          "type": "Relationship Between Short Run and Long Run",
          "description": "How short run and long run costs connect mathematically and graphically",
          "examples": [
            {
              "process": "Envelope curve property",
              "explanation": "LRAC curve is lower envelope of all possible short run ATC curves. Each short run ATC curve touches LRAC at exactly one point—the output level where that plant size is optimal. At all other outputs, short run ATC is above LRAC because plant size isn't optimal for that output."
            },
            {
              "process": "Tangency points",
              "explanation": "Each short run ATC curve is tangent to LRAC curve at the output where that plant size is optimal. At tangency point: short run ATC = long run ATC, and short run MC = long run MC (if tangency is at minimum of short run ATC, then also short run MC = short run ATC = long run ATC = long run MC)."
            },
            {
              "process": "Suboptimal plant sizes",
              "explanation": "If firm produces at output different from designed plant capacity, it operates on short run ATC above LRAC. Example: Factory designed for 1,000 units/day but producing only 500 units has higher average cost than a smaller factory optimally designed for 500 units."
            }
          ]
        },
        {
          "type": "Long Run Cost Patterns",
          "description": "Different possible shapes of long run average cost curves",
          "examples": [
            {
              "process": "Economies of scale (falling LRAC)",
              "explanation": "When LRAC declines as output increases: larger scale reduces average costs. Reasons: specialization, bulk purchasing, technological advantages, financial economies. Graphically: downward-sloping LRAC curve."
            },
            {
              "process": "Constant returns to scale (flat LRAC)",
              "explanation": "When LRAC constant as output increases: doubling all inputs doubles output, leaving average cost unchanged. Graphically: horizontal LRAC curve over range of outputs."
            },
            {
              "process": "Diseconomies of scale (rising LRAC)",
              "explanation": "When LRAC increases as output increases: larger scale increases average costs. Reasons: coordination problems, bureaucracy, communication difficulties. Graphically: upward-sloping LRAC curve."
            },
            {
              "process": "U-shaped LRAC",
              "explanation": "Most common pattern: Initially economies of scale (falling LRAC), then constant returns (flat LRAC), finally diseconomies of scale (rising LRAC). Creates U-shaped LRAC curve with clear minimum efficient scale."
            }
          ]
        },
        {
          "type": "Applications of Long Run Cost Analysis",
          "description": "Practical uses of long run cost concepts",
          "examples": [
            {
              "process": "Optimal firm size determination",
              "explanation": "Firms choose size/scale that minimizes LRAC for expected output. If economies of scale exist, larger firms have cost advantage. If diseconomies dominate beyond certain size, smaller firms can compete."
            },
            {
              "process": "Industry structure prediction",
              "explanation": "Shape of LRAC predicts market structure: Steep economies of scale → natural monopoly or oligopoly. Flat LRAC with small minimum efficient scale → competitive markets with many small firms."
            },
            {
              "process": "Entry and exit decisions",
              "explanation": "Firms enter if price exceeds LRAC at efficient scale; exit if price below LRAC. Long run equilibrium: P = minimum LRAC (zero economic profit)."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Long Run Costs Are Always Less Than or Equal to Short Run Costs",
          "statement": "For any given output, long run total cost ≤ short run total cost because firms have more flexibility to adjust all inputs optimally.",
          "application": "When analyzing costs, recognize that short run constraints (fixed plant size) create inefficiencies that disappear in long run when adjustments are possible.",
          "example": "Car factory producing 1,200 cars/day in plant designed for 1,000 cars has high short run costs (overtime, crowded facilities). In long run, can build larger plant for 1,200 cars/day with lower average costs. Short run ATC > long run ATC at this output."
        },
        {
          "principle": "Firms Plan for Long Run, Operate in Short Run",
          "statement": "Firms choose plant size (long run decision) based on expected output, then operate within that constraint (short run operation). If expectations wrong, they may operate at non-optimal point on short run curve.",
          "application": "Investment decisions (new factories, equipment) are long run choices that create short run cost structures. Once built, firm must live with those short run costs until it can adjust again.",
          "example": "Airlines buying new planes (long run decision) based on predicted passenger demand. If demand falls short, they operate planes with empty seats (high short run average costs) until they can sell planes (next long run adjustment)."
        },
        {
          "principle": "Minimum Efficient Scale Affects Market Competition",
          "statement": "The output level at which LRAC reaches its minimum (minimum efficient scale or MES) relative to market size determines how many firms can profitably operate in industry.",
          "application": "If MES is large relative to market demand, few firms can operate at efficient scale → concentrated industry. If MES is small relative to market, many efficient firms can coexist → competitive industry.",
          "example": "Automobile manufacturing: MES is ~500,000 cars/year (large). Global demand ~70 million cars/year → room for many efficient firms (though still oligopoly due to other factors). Local bakery: MES is small relative to city demand → many bakeries can operate efficiently."
        }
      ],
      "worked_examples": [
        {
          "title": "Long Run vs. Short Run Cost Comparison",
          "problem": "A firm can choose among three factory sizes with different short run cost structures:\n- Small factory: ATC = 100/Q + 5 + 0.1Q\n- Medium factory: ATC = 200/Q + 4 + 0.08Q\n- Large factory: ATC = 400/Q + 3 + 0.06Q\nDerive the long run average cost curve and find minimum efficient scale. Which factory is optimal for producing 50 units? 100 units? 200 units?",
          "step_by_step": [
            {
              "step": "Find minimum ATC for each factory",
              "explanation": "For each ATC function, find Q where derivative = 0 (or where MC = ATC).\nSmall: ATC = 100/Q + 5 + 0.1Q\nDerivative: -100/Q² + 0.1 = 0 → 100/Q² = 0.1 → Q² = 1,000 → Q = 31.6\nATC at Q=31.6: 100/31.6 + 5 + 0.1(31.6) = 3.16 + 5 + 3.16 = \\$11.32\n\nMedium: ATC = 200/Q + 4 + 0.08Q\nDerivative: -200/Q² + 0.08 = 0 → 200/Q² = 0.08 → Q² = 2,500 → Q = 50\nATC at Q=50: 200/50 + 4 + 0.08(50) = 4 + 4 + 4 = \\$12\n\nLarge: ATC = 400/Q + 3 + 0.06Q\nDerivative: -400/Q² + 0.06 = 0 → 400/Q² = 0.06 → Q² = 6,666.7 → Q = 81.6\nATC at Q=81.6: 400/81.6 + 3 + 0.06(81.6) = 4.9 + 3 + 4.9 = \\$12.8"
            },
            {
              "step": "Compare ATC at different outputs to find LRAC",
              "explanation": "For each output, choose factory with lowest ATC:\n- At Q=50: Small ATC = 100/50 + 5 + 0.1(50) = 2 + 5 + 5 = \\$12\nMedium ATC = 200/50 + 4 + 0.08(50) = 4 + 4 + 4 = \\$12\nLarge ATC = 400/50 + 3 + 0.06(50) = 8 + 3 + 3 = \\$14\nBest: Small or Medium (tie at \\$12)\n\n- At Q=100: Small ATC = 100/100 + 5 + 0.1(100) = 1 + 5 + 10 = \\$16\nMedium ATC = 200/100 + 4 + 0.08(100) = 2 + 4 + 8 = \\$14\nLarge ATC = 400/100 + 3 + 0.06(100) = 4 + 3 + 6 = \\$13\nBest: Large (\\$13)\n\n- At Q=200: Small ATC = 100/200 + 5 + 0.1(200) = 0.5 + 5 + 20 = \\$25.5\nMedium ATC = 200/200 + 4 + 0.08(200) = 1 + 4 + 16 = \\$21\nLarge ATC = 400/200 + 3 + 0.06(200) = 2 + 3 + 12 = \\$17\nBest: Large (\\$17)"
            },
            {
              "step": "Determine LRAC pattern",
              "explanation": "For low outputs (Q < 50): Small factory optimal.\nAround Q=50: Small or Medium similar cost.\nFor Q > 50 up to about 200: Large factory optimal (though for very high Q beyond 200, even larger factory might be better—not shown).\nLRAC initially falls (small to medium to large), then eventually would rise if diseconomies of scale exist."
            },
            {
              "step": "Find minimum efficient scale",
              "explanation": "From calculations: Minimum LRAC occurs at Q where Large factory is optimal but not yet experiencing diseconomies. Based on given factories, Large factory has minimum ATC at Q=81.6 (\\$12.8), but Medium at Q=50 has \\$12. Actually, Small at Q=31.6 has \\$11.32—this is the overall minimum! So MES = 31.6 units with Small factory.\nParadox: Smaller factory has lower minimum ATC than larger ones—this happens if there are diseconomies of scale (larger factories less efficient at any output)."
            }
          ],
          "final_answer": "LRAC is envelope of the three ATC curves:\n- For Q < ~50: Small factory optimal\n- For Q > ~50: Large factory optimal (though Medium competitive around Q=50)\nMinimum efficient scale: Q = 31.6 units using Small factory (ATC = \\$11.32).\nOptimal factories:\n- Q=50: Small or Medium factory (both ATC = \\$12)\n- Q=100: Large factory (ATC = \\$13)\n- Q=200: Large factory (ATC = \\$17)\n\nInteresting finding: Larger factories have higher minimum ATC than small factory, indicating diseconomies of scale dominate in this example—unusual but possible if larger plants have coordination problems outweighing any advantages.",
          "concept_applied": "LRAC is lower envelope of possible short run ATC curves. To find LRAC at any output, compare ATC of all possible plant sizes, choose lowest. Minimum efficient scale is output where LRAC is minimized. In this example, diseconomies of scale cause small factory to have lowest minimum cost—not all industries have economies of scale."
        },
        {
          "title": "From Short Run to Long Run Adjustment",
          "problem": "A firm currently operates a small plant with ATC = 50/Q + 10 + 0.5Q. Market price = \\$30. The firm produces where P = MC (short run equilibrium). In long run, firm can switch to optimal plant size. What will firm do in long run if it expects to continue selling at same output level? Calculate short run profit and long run planning.",
          "step_by_step": [
            {
              "step": "Find current short run equilibrium",
              "explanation": "First, derive MC from ATC. ATC = 50/Q + 10 + 0.5Q implies TC = 50 + 10Q + 0.5Q² (multiply ATC by Q).\nMC = d(TC)/dQ = 10 + Q\nSet P = MC: 30 = 10 + Q → Q = 20 units"
            },
            {
              "step": "Calculate short run profit",
              "explanation": "ATC at Q=20: 50/20 + 10 + 0.5(20) = 2.5 + 10 + 10 = \\$22.5\nTR = P × Q = 30 × 20 = \\$600\nTC = ATC × Q = 22.5 × 20 = \\$450\nProfit = 600 - 450 = \\$150"
            },
            {
              "step": "Analyze plant size optimality",
              "explanation": "Current plant's optimal output (minimum ATC):\nDerivative of ATC: -50/Q² + 0.5 = 0 → 50/Q² = 0.5 → Q² = 100 → Q = 10\nMinimum ATC = 50/10 + 10 + 0.5(10) = 5 + 10 + 5 = \\$20\nCurrent output (20) is twice optimal scale for this plant—firm is overutilizing small plant."
            },
            {
              "step": "Consider long run adjustment",
              "explanation": "Firm produces Q=20 but small plant optimal at Q=10. In long run, firm could choose larger plant with minimum ATC at Q=20. Suppose larger plant has ATC = 100/Q + 8 + 0.25Q.\nFind its minimum: -100/Q² + 0.25 = 0 → 100/Q² = 0.25 → Q² = 400 → Q = 20 (perfect!)\nMinimum ATC = 100/20 + 8 + 0.25(20) = 5 + 8 + 5 = \\$18"
            },
            {
              "step": "Compare long run outcome",
              "explanation": "With larger optimal plant at Q=20: ATC = \\$18 (vs. \\$22.5 with small plant).\nProfit with optimal plant: TR = still \\$600, TC = 18 × 20 = \\$360, Profit = \\$240 (vs. \\$150).\nFirm would increase profit by \\$90 by switching to larger plant in long run."
            },
            {
              "step": "Long run decision",
              "explanation": "Firm should expand to larger plant in long run. It will earn \\$240 profit instead of \\$150. Market price might adjust if all firms do this (entry/exit), but for individual firm, moving to optimal scale improves profitability."
            }
          ],
          "final_answer": "Short run: Firm produces Q=20 with small plant, earning \\$150 profit (ATC = \\$22.5).\nLong run: Firm should switch to larger plant optimized for Q=20, which would have ATC = \\$18, increasing profit to \\$240.\nKey insight: In short run, firm may operate with non-optimal plant size (producing 20 units in plant designed for 10). In long run, it can adjust to optimal scale, lowering costs and increasing profits. This explains why firms expand or contract facilities over time.",
          "concept_applied": "Short run decisions occur within fixed plant constraints, often at non-optimal scale. Long run allows adjustment to optimal plant size for desired output level. Moving to optimal scale reduces average costs (from \\$22.5 to \\$18 in this case), increasing profitability. This is the essence of long run planning."
        }
      ],
      "image": {
        "src": "images/unit5/long_run_cost_curves.png",
        "alt": "Graph showing LRAC as envelope curve of three short run ATC curves, with tangency points and minimum efficient scale marked",
        "caption": "Long run average cost (LRAC) as the envelope of short run average cost curves"
      }
    },
    {
      "section_title": "5.8 Economies of Scale",
      "introduction": "Economies of scale occur when increasing the scale of production leads to lower average costs. This fundamental concept explains why firms grow, why some industries are dominated by large companies, and how technological progress affects market structure.",
      "key_concept": {
        "definition": "Economies of scale exist when long run average cost decreases as output increases. This means larger production scales are more efficient, giving larger firms cost advantages over smaller competitors. Economies of scale are a key determinant of industry structure and firm strategy.",
        "context": "When firms can reduce per-unit costs by expanding, they have incentives to grow. This creates natural barriers to entry for small firms and can lead to concentrated industries. Economies of scale arise from various technical and economic factors: specialization, bulk purchasing, efficient technology utilization, and spreading fixed costs over more output. Understanding economies of scale helps explain real-world phenomena like corporate mergers, global supply chains, and why some products are made by only a few giant firms while others are made by many small producers."
      },
      "categories": [
        {
          "type": "Types of Economies of Scale",
          "description": "Different sources of scale economies",
          "examples": [
            {
              "process": "Technical economies",
              "explanation": "Larger scale enables use of more efficient technologies. Example: Large oil refinery processes crude oil at lower cost per barrel than small refinery due to engineering principles (cube-square law: equipment capacity increases faster than surface area/cost)."
            },
            {
              "process": "Purchasing economies",
              "explanation": "Bulk buying discounts for inputs. Example: Walmart purchases goods in enormous quantities, getting lower prices from suppliers than small retailers can negotiate."
            },
            {
              "process": "Financial economies",
              "explanation": "Large firms get better interest rates on loans, lower cost of capital. Example: Apple can borrow billions at very low interest rates due to size and credit rating; startup pays much higher rates."
            },
            {
              "process": "Managerial economies",
              "explanation": "Specialization of management functions. Example: Large corporation can hire specialized executives (CFO, CTO, COO) while small business owner must handle all functions."
            },
            {
              "process": "Marketing economies",
              "explanation": "Advertising costs spread over more units. Example: National TV ad costing \\$1 million reaches market of 10 million customers = \\$0.10 per customer. Local ad costing \\$10,000 reaches 10,000 = \\$1 per customer."
            },
            {
              "process": "Risk-bearing economies",
              "explanation": "Diversification reduces risk. Example: Large conglomerate can absorb losses in one division with profits from others; small single-product firm faces higher risk of failure."
            }
          ]
        },
        {
          "type": "Measuring Economies of Scale",
          "description": "Quantifying scale economies",
          "examples": [
            {
              "process": "Cost-output elasticity",
              "explanation": "$E_C = \\frac{\\% \\Delta TC}{\\% \\Delta Q}$. If $E_C < 1$, economies of scale (costs rise slower than output). If $E_C = 1$, constant returns. If $E_C > 1$, diseconomies."
            },
            {
              "process": "Scale efficiency ratio",
              "explanation": "Compare actual cost to minimum possible cost at efficient scale. Formula: $SER = \\frac{Actual\\ Cost}{Minimum\\ Cost\\ at\\ Efficient\\ Scale}$. SER > 1 indicates inefficiency."
            },
            {
              "process": "Minimum efficient scale (MES)",
              "explanation": "Smallest output at which LRAC is minimized. MES as percentage of market demand indicates how many efficient firms market can support."
            }
          ]
        },
        {
          "type": "Real-World Examples",
          "description": "Industries with significant economies of scale",
          "examples": [
            {
              "process": "Automobile manufacturing",
              "explanation": "Huge fixed costs for factories, design, tooling. Efficient scale ~500,000 vehicles/year per model. Explains why few global automakers dominate."
            },
            {
              "process": "Aircraft manufacturing",
              "explanation": "Boeing and Airbus duopoly due to enormous development costs ($10-20 billion for new plane), huge production facilities needed. Small producers can't compete."
            },
            {
              "process": "Semiconductor fabrication",
              "explanation": "Chip factories cost $10-20 billion. Massive scale needed to justify investment. Only handful of companies worldwide can afford."
            },
            {
              "process": "Software development",
              "explanation": "High fixed cost to develop software, near-zero marginal cost to copy. Once developed, can serve millions at minimal additional cost. Explains dominance of Microsoft, Adobe."
            }
          ]
        },
        {
          "type": "Strategic Implications",
          "description": "How firms use scale economies strategically",
          "examples": [
            {
              "process": "Barrier to entry",
              "explanation": "Large scale required for efficiency deters new entrants who can't immediately achieve that scale. Example: New auto company would need billions to build efficient-scale factory."
            },
            {
              "process": "Price competition",
              "explanation": "Large low-cost firms can price below smaller competitors' costs, driving them out. Example: Walmart's scale allows prices small retailers can't match."
            },
            {
              "process": "Global expansion",
              "explanation": "Firms expand internationally to achieve larger scale. Example: Samsung sells globally to achieve scale Korean market alone couldn't provide."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Economies of Scale Create Natural Monopolies",
          "statement": "When economies of scale are so extensive that one firm can supply entire market at lower cost than multiple firms, natural monopoly results.",
          "application": "Utilities (water, electricity distribution) often natural monopolies because duplicating infrastructure is inefficient.",
          "example": "Water distribution: Building two parallel water pipe systems to serve same city doubles fixed costs but doesn't double service—huge inefficiency. Single provider has lowest costs."
        },
        {
          "principle": "Scale Economies Can Be Exhausted",
          "statement": "Beyond certain scale, economies may be exhausted and diseconomies may begin. Firms have optimal size, not necessarily 'bigger is always better.'",
          "application": "Firms should expand only to point where LRAC is minimized, not beyond unless strategic reasons outweigh cost disadvantages.",
          "example": "Some manufacturing plants become too large—coordination problems, transportation costs for inputs, labor management issues cause costs to rise. Toyota found optimal plant size ~300,000 vehicles/year; larger plants less efficient."
        },
        {
          "principle": "Technological Change Alters Scale Economies",
          "statement": "New technologies can increase or decrease optimal firm size. Automation and digitalization sometimes reduce minimum efficient scale.",
          "application": "Monitor how technology affects scale economies in different industries.",
          "example": "3D printing reduces scale economies in manufacturing—small batches become economical. Digital music distribution reduced scale advantages compared to physical CD production and distribution."
        }
      ],
      "worked_examples": [
        {
          "title": "Analyzing Scale Economies in an Industry",
          "problem": "An industry has LRAC = 1000/Q + 20 + 0.01Q. Market demand: Q = 10,000 - 100P. (1) Find minimum efficient scale (MES). (2) How many efficient firms can market support? (3) Would this industry be competitive or concentrated?",
          "step_by_step": [
            {
              "step": "Find MES",
              "explanation": "MES is Q where LRAC minimized. Set derivative of LRAC = 0:\n$d(1000/Q + 20 + 0.01Q)/dQ = -1000/Q^2 + 0.01 = 0$\n$1000/Q^2 = 0.01$\n$Q^2 = 100,000$\n$Q = 316.2$ units (MES)"
            },
            {
              "step": "Calculate LRAC at MES",
              "explanation": "$LRAC_{min} = 1000/316.2 + 20 + 0.01(316.2) = 3.16 + 20 + 3.16 = \\$26.32$"
            },
            {
              "step": "Find market size at efficient price",
              "explanation": "In long run competitive equilibrium, P = minimum LRAC = \\$26.32\nMarket demand at this price: Q = 10,000 - 100(26.32) = 10,000 - 2,632 = 7,368 units"
            },
            {
              "step": "Calculate number of efficient firms",
              "explanation": "Each efficient firm produces at MES = 316.2 units\nNumber of firms = Market quantity / MES = 7,368 / 316.2 = 23.3 firms\nSince must be whole number: 23 or 24 firms"
            },
            {
              "step": "Analyze industry structure",
              "explanation": "23-24 efficient firms can operate in market. This is fairly competitive market (not concentrated). MES is only 316.2/7,368 = 4.3% of market—small relative to market size, so many efficient firms possible."
            },
            {
              "step": "Compare to concentration thresholds",
              "explanation": "Four-firm concentration ratio: If 24 equal-sized firms, each has 4.17% market share. Four largest would have 16.7%—well below 40% that indicates concentrated industry. This would be considered competitive structure."
            }
          ],
          "final_answer": "(1) Minimum efficient scale: Q = 316.2 units (LRAC = \\$26.32 at this output).\n(2) Market supports about 23-24 efficient firms (7,368 market quantity ÷ 316.2 MES).\n(3) Industry would be competitive, not concentrated, because MES is small relative to market demand (4.3%), allowing many efficient firms to operate.\n\nInterpretation: This industry has modest economies of scale—average costs decline up to 316 units but not dramatically. Small firms can be efficient, leading to competitive market structure. Contrast with industries where MES is 30-40% of market, leading to oligopoly.",
          "concept_applied": "MES relative to market size determines industry structure. Small MES/market ratio → many efficient firms possible → competitive market. Large MES/market ratio → few efficient firms possible → concentrated market. Calculating MES and comparing to market demand predicts industry structure."
        },
        {
          "title": "Scale Economies and Business Strategy",
          "problem": "A small manufacturer has ATC = \\$50 at current output of 1,000 units. A large competitor has ATC = \\$35 due to economies of scale. Market price = \\$45. (1) Can small firm survive in short run? Long run? (2) What strategies could small firm use to compete? (3) At what price would large firm drive small firm out?",
          "step_by_step": [
            {
              "step": "Analyze short run situation",
              "explanation": "Small firm: ATC = \\$50, P = \\$45 → losing \\$5/unit.\nBut check shutdown: Compare P to AVC. If AVC < \\$45, firm should continue operating in short run (covers variable costs plus contributes to fixed costs).\nAssume AVC = \\$40 (\\$10 fixed cost/unit). Since P = \\$45 > AVC = \\$40, firm should produce in short run, losing \\$5/unit instead of \\$10/unit fixed costs if shut down."
            },
            {
              "step": "Analyze long run situation",
              "explanation": "In long run, all costs must be covered. Small firm's ATC = \\$50 > P = \\$45, so earning economic loss. Will eventually exit unless can lower costs. Large firm: ATC = \\$35 < P = \\$45, earning economic profit of \\$10/unit."
            },
            {
              "step": "Small firm strategies",
              "explanation": "1. Niche specialization: Serve specialized market willing to pay premium.\n2. Innovation: Develop unique product features.\n3. Focus on flexibility/quality where large firm less agile.\n4. Form cooperative with other small firms to achieve purchasing economies.\n5. Outsource non-core functions to lower costs."
            },
            {
              "step": "Price that drives small firm out",
              "explanation": "Small firm's shutdown price in long run: minimum ATC = \\$50 (if that's its minimum). If large firm sets price just below \\$50 (say \\$49), small firm can't cover costs long run but large firm still profitable (\\$49 > \\$35 ATC).\nActually, small firm would exit when price falls below its minimum ATC in long run. Large firm could price at \\$49 temporarily to drive out small competitors, then raise price later."
            },
            {
              "step": "Consider predatory pricing",
              "explanation": "If large firm temporarily prices below its own costs (\\$35) to drive out competition, that's predatory pricing (illegal in many countries). More likely: Large firm prices at \\$40 (still above its \\$35 ATC, below small firm's \\$50 ATC), attracting customers while still profitable."
            }
          ],
          "final_answer": "(1) Short run: Small firm should produce (P > AVC), losing \\$5/unit but covering variable costs. Long run: Small firm will exit unless it can lower costs or differentiate, since ATC = \\$50 > P = \\$45.\n(2) Strategies: Niche markets, innovation, flexibility, cooperation with other small firms, outsourcing.\n(3) Large firm could drive small firm out by pricing below \\$50 (small firm's ATC). At P = \\$49, small firm loses money long run while large firm still profitable (\\$49 > \\$35).\n\nEconomics of scale create fundamental advantage: large firm's \\$35 cost vs. small firm's \\$50. This cost advantage forces small firms to differentiate or exit in competitive markets.",
          "concept_applied": "Economies of scale create cost advantages that determine competitive dynamics. Large low-cost firms can price below small firms' costs while remaining profitable. Small firms must find niches, innovate, or cooperate to survive. Market prices tend toward large firms' costs in competitive markets, squeezing out higher-cost small producers."
        }
      ],
      "image": {
        "src": "images/unit5/economies_of_scale.png",
        "alt": "Graph showing falling LRAC curve with MES marked, comparing small vs large firm costs",
        "caption": "Economies of scale: LRAC falls as output increases, giving large firms cost advantages"
      }
    },
    {
      "section_title": "5.9 Diseconomies of Scale",
      "introduction": "While economies of scale provide advantages to larger firms, diseconomies of scale represent the cost increases that can occur when firms grow beyond their optimal size. Understanding these limitations explains why firms don't grow indefinitely and why some large organizations become inefficient.",
      "key_concept": {
        "definition": "Diseconomies of scale occur when long run average cost increases as output increases beyond some point. This means excessively large scale creates inefficiencies that raise per-unit costs. Diseconomies of scale limit firm size and explain why some industries remain competitive with many medium-sized firms rather than being dominated by giants.",
        "context": "As firms expand, they eventually encounter coordination problems, communication difficulties, bureaucracy, and other issues that increase costs. These diseconomies counteract economies of scale, creating U-shaped long run average cost curves with clear optimal firm sizes. Diseconomies explain real-world phenomena like corporate restructuring, spin-offs of business units, and the failure of some mega-mergers. They also provide opportunities for smaller, more agile competitors to thrive even in industries with significant scale economies."
      },
      "categories": [
        {
          "type": "Sources of Diseconomies of Scale",
          "description": "Why larger scale can increase average costs",
          "examples": [
            {
              "process": "Managerial diseconomies",
              "explanation": "As organizations grow, communication breaks down, decision-making slows, bureaucracy increases. Example: Large corporation where decisions require multiple approvals, committees, paperwork—slower response to market changes than small entrepreneurial firm."
            },
            {
              "process": "Labor diseconomies",
              "explanation": "Worker motivation declines in large impersonal settings; unionization may increase wages above competitive levels; coordination problems among many workers. Example: Auto plants with 5,000+ workers face more strikes, absenteeism, coordination issues than smaller plants."
            },
            {
              "process": "Input price effects",
              "explanation": "Very large firms may bid up input prices locally or face transportation costs for distant inputs. Example: Large mining operation in remote area must pay premium wages to attract workers, pay more for local housing and services."
            },
            {
              "process": "Geographic dispersion costs",
              "explanation": "Operating multiple locations increases coordination and transportation costs. Example: National retailer with stores across country has higher logistics costs than local retailer serving one region."
            },
            {
              "process": "Risk of large-scale failure",
              "explanation": "Large investments in single facility create huge risk if technology becomes obsolete or demand shifts. Example: Building \\$10 billion semiconductor fab risks enormous loss if chip demand falls—smaller, flexible facilities less risky."
            }
          ]
        },
        {
          "type": "Evidence of Diseconomies",
          "description": "How diseconomies manifest in real organizations",
          "examples": [
            {
              "process": "Rising overhead ratios",
              "explanation": "Administrative costs as percentage of total costs increase with size. Example: Small startup: 5% overhead. Large corporation: 15% overhead due to multiple management layers, support functions."
            },
            {
              "process": "Decreasing productivity growth",
              "explanation": "As firms grow, productivity gains slow or reverse. Example: Study of manufacturing plants found productivity peaks at medium size, declines at very large size."
            },
            {
              "process": "Corporate restructuring",
              "explanation": "Large firms breaking up to improve efficiency demonstrates diseconomies. Example: IBM, HP, and other tech giants have spun off divisions to create more focused, agile companies."
            }
          ]
        },
        {
          "type": "Managing Diseconomies",
          "description": "How firms mitigate scale-related inefficiencies",
          "examples": [
            {
              "process": "Decentralization",
              "explanation": "Granting autonomy to divisions or business units. Example: General Electric operated as collection of relatively independent businesses to avoid corporate bureaucracy."
            },
            {
              "process": "Outsourcing",
              "explanation": "Contracting non-core functions to specialized firms. Example: Large manufacturer outsources logistics, IT, HR to avoid building huge internal bureaucracies."
            },
            {
              "process": "Technology solutions",
              "explanation": "Using IT to improve coordination and communication. Example: Enterprise resource planning (ERP) systems help large firms coordinate globally."
            },
            {
              "process": "Optimal plant size",
              "explanation": "Building multiple medium-sized plants rather than one giant plant. Example: Toyota operates many plants around 300,000 vehicle capacity rather than few mega-plants."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Every Firm Has an Optimal Size",
          "statement": "Due to countervailing economies and diseconomies, each firm has an optimal size where LRAC is minimized. Beyond this, further expansion increases average costs.",
          "application": "Firms should identify their optimal scale and avoid growing beyond it unless strategic considerations outweigh cost disadvantages.",
          "example": "Regional brewery might have optimal size of 500,000 barrels/year. Expanding to 5 million barrels might increase costs due to transportation of inputs/outputs, management complexity, losing local market focus."
        },
        {
          "principle": "Diseconomies Can Be Managed But Not Eliminated",
          "statement": "Good management can mitigate but not completely eliminate diseconomies of scale. There are inherent limits to organizational size.",
          "application": "Firms facing diseconomies should consider decentralization, spin-offs, or other structural changes rather than simply trying to manage growing bureaucracy.",
          "example": "Microsoft in 1990s faced diseconomies at ~30,000 employees; responded by creating semi-autonomous business units. Still, some diseconomies remained inherent to large software company."
        },
        {
          "principle": "Technological Change Alters Diseconomies",
          "statement": "New technologies (especially information technology) can push the point where diseconomies begin to higher output levels.",
          "application": "Firms can grow larger today before hitting diseconomies than in past due to better communication and coordination technologies.",
          "example": "Amazon employs ~1.5 million but manages through sophisticated IT systems. 1950s retailer could not have managed that many employees efficiently."
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Diseconomies in Cost Data",
          "problem": "A firm's long run average cost function is LRAC = 1000/Q + 10 + 0.0001Q². (1) Find minimum efficient scale (MES). (2) At what output do diseconomies of scale begin? (3) Calculate LRAC at Q=200, 500, 1000, 2000. (4) What does this tell about optimal firm size?",
          "step_by_step": [
            {
              "step": "Find MES (minimum LRAC)",
              "explanation": "Take derivative of LRAC: $d(1000/Q + 10 + 0.0001Q^2)/dQ = -1000/Q^2 + 0.0002Q = 0$\nMultiply by Q²: $-1000 + 0.0002Q^3 = 0$\n$0.0002Q^3 = 1000$\n$Q^3 = 5,000,000$\n$Q = \\sqrt[3]{5,000,000} = 171.0$ units"
            },
            {
              "step": "Verify this is minimum",
              "explanation": "Second derivative: $2000/Q^3 + 0.0002$. At Q=171, this is positive ($2000/5,000,000 + 0.0002 = 0.0004 + 0.0002 = 0.0006 > 0$), so minimum."
            },
            {
              "step": "Find where diseconomies begin",
              "explanation": "Diseconomies begin where LRAC stops falling and starts rising—exactly at MES. So diseconomies begin at Q > 171 units. For Q < 171, economies of scale (LRAC falling). For Q > 171, diseconomies of scale (LRAC rising)."
            },
            {
              "step": "Calculate LRAC at different outputs",
              "explanation": "$LRAC = 1000/Q + 10 + 0.0001Q^2$\n- Q=200: 1000/200 + 10 + 0.0001(40000) = 5 + 10 + 4 = \\$19\n- Q=500: 1000/500 + 10 + 0.0001(250000) = 2 + 10 + 25 = \\$37\n- Q=1000: 1000/1000 + 10 + 0.0001(1000000) = 1 + 10 + 100 = \\$111\n- Q=2000: 1000/2000 + 10 + 0.0001(4000000) = 0.5 + 10 + 400 = \\$410.5"
            },
            {
              "step": "Analyze pattern",
              "explanation": "LRAC reaches minimum \\$? at Q=171. Calculate: 1000/171 + 10 + 0.0001(29241) = 5.85 + 10 + 2.92 = \\$18.77\nThen rises slowly at first (\\$19 at Q=200), then dramatically (\\$37 at Q=500, \\$111 at Q=1000, \\$410.5 at Q=2000).\nDiseconomies are severe beyond 500 units—costs explode due to Q² term."
            }
          ],
          "final_answer": "(1) Minimum efficient scale: Q = 171 units (LRAC = \\$18.77).\n(2) Diseconomies begin immediately beyond Q=171 (LRAC starts rising).\n(3) LRAC: Q=200 → \\$19, Q=500 → \\$37, Q=1000 → \\$111, Q=2000 → \\$410.5.\n(4) Optimal firm size is around 171 units. Expanding significantly beyond this dramatically increases costs (severe diseconomies). This firm should not grow much beyond 200 units—costs rise rapidly due to strong diseconomies (Q² term in cost function).\n\nInterpretation: The Q² term creates powerful diseconomies—costs rise with square of output. This might represent coordination costs that grow exponentially with size. Such firms have strong incentive to stay near optimal scale.",
          "concept_applied": "Diseconomies of scale cause LRAC to rise beyond MES. The mathematical form shows how severe diseconomies are—here, quadratic term causes explosive cost growth at large scale. Real-world firms with such cost structures would be small to medium-sized, not giants."
        },
        {
          "title": "Corporate Restructuring to Address Diseconomies",
          "problem": "A large conglomerate has 10 divisions. Overall ATC = \\$45. Market analysis shows each division alone would have ATC = \\$35 if independent. Conglomerate's overhead costs = \\$200 million/year. Each division generates \\$100 million revenue. Should firm consider breaking up? Calculate the cost impact.",
          "step_by_step": [
            {
              "step": "Calculate current situation",
              "explanation": "Total revenue = 10 × \\$100M = \\$1,000M\nATC = \\$45 means total cost = \\$45 × (output value equivalent)\nActually, easier: Current profit = Revenue - Cost. But need output measure.\nInstead, use given: Overhead = \\$200M. Divisions' own costs = ?"
            },
            {
              "step": "Estimate division costs if independent",
              "explanation": "If each division alone has ATC = \\$35 at \\$100M revenue, then each division's cost = \\$35 × (their output measure).\nTotal for 10 independent divisions = 10 × \\$35 × output = \\$350 × output measure.\nCurrent conglomerate cost = same output at \\$45 × output = \\$450 × output measure."
            },
            {
              "step": "Compare costs",
              "explanation": "Conglomerate costs \\$100 × output measure more than separate divisions (\\$450 vs \\$350 for same output).\nThis extra \\$100 is the diseconomy of scale—corporate overhead and coordination costs that independent divisions wouldn't have."
            },
            {
              "step": "Consider breakup value",
              "explanation": "If broken up, total costs would fall by amount of diseconomies. The \\$200M overhead would be eliminated or greatly reduced (each small firm would have some overhead but much less).\nAssuming divisions become independent firms with own smaller overheads totaling \\$50M (not \\$200M), savings = \\$150M/year."
            },
            {
              "step": "Evaluate decision",
              "explanation": "Breaking up would save \\$150M/year in costs. Reasons to stay together: synergy benefits (if any), combined purchasing power, brand value. But given ATC \\$45 vs \\$35, diseconomies outweigh economies.\nLikely should break up or significantly decentralize."
            }
          ],
          "final_answer": "The conglomerate appears to have significant diseconomies of scale: ATC = \\$45 compared to \\$35 if divisions were independent. This 29% cost penalty (\\$45/\\$35 = 1.29) suggests corporate overhead and coordination costs outweigh any synergies.\nBreaking up could save approximately \\$150 million/year (eliminating most of \\$200M overhead while adding some smaller overheads to independent firms).\nThis exemplifies why large firms sometimes spin off divisions—when diseconomies outweigh economies, smaller independent firms are more efficient.",
          "concept_applied": "Diseconomies of scale manifest as higher costs in large organizations compared to what separate units would have. When corporate overhead, bureaucracy, and coordination problems increase costs more than any scale economies reduce them, restructuring (breakup, decentralization) can improve efficiency. This explains real-world corporate spin-offs and restructuring."
        }
      ],
      "image": {
        "src": "images/unit5/diseconomies_of_scale.png",
        "alt": "U-shaped LRAC curve showing economies of scale region, constant returns, and diseconomies region",
        "caption": "Diseconomies of scale: LRAC rises beyond optimal scale due to coordination problems and bureaucracy"
      }
    },
    {
      "section_title": "5.10 Firm Goals and Revenue",
      "introduction": "Firms exist within markets and must understand revenue concepts alongside costs to make optimal decisions. While cost minimization is important, revenue generation and profit maximization are ultimate goals for most firms. This section connects production costs to market revenues.",
      "key_concept": {
        "definition": "Firms typically aim to maximize profit, which requires understanding both costs (covered previously) and revenues. Revenue analysis considers how much money firms receive from selling output at different prices and quantities. The relationship between revenue and quantity depends on market structure—whether firms are price-takers (perfect competition) or price-makers (imperfect competition).",
        "context": "In perfect competition, firms face horizontal demand curves at market price—they can sell any quantity at that price without affecting it. Their revenue per unit (average revenue) equals price, and marginal revenue also equals price. In imperfect competition (monopoly, oligopoly, monopolistic competition), firms face downward-sloping demand curves—selling more requires lowering price, so marginal revenue is less than price. Understanding these revenue concepts, combined with cost analysis, allows determination of profit-maximizing output and price."
      },
      "categories": [
        {
          "type": "Revenue Concepts",
          "description": "Different measures of firm revenue",
          "examples": [
            {
              "process": "Total Revenue (TR)",
              "explanation": "Total money received from sales: $TR = P \\times Q$. For price-taking firms: $TR = P_{market} \\times Q$. For price-making firms: $TR = P(Q) \\times Q$ where P(Q) is demand curve."
            },
            {
              "process": "Average Revenue (AR)",
              "explanation": "Revenue per unit sold: $AR = TR/Q$. Always equals price (since TR = P×Q, so TR/Q = P). Demand curve is also average revenue curve."
            },
            {
              "process": "Marginal Revenue (MR)",
              "explanation": "Additional revenue from selling one more unit: $MR = \\Delta TR/\\Delta Q$. For price-takers: MR = P (constant). For price-makers with downward-sloping demand: MR < P, and MR curve lies below demand curve."
            }
          ]
        },
        {
          "type": "Revenue in Different Market Structures",
          "description": "How market power affects revenue relationships",
          "examples": [
            {
              "process": "Perfect competition",
              "explanation": "Firm faces horizontal demand at market price. $P = MR = AR$. TR is straight line through origin with slope P. Example: Wheat farmer sells at \\$5/bushel market price—can sell 100 or 1,000 bushels at same price, MR always \\$5."
            },
            {
              "process": "Monopoly",
              "explanation": "Firm faces downward-sloping market demand. To sell more, must lower price on all units. MR < P. TR initially increases (elastic demand region), reaches maximum (unitary elasticity), then decreases (inelastic region). Example: Pharmaceutical company with patent—faces entire market demand curve."
            },
            {
              "process": "Monopolistic competition",
              "explanation": "Firm faces downward-sloping demand due to product differentiation, but relatively elastic because of substitutes. MR < P but close to P if good substitutes exist. Example: Restaurant with unique cuisine but many competitors—some pricing power but limited."
            }
          ]
        },
        {
          "type": "Profit Maximization",
          "description": "Combining revenue and cost analysis",
          "examples": [
            {
              "process": "Profit definition",
              "explanation": "Economic profit = Total Revenue - Total Cost (including opportunity costs). Accounting profit = TR - explicit costs only. Firms maximize economic profit."
            },
            {
              "process": "General profit-maximizing rule",
              "explanation": "Produce where MR = MC. If MR > MC, produce more (adds to profit). If MR < MC, produce less (reduces loss). At MR = MC, profit maximized (or loss minimized)."
            },
            {
              "process": "Perfect competition special case",
              "explanation": "Since P = MR, rule becomes P = MC. Firm produces quantity where market price equals marginal cost."
            },
            {
              "process": "Shutdown condition",
              "explanation": "In short run: Shut down if P < AVC (loss minimized by producing zero). Continue operating if P > AVC even if P < ATC (covers variable costs, contributes to fixed costs)."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Profit Maximization Occurs Where MR = MC",
          "statement": "Regardless of market structure, firms maximize profit by producing quantity where marginal revenue equals marginal cost.",
          "application": "To find profit-maximizing output, calculate or estimate MR and MC functions, find where they intersect.",
          "example": "Monopoly with demand P = 100 - 2Q has MR = 100 - 4Q. If MC = 20, set 100 - 4Q = 20 → 4Q = 80 → Q = 20. Then P = 100 - 2(20) = \\$60. Profit = TR - TC = (60×20) - TC."
        },
        {
          "principle": "Price-Takers vs. Price-Makers",
          "statement": "In perfect competition, firms are price-takers (MR = P). In imperfect competition, firms are price-makers (MR < P). This distinction dramatically affects firm behavior and market outcomes.",
          "application": "When analyzing firms, first determine market structure to know which revenue conditions apply.",
          "example": "Wheat farmer (price-taker): Takes \\$5/bushel price, produces where MC = \\$5. Microsoft (price-maker): Faces downward demand for Windows, chooses price/quantity where MR = MC, resulting in P > MC."
        },
        {
          "principle": "Revenue Alone Doesn't Determine Success",
          "statement": "High revenue doesn't guarantee profit—costs matter equally. Firms must consider both revenue and cost structures.",
          "application": "Analyze profit, not just revenue growth. Sometimes reducing output (and revenue) increases profit if it reduces costs more.",
          "example": "Airline flying half-empty planes might increase profit by reducing flights (lowering revenue but lowering costs even more). Maximizing revenue (filling every seat with discount fares) might reduce profit if fares don't cover costs."
        }
      ],
      "worked_examples": [
        {
          "title": "Perfect Competitive Firm Decision",
          "problem": "A perfectly competitive firm has cost structure: TC = 100 + 10Q + 0.5Q². Market price = \\$30. (1) Find profit-maximizing output. (2) Calculate profit. (3) Should firm produce or shut down in short run? (4) What is long run equilibrium price?",
          "step_by_step": [
            {
              "step": "Find MC",
              "explanation": "$MC = d(TC)/dQ = 10 + Q$"
            },
            {
              "step": "Set P = MC",
              "explanation": "Perfect competition: P = MR = MC\n30 = 10 + Q → Q = 20 units"
            },
            {
              "step": "Calculate profit",
              "explanation": "TR = P × Q = 30 × 20 = \\$600\nTC = 100 + 10(20) + 0.5(20²) = 100 + 200 + 200 = \\$500\nProfit = 600 - 500 = \\$100\nOr: ATC at Q=20: 500/20 = \\$25. Profit per unit = 30 - 25 = \\$5 × 20 = \\$100"
            },
            {
              "step": "Check shutdown decision",
              "explanation": "AVC = TVC/Q = (10Q + 0.5Q²)/Q = 10 + 0.5Q\nAt Q=20: AVC = 10 + 0.5(20) = 10 + 10 = \\$20\nSince P = \\$30 > AVC = \\$20, firm should produce in short run."
            },
            {
              "step": "Find minimum ATC for long run",
              "explanation": "ATC = TC/Q = 100/Q + 10 + 0.5Q\nDerivative: -100/Q² + 0.5 = 0 → 100/Q² = 0.5 → Q² = 200 → Q = 14.14\nATC at Q=14.14: 100/14.14 + 10 + 0.5(14.14) = 7.07 + 10 + 7.07 = \\$24.14"
            },
            {
              "step": "Long run equilibrium price",
              "explanation": "In long run competitive equilibrium, P = minimum ATC = \\$24.14 (and zero economic profit).\nCurrent price \\$30 > \\$24.14, so firms earning economic profit, attracting entry, which will drive price down to \\$24.14 in long run."
            }
          ],
          "final_answer": "(1) Profit-maximizing output: Q = 20 units (where P = MC).\n(2) Economic profit = \\$100.\n(3) Yes, produce in short run because P = \\$30 > AVC = \\$20.\n(4) Long run equilibrium price = minimum ATC = \\$24.14. At this price, firms earn zero economic profit.\n\nInterpretation: The firm is currently earning economic profit due to market price above minimum ATC. This will attract new entrants in long run, increasing supply and driving price down to \\$24.14, eliminating economic profit.",
          "concept_applied": "Perfectly competitive firm: P = MR = AR. Profit-maximizing output where P = MC. Short run: produce if P > AVC. Long run equilibrium: P = minimum ATC (zero economic profit). Current profits signal entry, which will eliminate profits in long run."
        },
        {
          "title": "Monopoly Profit Maximization",
          "problem": "A monopoly faces demand: P = 100 - 2Q. Cost: TC = 50 + 20Q. (1) Find profit-maximizing price and quantity. (2) Calculate profit. (3) Calculate deadweight loss compared to perfect competition. (4) What would perfect competitive outcome be?",
          "step_by_step": [
            {
              "step": "Find MR",
              "explanation": "TR = P × Q = (100 - 2Q)Q = 100Q - 2Q²\nMR = d(TR)/dQ = 100 - 4Q"
            },
            {
              "step": "Find MC",
              "explanation": "MC = d(TC)/dQ = 20"
            },
            {
              "step": "Set MR = MC",
              "explanation": "100 - 4Q = 20\n4Q = 80\nQ = 20 units"
            },
            {
              "step": "Find price",
              "explanation": "P = 100 - 2(20) = 100 - 40 = \\$60"
            },
            {
              "step": "Calculate profit",
              "explanation": "TR = P × Q = 60 × 20 = \\$1,200\nTC = 50 + 20(20) = 50 + 400 = \\$450\nProfit = 1,200 - 450 = \\$750"
            },
            {
              "step": "Find perfect competition outcome",
              "explanation": "Perfect competition: P = MC\n100 - 2Q = 20\n2Q = 80\nQ = 40 units\nP = \\$20"
            },
            {
              "step": "Calculate deadweight loss",
              "explanation": "DWL = area of triangle between Q=20 and Q=40\nHeight difference: At Q=20, P=60; at Q=40, P=20\nBut better: DWL = 0.5 × (Qc - Qm) × (Pm - MC at Qm)\n= 0.5 × (40 - 20) × (60 - 20) = 0.5 × 20 × 40 = \\$400\n(Represents lost consumer and producer surplus compared to competitive outcome)"
            }
          ],
          "final_answer": "(1) Monopoly outcome: Q = 20 units, P = \\$60.\n(2) Monopoly profit = \\$750.\n(3) Perfect competition outcome: Q = 40 units, P = \\$20.\n(4) Deadweight loss = \\$400 (value of transactions that would occur under competition but don't under monopoly).\n\nComparison: Monopoly restricts output (20 vs 40) and charges higher price (\\$60 vs \\$20), generating profit but creating inefficiency. Consumers lose more than monopoly gains, resulting in net social loss of \\$400.",
          "concept_applied": "Monopoly profit maximization: MR = MC determines quantity, then price from demand curve. Contrast with perfect competition: P = MC. Monopoly results in higher price, lower quantity, deadweight loss. This shows market structure's profound impact on outcomes."
        }
      ],
      "image": {
        "src": "images/unit5/revenue_profit_max.png",
        "alt": "Graphs showing MR=MC profit maximization for perfect competition and monopoly",
        "caption": "Profit maximization: Firms produce where MR = MC, with different revenue conditions based on market structure"
      }
    }
  ],
  "key_terms": [
    "Total Fixed Cost (TFC)",
    "Total Variable Cost (TVC)",
    "Total Cost (TC)",
    "Marginal Cost (MC)",
    "Average Fixed Cost (AFC)",
    "Average Variable Cost (AVC)",
    "Average Total Cost (ATC)",
    "Short run cost curves",
    "Long run average cost (LRAC)",
    "Minimum efficient scale (MES)",
    "Economies of scale",
    "Diseconomies of scale",
    "Total Revenue (TR)",
    "Average Revenue (AR)",
    "Marginal Revenue (MR)",
    "Profit maximization",
    "MR = MC rule",
    "Shutdown condition"
  ],
  "summary": "Cost calculation (5.5) involves computing total, average, and marginal costs from production data. Total cost = fixed + variable costs. Average costs = total costs divided by quantity. Marginal cost = additional cost of one more unit. These calculations enable firms to determine optimal production levels and profitability. Short run cost curves (5.6) graphically show cost relationships when some inputs are fixed. Total cost curves sum fixed and variable components. Average and marginal cost curves typically show U-shapes due to diminishing returns. MC intersects AVC and ATC at their minimum points. These curves inform short run production and shutdown decisions. Long run costs (5.7) represent minimum costs when all inputs are variable. LRAC is envelope of all possible short run ATC curves. Firms plan optimal scale in long run, then operate within that constraint in short run. Long run flexibility allows true cost minimization. Economies of scale (5.8) occur when LRAC falls as output increases, giving larger firms cost advantages. Sources include technical efficiencies, bulk purchasing, specialization, and financial economies. Economies of scale explain why some industries have large firms and create barriers to entry. Minimum efficient scale relative to market size determines how many efficient firms an industry can support. Diseconomies of scale (5.9) occur when LRAC rises beyond optimal scale due to coordination problems, bureaucracy, communication difficulties, and management challenges. These limit firm size and explain why firms don't grow indefinitely. Well-managed firms use decentralization, outsourcing, and technology to mitigate diseconomies. Every firm has optimal size where LRAC minimized. Firm goals and revenue (5.10) complete the picture: firms aim to maximize profit by producing where marginal revenue equals marginal cost. In perfect competition, firms are price-takers with MR = P. In imperfect competition, firms face downward-sloping demand with MR < P. Revenue analysis combined with cost analysis determines profit-maximizing output and price. Short run shutdown occurs if price falls below average variable cost. Long run equilibrium in perfect competition requires price equals minimum average total cost. Together, these concepts explain how firms make production decisions, why costs behave as they do at different scales, and how market structure affects firm behavior and economic efficiency."
}
