{
  "expanded_description": "Firms face critical decisions about how to organize production to minimize costs and maximize profits. Understanding production functions, the distinction between short-run and long-run decisions, and various cost structures is essential for analyzing firm behavior in different market structures.",
  "core_concept": {
    "principle": "Firms incur costs when they purchase inputs for production. These costs are categorized as fixed (unrelated to output level in the short run), variable (changing with output), and total (sum of fixed and variable). Marginal and average costs help determine optimal production levels. In the long run, all costs become variable, and firms can adjust their scale of operations to achieve efficiency.",
    "explanation": "Cost analysis is fundamental to firm decision-making. Fixed costs (like rent, salaries for permanent staff) must be paid regardless of production levels. Variable costs (like raw materials, hourly labor) increase as output rises. Total cost combines both. Understanding marginal cost (the cost of producing one more unit) and average costs helps firms determine profit-maximizing output. In the long run, firms can choose optimal plant size, potentially achieving economies of scale (falling average costs with increased scale) or facing diseconomies of scale (rising average costs).",
    "image": {
      "src": "images/unit5/cost_structure.png",
      "alt": "Graph showing fixed, variable, and total cost curves",
      "caption": "Cost structures: Fixed costs are constant, variable costs increase with output, and total cost is their sum."
    }
  },
  "sections": [
    {
      "section_title": "5.4 Costs of Production",
      "introduction": "Every firm incurs costs when it purchases inputs (factors of production) to produce outputs. Understanding different types of costs is crucial for making production decisions and maximizing profits.",
      "key_concept": {
        "definition": "Costs of production are the expenses firms incur when they purchase inputs (land, labor, capital) to produce goods and services. These costs are categorized based on how they change with output level and time horizon.",
        "context": "Costs determine profitability. A firm must cover its costs to survive in the long run. Different cost behaviors affect decisions about how much to produce, what price to charge, and whether to continue operating or shut down."
      },
      "categories": [
        {
          "type": "Explicit vs. Implicit Costs",
          "description": "Costs can be either explicit (direct, out-of-pocket payments) or implicit (opportunity costs of using owned resources).",
          "examples": [
            {
              "process": "Explicit costs",
              "explanation": "Direct monetary payments to outsiders for resources. These are recorded in accounting statements. Example: Wages paid to employees, rent for factory space, cost of raw materials, utility bills, insurance premiums."
            },
            {
              "process": "Implicit costs",
              "explanation": "Opportunity costs of using resources the firm already owns. No cash transaction occurs, but value is forgone. Example: Owner's time that could be used elsewhere (implicit wage), capital that could earn interest if invested elsewhere, building owned by firm that could be rented out."
            },
            {
              "process": "Economic vs. accounting costs",
              "explanation": "Accounting costs include only explicit costs. Economic costs include both explicit and implicit costs. Economic profit = Total revenue - (Explicit + Implicit costs). Accounting profit = Total revenue - Explicit costs only."
            }
          ]
        },
        {
          "type": "Fixed Costs (FC)",
          "description": "Costs that do not vary with the quantity of output produced in the short run.",
          "examples": [
            {
              "process": "Nature of fixed costs",
              "explanation": "Must be paid even if output is zero. Unavoidable in the short run because they're tied to fixed inputs. Example: Rent on factory building, annual insurance premiums, property taxes, salaries of permanent management staff, depreciation of machinery."
            },
            {
              "process": "Time horizon",
              "explanation": "Fixed only in the short run. In the long run, all costs become variable as firms can adjust all inputs. Example: A 5-year lease makes rent fixed for 5 years but variable thereafter if the firm can move."
            },
            {
              "process": "Graphical representation",
              "explanation": "Fixed cost curve is a horizontal line—constant at all output levels. Example: If monthly rent is \\$5,000, FC curve is horizontal at \\$5,000 from Q=0 to Q=maximum capacity."
            }
          ]
        },
        {
          "type": "Variable Costs (VC)",
          "description": "Costs that vary directly with the quantity of output produced.",
          "examples": [
            {
              "process": "Nature of variable costs",
              "explanation": "Increase when more output is produced, decrease when less is produced. Zero when output is zero. Example: Cost of raw materials, hourly wages for production workers, electricity for machinery, packaging materials."
            },
            {
              "process": "Relationship to production",
              "explanation": "Closely tied to production decisions. More output requires more variable inputs. Example: Bakery producing more bread needs more flour, yeast, and bakers' time—all variable costs."
            },
            {
              "process": "Graphical representation",
              "explanation": "Variable cost curve starts at origin (zero output, zero VC) and rises, initially at a decreasing rate then at an increasing rate due to diminishing returns. Example: VC curve for a factory shows gradual increase at low output, steeper increase at high output."
            }
          ]
        },
        {
          "type": "Total Costs (TC)",
          "description": "The sum of all costs incurred in production at a given output level.",
          "examples": [
            {
              "process": "Calculation",
              "explanation": "TC = FC + VC. At each output level, add fixed and variable costs. Example: If FC = \\$5,000 and VC for 100 units = \\$3,000, then TC for 100 units = \\$8,000."
            },
            {
              "process": "Behavior",
              "explanation": "TC has the same shape as VC but shifted upward by the amount of FC. Since FC is constant, the vertical distance between TC and VC equals FC at every output level."
            },
            {
              "process": "Minimum output consideration",
              "explanation": "Even at zero output, TC = FC (since VC = 0). Example: Factory temporarily shut down still pays rent (FC), so TC = FC when Q=0."
            }
          ]
        },
        {
          "type": "Sunk Costs",
          "description": "Costs that have already been incurred and cannot be recovered, regardless of future decisions.",
          "examples": [
            {
              "process": "Irrelevance to decisions",
              "explanation": "Sunk costs should not affect future production decisions because they cannot be changed. Example: Non-refundable deposit on equipment, research and development already conducted, advertising expenditures that cannot be recovered."
            },
            {
              "process": "Decision-making principle",
              "explanation": "Only future costs that can be affected by current decisions matter. Rational firms ignore sunk costs when deciding whether to continue production. Example: Movie studio should finish a film if future revenues exceed future costs, even if millions have already been spent—sunk costs are irrelevant."
            },
            {
              "process": "Common errors",
              "explanation": "People often consider sunk costs in decisions (\"we've spent so much already, we must continue\"), but this leads to poor economic decisions."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Fixed Costs Are Irrelevant to Short-Run Production Decisions",
          "statement": "In the short run, fixed costs must be paid regardless of output level, so they don't affect decisions about how much to produce.",
          "application": "Firms should ignore fixed costs when deciding optimal output level in the short run. Only variable costs and revenues matter for these marginal decisions.",
          "example": "A restaurant pays \\$10,000 monthly rent (FC). Whether it serves 100 or 1,000 customers, rent is the same. The decision to stay open an extra hour depends on whether additional revenue covers additional variable costs (food, extra staff wages), not on the rent already committed."
        },
        {
          "principle": "Variable Costs Determine Short-Run Shutdown Decisions",
          "statement": "In the short run, a firm should continue operating if it can cover its variable costs, even if it cannot cover all fixed costs.",
          "application": "As long as price (revenue per unit) exceeds average variable cost, the firm minimizes losses by continuing production rather than shutting down.",
          "example": "A factory with FC = \\$10,000 and VC = \\$5 per unit. If price is \\$6, it covers VC (\\$5) and contributes \\$1 toward FC. Shutting down means losing \\$10,000 (all FC). Continuing means losing \\$10,000 - (\\$1 contribution × units sold). Continuing is less bad."
        },
        {
          "principle": "All Costs Are Variable in the Long Run",
          "statement": "Given enough time, firms can adjust all inputs, so all costs become variable. There are no fixed costs in the long run.",
          "application": "Long-run decisions involve choosing optimal scale of operations, technology, and location where all costs can be adjusted.",
          "example": "A 5-year lease makes rent fixed for 5 years. After 5 years, the firm can move to a smaller or larger space, making rent variable in this longer time frame. Similarly, machinery can be bought or sold, making depreciation costs variable."
        },
        {
          "principle": "Sunk Costs Should Be Ignored in Decision Making",
          "statement": "Rational economic decisions consider only future costs and benefits. Past expenditures that cannot be recovered (sunk costs) are irrelevant.",
          "application": "When deciding whether to continue a project, only consider additional costs going forward and additional revenues expected.",
          "example": "A company has spent \\$5 million developing a product. Market research now shows it will only generate \\$1 million in revenue with \\$0.8 million in additional costs to launch. Despite the \\$5 million already spent, the rational decision is to abandon the project because future revenues (\\$1M) don't exceed future costs (\\$0.8M + any other future costs). The \\$5 million is sunk and irrelevant."
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying and Calculating Different Cost Types",
          "problem": "A bakery has the following monthly expenses: Rent \\$2,000, Loan payment on ovens \\$500, Flour and ingredients \\$3 per loaf, Baker wages \\$2 per loaf, Manager salary \\$3,000, Utilities \\$500 + \\$0.10 per loaf, Insurance \\$200. The bakery can produce up to 10,000 loaves monthly. Identify each expense as fixed cost (FC), variable cost (VC), or mixed. Calculate total FC, VC per loaf, and TC for 5,000 loaves.",
          "step_by_step": [
            {
              "step": "Identify fixed costs",
              "explanation": "Fixed costs don't vary with output: Rent (\\$2,000), Loan payment (\\$500), Manager salary (\\$3,000), Insurance (\\$200). These total \\$5,700 monthly regardless of loaves produced."
            },
            {
              "step": "Identify variable costs",
              "explanation": "Variable costs per loaf: Flour (\\$3 per loaf), Baker wages (\\$2 per loaf), Variable portion of utilities (\\$0.10 per loaf). Variable cost per loaf = \\$3 + \\$2 + \\$0.10 = \\$5.10 per loaf."
            },
            {
              "step": "Identify mixed cost",
              "explanation": "Utilities has both fixed and variable components: Fixed portion = \\$500, Variable portion = \\$0.10 per loaf. We already allocated the variable portion to VC per loaf. The \\$500 fixed portion should be added to FC."
            },
            {
              "step": "Recalculate FC including mixed cost fixed portion",
              "explanation": "FC = Rent (\\$2,000) + Loan (\\$500) + Manager salary (\\$3,000) + Insurance (\\$200) + Fixed utilities (\\$500) = \\$6,200."
            },
            {
              "step": "Calculate costs for 5,000 loaves",
              "explanation": "FC = \\$6,200 (unchanged). VC = \\$5.10 per loaf × 5,000 loaves = \\$25,500. TC = FC + VC = \\$6,200 + \\$25,500 = \\$31,700."
            },
            {
              "step": "Summarize cost structure",
              "explanation": "At 5,000 loaves: FC = \\$6,200, VC = \\$25,500, TC = \\$31,700. Cost per loaf (average total cost) = \\$31,700 / 5,000 = \\$6.34."
            }
          ],
          "final_answer": "Fixed costs: \\$6,200 monthly (rent, loan, manager salary, insurance, fixed utilities). Variable cost: \\$5.10 per loaf (flour, baker wages, variable utilities). For 5,000 loaves: FC = \\$6,200, VC = \\$25,500, TC = \\$31,700.",
          "concept_applied": "Properly distinguishing fixed vs. variable costs is essential for production decisions. Fixed costs remain constant regardless of output level, while variable costs change directly with production quantity. Mixed costs must be separated into their fixed and variable components."
        },
        {
          "title": "Sunk Cost Decision Making",
          "problem": "A software company has spent \\$2 million developing a new app. To launch it, they need an additional \\$200,000 for marketing. Market analysis predicts the app will generate \\$300,000 in revenue. Should they launch the app? What if they had only spent \\$100,000 developing it?",
          "step_by_step": [
            {
              "step": "Identify sunk costs",
              "explanation": "The \\$2 million already spent on development is a sunk cost—it cannot be recovered regardless of the launch decision. It should be ignored in the decision."
            },
            {
              "step": "Consider only future costs and revenues",
              "explanation": "Future costs to launch = \\$200,000 marketing. Future revenues expected = \\$300,000. Net future benefit = \\$300,000 - \\$200,000 = \\$100,000."
            },
            {
              "step": "Make decision based on future net benefit",
              "explanation": "Since future revenues (\\$300,000) exceed future costs (\\$200,000), launching generates a \\$100,000 future gain. The rational decision is to launch, despite the \\$2 million already spent."
            },
            {
              "step": "Consider alternative scenario",
              "explanation": "If only \\$100,000 had been spent on development, this is still a sunk cost. The decision remains the same: compare future revenues (\\$300,000) with future costs (\\$200,000). The answer is still to launch because future net benefit is \\$100,000."
            },
            {
              "step": "Explain sunk cost irrelevance",
              "explanation": "The amount already spent (whether \\$2 million or \\$100,000) doesn't change the future costs and revenues, so it shouldn't affect the decision. Only people who don't understand sunk costs would make different decisions in the two scenarios."
            }
          ],
          "final_answer": "Yes, they should launch the app. The \\$2 million development cost is sunk and irrelevant. The decision should be based only on future costs (\\$200,000 marketing) and future revenues (\\$300,000). Since future revenues exceed future costs by \\$100,000, launching is beneficial. The answer would be the same if they had spent only \\$100,000 on development—sunk costs don't affect rational decisions.",
          "concept_applied": "Sunk costs are past expenditures that cannot be recovered. Rational decision-making ignores sunk costs and considers only future costs and benefits. This prevents the \"throwing good money after bad\" fallacy where past losses influence decisions about future actions."
        }
      ],
      "image": {
        "src": "images/unit5/cost_types.png",
        "alt": "Diagram showing classification of costs: explicit vs implicit, fixed vs variable, sunk costs",
        "caption": "Different ways to categorize production costs: explicit/implicit, fixed/variable, and sunk costs"
      }
    },
    {
      "section_title": "5.5 Calculating Costs",
      "introduction": "Beyond identifying different cost types, firms need to calculate various cost measures to make informed production decisions. Marginal and average cost calculations are particularly important for determining optimal output levels.",
      "key_concept": {
        "definition": "Cost calculation involves determining total, average, and marginal costs at different output levels. These measures help firms understand cost behavior and make production decisions.",
        "context": "Different cost measures serve different purposes. Average costs help determine per-unit profitability. Marginal costs determine optimal production levels. Understanding how these costs relate to each other is key to profit maximization."
      },
      "categories": [
        {
          "type": "Average Fixed Cost (AFC)",
          "description": "Fixed cost per unit of output.",
          "examples": [
            {
              "process": "Calculation",
              "explanation": "AFC = Total Fixed Cost / Quantity (Q) = FC / Q. Since FC is constant, AFC decreases continuously as Q increases."
            },
            {
              "process": "Behavior",
              "explanation": "AFC curve is a rectangular hyperbola—it declines steeply at first, then more gradually. Example: If FC = \\$1,000, AFC at Q=100 is \\$10, at Q=1,000 is \\$1, at Q=10,000 is \\$0.10."
            },
            {
              "process": "Economic significance",
              "explanation": "Shows how fixed costs are spread over more units. Important for pricing decisions in the long run but irrelevant for short-run production decisions."
            }
          ]
        },
        {
          "type": "Average Variable Cost (AVC)",
          "description": "Variable cost per unit of output.",
          "examples": [
            {
              "process": "Calculation",
              "explanation": "AVC = Total Variable Cost / Quantity (Q) = VC / Q."
            },
            {
              "process": "Behavior",
              "explanation": "AVC typically U-shaped: initially decreases due to increasing returns, then increases due to diminishing marginal returns. Minimum point indicates most efficient variable cost per unit."
            },
            {
              "process": "Economic significance",
              "explanation": "Critical for short-run shutdown decisions. If price falls below minimum AVC, firm should shut down immediately. Also important for pricing in competitive markets."
            }
          ]
        },
        {
          "type": "Average Total Cost (ATC)",
          "description": "Total cost per unit of output, also called average cost.",
          "examples": [
            {
              "process": "Calculation",
              "explanation": "ATC = Total Cost / Quantity (Q) = TC / Q = AFC + AVC."
            },
            {
              "process": "Behavior",
              "explanation": "ATC is U-shaped: initially declines due to falling AFC and possibly AVC, reaches minimum, then rises due to rising AVC. The minimum ATC point represents the most efficient scale in the short run."
            },
            {
              "process": "Economic significance",
              "explanation": "Key for profitability analysis. In perfect competition, price tends toward minimum ATC in long-run equilibrium. Firms want to produce at or near minimum ATC for efficiency."
            }
          ]
        },
        {
          "type": "Marginal Cost (MC)",
          "description": "The additional cost of producing one more unit of output.",
          "examples": [
            {
              "process": "Calculation",
              "explanation": "MC = Change in Total Cost / Change in Quantity = ΔTC / ΔQ. Since ΔTC = ΔVC (FC doesn't change), MC = ΔVC / ΔQ."
            },
            {
              "process": "Behavior",
              "explanation": "MC curve is typically U-shaped but rises earlier than AVC and ATC. MC intersects both AVC and ATC at their minimum points. Initially may fall due to increasing returns, then rises due to diminishing marginal returns."
            },
            {
              "process": "Economic significance",
              "explanation": "Most important cost for production decisions. Profit maximization requires producing where MR = MC (marginal revenue equals marginal cost). Determines whether to produce additional units."
            }
          ]
        },
        {
          "type": "Relationship Between Cost Curves",
          "description": "How different cost measures relate mathematically and graphically.",
          "examples": [
            {
              "process": "ATC = AFC + AVC",
              "explanation": "At any output level, average total cost equals the vertical sum of average fixed and average variable costs."
            },
            {
              "process": "MC intersects AVC and ATC at minimum points",
              "explanation": "When MC < AVC, AVC is falling. When MC > AVC, AVC is rising. MC crosses AVC at AVC's minimum. Same relationship with ATC."
            },
            {
              "process": "AFC asymptotically approaches zero",
              "explanation": "As output increases without bound, AFC approaches zero but never reaches it. Thus ATC and AVC get closer together as output increases."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Marginal Cost Determines Optimal Output Level",
          "statement": "To maximize profit, a firm should produce up to the point where marginal cost equals marginal revenue (MC = MR).",
          "application": "If MR > MC, producing more adds to profit. If MR < MC, producing more reduces profit. Optimal output occurs where MR = MC.",
          "example": "A firm selling at \\$10 per unit calculates MC: 100th unit costs \\$8 to produce (MC = \\$8), 101st unit costs \\$9 (MC = \\$9), 102nd unit costs \\$11 (MC = \\$11). Since MR = \\$10 (constant price), produce 101 units (where MC ≤ MR) but not 102 (where MC > MR)."
        },
        {
          "principle": "Average Variable Cost Determines Short-Run Shutdown Point",
          "statement": "In the short run, a firm should shut down if price falls below minimum average variable cost.",
          "application": "If P < minimum AVC, the firm cannot cover even its variable costs and should cease production temporarily. Losses equal fixed costs if shut down, but would be larger if continuing.",
          "example": "Minimum AVC = \\$5. If market price is \\$4.50, each unit sold loses \\$0.50 on variable costs alone (plus fixed costs). Better to shut down, lose only FC, rather than lose FC plus \\$0.50 per unit."
        },
        {
          "principle": "Average Total Cost Determines Long-Run Viability",
          "statement": "In the long run, a firm must cover all costs (including normal profit) to remain in business. Price must be at least equal to ATC for long-run survival.",
          "application": "If P > ATC, firms earn economic profit and entry occurs. If P < ATC, firms suffer losses and exit occurs. Long-run equilibrium in competitive markets has P = minimum ATC.",
          "example": "If ATC = \\$8 per unit and price = \\$7, firm loses \\$1 per unit. In the long run, it will exit unless it can reduce costs. If price = \\$9, firm earns \\$1 profit per unit, attracting new entrants until price falls to \\$8."
        },
        {
          "principle": "Marginal Cost Curve Is the Firm's Supply Curve in Competitive Markets",
          "statement": "In perfectly competitive markets, the portion of the MC curve above minimum AVC represents the firm's short-run supply curve.",
          "application": "At any given price, a competitive firm supplies the quantity where P = MC (as long as P ≥ minimum AVC).",
          "example": "If MC curve shows: at Q=100, MC= \\$5; at Q=150, MC= \\$7; at Q=200, MC= \\$10. If price = \\$7, firm supplies 150 units (where P=MC). If price rises to \\$10, firm supplies 200 units."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating All Cost Measures from a Table",
          "problem": "Complete the following cost table for a firm:\n\n| Q | FC | VC | TC | MC | AFC | AVC | ATC |\n|---|----|----|----|----|-----|-----|-----|\n| 0 | 100| 0  |    |    |     |     |     |\n| 1 | 100| 50 |    |    |     |     |     |\n| 2 | 100| 90 |    |    |     |     |     |\n| 3 | 100| 140|    |    |     |     |     |\n| 4 | 100| 200|    |    |     |     |     |\n| 5 | 100| 270|    |    |     |     |     |\n\nCalculate all missing values.",
          "step_by_step": [
            {
              "step": "Calculate TC",
              "explanation": "TC = FC + VC. At Q=0: TC = 100 + 0 = 100. Q=1: TC = 100 + 50 = 150. Q=2: TC = 100 + 90 = 190. Q=3: TC = 100 + 140 = 240. Q=4: TC = 100 + 200 = 300. Q=5: TC = 100 + 270 = 370."
            },
            {
              "step": "Calculate MC",
              "explanation": "MC = ΔTC / ΔQ. From 0→1: MC = (150-100)/(1-0) = 50. 1→2: MC = (190-150)/(1) = 40. 2→3: MC = (240-190)/(1) = 50. 3→4: MC = (300-240)/(1) = 60. 4→5: MC = (370-300)/(1) = 70."
            },
            {
              "step": "Calculate AFC",
              "explanation": "AFC = FC / Q. At Q=1: AFC = 100/1 = 100. Q=2: AFC = 100/2 = 50. Q=3: AFC = 100/3 ≈ 33.33. Q=4: AFC = 100/4 = 25. Q=5: AFC = 100/5 = 20."
            },
            {
              "step": "Calculate AVC",
              "explanation": "AVC = VC / Q. At Q=1: AVC = 50/1 = 50. Q=2: AVC = 90/2 = 45. Q=3: AVC = 140/3 ≈ 46.67. Q=4: AVC = 200/4 = 50. Q=5: AVC = 270/5 = 54."
            },
            {
              "step": "Calculate ATC",
              "explanation": "ATC = TC / Q = AFC + AVC. At Q=1: ATC = 150/1 = 150 (or 100+50). Q=2: ATC = 190/2 = 95 (or 50+45). Q=3: ATC = 240/3 = 80 (or 33.33+46.67). Q=4: ATC = 300/4 = 75 (or 25+50). Q=5: ATC = 370/5 = 74 (or 20+54)."
            }
          ],
          "final_answer": "Completed table:\n\n| Q | FC | VC | TC | MC  | AFC    | AVC    | ATC    |\n|---|----|----|----|-----|--------|--------|--------|\n| 0 | 100| 0  | 100| -   | -      | -      | -      |\n| 1 | 100| 50 | 150| 50  | 100.00 | 50.00  | 150.00 |\n| 2 | 100| 90 | 190| 40  | 50.00  | 45.00  | 95.00  |\n| 3 | 100| 140| 240| 50  | 33.33  | 46.67  | 80.00  |\n| 4 | 100| 200| 300| 60  | 25.00  | 50.00  | 75.00  |\n| 5 | 100| 270| 370| 70  | 20.00  | 54.00  | 74.00  |\n\nNote: MC is between rows, AFC/AVC/ATC undefined at Q=0.",
          "concept_applied": "All cost measures are mathematically related. TC = FC + VC. MC = ΔTC/ΔQ = ΔVC/ΔQ. Averages are totals divided by quantity. MC intersects AVC and ATC at their minimums (here AVC minimum at Q=2, ATC minimum between Q=4 and Q=5)."
        },
        {
          "title": "Using Cost Calculations for Production Decisions",
          "problem": "Using the cost table from the previous example, suppose this firm operates in a competitive market where price = \\$60. Determine: (a) Profit-maximizing output level, (b) Should the firm produce or shut down in the short run? (c) Calculate profit or loss at optimal output.",
          "step_by_step": [
            {
              "step": "Apply MC = MR rule",
              "explanation": "In perfect competition, MR = P = \\$60. Find where MC = \\$60 or just below. From table: At Q=4, MC = \\$60 (exactly equals P). At Q=5, MC = \\$70 > P. Firm should produce Q=4 units."
            },
            {
              "step": "Check shutdown condition",
              "explanation": "Firm should produce if P ≥ minimum AVC. From table, minimum AVC = \\$45 at Q=2. P = \\$60 > \\$45, so firm should produce, not shut down."
            },
            {
              "step": "Calculate profit at Q=4",
              "explanation": "Total Revenue (TR) = P × Q = \\$60 × 4 = \\$240. Total Cost (TC) at Q=4 = \\$300 (from table). Profit = TR - TC = \\$240 - \\$300 = -\\$60 (loss of \\$60)."
            },
            {
              "step": "Interpret negative profit",
              "explanation": "Despite the loss, firm should continue producing in short run because: (1) P > AVC (\\$60 > \\$50 at Q=4), so it covers variable costs and contributes to fixed costs. (2) If shut down, loss = FC = \\$100. By producing, loss = only \\$60, which is better."
            },
            {
              "step": "Calculate contribution to fixed costs",
              "explanation": "At Q=4: VC = \\$200, so revenue covers all VC (\\$240 > \\$200) with \\$40 left to cover some FC. FC = \\$100, so \\$40 contribution reduces loss from \\$100 to \\$60."
            }
          ],
          "final_answer": "(a) Profit-maximizing output = 4 units (where MC = P = \\$60). (b) Yes, produce in short run because P = \\$60 > minimum AVC (\\$45). (c) At Q=4, profit = TR(\\$240) - TC(\\$300) = -\\$60 loss. Firm should continue producing because the loss (\\$60) is less than fixed costs (\\$100) would be if shut down.",
          "concept_applied": "Profit maximization requires producing where MR = MC (P = MC in perfect competition). Shutdown decision depends on price relative to AVC, not ATC. Even with losses, producing may be optimal if revenue covers variable costs and some contribution to fixed costs. This minimizes losses in the short run."
        }
      ],
      "image": {
        "src": "images/unit5/cost_calculations.png",
        "alt": "Graph showing MC, ATC, AVC, and AFC curves with relationships highlighted",
        "caption": "Cost curves relationships: MC intersects AVC and ATC at their minimum points; AFC declines continuously; ATC = AVC + AFC"
      }
    }
  ],
  "key_terms": [
    "Fixed costs (FC)",
    "Variable costs (VC)",
    "Total costs (TC)",
    "Average fixed cost (AFC)",
    "Average variable cost (AVC)",
    "Average total cost (ATC)",
    "Marginal cost (MC)",
    "Explicit costs",
    "Implicit costs",
    "Sunk costs",
    "Shutdown point",
    "Profit maximization"
  ],
  "summary": "Costs of production are categorized as fixed (unchanging with output in short run), variable (changing with output), or total (sum of fixed and variable). Fixed costs like rent must be paid regardless of production level, while variable costs like raw materials increase with output. Sunk costs (already incurred, unrecoverable) should be ignored in decision-making. Average costs (AFC, AVC, ATC) measure per-unit costs, with ATC = AFC + AVC. Marginal cost (MC) measures the cost of producing one more unit and is crucial for production decisions. The profit-maximizing output occurs where marginal revenue equals marginal cost (MR = MC). In the short run, firms should produce if price covers average variable cost (P ≥ AVC), even if they don't cover all fixed costs. All costs become variable in the long run, requiring price to cover average total cost for continued operation. Understanding these cost measures and their relationships enables firms to make optimal production decisions, determine shutdown points, and maximize profits in different market conditions."
}
