{
  "expanded_description": "Why do firms exist? What are they trying to achieve? If you ask most people, they'll say \"to make money\" - and they're mostly right. But the full story is more interesting. Firms face complex decisions about how much to produce, what price to charge, and whether to stay in business. The answers depend on their goals (usually profit maximization) and the revenue they can generate from selling their products. This section connects the cost concepts we've studied with the revenue side of the equation. Understanding firm goals and revenue helps explain why companies raise or lower prices, why some businesses shut down while others keep operating at a loss, and why your favorite store might stay open even when it's empty. It's the final piece of the puzzle in understanding how firms make decisions.",
  
  "core_concept": {
    "principle": "Firms make decisions to achieve their goals, typically maximizing profit (the difference between total revenue and total cost). Revenue depends on how much firms sell and at what price, which varies with market structure. The profit-maximizing output occurs where marginal revenue equals marginal cost.",
    "explanation": "Think of a lemonade stand. You have costs (lemons, sugar, cups) and you have revenue (money from customers). Your profit is what's left after paying costs. To maximize profit, you need to decide how many cups to make. Make too few, and you miss out on potential sales. Make too many, and you're stuck with unsold lemonade (wasted costs). The sweet spot is where the revenue from one more cup just equals the cost of making it. This simple logic applies to everything from a hot dog cart to Apple Inc. But the math changes depending on whether you're a tiny player in a big market (like a wheat farmer who can't set prices) or a dominant firm (like a local cable company that can). This section explores these differences and what they mean for business decisions.",
    "image": {
      "src": "images/unit5/firm_goals_intro.png",
      "alt": "Diagram showing revenue minus cost equals profit, with a firm deciding on output level",
      "caption": "Profit = Total Revenue - Total Cost. Firms choose output to maximize this difference."
    }
  },

  "sections": [
    {
      "section_title": "5.10 Firm Goals and Revenue",
      "introduction": "Imagine you're running a small coffee shop. You wake up every morning and make decisions: how many pastries to bake, whether to stay open later, when to raise prices. What guides these choices? Probably, you want your business to be successful - to make money. But what does \"make money\" really mean? And how do you know if you're making the right decisions? This section explores what firms are trying to achieve and how revenue (money coming in) interacts with costs (money going out) to determine the best choices. Whether you're running a lemonade stand or dreaming of starting the next big tech company, these principles apply.",
      
      "key_concept": {
        "definition": "Firm goals are the objectives that guide business decisions. While economists typically assume firms aim to maximize profit (total revenue minus total cost), real-world firms may pursue other goals like growth, market share, or social responsibility. Revenue is the money firms receive from selling their output, calculated as price times quantity sold. The relationship between revenue and output depends on market structure - whether firms can influence prices or must take them as given.",
        "context": "For most of economics, we assume profit maximization because it's a powerful predictor of firm behavior. But it's important to understand this is a simplification. A family business might accept lower profits to keep employees employed during hard times. A tech startup might prioritize user growth over profits for years. A socially conscious company might pay higher wages than necessary. Still, the profit-maximization model helps us understand the basic logic of business decisions. The revenue side of the equation connects to market structure: perfectly competitive firms face a horizontal demand curve (they can sell any amount at the market price), while firms with market power face downward-sloping demand (they must lower prices to sell more). These differences fundamentally change how firms make decisions."
      },

      "categories": [
        {
          "type": "Profit Maximization",
          "description": "The assumption that firms make decisions to make as much money as possible - the difference between what they earn (revenue) and what they spend (costs).",
          "examples": [
            {
              "process": "The basic formula",
              "explanation": "Profit (π) = Total Revenue (TR) - Total Cost (TC). Total Revenue = Price (P) × Quantity (Q). Total Cost includes both explicit costs (money paid out) and implicit costs (opportunity costs of resources). When this difference is positive, the firm earns economic profit. When it's zero, the firm earns normal profit (covering all costs including opportunity costs). When negative, the firm suffers losses."
            },
            {
              "process": "The profit-maximization rule: MR = MC",
              "explanation": "The key insight: firms maximize profit by producing where marginal revenue (MR) equals marginal cost (MC). Why? If MR > MC, producing one more unit adds more to revenue than to cost, so profit increases - produce more. If MR < MC, the last unit cost more to make than it earned - produce less. Only when MR = MC can't profit increase by changing output. This rule works for all firms, regardless of market structure."
            },
            {
              "process": "Economic profit vs. accounting profit",
              "explanation": "**Important distinction:** Accounting profit is total revenue minus explicit costs (what you actually pay out). Economic profit subtracts both explicit and implicit costs (including what you could have earned doing something else). If you leave a \\$70,000/year job to start a business that earns \\$80,000 in accounting profit, your economic profit is only \\$10,000 (\\$80,000 - \\$70,000 opportunity cost). Zero economic profit means you're earning exactly what you could elsewhere - it's still a viable business, just not earning \"extra.\" **Advanced note:** This is why economists say firms earn \"normal profit\" when economic profit is zero - they're covering all costs including opportunity costs."
            }
          ]
        },
        {
          "type": "Revenue Concepts",
          "description": "Different ways of measuring the money coming into a firm from sales - essential for understanding profit and decision-making.",
          "examples": [
            {
              "process": "Total Revenue (TR)",
              "explanation": "The simplest concept: total money coming in from sales. TR = Price × Quantity. If you sell 100 cups of lemonade at \\$2 each, total revenue = \\$200. TR increases as you sell more, but the pattern depends on whether price stays constant or changes with quantity."
            },
            {
              "process": "Average Revenue (AR)",
              "explanation": "Revenue per unit sold. AR = TR ÷ Q. Here's a key insight: Average revenue always equals the price! If you sold \\$200 from 100 units, AR = \\$2, which is exactly the price. This is true for any firm: AR = P. So the demand curve facing a firm is also its average revenue curve."
            },
            {
              "process": "Marginal Revenue (MR)",
              "explanation": "The additional revenue from selling ONE MORE unit. MR = Change in TR ÷ Change in Q. This is the critical concept for decision-making because firms decide at the margin - should we produce one more? MR tells you what you'd gain. **Crucial point:** MR behaves differently depending on market structure. In perfect competition, MR = P (constant). In imperfect competition, MR < P and falls as output increases because to sell more, you must lower price on all units."
            },
            {
              "process": "Example: MR in action",
              "explanation": "Suppose a bakery sells cookies for \\$2 each, and can sell any number at that price. Selling the 100th cookie adds \\$2 to revenue: MR = \\$2. Now suppose a different bakery faces downward-sloping demand: to sell 100 cookies, price must be \\$2; to sell 101, price must be \\$1.99. Revenue at 100 cookies = \\$200. Revenue at 101 cookies = 101 × \\$1.99 = \\$200.99. The marginal revenue of the 101st cookie is only \\$0.99 - less than the price! This happens because to sell one more, they had to lower the price on all 101 cookies slightly."
            }
          ]
        },
        {
          "type": "Alternative Firm Goals",
          "description": "Real-world firms sometimes pursue objectives other than pure profit maximization - understanding these helps explain behaviors that don't fit the simple model.",
          "examples": [
            {
              "process": "Revenue (Sales) Maximization",
              "explanation": "Some firms, especially those run by professional managers rather than owners, may try to maximize total revenue or sales. Why? Manager salaries and prestige often correlate with company size, not profitability. A manager might pursue growth even at the expense of profits. **Real example:** In the 1960s-70s, many large corporations pursued growth through acquisitions, building massive empires that actually destroyed shareholder value. This behavior is sometimes called \"empire building.\""
            },
            {
              "process": "Satisficing",
              "explanation": "Nobel laureate Herbert Simon argued that managers don't have perfect information or unlimited ability to process it. Instead of maximizing, they \"satisfice\" - they aim for a satisfactory level of profit rather than the theoretical maximum. They set targets and once achieved, they don't keep searching for better options. This is more realistic given real-world complexity and uncertainty. **Example:** A family business might aim for steady \\$100,000 profit, and when they hit it, they relax rather than constantly tweaking operations to squeeze out every last dollar."
            },
            {
              "process": "Market Share Goals",
              "explanation": "Many firms prioritize capturing market share (percentage of industry sales) over short-term profits. They believe that dominating the market now will lead to profits later through brand loyalty, network effects, or the ability to raise prices once competition is weakened. **Real example:** Amazon operated at a loss for years, prioritizing growth and market share over profits. They reinvested everything into expansion, betting that eventual dominance would pay off (and it did)."
            },
            {
              "process": "Corporate Social Responsibility (CSR)",
              "explanation": "Some firms explicitly sacrifice profits to pursue social or environmental goals. This might mean paying higher wages than necessary, using more expensive but eco-friendly materials, or donating to community causes. While this reduces short-term profits, it can build brand loyalty, attract customers who share values, and improve employee morale. **Example:** Patagonia, the outdoor clothing company, donates 1% of sales to environmental causes, encourages repair over replacement, and once ran an ad saying \"Don't Buy This Jacket\" to discourage overconsumption. These actions reduce profits but align with their mission and resonate with their customer base."
            },
            {
              "process": "Growth Maximization",
              "explanation": "Some firms prioritize growth above all else - getting bigger, entering new markets, acquiring competitors. This can be driven by ego (CEOs want to lead bigger companies), competitive pressure (grow or get eaten), or strategic thinking (size creates advantages). **Advanced note:** Economist Robin Marris developed theories of managerial capitalism where managers pursue growth because their compensation and security correlate with firm size, not just profitability."
            }
          ]
        },
        {
          "type": "Shutdown and Exit Decisions",
          "description": "Sometimes firms lose money. When should they keep operating, and when should they shut down? The answer differs in the short run vs. long run.",
          "examples": [
            {
              "process": "Short-run shutdown rule: Compare price to AVC",
              "explanation": "In the short run, firms have fixed costs they must pay regardless (rent, equipment leases). Even if they're losing money, they should keep operating if price covers average variable cost (AVC). Why? Because revenue above variable costs contributes to covering fixed costs. If price is below AVC, every unit sold actually increases losses - better to shut down immediately. **Rule:** Shut down if P < minimum AVC. Continue operating if P ≥ minimum AVC, even if P < ATC (meaning overall losses)."
            },
            {
              "process": "Example of short-run shutdown",
              "explanation": "A struggling theater pays \\$5,000/month rent (fixed) and \\$3,000/month for utilities and staff (variable). If they close, they still owe rent. If they stay open and sell tickets, they might cover variable costs plus contribute something toward rent. But if ticket sales only bring in \\$2,000/month (below \\$3,000 variable costs), each month they operate increases losses - they should shut down immediately."
            },
            {
              "process": "Long-run exit rule: Compare price to ATC",
              "explanation": "In the long run, all costs are variable - firms can exit entirely, selling equipment and ending leases. They should exit if price is below average total cost (ATC) because they can't cover all costs including normal profit. If P < ATC, they're making economic losses and should leave the industry. If P ≥ ATC, they're at least breaking even (including opportunity costs) and can stay."
            },
            {
              "process": "The relationship between shutdown and exit",
              "explanation": "A firm might: 1) Operate profitably (P > ATC) - happy case. 2) Operate at a loss but stay open in short run (AVC < P < ATC) - covering variable costs but not all fixed costs, hoping conditions improve. 3) Shut down temporarily (P < AVC) - stop producing but still exist (pay fixed costs). 4) Exit permanently (P < ATC in long run) - sell everything and leave the industry."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Profit Maximization Occurs Where MR = MC",
          "statement": "Regardless of market structure, firms maximize profit by producing the quantity where marginal revenue equals marginal cost. At this point, no change in output can increase profit.",
          "application": "This rule gives firms a clear decision framework. They estimate the additional revenue from one more unit (MR) and compare it to the additional cost (MC). If MR > MC, expand. If MR < MC, contract. Only at MR = MC is profit maximized. Managers use this logic constantly, though they may estimate rather than calculate precisely.",
          "example": "Consider a smartphone manufacturer. Producing the 1 millionth phone adds \\$800 to revenue (MR) and \\$750 to cost (MC) - profit increases by \\$50, so produce it. The 1.1 millionth phone has MR = \\$780 (price had to drop slightly to sell more) and MC = \\$780 - exactly equal. That's optimal. The 1.2 millionth phone would have MR = \\$760 and MC = \\$795 - it would reduce profit, so don't produce it."
        },
        {
          "principle": "Market Structure Determines Revenue Curves",
          "statement": "A firm's revenue curves depend on whether it can influence price. Perfectly competitive firms face horizontal demand (perfectly elastic) with MR = P constant. Firms with market power face downward-sloping demand with MR < P and falling as output increases.",
          "application": "This means the profit-maximization rule applies differently. A competitive firm simply produces where P = MC. A monopoly or monopolistic competitor must find where MR = MC, then set price based on demand at that quantity. This difference explains why competitive markets are efficient while monopolies restrict output to raise prices.",
          "example": "**Competitive firm (corn farmer):** Market price = \\$5/bushel. MR always \\$5. Farmer produces where MC = \\$5. Simple. **Monopoly (local cable company):** Faces demand: P = 100 - 2Q. TR = 100Q - 2Q². MR = 100 - 4Q (derivative, or note MR slope twice as steep). If MC = \\$20, set MR = MC: 100 - 4Q = 20 → 4Q = 80 → Q = 20. Then price from demand: P = 100 - 2(20) = \\$60. Notice price (\\$60) > MC (\\$20) - monopoly markup."
        },
        {
          "principle": "Economic Profit Includes Opportunity Cost",
          "statement": "Economic profit differs from accounting profit by including implicit costs - the value of resources in their next best use. Zero economic profit means the firm is earning exactly what its resources could earn elsewhere (normal profit).",
          "application": "This distinction explains why firms stay in business even when accounting profits seem low. A small business earning \\$50,000 accounting profit might be doing poorly if the owner could earn \\$60,000 working for someone else (negative \\$10,000 economic profit - they should exit). Conversely, a firm earning zero economic profit is doing exactly as well as alternatives - perfectly sustainable.",
          "example": "Maria runs a catering business. Her accounting: Revenue \\$150,000, explicit costs (food, equipment, helpers) \\$100,000 → accounting profit \\$50,000. But Maria quit a \\$45,000 job to do this, and she could rent her commercial kitchen for \\$15,000/year. Implicit costs = \\$45,000 + \\$15,000 = \\$60,000. Economic profit = \\$50,000 - \\$60,000 = -\\$10,000. Despite positive accounting profit, Maria is economically losing \\$10,000 compared to her alternatives. She should consider exiting and working for someone else while renting out the kitchen."
        },
        {
          "principle": "The Shutdown Point Is Where Price Equals Minimum AVC",
          "statement": "A firm's short-run supply curve is the portion of its marginal cost curve above minimum average variable cost. Below that price, the firm shuts down immediately because producing would increase losses.",
          "application": "This creates the industry supply curve in competitive markets. At prices below minimum AVC, firms produce nothing. As price rises above minimum AVC, firms enter production and supply along their MC curves. This explains why supply curves slope upward - higher prices bring more firms into production and encourage existing firms to produce more.",
          "example": "A food truck has fixed costs (truck payment, insurance) of \\$1,000/month and variable costs (food, fuel, hourly worker) averaging \\$5 per meal. Minimum AVC = \\$5. If the market price falls to \\$4.50 per meal (below AVC), every meal sold loses additional money beyond fixed costs - better to park the truck and sell nothing. The truck's supply curve starts at P = \\$5, with quantity supplied increasing along MC above that price."
        }
      ],

      "worked_examples": [
        {
          "title": "Finding Profit-Maximizing Output for a Competitive Firm",
          "problem": "Sunny Farms grows wheat in a perfectly competitive market. The market price is \\$6 per bushel. Sunny's cost structure is: Fixed costs = \\$200. Variable costs: 100 bushels = \\$300, 200 bushels = \\$550, 300 bushels = \\$750, 400 bushels = \\$1,000, 500 bushels = \\$1,350. Calculate total revenue, total cost, and profit at each output level. Find the profit-maximizing output. Also identify the shutdown price and determine if Sunny should operate at this price.",
          "step_by_step": [
            {
              "step": "Calculate Total Revenue at each output",
              "explanation": "TR = P × Q. P = \\$6. At Q=100: \\$6 × 100 = \\$600. Q=200: \\$6 × 200 = \\$1,200. Q=300: \\$6 × 300 = \\$1,800. Q=400: \\$6 × 400 = \\$2,400. Q=500: \\$6 × 500 = \\$3,000."
            },
            {
              "step": "Calculate Total Cost at each output",
              "explanation": "TC = Fixed + Variable. Fixed = \\$200. At Q=100: TC = \\$200 + \\$300 = \\$500. Q=200: \\$200 + \\$550 = \\$750. Q=300: \\$200 + \\$750 = \\$950. Q=400: \\$200 + \\$1,000 = \\$1,200. Q=500: \\$200 + \\$1,350 = \\$1,550."
            },
            {
              "step": "Calculate Profit at each output",
              "explanation": "Profit = TR - TC. Q=100: \\$600 - \\$500 = \\$100 profit. Q=200: \\$1,200 - \\$750 = \\$450 profit. Q=300: \\$1,800 - \\$950 = \\$850 profit. Q=400: \\$2,400 - \\$1,200 = \\$1,200 profit. Q=500: \\$3,000 - \\$1,550 = \\$1,450 profit."
            },
            {
              "step": "Identify profit-maximizing output",
              "explanation": "Profit increases at every level shown, reaching \\$1,450 at Q=500. But is 500 the maximum? We don't have data beyond 500, but since profit is still rising at 500, the maximum might be beyond. To truly maximize, we'd need MR = MC. Let's estimate MC: Between 400-500, ΔTC = \\$1,550 - \\$1,200 = \\$350, ΔQ = 100, so MC ≈ \\$3.50. MR = \\$6. Since MR > MC, produce more. The optimum is where MC rises to \\$6. Based on trend, that might be around 600-700 bushels."
            },
            {
              "step": "Calculate AVC to find shutdown price",
              "explanation": "AVC = Variable Cost ÷ Q. At Q=100: \\$300 ÷ 100 = \\$3. Q=200: \\$550 ÷ 200 = \\$2.75. Q=300: \\$750 ÷ 300 = \\$2.50. Q=400: \\$1,000 ÷ 400 = \\$2.50. Q=500: \\$1,350 ÷ 500 = \\$2.70. Minimum AVC appears to be \\$2.50 (at Q=300-400). Shutdown price = minimum AVC = \\$2.50."
            },
            {
              "step": "Determine if Sunny should operate at P=\\$6",
              "explanation": "Since P=\\$6 > minimum AVC=\\$2.50, Sunny should definitely operate in short run. They're also covering all costs including fixed (ATC at Q=500 = \\$1,550÷500=\\$3.10, so P>\\$3.10 means economic profit). They should continue operating and actually expand output until MC rises to \\$6."
            }
          ],
          "final_answer": "At P=\\$6, profits increase across all given output levels, reaching \\$1,450 at 500 bushels. However, since MR (\\$6) > estimated MC (\\$3.50 at 400-500), the firm should expand beyond 500 until MC rises to \\$6. The shutdown price is \\$2.50 (minimum AVC). At P=\\$6, Sunny should definitely operate and expand production.",
          "concept_applied": "Competitive firms maximize profit where P = MC. They shut down if P < minimum AVC. Here, P > min AVC and P > MC at current levels, indicating expansion is profitable."
        },
        {
          "title": "Profit Maximization for a Firm with Market Power",
          "problem": "A local cable company faces demand: P = 120 - 0.5Q, where Q is thousands of subscribers. Its marginal cost is constant at \\$20 per subscriber. Fixed costs are \\$2,000 (in thousands, so \\$2 million). Find the profit-maximizing quantity, price, and profit. Compare this to the outcome if the company acted like a competitive firm (setting P = MC).",
          "step_by_step": [
            {
              "step": "Find the Marginal Revenue curve",
              "explanation": "For linear demand P = a - bQ, MR = a - 2bQ. Here, P = 120 - 0.5Q, so a=120, b=0.5. MR = 120 - 2(0.5)Q = 120 - Q. (Note: MR has same intercept, twice the slope of demand.)"
            },
            {
              "step": "Set MR = MC to find optimal quantity",
              "explanation": "MR = 120 - Q, MC = 20. Set equal: 120 - Q = 20 → Q = 100 (thousand subscribers)."
            },
            {
              "step": "Find price from demand curve",
              "explanation": "P = 120 - 0.5(100) = 120 - 50 = \\$70 per subscriber."
            },
            {
              "step": "Calculate total revenue",
              "explanation": "TR = P × Q = \\$70 × 100,000 = \\$7,000,000 (or 7,000 in thousands)."
            },
            {
              "step": "Calculate total cost",
              "explanation": "TC = Fixed + Variable. Fixed = \\$2,000 (thousand) = \\$2,000,000. Variable cost = MC × Q = \\$20 × 100,000 = \\$2,000,000. Total TC = \\$2,000,000 + \\$2,000,000 = \\$4,000,000."
            },
            {
              "step": "Calculate profit",
              "explanation": "Profit = TR - TC = \\$7,000,000 - \\$4,000,000 = \\$3,000,000."
            },
            {
              "step": "Compare to competitive outcome (P = MC)",
              "explanation": "If competitive, set P = MC = \\$20. From demand: \\$20 = 120 - 0.5Q → 0.5Q = 100 → Q = 200,000 subscribers. Competitive quantity is double the monopoly quantity! Competitive TR = \\$20 × 200,000 = \\$4,000,000. Competitive TC = Fixed \\$2,000,000 + Variable (\\$20 × 200,000 = \\$4,000,000) = \\$6,000,000. Competitive profit = \\$4,000,000 - \\$6,000,000 = -\\$2,000,000 (loss!). Wait - this suggests the firm would lose money at competitive price. Let's check: At Q=200,000, ATC = TC/Q = \\$6,000,000 ÷ 200,000 = \\$30. P=\\$20 < ATC=\\$30, so indeed losses. The firm would not survive in long run under competition without subsidies."
            },
            {
              "step": "Interpret the comparison",
              "explanation": "The monopoly produces less (100,000 vs 200,000) at higher price (\\$70 vs \\$20) but earns profit (\\$3M vs -\\$2M). This illustrates the monopoly trade-off: restrict output to raise price and earn profits, but society gets less service at higher price. The competitive outcome would be better for consumers (lower price, more service) but the firm couldn't survive - suggesting this might be a natural monopoly where one firm can serve market at lower cost than multiple firms."
            }
          ],
          "final_answer": "Profit-maximizing quantity: 100,000 subscribers. Price: \\$70. Profit: \\$3,000,000. If forced to set P = MC (\\$20), quantity would be 200,000 subscribers but the firm would lose \\$2,000,000. This shows how firms with market power restrict output to raise price and earn profits, unlike competitive firms.",
          "concept_applied": "Firms with market power maximize profit where MR = MC, producing less and charging more than competitive firms. This can lead to higher profits but also to outcomes where firms might not survive under pure competition."
        },
        {
          "title": "Shutdown vs. Exit Decision",
          "problem": "A small gym pays \\$5,000/month rent (fixed) and has variable costs (utilities, staff, equipment maintenance) of \\$3,000/month when operating. Currently, the gym brings in \\$7,000/month in revenue from memberships. The owner could sell the equipment for \\$10,000 and sublease the space, eliminating all costs. Meanwhile, the owner's friend offers her a job paying \\$4,000/month. Calculate accounting profit and economic profit. Should the gym continue operating in the short run? Should the owner exit in the long run?",
          "step_by_step": [
            {
              "step": "Identify explicit costs",
              "explanation": "Explicit costs are actual money paid out: Rent \\$5,000 + Variable \\$3,000 = \\$8,000 per month."
            },
            {
              "step": "Calculate accounting profit",
              "explanation": "Accounting profit = Revenue - Explicit costs = \\$7,000 - \\$8,000 = -\\$1,000 per month (accounting loss)."
            },
            {
              "step": "Identify implicit costs",
              "explanation": "Implicit costs are opportunity costs: The owner's foregone salary of \\$4,000/month from the job offer. Also, the equipment could be sold for \\$10,000, but that's a one-time gain, not monthly flow. The sublease income would eliminate rent, but that's already counted if we exit - we'll handle that in exit decision."
            },
            {
              "step": "Calculate economic profit",
              "explanation": "Economic profit = Revenue - (Explicit + Implicit costs) = \\$7,000 - (\\$8,000 + \\$4,000) = \\$7,000 - \\$12,000 = -\\$5,000 per month economic loss."
            },
            {
              "step": "Short-run shutdown decision (compare revenue to variable costs)",
              "explanation": "In short run, fixed costs (\\$5,000 rent) must be paid regardless. Shut down if revenue < variable costs. Variable costs = \\$3,000. Revenue = \\$7,000 > \\$3,000, so continue operating in short run. Even though losing \\$1,000 accounting profit, shutting down would mean \\$0 revenue but still \\$5,000 rent to pay - loss of \\$5,000. Operating reduces loss from \\$5,000 to \\$1,000 (because \\$7,000 revenue covers \\$3,000 variable costs and contributes \\$4,000 toward rent)."
            },
            {
              "step": "Long-run exit decision",
              "explanation": "In long run, all costs are avoidable by exiting. Compare options: Continue operating: economic loss \\$5,000/month. Exit: Sell equipment (\\$10,000 one-time), sublease space (eliminates rent), owner takes job (\\$4,000/month). The \\$10,000 equipment sale is a one-time gain, equivalent to about \\$833/month if spread over a year (but careful with one-time vs. flows). Let's calculate annual comparison: Continue: lose \\$5,000 × 12 = \\$60,000. Exit: Job income \\$4,000 × 12 = \\$48,000 positive + \\$10,000 equipment = \\$58,000 positive. So exit yields +\\$58,000 vs continue yields -\\$60,000 - a \\$118,000 swing! Clearly exit."
            }
          ],
          "final_answer": "Accounting profit: -\\$1,000/month. Economic profit: -\\$5,000/month. Short run: Continue operating because revenue (\\$7,000) > variable costs (\\$3,000), reducing losses from \\$5,000 to \\$1,000 monthly. Long run: Exit, because the owner can earn \\$48,000/year at the job plus \\$10,000 from equipment sale, vs. losing \\$60,000/year by continuing. The gym should keep operating temporarily while planning to exit.",
          "concept_applied": "Short-run shutdown decisions depend on covering variable costs. Long-run exit decisions compare all alternatives including opportunity costs. A firm can operate at accounting loss in short run but must eventually cover all costs including opportunity costs to survive long run."
        }
      ],

      "image": {
        "src": "images/unit5/profit_maximization_graph.png",
        "alt": "Graph showing MC, ATC, AVC, and demand/MR curves with profit-maximizing output at MR=MC and profit area shaded",
        "caption": "Profit maximization occurs where MR = MC. The vertical distance between price and ATC at that quantity determines per-unit profit."
      }
    }
  ],

  "key_terms": [
    "Profit maximization",
    "Total revenue (TR)",
    "Average revenue (AR)",
    "Marginal revenue (MR)",
    "MR = MC rule",
    "Economic profit",
    "Accounting profit",
    "Normal profit",
    "Explicit costs",
    "Implicit costs",
    "Opportunity cost",
    "Shutdown point",
    "Exit decision",
    "Satisficing",
    "Revenue maximization",
    "Market share",
    "Corporate social responsibility",
    "Perfect competition",
    "Market power"
  ],

  "summary": "Firm goals and revenue complete the picture of business decision-making by adding the revenue side to our cost analysis. While economists typically assume firms maximize profit (total revenue minus total cost), real-world firms may pursue alternative objectives like revenue maximization, market share growth, satisficing (aiming for satisfactory rather than maximum profits), or corporate social responsibility. Profit maximization follows a clear rule: produce where marginal revenue equals marginal cost (MR = MC). This rule applies universally, but its implementation depends on market structure. Perfectly competitive firms face horizontal demand with MR = constant price, so they simply produce where P = MC. Firms with market power face downward-sloping demand, making MR less than price and falling with output - they produce where MR = MC, then set price based on demand at that quantity. Revenue concepts include total revenue (P × Q), average revenue (always equal to price), and marginal revenue (additional revenue from one more unit). A crucial distinction exists between accounting profit (revenue minus explicit costs) and economic profit (revenue minus both explicit and implicit opportunity costs). Zero economic profit means normal profit - the firm earns exactly what its resources could earn elsewhere. Firms also face shutdown and exit decisions: in the short run, they should continue operating if price covers average variable cost (P ≥ AVC), even if incurring losses, because revenue contributes to fixed costs. In the long run, they should exit if price is below average total cost (P < ATC), meaning they cannot cover all costs including normal profit. These principles explain a wide range of business behaviors, from why companies raise or lower prices to why some businesses operate at temporary losses and why markets with different structures produce different outcomes. Understanding firm goals and revenue completes the toolkit for analyzing how businesses make decisions in any market environment."
}
