{
  "expanded_description": "The distinction between short run and long run is fundamental to understanding production decisions. While in the short run firms face fixed constraints that limit their flexibility, the long run offers complete freedom to adjust all inputs. This time-based framework explains why firms make different decisions under different time horizons and how they plan for future growth or contraction. The crucial insight is that 'short run' and 'long run' are not defined by calendar time but by the flexibility to adjust production inputs.",
  "core_concept": {
    "principle": "The short run is a period during which at least one factor of production (usually capital or land) is fixed in quantity. The long run is a period long enough that all factors of production can be varied. No specific calendar time defines these periods—they vary by industry based on how quickly inputs can be adjusted.",
    "explanation": "This distinction matters because it fundamentally changes what decisions firms can make. In the short run, firms are constrained by their existing capital stock (factory size, machinery, leases). They can only adjust variable inputs like labor, raw materials, and energy. This creates the 'law of diminishing marginal returns'—as more variable input is added to fixed inputs, eventually each additional unit adds less output. In the long run, all constraints are removed. Firms can choose optimal scales and input combinations, leading to concepts like returns to scale and economies of scale. The short run is about operating within constraints; the long run is about choosing and changing those constraints. Understanding this difference explains why firms might operate at a loss in the short run (if they can cover variable costs) but not in the long run, and why industry supply is more elastic in the long run than the short run.",
    "image": {
      "src": "images/unit5/short_long_run_contrast.png",
      "alt": "Two side-by-side illustrations: left shows factory with fixed building but variable workers (short run), right shows multiple factory size options (long run)",
      "caption": "Short run: adjusting variable inputs within fixed constraints. Long run: choosing optimal scale and all input combinations."
    }
  },
  "sections": [
    {
      "section_title": "Defining Time Horizons in Production",
      "introduction": "Before analyzing production decisions, we must precisely define what constitutes short run versus long run and understand why this distinction varies across industries.",
      "key_concept": {
        "definition": "The short run/long run classification depends on input adjustability, not calendar time. The key question is: Can the firm change its capital stock (factory, major equipment, leases)? If no: short run. If yes: long run.",
        "context": "Different industries have different adjustment speeds. A software company might expand capacity in months (new servers, office space). An automobile manufacturer might need years to build a new factory. An electric utility might need a decade to plan and build a new power plant. Thus, 'long run' is shorter for some industries than others."
      },
      "categories": [
        {
          "type": "Short Run Characteristics",
          "description": "Features that define the short run production period.",
          "examples": [
            {
              "process": "Fixed factors exist",
              "explanation": "At least one input cannot be changed in quantity. Usually capital (factory, machinery) or land/lease commitments."
            },
            {
              "process": "Adjustment limited to variable inputs",
              "explanation": "Firm can change labor hours, raw material usage, energy consumption, but not the basic production facility."
            },
            {
              "process": "Sunk costs matter",
              "explanation": "Costs of fixed inputs are sunk—already incurred and unavoidable—so they don't affect current production decisions (except through opportunity costs)."
            },
            {
              "process": "Example timeline",
              "explanation": "For a restaurant: 1-6 months (can change staff, menu, hours, but not location or kitchen size)."
            }
          ]
        },
        {
          "type": "Long Run Characteristics",
          "description": "Features that define the long run production period.",
          "examples": [
            {
              "process": "All factors variable",
              "explanation": "No fixed inputs—firm can choose any combination of labor, capital, land, technology."
            },
            {
              "process": "Complete planning flexibility",
              "explanation": "Firm can choose optimal scale, technology, location, organizational structure."
            },
            {
              "process": "No sunk costs (in planning)",
              "explanation": "When making long run decisions, all costs are avoidable—the firm can choose not to incur them by not entering/expanding."
            },
            {
              "process": "Example timeline",
              "explanation": "For a restaurant: 1-3 years (could relocate, remodel completely, change concept). For an airline: 5-10 years (could buy new aircraft types, enter new markets)."
            }
          ]
        },
        {
          "type": "Very Short Run (Market Period)",
          "description": "An even shorter period where no inputs can be changed—output itself is fixed.",
          "examples": [
            {
              "process": "All inputs fixed",
              "explanation": "Output cannot be adjusted—what's produced is already produced. Common for agricultural products between harvests."
            },
            {
              "process": "Price adjusts to clear market",
              "explanation": "With fixed supply, price fluctuates to match demand to available output."
            },
            {
              "process": "Example",
              "explanation": "Day of a concert: seats are fixed, price might change at box office. After harvest: wheat supply fixed until next harvest."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "The Short Run Is a Constrained Optimization Problem",
          "statement": "In short run, firms maximize output or minimize cost subject to fixed capital constraint. They make the best of their current situation.",
          "application": "Given factory size, choose optimal labor and materials. Cannot choose different factory size.",
          "example": "Restaurant with 20 tables: Optimize by scheduling right number of staff, menu selection, operating hours. Cannot instantly add more tables (short run constraint)."
        },
        {
          "principle": "The Long Run Is an Unconstrained Planning Problem",
          "statement": "In long run, firms choose optimal scale and input combinations without constraints (except technology and prices).",
          "application": "Decide whether to expand, contract, change technology, or exit industry entirely.",
          "example": "Restaurant owner considers: Should I expand current location? Open second location? Switch to different cuisine requiring different kitchen? These are long run decisions."
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Time Horizons by Industry",
          "problem": "For each industry, estimate typical short run and long run periods. Explain your reasoning: (a) Software-as-a-Service company, (b) Automobile manufacturer, (c) Wheat farm, (d) Electric utility.",
          "step_by_step": [
            {
              "step": "Software company analysis",
              "explanation": "Capital: servers, office space. Short run: Can add cloud servers in hours/days, hire developers in weeks. Long run: Build proprietary infrastructure, develop new platform—6 months to 2 years."
            },
            {
              "step": "Automobile manufacturer analysis",
              "explanation": "Capital: factories, assembly lines. Short run: Adjust shifts, overtime, materials—weeks to months. Long run: Build new factory, redesign production line—3 to 5 years."
            },
            {
              "step": "Wheat farm analysis",
              "explanation": "Capital: land, equipment. Short run: Within growing season—choose seed, fertilizer, labor. Long run: Buy/sell land, change equipment—multiple years (land transactions slow)."
            },
            {
              "step": "Electric utility analysis",
              "explanation": "Capital: power plants, grid. Short run: Adjust which plants run, maintenance schedules—days to months. Long run: Build new power plant, major grid upgrades—5 to 15 years (permitting, construction)."
            }
          ],
          "final_answer": "(a) Software: Short run = days/weeks, Long run = 6-24 months. (b) Auto: Short run = weeks/months, Long run = 3-5 years. (c) Farm: Short run = growing season, Long run = 2-5 years. (d) Utility: Short run = days/months, Long run = 5-15 years. Key insight: Long run length depends on capital adjustment time—heavy physical capital industries have longer long runs.",
          "concept_applied": "The definition of short run vs long run is economic, not calendar-based. It depends on how quickly capital can be adjusted. Industries with flexible capital (software, services) have short long runs. Industries with large, fixed capital (manufacturing, utilities) have long long runs."
        }
      ],
      "image": {
        "src": "images/unit5/time_horizons_industry.png",
        "alt": "Bar chart showing different long run lengths for different industries from software (shortest) to utilities (longest)",
        "caption": "Long run length varies by industry: software (months), manufacturing (years), utilities (decades)"
      }
    },
    {
      "section_title": "Production in the Short Run: One Variable Input",
      "introduction": "The simplest short run analysis considers production with one variable input (labor) and one fixed input (capital). This reveals fundamental patterns of productivity.",
      "key_concept": {
        "definition": "In the short run with capital fixed, output depends only on the variable input (labor): $Q = f(L, \\overline{K})$. As labor increases, output increases but eventually at a decreasing rate due to the law of diminishing marginal returns.",
        "context": "This scenario is common: a factory of fixed size hires more workers. Initially, adding workers increases output significantly as specialization becomes possible. But eventually, with fixed capital, workers get in each other's way, equipment becomes congested, and additional workers add less and less output."
      },
      "categories": [
        {
          "type": "Total Product Curve (Short Run)",
          "description": "Shows how total output changes as variable input increases, holding capital fixed.",
          "examples": [
            {
              "process": "Shape characteristics",
              "explanation": "Initially increases at an increasing rate (convex), then increases at a decreasing rate (concave), eventually may flatten or decline."
            },
            {
              "process": "Three phases",
              "explanation": "Phase I: Increasing marginal returns (TP curve convex). Phase II: Diminishing marginal returns (TP curve concave but still rising). Phase III: Negative marginal returns (TP curve falling). Firms operate in Phase II."
            },
            {
              "process": "Example",
              "explanation": "Restaurant kitchen: First few cooks increase output rapidly (specialization). Additional cooks still increase output but less so (crowding). Too many cooks actually reduce output (getting in each other's way)."
            }
          ]
        },
        {
          "type": "Marginal Product of Labor ($MP_L$)",
          "description": "The additional output from one more unit of labor: $MP_L = \\frac{\\Delta Q}{\\Delta L}$.",
          "examples": [
            {
              "process": "Pattern",
              "explanation": "Initially increasing (specialization), then eventually diminishing (fixed capital constraint), finally negative (overcrowding)."
            },
            {
              "process": "Relation to TP curve",
              "explanation": "$MP_L$ is the slope of TP curve. When TP increases at increasing rate, $MP_L$ rises. When TP increases at decreasing rate, $MP_L$ falls but remains positive. When TP falls, $MP_L$ negative."
            },
            {
              "process": "Decision relevance",
              "explanation": "Firms compare $MP_L \\times P_{output}$ to wage rate. Hire if value of marginal product exceeds wage."
            }
          ]
        },
        {
          "type": "Average Product of Labor ($AP_L$)",
          "description": "Output per worker: $AP_L = \\frac{Q}{L}$.",
          "examples": [
            {
              "process": "Pattern",
              "explanation": "Rises initially, peaks, then falls. Peaks where $MP_L = AP_L$."
            },
            {
              "process": "Relation to $MP_L$",
              "explanation": "When $MP_L > AP_L$, $AP_L$ rising. When $MP_L < AP_L$, $AP_L$ falling. $MP_L$ crosses $AP_L$ at $AP_L$ maximum."
            },
            {
              "process": "Interpretation",
              "explanation": "Measures average labor productivity. Important for cost per unit calculations."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "The Law of Diminishing Marginal Returns",
          "statement": "As successive units of a variable input are added to a fixed input, beyond some point the marginal product of the variable input will decline. Also called the law of diminishing returns.",
          "application": "This law operates only in short run when at least one input is fixed. It explains why TP curve eventually becomes concave.",
          "example": "Factory with fixed number of machines: First workers operate machines efficiently. Additional workers help with maintenance, materials handling. Eventually, too many workers—machines are all occupied, workers wait for machine time, marginal product declines."
        },
        {
          "principle": "Firms Operate Where Marginal Product Is Diminishing but Positive",
          "statement": "Profit-maximizing firms produce in Phase II where $MP_L$ is positive but diminishing. Not in Phase I (could increase output by adding more labor) or Phase III (could increase output by reducing labor).",
          "application": "The firm's optimal labor usage is where $MP_L \\times P = wage$, which occurs in diminishing returns region.",
          "example": "If $MP_L$ is still increasing (Phase I), adding another worker increases output more than previous worker, so firm should definitely hire more. Only when $MP_L$ starts diminishing does the trade-off between additional output and additional cost become relevant for optimization."
        }
      ],
      "worked_examples": [
        {
          "title": "Analyzing Short Run Production Data",
          "problem": "A factory with fixed equipment size has the following production data: Workers (L): 0, 1, 2, 3, 4, 5, 6. Output (Q): 0, 10, 25, 45, 60, 70, 75. Calculate $MP_L$ and $AP_L$ for each worker level. Identify where diminishing returns begin. Find where $AP_L$ is maximized.",
          "step_by_step": [
            {
              "step": "Calculate $MP_L$ between points",
              "explanation": "$MP_L = \\Delta Q / \\Delta L$. L0→1: (10-0)/(1-0)=10. L1→2: (25-10)/1=15. L2→3: (45-25)/1=20. L3→4: (60-45)/1=15. L4→5: (70-60)/1=10. L5→6: (75-70)/1=5."
            },
            {
              "step": "Calculate $AP_L$ at each point",
              "explanation": "$AP_L = Q/L$. L1: 10/1=10. L2: 25/2=12.5. L3: 45/3=15. L4: 60/4=15. L5: 70/5=14. L6: 75/6=12.5."
            },
            {
              "step": "Identify diminishing returns start",
              "explanation": "$MP_L$ increases from 10 to 15 to 20 (increasing marginal returns), then falls to 15 (first decrease). Diminishing returns begin after 3rd worker (between L=3 and L=4, $MP_L$ falls from 20 to 15)."
            },
            {
              "step": "Find $AP_L$ maximum",
              "explanation": "$AP_L$ peaks at 15 with both 3 and 4 workers (15 in both cases). Actually maximum is exactly 15, occurs at L=3 and L=4 (plateau)."
            },
            {
              "step": "Check $MP_L = AP_L$ at maximum",
              "explanation": "At L=3: $AP_L=15$, $MP_L$ from 2→3 is 20 (not equal). At L=4: $AP_L=15$, $MP_L$ from 3→4 is 15 (equal). So $MP_L$ crosses $AP_L$ at L=4, where $AP_L$ is maximum."
            }
          ],
          "final_answer": "$MP_L$: 10, 15, 20, 15, 10, 5. $AP_L$: 10, 12.5, 15, 15, 14, 12.5. Diminishing returns begin after the 3rd worker (when $MP_L$ starts declining from 20 to 15). $AP_L$ is maximized at 15 units per worker with either 3 or 4 workers (plateau), and $MP_L = AP_L$ at L=4.",
          "concept_applied": "In short run production: $MP_L$ initially increases (increasing returns) then eventually diminishes. $AP_L$ rises then falls, maximized where $MP_L = AP_L$. Firms typically operate where $MP_L$ is diminishing but positive."
        }
      ],
      "image": {
        "src": "images/unit5/short_run_production_curves.png",
        "alt": "Graph showing TP curve with three phases, and corresponding MP and AP curves below",
        "caption": "Short run production: TP curve shows three phases; MP eventually diminishes and crosses AP at AP's maximum"
      }
    },
    {
      "section_title": "Isoquants and Input Choice in the Long Run",
      "introduction": "In the long run, with all inputs variable, firms choose optimal input combinations. Isoquants provide a powerful tool for analyzing these choices.",
      "key_concept": {
        "definition": "An isoquant is a curve showing all combinations of inputs (like labor and capital) that produce the same level of output. Higher isoquants represent more output. The slope of an isoquant is the marginal rate of technical substitution (MRTS), which measures how much of one input can be reduced when another is increased while keeping output constant.",
        "context": "Isoquants are to production what indifference curves are to consumer theory. They show the firm's production technology graphically. Different production functions yield different isoquant shapes: straight lines (perfect substitutes), L-shaped (perfect complements), or convex curves (imperfect substitutes like Cobb-Douglas)."
      },
      "categories": [
        {
          "type": "Isoquant Properties",
          "description": "Characteristics that define proper isoquants.",
          "examples": [
            {
              "process": "Downward sloping",
              "explanation": "To maintain same output, if you use more of one input, you can use less of another (assuming both inputs have positive marginal products)."
            },
            {
              "process": "Convex to origin",
              "explanation": "For most production functions, isoquants bow inward. This reflects diminishing MRTS: as you substitute more and more labor for capital, each additional unit of labor replaces less and less capital."
            },
            {
              "process": "Higher isoquants = more output",
              "explanation": "Isoquants further from origin represent higher output levels, assuming more inputs yield more output."
            },
            {
              "process": "Do not intersect",
              "explanation": "One input combination cannot produce two different output levels (if technology is consistent)."
            }
          ]
        },
        {
          "type": "Marginal Rate of Technical Substitution (MRTS)",
          "description": "The rate at which one input can be substituted for another while maintaining output: $MRTS_{LK} = -\\frac{\\Delta K}{\\Delta L} = \\frac{MP_L}{MP_K}$.",
          "examples": [
            {
              "process": "Interpretation",
              "explanation": "If $MRTS_{LK} = 2$, firm can give up 2 units of capital for 1 more unit of labor and produce same output."
            },
            {
              "process": "Diminishing MRTS",
              "explanation": "As firm uses more labor and less capital, $MRTS$ falls: each additional worker replaces less capital than previous worker."
            },
            {
              "process": "Relation to marginal products",
              "explanation": "$MRTS = MP_L / MP_K$. If labor becomes relatively more productive than capital, $MRTS$ increases."
            }
          ]
        },
        {
          "type": "Isoquant Shapes for Different Technologies",
          "description": "How production function type determines isoquant shape.",
          "examples": [
            {
              "process": "Perfect substitutes (linear)",
              "explanation": "Straight line isoquants: constant $MRTS$. Example: Robots and humans doing identical tasks."
            },
            {
              "process": "Perfect complements (Leontief)",
              "explanation": "L-shaped isoquants: inputs must be used in fixed proportion. Example: Cars need 4 wheels and 1 body—extra wheels without bodies useless."
            },
            {
              "process": "Imperfect substitutes (Cobb-Douglas)",
              "explanation": "Convex isoquants: diminishing $MRTS$. Most common case. Example: Most manufacturing—can substitute machines for workers but not perfectly."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Cost Minimization Occurs Where MRTS Equals Input Price Ratio",
          "statement": "To produce a given output at minimum cost, firm chooses input combination where $MRTS_{LK} = \\frac{w}{r}$ where $w$ is wage rate and $r$ is rental rate of capital.",
          "application": "At optimum, the rate at which technology allows substitution equals the rate at which market prices allow substitution.",
          "example": "If $MRTS = 2$ (1 labor replaces 2 capital) but $w/r = 1$ (labor and capital cost the same), firm should use more labor (since each $1 of labor saves $2 of capital). Adjust until $MRTS = w/r$."
        },
        {
          "principle": "Expansion Path Shows Optimal Input Combinations as Output Grows",
          "statement": "The expansion path connects cost-minimizing input combinations for different output levels, showing how optimal input mix changes with scale.",
          "application": "If expansion path is straight line through origin, optimal input proportions don't change with scale (constant returns, Cobb-Douglas with equal exponents). If curved, proportions change.",
          "example": "If capital becomes relatively cheaper at large scale, expansion path curves toward capital axis—large firms use more capital-intensive methods."
        }
      ],
      "worked_examples": [
        {
          "title": "Finding Cost-Minimizing Input Combination",
          "problem": "A firm has production function $Q = L^{0.5}K^{0.5}$ (Cobb-Douglas). Wage rate $w = \\$20$, capital rental rate $r = \\$5$. The firm wants to produce $Q = 100$ units. Find the cost-minimizing $L$ and $K$. Verify that $MRTS = w/r$ at optimum.",
          "step_by_step": [
            {
              "step": "Set up cost minimization",
              "explanation": "Minimize cost $C = wL + rK = 20L + 5K$ subject to $Q = L^{0.5}K^{0.5} = 100$."
            },
            {
              "step": "Find MRTS from production function",
              "explanation": "For Cobb-Douglas $Q = AL^\\alpha K^\\beta$, $MP_L = \\alpha Q/L$, $MP_K = \\beta Q/K$. Here $\\alpha = \\beta = 0.5$, so $MP_L = 0.5Q/L$, $MP_K = 0.5Q/K$. $MRTS = MP_L/MP_K = (0.5Q/L)/(0.5Q/K) = K/L$."
            },
            {
              "step": "Set MRTS = price ratio",
              "explanation": "$MRTS = K/L = w/r = 20/5 = 4$. So $K/L = 4$, or $K = 4L$."
            },
            {
              "step": "Substitute into production function",
              "explanation": "$Q = L^{0.5}K^{0.5} = L^{0.5}(4L)^{0.5} = L^{0.5} × 2 × L^{0.5} = 2L$. Since $Q=100$, $2L=100$, so $L=50$."
            },
            {
              "step": "Solve for K",
              "explanation": "$K = 4L = 4×50 = 200$."
            },
            {
              "step": "Verify",
              "explanation": "Check production: $Q = 50^{0.5} × 200^{0.5} = \\sqrt{50} × \\sqrt{200} = \\sqrt{10000} = 100$. MRTS = $K/L = 200/50 = 4 = w/r$. Correct."
            }
          ],
          "final_answer": "Cost-minimizing inputs: $L = 50$ workers, $K = 200$ units of capital. Total cost = $20×50 + 5×200 = 1000 + 1000 = \\$2000$. MRTS = 4 equals price ratio $20/5 = 4$.",
          "concept_applied": "For Cobb-Douglas production, cost minimization requires $K/L = (w/r) × (\\beta/\\alpha)$. Here with $\\alpha=\\beta$, simplifies to $K/L = w/r$. The firm uses more capital because it's relatively cheap ($r=5$ vs $w=20$)."
        }
      ],
      "image": {
        "src": "images/unit5/isoquant_cost_min.png",
        "alt": "Graph showing isoquant for Q=100, isocost line, and tangency point where MRTS = w/r",
        "caption": "Cost minimization: firm chooses input combination where isoquant is tangent to isocost line (MRTS = input price ratio)"
      }
    },
    {
      "section_title": "Returns to Scale in the Long Run",
      "introduction": "When firms scale up all inputs proportionally in the long run, output may increase proportionally, more than proportionally, or less than proportionally. These patterns are called returns to scale.",
      "key_concept": {
        "definition": "Returns to scale describe what happens to output when all inputs are increased by the same proportion. Three possibilities: Constant returns to scale (CRS): doubling all inputs doubles output. Increasing returns to scale (IRS): doubling inputs more than doubles output. Decreasing returns to scale (DRS): doubling inputs less than doubles output.",
        "context": "Returns to scale are a long run concept—all inputs must be variable. They depend on the production technology. Some industries naturally have increasing returns (software, utilities with high fixed costs). Others have decreasing returns (craft production, management-intensive services). Most have constant returns over some range."
      },
      "categories": [
        {
          "type": "Constant Returns to Scale (CRS)",
          "description": "Output changes proportionally with inputs.",
          "examples": [
            {
              "process": "Mathematical test",
              "explanation": "If $f(tL, tK) = t f(L, K)$ for any $t > 0$, then CRS. Example: Cobb-Douglas with $\\alpha + \\beta = 1$."
            },
            {
              "process": "Economic meaning",
              "explanation": "Replicating production process yields proportional output. No inherent advantage or disadvantage to size."
            },
            {
              "process": "Example industries",
              "explanation": "Some manufacturing, simple services. A restaurant chain opening identical locations."
            }
          ]
        },
        {
          "type": "Increasing Returns to Scale (IRS)",
          "description": "Output increases more than proportionally with inputs.",
          "examples": [
            {
              "process": "Mathematical test",
              "explanation": "If $f(tL, tK) > t f(L, K)$ for $t > 1$, then IRS. Example: Cobb-Douglas with $\\alpha + \\beta > 1$."
            },
            {
              "process": "Economic meaning",
              "explanation": "Economies of scale—larger scale more efficient. Specialization, indivisible inputs, volume discounts, geometric vs arithmetic relationships."
            },
            {
              "process": "Example industries",
              "explanation": "Software (high development cost, near-zero replication cost), utilities (network effects, large fixed costs), automobile manufacturing."
            }
          ]
        },
        {
          "type": "Decreasing Returns to Scale (DRS)",
          "description": "Output increases less than proportionally with inputs.",
          "examples": [
            {
              "process": "Mathematical test",
              "explanation": "If $f(tL, tK) < t f(L, K)$ for $t > 1$, then DRS. Example: Cobb-Douglas with $\\alpha + \\beta < 1$."
            },
            {
              "process": "Economic meaning",
              "explanation": "Diseconomies of scale—larger scale less efficient. Coordination problems, bureaucracy, resource constraints."
            },
            {
              "process": "Example industries",
              "explanation": "Fine dining restaurants, consulting services, craft production—where personal attention/quality suffers with size."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Returns to Scale Determine Long Run Average Cost Shape",
          "statement": "IRS leads to falling long run average costs (economies of scale). CRS leads to constant long run average costs. DRS leads to rising long run average costs (diseconomies of scale).",
          "application": "This explains why some industries have natural monopolies (strong IRS) while others remain fragmented (DRS).",
          "example": "Utilities have strong IRS—average cost falls over large range, leading to natural monopoly. Restaurants often have DRS beyond certain size—average cost rises, explaining why chains face limits."
        },
        {
          "principle": "Different Returns May Apply at Different Scales",
          "statement": "Many firms experience IRS at small scale, CRS at medium scale, DRS at very large scale, creating U-shaped long run average cost curve.",
          "application": "Initially efficiencies from scale, then constant returns, eventually bureaucratic inefficiencies.",
          "example": "Automaker: Small scale inefficient (IRS as scale increases). Medium scale optimal (CRS). Very large scale faces coordination problems (DRS)."
        }
      ],
      "worked_examples": [
        {
          "title": "Determining Returns to Scale from Production Function",
          "problem": "For each production function, determine the returns to scale: (a) $Q = 5L + 3K$, (b) $Q = L^{0.3}K^{0.3}$, (c) $Q = 2L^{0.6}K^{0.7}$, (d) $Q = \\min(2L, 3K)$.",
          "step_by_step": [
            {
              "step": "Test (a) linear function",
              "explanation": "$Q(tL, tK) = 5(tL) + 3(tK) = t(5L+3K) = tQ$. Exactly proportional—Constant Returns to Scale."
            },
            {
              "step": "Test (b) Cobb-Douglas",
              "explanation": "Sum exponents: $0.3 + 0.3 = 0.6 < 1$. Decreasing Returns to Scale."
            },
            {
              "step": "Test (c) Cobb-Douglas",
              "explanation": "Sum exponents: $0.6 + 0.7 = 1.3 > 1$. Increasing Returns to Scale."
            },
            {
              "step": "Test (d) Leontief function",
              "explanation": "$Q(tL, tK) = \\min(2(tL), 3(tK)) = \\min(t×2L, t×3K) = t×\\min(2L, 3K) = tQ$. Constant Returns to Scale."
            }
          ],
          "final_answer": "(a) Constant returns to scale, (b) Decreasing returns to scale, (c) Increasing returns to scale, (d) Constant returns to scale. For Cobb-Douglas $Q=AL^\\alpha K^\\beta$, returns to scale determined by $\\alpha+\\beta$: $=1$: CRS, $>1$: IRS, $<1$: DRS.",
          "concept_applied": "To determine returns to scale mathematically: multiply all inputs by $t$, see if output multiplies by $t$, more than $t$, or less than $t$. For Cobb-Douglas, simply sum the exponents. Linear and Leontief typically exhibit constant returns."
        }
      ],
      "image": {
        "src": "images/unit5/returns_to_scale.png",
        "alt": "Three graphs showing output response to scaled inputs: proportional (CRS), more than proportional (IRS), less than proportional (DRS)",
        "caption": "Returns to scale: how output changes when all inputs are scaled proportionally"
      }
    }
  ],
  "key_terms": [
    "Short run",
    "Long run",
    "Fixed inputs",
    "Variable inputs",
    "Law of diminishing marginal returns",
    "Total Product (TP)",
    "Marginal Product (MP)",
    "Average Product (AP)",
    "Isoquant",
    "Marginal Rate of Technical Substitution (MRTS)",
    "Expansion path",
    "Constant returns to scale (CRS)",
    "Increasing returns to scale (IRS)",
    "Decreasing returns to scale (DRS)",
    "Economies of scale"
  ],
  "summary": "The distinction between short run and long run is fundamental to production analysis. The short run is defined as a period where at least one input (usually capital) is fixed, while the long run allows all inputs to be varied. This is an economic, not calendar, distinction—long run length varies by industry from months (software) to decades (utilities). In the short run with one variable input (labor), production exhibits the law of diminishing marginal returns: as more variable input is added to fixed inputs, eventually each additional unit adds less output. This creates characteristic patterns: Total Product curve eventually becomes concave; Marginal Product rises then falls; Average Product rises then falls, with MP crossing AP at AP's maximum. Firms operate where MP is positive but diminishing. In the long run, with all inputs variable, firms choose optimal input combinations using isoquants—curves showing input combinations yielding same output. The slope of an isoquant is the Marginal Rate of Technical Substitution (MRTS), which equals the ratio of marginal products ($MP_L/MP_K$). Cost minimization occurs where MRTS equals the input price ratio ($w/r$). Returns to scale describe how output changes when all inputs are scaled proportionally: Constant Returns to Scale (output changes proportionally), Increasing Returns to Scale (output increases more than proportionally—economies of scale), and Decreasing Returns to Scale (output increases less than proportionally—diseconomies of scale). For Cobb-Douglas production functions $Q=AL^\\alpha K^\\beta$, returns to scale are determined by $\\alpha+\\beta$: equal to 1 (CRS), greater than 1 (IRS), less than 1 (DRS). These concepts explain firm size decisions, industry structure, and cost behavior over different time horizons."
}
