{
  "expanded_description": "This section introduces the principle of conservation of mechanical energy, a powerful tool for analyzing motion when only conservative forces (like gravity and spring forces) do work. It states that in the absence of non‑conservative forces (such as friction or air resistance), the total mechanical energy of a system—the sum of kinetic energy and potential energy—remains constant. This principle allows us to relate an object's speed and position without needing to know the forces or time involved, greatly simplifying many physics problems.",
  "core_concept": {
    "principle": "Conservation of mechanical energy: When only conservative forces act on a system, the total mechanical energy $E = KE + PE$ is constant. That is, $KE_i + PE_i = KE_f + PE_f$, where $KE = \\frac{1}{2}mv^2$, $PE_g = mgh$, and $PE_{el} = \\frac{1}{2}kx^2$.",
    "explanation": "This principle follows directly from the work‑energy theorem when the work done by non‑conservative forces is zero. Because conservative forces store energy as potential energy that can be fully recovered, energy merely transforms between kinetic and potential forms without loss. Conservation of mechanical energy is a special case of the more general law of conservation of energy, which includes other forms like thermal energy when non‑conservative forces are present.",
    "image": {
      "src": "images/unit6/conservation_mechanical_energy.png",
      "alt": "Diagram showing a roller coaster car at two different heights, with kinetic and potential energy bars illustrating energy transformation",
      "caption": "In the absence of friction, the total mechanical energy (KE + PE) of a roller coaster remains constant; energy transforms between kinetic and potential forms."
    }
  },
  "sections": [
    {
      "section_title": "Conservation of Mechanical Energy",
      "introduction": "When only conservative forces (such as gravity and ideal springs) do work, the total mechanical energy of a system is conserved. This means that energy can be transformed from kinetic to potential and back, but the sum never changes.",
      "key_concept": {
        "definition": "For an isolated system where only conservative forces act, the mechanical energy $E_{\\text{mech}} = KE + PE$ remains constant: $KE_i + PE_i = KE_f + PE_f$.",
        "context": "This powerful principle allows us to solve problems involving motion under gravity or springs without needing to know forces or time. It is valid for any process where no energy is lost to friction, air resistance, or other non‑conservative forces. If non‑conservative forces are present, mechanical energy is not conserved, but the total energy (including heat, sound, etc.) is still conserved."
      },
      "principles": [
        {
          "principle": "Conservative vs. Non‑conservative Forces",
          "statement": "A force is conservative if the work it does on an object moving between two points is independent of the path taken. Gravity and spring forces are conservative; friction and air resistance are non‑conservative.",
          "application": "When only conservative forces act, mechanical energy is conserved. If non‑conservative forces are present, the work done by them equals the change in mechanical energy: $W_{nc} = \\Delta KE + \\Delta PE$.",
          "example": "A ball thrown upward: only gravity (conservative) acts, so $KE + PE_g$ is constant. A block sliding on a rough incline: friction (non‑conservative) does work, so mechanical energy decreases."
        },
        {
          "principle": "Choosing a Reference Point",
          "statement": "Potential energy depends on a chosen reference point, but energy differences are independent of that choice. When using conservation of energy, the reference level must be used consistently for both initial and final states.",
          "application": "For gravitational potential energy, choose a convenient $h=0$ (e.g., ground, lowest point). For springs, $x=0$ is the equilibrium position.",
          "example": "For a pendulum, set $h=0$ at the lowest point. Then at the highest point, $PE$ is maximum and $KE$ minimum."
        },
        {
          "principle": "Energy Transformations",
          "statement": "As an object moves, energy continuously shifts between kinetic and potential forms. At any point, the sum remains constant.",
          "application": "In free fall, $PE$ converts to $KE$. In a spring‑mass system, energy oscillates between elastic $PE$ and $KE$.",
          "example": "A pendulum at its highest point has maximum $PE$ and zero $KE$; at the lowest point, maximum $KE$ and zero $PE$."
        }
      ],
      "classifications": [
        {
          "type": "Common Scenarios",
          "value": "Typical applications of conservation of mechanical energy",
          "characteristics": [
            "Free fall and projectile motion (ignoring air resistance)",
            "Pendulums and swings",
            "Roller coasters (frictionless idealization)",
            "Spring‑mass systems on frictionless surfaces",
            "Objects sliding down frictionless inclines"
          ],
          "behavior": "In each case, mechanical energy remains constant, allowing us to relate speed and height or speed and spring compression without knowing forces or time.",
          "examples": [
            {
              "process": "Frictionless incline",
              "explanation": "A block sliding down a frictionless ramp: initial $PE$ converts entirely to $KE$ at the bottom, so $mgh = \\frac{1}{2}mv^2$ → $v = \\sqrt{2gh}$."
            },
            {
              "process": "Pendulum",
              "explanation": "A pendulum released from height $h$ above its lowest point: at the bottom, $v = \\sqrt{2gh}$ (same as free fall)."
            },
            {
              "process": "Spring projectile",
              "explanation": "A mass on a compressed spring on a frictionless surface: elastic $PE$ converts to $KE$, so $\\frac{1}{2}kx^2 = \\frac{1}{2}mv^2$ → $v = x\\sqrt{k/m}$."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Free Fall",
          "problem": "A 2 kg ball is dropped from a height of 10 m. Use conservation of mechanical energy to find its speed just before hitting the ground. (Ignore air resistance, $g=9.8$ m/s²)",
          "step_by_step": [
            {
              "step": "Set reference level",
              "explanation": "Take ground as $h=0$. Then at top: $h_i = 10$ m, $v_i = 0$. At bottom: $h_f = 0$, $v_f = ?$."
            },
            {
              "step": "Write conservation of energy",
              "explanation": "$\\frac{1}{2}mv_i^2 + mgh_i = \\frac{1}{2}mv_f^2 + mgh_f$"
            },
            {
              "step": "Substitute knowns",
              "explanation": "$0 + (2)(9.8)(10) = \\frac{1}{2}(2)v_f^2 + 0$ → $196 = v_f^2$"
            },
            {
              "step": "Solve for $v_f$",
              "explanation": "$v_f = \\sqrt{196} = 14$ m/s"
            }
          ],
          "final_answer": "$14$ m/s",
          "concept_applied": "In free fall, gravitational potential energy converts entirely to kinetic energy."
        },
        {
          "title": "Frictionless Incline",
          "problem": "A 3 kg block starts from rest at the top of a frictionless ramp that is 5 m long and inclined at 30°. Find the block's speed at the bottom.",
          "step_by_step": [
            {
              "step": "Find vertical height",
              "explanation": "$h = L \\sin\\theta = 5 \\times \\sin30° = 5 \\times 0.5 = 2.5$ m"
            },
            {
              "step": "Apply energy conservation",
              "explanation": "$mgh = \\frac{1}{2}mv^2$ → $v = \\sqrt{2gh} = \\sqrt{2 \\times 9.8 \\times 2.5} = \\sqrt{49} = 7$ m/s"
            }
          ],
          "final_answer": "$7$ m/s",
          "concept_applied": "On a frictionless incline, speed at bottom depends only on height, not on angle."
        },
        {
          "title": "Pendulum",
          "problem": "A pendulum bob of mass 0.2 kg is released from rest when the string makes an angle of 45° with the vertical. The string length is 1.5 m. Find the speed of the bob at the lowest point.",
          "step_by_step": [
            {
              "step": "Find height difference",
              "explanation": "At release, the bob is higher than at bottom by $h = L(1 - \\cos\\theta) = 1.5(1 - \\cos45°) = 1.5(1 - 0.7071) = 1.5 \\times 0.2929 = 0.439$ m"
            },
            {
              "step": "Energy conservation",
              "explanation": "$mgh = \\frac{1}{2}mv^2$ → $v = \\sqrt{2gh} = \\sqrt{2 \\times 9.8 \\times 0.439} = \\sqrt{8.60} = 2.93$ m/s"
            }
          ],
          "final_answer": "$2.93$ m/s",
          "concept_applied": "Pendulum speed at bottom depends only on vertical drop, same as free fall from that height."
        },
        {
          "title": "Spring and Mass",
          "problem": "A 0.5 kg block is placed against a spring with $k = 200$ N/m on a frictionless surface. The spring is compressed 0.1 m and released. Find the speed of the block when it leaves the spring.",
          "step_by_step": [
            {
              "step": "Initial energy (all elastic PE)",
              "explanation": "$E_i = \\frac{1}{2}kx^2 = \\frac{1}{2}(200)(0.1)^2 = 100 \\times 0.01 = 1$ J"
            },
            {
              "step": "Final energy (all KE when spring relaxed)",
              "explanation": "$E_f = \\frac{1}{2}mv^2$"
            },
            {
              "step": "Energy conservation",
              "explanation": "$1 = \\frac{1}{2}(0.5)v^2 = 0.25 v^2$ → $v^2 = 4$ → $v = 2$ m/s"
            }
          ],
          "final_answer": "$2$ m/s",
          "concept_applied": "Elastic potential energy converts to kinetic energy when spring is released."
        },
        {
          "title": "Roller Coaster (Loop)",
          "problem": "A roller coaster car starts from rest at point A, a height $h$ above the ground. It then goes through a vertical loop of radius $R$. Assuming no friction, what minimum height $h$ is needed for the car to just make it over the top of the loop without falling? (Use energy conservation and circular motion condition.)",
          "step_by_step": [
            {
              "step": "Condition at top of loop",
              "explanation": "To just make it over, the normal force can be zero, so $mg = mv_{\\text{top}}^2 / R$ → $v_{\\text{top}}^2 = gR$."
            },
            {
              "step": "Energy conservation from start to top of loop",
              "explanation": "Take reference at bottom of loop. At start: height $h$, speed 0. At top of loop: height $2R$, speed $v_{\\text{top}}$. So $mgh = mg(2R) + \\frac{1}{2}m v_{\\text{top}}^2$."
            },
            {
              "step": "Substitute $v_{\\text{top}}^2 = gR$",
              "explanation": "$mgh = 2mgR + \\frac{1}{2}m gR = 2.5 mgR$ → $h = 2.5R$."
            }
          ],
          "final_answer": "$h = 2.5R$",
          "concept_applied": "Energy conservation plus circular motion gives the minimum starting height for a loop."
        }
      ],
      "image": {
        "src": "images/unit6/energy_conservation_examples.png",
        "alt": "Illustrations of energy conservation scenarios: falling ball, pendulum, spring, roller coaster loop",
        "caption": "Conservation of mechanical energy applies in many situations where only conservative forces act."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when applying conservation of mechanical energy.",
      "classifications": [
        {
          "type": "Including Non‑conservative Work Incorrectly",
          "value": "Applying conservation of mechanical energy when friction or other non‑conservative forces are present",
          "characteristics": [
            "Using $KE_i + PE_i = KE_f + PE_f$ even though friction acts",
            "Not accounting for energy lost to heat or sound"
          ],
          "behavior": "If non‑conservative forces do work, mechanical energy is not conserved. Instead, use $KE_i + PE_i + W_{nc} = KE_f + PE_f$, where $W_{nc}$ is the work done by non‑conservative forces (negative if they remove energy).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses energy conservation for a block sliding down a rough incline, ignoring friction."
            },
            {
              "process": "Correct",
              "explanation": "Include work done by friction: $mgh - f_k d = \\frac{1}{2}mv^2$."
            }
          ]
        },
        {
          "type": "Forgetting That Potential Energy Depends on Reference",
          "value": "Using inconsistent reference points for potential energy",
          "characteristics": [
            "Changing reference level between initial and final states",
            "Not recognizing that only changes in PE matter"
          ],
          "behavior": "Choose a single reference point and stick with it throughout the problem. The equation $KE_i + PE_i = KE_f + PE_f$ requires that $PE$ be measured from the same reference.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "For a ball thrown upward, student uses ground level for initial PE and tabletop for final PE."
            },
            {
              "process": "Correct",
              "explanation": "Consistently use ground (or any chosen level) for both."
            }
          ]
        },
        {
          "type": "Double‑Counting Energy",
          "value": "Including both work and potential energy in the same equation incorrectly",
          "characteristics": [
            "Writing $W_{nc} + KE_i + PE_i = KE_f + PE_f$ and also including $W_{nc}$ as if it were an energy term twice",
            "Adding work by conservative forces as separate from potential energy change"
          ],
          "behavior": "Conservative forces are already accounted for by potential energy. Do not add work by gravity separately if you are using gravitational potential energy.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student writes $mgh + \\frac{1}{2}mv_i^2 = \\frac{1}{2}mv_f^2 + mgh_f$ and also adds $mg\\Delta h$ on one side."
            },
            {
              "process": "Correct",
              "explanation": "Only one representation: either use work by gravity ($W_g = mg\\Delta h$) and KE, or use potential energy ($\\Delta PE = mg\\Delta h$) and KE. Don't use both."
            }
          ]
        },
        {
          "type": "Sign Errors in Potential Energy",
          "value": "Using $+mgh$ when $h$ is below reference (should be negative) or forgetting that $PE$ can be negative",
          "characteristics": [
            "Writing $PE = mgh$ with $h$ below reference as positive",
            "Not handling negative heights correctly in energy equations"
          ],
          "behavior": "Potential energy can be negative; include the sign correctly. In energy conservation, the sum $KE + PE$ may be smaller if $PE$ is negative.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Object in a well 5 m deep, reference at ground: student uses $PE = +mg(5)$."
            },
            {
              "process": "Correct",
              "explanation": "$PE = -mg(5)$ if ground is reference."
            }
          ]
        },
        {
          "type": "Confusing Elastic Potential Energy Formula",
          "value": "Using $\\frac{1}{2}kx$ or $kx^2$ instead of $\\frac{1}{2}kx^2$",
          "characteristics": [
            "Forgetting the 1/2 factor",
            "Using $kx$ (force) instead of energy"
          ],
          "behavior": "Elastic potential energy is $\\frac{1}{2}kx^2$. The factor 1/2 is crucial.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student writes $\\frac{1}{2}kx$ as potential energy."
            },
            {
              "process": "Correct",
              "explanation": "$PE_{el} = \\frac{1}{2}kx^2$."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/energy_conservation_mistakes.png",
        "alt": "Common mistakes: ignoring non‑conservative forces, inconsistent reference, sign errors",
        "caption": "Avoid these common errors when applying conservation of mechanical energy."
      }
    }
  ],
  "key_terms": [
    "Conservation of Mechanical Energy",
    "Conservative Force",
    "Non‑conservative Force",
    "Kinetic Energy",
    "Gravitational Potential Energy",
    "Elastic Potential Energy",
    "Work‑Energy Theorem",
    "Energy Transformation",
    "Reference Level",
    "Isolated System"
  ],
  "summary": "Conservation of mechanical energy states that in the absence of non‑conservative forces (like friction), the total mechanical energy $E = KE + PE$ of a system remains constant: $KE_i + PE_i = KE_f + PE_f$. Here $KE = \\frac{1}{2}mv^2$, $PE_g = mgh$, and $PE_{el} = \\frac{1}{2}kx^2$. This principle applies to systems where only conservative forces (gravity, springs) act. It allows solving for speeds, heights, or spring compressions without needing forces or time. Common applications include free fall, pendulums, frictionless inclines, and spring‑mass systems. Common mistakes include applying conservation when non‑conservative forces are present, inconsistent reference levels for potential energy, double‑counting energy, sign errors in potential energy, and misusing the elastic potential energy formula. Understanding energy conservation is fundamental to analyzing many physical systems and is a precursor to the more general law of conservation of energy."
}
