{
  "expanded_description": "This section introduces the concept of efficiency, which measures how effectively a device or system converts input energy into useful output energy. No real‑world machine is perfectly efficient; some energy is always lost to non‑useful forms such as heat, sound, or vibration due to non‑conservative forces like friction. Efficiency is expressed as a ratio (or percentage) of useful output to total input, providing a quantitative way to compare the performance of engines, motors, appliances, and even biological systems.",
  "core_concept": {
    "principle": "Efficiency ($e$) is the ratio of useful energy output to total energy input (or useful power output to total power input). It is a dimensionless quantity, often expressed as a percentage: $e = \\frac{\\text{Useful energy output}}{\\text{Total energy input}} \\times 100\\%$, or equivalently $e = \\frac{\\text{Useful power output}}{\\text{Total power input}} \\times 100\\%$. Due to energy conservation, efficiency is always less than 100% for real machines, with the 'lost' energy appearing in other forms (usually heat).",
    "explanation": "Efficiency quantifies the 'waste' in an energy conversion process. For example, a traditional incandescent light bulb might have an efficiency of around 5%, meaning only 5% of the electrical energy input is converted to visible light; the other 95% becomes heat. A car engine is typically around 20‑30% efficient, with most of the fuel's chemical energy lost as heat through the exhaust and cooling system. Understanding efficiency is crucial in engineering, economics, and environmental science for designing better machines and reducing energy waste.",
    "image": {
      "src": "images/unit6/efficiency_intro.png",
      "alt": "Energy flow diagram showing input energy, useful output energy, and wasted energy for a machine",
      "caption": "Efficiency compares useful output energy to total input energy; the difference is lost to the environment, usually as heat."
    }
  },
  "sections": [
    {
      "section_title": "What is Efficiency?",
      "introduction": "When energy is transformed from one form to another, or transferred from one system to another, some of the energy is inevitably converted into non‑useful forms. Efficiency tells us what fraction of the input energy ends up doing what we want it to do.",
      "key_concept": {
        "definition": "Efficiency ($e$) is the ratio of useful energy output to total energy input: $e = \\frac{E_{\\text{useful}}}{E_{\\text{input}}}$. It can also be expressed in terms of power: $e = \\frac{P_{\\text{useful}}}{P_{\\text{input}}}$, provided the time intervals are the same. It is a dimensionless quantity, often given as a percentage ($e \\times 100\\%$).",
        "context": "Efficiency is always less than 1 (or 100%) for real devices because of the second law of thermodynamics. No energy‑conversion process is perfectly efficient; some energy is always 'lost' to the surroundings, usually as thermal energy. This does not violate energy conservation – the total energy output (useful + wasted) always equals the total energy input."
      },
      "principles": [
        {
          "principle": "Energy Conservation and Efficiency",
          "statement": "Efficiency does not imply that energy is destroyed. The total energy output (useful + wasted) equals the total energy input: $E_{\\text{input}} = E_{\\text{useful}} + E_{\\text{wasted}}$. Efficiency simply measures the proportion that is useful.",
          "application": "When analyzing a system, identify the useful energy form (e.g., light from a bulb, mechanical work from an engine) and the total input energy. The difference is the wasted energy.",
          "example": "A motor with 80% efficiency converts 80 J of electrical energy into mechanical work for every 100 J input; the remaining 20 J becomes heat."
        },
        {
          "principle": "Efficiency Using Power",
          "statement": "Because efficiency is a ratio of energies over the same time period, it can also be calculated using power: $e = P_{\\text{useful}} / P_{\\text{input}}$. This is often more convenient when dealing with devices that operate continuously, like motors or heaters.",
          "application": "If a 1500 W electric heater outputs 1440 W of useful heat (the rest lost as light or sound), its efficiency is $1440/1500 = 0.96$ or 96%.",
          "example": "A light bulb rated at 60 W might produce only 3 W of visible light, giving an efficiency of $3/60 = 0.05$ or 5%."
        },
        {
          "principle": "No Perfect Efficiency",
          "statement": "No real machine can have an efficiency of 100% because some energy is always converted to non‑useful forms due to friction, air resistance, electrical resistance, etc. The second law of thermodynamics states that it is impossible to convert all heat energy into work in a cyclic process.",
          "application": "Engineers strive to improve efficiency, but 100% is a theoretical limit that cannot be reached in practice.",
          "example": "Even the most efficient electric motors achieve about 95‑98% efficiency; there is always some loss in the windings and bearings."
        }
      ],
      "classifications": [
        {
          "type": "Efficiency of Common Devices",
          "value": "Typical efficiency ranges",
          "characteristics": [
            "Incandescent light bulb: ≈ 5% (light), rest heat",
            "LED light bulb: ≈ 20‑40% (light), much cooler",
            "Car engine: ≈ 20‑30% (mechanical work), rest heat",
            "Electric motor: ≈ 70‑98% (mechanical work), depends on size and quality",
            "Human body: ≈ 20‑25% (mechanical work from food energy)",
            "Solar panel: ≈ 15‑22% (electrical from sunlight)",
            "Power plant: ≈ 30‑40% (electrical from fuel/heat)"
          ],
          "behavior": "These ranges show that efficiency varies widely depending on technology. Higher efficiency often means less waste heat, lower operating costs, and reduced environmental impact.",
          "examples": [
            {
              "process": "Incandescent bulb",
              "explanation": "100 J electrical in → 5 J light out, 95 J heat."
            },
            {
              "process": "LED bulb",
              "explanation": "100 J electrical in → 30 J light out, 70 J heat (much less waste heat for same light output)."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Efficiency from Energy",
          "problem": "An electric motor uses 5000 J of electrical energy to lift a 50 kg mass a height of 8 m. What is the efficiency of the motor? ($g = 9.8$ m/s²)",
          "step_by_step": [
            {
              "step": "Calculate useful work output",
              "explanation": "The useful work is lifting the mass against gravity: $W_{\\text{useful}} = mgh = 50 \\times 9.8 \\times 8 = 3920$ J."
            },
            {
              "step": "Calculate efficiency",
              "explanation": "$e = \\frac{W_{\\text{useful}}}{E_{\\text{input}}} = \\frac{3920}{5000} = 0.784$"
            },
            {
              "step": "Convert to percentage",
              "explanation": "$e = 0.784 \\times 100\\% = 78.4\\%$"
            }
          ],
          "final_answer": "$78.4\\%$",
          "concept_applied": "Efficiency = useful work output / total energy input."
        },
        {
          "title": "Calculating Efficiency from Power",
          "problem": "A 1200 W electric heater produces 1080 W of useful heat. What is its efficiency?",
          "step_by_step": [
            {
              "step": "Use power form of efficiency",
              "explanation": "$e = \\frac{P_{\\text{useful}}}{P_{\\text{input}}} = \\frac{1080}{1200} = 0.9$"
            },
            {
              "step": "Convert to percentage",
              "explanation": "$e = 90\\%$"
            }
          ],
          "final_answer": "$90\\%$",
          "concept_applied": "Efficiency can be calculated using power if the device operates steadily."
        },
        {
          "title": "Finding Wasted Energy",
          "problem": "A car engine has an efficiency of 25%. If the chemical energy in the fuel is 200 MJ, how much energy is wasted?",
          "step_by_step": [
            {
              "step": "Find useful energy output",
              "explanation": "$E_{\\text{useful}} = e \\times E_{\\text{input}} = 0.25 \\times 200 = 50$ MJ."
            },
            {
              "step": "Find wasted energy",
              "explanation": "$E_{\\text{wasted}} = E_{\\text{input}} - E_{\\text{useful}} = 200 - 50 = 150$ MJ."
            }
          ],
          "final_answer": "$150$ MJ",
          "concept_applied": "Wasted energy = input energy − useful output energy."
        },
        {
          "title": "Finding Input Energy from Efficiency and Output",
          "problem": "An electric pump is 70% efficient and does 1400 J of useful work lifting water. How much electrical energy was supplied to the pump?",
          "step_by_step": [
            {
              "step": "Rearrange efficiency formula",
              "explanation": "$e = \\frac{E_{\\text{useful}}}{E_{\\text{input}}}$ → $E_{\\text{input}} = \\frac{E_{\\text{useful}}}{e}$"
            },
            {
              "step": "Substitute values",
              "explanation": "$E_{\\text{input}} = \\frac{1400}{0.70} = 2000$ J"
            }
          ],
          "final_answer": "$2000$ J",
          "concept_applied": "Input energy = useful output / efficiency."
        },
        {
          "title": "Overall Efficiency of a Multi‑Stage System",
          "problem": "A power plant has an efficiency of 40% in converting fuel heat to electricity. The electricity is transmitted with 95% efficiency, and an electric motor with 90% efficiency converts the electricity to mechanical work. What is the overall efficiency from fuel to mechanical work?",
          "step_by_step": [
            {
              "step": "Understand that efficiencies multiply",
              "explanation": "Each stage passes on a fraction of the energy. Overall efficiency = product of individual efficiencies (as decimals)."
            },
            {
              "step": "Convert percentages to decimals",
              "explanation": "$e_1 = 0.40$, $e_2 = 0.95$, $e_3 = 0.90$"
            },
            {
              "step": "Multiply",
              "explanation": "$e_{\\text{overall}} = 0.40 \\times 0.95 \\times 0.90 = 0.342$"
            },
            {
              "step": "Convert to percentage",
              "explanation": "$34.2\\%$"
            }
          ],
          "final_answer": "$34.2\\%$",
          "concept_applied": "For multi‑stage systems, overall efficiency is the product of individual efficiencies."
        }
      ],
      "image": {
        "src": "images/unit6/efficiency_examples.png",
        "alt": "Energy flow diagrams for different devices showing input, useful output, and wasted energy",
        "caption": "Efficiency varies widely among devices; higher efficiency means less wasted energy."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with efficiency.",
      "classifications": [
        {
          "type": "Confusing Efficiency with Power",
          "value": "Thinking that a higher‑power device must be more efficient",
          "characteristics": [
            "Assuming a 100 W bulb is more efficient than a 60 W bulb",
            "Not recognizing that efficiency is a ratio, not a power rating"
          ],
          "behavior": "Power tells how fast energy is used; efficiency tells how much of that energy is useful. A high‑power device can be very inefficient (like a powerful incandescent spotlight).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a 1500 W heater is more efficient than a 1000 W heater because it uses more power."
            },
            {
              "process": "Correct",
              "explanation": "Efficiency depends on design, not just power rating. A 1000 W heater could be 100% efficient (ideal), while a 1500 W could be 50% efficient."
            }
          ]
        },
        {
          "type": "Efficiency Greater Than 100%",
          "value": "Obtaining an efficiency over 100% and not recognizing it as impossible",
          "characteristics": [
            "Calculating $e > 1$ from incorrect data",
            "Forgetting that energy cannot be created"
          ],
          "behavior": "Efficiency must always be ≤ 1 (≤ 100%). If your calculation gives >100%, you have made an error: either the 'useful output' is overestimated, the input is underestimated, or you have confused input and output.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student calculates $e = 500/400 = 1.25$ (125%) and thinks the device creates energy."
            },
            {
              "process": "Correct",
              "explanation": "Re‑examine data; perhaps 400 J is output and 500 J is input, giving 80% efficiency."
            }
          ]
        },
        {
          "type": "Using Inconsistent Units or Energy Forms",
          "value": "Mixing different energy forms without proper conversion, or using power and energy interchangeably without regard to time",
          "characteristics": [
            "Comparing electrical input in kWh to mechanical output in J without converting",
            "Using $P_{\\text{useful}}/E_{\\text{input}}$ directly without ensuring consistent time basis"
          ],
          "behavior": "When using power for efficiency, both must be measured over the same time interval, or use energy values directly. Ensure all quantities are in consistent units (e.g., joules for energy, watts for power).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "A motor uses 2 kWh of electricity and outputs 5 MJ of work. Student calculates $e = 5/2 = 2.5$ (ignoring unit conversion)."
            },
            {
              "process": "Correct",
              "explanation": "Convert 2 kWh to joules: $2 \\times 3.6 \\times 10^6 = 7.2 \\times 10^6$ J. Then $e = 5 \\times 10^6 / 7.2 \\times 10^6 = 0.694$ or 69.4%."
            }
          ]
        },
        {
          "type": "Forgetting That Efficiency is Dimensionless",
          "value": "Attaching units to efficiency values",
          "characteristics": [
            "Writing 'e = 80% J' or similar",
            "Treating efficiency as having units"
          ],
          "behavior": "Efficiency is a ratio of two quantities with the same units, so it is dimensionless. It is simply a number (often expressed as a percentage).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student writes 'e = 80% W'."
            },
            {
              "process": "Correct",
              "explanation": "e = 0.80 or 80% (no units)."
            }
          ]
        },
        {
          "type": "Confusing Efficiency with Conservation of Energy",
          "value": "Thinking that low efficiency means energy is not conserved",
          "characteristics": [
            "Believing that wasted energy disappears",
            "Not accounting for heat losses"
          ],
          "behavior": "Energy is always conserved. Low efficiency simply means a large fraction of the input energy ends up in forms we don't consider useful. That energy still exists, usually as thermal energy in the surroundings.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a 10% efficient light bulb 'loses' 90% of the energy, meaning it's destroyed."
            },
            {
              "process": "Correct",
              "explanation": "The 90% is converted to heat, which is still energy; it's just not useful for lighting."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/efficiency_mistakes.png",
        "alt": "Common mistakes: confusing power with efficiency, efficiency >100%, unit errors",
        "caption": "Avoid these common errors when working with efficiency."
      }
    }
  ],
  "key_terms": [
    "Efficiency",
    "Useful Energy",
    "Wasted Energy",
    "Energy Input",
    "Energy Output",
    "Power Input",
    "Power Output",
    "Percentage",
    "Ratio",
    "Energy Conservation",
    "Energy Loss",
    "Heat Loss"
  ],
  "summary": "Efficiency is the ratio of useful energy (or power) output to total energy (or power) input: $e = E_{\\text{useful}} / E_{\\text{input}} = P_{\\text{useful}} / P_{\\text{input}}$. It is a dimensionless quantity, often expressed as a percentage. Real devices always have efficiencies less than 100% due to unavoidable losses (friction, heat, sound, etc.), but energy is still conserved: $E_{\\text{input}} = E_{\\text{useful}} + E_{\\text{wasted}}$. Common efficiency ranges: incandescent bulbs ≈5%, LEDs ≈20‑40%, car engines ≈20‑30%, electric motors ≈70‑98%. For multi‑stage systems, overall efficiency is the product of individual stage efficiencies. Common mistakes include confusing efficiency with power, obtaining efficiencies over 100% (which indicates an error), unit inconsistencies, forgetting that efficiency is dimensionless, and thinking that wasted energy violates conservation of energy. Understanding efficiency is crucial for evaluating and improving the performance of energy‑conversion devices and systems."
}
