{
  "expanded_description": "This section introduces gravitational potential energy, the energy an object possesses due to its position in a gravitational field. Near Earth's surface, where gravity is approximately constant, gravitational potential energy is given by $PE_g = mgh$, where $h$ is the height above a chosen reference level. This form of potential energy is a key component of mechanical energy and plays a central role in energy conservation problems involving height changes.",
  "core_concept": {
    "principle": "Gravitational potential energy near Earth's surface is the energy stored in an object due to its vertical position relative to a reference point. It is given by $PE_g = mgh$, where $m$ is mass, $g$ is the acceleration due to gravity, and $h$ is the height above the chosen reference level. Only changes in gravitational potential energy are physically meaningful; the reference level can be chosen arbitrarily for convenience.",
    "explanation": "When an object is lifted against gravity, work is done on it, and that work is stored as gravitational potential energy. When the object falls, this potential energy is converted to kinetic energy. The formula $PE_g = mgh$ applies only when $g$ is constant, which is a good approximation near Earth's surface. The choice of reference point (where $h=0$) does not affect energy differences or the physics of a situation.",
    "image": {
      "src": "images/unit6/gravitational_pe.png",
      "alt": "Diagram showing an object at height h above a reference level, with the formula PE = mgh indicated",
      "caption": "Gravitational potential energy depends on mass, gravity, and height above a reference point."
    }
  },
  "sections": [
    {
      "section_title": "Gravitational Potential Energy",
      "introduction": "Gravitational potential energy is the energy stored in an object as a result of its position in a gravitational field. It represents the potential for the object to do work as it falls.",
      "key_concept": {
        "definition": "Near Earth's surface, the gravitational potential energy of an object of mass $m$ at height $h$ above a chosen reference level is $PE_g = mgh$. The SI unit is the joule (J).",
        "context": "This energy is stored due to the gravitational interaction between the object and Earth. The higher an object is lifted, the more work was done to lift it, and the more potential energy it has. When the object falls, this potential energy converts to kinetic energy."
      },
      "principles": [
        {
          "principle": "Dependence on Reference Level",
          "statement": "The value of $PE_g$ depends on the chosen reference level where $h=0$. Only differences in potential energy are physically meaningful; the absolute value is arbitrary.",
          "application": "Choose a reference level that simplifies calculations. Common choices: ground level, tabletop, or the lowest point in a problem.",
          "example": "A book on a table 1 m high has $PE_g = mg(1)$ if reference is floor, but $PE_g = 0$ if reference is tabletop. Both are valid; the change in PE when the book falls to the floor is $mgh$ in either case."
        },
        {
          "principle": "Work Done Against Gravity",
          "statement": "The work done to lift an object at constant speed against gravity equals the increase in its gravitational potential energy: $W = \\Delta PE_g = mg\\Delta h$.",
          "application": "This provides a direct way to calculate the energy stored when lifting objects.",
          "example": "Lifting a 10 kg box 2 m requires work $W = 10 \\times 9.8 \\times 2 = 196$ J, which becomes the box's potential energy increase."
        },
        {
          "principle": "Gravitational PE Can Be Negative",
          "statement": "If an object is below the chosen reference level, $h$ is negative, so $PE_g$ is negative. This is acceptable and indicates that the object has less potential energy than at the reference point.",
          "application": "Negative potential energy is common when reference is at a high point (e.g., ceiling). The key is that changes, not absolute values, matter.",
          "example": "A ball in a well 5 m below ground level, with ground as reference ($h=0$), has $PE_g = -mg(5)$."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Gravitational Potential Energy",
          "problem": "A 3 kg book is on a shelf 2.5 m above the floor. Using the floor as the reference level, what is the book's gravitational potential energy? ($g = 9.8$ m/s²)",
          "step_by_step": [
            {
              "step": "Recall the formula",
              "explanation": "$PE_g = mgh$"
            },
            {
              "step": "Substitute values",
              "explanation": "$PE_g = 3 \\times 9.8 \\times 2.5 = 73.5$ J"
            }
          ],
          "final_answer": "$73.5$ J",
          "concept_applied": "Direct application of $PE_g = mgh$ with floor as reference."
        },
        {
          "title": "Change in Potential Energy",
          "problem": "A 0.5 kg bird flies from a branch 4 m above the ground to a higher branch 10 m above the ground. What is the change in its gravitational potential energy?",
          "step_by_step": [
            {
              "step": "Calculate initial PE",
              "explanation": "$PE_i = mgh_i = 0.5 \\times 9.8 \\times 4 = 19.6$ J"
            },
            {
              "step": "Calculate final PE",
              "explanation": "$PE_f = mgh_f = 0.5 \\times 9.8 \\times 10 = 49$ J"
            },
            {
              "step": "Find change",
              "explanation": "$\\Delta PE = PE_f - PE_i = 49 - 19.6 = 29.4$ J"
            }
          ],
          "final_answer": "$29.4$ J",
          "concept_applied": "Change in PE depends only on change in height, not on reference point."
        },
        {
          "title": "Work to Lift an Object",
          "problem": "How much work is required to lift a 25 kg crate from the floor to a platform 1.8 m high at constant speed?",
          "step_by_step": [
            {
              "step": "Recognize that work equals change in PE",
              "explanation": "Lifting at constant speed means applied force equals weight, so work = force × distance = $mg\\Delta h = \\Delta PE$."
            },
            {
              "step": "Calculate",
              "explanation": "$W = 25 \\times 9.8 \\times 1.8 = 441$ J"
            }
          ],
          "final_answer": "$441$ J",
          "concept_applied": "Work done against gravity stores as gravitational potential energy."
        },
        {
          "title": "Negative Potential Energy",
          "problem": "A 2 kg stone is at the bottom of a well, 6 m below ground level. Taking ground level as $h=0$, find its gravitational potential energy.",
          "step_by_step": [
            {
              "step": "Define height",
              "explanation": "$h = -6$ m (below reference)"
            },
            {
              "step": "Apply $PE = mgh$",
              "explanation": "$PE = 2 \\times 9.8 \\times (-6) = -117.6$ J"
            }
          ],
          "final_answer": "$-117.6$ J",
          "concept_applied": "Potential energy can be negative; the sign indicates position relative to reference."
        }
      ],
      "image": {
        "src": "images/unit6/gravitational_pe_examples.png",
        "alt": "Examples showing objects at different heights and their potential energies, with reference level choices",
        "caption": "Gravitational potential energy depends on the chosen reference level; only changes matter."
      }
    },
    {
      "section_title": "Conservation of Mechanical Energy Preview",
      "introduction": "Gravitational potential energy is a form of potential energy that can convert to kinetic energy and vice versa. In the absence of non‑conservative forces like friction, the total mechanical energy (KE + PE) remains constant.",
      "key_concept": {
        "definition": "Mechanical energy $E = KE + PE_g$ is conserved when only conservative forces (like gravity) do work. This means $\\frac{1}{2}mv_i^2 + mgh_i = \\frac{1}{2}mv_f^2 + mgh_f$.",
        "context": "This powerful principle allows solving many problems without knowing forces or time. It will be developed fully in section 6.7, but the preview shows how gravitational PE fits into the bigger picture."
      },
      "worked_examples": [
        {
          "title": "Energy Conservation (Preview)",
          "problem": "A 0.2 kg ball is dropped from a height of 5 m. Use energy conservation to find its speed just before hitting the ground. (Ignore air resistance.)",
          "step_by_step": [
            {
              "step": "Set reference at ground level",
              "explanation": "At top: $KE_i = 0$, $PE_i = mgh = 0.2 \\times 9.8 \\times 5 = 9.8$ J. At bottom: $PE_f = 0$, $KE_f = \\frac{1}{2}mv^2$."
            },
            {
              "step": "Apply conservation of energy",
              "explanation": "$KE_i + PE_i = KE_f + PE_f$ → $0 + 9.8 = \\frac{1}{2}(0.2)v^2 + 0$"
            },
            {
              "step": "Solve for $v$",
              "explanation": "$9.8 = 0.1 v^2$ → $v^2 = 98$ → $v = \\sqrt{98} = 9.9$ m/s"
            }
          ],
          "final_answer": "$9.9$ m/s",
          "concept_applied": "Gravitational potential energy converts entirely to kinetic energy in free fall."
        }
      ]
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with gravitational potential energy.",
      "classifications": [
        {
          "type": "Forgetting That $h$ Is Relative",
          "value": "Using an absolute height without specifying or understanding the reference point",
          "characteristics": [
            "Thinking $PE = mgh$ always gives a positive value",
            "Not realizing that $h$ can be negative",
            "Changing reference point mid‑problem"
          ],
          "behavior": "Always define your reference level clearly and use it consistently throughout a problem. Only changes in height matter.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says $PE$ at bottom of a well is positive because height is always positive."
            },
            {
              "process": "Correct",
              "explanation": "$h$ is measured from reference; below reference gives negative $h$ and negative $PE$."
            }
          ]
        },
        {
          "type": "Confusing $g$ with $G$",
          "value": "Mixing up the acceleration due to gravity $g$ with the gravitational constant $G$",
          "characteristics": [
            "Using $G = 9.8 \\times 10^{-11}$",
            "Using $g = 6.67 \\times 10^{-11}$"
          ],
          "behavior": "$g \\approx 9.8$ m/s² near Earth's surface; $G = 6.67 \\times 10^{-11}$ N·m²/kg² is the universal gravitational constant. They are different.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student writes $PE = m(6.67 \\times 10^{-11})h$."
            },
            {
              "process": "Correct",
              "explanation": "$PE = mgh$ with $g = 9.8$ m/s²."
            }
          ]
        },
        {
          "type": "Using $mgh$ for Non‑constant $g$",
          "value": "Applying $PE = mgh$ where $g$ varies significantly (e.g., high altitudes or space)",
          "characteristics": [
            "Using $mgh$ for satellite problems",
            "Not recognizing that $PE = mgh$ is an approximation for near‑Earth surface"
          ],
          "behavior": "For large height changes, the more general formula $PE = -GMm/r$ must be used. $mgh$ is valid only when $g$ is approximately constant.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses $mgh$ to find potential energy of a satellite at 300 km altitude."
            },
            {
              "process": "Correct",
              "explanation": "Use $PE = -GMm/r$ for accurate results; $mgh$ would give an approximate value but is not accurate for precise work."
            }
          ]
        },
        {
          "type": "Sign Errors in Energy Conservation",
          "value": "Writing $PE_i + KE_i = PE_f + KE_f$ but forgetting that $PE$ can be negative",
          "characteristics": [
            "Dropping negative signs",
            "Not including all terms"
          ],
          "behavior": "When using energy conservation, include all forms of energy with their correct signs. Gravitational PE can be negative; include it properly.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "For an object launched upward from a well, student forgets that initial PE is negative if reference is at ground."
            },
            {
              "process": "Correct",
              "explanation": "Write $\\frac{1}{2}mv_i^2 + mgh_i = \\frac{1}{2}mv_f^2 + mgh_f$ with $h_i$ possibly negative."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/gravitational_pe_mistakes.png",
        "alt": "Common mistakes: forgetting h is relative, confusing g and G, using mgh where not valid",
        "caption": "Avoid these common errors when working with gravitational potential energy."
      }
    }
  ],
  "key_terms": [
    "Gravitational Potential Energy",
    "$PE_g = mgh$",
    "Reference Level",
    "Height",
    "Work Against Gravity",
    "Conservative Force",
    "Mechanical Energy",
    "Energy Conservation"
  ],
  "summary": "Gravitational potential energy near Earth's surface is given by $PE_g = mgh$, where $h$ is the height above a chosen reference level. The reference level is arbitrary; only changes in potential energy are physically meaningful. Potential energy can be positive (above reference), zero (at reference), or negative (below reference). The work done to lift an object against gravity at constant speed equals the increase in its gravitational potential energy. Gravitational PE is a form of potential energy that, along with kinetic energy, makes up mechanical energy. In the absence of non‑conservative forces, mechanical energy is conserved: $KE_i + PE_i = KE_f + PE_f$. Common mistakes include forgetting that $h$ is relative, confusing $g$ with $G$, using $mgh$ where $g$ is not constant, and sign errors in energy conservation. Understanding gravitational potential energy is essential for analyzing motion under gravity and energy transformations."
}
