{
  "expanded_description": "This section explores the concept of positive and negative work, building on the definition of work as $W = Fd \\cos \\theta$. The sign of work indicates the direction of energy transfer: positive work adds energy to an object, while negative work removes energy. Understanding when work is positive, negative, or zero is crucial for applying the work-energy theorem and analyzing energy transformations.",
  "core_concept": {
    "principle": "The sign of work is determined by the angle between the force and the displacement: positive when $0° \\le \\theta < 90°$, negative when $90° < \\theta \\le 180°$, and zero when $\\theta = 90°$. Positive work increases the object's kinetic energy; negative work decreases it.",
    "explanation": "Work is a scalar that can be positive, negative, or zero. A force that has a component in the direction of motion does positive work, transferring energy to the object. A force that opposes the motion does negative work, removing energy. Forces perpendicular to motion do no work, leaving the object's speed unchanged.",
    "image": {
      "src": "images/unit6/positive_negative_work.png",
      "alt": "Diagrams showing force and displacement for positive work (θ < 90°), negative work (θ > 90°), and zero work (θ = 90°)",
      "caption": "The sign of work depends on the angle between force and displacement."
    }
  },
  "sections": [
    {
      "section_title": "Determining the Sign of Work",
      "introduction": "From the formula $W = Fd \\cos \\theta$, the sign of work is determined solely by $\\cos \\theta$, since $F$ and $d$ are magnitudes (always positive).",
      "key_concept": {
        "definition": "Positive work: $0° \\le \\theta < 90°$ ($\\cos \\theta > 0$). Negative work: $90° < \\theta \\le 180°$ ($\\cos \\theta < 0$). Zero work: $\\theta = 90°$ ($\\cos \\theta = 0$).",
        "context": "The sign of work tells us whether energy is being added to or removed from the system. This distinction is essential for correctly applying the work-energy theorem and understanding energy conservation."
      },
      "principles": [
        {
          "principle": "Positive Work",
          "statement": "When the force has a component in the same direction as the displacement, $\\cos \\theta > 0$, work is positive. The force does work on the object, increasing its energy.",
          "application": "A person pushing a box across the floor does positive work on the box. Gravity does positive work on a falling object.",
          "example": "A crane lifting a load: the tension force is upward, displacement upward → $\\theta = 0°$, work positive."
        },
        {
          "principle": "Negative Work",
          "statement": "When the force has a component opposite to the displacement, $\\cos \\theta < 0$, work is negative. The force opposes the motion, removing energy from the object.",
          "application": "Friction acting on a sliding box does negative work. Gravity does negative work on an object thrown upward (while rising).",
          "example": "A car braking: the friction force from the brakes opposes the forward motion → $\\theta = 180°$, work negative."
        },
        {
          "principle": "Zero Work",
          "statement": "When the force is perpendicular to the displacement, $\\cos \\theta = 0$, no work is done. The force does not change the object's speed, only its direction.",
          "application": "Centripetal force in uniform circular motion does zero work. A person carrying a heavy box at constant height while walking horizontally: the upward force does zero work because displacement is horizontal.",
          "example": "A satellite in circular orbit: gravity is perpendicular to instantaneous displacement → $W = 0$."
        }
      ],
      "classifications": [
        {
          "type": "Common Examples of Work Signs",
          "value": "Everyday situations",
          "characteristics": [
            "Positive: pushing, lifting, throwing, exploding",
            "Negative: friction, air resistance, braking, catching",
            "Zero: holding stationary, carrying horizontally, circular motion"
          ],
          "behavior": "Identifying the sign of work helps in energy analysis: positive work increases kinetic energy, negative work decreases it.",
          "examples": [
            {
              "process": "Positive work examples",
              "explanation": "A bat hitting a ball, a rocket engine thrusting, gravity on a falling object."
            },
            {
              "process": "Negative work examples",
              "explanation": "Friction stopping a sliding block, air resistance on a moving car, a parachute slowing a skydiver."
            },
            {
              "process": "Zero work examples",
              "explanation": "A book resting on a table (no displacement), a planet orbiting a star (gravity perpendicular to velocity)."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Work Sign",
          "problem": "For each scenario, state whether the work done by the specified force is positive, negative, or zero: (a) Gravity on a ball thrown upward, (b) Gravity on a ball falling downward, (c) Friction on a box sliding to rest, (d) Tension on a bucket swung in a horizontal circle, (e) Normal force on a person standing still.",
          "step_by_step": [
            {
              "step": "Scenario (a)",
              "explanation": "Ball thrown upward: displacement upward, gravity downward → $\\theta = 180°$ → negative work."
            },
            {
              "step": "Scenario (b)",
              "explanation": "Ball falling: displacement downward, gravity downward → $\\theta = 0°$ → positive work."
            },
            {
              "step": "Scenario (c)",
              "explanation": "Friction on sliding box: friction opposes motion → $\\theta = 180°$ → negative work."
            },
            {
              "step": "Scenario (d)",
              "explanation": "Tension in horizontal circle: tension is centripetal, perpendicular to instantaneous displacement → $\\theta = 90°$ → zero work."
            },
            {
              "step": "Scenario (e)",
              "explanation": "Normal force on stationary person: displacement = 0 → zero work (since d=0)."
            }
          ],
          "final_answer": "(a) negative, (b) positive, (c) negative, (d) zero, (e) zero",
          "concept_applied": "Work sign depends on the angle between force and displacement, and requires displacement to be nonzero."
        },
        {
          "title": "Calculating Net Work with Positive and Negative Contributions",
          "problem": "A 10 kg box is pulled 5 m across a rough floor by a horizontal force of 50 N. The friction force is 20 N. Find the net work done on the box.",
          "step_by_step": [
            {
              "step": "Work by applied force",
              "explanation": "$W_{app} = F_{app} \\cdot d = 50 \\times 5 = 250$ J (positive)."
            },
            {
              "step": "Work by friction",
              "explanation": "$W_{fric} = f \\cdot d \\cdot \\cos 180° = 20 \\times 5 \\times (-1) = -100$ J."
            },
            {
              "step": "Net work",
              "explanation": "$W_{net} = W_{app} + W_{fric} = 250 + (-100) = 150$ J."
            }
          ],
          "final_answer": "$150$ J",
          "concept_applied": "Net work is the algebraic sum of positive and negative work from all forces."
        },
        {
          "title": "Work by Gravity on an Object Thrown Upward",
          "problem": "A 0.5 kg ball is thrown upward with an initial speed of 15 m/s. How much work does gravity do on the ball from the throw point to the highest point?",
          "step_by_step": [
            {
              "step": "Find displacement (height) using kinematics",
              "explanation": "At highest point, $v=0$. $v_f^2 = v_i^2 + 2a\\Delta y$ → $0 = (15)^2 + 2(-9.8)\\Delta y$ → $\\Delta y = 225/(19.6) = 11.48$ m upward."
            },
            {
              "step": "Work by gravity",
              "explanation": "Gravity force $mg$ downward, displacement upward → $\\theta = 180°$, $W = -mg\\Delta y = -0.5 \\times 9.8 \\times 11.48 = -56.2$ J."
            }
          ],
          "final_answer": "$-56.2$ J",
          "concept_applied": "Gravity does negative work when an object rises, removing kinetic energy."
        }
      ],
      "image": {
        "src": "images/unit6/work_sign_examples.png",
        "alt": "Illustrations of positive work (pushing), negative work (braking), zero work (carrying horizontally)",
        "caption": "Positive work adds energy, negative work removes energy, zero work leaves energy unchanged."
      }
    },
    {
      "section_title": "Energy Transfer and Work Sign",
      "introduction": "The sign of work directly indicates whether energy is transferred to or from an object. This is a key idea that leads to the work-energy theorem.",
      "key_concept": {
        "definition": "Positive work means that energy is transferred to the object, increasing its kinetic energy. Negative work means that energy is transferred from the object, decreasing its kinetic energy. Zero work means no energy transfer occurs via that force.",
        "context": "When multiple forces act, the net work is the total energy transfer. This principle is formalized in the work-energy theorem: $W_{net} = \\Delta KE$."
      },
      "principles": [
        {
          "principle": "Positive Work Increases Energy",
          "statement": "If the net work on an object is positive, its kinetic energy increases. This happens when the net force has a component in the direction of motion.",
          "application": "A car accelerating: engine force does positive work, increasing KE.",
          "example": "A ball dropped: gravity does positive work, KE increases."
        },
        {
          "principle": "Negative Work Decreases Energy",
          "statement": "If the net work is negative, kinetic energy decreases. This happens when the net force opposes the motion.",
          "application": "A car braking: friction does negative work, KE decreases.",
          "example": "A ball thrown upward: gravity does negative work while rising, KE decreases."
        },
        {
          "principle": "Zero Work Leaves Energy Unchanged",
          "statement": "If no net work is done, kinetic energy remains constant. This occurs either when no forces act (or they cancel) or when forces are perpendicular to motion.",
          "application": "Uniform circular motion: centripetal force does zero work, speed constant.",
          "example": "An object sliding at constant velocity on frictionless ice: no net work, KE constant."
        }
      ]
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when dealing with positive and negative work.",
      "classifications": [
        {
          "type": "Assuming All Forces Do Positive Work",
          "value": "Thinking that any force acting on a moving object must do positive work",
          "characteristics": [
            "Ignoring the angle between force and displacement",
            "Not recognizing dissipative forces like friction"
          ],
          "behavior": "Always consider the direction of the force relative to displacement. Friction, air resistance, and other opposing forces do negative work.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says friction on a sliding box does positive work because it's a force and the box is moving."
            },
            {
              "process": "Correct",
              "explanation": "Friction opposes motion, so the angle is 180°, giving negative work."
            }
          ]
        },
        {
          "type": "Confusing Work Sign with Force Sign in 1D",
          "value": "Thinking that a negative force always does negative work",
          "characteristics": [
            "If a force is negative (e.g., -10 N) and displacement is positive, work could be negative or positive? Actually $W = F \\cdot d$ if they are along same line. Negative force times positive displacement gives negative work. But if both are negative, work is positive."
          ],
          "behavior": "In one dimension, work is $W = F \\cdot d$ where $F$ and $d$ are signed quantities along the axis. The sign of $F$ times sign of $d$ gives sign of work. This is equivalent to $Fd\\cos\\theta$ with $\\theta$ being 0° or 180°.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Force = -5 N, displacement = -3 m, student says work = -15 J (should be +15 J because both negative, so they are in same direction)."
            },
            {
              "process": "Correct",
              "explanation": "$W = (-5) \\times (-3) = 15$ J, positive."
            }
          ]
        },
        {
          "type": "Forgetting That Zero Displacement Means Zero Work",
          "value": "Trying to assign work sign when $d=0$",
          "characteristics": [
            "Saying work is positive or negative even though no displacement occurs"
          ],
          "behavior": "If an object doesn't move, no work is done by any force, regardless of their magnitudes. Work requires displacement.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "A person pushing against a wall: student says work is negative because force is opposed."
            },
            {
              "process": "Correct",
              "explanation": "$d=0$, so $W=0$."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/positive_negative_mistakes.png",
        "alt": "Common mistakes: assuming all forces do positive work, sign confusion in 1D, forgetting zero displacement",
        "caption": "Avoid these common errors when determining the sign of work."
      }
    }
  ],
  "key_terms": [
    "Positive Work",
    "Negative Work",
    "Zero Work",
    "Energy Transfer",
    "Force Component",
    "Angle",
    "Cos θ",
    "Dissipative Force",
    "Work-Energy Theorem (preview)"
  ],
  "summary": "The sign of work is determined by the angle between the force and displacement: positive for $\\theta < 90°$, negative for $\\theta > 90°$, zero for $\\theta = 90°$. Positive work adds energy to an object, increasing its kinetic energy; negative work removes energy, decreasing kinetic energy; zero work leaves kinetic energy unchanged. Common examples: pushing (positive work), friction (negative work), circular motion (zero work). When multiple forces act, net work is the algebraic sum of individual works. Mistakes to avoid include assuming all forces do positive work, sign errors in one-dimensional calculations, and forgetting that work requires displacement. Understanding work sign is essential for the work-energy theorem and energy analysis."
}
