{
  "expanded_description": "This section introduces power, the rate at which work is done or energy is transferred. Power tells us not just how much work is done, but how quickly it is done. It is a scalar quantity that is crucial for understanding the performance of engines, machines, and any system that transfers energy over time. The SI unit of power is the watt (W), where one watt equals one joule per second.",
  "core_concept": {
    "principle": "Power is the rate at which work is done or energy is transferred. Average power is $P_{avg} = \\frac{W}{\\Delta t} = \\frac{\\Delta E}{\\Delta t}$, where $W$ is work, $\\Delta E$ is energy transfer, and $\\Delta t$ is the time interval. Instantaneous power is $P = \\frac{dW}{dt}$. For a constant force acting in the direction of motion, power can also be expressed as $P = Fv$, where $v$ is the speed.",
    "explanation": "Power distinguishes between doing a large amount of work slowly and doing it quickly. A person can do the same work climbing stairs by walking slowly or running quickly, but the power output is much greater when running. This concept is essential in engineering (engine power ratings), biology (metabolic power), and everyday life (light bulb wattage). The formula $P = Fv$ is particularly useful when the force and speed are constant or when we need instantaneous power.",
    "image": {
      "src": "images/unit6/power_intro.png",
      "alt": "Comparison of two people climbing stairs: one walking slowly, one running, with power output indicated",
      "caption": "Power measures how quickly work is done; the runner has higher power output even though both do the same work."
    }
  },
  "sections": [
    {
      "section_title": "What is Power?",
      "introduction": "In physics, power is the rate at which work is done or energy is transferred. It answers the question: how fast is energy being converted from one form to another, or how fast is work being done?",
      "key_concept": {
        "definition": "Average power $P_{avg}$ is the work done $W$ divided by the time interval $\\Delta t$: $P_{avg} = \\frac{W}{\\Delta t}$. It can also be expressed as the rate of energy transfer: $P_{avg} = \\frac{\\Delta E}{\\Delta t}$. The SI unit of power is the watt (W), where $1\\,\\text{W} = 1\\,\\text{J}/\\text{s}$.",
        "context": "Power is a scalar quantity. It tells us how quickly energy is being used or produced. A 100 W light bulb converts 100 joules of electrical energy into light and heat every second. A car engine rated at 200 horsepower can do work much faster than a human."
      },
      "principles": [
        {
          "principle": "Power Depends on Time",
          "statement": "The same amount of work done in less time requires greater power. Power is inversely proportional to the time interval for a given amount of work.",
          "application": "When comparing machines or people, power ratings indicate how quickly they can do work.",
          "example": "Lifting a 100 kg weight 2 m requires about 1960 J of work. Doing it in 2 s requires $P = 1960/2 = 980$ W; doing it in 10 s requires only $1960/10 = 196$ W."
        },
        {
          "principle": "Power and Velocity",
          "statement": "For a constant force acting in the direction of motion, power can be written as $P = Fv$, where $v$ is the speed. This follows from $P = W/t = (F \\cdot d)/t = F(d/t) = Fv$.",
          "application": "This form is useful when force and speed are constant or when finding instantaneous power. It shows that for a given force, more power is needed to maintain a higher speed.",
          "example": "A car engine must provide more power to maintain a constant speed of 30 m/s against air resistance than to maintain 20 m/s, because the force may also increase with speed."
        },
        {
          "principle": "Units of Power",
          "statement": "The SI unit is the watt (W). Other common units include horsepower (hp), where $1\\,\\text{hp} = 746\\,\\text{W}$, and kilowatt (kW), where $1\\,\\text{kW} = 1000\\,\\text{W}$.",
          "application": "Engine power is often rated in horsepower; electrical devices are rated in watts or kilowatts.",
          "example": "A 2.0 hp motor has power $2.0 \\times 746 = 1492$ W, about 1.5 kW."
        }
      ],
      "classifications": [
        {
          "type": "Average vs. Instantaneous Power",
          "value": "Two ways to specify power",
          "characteristics": [
            "Average power: total work divided by total time, $P_{avg} = W/\\Delta t$",
            "Instantaneous power: power at a specific moment, $P = dW/dt = Fv$ (for force in direction of motion)"
          ],
          "behavior": "Average power gives an overall measure; instantaneous power can vary with time. For constant force and constant speed, they are equal.",
          "examples": [
            {
              "process": "Average power",
              "explanation": "A weightlifter does 2000 J of work in 3 s: $P_{avg} = 2000/3 \\approx 667$ W."
            },
            {
              "process": "Instantaneous power",
              "explanation": "A car moving at 20 m/s with a driving force of 500 N has instantaneous power $P = 500 \\times 20 = 10,\\!000$ W = 10 kW."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Average Power",
          "problem": "A motor lifts a 50 kg crate to a height of 12 m in 8 seconds at constant speed. What is the average power output of the motor? ($g = 9.8$ m/s²)",
          "step_by_step": [
            {
              "step": "Find work done by motor",
              "explanation": "Work = force × distance = weight × height = $mgh = 50 \\times 9.8 \\times 12 = 5880$ J."
            },
            {
              "step": "Calculate average power",
              "explanation": "$P_{avg} = W / t = 5880 / 8 = 735$ W."
            }
          ],
          "final_answer": "$735$ W",
          "concept_applied": "Average power is total work divided by time."
        },
        {
          "title": "Power from Force and Velocity",
          "problem": "A car experiences a total resistive force (friction + air resistance) of 800 N at a speed of 25 m/s. What power must the engine deliver to maintain this constant speed?",
          "step_by_step": [
            {
              "step": "Use $P = Fv$",
              "explanation": "To maintain constant speed, the engine force must equal the resistive force: $F = 800$ N."
            },
            {
              "step": "Calculate power",
              "explanation": "$P = 800 \\times 25 = 20,\\!000$ W = 20 kW."
            }
          ],
          "final_answer": "$20$ kW",
          "concept_applied": "For constant speed, power = force × speed."
        },
        {
          "title": "Finding Time from Power and Work",
          "problem": "A 1500 W electric motor is used to lift a 200 kg mass at constant speed. How long will it take to lift the mass 15 m? ($g = 9.8$ m/s²)",
          "step_by_step": [
            {
              "step": "Find work required",
              "explanation": "$W = mgh = 200 \\times 9.8 \\times 15 = 29,\\!400$ J."
            },
            {
              "step": "Use $P = W/t$ to solve for $t$",
              "explanation": "$t = W/P = 29,\\!400 / 1500 = 19.6$ s."
            }
          ],
          "final_answer": "$19.6$ s",
          "concept_applied": "Rearrange power formula to find time given power and work."
        },
        {
          "title": "Power Output of a Person",
          "problem": "A 70 kg person runs up a flight of stairs, rising 4 m vertically in 5 seconds. What is the person's average power output?",
          "step_by_step": [
            {
              "step": "Work done against gravity",
              "explanation": "$W = mgh = 70 \\times 9.8 \\times 4 = 2744$ J."
            },
            {
              "step": "Average power",
              "explanation": "$P = 2744 / 5 = 548.8$ W."
            }
          ],
          "final_answer": "$549$ W (about 0.74 hp)",
          "concept_applied": "Human power output can be calculated from work done climbing stairs."
        },
        {
          "title": "Power and Efficiency (Preview)",
          "problem": "A pump lifts 300 kg of water per minute from a well 20 m deep. What is the minimum power output required? ($g = 9.8$ m/s²)",
          "step_by_step": [
            {
              "step": "Work per minute",
              "explanation": "Work to lift 300 kg = $mgh = 300 \\times 9.8 \\times 20 = 58,\\!800$ J."
            },
            {
              "step": "Convert time to seconds",
              "explanation": "Time = 1 minute = 60 s."
            },
            {
              "step": "Average power",
              "explanation": "$P = 58,\\!800 / 60 = 980$ W."
            }
          ],
          "final_answer": "$980$ W",
          "concept_applied": "Minimum power is work per time; actual power would be higher if pump is not 100% efficient."
        }
      ],
      "image": {
        "src": "images/unit6/power_examples.png",
        "alt": "Examples of power: car engine, light bulb, person running upstairs",
        "caption": "Power ratings tell us how quickly energy is transferred in various devices and activities."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with power.",
      "classifications": [
        {
          "type": "Confusing Power with Work or Energy",
          "value": "Thinking power is the same as work or energy",
          "characteristics": [
            "Using units of joules when watts are appropriate",
            "Not distinguishing between energy (J) and power (W)"
          ],
          "behavior": "Work and energy are measured in joules; power is the rate at which work is done or energy is transferred, measured in watts (J/s). They are different quantities.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a 100 W light bulb uses 100 J per hour (should be per second)."
            },
            {
              "process": "Correct",
              "explanation": "100 W means 100 J of energy transferred per second."
            }
          ]
        },
        {
          "type": "Using $P = Fv$ Incorrectly",
          "value": "Applying $P = Fv$ when force and velocity are not in the same direction, or when force is not constant",
          "characteristics": [
            "Using $P = Fv$ where $F$ is not the force in the direction of motion",
            "Using average values inappropriately"
          ],
          "behavior": "The formula $P = Fv$ is valid for instantaneous power when $F$ is the component of force in the direction of velocity. For varying forces, use $P = \\vec{F} \\cdot \\vec{v}$.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "A force of 100 N at 60° to the direction of motion, speed 5 m/s. Student calculates $P = 100 \\times 5 = 500$ W."
            },
            {
              "process": "Correct",
              "explanation": "$P = Fv\\cos\\theta = 100 \\times 5 \\times \\cos60° = 100 \\times 5 \\times 0.5 = 250$ W."
            }
          ]
        },
        {
          "type": "Forgetting Unit Conversions",
          "value": "Mixing units (e.g., using minutes instead of seconds, horsepower without converting)",
          "characteristics": [
            "Using time in minutes without converting to seconds",
            "Using hp directly in formulas expecting watts"
          ],
          "behavior": "Always convert to consistent SI units: time in seconds, work in joules, power in watts. If power is given in hp, convert to watts ($1\\,\\text{hp} = 746\\,\\text{W}$) before calculations.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Work = 6000 J, time = 2 minutes, student calculates $P = 6000/2 = 3000$ W."
            },
            {
              "process": "Correct",
              "explanation": "Convert 2 min = 120 s, $P = 6000/120 = 50$ W."
            }
          ]
        },
        {
          "type": "Confusing Average and Instantaneous Power",
          "value": "Using average power when instantaneous is needed, or vice versa",
          "characteristics": [
            "Applying $P = Fv$ to find average power when force or speed varies",
            "Using $P = W/t$ when instantaneous power at a specific moment is required"
          ],
          "behavior": "Average power is total work divided by total time. Instantaneous power is $P = dW/dt = Fv$ (at an instant). Choose the appropriate form based on the problem.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Car accelerates from rest; student uses $P = Fv$ with final $v$ and calls it average power."
            },
            {
              "process": "Correct",
              "explanation": "Average power is total work / total time; instantaneous power varies during acceleration."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/power_mistakes.png",
        "alt": "Common mistakes: confusing power with energy, wrong use of P = Fv, unit errors",
        "caption": "Avoid these common errors when working with power."
      }
    }
  ],
  "key_terms": [
    "Power",
    "Watt",
    "Kilowatt",
    "Horsepower",
    "Average Power",
    "Instantaneous Power",
    "Rate of Energy Transfer",
    "$P = W/t$",
    "$P = Fv$",
    "Work",
    "Time"
  ],
  "summary": "Power is the rate at which work is done or energy is transferred: $P = W/\\Delta t = \\Delta E/\\Delta t$. The SI unit is the watt (W), where $1\\,\\text{W} = 1\\,\\text{J}/\\text{s}$. Other common units include horsepower ($1\\,\\text{hp} = 746\\,\\text{W}$) and kilowatt ($1\\,\\text{kW} = 1000\\,\\text{W}$). For a constant force in the direction of motion, power can also be expressed as $P = Fv$, where $v$ is speed. Average power considers total work over a time interval; instantaneous power is the rate at a specific moment. Applications include determining the power output of motors, engines, and humans. Common mistakes include confusing power with energy (watts vs. joules), misapplying $P = Fv$ when force and velocity are not aligned, unit conversion errors, and confusing average with instantaneous power. Understanding power is essential for comparing the performance of energy‑transfer systems and for analyzing efficiency (next section)."
}
