{
  "expanded_description": "This section introduces the work‑energy theorem, a fundamental principle that connects work and kinetic energy. It states that the net work done on an object equals its change in kinetic energy. This theorem provides a powerful alternative to Newton's laws for solving problems involving forces and motion, especially when forces are not constant or when we are interested in speed changes over a distance.",
  "core_concept": {
    "principle": "The work‑energy theorem states that the net work done on an object equals the change in its kinetic energy: $W_{\\text{net}} = \\Delta KE = \\frac{1}{2}mv_f^2 - \\frac{1}{2}mv_i^2$.",
    "explanation": "This theorem is derived directly from Newton's second law and the definition of work. It simplifies many problems by focusing on energy transfer rather than forces and accelerations. The theorem holds for any force, constant or variable, as long as work is properly calculated. It also reveals that kinetic energy is the capacity to do work: an object with kinetic energy can do work on another object as it comes to rest.",
    "image": {
      "src": "images/unit6/work_energy_theorem.png",
      "alt": "Diagram showing a force doing work on an object, causing its speed to increase, with the relationship W_net = ΔKE highlighted",
      "caption": "The net work done on an object equals its change in kinetic energy."
    }
  },
  "sections": [
    {
      "section_title": "The Work‑Energy Theorem",
      "introduction": "The work‑energy theorem provides a direct link between the work done by all forces acting on an object and the resulting change in its kinetic energy. It is a powerful tool for analyzing motion without needing to compute accelerations or times.",
      "key_concept": {
        "definition": "$W_{\\text{net}} = \\Delta KE = KE_f - KE_i = \\frac{1}{2}mv_f^2 - \\frac{1}{2}mv_i^2$, where $W_{\\text{net}}$ is the total work done by all forces acting on the object (the sum of work done by each force).",
        "context": "This theorem is valid for any situation where the object can be treated as a point mass (no rotation) and where the work is calculated correctly. It is especially useful when forces are not constant, because work can be found from the area under a force‑displacement graph, or when we only need final speed and not the details of the motion."
      },
      "principles": [
        {
          "principle": "Derivation from Newton's Second Law",
          "statement": "For constant net force in one dimension, $F_{\\text{net}} = ma$, and using $v_f^2 = v_i^2 + 2a\\Delta x$, we get $F_{\\text{net}} \\Delta x = m \\cdot \\frac{1}{2}(v_f^2 - v_i^2) = \\frac{1}{2}mv_f^2 - \\frac{1}{2}mv_i^2$. The left side is the net work, the right side is the change in kinetic energy. This derivation can be extended to variable forces using calculus.",
          "application": "The derivation shows why the theorem works: it is essentially the integral form of Newton's second law over distance.",
          "example": "For a constant net force of 10 N acting on a 2 kg object over 5 m, net work = 50 J, so $\\Delta KE = 50$ J."
        },
        {
          "principle": "Interpretation",
          "statement": "Positive net work increases kinetic energy; negative net work decreases kinetic energy; zero net work leaves kinetic energy unchanged.",
          "application": "This aligns with the sign conventions for work: positive work adds energy, negative work removes energy.",
          "example": "A car braking: friction does negative net work, reducing kinetic energy."
        },
        {
          "principle": "Work Done by Individual Forces",
          "statement": "The net work is the algebraic sum of the work done by each force. We can compute the work of each force separately and add them (with signs) to get $W_{\\text{net}}$.",
          "application": "This allows us to analyze complex situations by considering each force independently.",
          "example": "A box being pulled across a rough floor: work by tension positive, work by friction negative, work by gravity and normal force zero; sum gives net work."
        }
      ],
      "classifications": [
        {
          "type": "Applications",
          "value": "Typical uses of the work‑energy theorem",
          "characteristics": [
            "Finding final speed given forces and displacement",
            "Finding stopping distance under friction",
            "Solving problems where forces are not constant (e.g., springs)",
            "Determining work needed to change speed"
          ],
          "behavior": "The theorem bypasses the need to find acceleration or time. It directly relates work to speed change.",
          "examples": [
            {
              "process": "Stopping distance",
              "explanation": "A car of mass $m$ with initial speed $v_i$ brakes with constant friction force $f$. Work by friction = $-f d$. Set $-f d = 0 - \\frac{1}{2}mv_i^2$ → $d = \\frac{mv_i^2}{2f}$."
            },
            {
              "process": "Variable force (spring)",
              "explanation": "A mass attached to a spring: work done by spring from $x_i$ to $x_f$ is $\\frac{1}{2}kx_i^2 - \\frac{1}{2}kx_f^2$. Equate to change in KE to find speed."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Using Work‑Energy to Find Final Speed",
          "problem": "A 5 kg box initially at rest is pulled 10 m across a frictionless horizontal surface by a constant horizontal force of 20 N. Use the work‑energy theorem to find its final speed.",
          "step_by_step": [
            {
              "step": "Calculate net work",
              "explanation": "Only the applied force does work (gravity and normal force are perpendicular, so zero). $W_{\\text{net}} = Fd = 20 \\times 10 = 200$ J."
            },
            {
              "step": "Apply work‑energy theorem",
              "explanation": "$W_{\\text{net}} = \\frac{1}{2}mv_f^2 - \\frac{1}{2}mv_i^2$. Since $v_i=0$, $200 = \\frac{1}{2}(5)v_f^2$."
            },
            {
              "step": "Solve for $v_f$",
              "explanation": "$200 = 2.5 v_f^2$ → $v_f^2 = 200/2.5 = 80$ → $v_f = \\sqrt{80} = 8.94$ m/s."
            }
          ],
          "final_answer": "$8.94$ m/s",
          "concept_applied": "Work‑energy theorem directly gives final speed without finding acceleration or time."
        },
        {
          "title": "Work‑Energy with Friction",
          "problem": "A 10 kg crate moving at 5 m/s slides to a stop on a rough floor. The coefficient of kinetic friction is 0.3. Use work‑energy to find the stopping distance.",
          "step_by_step": [
            {
              "step": "Find friction force",
              "explanation": "$f_k = \\mu_k mg = 0.3 \\times 10 \\times 9.8 = 29.4$ N."
            },
            {
              "step": "Work done by friction",
              "explanation": "Friction opposes motion, so work = $-f_k d = -29.4d$."
            },
            {
              "step": "Apply work‑energy theorem",
              "explanation": "$W_{\\text{net}} = \\Delta KE$ → $-29.4d = 0 - \\frac{1}{2}(10)(5^2) = -125$ J."
            },
            {
              "step": "Solve for $d$",
              "explanation": "$29.4d = 125$ → $d = 125/29.4 = 4.25$ m."
            }
          ],
          "final_answer": "$4.25$ m",
          "concept_applied": "Negative work reduces KE; stopping distance found directly."
        },
        {
          "title": "Work‑Energy with an Angled Force",
          "problem": "A 2 kg block is pulled 3 m along a rough horizontal surface by a force of 15 N at 30° above horizontal. The friction force is 5 N. Use work‑energy to find the block's final speed if it starts from rest.",
          "step_by_step": [
            {
              "step": "Calculate work done by applied force",
              "explanation": "$W_{app} = F d \\cos\\theta = 15 \\times 3 \\times \\cos30° = 45 \\times 0.866 = 38.97$ J."
            },
            {
              "step": "Work done by friction",
              "explanation": "$W_{fric} = -f \\times d = -5 \\times 3 = -15$ J."
            },
            {
              "step": "Work by gravity and normal force are zero",
              "explanation": "Both perpendicular to displacement."
            },
            {
              "step": "Net work",
              "explanation": "$W_{\\text{net}} = 38.97 + (-15) = 23.97$ J."
            },
            {
              "step": "Apply work‑energy",
              "explanation": "$23.97 = \\frac{1}{2}(2)v_f^2 - 0$ → $23.97 = v_f^2$ → $v_f = \\sqrt{23.97} = 4.90$ m/s."
            }
          ],
          "final_answer": "$4.90$ m/s",
          "concept_applied": "Net work is sum of works by all forces; use to find speed."
        },
        {
          "title": "Finding Work from Change in KE",
          "problem": "A 0.5 kg ball increases speed from 4 m/s to 8 m/s. How much net work was done on the ball?",
          "step_by_step": [
            {
              "step": "Calculate initial KE",
              "explanation": "$KE_i = \\frac{1}{2}(0.5)(4^2) = 0.25 \\times 16 = 4$ J."
            },
            {
              "step": "Calculate final KE",
              "explanation": "$KE_f = \\frac{1}{2}(0.5)(8^2) = 0.25 \\times 64 = 16$ J."
            },
            {
              "step": "Net work = change in KE",
              "explanation": "$W_{\\text{net}} = 16 - 4 = 12$ J."
            }
          ],
          "final_answer": "$12$ J",
          "concept_applied": "Work‑energy theorem gives net work directly from KE change."
        }
      ],
      "image": {
        "src": "images/unit6/work_energy_examples.png",
        "alt": "Illustrations of work‑energy applications: pulling a box, braking car, spring",
        "caption": "The work‑energy theorem simplifies problems involving forces over distances."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when applying the work‑energy theorem.",
      "classifications": [
        {
          "type": "Using Net Force Instead of Net Work",
          "value": "Trying to use $F_{\\text{net}} d$ without summing work from all forces",
          "characteristics": [
            "Forgetting that $W_{\\text{net}}$ is the sum of work from each force, not just the work of the net force (though for constant net force, $F_{\\text{net}} d$ equals net work if displacement is along the line of force). But careful: if forces are at angles, you must compute work individually."
          ],
          "behavior": "The net work is the total work done by all forces. For constant forces, $W_{\\text{net}} = \\sum (\\vec{F}_i \\cdot \\vec{d})$. This is not necessarily equal to $\\vec{F}_{\\text{net}} \\cdot \\vec{d}$? Actually it is equal because dot product distributes: $\\sum \\vec{F}_i \\cdot \\vec{d} = (\\sum \\vec{F}_i) \\cdot \\vec{d} = \\vec{F}_{\\text{net}} \\cdot \\vec{d}$. So it's the same. The mistake is when forces are not constant, or when we forget to include all forces.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student includes only applied force and neglects friction when calculating net work."
            },
            {
              "process": "Correct",
              "explanation": "Add work from all forces, including friction, normal, gravity, etc."
            }
          ]
        },
        {
          "type": "Confusing Work and Impulse",
          "value": "Mixing up $W = Fd$ with impulse $Ft$",
          "characteristics": [
            "Using time instead of distance",
            "Applying $Fd$ to find momentum change"
          ],
          "behavior": "Work is force times displacement; impulse is force times time. They are different and lead to different changes (KE vs momentum).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses $Ft = \\Delta KE$."
            },
            {
              "process": "Correct",
              "explanation": "$Ft = \\Delta p$, $Fd = \\Delta KE$ (if force constant and parallel)."
            }
          ]
        },
        {
          "type": "Forgetting That KE Uses Speed, Not Velocity Components",
          "value": "Plugging velocity components into KE formula separately",
          "characteristics": [
            "Calculating $\\frac{1}{2}m(v_x^2 + v_y^2)$ is actually correct because $v^2 = v_x^2+v_y^2$, so it's fine. But some might mistakenly add KE from components after already having speed? No, that's okay."
          ],
          "behavior": "No error if you compute $v$ correctly. The common error is to use $\\frac{1}{2}mv_x^2$ and call it KE, ignoring $v_y$."
        },
        {
          "type": "Incorrect Sign for Work",
          "value": "Assigning wrong sign to work, especially for friction",
          "characteristics": [
            "Treating friction work as positive",
            "Not recognizing that negative work reduces KE"
          ],
          "behavior": "Work by friction is negative when it opposes motion. This reduces KE. Make sure signs are correct when summing work.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student writes $f_k d = \\frac{1}{2}mv_f^2 - \\frac{1}{2}mv_i^2$ with $f_k d$ positive."
            },
            {
              "process": "Correct",
              "explanation": "$-f_k d = \\frac{1}{2}mv_f^2 - \\frac{1}{2}mv_i^2$."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/work_energy_mistakes.png",
        "alt": "Common mistakes: forgetting friction work, mixing impulse, sign errors",
        "caption": "Avoid these common errors when applying the work‑energy theorem."
      }
    }
  ],
  "key_terms": [
    "Work‑Energy Theorem",
    "Net Work",
    "Kinetic Energy",
    "Change in Kinetic Energy",
    "$W_{\\text{net}} = \\Delta KE$",
    "Stopping Distance",
    "Variable Force",
    "Energy Transfer"
  ],
  "summary": "The work‑energy theorem states that the net work done on an object equals its change in kinetic energy: $W_{\\text{net}} = \\Delta KE = \\frac{1}{2}mv_f^2 - \\frac{1}{2}mv_i^2$. This theorem is derived from Newton's second law and provides a powerful method for solving problems involving forces and displacement, especially when forces are not constant or when we only need initial and final speeds. Net work is the algebraic sum of the work done by all forces. Positive net work increases KE, negative decreases it, zero leaves KE unchanged. Applications include finding final speed from work, stopping distance under friction, and work done by variable forces like springs. Common mistakes include forgetting to include work from all forces, confusing work with impulse, and sign errors in work (especially for friction). Mastering the work‑energy theorem is essential for analyzing energy transformations and solving dynamics problems efficiently."
}
