{
  "expanded_description": "This section introduces the concept of work in physics, which has a precise mathematical definition different from everyday usage. Work is done when a force causes an object to undergo a displacement. The amount of work depends on the magnitude of the force, the magnitude of the displacement, and the angle between them. Understanding work is the first step toward analyzing energy transfers and transformations.",
  "core_concept": {
    "principle": "Work is the transfer of energy to an object by a force acting over a displacement. For a constant force, work is calculated as $W = \\vec{F} \\cdot \\vec{d} = Fd \\cos \\theta$, where $F$ is the force magnitude, $d$ is the displacement magnitude, and $\\theta$ is the angle between the force and displacement vectors.",
    "explanation": "Work is a scalar quantity, measured in joules (J) in the SI system. It represents the amount of energy transferred to or from an object. If the force has a component in the direction of motion, work is positive and energy is added to the object. If the force opposes the motion, work is negative and energy is removed. If the force is perpendicular to the displacement, no work is done.",
    "image": {
      "src": "images/unit6/work_intro.png",
      "alt": "Diagram showing a force applied at an angle to a displacement, with the component of force in the direction of displacement highlighted",
      "caption": "Work depends on the component of force parallel to the displacement: $W = Fd\\cos\\theta$."
    }
  },
  "sections": [
    {
      "section_title": "What is Work in Physics?",
      "introduction": "In everyday language, 'work' means any physical or mental effort. In physics, work has a very specific meaning: it is the energy transferred to or from an object by a force acting over a distance.",
      "key_concept": {
        "definition": "Work $W$ is the dot product of force $\\vec{F}$ and displacement $\\vec{d}$: $W = \\vec{F} \\cdot \\vec{d} = Fd \\cos \\theta$. It is a scalar quantity measured in joules (J), where $1\\,\\text{J} = 1\\,\\text{N}\\cdot\\text{m}$.",
        "context": "The concept of work allows us to quantify energy transfers. When you push a box across the floor, you do work on the box, transferring energy to it. When friction slows the box, friction does negative work, removing energy."
      },
      "principles": [
        {
          "principle": "Force and Displacement Are Required",
          "statement": "Work is only done when a force causes a displacement. If there is no displacement, no work is done, regardless of how much force is applied.",
          "application": "Holding a heavy object stationary requires effort, but in physics terms, no work is done because there is no displacement.",
          "example": "Pushing against a wall that doesn't move: $d=0$, so $W=0$."
        },
        {
          "principle": "Only the Force Component in the Direction of Displacement Contributes",
          "statement": "If the force is at an angle to the displacement, only the component of force parallel to the displacement does work. The perpendicular component does no work.",
          "application": "When pulling a suitcase with a strap at an angle, the vertical component of the pull does no work; only the horizontal component contributes.",
          "example": "A force of 10 N at 60° to horizontal pulling a box 2 m horizontally: $W = (10\\cos60°)(2) = (10 \\times 0.5)(2) = 10$ J."
        },
        {
          "principle": "Work is a Scalar",
          "statement": "Work has magnitude and sign, but no direction. Positive work adds energy to the system; negative work removes energy.",
          "application": "When calculating total work done on an object, add the work done by each force algebraically, considering signs.",
          "example": "If you push a box with 50 J of work and friction does -20 J of work, the net work is $50 + (-20) = 30$ J."
        }
      ],
      "classifications": [
        {
          "type": "Special Cases of Work",
          "value": "Common angle scenarios",
          "characteristics": [
            "$\\theta = 0°$: Force in same direction as displacement → $W = Fd$ (maximum positive work)",
            "$\\theta = 90°$: Force perpendicular to displacement → $W = 0$ (no work)",
            "$\\theta = 180°$: Force opposite to displacement → $W = -Fd$ (maximum negative work)"
          ],
          "behavior": "The sign of work indicates whether energy is being added to (+) or removed from (−) the object. Perpendicular forces (like centripetal force in circular motion) do no work because they don't change speed.",
          "examples": [
            {
              "process": "$\\theta = 0°$",
              "explanation": "Pushing a box horizontally across the floor: force and displacement are parallel."
            },
            {
              "process": "$\\theta = 90°$",
              "explanation": "A satellite in circular orbit: gravity is perpendicular to displacement (instantaneously), so no work is done."
            },
            {
              "process": "$\\theta = 180°$",
              "explanation": "Friction acting on a sliding box: force opposes motion, doing negative work."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Work Done by a Constant Force",
          "problem": "A 40 kg crate is pulled 5 m across a rough floor by a constant force of 100 N applied horizontally. The kinetic friction force is 60 N. Calculate (a) the work done by the applied force, (b) the work done by friction, and (c) the net work done on the crate.",
          "step_by_step": [
            {
              "step": "Work done by applied force",
              "explanation": "Applied force is horizontal, parallel to displacement. $W_{app} = F_{app} \\times d = 100 \\times 5 = 500$ J."
            },
            {
              "step": "Work done by friction",
              "explanation": "Friction opposes motion, so angle = 180°. $W_{fric} = f \\times d \\times \\cos180° = 60 \\times 5 \\times (-1) = -300$ J."
            },
            {
              "step": "Net work",
              "explanation": "$W_{net} = W_{app} + W_{fric} = 500 + (-300) = 200$ J."
            }
          ],
          "final_answer": "(a) $500$ J, (b) $-300$ J, (c) $200$ J",
          "concept_applied": "Work can be positive or negative; net work is the algebraic sum."
        },
        {
          "title": "Work Done at an Angle",
          "problem": "A person pulls a 20 kg sled with a rope at 30° above horizontal over a distance of 10 m. The tension in the rope is 50 N. How much work does the person do on the sled?",
          "step_by_step": [
            {
              "step": "Identify force, displacement, and angle",
              "explanation": "$F = 50$ N, $d = 10$ m, $\\theta = 30°$ (angle between force and horizontal displacement)."
            },
            {
              "step": "Apply work formula",
              "explanation": "$W = Fd\\cos\\theta = 50 \\times 10 \\times \\cos30° = 500 \\times 0.866 = 433$ J."
            }
          ],
          "final_answer": "$433$ J",
          "concept_applied": "Only the component of force parallel to displacement does work."
        },
        {
          "title": "Work When Force and Displacement Are Perpendicular",
          "problem": "A 5 kg object moves in a horizontal circle of radius 2 m at constant speed. The tension in the string is 40 N. How much work does the tension do over half a revolution?",
          "step_by_step": [
            {
              "step": "Analyze force and displacement",
              "explanation": "Tension is always perpendicular to the instantaneous displacement (since it's centripetal). At every instant, $\\theta = 90°$."
            },
            {
              "step": "Calculate work",
              "explanation": "$W = Fd\\cos90° = Fd \\times 0 = 0$ J."
            }
          ],
          "final_answer": "$0$ J",
          "concept_applied": "Forces perpendicular to motion do no work; they only change direction, not speed."
        }
      ],
      "image": {
        "src": "images/unit6/work_angle.png",
        "alt": "Vector diagram showing a force at angle θ to displacement, with the parallel component F cos θ highlighted",
        "caption": "Only the component of force parallel to displacement ($F\\cos\\theta$) contributes to work."
      }
    },
    {
      "section_title": "Units of Work",
      "introduction": "Work has SI units of joules, but it can also be expressed in other energy units depending on the context.",
      "key_concept": {
        "definition": "The SI unit of work is the joule (J). One joule is the work done when a force of one newton acts over a displacement of one meter in the direction of the force: $1\\,\\text{J} = 1\\,\\text{N}\\cdot\\text{m}$.",
        "context": "Other units of work/energy include the erg (cgs system), the electronvolt (eV) used in atomic physics, and the calorie (cal) used in thermal contexts. Conversions: $1\\,\\text{cal} = 4.184\\,\\text{J}$, $1\\,\\text{eV} = 1.602 \\times 10^{-19}\\,\\text{J}$."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with the concept of work.",
      "classifications": [
        {
          "type": "Confusing Work with Effort",
          "value": "Thinking that holding a heavy object stationary involves work",
          "characteristics": [
            "Applying $W = Fd$ with $d=0$ and getting nonzero",
            "Not recognizing that work requires displacement"
          ],
          "behavior": "Work is done only when there is displacement. Holding a heavy object, no matter how tiring, does zero work in the physics sense.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a person holding a 100 kg barbell does work because they are exerting force."
            },
            {
              "process": "Correct",
              "explanation": "Since the barbell is stationary, $d=0$, so $W=0$."
            }
          ]
        },
        {
          "type": "Using the Wrong Angle",
          "value": "Using the angle between force and horizontal instead of between force and displacement",
          "characteristics": [
            "Taking $\\theta$ as the angle from horizontal without checking",
            "Forgetting that $\\theta$ is the angle between $\\vec{F}$ and $\\vec{d}$"
          ],
          "behavior": "Always identify the directions of both vectors; $\\theta$ is the angle between them.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "A force of 20 N at 30° above horizontal pulls a box 5 m horizontally. Student uses $\\theta = 30°$ (correct here because displacement is horizontal, so angle between force and displacement is indeed 30°). This is actually correct. Need a better example: Suppose force is 20 N at 30° above horizontal, but displacement is up a ramp at 20°. Then angle between force and displacement is not simply 30° or 20°, but the difference. Student might mistakenly use the launch angle instead of the angle between vectors."
            },
            {
              "process": "Correct",
              "explanation": "Find the angle between $\\vec{F}$ and $\\vec{d}$ by considering their directions."
            }
          ]
        },
        {
          "type": "Sign Errors",
          "value": "Incorrectly assigning positive/negative signs to work",
          "characteristics": [
            "Treating all work as positive",
            "Not recognizing that forces opposing motion do negative work"
          ],
          "behavior": "Work is positive when the force has a component in the direction of displacement; negative when it has a component opposite. Friction always does negative work on a moving object (unless it's static friction causing motion, like a car accelerating).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says friction does positive work on a sliding box because it's a force."
            },
            {
              "process": "Correct",
              "explanation": "Friction opposes motion, so it does negative work."
            }
          ]
        },
        {
          "type": "Forgetting That Work is a Scalar",
          "value": "Trying to add work as vectors",
          "characteristics": [
            "Adding work with direction",
            "Not using algebraic sum"
          ],
          "behavior": "Work has no direction; it adds algebraically. Total work is the sum of work done by each force, with appropriate signs.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student adds 30 J of work from force A and 40 J from force B and says total is 50 J (as if they were perpendicular vectors)."
            },
            {
              "process": "Correct",
              "explanation": "Total work = $30 + 40 = 70$ J (if both positive) or $30 + (-40) = -10$ J if one negative."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit6/work_mistakes.png",
        "alt": "Common mistakes: confusing effort with work, wrong angle, sign errors",
        "caption": "Avoid these common errors when calculating work."
      }
    }
  ],
  "key_terms": [
    "Work",
    "Joule",
    "Force",
    "Displacement",
    "Dot Product",
    "Scalar",
    "Positive Work",
    "Negative Work",
    "Zero Work",
    "Angle",
    "Component"
  ],
  "summary": "Work in physics is defined as $W = Fd\\cos\\theta$, where $F$ is the magnitude of a constant force, $d$ is the magnitude of the displacement, and $\\theta$ is the angle between the force and displacement vectors. Work is a scalar quantity measured in joules (J). Positive work occurs when the force has a component in the direction of motion (energy added), negative work when the force opposes motion (energy removed), and zero work when the force is perpendicular to the displacement. Work requires both force and displacement; holding an object stationary does zero work. When multiple forces act, the net work is the algebraic sum of the work done by each force. Common mistakes include confusing physical work with everyday effort, using the wrong angle, misassigning signs, and forgetting that work is a scalar. Understanding work is essential for the work‑energy theorem and the study of energy transformations."
}
