{
  "expanded_description": "This section introduces the Bohr model of the atom, proposed by Niels Bohr in 1913. Building on Rutherford's nuclear model, Bohr incorporated quantum ideas to explain the stability of atoms and the discrete line spectra observed for hydrogen. Although the Bohr model has been superseded by quantum mechanics, it remains an important conceptual bridge between classical physics and modern quantum theory, and it correctly predicts the energy levels of hydrogen.",
  "core_concept": {
    "principle": "The Bohr model postulates that electrons orbit the nucleus in specific, allowed circular orbits without radiating energy. These orbits correspond to quantized angular momentum: $L = n\\hbar$, where $n = 1, 2, 3, \\dots$ is the principal quantum number and $\\hbar = h/2\\pi$. Electrons can jump between orbits by absorbing or emitting a photon whose energy exactly equals the difference in energy levels: $\\Delta E = hf = E_{\\text{higher}} - E_{\\text{lower}}$. For hydrogen, the energy of level $n$ is $E_n = -\\frac{13.6\\,\\text{eV}}{n^2}$.",
    "explanation": "Bohr's model resolved the instability problem of Rutherford's atom by asserting that electrons in allowed orbits do not radiate, contrary to classical electromagnetism. The quantization condition $L = n\\hbar$ selects these special orbits. When an electron jumps to a lower energy level, the energy difference is emitted as a photon, explaining the discrete spectral lines of hydrogen. The model successfully predicts the Balmer series and other hydrogen spectral lines, and it introduces the concept of quantum numbers. However, it fails for atoms with more than one electron and cannot explain the relative intensities of spectral lines or the fine structure of spectra.",
    "image": {
      "src": "images/unit10/bohr_model_diagram.png",
      "alt": "Diagram of Bohr model showing nucleus with electron orbits at quantized energy levels, and an electron transition emitting a photon",
      "caption": "In the Bohr model, electrons occupy specific energy levels; transitions between levels produce photons of discrete energies."
    }
  },
  "sections": [
    {
      "section_title": "Bohr Model",
      "introduction": "After Rutherford's discovery of the nucleus, a major puzzle remained: why don't electrons spiral into the nucleus, radiating energy as they accelerate? Classical physics predicted atoms would collapse in about $10^{-11}$ seconds. Niels Bohr, working in Rutherford's laboratory, proposed a radical solution that combined the nuclear model with the new ideas of quantum theory.",
      "key_concept": {
        "definition": "The Bohr model is a semi‑classical model of the hydrogen atom in which electrons orbit the nucleus in allowed circular orbits with quantized angular momentum. Electrons can transition between orbits by absorbing or emitting photons of specific energies. The model successfully predicts the energy levels and spectral lines of hydrogen.",
        "context": "The Bohr model was a crucial step in the development of quantum mechanics. It introduced the concept of quantized energy levels and provided a framework for understanding atomic spectra. While it has limitations, it remains a valuable pedagogical tool for introducing quantum ideas."
      },
      "classifications": [
        {
          "type": "Bohr's Postulates",
          "value": "The three key assumptions of the model",
          "characteristics": [
            "1. Electrons move in circular orbits around the nucleus under the influence of the Coulomb force, but only certain orbits are allowed.",
            "2. The allowed orbits are those where the angular momentum $L$ is quantized: $L = n\\hbar$, where $n = 1, 2, 3, \\dots$ is the principal quantum number and $\\hbar = h/2\\pi$.",
            "3. Despite accelerating, electrons in allowed orbits do not radiate energy. Radiation occurs only when an electron jumps from one allowed orbit to another, emitting or absorbing a photon of energy $\\Delta E = hf$."
          ],
          "behavior": "These postulates were radical departures from classical physics. The quantization of angular momentum selects specific orbits; the non‑radiating orbits (stationary states) explain atomic stability; and the photon emission/absorption explains discrete spectra.",
          "examples": [
            {
              "process": "Stationary states",
              "explanation": "An electron in the $n=1$ orbit (ground state) remains there indefinitely unless disturbed. It does not radiate energy, so the atom is stable."
            },
            {
              "process": "Photon emission",
              "explanation": "When an electron falls from $n=3$ to $n=2$, a photon with energy $E_3 - E_2$ is emitted, producing a specific spectral line."
            }
          ]
        },
        {
          "type": "Energy Levels of Hydrogen",
          "value": "Quantized energies derived from Bohr's model",
          "characteristics": [
            "The total energy of an electron in level $n$ is $E_n = -\\frac{13.6\\,\\text{eV}}{n^2}$",
            "The negative sign indicates a bound state (electron is trapped in the atom)",
            "As $n$ increases, energy becomes less negative, approaching zero as $n \\to \\infty$ (ionization)",
            "The ionization energy (energy to remove the electron from the ground state) is $13.6$ eV"
          ],
          "behavior": "The $1/n^2$ dependence arises from combining Coulomb's law, centripetal force, and the quantization condition. This formula accurately predicts the energy levels of hydrogen and hydrogen‑like ions (with a single electron).",
          "examples": [
            {
              "process": "Ground state ($n=1$)",
              "explanation": "$E_1 = -13.6$ eV. The electron is most tightly bound."
            },
            {
              "process": "First excited state ($n=2$)",
              "explanation": "$E_2 = -13.6/4 = -3.40$ eV. Less tightly bound."
            },
            {
              "process": "Ionization ($n \\to \\infty$)",
              "explanation": "$E_\\infty = 0$ eV, meaning the electron is free."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Photon Energy in Transitions",
          "statement": "When an electron jumps from a higher energy level $n_i$ to a lower level $n_f$, the energy of the emitted photon is $\\Delta E = E_i - E_f = 13.6\\,\\text{eV}\\left(\\frac{1}{n_f^2} - \\frac{1}{n_i^2}\\right)$. The wavelength of the photon is given by $\\lambda = \\frac{hc}{\\Delta E}$.",
          "application": "This formula predicts the wavelengths of all hydrogen spectral lines. For example, the Balmer series (transitions to $n_f = 2$) gives visible light.",
          "example": "For the transition $n=3 \\to n=2$: $\\Delta E = 13.6(1/4 - 1/9) = 13.6(0.25 - 0.111) = 13.6 \\times 0.139 = 1.89$ eV, corresponding to a red line at 656 nm."
        },
        {
          "principle": "Rydberg Formula",
          "statement": "The wavelengths of hydrogen spectral lines are given by the Rydberg formula: $\\frac{1}{\\lambda} = R\\left(\\frac{1}{n_f^2} - \\frac{1}{n_i^2}\\right)$, where $R = 1.097 \\times 10^7$ m$^{-1}$ is the Rydberg constant. This is equivalent to $\\Delta E = hc/\\lambda$.",
          "application": "The Rydberg formula was known experimentally before Bohr's model; Bohr's derivation of $R$ from fundamental constants was a major triumph.",
          "example": "For the Lyman series (transitions to $n_f = 1$), $1/\\lambda = R(1 - 1/n_i^2)$, giving ultraviolet lines."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Energy Levels",
          "problem": "Find the energy of the $n=4$ level in hydrogen. Express in eV and joules.",
          "step_by_step": [
            {
              "step": "Use $E_n = -13.6/n^2$ eV",
              "explanation": "$E_4 = -13.6/4^2 = -13.6/16 = -0.85$ eV"
            },
            {
              "step": "Convert to joules",
              "explanation": "$E_4 = -0.85 \\times 1.60 \\times 10^{-19} = -1.36 \\times 10^{-19}$ J"
            }
          ],
          "final_answer": "$E_4 = -0.85$ eV ($-1.36 \\times 10^{-19}$ J)",
          "concept_applied": "Direct application of hydrogen energy level formula."
        },
        {
          "title": "Photon Energy and Wavelength for a Transition",
          "problem": "Calculate the energy (in eV and J) and wavelength (in nm) of the photon emitted when an electron in hydrogen falls from $n=4$ to $n=2$. Identify the spectral series.",
          "step_by_step": [
            {
              "step": "Find energy difference",
              "explanation": "$\\Delta E = 13.6\\left(\\frac{1}{2^2} - \\frac{1}{4^2}\\right) = 13.6\\left(\\frac{1}{4} - \\frac{1}{16}\\right) = 13.6(0.25 - 0.0625) = 13.6 \\times 0.1875 = 2.55$ eV"
            },
            {
              "step": "Convert to joules",
              "explanation": "$\\Delta E = 2.55 \\times 1.60 \\times 10^{-19} = 4.08 \\times 10^{-19}$ J"
            },
            {
              "step": "Find wavelength using $\\lambda = hc/\\Delta E$",
              "explanation": "$hc = (6.63 \\times 10^{-34})(3.00 \\times 10^8) = 1.989 \\times 10^{-25}$ J·m\n$\\lambda = (1.989 \\times 10^{-25}) / (4.08 \\times 10^{-19}) = 4.87 \\times 10^{-7}$ m = 487 nm"
            },
            {
              "step": "Identify series",
              "explanation": "Transition ends at $n=2$, so it belongs to the Balmer series (visible light). 487 nm is blue-green light."
            }
          ],
          "final_answer": "$\\Delta E = 2.55$ eV ($4.08 \\times 10^{-19}$ J), $\\lambda = 487$ nm (Balmer series)",
          "concept_applied": "Photon energy from level difference; wavelength from $\\lambda = hc/\\Delta E$."
        },
        {
          "title": "Ionization Energy",
          "problem": "What is the ionization energy of hydrogen in eV and joules? That is, the energy required to remove an electron from the ground state ($n=1$) to infinity ($n=\\infty$).",
          "step_by_step": [
            {
              "step": "Energy at $n=\\infty$",
              "explanation": "$E_\\infty = 0$ eV"
            },
            {
              "step": "Energy at $n=1$",
              "explanation": "$E_1 = -13.6$ eV"
            },
            {
              "step": "Ionization energy $\\Delta E = E_\\infty - E_1$",
              "explanation": "$\\Delta E = 0 - (-13.6) = 13.6$ eV"
            },
            {
              "step": "Convert to joules",
              "explanation": "$13.6 \\times 1.60 \\times 10^{-19} = 2.18 \\times 10^{-18}$ J"
            }
          ],
          "final_answer": "$13.6$ eV ($2.18 \\times 10^{-18}$ J)",
          "concept_applied": "Ionization energy is the energy needed to completely remove the electron."
        },
        {
          "title": "Absorption vs. Emission",
          "problem": "A hydrogen atom in its ground state ($n=1$) absorbs a photon of wavelength 97.3 nm. To which energy level does the electron jump? Is this photon in the Lyman, Balmer, or Paschen series?",
          "step_by_step": [
            {
              "step": "Find photon energy",
              "explanation": "$E = hc/\\lambda = (6.63 \\times 10^{-34})(3.00 \\times 10^8) / (97.3 \\times 10^{-9}) = (1.989 \\times 10^{-25})/(9.73 \\times 10^{-8}) = 2.04 \\times 10^{-18}$ J"
            },
            {
              "step": "Convert to eV",
              "explanation": "$E = (2.04 \\times 10^{-18}) / (1.60 \\times 10^{-19}) = 12.75$ eV"
            },
            {
              "step": "Find final energy level",
              "explanation": "Starting from $E_1 = -13.6$ eV, final energy $E_f = E_1 + E_{\\text{photon}} = -13.6 + 12.75 = -0.85$ eV"
            },
            {
              "step": "Identify $n$ from $E_n = -13.6/n^2$",
              "explanation": "$-0.85 = -13.6/n^2$ → $n^2 = 13.6/0.85 = 16$ → $n = 4$"
            },
            {
              "step": "Series identification",
              "explanation": "The transition starts from $n=1$, so the photon is absorbed in the Lyman series (ultraviolet)."
            }
          ],
          "final_answer": "The electron jumps to $n=4$; the photon is in the Lyman series.",
          "concept_applied": "Absorption promotes an electron to a higher level; the photon must match an allowed transition."
        }
      ],
      "image": {
        "src": "images/unit10/hydrogen_spectrum.png",
        "alt": "Diagram of hydrogen energy levels with transitions shown for Lyman, Balmer, and Paschen series",
        "caption": "Hydrogen energy levels and spectral series: Lyman (UV), Balmer (visible), Paschen (infrared)."
      }
    },
    {
      "section_title": "Successes and Limitations",
      "introduction": "The Bohr model was remarkably successful for its time, but it also had significant limitations that led to the development of full quantum mechanics.",
      "classifications": [
        {
          "type": "Successes",
          "value": "What the Bohr model explained well",
          "characteristics": [
            "Explained the stability of atoms (electrons in stationary states do not radiate)",
            "Correctly predicted the hydrogen spectrum (all spectral lines)",
            "Derived the Rydberg constant from fundamental constants",
            "Introduced the concept of quantized energy levels",
            "Explained spectra of hydrogen‑like ions (He⁺, Li²⁺)"
          ],
          "behavior": "The model's predictions matched experimental data for hydrogen with remarkable accuracy, establishing the validity of quantum ideas.",
          "examples": [
            {
              "process": "Rydberg constant",
              "explanation": "Bohr derived $R = \\frac{me^4}{8\\epsilon_0^2 h^3 c}$, which matched the experimental value $1.097 \\times 10^7$ m$^{-1}$."
            }
          ]
        },
        {
          "type": "Limitations",
          "value": "What the Bohr model could not explain",
          "characteristics": [
            "Failed for atoms with more than one electron (helium, lithium, etc.)",
            "Could not explain relative intensities of spectral lines",
            "Could not explain fine structure (closely spaced lines) observed in hydrogen spectra",
            "Violated the uncertainty principle by assuming definite orbits",
            "Was a hybrid of classical and quantum ideas (ad hoc quantization)"
          ],
          "behavior": "These limitations showed that a more complete theory was needed, leading to the development of quantum mechanics by Heisenberg, Schrödinger, and others.",
          "examples": [
            {
              "process": "Helium spectrum",
              "explanation": "Bohr's model cannot predict the spectrum of helium, a two‑electron atom."
            },
            {
              "process": "Fine structure",
              "explanation": "High‑resolution spectroscopy shows that hydrogen lines are actually doublets, requiring a more detailed quantum treatment (spin‑orbit coupling)."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit10/bohr_limitations.png",
        "alt": "Comparison of hydrogen and helium spectra, showing Bohr model's success for H and failure for He",
        "caption": "The Bohr model succeeds for hydrogen but fails for multi‑electron atoms."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when studying the Bohr model.",
      "classifications": [
        {
          "type": "Thinking Electrons Follow Definite Orbits",
          "value": "Believing that electrons travel in well‑defined circular paths like planets",
          "characteristics": [
            "Visualizing the atom as a miniature solar system",
            "Not recognizing that the Bohr model is an approximation"
          ],
          "behavior": "In modern quantum mechanics, electrons do not have definite orbits. They are described by wave functions and probability clouds. The Bohr model's orbits are a useful simplification but not physically accurate.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student imagines an electron's exact position and speed in its orbit."
            },
            {
              "process": "Correct",
              "explanation": "We can only know the probability of finding an electron in a given region."
            }
          ]
        },
        {
          "type": "Misinterpreting Negative Energy",
          "value": "Thinking that negative energy means the atom has negative total energy, which seems impossible",
          "characteristics": [
            "Believing negative energy is unphysical",
            "Not understanding that negative energy indicates a bound state"
          ],
          "behavior": "Negative energy simply means the electron is bound to the nucleus; energy must be supplied to free it. Zero energy corresponds to an electron at rest infinitely far away. This convention is common in physics.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student thinks negative energy is impossible or meaningless."
            },
            {
              "process": "Correct",
              "explanation": "Negative energy indicates a bound system; the more negative, the more tightly bound."
            }
          ]
        },
        {
          "type": "Confusing Emission and Absorption",
          "value": "Mixing up which direction of transition corresponds to emission vs. absorption",
          "characteristics": [
            "Thinking an electron emits a photon when jumping to a higher level",
            "Not associating $\\Delta E = hf$ with the correct transition direction"
          ],
          "behavior": "Emission occurs when an electron falls to a lower energy level ($n_i > n_f$), releasing a photon. Absorption occurs when an electron absorbs a photon and jumps to a higher level ($n_f > n_i$).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says an atom emits light when an electron moves from $n=2$ to $n=3$."
            },
            {
              "process": "Correct",
              "explanation": "Moving from $n=2$ to $n=3$ requires absorption; emission occurs for $n=3$ to $n=2$."
            }
          ]
        },
        {
          "type": "Forgetting That the Bohr Model Only Works for Hydrogen",
          "value": "Applying the $E_n = -13.6/n^2$ formula to multi‑electron atoms",
          "characteristics": [
            "Using hydrogen energy levels for helium or lithium",
            "Not recognizing that electron‑electron interactions change energies"
          ],
          "behavior": "The Bohr model's simple formula applies only to one‑electron systems (H, He⁺, Li²⁺, etc.). Multi‑electron atoms have more complex energy levels due to electron‑electron repulsion and shielding.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student calculates the ionization energy of helium using $13.6/n^2$."
            },
            {
              "process": "Correct",
              "explanation": "Helium's ionization energy is about 24.6 eV, not 13.6 eV, because of the two electrons."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit10/bohr_mistakes.png",
        "alt": "Common misconceptions about the Bohr model",
        "caption": "Avoid these common errors when studying the Bohr model."
      }
    }
  ],
  "key_terms": [
    "Bohr model",
    "Principal quantum number ($n$)",
    "Quantized angular momentum",
    "$L = n\\hbar$",
    "Energy levels",
    "$E_n = -13.6/n^2$ eV",
    "Photon emission",
    "Photon absorption",
    "Rydberg formula",
    "Rydberg constant ($R$)",
    "Balmer series",
    "Lyman series",
    "Paschen series",
    "Ionization energy",
    "Stationary states",
    "Ground state",
    "Excited state"
  ],
  "summary": "The Bohr model of the hydrogen atom introduced quantized energy levels to explain atomic stability and spectra. Its three postulates are: electrons orbit in allowed circular orbits with quantized angular momentum ($L = n\\hbar$); they do not radiate in these stationary states; and they emit or absorb photons when transitioning between levels, with $\\Delta E = hf$. For hydrogen, the energy of level $n$ is $E_n = -13.6/n^2$ eV. Transitions to $n=1$ give the Lyman series (UV), to $n=2$ the Balmer series (visible), and to $n=3$ the Paschen series (IR). The model successfully predicts hydrogen's spectrum and derives the Rydberg constant, but fails for multi‑electron atoms and cannot explain fine structure or spectral intensities. Despite its limitations, the Bohr model was a crucial step in the development of quantum mechanics and remains a valuable introduction to quantized energy levels."
}
