{
  "expanded_description": "This section provides a comprehensive review of all topics covered in Unit 10: Modern Physics. It synthesizes the key concepts of wave-particle duality, the photoelectric effect, atomic models, the Bohr model, special relativity, time dilation, nuclear physics, and mass-energy equivalence. Mastering these interconnected ideas is essential for understanding the revolutionary developments in physics that occurred in the early 20th century and their profound implications for our understanding of reality.",
  "core_concept": {
    "principle": "Modern physics, encompassing quantum mechanics and relativity, fundamentally changed our understanding of the universe. Quantum mechanics reveals that energy and matter are quantized, and particles exhibit wave-particle duality. Relativity shows that space and time are relative, not absolute, and that mass and energy are equivalent ($E = mc^2$). These theories, supported by experiments such as the photoelectric effect, atomic spectra, and nuclear reactions, form the foundation of our current understanding of the microscopic world and the cosmos.",
    "explanation": "Unit 10 built a framework for understanding the key ideas of modern physics. We learned that light and matter exhibit both wave and particle properties (wave-particle duality), with the photoelectric effect providing crucial evidence for photons. Atomic models evolved from Dalton's indivisible spheres through Thomson, Rutherford, and Bohr to the modern quantum mechanical view. Bohr's model successfully explained hydrogen's spectrum using quantized energy levels. Special relativity introduced time dilation, length contraction, and mass-energy equivalence. Nuclear physics introduced radioactivity, half-life, and the relationship between mass and energy. These concepts revolutionized physics and led to technologies from nuclear power to GPS.",
    "image": {
      "src": "images/unit10/unit10_review.png",
      "alt": "Concept map showing connections between wave-particle duality, photoelectric effect, atomic models, Bohr model, relativity, and nuclear physics",
      "caption": "All Unit 10 topics interconnect through the unifying themes of quantization, relativity, and the structure of matter."
    }
  },
  "sections": [
    {
      "section_title": "Unit 10 Topics Overview",
      "introduction": "Unit 10 covered ten sections that build a complete understanding of modern physics. Each topic contributes essential knowledge and skills.",
      "key_concept": {
        "definition": "Modern physics is the physics of the 20th and 21st centuries, primarily quantum mechanics and relativity, which describe the behavior of matter and energy at atomic and subatomic scales and at speeds approaching the speed of light.",
        "context": "These concepts are foundational for understanding nuclear energy, particle physics, cosmology, and modern technologies such as semiconductors, lasers, and GPS."
      },
      "classifications": [
        {
          "type": "Quantum Concepts",
          "value": "Wave-particle duality and quantization",
          "characteristics": [
            "Wave-particle duality: quantum objects exhibit both wave and particle properties",
            "de Broglie wavelength: $\\lambda = h/p$",
            "Photoelectric effect: $K_{\\text{max}} = hf - \\phi$, demonstrating photon nature of light",
            "Atomic models: evolution from Dalton to quantum mechanical",
            "Bohr model: quantized energy levels $E_n = -13.6/n^2$ eV for hydrogen"
          ],
          "behavior": "Quantum mechanics reveals that at microscopic scales, energy and matter are quantized, and particles are described by wave functions that give probabilities, not certainties.",
          "examples": [
            {
              "process": "10.2 Wave-Particle Duality Intro",
              "explanation": "Introduced the concept that light and matter exhibit both wave and particle properties."
            },
            {
              "process": "10.3 Photoelectric Effect Intro",
              "explanation": "Light ejects electrons from metals, with energy depending on frequency, not intensity."
            },
            {
              "process": "10.4 Atomic Models",
              "explanation": "Traced evolution of atomic theory from Dalton to quantum mechanics."
            },
            {
              "process": "10.5 Bohr Model Intro",
              "explanation": "Introduced quantized energy levels and explained hydrogen spectrum."
            }
          ]
        },
        {
          "type": "Relativity Concepts",
          "value": "Special relativity and its consequences",
          "characteristics": [
            "Einstein's postulates: laws of physics same in all inertial frames; speed of light constant",
            "Time dilation: $\\Delta t = \\gamma \\Delta \\tau$, where $\\gamma = 1/\\sqrt{1-v^2/c^2}$",
            "Length contraction: $L = L_0 / \\gamma$",
            "Mass-energy equivalence: $E = mc^2$, rest energy $E_0 = mc^2$, total energy $E = \\gamma mc^2$"
          ],
          "behavior": "Relativity describes the behavior of objects moving at speeds close to $c$. Time slows down, lengths contract, and energy increases dramatically. These effects have been experimentally verified.",
          "examples": [
            {
              "process": "10.6 Relativity Intro",
              "explanation": "Introduced Einstein's postulates and the need for relativity."
            },
            {
              "process": "10.7 Time Dilation Intro",
              "explanation": "Covered time dilation formula and examples (muon decay, twin paradox)."
            },
            {
              "process": "10.9 E=mc² Intro",
              "explanation": "Introduced mass-energy equivalence and its implications for nuclear reactions."
            }
          ]
        },
        {
          "type": "Nuclear Concepts",
          "value": "Nuclear physics basics",
          "characteristics": [
            "Radioactivity: spontaneous emission of particles or radiation from unstable nuclei",
            "Half-life: time for half of a radioactive sample to decay, exponential decay $N = N_0 (1/2)^{t/t_{1/2}}$",
            "Nuclear reactions: changes in atomic nuclei, can release or absorb energy",
            "Mass defect: difference between nuclear mass and sum of constituent masses, related to binding energy by $\\Delta E = \\Delta m c^2$"
          ],
          "behavior": "Nuclear processes involve changes in the nucleus, releasing enormous amounts of energy due to mass-energy equivalence. Half-life describes the rate of decay, which is random but statistically predictable.",
          "examples": [
            {
              "process": "10.8 Nuclear Physics Intro",
              "explanation": "Introduced radioactivity, half-life, and nuclear reactions."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit10/unit10_topics.png",
        "alt": "Visual summary of all ten Unit 10 topics with icons",
        "caption": "Unit 10 covers ten interconnected topics that build understanding of modern physics."
      }
    },
    {
      "section_title": "Key Concepts Summary",
      "introduction": "This section summarizes the most important concepts from each topic in Unit 10, providing a quick reference for review.",
      "key_concept": {
        "definition": "Key concepts are the essential ideas that must be understood and remembered from each section.",
        "context": "These concepts form the foundation for advanced studies in quantum mechanics, relativity, nuclear physics, and cosmology."
      },
      "principles": [
        {
          "principle": "10.1 Intro to Modern Physics",
          "statement": "Modern physics (quantum mechanics and relativity) extends classical physics to the realms of the very small, the very fast, and the very massive.",
          "application": "Recognize when classical physics is inadequate and modern physics is required.",
          "example": "Quantum mechanics needed for atomic structure; relativity needed for GPS satellites."
        },
        {
          "principle": "10.2 Wave-Particle Duality Intro",
          "statement": "Quantum objects exhibit both wave and particle properties. The de Broglie wavelength $\\lambda = h/p$ connects the two descriptions.",
          "application": "Use de Broglie relation to find wavelength of particles; understand complementarity.",
          "example": "Electrons diffract like waves, but are detected as particles."
        },
        {
          "principle": "10.3 Photoelectric Effect Intro",
          "statement": "Light consists of photons with energy $E = hf$. The photoelectric effect obeys $K_{\\text{max}} = hf - \\phi$, with threshold frequency $f_0 = \\phi/h$.",
          "application": "Calculate electron kinetic energy, stopping potential, and determine work function.",
          "example": "Light of 400 nm on cesium ($\\phi = 2.1$ eV) produces electrons with $K_{\\text{max}} = 1.01$ eV."
        },
        {
          "principle": "10.4 Atomic Models",
          "statement": "Atomic models evolved: Dalton (indivisible spheres), Thomson (plum pudding), Rutherford (nuclear), Bohr (quantized orbits), quantum mechanical (orbitals).",
          "application": "Understand the evidence that led to each model and their limitations.",
          "example": "Rutherford's gold foil experiment revealed the nucleus."
        },
        {
          "principle": "10.5 Bohr Model Intro",
          "statement": "In hydrogen, electrons occupy quantized energy levels $E_n = -13.6/n^2$ eV. Transitions between levels emit/absorb photons with $\\Delta E = hf$.",
          "application": "Calculate photon energies and wavelengths for hydrogen transitions; identify spectral series.",
          "example": "$n=3 \\to n=2$ transition emits red light at 656 nm (Balmer series)."
        },
        {
          "principle": "10.6 Relativity Intro",
          "statement": "Special relativity is based on two postulates: laws of physics same in all inertial frames; speed of light constant for all observers.",
          "application": "Understand why classical velocity addition fails and why relativity is needed.",
          "example": "Light from a moving source still travels at $c$."
        },
        {
          "principle": "10.7 Time Dilation Intro",
          "statement": "Moving clocks run slow: $\\Delta t = \\gamma \\Delta \\tau$, with $\\gamma = 1/\\sqrt{1-v^2/c^2}$. Length contraction: $L = L_0 / \\gamma$.",
          "application": "Calculate time dilation and length contraction for objects moving at relativistic speeds.",
          "example": "A spaceship at $0.8c$ experiences time dilation factor $\\gamma = 1.667$."
        },
        {
          "principle": "10.8 Nuclear Physics Intro",
          "statement": "Radioactive decay follows $N = N_0 (1/2)^{t/t_{1/2}}$, where $t_{1/2}$ is half-life. Nuclear reactions involve changes in nuclei, with energy changes given by $\\Delta E = \\Delta m c^2$.",
          "application": "Calculate remaining nuclei after a given time; find energy released in nuclear reactions.",
          "example": "Carbon-14 dating uses half-life of 5730 years."
        },
        {
          "principle": "10.9 E=mc² Intro",
          "statement": "Mass and energy are equivalent. Rest energy $E_0 = mc^2$, total energy $E = \\gamma mc^2$. Mass defect in nuclei corresponds to binding energy.",
          "application": "Calculate energy released in nuclear reactions from mass difference.",
          "example": "Fission of one uranium nucleus releases about 200 MeV."
        }
      ],
      "image": {
        "src": "images/unit10/key_concepts_summary.png",
        "alt": "Visual summary of key concepts from each section of Unit 10",
        "caption": "Master these key concepts from each section to build a strong modern physics foundation."
      }
    },
    {
      "section_title": "Important Formulas and Relationships",
      "introduction": "Unit 10 introduced several formulas that are essential for solving modern physics problems.",
      "key_concept": {
        "definition": "Formulas are mathematical expressions that describe relationships between physical quantities. Understanding when and how to use each formula is essential.",
        "context": "These formulas appear repeatedly in advanced topics in quantum mechanics, relativity, and nuclear physics."
      },
      "classifications": [
        {
          "type": "Quantum Mechanics",
          "value": "Formulas for wave-particle duality and photoelectric effect",
          "characteristics": [
            "$E = hf$ (photon energy)",
            "$\\lambda = h/p$ (de Broglie wavelength)",
            "$K_{\\text{max}} = hf - \\phi$ (photoelectric effect)",
            "$eV_s = K_{\\text{max}}$ (stopping potential)"
          ],
          "behavior": "These relate particle and wave properties, and describe energy quantization.",
          "examples": [
            {
              "process": "Photon energy",
              "explanation": "$E = hf$"
            },
            {
              "process": "de Broglie wavelength",
              "explanation": "$\\lambda = h/p$"
            }
          ]
        },
        {
          "type": "Bohr Model",
          "value": "Formulas for hydrogen atom",
          "characteristics": [
            "$E_n = -13.6/n^2$ eV (energy levels)",
            "$\\Delta E = hf = E_i - E_f$ (photon energy in transition)",
            "$\\frac{1}{\\lambda} = R\\left(\\frac{1}{n_f^2} - \\frac{1}{n_i^2}\\right)$ (Rydberg formula)"
          ],
          "behavior": "These describe the quantized energy levels of hydrogen and the wavelengths of spectral lines.",
          "examples": [
            {
              "process": "Energy levels",
              "explanation": "$E_n = -13.6/n^2$ eV"
            }
          ]
        },
        {
          "type": "Special Relativity",
          "value": "Formulas for relativistic effects",
          "characteristics": [
            "$\\gamma = \\frac{1}{\\sqrt{1 - v^2/c^2}}$ (Lorentz factor)",
            "$\\Delta t = \\gamma \\Delta \\tau$ (time dilation)",
            "$L = L_0 / \\gamma$ (length contraction)",
            "$E = \\gamma mc^2$ (total energy)",
            "$E_0 = mc^2$ (rest energy)",
            "$K = (\\gamma - 1)mc^2$ (kinetic energy)"
          ],
          "behavior": "These describe how time, length, and energy change at relativistic speeds.",
          "examples": [
            {
              "process": "Time dilation",
              "explanation": "$\\Delta t = \\gamma \\Delta \\tau$"
            },
            {
              "process": "Mass-energy equivalence",
              "explanation": "$E = mc^2$"
            }
          ]
        },
        {
          "type": "Nuclear Physics",
          "value": "Formulas for radioactivity",
          "characteristics": [
            "$N = N_0 (1/2)^{t/t_{1/2}}$ (exponential decay)",
            "$t_{1/2} = \\frac{\\ln 2}{\\lambda}$ (relation between half-life and decay constant)",
            "$\\Delta E = \\Delta m c^2$ (energy from mass defect)"
          ],
          "behavior": "These describe the decay of radioactive nuclei and the energy released in nuclear reactions.",
          "examples": [
            {
              "process": "Decay law",
              "explanation": "$N = N_0 (1/2)^{t/t_{1/2}}$"
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit10/formulas_summary.png",
        "alt": "Summary card of important formulas from Unit 10",
        "caption": "Memorize these formulas and understand when to apply them."
      }
    },
    {
      "section_title": "Common Mistakes to Avoid",
      "introduction": "Reviewing common errors from each section helps prevent them in future work.",
      "classifications": [
        {
          "type": "Wave-Particle Duality Errors",
          "value": "Misunderstanding the nature of quantum objects",
          "characteristics": [
            "Thinking particles are always waves or always particles",
            "Applying de Broglie relation incorrectly (e.g., using $p = mv$ for photons)",
            "Forgetting that $h$ is tiny, so quantum effects are negligible for macroscopic objects"
          ],
          "behavior": "Quantum objects are neither classical waves nor particles; they exhibit both properties depending on measurement. The de Broglie wavelength applies to all particles, but is significant only when $h/p$ is comparable to system size.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student thinks an electron is a wave that spreads out and then collapses."
            },
            {
              "process": "Correct",
              "explanation": "The electron is described by a wave function; its position is probabilistic until measured."
            }
          ]
        },
        {
          "type": "Photoelectric Effect Errors",
          "value": "Confusing intensity and frequency",
          "characteristics": [
            "Thinking increasing intensity increases electron energy",
            "Forgetting to subtract work function in $K_{\\text{max}}$",
            "Unit errors with eV and joules"
          ],
          "behavior": "Intensity affects number of electrons (current), not their energy. Electron energy depends on frequency minus work function. Use consistent units.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says brighter light produces faster electrons."
            },
            {
              "process": "Correct",
              "explanation": "Brighter light produces more electrons, but their maximum energy is unchanged for a given frequency."
            }
          ]
        },
        {
          "type": "Atomic Model Errors",
          "value": "Confusing features of different models",
          "characteristics": [
            "Thinking Thomson had a nucleus",
            "Believing Rutherford's model explained spectra",
            "Using Bohr model for multi-electron atoms"
          ],
          "behavior": "Each model has distinct features: Thomson (plum pudding), Rutherford (nuclear), Bohr (quantized orbits). The Bohr model works only for hydrogen-like atoms.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says Rutherford's model had electrons in quantized orbits."
            },
            {
              "process": "Correct",
              "explanation": "Rutherford's model had electrons orbiting classically; quantization came with Bohr."
            }
          ]
        },
        {
          "type": "Bohr Model Errors",
          "value": "Misapplying energy level formula",
          "characteristics": [
            "Using $E_n = -13.6/n^2$ for helium",
            "Confusing emission and absorption (which direction emits a photon)",
            "Forgetting that $n$ starts at 1"
          ],
          "behavior": "The $E_n = -13.6/n^2$ eV formula applies only to one-electron systems. Emission occurs when electron falls to lower $n$; absorption to higher $n$.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student calculates helium's ionization energy as 13.6 eV."
            },
            {
              "process": "Correct",
              "explanation": "Helium's ionization energy is about 24.6 eV due to electron-electron interactions."
            }
          ]
        },
        {
          "type": "Relativity Errors",
          "value": "Misapplying time dilation and length contraction formulas",
          "characteristics": [
            "Using $\\Delta t = \\gamma \\Delta \\tau$ with $\\Delta t$ as proper time",
            "Forgetting that $\\gamma \\ge 1$",
            "Thinking relativity only applies to light"
          ],
          "behavior": "Proper time $\\Delta \\tau$ is measured in frame where events occur at same place. Time dilation gives $\\Delta t > \\Delta \\tau$. $\\gamma$ is always $\\ge 1$.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a moving clock runs fast."
            },
            {
              "process": "Correct",
              "explanation": "Moving clocks run slow; $\\Delta t = \\gamma \\Delta \\tau$ with $\\gamma > 1$."
            }
          ]
        },
        {
          "type": "Nuclear Physics Errors",
          "value": "Misunderstanding half-life and exponential decay",
          "characteristics": [
            "Thinking half-life is time for all atoms to decay",
            "Confusing decay constant $\\lambda$ with half-life",
            "Forgetting that $\\Delta E = \\Delta m c^2$ uses mass in kg, $c$ in m/s"
          ],
          "behavior": "Half-life is time for half of a sample to decay; decay is exponential, not linear. After one half-life, half remains; after two, one-quarter remains, etc.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student thinks after two half-lives, all atoms have decayed."
            },
            {
              "process": "Correct",
              "explanation": "After two half-lives, one-quarter remains; after three, one-eighth, etc."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit10/common_mistakes.png",
        "alt": "Summary of common mistakes from each section of Unit 10",
        "caption": "Being aware of common errors helps you avoid them."
      }
    },
    {
      "section_title": "Practice Problems",
      "introduction": "These practice problems review key skills from Unit 10. Work through them to check your understanding.",
      "worked_examples": [
        {
          "title": "Photoelectric Effect",
          "problem": "Light of wavelength 250 nm is incident on a metal with work function 2.2 eV. Find (a) the energy of each photon in eV, (b) the maximum kinetic energy of the emitted electrons in eV, and (c) the stopping potential. ($h = 6.63 \\times 10^{-34}$ J·s, $c = 3.00 \\times 10^8$ m/s, $e = 1.60 \\times 10^{-19}$ C)",
          "step_by_step": [
            {
              "step": "Find photon frequency",
              "explanation": "$f = c/\\lambda = (3.00 \\times 10^8) / (250 \\times 10^{-9}) = 1.20 \\times 10^{15}$ Hz"
            },
            {
              "step": "Photon energy in joules",
              "explanation": "$E = hf = (6.63 \\times 10^{-34})(1.20 \\times 10^{15}) = 7.96 \\times 10^{-19}$ J"
            },
            {
              "step": "Convert to eV",
              "explanation": "$E = (7.96 \\times 10^{-19}) / (1.60 \\times 10^{-19}) = 4.98$ eV"
            },
            {
              "step": "Maximum kinetic energy",
              "explanation": "$K_{\\text{max}} = E - \\phi = 4.98 - 2.2 = 2.78$ eV"
            },
            {
              "step": "Stopping potential",
              "explanation": "$V_s = K_{\\text{max}} / e = 2.78$ V (since 1 eV gives 1 V stopping potential)"
            }
          ],
          "final_answer": "$E = 4.98$ eV, $K_{\\text{max}} = 2.78$ eV, $V_s = 2.78$ V",
          "concept_applied": "Photoelectric effect: photon energy minus work function gives electron kinetic energy."
        },
        {
          "title": "Bohr Model Transition",
          "problem": "Calculate the wavelength of light emitted when an electron in hydrogen falls from $n=5$ to $n=2$. Identify the spectral series.",
          "step_by_step": [
            {
              "step": "Find energy difference",
              "explanation": "$\\Delta E = 13.6\\left(\\frac{1}{2^2} - \\frac{1}{5^2}\\right) = 13.6\\left(\\frac{1}{4} - \\frac{1}{25}\\right) = 13.6(0.25 - 0.04) = 13.6 \\times 0.21 = 2.856$ eV"
            },
            {
              "step": "Convert to joules",
              "explanation": "$\\Delta E = 2.856 \\times 1.60 \\times 10^{-19} = 4.57 \\times 10^{-19}$ J"
            },
            {
              "step": "Find wavelength",
              "explanation": "$\\lambda = hc/\\Delta E = (6.63 \\times 10^{-34})(3.00 \\times 10^8) / (4.57 \\times 10^{-19}) = (1.989 \\times 10^{-25})/(4.57 \\times 10^{-19}) = 4.35 \\times 10^{-7}$ m = 435 nm"
            },
            {
              "step": "Identify series",
              "explanation": "Transition ends at $n=2$, so it is in the Balmer series (visible). 435 nm is violet-blue."
            }
          ],
          "final_answer": "$\\lambda = 435$ nm (Balmer series)",
          "concept_applied": "Hydrogen energy levels and photon emission in transitions."
        },
        {
          "title": "Time Dilation",
          "problem": "A spaceship travels to a star 12 light-years away at a speed of $0.8c$. (a) How long does the trip take according to Earth clocks? (b) How long does the trip take according to the astronauts' clocks?",
          "step_by_step": [
            {
              "step": "Time according to Earth clocks",
              "explanation": "Distance $d = 12$ ly, speed $v = 0.8c$. Time $\\Delta t = d/v = 12c / 0.8c = 15$ years"
            },
            {
              "step": "Calculate Lorentz factor",
              "explanation": "$\\gamma = 1/\\sqrt{1 - (0.8)^2} = 1/\\sqrt{0.36} = 1/0.6 = 1.667$"
            },
            {
              "step": "Proper time (astronauts' time)",
              "explanation": "$\\Delta \\tau = \\Delta t / \\gamma = 15 / 1.667 = 9.0$ years"
            }
          ],
          "final_answer": "(a) 15 years, (b) 9.0 years",
          "concept_applied": "Time dilation: moving clocks run slow; proper time is measured in the spacecraft frame."
        },
        {
          "title": "Radioactive Decay",
          "problem": "A radioactive sample has a half-life of 6.0 hours. Initially, there are $8.0 \\times 10^{12}$ atoms. How many atoms remain after 24 hours?",
          "step_by_step": [
            {
              "step": "Determine number of half-lives",
              "explanation": "$t = 24$ h, $t_{1/2} = 6.0$ h, so number of half-lives $n = 24/6 = 4$"
            },
            {
              "step": "Apply decay formula",
              "explanation": "$N = N_0 (1/2)^n = (8.0 \\times 10^{12}) (1/2)^4 = (8.0 \\times 10^{12}) \\times 1/16 = 5.0 \\times 10^{11}$ atoms"
            }
          ],
          "final_answer": "$5.0 \\times 10^{11}$ atoms remain",
          "concept_applied": "Radioactive decay follows $N = N_0 (1/2)^{t/t_{1/2}}$."
        },
        {
          "title": "Mass-Energy Equivalence",
          "problem": "In a nuclear reaction, the total mass of the products is $0.0025$ u less than the total mass of the reactants. How much energy is released? (1 u = $1.66 \\times 10^{-27}$ kg, $c = 3.00 \\times 10^8$ m/s, $1$ eV = $1.60 \\times 10^{-19}$ J)",
          "step_by_step": [
            {
              "step": "Convert mass defect to kg",
              "explanation": "$\\Delta m = 0.0025 \\times 1.66 \\times 10^{-27} = 4.15 \\times 10^{-30}$ kg"
            },
            {
              "step": "Calculate energy in joules",
              "explanation": "$\\Delta E = \\Delta m c^2 = (4.15 \\times 10^{-30})(9.00 \\times 10^{16}) = 3.74 \\times 10^{-13}$ J"
            },
            {
              "step": "Convert to MeV",
              "explanation": "$1$ MeV = $1.60 \\times 10^{-13}$ J, so $\\Delta E = (3.74 \\times 10^{-13}) / (1.60 \\times 10^{-13}) = 2.34$ MeV"
            }
          ],
          "final_answer": "$2.34$ MeV released",
          "concept_applied": "$\\Delta E = \\Delta m c^2$; mass defect corresponds to energy released."
        }
      ],
      "image": {
        "src": "images/unit10/practice_problems.png",
        "alt": "Practice problems covering key Unit 10 skills",
        "caption": "Work through these practice problems to test your understanding."
      }
    }
  ],
  "key_terms": [
    "Modern physics",
    "Quantum mechanics",
    "Wave-particle duality",
    "de Broglie wavelength",
    "Photoelectric effect",
    "Photon",
    "Work function",
    "Atomic models",
    "Bohr model",
    "Energy levels",
    "Spectral series",
    "Special relativity",
    "Time dilation",
    "Length contraction",
    "Lorentz factor",
    "Mass-energy equivalence",
    "$E = mc^2$",
    "Nuclear physics",
    "Radioactivity",
    "Half-life",
    "Mass defect"
  ],
  "summary": "Unit 10: Modern Physics introduced the revolutionary ideas of quantum mechanics and relativity. Key concepts include wave-particle duality ($\\lambda = h/p$), the photoelectric effect ($K_{\\text{max}} = hf - \\phi$), the evolution of atomic models culminating in the Bohr model ($E_n = -13.6/n^2$ eV for hydrogen), special relativity (time dilation $\\Delta t = \\gamma \\Delta \\tau$, length contraction $L = L_0/\\gamma$), mass-energy equivalence ($E = mc^2$), and nuclear physics (radioactive decay $N = N_0(1/2)^{t/t_{1/2}}$, energy from mass defect $\\Delta E = \\Delta m c^2$). These theories fundamentally changed our understanding of space, time, matter, and energy, and have numerous practical applications. Common mistakes include confusing intensity with frequency in the photoelectric effect, misapplying the Bohr model to multi-electron atoms, and mixing up proper time and dilated time in relativity."
}
