{
  "course": "Grade 12 Biology",
  "topic": "Advanced Ecology",
  "problems": [
    {
      "number": 1,
      "problem": "Define ecology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Ecology is the study of interactions between organisms and their environment, including both biotic and abiotic factors."
        }
      ],
      "final_answer": "Ecology studies how organisms interact with each other and their environment."
    },
    {
      "number": 2,
      "problem": "Define ecosystem.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "An ecosystem is a community of living organisms interacting with the non-living components of their environment."
        }
      ],
      "final_answer": "An ecosystem is a system of interacting organisms and their physical environment."
    },
    {
      "number": 3,
      "problem": "Explain the flow of energy in ecosystems.",
      "image": null,
      "step_by_step": [
        {
          "step": "Process",
          "explanation": "Energy flows from the sun to producers via photosynthesis, then to consumers and decomposers, with energy lost as heat at each trophic level."
        }
      ],
      "final_answer": "Energy flows from the sun to producers, then consumers, with energy loss at each level."
    },
    {
      "number": 4,
      "problem": "Explain the cycling of matter in ecosystems.",
      "image": null,
      "step_by_step": [
        {
          "step": "Process",
          "explanation": "Elements such as carbon, nitrogen, and water cycle through organisms and the environment via biogeochemical cycles."
        }
      ],
      "final_answer": "Matter cycles through biogeochemical cycles involving organisms and the environment."
    },
    {
      "number": 5,
      "problem": "Explain the role of keystone species.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Keystone species have a disproportionately large effect on their ecosystem relative to their abundance, maintaining community structure."
        }
      ],
      "final_answer": "Keystone species maintain ecosystem structure despite low abundance."
    },
    {
      "number": 6,
      "problem": "Explain the difference between food chains and food webs.",
      "image": null,
      "step_by_step": [
        {
          "step": "Food chain",
          "explanation": "A linear sequence showing energy transfer from one organism to another."
        },
        {
          "step": "Food web",
          "explanation": "A complex network of interconnected food chains in an ecosystem."
        }
      ],
      "final_answer": "Food chain: linear energy flow; Food web: interconnected chains."
    },
    {
      "number": 7,
      "problem": "Explain the concept of ecological succession.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Ecological succession is the gradual change in species composition in an ecosystem over time, leading to a stable climax community."
        }
      ],
      "final_answer": "Ecological succession is the progressive replacement of species until a stable climax community forms."
    },
    {
      "number": 8,
      "problem": "Explain the difference between primary and secondary succession.",
      "image": null,
      "step_by_step": [
        {
          "step": "Primary succession",
          "explanation": "Occurs on bare, lifeless substrates with no soil, e.g., after volcanic eruptions."
        },
        {
          "step": "Secondary succession",
          "explanation": "Occurs in areas where a community was disturbed but soil remains, e.g., after forest fires."
        }
      ],
      "final_answer": "Primary: no soil; Secondary: soil remains after disturbance."
    },
    {
      "number": 9,
      "problem": "Explain the concept of carrying capacity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Carrying capacity is the maximum population size that an environment can sustainably support based on resources and conditions."
        }
      ],
      "final_answer": "Carrying capacity is the maximum population an environment can sustain."
    },
    {
      "number": 10,
      "problem": "Explain the impact of human activities on ecosystems.",
      "image": null,
      "step_by_step": [
        {
          "step": "Impacts",
          "explanation": "Activities such as deforestation, pollution, urbanization, and climate change disrupt ecosystems, reduce biodiversity, and alter ecological processes."
        }
      ],
      "final_answer": "Human activities disrupt ecosystems, reduce biodiversity, and alter ecological balance."
    }
  ]
}
