{
  "course": "Grade 12 Biology",
  "topic": "Advanced Biochemistry: Protein Structure and Function",
  "problems": [
    {
      "number": 1,
      "problem": "Define protein and explain its general structure.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Proteins are macromolecules composed of amino acids linked by peptide bonds, performing structural, enzymatic, and regulatory functions."
        },
        {
          "step": "Structure",
          "explanation": "Proteins have primary (amino acid sequence), secondary (α-helices, β-sheets), tertiary (3D folding), and quaternary (multiple polypeptides) structures."
        }
      ],
      "final_answer": "Proteins are amino acid polymers with primary, secondary, tertiary, and quaternary structures, performing diverse biological functions."
    },
    {
      "number": 2,
      "problem": "Explain the difference between fibrous and globular proteins.",
      "image": null,
      "step_by_step": [
        {
          "step": "Fibrous proteins",
          "explanation": "Fibrous proteins are elongated, structural proteins, e.g., collagen, keratin."
        },
        {
          "step": "Globular proteins",
          "explanation": "Globular proteins are compact, functional proteins, e.g., enzymes, hemoglobin."
        }
      ],
      "final_answer": "Fibrous: structural, elongated; Globular: functional, compact proteins."
    },
    {
      "number": 3,
      "problem": "Explain the role of enzymes as biological catalysts.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Enzymes speed up chemical reactions by lowering the activation energy without being consumed."
        }
      ],
      "final_answer": "Enzymes accelerate reactions by lowering activation energy."
    },
    {
      "number": 4,
      "problem": "Explain the importance of protein folding.",
      "image": null,
      "step_by_step": [
        {
          "step": "Importance",
          "explanation": "Correct folding is essential for proper protein function; misfolding can lead to diseases like Alzheimer’s or cystic fibrosis."
        }
      ],
      "final_answer": "Proper folding ensures functional proteins; misfolding can cause disease."
    },
    {
      "number": 5,
      "problem": "Explain the role of active sites in enzymes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The active site is the region on an enzyme where substrates bind and undergo chemical transformation."
        }
      ],
      "final_answer": "Active sites bind substrates and catalyze reactions."
    },
    {
      "number": 6,
      "problem": "Explain the effect of temperature and pH on protein function.",
      "image": null,
      "step_by_step": [
        {
          "step": "Temperature",
          "explanation": "High temperatures can denature proteins, destroying their structure and function."
        },
        {
          "step": "pH",
          "explanation": "Extreme pH levels can disrupt ionic bonds, leading to denaturation and loss of activity."
        }
      ],
      "final_answer": "Temperature and pH extremes can denature proteins, impairing function."
    },
    {
      "number": 7,
      "problem": "Explain allosteric regulation of enzymes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Allosteric regulation occurs when a molecule binds to a site other than the active site, changing enzyme activity."
        },
        {
          "step": "Effect",
          "explanation": "Can activate or inhibit the enzyme depending on the regulator."
        }
      ],
      "final_answer": "Allosteric regulation: binding at a separate site modifies enzyme activity."
    },
    {
      "number": 8,
      "problem": "Explain competitive and non-competitive inhibition in proteins.",
      "image": null,
      "step_by_step": [
        {
          "step": "Competitive inhibition",
          "explanation": "An inhibitor binds the active site, preventing substrate binding."
        },
        {
          "step": "Non-competitive inhibition",
          "explanation": "An inhibitor binds elsewhere, changing enzyme shape and reducing activity."
        }
      ],
      "final_answer": "Competitive: inhibitor blocks active site; Non-competitive: inhibitor alters enzyme shape."
    },
    {
      "number": 9,
      "problem": "Explain the role of cofactors and coenzymes in protein function.",
      "image": null,
      "step_by_step": [
        {
          "step": "Cofactors",
          "explanation": "Non-protein molecules (ions) required for enzyme activity, e.g., Mg²⁺, Fe²⁺."
        },
        {
          "step": "Coenzymes",
          "explanation": "Organic molecules that assist enzymes, e.g., NAD⁺, FAD."
        }
      ],
      "final_answer": "Cofactors: inorganic helpers; Coenzymes: organic helpers for enzymatic activity."
    },
    {
      "number": 10,
      "problem": "Explain the importance of post-translational modifications in proteins.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Post-translational modifications like phosphorylation, glycosylation, or acetylation regulate protein activity, stability, and localization."
        }
      ],
      "final_answer": "Post-translational modifications regulate protein function, stability, and cellular location."
    }
  ]
}
