{
  "course": "Grade 12 Biology",
  "topic": "Advanced Human Physiology: Control Systems",
  "problems": [
    {
      "number": 1,
      "problem": "Define homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Homeostasis is the maintenance of a stable internal environment despite changes in external conditions."
        }
      ],
      "final_answer": "Homeostasis is the maintenance of a stable internal environment in the body."
    },
    {
      "number": 2,
      "problem": "Explain the role of the nervous system in control and coordination.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The nervous system detects stimuli, processes information, and sends rapid electrical signals to effectors to maintain homeostasis."
        }
      ],
      "final_answer": "The nervous system maintains homeostasis by detecting stimuli and sending electrical signals to effectors."
    },
    {
      "number": 3,
      "problem": "Explain the role of the endocrine system in control and coordination.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The endocrine system uses hormones secreted by glands into the bloodstream to regulate slower but longer-lasting responses in target organs."
        }
      ],
      "final_answer": "The endocrine system maintains homeostasis via hormones that regulate target organs over longer durations."
    },
    {
      "number": 4,
      "problem": "Explain negative feedback with an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Negative feedback occurs when a change in a variable triggers a response that counteracts the change."
        },
        {
          "step": "Example",
          "explanation": "When blood glucose rises, insulin is released to lower it back to normal levels."
        }
      ],
      "final_answer": "Negative feedback counteracts changes; e.g., insulin lowers high blood glucose."
    },
    {
      "number": 5,
      "problem": "Explain positive feedback with an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Positive feedback amplifies a change rather than reversing it."
        },
        {
          "step": "Example",
          "explanation": "During childbirth, oxytocin release intensifies uterine contractions."
        }
      ],
      "final_answer": "Positive feedback amplifies changes; e.g., oxytocin strengthens contractions during labor."
    },
    {
      "number": 6,
      "problem": "Describe the role of the hypothalamus in homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The hypothalamus integrates nervous and endocrine signals, regulating temperature, thirst, hunger, and hormone secretion."
        }
      ],
      "final_answer": "The hypothalamus regulates temperature, hunger, thirst, and hormone release to maintain homeostasis."
    },
    {
      "number": 7,
      "problem": "Explain the role of feedback loops in temperature regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Negative feedback",
          "explanation": "If body temperature rises, sweat production and vasodilation occur; if it falls, shivering and vasoconstriction restore normal temperature."
        }
      ],
      "final_answer": "Temperature regulation uses negative feedback: sweating/vasodilation cools, shivering/vasoconstriction warms the body."
    },
    {
      "number": 8,
      "problem": "Explain the role of insulin and glucagon in blood glucose regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Insulin",
          "explanation": "Secreted by beta cells when glucose is high; promotes glucose uptake and storage as glycogen."
        },
        {
          "step": "Glucagon",
          "explanation": "Secreted by alpha cells when glucose is low; stimulates glycogen breakdown and glucose release into blood."
        }
      ],
      "final_answer": "Insulin lowers high blood glucose; glucagon raises low blood glucose."
    },
    {
      "number": 9,
      "problem": "Explain the role of the adrenal medulla in stress response.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The adrenal medulla secretes adrenaline and noradrenaline to prepare the body for fight-or-flight: increasing heart rate, blood flow, and energy availability."
        }
      ],
      "final_answer": "Adrenal medulla releases adrenaline/noradrenaline to trigger fight-or-flight responses."
    },
    {
      "number": 10,
      "problem": "Explain the role of feedback in blood pressure regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Process",
          "explanation": "Baroreceptors detect blood pressure changes; signals to the medulla adjust heart rate and vessel diameter to restore normal pressure."
        }
      ],
      "final_answer": "Blood pressure is regulated by baroreceptor feedback controlling heart rate and vessel diameter."
    }
  ]
}
