{
  "course": "Grade 12 Biology",
  "topic": "Biotechnology and Genetic Engineering",
  "problems": [
    {
      "number": 1,
      "problem": "Define biotechnology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Biotechnology is the use of living organisms or their components to produce useful products or solve problems in medicine, agriculture, and industry."
        }
      ],
      "final_answer": "Biotechnology uses living organisms or their components to produce useful products or solve problems."
    },
    {
      "number": 2,
      "problem": "Define genetic engineering.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Genetic engineering is the deliberate modification of an organism's genome using biotechnology techniques."
        }
      ],
      "final_answer": "Genetic engineering is the deliberate modification of an organism's DNA using biotechnology."
    },
    {
      "number": 3,
      "problem": "Explain the role of restriction enzymes in genetic engineering.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Restriction enzymes cut DNA at specific sequences, creating fragments that can be inserted into vectors."
        }
      ],
      "final_answer": "Restriction enzymes cut DNA at specific sites for manipulation and cloning."
    },
    {
      "number": 4,
      "problem": "Explain the role of DNA ligase in genetic engineering.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "DNA ligase joins DNA fragments together, sealing nicks and forming recombinant DNA molecules."
        }
      ],
      "final_answer": "DNA ligase joins DNA fragments to form recombinant DNA."
    },
    {
      "number": 5,
      "problem": "Explain the use of plasmids as vectors.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Plasmids are circular DNA molecules used to carry foreign genes into host cells for cloning or expression."
        }
      ],
      "final_answer": "Plasmids act as carriers to insert foreign genes into host cells."
    },
    {
      "number": 6,
      "problem": "Explain the process of polymerase chain reaction (PCR).",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "PCR amplifies specific DNA sequences by repeated cycles of denaturation, primer annealing, and extension using DNA polymerase."
        }
      ],
      "final_answer": "PCR rapidly amplifies specific DNA sequences through thermal cycling and DNA polymerase."
    },
    {
      "number": 7,
      "problem": "Explain the purpose of gel electrophoresis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Gel electrophoresis separates DNA, RNA, or proteins based on size and charge for analysis or verification of genetic material."
        }
      ],
      "final_answer": "Gel electrophoresis separates molecules by size and charge for analysis."
    },
    {
      "number": 8,
      "problem": "Explain the difference between transgenic and knockout organisms.",
      "image": null,
      "step_by_step": [
        {
          "step": "Transgenic organisms",
          "explanation": "Contain foreign genes inserted into their genome, expressing new traits."
        },
        {
          "step": "Knockout organisms",
          "explanation": "Have specific genes inactivated to study gene function."
        }
      ],
      "final_answer": "Transgenic: foreign gene added; Knockout: specific gene disabled."
    },
    {
      "number": 9,
      "problem": "Explain the role of CRISPR-Cas9 in gene editing.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "CRISPR-Cas9 uses a guide RNA to target a specific DNA sequence, where the Cas9 enzyme creates a cut for precise editing."
        }
      ],
      "final_answer": "CRISPR-Cas9 enables precise DNA editing at targeted sequences using guide RNA and Cas9."
    },
    {
      "number": 10,
      "problem": "Explain ethical considerations in genetic engineering.",
      "image": null,
      "step_by_step": [
        {
          "step": "Considerations",
          "explanation": "Include safety, ecological impact, human health, gene privacy, and potential misuse of technology."
        }
      ],
      "final_answer": "Ethical issues include safety, ecological impact, human health, privacy, and misuse concerns."
    }
  ]
}
