{
  "course": "Grade 12 Biology",
  "topic": "Environmental Biology: Bioethics",
  "problems": [
    {
      "number": 1,
      "problem": "Define bioethics.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Bioethics is the study of ethical issues and moral implications of biological research and applications."
        }
      ],
      "final_answer": "Bioethics examines moral and ethical issues in biological research and applications."
    },
    {
      "number": 2,
      "problem": "Explain the importance of bioethics in environmental biology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Importance",
          "explanation": "Bioethics ensures that environmental actions, research, and policies respect ecosystems, biodiversity, and human well-being."
        }
      ],
      "final_answer": "Bioethics guides responsible actions and research to protect ecosystems, biodiversity, and human health."
    },
    {
      "number": 3,
      "problem": "Explain the ethical issues associated with genetic modification of organisms in the environment.",
      "image": null,
      "step_by_step": [
        {
          "step": "Issues",
          "explanation": "Concerns include unintended ecological impacts, gene flow to wild populations, and disruption of natural ecosystems."
        }
      ],
      "final_answer": "Genetic modification raises ethical concerns about ecological disruption and unintended consequences."
    },
    {
      "number": 4,
      "problem": "Explain the ethical issues associated with conservation biology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Issues",
          "explanation": "Decisions about protecting endangered species, habitat restoration, and resource allocation raise moral questions about priorities and human impact."
        }
      ],
      "final_answer": "Conservation ethics involve decisions about species protection, habitat restoration, and resource priorities."
    },
    {
      "number": 5,
      "problem": "Explain the ethical considerations of pollution and waste management.",
      "image": null,
      "step_by_step": [
        {
          "step": "Considerations",
          "explanation": "Pollution affects human health, wildlife, and ecosystems; ethical management requires reducing harm and sustainable practices."
        }
      ],
      "final_answer": "Ethical waste management reduces harm to humans and ecosystems and promotes sustainability."
    },
    {
      "number": 6,
      "problem": "Explain the ethical concerns of overexploitation of natural resources.",
      "image": null,
      "step_by_step": [
        {
          "step": "Concerns",
          "explanation": "Overharvesting, deforestation, and overfishing threaten biodiversity and ecosystem stability, raising moral responsibility issues."
        }
      ],
      "final_answer": "Overexploitation of resources raises ethical issues regarding biodiversity and ecosystem protection."
    },
    {
      "number": 7,
      "problem": "Explain the ethical concerns of climate change.",
      "image": null,
      "step_by_step": [
        {
          "step": "Concerns",
          "explanation": "Human-induced climate change affects vulnerable populations, ecosystems, and future generations, raising issues of justice and responsibility."
        }
      ],
      "final_answer": "Climate change ethics involve justice, responsibility, and protecting vulnerable populations and ecosystems."
    },
    {
      "number": 8,
      "problem": "Explain the ethical considerations of introducing invasive species.",
      "image": null,
      "step_by_step": [
        {
          "step": "Considerations",
          "explanation": "Introducing non-native species can disrupt ecosystems, outcompete native species, and raise moral questions about human intervention."
        }
      ],
      "final_answer": "Introducing invasive species raises ethical concerns about ecological disruption and human responsibility."
    },
    {
      "number": 9,
      "problem": "Explain the ethical considerations of using biotechnology in environmental management.",
      "image": null,
      "step_by_step": [
        {
          "step": "Considerations",
          "explanation": "Use of biotechnology to clean pollutants, control pests, or restore ecosystems must balance benefits, risks, and ecological integrity."
        }
      ],
      "final_answer": "Biotechnology in the environment must balance benefits, risks, and ecological impacts ethically."
    },
    {
      "number": 10,
      "problem": "Explain the role of environmental policies in promoting bioethics.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "Policies guide sustainable practices, protect biodiversity, regulate research, and ensure human and ecosystem welfare."
        }
      ],
      "final_answer": "Environmental policies promote bioethics by ensuring sustainability, conservation, and responsible research."
    }
  ]
}
