{
  "course": "Grade 12 Biology",
  "topic": "Evolution and Phylogenetics",
  "problems": [
    {
      "number": 1,
      "problem": "Define evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Evolution is the change in the heritable characteristics of populations over successive generations."
        }
      ],
      "final_answer": "Evolution is the change in heritable traits of populations over generations."
    },
    {
      "number": 2,
      "problem": "Define phylogenetics.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Phylogenetics is the study of evolutionary relationships among species using molecular, morphological, and genetic data."
        }
      ],
      "final_answer": "Phylogenetics studies evolutionary relationships among species."
    },
    {
      "number": 3,
      "problem": "Explain natural selection.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Natural selection is the process where individuals with advantageous traits survive and reproduce more successfully, passing traits to the next generation."
        }
      ],
      "final_answer": "Natural selection favors survival and reproduction of individuals with advantageous traits."
    },
    {
      "number": 4,
      "problem": "Explain the difference between microevolution and macroevolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Microevolution",
          "explanation": "Small-scale changes in allele frequencies within a population over a few generations."
        },
        {
          "step": "Macroevolution",
          "explanation": "Large-scale evolutionary changes that occur over long time periods, leading to the formation of new species or higher taxa."
        }
      ],
      "final_answer": "Microevolution: small changes in populations; Macroevolution: large changes forming new species."
    },
    {
      "number": 5,
      "problem": "Explain adaptive radiation with an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Adaptive radiation is the rapid evolution of multiple species from a common ancestor to occupy different ecological niches."
        },
        {
          "step": "Example",
          "explanation": "Darwin’s finches on the Galapagos Islands evolved different beak shapes for different food sources."
        }
      ],
      "final_answer": "Adaptive radiation: rapid evolution from a common ancestor; e.g., Darwin’s finches."
    },
    {
      "number": 6,
      "problem": "Explain the role of genetic drift in evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Genetic drift is the random change in allele frequencies in a population, especially significant in small populations."
        }
      ],
      "final_answer": "Genetic drift randomly changes allele frequencies, affecting evolution in small populations."
    },
    {
      "number": 7,
      "problem": "Explain the concept of common ancestry.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Common ancestry refers to the principle that species share ancestors in the evolutionary past, forming a tree-like pattern of descent."
        }
      ],
      "final_answer": "Common ancestry means species share ancestors, forming evolutionary lineages."
    },
    {
      "number": 8,
      "problem": "Explain the use of molecular data in phylogenetics.",
      "image": null,
      "step_by_step": [
        {
          "step": "Process",
          "explanation": "DNA, RNA, and protein sequences are compared across species to determine evolutionary relationships and construct phylogenetic trees."
        }
      ],
      "final_answer": "Molecular data reveal evolutionary relationships and help build phylogenetic trees."
    },
    {
      "number": 9,
      "problem": "Explain convergent and divergent evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Convergent evolution",
          "explanation": "Unrelated species evolve similar traits due to similar environmental pressures."
        },
        {
          "step": "Divergent evolution",
          "explanation": "Related species evolve different traits due to adaptation to different environments."
        }
      ],
      "final_answer": "Convergent: unrelated species become similar; Divergent: related species become different."
    },
    {
      "number": 10,
      "problem": "Explain how phylogenetic trees are interpreted.",
      "image": null,
      "step_by_step": [
        {
          "step": "Process",
          "explanation": "Branches represent evolutionary lineages; nodes indicate common ancestors; branch lengths can reflect genetic change or time."
        }
      ],
      "final_answer": "Phylogenetic trees show relationships, common ancestors, and evolutionary distances among species."
    }
  ]
}
