{
  "course": "Grade 12 Biology",
  "topic": "Molecular Genetics: Gene Regulation",
  "problems": [
    {
      "number": 1,
      "problem": "Define gene regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Gene regulation is the control of the timing, amount, and manner of gene expression in a cell."
        }
      ],
      "final_answer": "Gene regulation controls when, how much, and how genes are expressed."
    },
    {
      "number": 2,
      "problem": "Explain the role of promoters in gene regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Promoters are DNA sequences upstream of a gene where RNA polymerase binds to initiate transcription."
        }
      ],
      "final_answer": "Promoters are binding sites for RNA polymerase that initiate gene transcription."
    },
    {
      "number": 3,
      "problem": "Explain the role of operators in prokaryotic gene regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Operators are DNA segments that act as switches, controlling the access of RNA polymerase to genes."
        }
      ],
      "final_answer": "Operators control whether genes are transcribed by regulating RNA polymerase access."
    },
    {
      "number": 4,
      "problem": "Explain the role of repressors in gene regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Repressors are proteins that bind to operators to block transcription of specific genes."
        }
      ],
      "final_answer": "Repressors bind operators to inhibit gene transcription."
    },
    {
      "number": 5,
      "problem": "Explain the role of activators in gene regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Activators are proteins that bind to enhancer regions or promoters to increase transcription of specific genes."
        }
      ],
      "final_answer": "Activators enhance gene transcription by facilitating RNA polymerase binding."
    },
    {
      "number": 6,
      "problem": "Describe the lac operon in E. coli.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "The lac operon includes genes for lactose metabolism, a promoter, an operator, and a repressor gene."
        },
        {
          "step": "Function",
          "explanation": "In the absence of lactose, the repressor binds the operator, blocking transcription. When lactose is present, it binds the repressor, allowing transcription."
        }
      ],
      "final_answer": "Lac operon controls lactose metabolism; repressor blocks transcription unless lactose is present."
    },
    {
      "number": 7,
      "problem": "Explain how transcription factors regulate gene expression in eukaryotes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Transcription factors are proteins that bind DNA at promoters or enhancers to increase or decrease transcription of target genes."
        }
      ],
      "final_answer": "Transcription factors regulate eukaryotic gene expression by binding DNA and controlling transcription."
    },
    {
      "number": 8,
      "problem": "Explain the role of epigenetic modifications in gene regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Epigenetic modifications, like DNA methylation and histone acetylation, alter chromatin structure to activate or silence genes without changing the DNA sequence."
        }
      ],
      "final_answer": "Epigenetic modifications regulate gene activity by changing chromatin structure without altering DNA sequence."
    },
    {
      "number": 9,
      "problem": "Explain the role of RNA interference in gene regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "RNA interference (RNAi) involves small RNA molecules that bind to mRNA, leading to its degradation or blocking translation."
        }
      ],
      "final_answer": "RNA interference regulates genes by degrading or blocking mRNA translation."
    },
    {
      "number": 10,
      "problem": "Explain the importance of gene regulation in development and homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Importance",
          "explanation": "Gene regulation ensures that genes are expressed in the right cells at the right time, allowing proper development, differentiation, and maintenance of homeostasis."
        }
      ],
      "final_answer": "Gene regulation ensures correct spatial and temporal gene expression for development and homeostasis."
    }
  ]
}
