{
  "flashcards": [
    {
      "category": "Grade 10 Biology: Evolutionary Processes & Natural Selection",
      "cards": [
        {
          "front": "What is the definition of **Evolution** in biological terms?",
          "back": "The change in the heritable characteristics (genes) of a population over successive generations."
        },
        {
          "front": "Who is **Charles Darwin** and what is he famous for?",
          "back": "The English naturalist who proposed the theory of evolution by natural selection after his voyage on the HMS Beagle."
        },
        {
          "front": "What is **Natural Selection**?",
          "back": "The process where organisms better adapted to their environment tend to survive and produce more offspring, passing on their advantageous traits."
        },
        {
          "front": "What are the **Four Main Principles** that drive natural selection?",
          "back": "1. Variation in traits, 2. Heritability of traits, 3. Overproduction of offspring, 4. Differential survival and reproduction."
        },
        {
          "front": "What is a **Mutation** and what role does it play in evolution?",
          "back": "A random change in DNA. It is the ultimate source of new genetic variation upon which natural selection acts."
        },
        {
          "front": "What is an **Adaptation**?",
          "back": "A heritable trait that increases an organism's fitness (ability to survive and reproduce) in its specific environment."
        },
        {
          "front": "What is **Fitness** in evolutionary biology?",
          "back": "An organism's ability to survive, reproduce, and pass its genes to the next generation in a specific environment."
        },
        {
          "front": "What is the difference between **Structural**, **Behavioral**, and **Physiological** adaptations?",
          "back": "**Structural**: Physical features (e.g., camouflage). **Behavioral**: Actions (e.g., migration). **Physiological**: Internal processes (e.g., venom production)."
        },
        {
          "front": "What is **Selective Pressure**?",
          "back": "An environmental factor that causes some individuals to survive and reproduce better than others (e.g., predation, climate change, disease)."
        },
        {
          "front": "What is **Genetic Drift**?",
          "back": "A random change in allele frequencies in a small population, not due to natural selection (e.g., bottleneck effect, founder effect)."
        },
        {
          "front": "What is the **Bottleneck Effect**?",
          "back": "A sharp reduction in population size due to a random event (e.g., natural disaster), leading to loss of genetic variation."
        },
        {
          "front": "What is the **Founder Effect**?",
          "back": "When a small group breaks away from a larger population to colonize a new area, carrying only a fraction of the original genetic diversity."
        },
        {
          "front": "What is **Gene Flow**?",
          "back": "The transfer of genetic variation from one population to another through migration and breeding."
        },
        {
          "front": "What is **Speciation**?",
          "back": "The evolutionary process by which populations evolve to become distinct species, typically through reproductive isolation."
        },
        {
          "front": "What is **Reproductive Isolation**?",
          "back": "When two populations can no longer interbreed and produce fertile offspring. This is key to speciation."
        },
        {
          "front": "What is the difference between **Allopatric** and **Sympatric** speciation?",
          "back": "**Allopatric**: Speciation due to geographic isolation. **Sympatric**: Speciation without geographic isolation (e.g., through polyploidy or behavioral changes)."
        },
        {
          "front": "What is **Convergent Evolution**?",
          "back": "When unrelated species evolve similar traits independently due to adapting to similar environments (e.g., wings in birds and bats)."
        },
        {
          "front": "What is **Divergent Evolution**?",
          "back": "When closely related species evolve different traits, often due to adapting to different environments (e.g., Darwin's finches)."
        },
        {
          "front": "What is **Coevolution**?",
          "back": "When two or more species reciprocally affect each other's evolution (e.g., predator-prey relationships, flowers and pollinators)."
        },
        {
          "front": "What are **Homologous Structures**?",
          "back": "Structures in different species that are similar due to common ancestry, though they may have different functions (e.g., human arm, whale flipper, bat wing)."
        },
        {
          "front": "What are **Analogous Structures**?",
          "back": "Structures in different species that have similar functions but evolved independently, not from a common ancestor (e.g., insect wing and bird wing)."
        },
        {
          "front": "What are **Vestigial Structures**?",
          "back": "Remnants of structures that were functional in an ancestor but have lost most or all of their original function (e.g., human appendix, whale pelvic bones)."
        },
        {
          "front": "What is **Biogeography** and how does it support evolution?",
          "back": "The study of the geographic distribution of species. It shows that similar environments often contain species with similar adaptations, even if they are not closely related."
        },
        {
          "front": "What is **Comparative Embryology** and how does it support evolution?",
          "back": "The study of embryo development across species. It reveals similar early developmental stages among related species, indicating common ancestry."
        },
        {
          "front": "What is **Artificial Selection**?",
          "back": "Selective breeding by humans to develop desired traits in plants or animals (e.g., dog breeds, crop plants)."
        },
        {
          "front": "What is **Sexual Selection**?",
          "back": "A form of natural selection where individuals with certain inherited traits are more likely to obtain mates and reproduce (e.g., peacock tail, deer antlers)."
        },
        {
          "front": "What does '**Survival of the Fittest**' mean?",
          "back": "It refers to the individuals best adapted to their environment (highest fitness) being most likely to survive and reproduce, not necessarily the strongest."
        },
        {
          "front": "What is a **Gene Pool**?",
          "back": "The complete set of all alleles (gene variants) present in a population at a given time."
        },
        {
          "front": "What is **Allele Frequency**?",
          "back": "How common a specific allele is in a population's gene pool (expressed as a proportion or percentage)."
        },
        {
          "front": "What is **Stabilizing Selection**?",
          "back": "A type of natural selection that favors intermediate phenotypes and reduces variation (e.g., average birth weight in humans)."
        },
        {
          "front": "What is **Directional Selection**?",
          "back": "A type of natural selection that favors one extreme phenotype, shifting the population's traits in one direction (e.g., longer necks in giraffes)."
        },
        {
          "front": "What is **Disruptive Selection**?",
          "back": "A type of natural selection that favors both extreme phenotypes over intermediate ones, potentially leading to speciation (e.g., beak sizes in black-bellied seedcrackers)."
        },
        {
          "front": "What is the main difference between **Microevolution** and **Macroevolution**?",
          "back": "**Microevolution**: Small-scale changes in allele frequencies within a population over a few generations. **Macroevolution**: Large-scale evolutionary changes over long periods, leading to new species and higher taxonomic groups."
        }
      ]
    }
  ]
}
