{
  "unit_title": "Introduction to Magnetic Fields",
  "unit_number": "Unit 9.7",
  "grade_level": "Grade 11",
  "subject": "Physics",
  "duration": "4-5 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "Fundamental introduction to magnetic fields, their sources, properties, and basic interactions. Covers permanent magnets, magnetic fields around current-carrying conductors, and the relationship between electricity and magnetism.",

  "learning_objectives": [
    "Describe the properties of magnetic poles and magnetic fields",
    "Calculate magnetic field strength around straight conductors",
    "Apply the right-hand rule for magnetic field direction",
    "Understand magnetic field interactions between currents",
    "Describe magnetic materials and their properties",
    "Solve basic problems involving magnetic forces on moving charges"
  ],

  "prerequisites": [
    "Basic concepts of electric fields",
    "Current and voltage relationships",
    "Vector concepts and direction",
    "Force and motion principles",
    "Basic trigonometry"
  ],

  "core_concept": {
    "principle": "Magnetic fields are vector fields produced by moving charges (currents) and magnetic materials. They exert forces on other moving charges and magnetic materials, with field direction defined by the right-hand rule and strength determined by current magnitude and geometry.",
    "explanation": "Magnetism arises from the motion of electric charges at both atomic and macroscopic scales. Magnetic fields are fundamentally different from electric fields in their sources and the nature of forces they exert, though the two phenomena are intimately related through electromagnetism.",
    "image": {
      "url": "images/magnetism-core.png",
      "alt": "Magnetic field fundamental concepts",
      "caption": "Magnetic fields originate from moving charges and magnetic materials"
    }
  },

  "sections": [
    {
      "section_title": "1. Magnetic Fields and Their Properties",
      "introduction": "Magnetic fields are fundamental force fields that surround magnets and electric currents. Understanding their basic properties and visualization is essential for studying electromagnetic phenomena.",
      "image": {
        "url": "images/magnetic-fields-intro.png",
        "alt": "Magnetic field properties and visualization",
        "caption": "Magnetic fields can be visualized using field lines and measured using test objects"
      },

      "key_concept": {
        "definition": "Magnetic Field (B): A vector field that exerts forces on moving charges and magnetic materials. Measured in teslas (T) or gauss (1 T = 10,000 G). Magnetic field lines form continuous closed loops from north to south poles externally and south to north internally. Unlike electric fields, there are no magnetic monopoles.",
        "context": "Magnetic fields are detected by their effects: torque on magnetic dipoles, force on moving charges, and induction of currents in conductors. The field direction at any point is tangent to the field line, and density indicates field strength.",
        "image": {
          "url": "images/magnetic-field-properties.png",
          "alt": "Magnetic field properties and characteristics",
          "caption": "Magnetic fields have unique properties including continuous field lines and dipole nature"
        }
      },

      "classifications": [
        {
          "type": "Magnetic Field Sources",
          "value": "Different origins of magnetic fields",
          "characteristics": [
            "Permanent magnets",
            "Current-carrying conductors",
            "Electromagnets",
            "Earth's magnetic field",
            "Atomic magnetic moments"
          ],
          "behavior": "All magnetic fields ultimately arise from moving electric charges, either at atomic scale (electron spin and orbital motion) or macroscopic scale (electric currents)",
          "examples": [
            {
              "process": "Permanent Magnets",
              "explanation": "Materials with aligned atomic magnetic moments creating persistent magnetic fields without external current",
              "image": {
                "url": "images/permanent-magnets.png",
                "alt": "Permanent magnet field patterns",
                "caption": "Permanent magnets exhibit characteristic dipole field patterns"
              }
            },
            {
              "process": "Current-Carrying Conductors",
              "explanation": "Moving charges in wires produce circular magnetic fields around the conductor",
              "image": {
                "url": "images/current-field.png",
                "alt": "Magnetic field around current-carrying wire",
                "caption": "Current-carrying conductors generate concentric circular magnetic fields"
              }
            }
          ],
          "note": "The fundamental source of all magnetism is moving electric charges. Even permanent magnet fields arise from the orbital and spin motion of electrons within atoms."
        }
      ],

      "principles": [
        {
          "principle": "Right-Hand Rule for Magnetic Fields",
          "statement": "For a straight current-carrying conductor: Point thumb in direction of conventional current (+ to -), curled fingers show direction of magnetic field lines. For a current loop: Curl fingers in current direction, thumb points toward north pole. For a solenoid: Use same rule as current loop, with thumb pointing toward north pole.",
          "application": "Use to determine magnetic field direction around straight wires, circular loops, and solenoids. Essential for predicting field patterns and understanding electromagnetic devices.",
          "example": "For vertical wire carrying current upward, magnetic field circles counterclockwise when viewed from above",
          "analogy": "Like determining the swirl direction when stirring a liquid - the current direction determines the rotational direction of the field",
          "image": {
            "url": "images/right-hand-rule.png",
            "alt": "Right-hand rule applications",
            "caption": "The right-hand rule determines magnetic field direction from current direction"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Magnetic Field Around Straight Conductor",
          "problem": "A long straight wire carries 5A current vertically upward. Determine magnetic field magnitude and direction at a point 2cm east of the wire.",
          "step_by_step": [
            {
              "step": "Identify known values",
              "explanation": "I = 5A, r = 0.02m, μ₀ = 4π×10⁻⁷ T·m/A"
            },
            {
              "step": "Apply formula for straight wire",
              "explanation": "B = μ₀I/(2πr) = (4π×10⁻⁷ × 5)/(2π × 0.02)"
            },
            {
              "step": "Calculate magnitude",
              "explanation": "B = (2×10⁻⁶)/(0.02) = 1×10⁻⁴ T = 0.1 mT"
            },
            {
              "step": "Determine direction",
              "explanation": "Right-hand rule: thumb up (current), fingers curl counterclockwise. At east point, field points north"
            }
          ],
          "final_answer": "Magnetic field = 0.1 mT directed north. Field circles the wire counterclockwise when viewed from above.",
          "concept_applied": "Magnetic field calculation for straight current-carrying conductor",
          "image": {
            "url": "images/straight-wire-field.png",
            "alt": "Magnetic field around straight wire",
            "caption": "Straight conductors produce circular magnetic fields with strength inversely proportional to distance"
          }
        }
      ]
    },
    {
      "section_title": "2. Magnetic Forces and Interactions",
      "introduction": "Magnetic fields exert forces on moving charges and current-carrying conductors. Understanding these interactions is crucial for applications ranging from electric motors to particle accelerators.",
      "image": {
        "url": "images/magnetic-forces-intro.png",
        "alt": "Magnetic forces and interactions",
        "caption": "Magnetic fields exert forces on moving charges and current-carrying conductors"
      },

      "key_concept": {
        "definition": "Magnetic Force on Moving Charge: F = q(v × B) where q is charge, v is velocity vector, B is magnetic field vector. The force is perpendicular to both velocity and field directions. Magnetic Force on Current: F = I(L × B) where I is current, L is length vector in current direction. Like currents attract, unlike currents repel.",
        "context": "Magnetic forces differ fundamentally from electric forces: they act only on moving charges, are always perpendicular to motion, and do no work (cannot change kinetic energy, only direction).",
        "image": {
          "url": "images/magnetic-force-vectors.png",
          "alt": "Magnetic force vector relationships",
          "caption": "Magnetic force vectors follow cross-product relationships with velocity and field"
        }
      },

      "classifications": [
        {
          "type": "Magnetic Force Configurations",
          "value": "Different scenarios for magnetic force calculations",
          "characteristics": [
            "Force on single moving charge",
            "Force on current-carrying conductor",
            "Force between parallel currents",
            "Torque on current loops",
            "Circular motion of charged particles"
          ],
          "behavior": "Magnetic forces cause curved motion of charged particles, mechanical forces on conductors, and rotational torques on current loops",
          "examples": [
            {
              "process": "Charged Particle Motion",
              "explanation": "Perpendicular force causes circular motion; parallel component unaffected",
              "image": {
                "url": "images/charged-particle-motion.png",
                "alt": "Charged particle in magnetic field",
                "caption": "Charged particles follow helical paths in uniform magnetic fields"
              }
            },
            {
              "process": "Parallel Current Interaction",
              "explanation": "Like currents attract due to magnetic field interactions; unlike currents repel",
              "image": {
                "url": "images/parallel-currents.png",
                "alt": "Force between parallel currents",
                "caption": "Parallel currents exert attractive or repulsive forces depending on direction"
              }
            }
          ],
          "note": "The magnetic force on a stationary charge is zero, and the force is maximum when velocity is perpendicular to the field. The force does no work because it's always perpendicular to displacement."
        }
      ],

      "principles": [
        {
          "principle": "Lorentz Force Law",
          "statement": "The total electromagnetic force on a charged particle is F = qE + q(v × B), where qE is the electric force and q(v × B) is the magnetic force. The magnetic component is perpendicular to both velocity and magnetic field vectors, following the right-hand rule for positive charges (reverse for negative charges).",
          "application": "Use for analyzing motion of charged particles in combined electric and magnetic fields, essential for understanding cathode ray tubes, mass spectrometers, and particle accelerators.",
          "example": "For proton moving east in magnetic field pointing north, force is vertically upward (right-hand rule)",
          "analogy": "Like a river current (magnetic field) pushing a boat (charged particle) sideways - the push is always perpendicular to both the boat's heading and the current direction",
          "image": {
            "url": "images/lorentz-force.png",
            "alt": "Lorentz force principle",
            "caption": "Lorentz force combines electric and magnetic effects on moving charges"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Force on Current-Carrying Conductor",
          "problem": "A 0.5m wire carrying 4A current lies in a uniform 0.2T magnetic field. The wire is oriented 30° to the field. Calculate the magnetic force on the wire.",
          "step_by_step": [
            {
              "step": "Identify known values",
              "explanation": "I = 4A, L = 0.5m, B = 0.2T, θ = 30°"
            },
            {
              "step": "Apply force formula",
              "explanation": "F = ILBsinθ = 4 × 0.5 × 0.2 × sin30°"
            },
            {
              "step": "Calculate sin30°",
              "explanation": "sin30° = 0.5"
            },
            {
              "step": "Compute force",
              "explanation": "F = 4 × 0.5 × 0.2 × 0.5 = 0.2N"
            },
            {
              "step": "Determine direction",
              "explanation": "Right-hand rule: point fingers in current direction, curl toward field direction, thumb shows force direction"
            }
          ],
          "final_answer": "Magnetic force = 0.2N perpendicular to both current and field directions. Maximum force occurs when conductor is perpendicular to field.",
          "concept_applied": "Magnetic force on current-carrying conductor",
          "image": {
            "url": "images/wire-force-example.png",
            "alt": "Force on current-carrying wire",
            "caption": "Magnetic force on conductors depends on current, length, field strength, and orientation"
          }
        }
      ]
    },
    {
      "section_title": "3. Magnetic Materials and Earth's Field",
      "introduction": "Materials respond differently to magnetic fields, classified by their magnetic properties. Understanding these categories and Earth's natural magnetic field completes our fundamental picture of magnetism.",
      "image": {
        "url": "images/magnetic-materials-intro.png",
        "alt": "Magnetic materials and Earth's field",
        "caption": "Materials exhibit different magnetic behaviors, and Earth itself acts as a giant magnet"
      },

      "key_concept": {
        "definition": "Diamagnetic: Weakly repelled by magnetic fields (all materials have diamagnetic component). Paramagnetic: Weakly attracted to magnetic fields. Ferromagnetic: Strongly attracted, can become permanently magnetized (iron, nickel, cobalt). Earth's Magnetic Field: Approximately dipole field with magnetic poles near geographic poles, providing navigation reference and protection from solar radiation.",
        "context": "Material magnetic properties arise from electron configurations and spin alignments. Earth's field is generated by dynamo action in the molten outer core and undergoes periodic reversals.",
        "image": {
          "url": "images/magnetic-material-types.png",
          "alt": "Classification of magnetic materials",
          "caption": "Materials are classified by their response to external magnetic fields"
        }
      },

      "classifications": [
        {
          "type": "Magnetic Material Categories",
          "value": "Classification based on magnetic susceptibility",
          "characteristics": [
            "Diamagnetic: χ < 0, weak repulsion",
            "Paramagnetic: χ > 0, weak attraction",
            "Ferromagnetic: χ >> 0, strong attraction",
            "Ferrimagnetic: Complex ordered structure",
            "Antiferromagnetic: Alternating spin alignment"
          ],
          "behavior": "Diamagnetic materials create opposing fields, paramagnetic partially align with external fields, ferromagnetic strongly align and retain magnetization",
          "examples": [
            {
              "process": "Ferromagnetic Domains",
              "explanation": "Regions within material where atomic magnetic moments are aligned; external fields cause domain growth and rotation",
              "image": {
                "url": "images/magnetic-domains.png",
                "alt": "Magnetic domain structure",
                "caption": "Ferromagnetic materials contain domains that align under external fields"
              }
            },
            {
              "process": "Earth's Magnetic Field",
              "explanation": "Generated by convection currents in molten iron core, tilted about 11° from rotation axis",
              "image": {
                "url": "images/earths-magnetic-field.png",
                "alt": "Earth's magnetic field structure",
                "caption": "Earth's magnetic field resembles a giant bar magnet tilted from geographic poles"
              }
            }
          ],
          "note": "Ferromagnetic materials exhibit hysteresis - their magnetization depends on history of applied fields. Above the Curie temperature, ferromagnetic materials become paramagnetic."
        }
      ],

      "principles": [
        {
          "principle": "Magnetic Domains and Hysteresis",
          "statement": "Ferromagnetic materials contain microscopic regions called domains where atomic magnetic moments are aligned. External magnetic fields cause domain walls to move (favorably oriented domains grow) and domains to rotate. Hysteresis occurs because the alignment process isn't perfectly reversible - energy is lost as heat when reversing magnetization, creating a hysteresis loop on B-H graphs.",
          "application": "Understanding hysteresis is crucial for designing transformers (minimize losses), magnetic memory (retain information), and permanent magnets (maintain magnetization).",
          "example": "Hard magnetic materials have wide hysteresis loops (good for permanent magnets), soft materials have narrow loops (good for transformers)",
          "analogy": "Like rearranging furniture in a room - easy to arrange initially, but returning to exact original arrangement requires extra effort and energy",
          "image": {
            "url": "images/hysteresis-loop.png",
            "alt": "Magnetic hysteresis loop",
            "caption": "Hysteresis loops show how magnetization lags behind applied field changes"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Charged Particle in Magnetic Field",
          "problem": "A proton (m=1.67×10⁻²⁷ kg, q=1.6×10⁻¹⁹ C) enters a 0.5T uniform magnetic field perpendicularly with speed 2×10⁶ m/s. Calculate the radius of its circular path.",
          "step_by_step": [
            {
              "step": "Identify known values",
              "explanation": "m = 1.67×10⁻²⁷ kg, q = 1.6×10⁻¹⁹ C, B = 0.5T, v = 2×10⁶ m/s, θ = 90°"
            },
            {
              "step": "Magnetic force provides centripetal force",
              "explanation": "qvB = mv²/r"
            },
            {
              "step": "Solve for radius",
              "explanation": "r = mv/(qB)"
            },
            {
              "step": "Substitute values",
              "explanation": "r = (1.67×10⁻²⁷ × 2×10⁶)/(1.6×10⁻¹⁹ × 0.5)"
            },
            {
              "step": "Calculate",
              "explanation": "r = (3.34×10⁻²¹)/(8×10⁻²⁰) = 0.04175 m"
            }
          ],
          "final_answer": "Radius of circular path = 4.18 cm. The proton will follow a circular trajectory perpendicular to the magnetic field.",
          "concept_applied": "Circular motion of charged particles in magnetic fields",
          "image": {
            "url": "images/circular-motion-charge.png",
            "alt": "Charged particle circular motion",
            "caption": "Perpendicular magnetic fields cause charged particles to follow circular paths"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Magnetic field",
    "Tesla",
    "Right-hand rule",
    "Magnetic force",
    "Lorentz force",
    "Magnetic pole",
    "Diamagnetic",
    "Paramagnetic",
    "Ferromagnetic",
    "Magnetic domain",
    "Hysteresis"
  ],

  "common_misconceptions": [
    "Thinking magnetic field lines actually exist as physical entities",
    "Believing magnetic monopoles exist",
    "Confusing magnetic field direction with force direction",
    "Thinking magnetic forces can do work on charges",
    "Believing all metals are magnetic",
    "Confusing geographic and magnetic poles"
  ],

  "real_world_applications": [
    "Electric motors and generators",
    "Magnetic resonance imaging (MRI)",
    "Compass navigation",
    "Particle accelerators",
    "Magnetic levitation trains",
    "Credit card stripes",
    "Computer hard drives",
    "Loudspeakers and microphones"
  ],

  "summary": "Magnetic fields are vector fields produced by moving charges and magnetic materials, measured in teslas. Field direction follows right-hand rules relative to current direction. Magnetic forces act perpendicular to both field and velocity/current directions, following F = q(v×B) for charges and F = I(L×B) for currents. Materials are classified as diamagnetic (weakly repelled), paramagnetic (weakly attracted), or ferromagnetic (strongly attracted, can be permanently magnetized). Earth's magnetic field provides natural navigation reference and radiation protection. Magnetic forces cause circular motion of charged particles and are fundamental to numerous technologies from electric motors to medical imaging."
}
