{
  "unit_title": "Magnetic Force on Moving Charges",
  "unit_number": "Unit 9.8",
  "grade_level": "Grade 11",
  "subject": "Physics",
  "duration": "4-5 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "Detailed study of the magnetic force experienced by moving charged particles (Lorentz force), including direction determination, magnitude calculation, and resulting motion patterns in uniform magnetic fields.",

  "learning_objectives": [
    "Calculate magnetic force magnitude on moving charges",
    "Apply right-hand rules for force direction determination",
    "Analyze circular motion of charges in perpendicular magnetic fields",
    "Solve problems involving helical motion in magnetic fields",
    "Apply Lorentz force law to practical situations",
    "Understand magnetic confinement and particle accelerators"
  ],

  "prerequisites": [
    "Vector cross product concepts",
    "Circular motion dynamics",
    "Basic magnetism principles",
    "Kinematics of charged particles",
    "Right-hand rule for magnetic fields"
  ],

  "core_concept": {
    "principle": "A moving charged particle experiences a magnetic force perpendicular to both its velocity vector and the magnetic field vector, given by F = q(v × B). This force changes the particle's direction but not its speed, causing curved trajectories.",
    "explanation": "The magnetic component of the Lorentz force acts as a steering force that deflects charged particles without changing their kinetic energy. The resulting motion depends on the angle between velocity and field vectors, ranging from straight-line motion to circular or helical paths.",
    "image": {
      "url": "images/lorentz-force-core.png",
      "alt": "Lorentz force on moving charge",
      "caption": "Magnetic force is perpendicular to both velocity and magnetic field directions"
    }
  },

  "sections": [
    {
      "section_title": "1. Lorentz Force Law and Direction Rules",
      "introduction": "The fundamental relationship describing magnetic force on moving charges requires understanding vector cross products and systematic methods for determining force direction in three-dimensional space.",
      "image": {
        "url": "images/lorentz-law-intro.png",
        "alt": "Lorentz force law fundamentals",
        "caption": "The Lorentz force law combines electric and magnetic forces on charged particles"
      },

      "key_concept": {
        "definition": "Lorentz Force Law: F = qE + q(v × B), where the magnetic force component is F_magnetic = q(v × B). Magnitude: F = |q|vBsinθ, where θ is the angle between v and B. Direction: Perpendicular to both v and B, following right-hand rule for positive charges (reverse for negative charges).",
        "context": "The magnetic force is unique because it depends on the charge's motion and is always perpendicular to that motion. This means magnetic forces do no work and cannot change kinetic energy, only direction.",
        "image": {
          "url": "images/force-direction-rules.png",
          "alt": "Magnetic force direction determination",
          "caption": "Multiple right-hand rules help determine magnetic force direction"
        }
      },

      "classifications": [
        {
          "type": "Direction Determination Methods",
          "value": "Systematic approaches for finding magnetic force direction",
          "characteristics": [
            "Right-hand rule (positive charges)",
            "Left-hand rule (negative charges)",
            "Vector cross product calculation",
            "Mnemonic devices for common configurations",
            "3D spatial visualization techniques"
          ],
          "behavior": "All methods yield the same physical result: force perpendicular to the plane containing v and B, with sense determined by charge sign and relative directions",
          "examples": [
            {
              "process": "Standard Right-Hand Rule",
              "explanation": "Point fingers in v direction, curl toward B direction, thumb shows F direction for positive charges",
              "image": {
                "url": "images/standard-right-hand.png",
                "alt": "Standard right-hand rule",
                "caption": "The standard right-hand rule determines force direction for positive charges"
              }
            },
            {
              "process": "Alternative Right-Hand Rule",
              "explanation": "Thumb in v direction, fingers in B direction, palm pushes in F direction for positive charges",
              "image": {
                "url": "images/alternative-right-hand.png",
                "alt": "Alternative right-hand rule",
                "caption": "Alternative right-hand rule uses palm direction for force"
              }
            }
          ],
          "note": "For negative charges, use left hand instead of right hand, or use right hand and reverse the result. The force direction reverses when either the charge sign or velocity direction reverses."
        }
      ],

      "principles": [
        {
          "principle": "Magnetic Force Work Theorem",
          "statement": "Magnetic forces do no work on charged particles. Since F_magnetic is always perpendicular to v, the power P = F·v = 0. Therefore, magnetic forces cannot change the kinetic energy of charged particles, only their direction of motion. The speed remains constant in pure magnetic fields.",
          "application": "This explains why charged particles follow curved paths at constant speed in magnetic fields, and why magnetic fields alone cannot accelerate particles. Electric fields are required for energy changes.",
          "example": "In a cyclotron, electric fields between dees accelerate particles, while magnetic fields curve their paths without changing speed",
          "analogy": "Like a string tension on a ball in circular motion - the force is perpendicular to motion, changing direction but not speed",
          "image": {
            "url": "images/no-work-theorem.png",
            "alt": "Magnetic force does no work",
            "caption": "Magnetic force is always perpendicular to velocity, so it cannot change kinetic energy"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Basic Lorentz Force Calculation",
          "problem": "A proton (q=+1.6×10⁻¹⁹ C) moves with velocity 3×10⁶ m/s east in a magnetic field 0.4 T directed vertically upward. Find the magnetic force magnitude and direction.",
          "step_by_step": [
            {
              "step": "Identify known values",
              "explanation": "q=1.6×10⁻¹⁹ C, v=3×10⁶ m/s, B=0.4 T, θ=90° (velocity perpendicular to field)"
            },
            {
              "step": "Calculate force magnitude",
              "explanation": "F = qvBsinθ = (1.6×10⁻¹⁹)(3×10⁶)(0.4)(1) = 1.92×10⁻¹³ N"
            },
            {
              "step": "Determine direction",
              "explanation": "Right-hand rule: point fingers east (v), curl upward toward B, thumb points north"
            },
            {
              "step": "Verify with cross product",
              "explanation": "v (east) × B (up) = direction north for positive charge"
            }
          ],
          "final_answer": "Magnetic force = 1.92×10⁻¹³ N directed north. The force is perpendicular to both the eastward velocity and upward field.",
          "concept_applied": "Basic Lorentz force calculation with direction determination",
          "image": {
            "url": "images/basic-lorentz-example.png",
            "alt": "Basic Lorentz force example",
            "caption": "Lorentz force calculations require both magnitude and direction determination"
          }
        }
      ]
    },
    {
      "section_title": "2. Motion of Charged Particles in Magnetic Fields",
      "introduction": "The perpendicular nature of magnetic forces causes charged particles to follow characteristic trajectories ranging from straight lines to circles to helices, depending on their velocity orientation relative to the field.",
      "image": {
        "url": "images/charged-particle-motion-intro.png",
        "alt": "Charged particle motion in magnetic fields",
        "caption": "Charged particles follow different trajectories depending on velocity orientation"
      },

      "key_concept": {
        "definition": "Three cases of charged particle motion in uniform B fields: (1) v parallel to B (θ=0°): No magnetic force, straight-line motion. (2) v perpendicular to B (θ=90°): Circular motion with radius r = mv/(|q|B) and period T = 2πm/(|q|B). (3) v at angle to B: Helical motion combining circular motion perpendicular to B and constant velocity parallel to B.",
        "context": "The magnetic force provides the centripetal acceleration for circular motion components. The motion's characteristics reveal fundamental particle properties used in mass spectrometers and particle physics.",
        "image": {
          "url": "images/motion-types.png",
          "alt": "Types of charged particle motion",
          "caption": "Velocity orientation relative to magnetic field determines trajectory type"
        }
      },

      "classifications": [
        {
          "type": "Particle Trajectory Types",
          "value": "Classification based on velocity-field angle",
          "characteristics": [
            "Straight-line motion (θ=0° or 180°)",
            "Circular motion (θ=90°)",
            "Helical motion (0°<θ<90°)",
            "Complex paths in non-uniform fields",
            "Cycloid motion in crossed E and B fields"
          ],
          "behavior": "The perpendicular velocity component determines circular motion radius, while parallel component determines pitch of helical motion. All motions occur at constant speed.",
          "examples": [
            {
              "process": "Circular Motion Analysis",
              "explanation": "Magnetic force equals centripetal force: qvB = mv²/r → r = mv/(qB). Period is independent of speed.",
              "image": {
                "url": "images/circular-motion-analysis.png",
                "alt": "Circular motion of charged particles",
                "caption": "Perpendicular magnetic fields cause uniform circular motion"
              }
            },
            {
              "process": "Helical Motion Parameters",
              "explanation": "Radius r = mv_perp/(qB), pitch p = v_parallel × T = v_parallel × 2πm/(qB)",
              "image": {
                "url": "images/helical-motion.png",
                "alt": "Helical motion in magnetic fields",
                "caption": "Helical motion combines circular and linear components"
              }
            }
          ],
          "note": "The cyclotron frequency ω = qB/m is independent of particle speed, a key principle exploited in cyclotron accelerators. Heavier particles have larger radii for the same speed and field strength."
        }
      ],

      "principles": [
        {
          "principle": "Magnetic Confinement and Cyclotron Motion",
          "statement": "Charged particles can be confined by magnetic fields since they follow curved paths back toward their origin. In uniform fields, particles execute circular motion with frequency f_cyclotron = qB/(2πm) independent of speed. This principle enables magnetic confinement in fusion reactors and particle acceleration in cyclotrons.",
          "application": "Used in tokamaks for nuclear fusion research, mass spectrometers for chemical analysis, cyclotrons for medical isotope production, and magnetic bottles for plasma confinement.",
          "example": "In a mass spectrometer, different mass-to-charge ratios follow different curved paths, enabling separation and identification",
          "analogy": "Like tetherball on a rope - the constraint force keeps the ball moving in curved paths around the pole",
          "image": {
            "url": "images/magnetic-confinement.png",
            "alt": "Magnetic confinement principle",
            "caption": "Magnetic fields can confine charged particles to bounded regions"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Electron in Magnetic Field",
          "problem": "An electron (m=9.11×10⁻³¹ kg, q=-1.6×10⁻¹⁹ C) moves at 2×10⁶ m/s perpendicular to a 0.01 T magnetic field. Find the radius and period of its circular path.",
          "step_by_step": [
            {
              "step": "Identify known values",
              "explanation": "m=9.11×10⁻³¹ kg, |q|=1.6×10⁻¹⁹ C, v=2×10⁶ m/s, B=0.01 T"
            },
            {
              "step": "Calculate radius",
              "explanation": "r = mv/(|q|B) = (9.11×10⁻³¹ × 2×10⁶)/(1.6×10⁻¹⁹ × 0.01)"
            },
            {
              "step": "Compute radius",
              "explanation": "r = (1.822×10⁻²⁴)/(1.6×10⁻²¹) = 1.14×10⁻³ m = 1.14 mm"
            },
            {
              "step": "Calculate period",
              "explanation": "T = 2πm/(|q|B) = (2π × 9.11×10⁻³¹)/(1.6×10⁻¹⁹ × 0.01)"
            },
            {
              "step": "Compute period",
              "explanation": "T = (5.72×10⁻³⁰)/(1.6×10⁻²¹) = 3.58×10⁻⁹ s = 3.58 ns"
            }
          ],
          "final_answer": "Radius = 1.14 mm, Period = 3.58 ns. The electron circles 280 million times per second in this field.",
          "concept_applied": "Circular motion of charged particles in perpendicular magnetic fields",
          "image": {
            "url": "images/electron-circular-motion.png",
            "alt": "Electron circular motion calculation",
            "caption": "Electrons follow tight circular paths in magnetic fields due to their small mass"
          }
        }
      ]
    },
    {
      "section_title": "3. Applications and Crossed Field Configurations",
      "introduction": "The motion of charged particles in combined electric and magnetic fields enables important technological applications and reveals fundamental principles of electromagnetic interactions.",
      "image": {
        "url": "images/applications-intro.png",
        "alt": "Applications of magnetic forces on charges",
        "caption": "Magnetic force applications range from particle accelerators to everyday electronics"
      },

      "key_concept": {
        "definition": "Velocity Selector: Crossed E and B fields where particles with specific velocity v = E/B pass undeflected. Mass Spectrometer: Uses magnetic deflection to separate ions by mass-to-charge ratio. Hall Effect: Moving charges in conductors experience transverse forces creating measurable voltages. Cyclotron: Particle accelerator using constant magnetic field and oscillating electric field.",
        "context": "These applications exploit the velocity-dependent nature of magnetic forces and the different responses of particles based on their charge, mass, and speed. Crossed field configurations provide powerful tools for particle control and measurement.",
        "image": {
          "url": "images/crossed-field-applications.png",
          "alt": "Crossed field applications overview",
          "caption": "Combined electric and magnetic fields enable precise particle control"
        }
      },

      "classifications": [
        {
          "type": "Crossed Field Devices",
          "value": "Devices using perpendicular E and B fields",
          "characteristics": [
            "Velocity selectors: E⊥B, select specific velocity",
            "Mass spectrometers: Separate by m/q ratio",
            "Thomson e/m apparatus: Historical charge-mass measurement",
            "Cyclotrons: Particle acceleration",
            "Hall probes: Magnetic field measurement"
          ],
          "behavior": "In crossed fields, electric and magnetic forces can balance for specific particle velocities, enabling velocity selection and precise particle manipulation",
          "examples": [
            {
              "process": "Velocity Selector Operation",
              "explanation": "When qE = qvB → v = E/B, particles pass straight through; others are deflected",
              "image": {
                "url": "images/velocity-selector.png",
                "alt": "Velocity selector principle",
                "caption": "Velocity selectors use balanced electric and magnetic forces"
              }
            },
            {
              "process": "Mass Spectrometer Analysis",
              "explanation": "After velocity selection, magnetic deflection radius r = mv/(qB) reveals m/q ratio",
              "image": {
                "url": "images/mass-spectrometer.png",
                "alt": "Mass spectrometer operation",
                "caption": "Mass spectrometers separate ions by mass-to-charge ratio using magnetic deflection"
              }
            }
          ],
          "note": "In Hall effect devices, the equilibrium Hall voltage V_H = IB/(nqt) where n is charge carrier density, t is thickness. This enables magnetic field measurement and material characterization."
        }
      ],

      "principles": [
        {
          "principle": "Velocity Selector Principle",
          "statement": "When electric and magnetic fields are perpendicular to each other and both perpendicular to particle velocity, particles experience opposing forces F_electric = qE and F_magnetic = qvB. When these forces balance (E = vB), particles travel undeflected. Particles with different velocities are deflected upward or downward, enabling velocity selection.",
          "application": "Used in mass spectrometers, particle beam preparation, and experimental physics to obtain monoenergetic particle beams. Essential for precise particle experiments.",
          "example": "With E=1000 V/m and B=0.01 T, only particles with v=100,000 m/s pass undeflected",
          "analogy": "Like a wind tunnel with crosswinds - only objects with exactly the right speed travel straight through",
          "image": {
            "url": "images/velocity-selector-detailed.png",
            "alt": "Velocity selector detailed operation",
            "caption": "Velocity selectors filter particles by balancing electric and magnetic forces"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Mass Spectrometer Calculation",
          "problem": "In a mass spectrometer, singly ionized atoms (q=+1.6×10⁻¹⁹ C) are accelerated through 1000V, then enter a 0.1T magnetic field perpendicularly. If they curve with radius 0.2m, find their mass.",
          "step_by_step": [
            {
              "step": "Find velocity from acceleration",
              "explanation": "qV = ½mv² → v = √(2qV/m)"
            },
            {
              "step": "Magnetic force equation",
              "explanation": "qvB = mv²/r → m = qBr/v"
            },
            {
              "step": "Combine equations",
              "explanation": "m = qBr/√(2qV/m) → m³/² = qBr/√(2qV)"
            },
            {
              "step": "Solve for m",
              "explanation": "m = (qB²r²)/(2V)"
            },
            {
              "step": "Substitute values",
              "explanation": "m = (1.6×10⁻¹⁹ × 0.1² × 0.2²)/(2 × 1000)"
            },
            {
              "step": "Calculate mass",
              "explanation": "m = (1.6×10⁻¹⁹ × 0.01 × 0.04)/2000 = (6.4×10⁻²³)/2000 = 3.2×10⁻²⁶ kg"
            },
            {
              "step": "Convert to atomic mass",
              "explanation": "m = 3.2×10⁻²⁶ kg ÷ 1.66×10⁻²⁷ kg/u ≈ 19.3 u (potassium isotope)"
            }
          ],
          "final_answer": "Mass = 3.2×10⁻²⁶ kg or about 19.3 atomic mass units. This identifies the atoms as potassium-39 ions.",
          "concept_applied": "Mass spectrometer analysis combining energy and magnetic deflection",
          "image": {
            "url": "images/mass-spec-calculation.png",
            "alt": "Mass spectrometer calculation",
            "caption": "Mass spectrometers determine atomic masses from magnetic deflection measurements"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Lorentz force",
    "Magnetic force",
    "Right-hand rule",
    "Cyclotron motion",
    "Helical motion",
    "Velocity selector",
    "Mass spectrometer",
    "Hall effect",
    "Cyclotron frequency",
    "Magnetic confinement"
  ],

  "common_misconceptions": [
    "Thinking magnetic forces can accelerate charges",
    "Believing magnetic fields affect stationary charges",
    "Confusing electric and magnetic force directions",
    "Thinking all charged particles follow circular paths",
    "Believing magnetic force depends on charge magnitude only",
    "Confusing radius and period dependencies in circular motion"
  ],

  "real_world_applications": [
    "Mass spectrometers for chemical analysis",
    "Particle accelerators for research and medicine",
    "Cathode ray tubes and old TVs",
    "Hall effect sensors in devices",
    "Magnetic confinement fusion",
    "Spacecraft radiation shielding",
    "Medical isotope production",
    "Jupiter's radiation belts"
  ],

  "summary": "Moving charged particles experience magnetic forces F = q(v×B) perpendicular to both velocity and field. This force causes curved trajectories: circular motion when v⊥B, helical motion when v at an angle, and straight motion when v∥B. The circular radius r=mv/(qB) and period T=2πm/(qB) reveal particle properties. Applications include velocity selectors (v=E/B for undeflected motion), mass spectrometers (separating by m/q ratio), cyclotrons (particle acceleration), and Hall effect devices (magnetic field measurement). Magnetic forces do no work, changing only direction not speed of charged particles."
}
