{
  "unit_title": "Magnetic Force on Current-Carrying Wires",
  "unit_number": "Unit 9.9",
  "grade_level": "Grade 11",
  "subject": "Physics",
  "duration": "4-5 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "Comprehensive study of magnetic forces on current-carrying conductors, including force calculations, direction determination, and applications in electric motors and other electromagnetic devices.",

  "learning_objectives": [
    "Calculate magnetic force on straight current-carrying conductors",
    "Apply right-hand rules for force direction on wires",
    "Analyze forces on current loops and solenoids",
    "Understand torque on current loops in magnetic fields",
    "Solve problems involving parallel current-carrying wires",
    "Apply principles to electric motors and galvanometers"
  ],

  "prerequisites": [
    "Magnetic force on moving charges",
    "Current and resistance concepts",
    "Vector cross products",
    "Right-hand rules for magnetic fields",
    "Basic torque and rotational motion"
  ],

  "core_concept": {
    "principle": "A current-carrying conductor experiences a magnetic force in a magnetic field given by F = I(L × B), where I is current, L is length vector in current direction, and B is magnetic field. This force forms the basis for electric motors and many electromagnetic devices.",
    "explanation": "The magnetic force on a current-carrying wire is the macroscopic manifestation of the Lorentz force on the moving charges within the wire. The net force results from the cumulative effect on all charge carriers, producing measurable mechanical forces on the conductor.",
    "image": {
      "url": "images/wire-force-core.png",
      "alt": "Magnetic force on current-carrying wire",
      "caption": "Current-carrying wires experience forces in magnetic fields, fundamental to electric motors"
    }
  },

  "sections": [
    {
      "section_title": "1. Magnetic Force on Straight Conductors",
      "introduction": "The fundamental relationship for magnetic force on current-carrying wires extends the Lorentz force concept to macroscopic conductors, enabling calculation of forces in practical electromagnetic devices.",
      "image": {
        "url": "images/straight-conductor-force-intro.png",
        "alt": "Force on straight conductors in magnetic fields",
        "caption": "Straight current-carrying conductors experience forces perpendicular to both current and field directions"
      },

      "key_concept": {
        "definition": "Magnetic Force on Straight Conductor: F = I(L × B), where I is current, L is length vector pointing in current direction, B is magnetic field. Magnitude: F = ILBsinθ, where θ is angle between current direction and magnetic field. Direction: Perpendicular to both current and field directions, following right-hand rule.",
        "context": "This force results from the sum of Lorentz forces on all moving charges in the conductor: F = nALq(v_d × B) = I(L × B), where n is charge density, A is cross-sectional area, q is charge, v_d is drift velocity.",
        "image": {
          "url": "images/straight-wire-force.png",
          "alt": "Straight wire force calculation",
          "caption": "Force on straight wire depends on current, length, field strength, and orientation"
        }
      },

      "classifications": [
        {
          "type": "Force Direction Determination",
          "value": "Methods for finding magnetic force direction on conductors",
          "characteristics": [
            "Right-hand rule for positive charge flow",
            "Alternative right-hand rule variations",
            "Vector cross product calculation",
            "Fleming's left-hand rule (conventional current)",
            "Mnemonic devices for common configurations"
          ],
          "behavior": "All methods yield force perpendicular to plane containing current and field vectors, with magnitude maximum when current perpendicular to field, zero when parallel",
          "examples": [
            {
              "process": "Standard Right-Hand Rule",
              "explanation": "Point fingers in current direction, curl toward magnetic field direction, thumb shows force direction",
              "image": {
                "url": "images/wire-right-hand-rule.png",
                "alt": "Right-hand rule for wire force",
                "caption": "Right-hand rule determines force direction for conventional current flow"
              }
            },
            {
              "process": "Fleming's Left-Hand Rule",
              "explanation": "Thumb, index, middle finger mutually perpendicular: First finger-Field, seCond finger-Current, Thumb-Thrust (Force)",
              "image": {
                "url": "images/flemings-left-hand.png",
                "alt": "Fleming's left-hand rule",
                "caption": "Fleming's left-hand rule provides an alternative method for force direction"
              }
            }
          ],
          "note": "The force direction reverses if either the current direction or magnetic field direction is reversed. For electron flow (negative charges), the force direction is opposite to that predicted for conventional current."
        }
      ],

      "principles": [
        {
          "principle": "Force on Current Element",
          "statement": "The magnetic force on a differential current element dF = I(dL × B), where dL is vector length element in current direction. For a straight wire in uniform field, this integrates to F = I(L × B). For curved wires, the net force depends on the vector sum of all differential elements.",
          "application": "Use for calculating forces on arbitrarily shaped conductors by integration. Essential for analyzing complex conductor geometries in magnetic fields.",
          "example": "For a semicircular wire in uniform perpendicular field, the net force equals the force on the straight line connecting the endpoints",
          "analogy": "Like calculating the total push on a curved rope by summing the pushes on each small segment",
          "image": {
            "url": "images/current-element-force.png",
            "alt": "Force on current element",
            "caption": "Differential force elements integrate to give total force on conductor"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Force on Straight Conductor",
          "problem": "A 0.5m wire carrying 8A current lies in a uniform 0.3T magnetic field. The wire makes 60° with the field direction. Calculate the magnetic force magnitude and determine its direction.",
          "step_by_step": [
            {
              "step": "Identify known values",
              "explanation": "I = 8A, L = 0.5m, B = 0.3T, θ = 60°"
            },
            {
              "step": "Calculate force magnitude",
              "explanation": "F = ILBsinθ = 8 × 0.5 × 0.3 × sin60°"
            },
            {
              "step": "Compute sin60°",
              "explanation": "sin60° = √3/2 ≈ 0.866"
            },
            {
              "step": "Calculate force",
              "explanation": "F = 8 × 0.5 × 0.3 × 0.866 = 1.04 N"
            },
            {
              "step": "Determine direction",
              "explanation": "Right-hand rule: force perpendicular to both current and field directions"
            }
          ],
          "final_answer": "Magnetic force = 1.04 N perpendicular to the plane containing the current and magnetic field vectors. Maximum force would occur at 90° orientation.",
          "concept_applied": "Magnetic force calculation on straight current-carrying conductor",
          "image": {
            "url": "images/straight-wire-example.png",
            "alt": "Straight wire force example",
            "caption": "Force on straight wire depends on the angle between current and field directions"
          }
        }
      ]
    },
    {
      "section_title": "2. Forces on Current Loops and Torque",
      "introduction": "Current-carrying loops in magnetic fields experience net torques that cause rotation, forming the fundamental operating principle of electric motors and galvanometers.",
      "image": {
        "url": "images/current-loop-torque-intro.png",
        "alt": "Torque on current loops in magnetic fields",
        "caption": "Current loops experience torque in magnetic fields, causing rotational motion"
      },

      "key_concept": {
        "definition": "Magnetic Dipole Moment: μ = IAN for a current loop, where I is current, A is area, N is number of turns. Vector direction follows right-hand rule relative to current. Torque on Current Loop: τ = μ × B, with magnitude τ = μBsinθ, where θ is angle between μ and B. The torque tends to align the magnetic moment with the field.",
        "context": "A current loop behaves as a magnetic dipole. In uniform fields, net force is zero but torque is non-zero, causing rotation. In non-uniform fields, both force and torque may be present.",
        "image": {
          "url": "images/current-loop-torque.png",
          "alt": "Torque on current loop",
          "caption": "Current loops experience torque that aligns their magnetic moment with the field"
        }
      },

      "classifications": [
        {
          "type": "Current Loop Configurations",
          "value": "Different loop geometries and their magnetic behavior",
          "characteristics": [
            "Rectangular loops: Simple torque calculation",
            "Circular loops: Natural dipole behavior",
            "Solenoids: Multiple loop systems",
            "Arbitrary shapes: General dipole approximation",
            "Multi-turn coils: Enhanced magnetic moment"
          ],
          "behavior": "All planar current loops act as magnetic dipoles in external fields. Torque is maximum when plane parallel to field (μ⊥B), zero when plane perpendicular to field (μ∥B)",
          "examples": [
            {
              "process": "Rectangular Loop Analysis",
              "explanation": "Forces on parallel sides create torque couple; forces on perpendicular sides cancel for net zero force",
              "image": {
                "url": "images/rectangular-loop.png",
                "alt": "Rectangular current loop forces",
                "caption": "Rectangular loops experience torque from forces on parallel sides"
              }
            },
            {
              "process": "Solenoid Magnetic Moment",
              "explanation": "Multiple turns enhance magnetic moment: μ = NIπr² for circular solenoid",
              "image": {
                "url": "images/solenoid-moment.png",
                "alt": "Solenoid magnetic moment",
                "caption": "Solenoids have enhanced magnetic moments due to multiple turns"
              }
            }
          ],
          "note": "The potential energy of a current loop in a magnetic field is U = -μ·B = -μBcosθ. The loop is in stable equilibrium when μ aligns with B (θ=0°, U_min) and unstable equilibrium when anti-aligned (θ=180°, U_max)."
        }
      ],

      "principles": [
        {
          "principle": "Electric Motor Principle",
          "statement": "A current-carrying loop in a magnetic field experiences torque τ = NIABsinθ. In DC motors, a commutator reverses current direction every half-rotation to maintain continuous torque in the same direction. The maximum torque occurs when the coil plane is parallel to the field (θ=90°).",
          "application": "Fundamental to all electric motors from small devices to industrial machinery. Motor design involves optimizing number of turns, current, area, and field strength for required torque.",
          "example": "A motor coil with 100 turns, 0.1A current, 0.01m² area in 0.5T field has maximum torque τ = 100×0.1×0.01×0.5 = 0.05 N·m",
          "analogy": "Like a water wheel where paddles are pushed by water - here magnetic forces push on current-carrying wires to create rotation",
          "image": {
            "url": "images/electric-motor-principle.png",
            "alt": "Electric motor operating principle",
            "caption": "Electric motors use magnetic torque on current loops to produce rotational motion"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Torque on Rectangular Current Loop",
          "problem": "A rectangular loop 0.2m × 0.3m with 50 turns carries 2A current. It's oriented at 30° to a 0.4T uniform magnetic field. Calculate the maximum torque and the torque at this orientation.",
          "step_by_step": [
            {
              "step": "Calculate area",
              "explanation": "A = 0.2 × 0.3 = 0.06 m²"
            },
            {
              "step": "Calculate magnetic moment",
              "explanation": "μ = NIA = 50 × 2 × 0.06 = 6 A·m²"
            },
            {
              "step": "Maximum torque (θ=90°)",
              "explanation": "τ_max = μB = 6 × 0.4 = 2.4 N·m"
            },
            {
              "step": "Torque at 30° orientation",
              "explanation": "τ = μBsinθ = 6 × 0.4 × sin30° = 2.4 × 0.5 = 1.2 N·m"
            },
            {
              "step": "Interpret results",
              "explanation": "At 30°, torque is half maximum value. Torque varies sinusoidally with orientation."
            }
          ],
          "final_answer": "Maximum torque = 2.4 N·m, Torque at 30° = 1.2 N·m. The loop experiences rotational force tending to align it with the field.",
          "concept_applied": "Torque calculation on rectangular current loop in magnetic field",
          "image": {
            "url": "images/rectangular-loop-torque.png",
            "alt": "Rectangular loop torque calculation",
            "caption": "Torque on current loops depends on orientation relative to magnetic field"
          }
        }
      ]
    },
    {
      "section_title": "3. Applications and Force Between Currents",
      "introduction": "Magnetic forces on current-carrying conductors enable numerous practical applications and explain the fundamental interactions between parallel currents.",
      "image": {
        "url": "images/applications-parallel-currents-intro.png",
        "alt": "Applications and parallel current interactions",
        "caption": "Magnetic forces enable electric motors and explain current interactions"
      },

      "key_concept": {
        "definition": "Force Between Parallel Currents: Two parallel currents exert magnetic forces on each other. Like currents (same direction) attract, unlike currents (opposite directions) repel. Force per unit length: F/L = (μ₀I₁I₂)/(2πd), where d is separation distance. This fundamental relationship defines the ampere in SI units.",
        "context": "The force between parallel currents results from the magnetic field produced by one current acting on the other current. This interaction is fundamental to electromagnetism and has practical importance in power transmission and electrical design.",
        "image": {
          "url": "images/parallel-currents-interaction.png",
          "alt": "Force between parallel currents",
          "caption": "Parallel currents attract or repel depending on their relative directions"
        }
      },

      "classifications": [
        {
          "type": "Practical Applications",
          "value": "Devices utilizing magnetic forces on currents",
          "characteristics": [
            "Electric motors: Torque on current loops",
            "Loudspeakers: Force on voice coils",
            "Galvanometers: Current measurement",
            "Magnetic levitation: Current-magnet interaction",
            "Circuit breakers: Magnetic force activation",
            "Mass drivers: Electromagnetic propulsion"
          ],
          "behavior": "These applications convert electrical energy to mechanical motion using magnetic forces, often with high efficiency and precise control",
          "examples": [
            {
              "process": "Loudspeaker Operation",
              "explanation": "Audio current in voice coil interacts with permanent magnet field, causing diaphragm vibration and sound production",
              "image": {
                "url": "images/loudspeaker-operation.png",
                "alt": "Loudspeaker magnetic force",
                "caption": "Loudspeakers use magnetic forces on current-carrying voice coils"
              }
            },
            {
              "process": "Galvanometer Mechanism",
              "explanation": "Current through coil produces torque proportional to current, deflecting pointer for measurement",
              "image": {
                "url": "images/galvanometer-mechanism.png",
                "alt": "Galvanometer operation",
                "caption": "Galvanometers measure current using magnetic torque on coils"
              }
            }
          ],
          "note": "The international definition of the ampere is based on the force between parallel currents: 1 ampere is the constant current which, maintained in two straight parallel conductors of infinite length, of negligible circular cross-section, and placed 1 meter apart in vacuum, would produce a force of 2×10⁻⁷ newton per meter of length."
        }
      ],

      "principles": [
        {
          "principle": "Force Between Parallel Conductors",
          "statement": "Two long parallel currents I₁ and I₂ separated by distance d exert forces on each other. The magnetic field from I₁ at the location of I₂ is B = μ₀I₁/(2πd). The force on I₂ is F = I₂LBsin90° = I₂L(μ₀I₁/(2πd)). Thus F/L = μ₀I₁I₂/(2πd) per unit length. Like currents attract because their magnetic fields between them are in opposite directions, creating a lower field pressure region.",
          "application": "Important for power transmission line design, busbar arrangements in electrical distribution, and understanding electromagnetic forces in high-current applications.",
          "example": "Two 100A parallel wires 0.1m apart experience F/L = (4π×10⁻⁷×100×100)/(2π×0.1) = 0.02 N/m attractive force",
          "analogy": "Like two boats moving parallel in water - the water flow patterns between them create attractive or repulsive forces",
          "image": {
            "url": "images/parallel-currents-detailed.png",
            "alt": "Parallel currents force derivation",
            "caption": "Force between parallel currents results from magnetic field interactions"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Force Between Parallel Wires",
          "problem": "Two long parallel wires 0.2m apart carry currents of 15A and 20A in the same direction. Calculate the force per meter on each wire and determine if it's attractive or repulsive.",
          "step_by_step": [
            {
              "step": "Identify known values",
              "explanation": "I₁=15A, I₂=20A, d=0.2m, μ₀=4π×10⁻⁷ T·m/A"
            },
            {
              "step": "Apply force formula",
              "explanation": "F/L = (μ₀I₁I₂)/(2πd) = (4π×10⁻⁷ × 15 × 20)/(2π × 0.2)"
            },
            {
              "step": "Simplify calculation",
              "explanation": "F/L = (4π×10⁻⁷ × 300)/(0.4π) = (1.2π×10⁻⁴)/(0.4π)"
            },
            {
              "step": "Calculate force per meter",
              "explanation": "F/L = 3×10⁻⁴ N/m = 0.0003 N/m"
            },
            {
              "step": "Determine force nature",
              "explanation": "Like currents attract, so force is attractive"
            }
          ],
          "final_answer": "Force per meter = 3×10⁻⁴ N/m attractive. Though small, this force becomes significant in high-current applications like power transmission lines.",
          "concept_applied": "Force calculation between parallel current-carrying conductors",
          "image": {
            "url": "images/parallel-wires-example.png",
            "alt": "Parallel wires force example",
            "caption": "Parallel currents exert measurable forces on each other"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Magnetic force on current",
    "Right-hand rule",
    "Fleming's left-hand rule",
    "Magnetic torque",
    "Magnetic dipole moment",
    "Current loop",
    "Electric motor",
    "Galvanometer",
    "Parallel currents",
    "Force between wires"
  ],

  "common_misconceptions": [
    "Thinking magnetic forces can do work on current-carrying wires",
    "Believing stationary current-carrying wires experience magnetic forces",
    "Confusing force directions for different current configurations",
    "Thinking torque depends only on current magnitude",
    "Believing unlike parallel currents attract",
    "Confusing magnetic moment direction with current direction"
  ],

  "real_world_applications": [
    "Electric motors in appliances and vehicles",
    "Loudspeakers and headphones",
    "Galvanometers for current measurement",
    "Magnetic levitation trains",
    "Circuit breakers and relays",
    "Mass drivers for space launch",
    "Power transmission line design",
    "Magnetic bearings and couplings"
  ],

  "summary": "Current-carrying conductors experience magnetic forces F = I(L×B) in magnetic fields, with maximum force when current perpendicular to field. Current loops experience torque τ = μ×B, where μ = IAN is the magnetic moment, forming the basis for electric motors. Parallel currents exert forces F/L = μ₀I₁I₂/(2πd) per unit length, with like currents attracting and unlike currents repelling. These principles enable numerous applications including electric motors, loudspeakers, galvanometers, and electromagnetic propulsion systems. Magnetic forces on currents provide the fundamental link between electricity and mechanical motion."
}
