{
  "course": "Physics Grade 10",
  "topic": "Newton's First Law of Motion",
  "problems": [
    {
      "number": 1,
      "problem": "A book rests on a table. Explain why it does not move.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify forces acting",
          "explanation": "The book experiences downward gravitational force $F_g$ and upward normal force $F_N$."
        },
        {
          "step": "Apply Newton's First Law",
          "explanation": "Since the net force $F_{net} = F_N - F_g = 0$, the book remains at rest."
        }
      ],
      "final_answer": "The book does not move because the net force is zero; forces are balanced."
    },
    {
      "number": 2,
      "problem": "A puck slides on a frictionless ice surface at constant velocity. Explain why it does not accelerate.",
      "image": null,
      "step_by_step": [
        {
          "step": "Given motion",
          "explanation": "The puck is moving at constant velocity, so $v = \\text{constant}$"
        },
        {
          "step": "Apply Newton's First Law",
          "explanation": "Net force $F_{net} = 0$ because there are no horizontal forces acting; hence no acceleration."
        }
      ],
      "final_answer": "The puck continues moving at constant velocity because the net force is zero."
    },
    {
      "number": 3,
      "problem": "A soccer ball is at rest on the ground. A player kicks it, and it moves. Explain using Newton's First Law.",
      "image": null,
      "step_by_step": [
        {
          "step": "Initial state",
          "explanation": "The ball is initially at rest, so it will remain at rest unless acted upon by a force."
        },
        {
          "step": "External force applied",
          "explanation": "The kick provides an unbalanced force, causing the ball to accelerate."
        }
      ],
      "final_answer": "The ball moves because the external force (kick) overcomes its inertia."
    },
    {
      "number": 4,
      "problem": "A sliding box eventually stops on a rough surface. Does this violate Newton's First Law?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify forces",
          "explanation": "Friction acts opposite to motion, creating a net force $F_{net} \\neq 0$."
        },
        {
          "step": "Apply Newton's First Law",
          "explanation": "The law is not violated because the box decelerates due to the unbalanced frictional force."
        }
      ],
      "final_answer": "No, the box stops because friction provides an external unbalanced force."
    },
    {
      "number": 5,
      "problem": "A spacecraft moves in deep space far from gravitational influences. Explain its motion according to Newton's First Law.",
      "image": null,
      "step_by_step": [
        {
          "step": "External forces",
          "explanation": "No significant forces act on the spacecraft."
        },
        {
          "step": "Law application",
          "explanation": "It continues in a straight line at constant speed, demonstrating inertia."
        }
      ],
      "final_answer": "The spacecraft moves at constant velocity because no net external force acts on it."
    },
    {
      "number": 6,
      "problem": "A coin lies on a car dashboard. The car suddenly accelerates forward. Explain why the coin slides backward.",
      "image": null,
      "step_by_step": [
        {
          "step": "Initial state",
          "explanation": "The coin initially at rest tends to remain at rest due to inertia."
        },
        {
          "step": "Effect of car acceleration",
          "explanation": "The dashboard moves forward, but the coin resists motion, so it appears to slide backward relative to the car."
        }
      ],
      "final_answer": "The coin slides backward relative to the car because of inertia resisting acceleration."
    },
    {
      "number": 7,
      "problem": "A passenger standing in a moving bus lurches forward when the bus suddenly stops. Explain using Newton's First Law.",
      "image": null,
      "step_by_step": [
        {
          "step": "Inertia of the passenger",
          "explanation": "The passenger tends to maintain their state of motion at the bus's original speed."
        },
        {
          "step": "Bus stops",
          "explanation": "The bus decelerates due to brakes, but the passenger continues forward until acted upon by a force (e.g., friction or handhold)."
        }
      ],
      "final_answer": "The forward lurch occurs because the passenger's inertia resists the sudden stop of the bus."
    },
    {
      "number": 8,
      "problem": "A hockey puck slides on a frictionless surface. If no force is applied, how will it move?",
      "image": null,
      "step_by_step": [
        {
          "step": "Law application",
          "explanation": "Newton's First Law states that an object in motion continues in straight-line motion with constant velocity if net force is zero."
        }
      ],
      "final_answer": "The puck will continue sliding at constant speed in a straight line."
    },
    {
      "number": 9,
      "problem": "A heavy box is at rest on the floor. What must be done to move it?",
      "image": null,
      "step_by_step": [
        {
          "step": "Inertia",
          "explanation": "The box resists change in motion due to inertia."
        },
        {
          "step": "Apply force",
          "explanation": "A sufficiently large unbalanced horizontal force must be applied to overcome static friction and inertia."
        }
      ],
      "final_answer": "Push with a force greater than static friction to start motion."
    },
    {
      "number": 10,
      "problem": "A tablecloth is quickly pulled from under dishes. Why do the dishes barely move?",
      "image": null,
      "step_by_step": [
        {
          "step": "Inertia of dishes",
          "explanation": "The dishes tend to remain at rest due to Newton's First Law."
        },
        {
          "step": "Quick pull",
          "explanation": "The tablecloth moves quickly, so friction exerts little force on the dishes, and they remain mostly stationary."
        }
      ],
      "final_answer": "The dishes barely move because their inertia resists the sudden motion of the tablecloth."
    }
  ]
}
