{
  "topic": "Magnetic Fields",
  "unit_title": "Ampere's Law: Line Integrals and Magnetic Field Symmetry",
  "unit_number": "Unit 4.7",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Electricity & Magnetism",
  "duration": "4-5 hours",
  "difficulty_level": "advanced",
  "expanded_description": "This unit introduces Ampere's Law as a powerful method for calculating magnetic fields in symmetric current distributions. Students will master the application of line integrals around Amperian loops, develop intuition for choosing appropriate integration paths, and apply these techniques to solenoids, toroids, and other symmetric configurations where direct integration of Biot-Savart Law would be complex.",

  "learning_objectives": [
    "Apply Ampere's Law to calculate magnetic fields in symmetric configurations",
    "Set up and evaluate line integrals around Amperian loops",
    "Determine when Ampere's Law is applicable based on symmetry",
    "Calculate magnetic fields inside and outside current distributions",
    "Analyze the magnetic field of solenoids and toroids using Ampere's Law",
    "Solve problems involving multiple current-carrying regions"
  ],

  "prerequisites": [
    "Understanding of line integrals and vector calculus",
    "Proficiency with Biot-Savart Law applications",
    "Knowledge of current distributions and symmetry",
    "Experience with magnetic field patterns",
    "Familiarity with basic integration techniques"
  ],

  "core_concept": {
    "principle": "Ampere's Law, Line Integrals, Amperian Loops, Magnetic Field Symmetry, Current Enclosed",
    "explanation": "Ampere's Law states that the line integral of the magnetic field around any closed path equals μ₀ times the current enclosed by that path. This powerful relationship simplifies magnetic field calculations in symmetric configurations where the field is constant along integration paths, making it particularly useful for solenoids, toroids, and infinite current sheets.",
    "image": {
      "url": "images/ampere-core.png",
      "alt": "Ampere core concept",
      "caption": "Ampere's Law and Amperian loop geometry"
    }
  },

  "sections": [
    {
      "section_title": "1. Ampere's Law Fundamentals and Basic Applications",
      "introduction": "This section establishes Ampere's Law as a fundamental relationship in electromagnetism and applies it to basic symmetric current configurations, developing the methodology for choosing appropriate Amperian loops.",

      "key_concept": {
        "definition": "Ampere's Law, Line Integral, Amperian Loop, Current Enclosed, Right-Hand Rule",
        "context": "Ampere's Law provides an integral relationship between magnetic fields and the currents that produce them. Unlike the differential Biot-Savart Law, Ampere's Law works with the total field around closed paths, making it particularly powerful for systems with high symmetry where the field magnitude is constant along the integration path.",
        "image": {
          "url": "images/ampere-concepts.png",
          "alt": "Ampere concepts",
          "caption": "Fundamental concepts of Ampere's Law and Amperian loops"
        }
      },

      "classifications": [
        {
          "type": "Ampere's Law Applications",
          "value": "Classification based on current distribution symmetry",
          "characteristics": [
            "Infinite straight wires: cylindrical symmetry",
            "Infinite current sheets: planar symmetry",
            "Solenoids: axial symmetry with uniform field",
            "Toroids: circular symmetry with varying field",
            "Current-carrying cylinders: radial dependence",
            "Multiple conductor systems: superposition required"
          ],
          "behavior": "Different symmetric configurations allow different Amperian loop choices. Straight wires suggest circular loops. Current sheets suggest rectangular loops. Solenoids suggest rectangular loops enclosing multiple turns. Toroids suggest circular loops following the torus. Cylindrical conductors suggest circular loops at different radii. Multiple conductors may require piecewise application.",
          "examples": [
            {
              "process": "Amperian Loop Selection",
              "explanation": "Choosing appropriate integration paths based on symmetry of current distribution",
              "image": {
                "url": "images/amperian-loop-selection.png",
                "alt": "Amperian loop selection",
                "caption": "Selection of Amperian loops for different symmetries"
              }
            },
            {
              "process": "Line Integral Evaluation",
              "explanation": "Calculating the circulation of magnetic field around closed paths",
              "image": {
                "url": "images/line-integral-evaluation.png",
                "alt": "Line integral evaluation",
                "caption": "Evaluation of line integrals in Ampere's Law"
              }
            }
          ],
          "note": "Ampere's Law is always true, but it's only useful for calculating magnetic fields when the symmetry allows you to determine the field direction and where it's constant along the integration path"
        }
      ],

      "principles": [
        {
          "principle": "Ampere's Law Fundamentals",
          "statement": "Ampere's Law: ∮B·dl = μ₀I_enc where I_enc is current enclosed by the path. Differential Form: ∇ × B = μ₀J. Right-Hand Rule: Curl fingers in integration direction, thumb shows positive current direction. Amperian Loop Selection: Choose path where B is either parallel or perpendicular to dl, and constant magnitude where parallel. Infinite Straight Wire: Choose circular Amperian loop: B(2πr) = μ₀I → B = μ₀I/(2πr). Infinite Current Sheet: Choose rectangular loop straddling sheet: B(2L) = μ₀KL (K = current per unit width) → B = μ₀K/2 each side. Solenoid: Choose rectangular loop with long sides parallel to axis: B_inL = μ₀nLI → B_in = μ₀nI, B_out = 0. Toroid: Choose circular loop inside: B(2πr) = μ₀NI → B = μ₀NI/(2πr). Current Density: For distributed currents, I_enc = ∫J·dA. Limitations: Requires symmetry to extract B from integral. Doesn't account for changing electric fields (need Maxwell's correction). Always True: But only useful for field calculation with symmetry.",
          "application": "Calculate magnetic fields using Ampere's Law for symmetric distributions. Choose appropriate Amperian loops based on symmetry. Determine enclosed current for various geometries. Solve for unknown currents from field measurements. Analyze field behavior inside and outside current distributions. Apply to solenoids, toroids, and cylindrical conductors.",
          "example": "Infinite wire: circular loop gives B = μ₀I/(2πr). Solenoid: rectangular loop gives B = μ₀nI inside. Current sheet: rectangular loop gives B = μ₀K/2.",
          "analogy": "Ampere's Law is like a 'magnetic circulation meter' that measures how much 'current is swirling inside' any closed loop. Choosing the right Amperian loop is like choosing the right 'fishing net' shape to catch the 'magnetic field pattern'. For a straight wire, a 'circular net' perfectly matches the 'circular field lines'. For a solenoid, a 'rectangular net' that goes inside and outside can 'catch' the difference between the 'strong internal field' and 'weak external field'. The 'right-hand rule' tells you which way to 'walk around your net' to count the 'enclosed fish' (currents) properly. The law always works, but you only 'catch useful information' when your 'net shape' matches the 'swimming patterns of the fish'.",
          "image": {
            "url": "images/ampere-principles.png",
            "alt": "Ampere principles",
            "caption": "Fundamental principles and applications of Ampere's Law"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Infinite Straight Wire Verification",
          "problem": "Use Ampere's Law to find the magnetic field at distance r from an infinite straight wire carrying current I, and verify it matches the Biot-Savart result.",
          "step_by_step": [
            {
              "step": "Choose Amperian loop",
              "explanation": "Select circular loop of radius r centered on wire, due to cylindrical symmetry"
            },
            {
              "step": "Evaluate line integral",
              "explanation": "∮B·dl = B∮dl = B(2πr) since B is constant and parallel to dl everywhere on circle"
            },
            {
              "step": "Determine enclosed current",
              "explanation": "I_enc = I (entire current enclosed)"
            },
            {
              "step": "Apply Ampere's Law",
              "explanation": "B(2πr) = μ₀I"
            },
            {
              "step": "Solve for B",
              "explanation": "B = μ₀I/(2πr)"
            },
            {
              "step": "Verify direction",
              "explanation": "Right-hand rule: grasp wire with right hand, thumb in current direction, fingers curl in B direction"
            }
          ],
          "final_answer": "B = μ₀I/(2πr), identical to Biot-Savart result. Direction is tangential to circles around wire.",
          "concept_applied": "Basic Ampere's Law application to infinite straight wire",
          "image": {
            "url": "images/infinite-wire-ampere.png",
            "alt": "Infinite wire ampere",
            "caption": "Ampere's Law application to infinite straight wire"
          }
        },
        {
          "title": "Current Sheet Magnetic Field",
          "problem": "An infinite sheet in the yz-plane carries uniform surface current K = 8.0 A/m in the +y direction. Find the magnetic field on both sides of the sheet.",
          "step_by_step": [
            {
              "step": "Analyze symmetry",
              "explanation": "Sheet is infinite in yz-plane, current in y-direction. By symmetry, B should be in ±z direction, constant magnitude, opposite directions on each side"
            },
            {
              "step": "Choose Amperian loop",
              "explanation": "Rectangular loop straddling sheet, with sides parallel to z-axis (field direction) and ends perpendicular"
            },
            {
              "step": "Evaluate line integral",
              "explanation": "∮B·dl = B∥L + 0 + B∥L + 0 = 2B∥L (only sides parallel to B contribute)"
            },
            {
              "step": "Determine enclosed current",
              "explanation": "I_enc = KL (current per unit length × length)"
            },
            {
              "step": "Apply Ampere's Law",
              "explanation": "2B∥L = μ₀KL"
            },
            {
              "step": "Solve for B",
              "explanation": "B∥ = μ₀K/2 = (4π×10⁻⁷ × 8.0)/2 = 5.03×10⁻⁶ T"
            },
            {
              "step": "Determine direction",
              "explanation": "Right-hand rule: for current in +y, field is in -z for x > 0 and +z for x < 0"
            }
          ],
          "final_answer": "Magnetic field magnitude = 5.03 μT on both sides. Direction: for x > 0, B = -5.03 μT k; for x < 0, B = +5.03 μT k.",
          "concept_applied": "Ampere's Law application to infinite current sheet",
          "image": {
            "url": "images/current-sheet-ampere.png",
            "alt": "Current sheet ampere",
            "caption": "Magnetic field calculation for infinite current sheet"
          }
        },
        {
          "title": "Multiple Parallel Wires",
          "problem": "Three infinite parallel wires are equally spaced along the x-axis at x = -0.1 m, 0, and +0.1 m. Each carries 5.0 A current in the +z direction. Find the magnetic field at x = 0.15 m using Ampere's Law concepts.",
          "step_by_step": [
            {
              "step": "Note Ampere's Law limitation",
              "explanation": "Ampere's Law alone cannot find field at specific point for multiple wires - need superposition"
            },
            {
              "step": "Use superposition principle",
              "explanation": "B_total = B₁ + B₂ + B₃, with each from infinite wire formula"
            },
            {
              "step": "Calculate individual fields",
              "explanation": "B from wire at x = -0.1 m: distance = 0.25 m, B = μ₀×5/(2π×0.25) = 4.0×10⁻⁶ T, direction? Right-hand rule: at x=0.15, field from left wire points? Current +z, so B circles counterclockwise: at point to right of wire, B points -y"
            },
            {
              "step": "Wire at x = 0: distance = 0.15 m, B = μ₀×5/(2π×0.15) = 6.67×10⁻⁶ T. At point to right of wire, B points -y"
            },
            {
              "step": "Wire at x = +0.1 m: distance = 0.05 m, B = μ₀×5/(2π×0.05) = 2.0×10⁻⁵ T. At point to right of wire, B points +y (opposite!)"
            },
            {
              "step": "Vector sum",
              "explanation": "B_total = (-4.0 - 6.67 + 20.0)×10⁻⁶ j? Wait, check signs: B from wires at -0.1 and 0: both -y direction. B from wire at +0.1: +y direction. So B_total = (-4.0μ - 6.67μ + 20.0μ)×10⁻⁶ = +9.33×10⁻⁶ T in +y direction"
            }
          ],
          "final_answer": "Magnetic field at x = 0.15 m = 9.33 μT in +y direction. Demonstrates superposition with Ampere's Law results for individual wires.",
          "concept_applied": "Superposition with Ampere's Law results",
          "image": {
            "url": "images/multiple-wires-ampere.png",
            "alt": "Multiple wires ampere",
            "caption": "Field calculation for multiple parallel wires using superposition"
          }
        }
      ]
    },
    {
      "section_title": "2. Advanced Applications: Solenoids, Toroids, and Current Distributions",
      "introduction": "This section extends Ampere's Law to more complex symmetric configurations including solenoids, toroids, and current-carrying cylinders, analyzing both internal and external field behavior and exploring the limitations of the method.",

      "key_concept": {
        "definition": "Solenoid Field, Toroid Field, Current Density, Cylindrical Conductors, Field Continuity",
        "context": "Ampere's Law reaches its full power when applied to highly symmetric systems like solenoids and toroids, where direct Biot-Savart integration would be extremely complex. For distributed currents in cylindrical conductors, the law reveals how magnetic fields vary with radius and how total current determines the external field behavior.",
        "image": {
          "url": "images/advanced-ampere-concepts.png",
          "alt": "Advanced ampere concepts",
          "caption": "Ampere's Law applications to solenoids, toroids, and current distributions"
        }
      },

      "classifications": [
        {
          "type": "Advanced Symmetric Systems",
          "value": "Classification based on system geometry and current distribution",
          "characteristics": [
            "Ideal solenoids: uniform internal field, zero external field",
            "Finite solenoids: end effects and field fringing",
            "Toroidal coils: confined magnetic fields",
            "Solid cylindrical conductors: radial field dependence",
            "Hollow cylindrical conductors: field exclusion from voids",
            "Multiple coaxial conductors: piecewise field solutions"
          ],
          "behavior": "Different symmetric systems exhibit characteristic field patterns. Ideal solenoids have perfectly uniform internal fields. Finite solenoids show field decrease near ends. Toroids completely confine magnetic fields. Solid conductors have linearly increasing internal fields. Hollow conductors have zero field in empty regions. Multiple conductors require region-by-region analysis.",
          "examples": [
            {
              "process": "Solenoid Field Derivation",
              "explanation": "Applying Ampere's Law to derive the uniform field inside an ideal solenoid",
              "image": {
                "url": "images/solenoid-derivation.png",
                "alt": "Solenoid derivation",
                "caption": "Amperian loop selection for solenoid field calculation"
              }
            },
            {
              "process": "Cylindrical Conductor Analysis",
              "explanation": "Calculating magnetic fields inside and outside current-carrying cylinders",
              "image": {
                "url": "images/cylinder-analysis.png",
                "alt": "Cylinder analysis",
                "caption": "Field analysis for cylindrical current distributions"
              }
            }
          ],
          "note": "For ideal infinite solenoids, the magnetic field outside is exactly zero, not just small - this is a consequence of the high symmetry and uniform current distribution"
        }
      ],

      "principles": [
        {
          "principle": "Advanced Ampere's Law Applications",
          "statement": "Ideal Solenoid: Infinite length, tightly wound, uniform current. Choose rectangular Amperian loop with sides parallel and perpendicular to axis. Only side inside contributes: B_inL = μ₀nLI → B_in = μ₀nI, B_out = 0. Finite Solenoid: Approximation: B_center ≈ μ₀nI, B_end ≈ ½μ₀nI. Toroidal Solenoid: N turns, major radius R, minor radius a << R. Choose circular Amperian loop inside: B(2πr) = μ₀NI → B = μ₀NI/(2πr). Outside: B = 0. Solid Cylindrical Conductor: Radius R, uniform current density J = I/(πR²). Inside (r < R): I_enc = I(r²/R²), B(2πr) = μ₀I(r²/R²) → B = (μ₀Ir)/(2πR²). Outside (r > R): B = μ₀I/(2πr). Hollow Cylinder: Inside hollow (r < R_in): B = 0. Between walls: similar to solid. Outside: B = μ₀I/(2πr). Current Density: For non-uniform J, I_enc = ∫J·dA. Field Continuity: B field is continuous across current distributions. No magnetic monopoles: ∮B·dA = 0 always. Limitations: Requires symmetry to be useful. Cannot handle arbitrary current distributions. Doesn't provide field at specific points without symmetry.",
          "application": "Calculate magnetic fields in solenoids and toroids. Analyze field distributions in cylindrical conductors. Determine internal and external fields for various current distributions. Solve problems involving multiple conducting regions. Design electromagnetic devices using Ampere's Law principles. Calculate unknown currents from field measurements.",
          "example": "Solenoid: n = 1000 turns/m, I = 2 A → B = 2.51 mT inside. Solid cylinder: R = 0.02 m, I = 10 A → B_max = 0.1 mT at surface.",
          "analogy": "Advanced Ampere's Law applications are like using 'specialized magnetic telescopes' for different 'celestial current patterns'. A 'solenoid' is like a 'magnetic laser' - it creates a 'perfectly straight, uniform magnetic beam' inside, with 'no magnetic leakage' outside. A 'toroid' is like a 'magnetic race track' - the field goes 'round and round' forever inside the doughnut, but 'can't escape' outside. A 'current-carrying cylinder' is like a 'magnetic onion' - as you go deeper inside, you 'enclose less current', so the field gets weaker, following a 'linear peeling pattern'. The 'Amperian loop' is your 'magnetic measuring tape' that you 'wrap around' each configuration to 'measure how much current is flowing inside' at each 'peel layer'.",
          "image": {
            "url": "images/advanced-ampere-principles.png",
            "alt": "Advanced ampere principles",
            "caption": "Advanced applications of Ampere's Law to symmetric systems"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Solenoid Magnetic Field",
          "problem": "An ideal solenoid is 0.4 m long with 800 turns and carries 3.0 A current. Calculate the magnetic field inside the solenoid and explain why the external field is zero.",
          "step_by_step": [
            {
              "step": "Calculate turns density",
              "explanation": "n = N/L = 800/0.4 = 2000 turns/m"
            },
            {
              "step": "Apply ideal solenoid formula",
              "explanation": "B = μ₀nI = 4π×10⁻⁷ × 2000 × 3.0 = 7.54×10⁻³ T = 7.54 mT"
            },
            {
              "step": "Amperian loop explanation",
              "explanation": "For ideal infinite solenoid, choose rectangular loop with one side inside, one outside. Only inside contributes to integral"
            },
            {
              "step": "External field reasoning",
              "explanation": "If B_out ≠ 0, the line integral wouldn't match enclosed current unless B_out has specific form. Symmetry and current cancellation give B_out = 0 exactly"
            },
            {
              "step": "Real solenoid consideration",
              "explanation": "Finite solenoids have small external fields and end effects"
            }
          ],
          "final_answer": "Magnetic field inside = 7.54 mT. External field is zero for ideal infinite solenoid due to perfect symmetry and current cancellation.",
          "concept_applied": "Solenoid field calculation using Ampere's Law",
          "image": {
            "url": "images/solenoid-field-ampere.png",
            "alt": "Solenoid field ampere",
            "caption": "Magnetic field calculation for ideal solenoid"
          }
        },
        {
          "title": "Solid Cylindrical Conductor",
          "problem": "A solid cylindrical conductor of radius 0.02 m carries 50 A current uniformly distributed. Find the magnetic field at (a) r = 0.01 m, (b) r = 0.02 m, and (c) r = 0.04 m from the axis.",
          "step_by_step": [
            {
              "step": "Current density",
              "explanation": "J = I/(πR²) = 50/(π×0.0004) = 50/0.001257 = 3.98×10⁴ A/m²"
            },
            {
              "step": "Inside conductor (r < 0.02 m)",
              "explanation": "I_enc = Jπr² = I(r²/R²). B(2πr) = μ₀I(r²/R²) → B = (μ₀Ir)/(2πR²)"
            },
            {
              "step": "At r = 0.01 m",
              "explanation": "B = (4π×10⁻⁷ × 50 × 0.01)/(2π×0.0004) = (6.283×10⁻⁷)/(0.0008) = 7.85×10⁻⁴ T = 0.785 mT"
            },
            {
              "step": "At r = 0.02 m (surface)",
              "explanation": "B = (4π×10⁻⁷ × 50 × 0.02)/(2π×0.0004) = (1.257×10⁻⁶)/(0.0008) = 1.57×10⁻³ T = 1.57 mT"
            },
            {
              "step": "Outside conductor (r > 0.02 m)",
              "explanation": "B = μ₀I/(2πr) (all current enclosed)"
            },
            {
              "step": "At r = 0.04 m",
              "explanation": "B = (4π×10⁻⁷ × 50)/(2π×0.04) = (6.283×10⁻⁶)/(0.08) = 7.85×10⁻⁵ T = 0.0785 mT"
            }
          ],
          "final_answer": "(a) 0.785 mT at r = 0.01 m, (b) 1.57 mT at surface, (c) 0.0785 mT at r = 0.04 m. Field increases linearly inside, decreases as 1/r outside.",
          "concept_applied": "Magnetic field in solid cylindrical conductor",
          "image": {
            "url": "images/cylinder-field-ampere.png",
            "alt": "Cylinder field ampere",
            "caption": "Field calculation for solid cylindrical conductor"
          }
        },
        {
          "title": "Toroidal Solenoid",
          "problem": "A toroidal solenoid has 500 turns wound on a core with major radius 0.15 m and minor radius 0.02 m. It carries 2.0 A current. Find the magnetic field at the mean radius and determine the range where the field is approximately uniform.",
          "step_by_step": [
            {
              "step": "Apply toroid formula",
              "explanation": "B = μ₀NI/(2πr) where r is the radius from toroid axis"
            },
            {
              "step": "At mean radius r = 0.15 m",
              "explanation": "B = (4π×10⁻⁷ × 500 × 2.0)/(2π×0.15) = (1.257×10⁻³)/(0.3) = 4.19×10⁻³ T = 4.19 mT"
            },
            {
              "step": "Field variation range",
              "explanation": "Inner radius = 0.13 m, outer radius = 0.17 m. B_inner = μ₀NI/(2π×0.13) = 4.83 mT, B_outer = μ₀NI/(2π×0.17) = 3.69 mT"
            },
            {
              "step": "Percentage variation",
              "explanation": "From inner to outer: (4.83-3.69)/4.19 = 27% variation. For minor radius << major radius, field is more uniform"
            },
            {
              "step": "Outside field",
              "explanation": "For ideal toroid, net current enclosed = 0 for loops outside, so B = 0"
            }
          ],
          "final_answer": "Field at mean radius = 4.19 mT. Field varies from 4.83 mT (inner) to 3.69 mT (outer). Approximately uniform if minor radius << major radius.",
          "concept_applied": "Toroidal solenoid field calculation",
          "image": {
            "url": "images/toroid-field-ampere.png",
            "alt": "Toroid field ampere",
            "caption": "Magnetic field calculation for toroidal solenoid"
          }
        },
        {
          "title": "Coaxial Cable Fields",
          "problem": "A coaxial cable has inner conductor radius 0.005 m carrying 10 A current outward, and outer conductor (radius 0.015 m, thickness 0.002 m) carrying return current. Find the magnetic field in all regions.",
          "step_by_step": [
            {
              "step": "Region 1: Inside inner conductor (r < 0.005 m)",
              "explanation": "Assume uniform current density. I_enc = I(r²/R₁²) = 10(r²/0.000025). B = (μ₀×10×r)/(2π×0.000025) = (μ₀×10×r)/(1.57×10⁻⁴) = (1.257×10⁻⁵×r)/(1.57×10⁻⁴) = 0.08r T (r in meters)"
            },
            {
              "step": "Region 2: Between conductors (0.005 < r < 0.015 m)",
              "explanation": "All inner current enclosed: B = μ₀×10/(2πr) = (2×10⁻⁶)/r T"
            },
            {
              "step": "Region 3: Inside outer conductor (0.015 < r < 0.017 m)",
              "explanation": "I_enc = 10 - I_outer(r). Outer conductor carries -10 A uniformly in area π(0.017²-0.015²) = π(0.000289-0.000225) = 2.01×10⁻⁴ m². Current density J = -10/2.01×10⁻⁴ = -4.98×10⁴ A/m². I_enc = 10 + J×π(r²-0.015²) = 10 - 4.98×10⁴×π(r²-0.000225). B = μ₀I_enc/(2πr)"
            },
            {
              "step": "Region 4: Outside cable (r > 0.017 m)",
              "explanation": "Net current enclosed = 10 - 10 = 0, so B = 0"
            }
          ],
          "final_answer": "Field: Inside inner: B ∝ r, max 0.4 mT. Between: B = 2 μT/r. In outer: B decreases to 0. Outside: B = 0. Magnetic field confined to cable interior.",
          "concept_applied": "Magnetic fields in coaxial cable using Ampere's Law",
          "image": {
            "url": "images/coaxial-field-ampere.png",
            "alt": "Coaxial field ampere",
            "caption": "Field analysis for coaxial cable using Ampere's Law"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Ampere's Law",
    "Line integral",
    "Amperian loop",
    "Current enclosed",
    "Magnetic field symmetry",
    "Solenoid",
    "Toroid",
    "Cylindrical symmetry",
    "Current density",
    "Field continuity",
    "Right-hand rule",
    "Superposition principle"
  ],

  "common_misconceptions": [
    "Thinking Ampere's Law can find B at a point without symmetry",
    "Believing the Amperian loop must coincide with a field line",
    "Confusing current enclosed with total current in system",
    "Assuming Ampere's Law gives the field directly rather than the circulation",
    "Thinking solenoids always have zero external field regardless of length",
    "Believing Ampere's Law works for any closed path in any situation",
    "Confusing the differential and integral forms of Ampere's Law"
  ],

  "real_world_applications": [
    "Solenoid design for MRI machines",
    "Toroidal transformers in power supplies",
    "Coaxial cable design and analysis",
    "Current transformer operation",
    "Magnetic confinement fusion devices",
    "Particle accelerator magnet design",
    "Electric motor and generator analysis",
    "Power transmission line field calculations",
    "Magnetic shielding design",
    "Current measurement using Rogowski coils",
    "Magnetic field sensors and probes",
    "Electromagnetic launcher design"
  ],

  "summary": "This unit has established Ampere's Law as a powerful tool for calculating magnetic fields in symmetric current distributions. Students have mastered the selection of appropriate Amperian loops, evaluation of line integrals, and application to various symmetric systems including straight wires, solenoids, toroids, and cylindrical conductors. The method's strength in handling complex symmetric configurations where Biot-Savart integration would be formidable, combined with its limitations in asymmetric situations, provides a comprehensive understanding of this fundamental relationship in electromagnetism."
}
