{
  "topic": "Magnetic Fields",
  "unit_title": "Magnetic Force Between Currents: Force Between Parallel Currents",
  "unit_number": "Unit 4.6",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Electricity & Magnetism",
  "duration": "3-4 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "This unit explores the magnetic forces that current-carrying conductors exert on each other, with particular focus on parallel current configurations. Students will analyze both attractive and repulsive forces, apply the right-hand rule for force direction, and solve problems involving complex current distributions and practical applications like transmission lines and motor design.",

  "learning_objectives": [
    "Calculate magnetic forces between parallel current-carrying wires",
    "Apply the right-hand rule for force direction between currents",
    "Analyze forces in multi-wire systems using superposition",
    "Solve problems involving non-parallel current configurations",
    "Determine equilibrium conditions in current-carrying systems",
    "Apply magnetic force principles to practical engineering systems"
  ],

  "prerequisites": [
    "Understanding of magnetic fields from current-carrying wires",
    "Proficiency with Biot-Savart Law applications",
    "Knowledge of force on current-carrying conductors",
    "Experience with vector addition and superposition",
    "Familiarity with basic current and circuit concepts"
  ],

  "core_concept": {
    "principle": "Force Between Parallel Currents, Ampere's Force Law, Right-Hand Rule, Current-Current Interaction, Superposition Principle",
    "explanation": "Current-carrying conductors exert magnetic forces on each other due to the interaction between the magnetic field produced by one current and the other current itself. For parallel wires, this results in attractive forces when currents are in the same direction and repulsive forces when currents are in opposite directions, with the force magnitude following an inverse-distance relationship.",
    "image": {
      "url": "images/current-force-core.png",
      "alt": "Current force core concept",
      "caption": "Magnetic forces between parallel current-carrying wires"
    }
  },

  "sections": [
    {
      "section_title": "1. Parallel Current Forces and Fundamental Relationships",
      "introduction": "This section develops the fundamental force relationship between parallel current-carrying wires and applies it to various configurations, analyzing both magnitude and direction of the magnetic forces.",

      "key_concept": {
        "definition": "Parallel Current Force, Force per Unit Length, Attraction/Repulsion, Right-Hand Rule, Current Direction",
        "context": "When two parallel wires carry currents, each wire lies in the magnetic field produced by the other current. The resulting magnetic force follows the relationship F = IL × B, where B is the field produced by the other wire. This leads to a fundamental force-per-unit-length relationship that depends on the currents, their separation, and their relative directions.",
        "image": {
          "url": "images/parallel-current-concepts.png",
          "alt": "Parallel current concepts",
          "caption": "Force relationships for parallel current-carrying wires"
        }
      },

      "classifications": [
        {
          "type": "Parallel Current Configurations",
          "value": "Classification based on current directions and wire geometry",
          "characteristics": [
            "Same direction currents: attractive forces",
            "Opposite direction currents: repulsive forces",
            "Equal currents: symmetric force distribution",
            "Unequal currents: different force magnitudes",
            "Multiple parallel wires: complex force patterns",
            "Non-parallel wires: angular dependence in forces"
          ],
          "behavior": "Different current configurations produce distinct force behaviors. Same-direction currents attract with force ∝ I₁I₂/d. Opposite-direction currents repel with same magnitude relationship. Equal currents create symmetric force pairs. Unequal currents still obey Newton's third law. Multiple wires require superposition analysis. Non-parallel wires have reduced forces with angular dependence.",
          "examples": [
            {
              "process": "Force Direction Determination",
              "explanation": "Applying right-hand rules to determine attractive or repulsive forces",
              "image": {
                "url": "images/force-direction.png",
                "alt": "Force direction",
                "caption": "Determining force direction between parallel currents"
              }
            },
            {
              "process": "Force per Unit Length Calculation",
              "explanation": "Calculating the magnetic force per unit length between parallel wires",
              "image": {
                "url": "images/force-per-length.png",
                "alt": "Force per length",
                "caption": "Force per unit length calculation for parallel wires"
              }
            }
          ],
          "note": "The force between two parallel currents follows Newton's third law - the forces are equal in magnitude and opposite in direction, regardless of the current magnitudes"
        }
      ],

      "principles": [
        {
          "principle": "Parallel Current Force Fundamentals",
          "statement": "Force Between Parallel Wires: F/L = (μ₀I₁I₂)/(2πd) where F/L is force per unit length, I₁ and I₂ are currents, d is separation distance. Force Direction: Currents in same direction → attraction. Currents in opposite directions → repulsion. Right-Hand Rule Method: Point thumb in current direction of one wire, fingers curl in its B field direction. Other wire experiences force in direction of fingers if current is parallel to thumb. Derivation: Wire 1 produces B = μ₀I₁/(2πd) at wire 2. Force on wire 2: F = I₂L × B, magnitude F = I₂LB = I₂L(μ₀I₁/(2πd)) = (μ₀I₁I₂L)/(2πd). Newton's Third Law: F₁₂ = -F₂₁, equal magnitude, opposite direction. Multiple Wires: Superposition applies - total force = vector sum of forces from all other wires. Non-Parallel Wires: Reduced force with angular dependence. Current Definition: Force on moving charges in wire, summed over all charge carriers. Applications: Power transmission lines, motor windings, circuit breakers, current balances.",
          "application": "Calculate forces between parallel current-carrying wires. Determine force directions using right-hand rules. Analyze multi-wire systems using superposition. Solve for equilibrium positions in current systems. Design systems to minimize or maximize magnetic forces. Calculate current limits based on force constraints.",
          "example": "Two wires 0.1 m apart, both carrying 10 A in same direction: F/L = 2×10⁻⁴ N/m attraction. If opposite directions: same magnitude but repulsion.",
          "analogy": "Parallel currents are like 'traffic flows on parallel highways'. When cars flow in the 'same direction' on adjacent lanes, it's like they 'want to merge together' (attraction). When traffic flows in 'opposite directions', the lanes 'push apart' (repulsion). The 'right-hand rule' is like determining which way the 'magnetic push' acts. The force strength depends on how 'heavy the traffic' is (current magnitude) and how 'close the highways are' (separation distance). Multiple wires are like 'multiple highway lanes' with complex 'traffic interactions'.",
          "image": {
            "url": "images/parallel-force-principles.png",
            "alt": "Parallel force principles",
            "caption": "Fundamental relationships for forces between parallel currents"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Basic Parallel Wire Force Calculation",
          "problem": "Two long parallel wires are separated by 0.15 m. Wire 1 carries 8.0 A current upward, and wire 2 carries 12.0 A current downward. Calculate the force per unit length on each wire and specify whether it's attractive or repulsive.",
          "step_by_step": [
            {
              "step": "Identify current directions",
              "explanation": "Currents are in opposite directions (one up, one down), so force should be repulsive"
            },
            {
              "step": "Apply force formula",
              "explanation": "F/L = (μ₀I₁I₂)/(2πd) = (4π×10⁻⁷ × 8.0 × 12.0)/(2π × 0.15)"
            },
            {
              "step": "Calculate numerical value",
              "explanation": "F/L = (3.84×10⁻⁵)/(0.3π) × (2π) wait... F/L = (2×10⁻⁷ × 96)/0.15 = (1.92×10⁻⁵)/0.15 = 1.28×10⁻⁴ N/m"
            },
            {
              "step": "Determine force directions",
              "explanation": "Since currents are opposite, forces are repulsive. Each wire pushes the other away."
            },
            {
              "step": "Verify Newton's third law",
              "explanation": "Both wires experience same force magnitude but in opposite directions"
            }
          ],
          "final_answer": "Force per unit length = 1.28 × 10⁻⁴ N/m, repulsive. Both wires experience this force pushing them apart.",
          "concept_applied": "Basic force calculation between parallel wires",
          "image": {
            "url": "images/basic-parallel-force.png",
            "alt": "Basic parallel force",
            "caption": "Force calculation for parallel wires with opposite currents"
          }
        },
        {
          "title": "Three-Wire Force System",
          "problem": "Three long parallel wires are arranged in an equilateral triangle with side length 0.2 m. All carry 5.0 A current in the same direction. Find the magnitude and direction of the force per unit length on each wire.",
          "step_by_step": [
            {
              "step": "Analyze symmetry",
              "explanation": "All wires identical, all currents same direction, equilateral triangle symmetry"
            },
            {
              "step": "Force from one pair",
              "explanation": "F/L between any two wires = (μ₀I²)/(2πd) = (2×10⁻⁷ × 25)/0.2 = 5.0×10⁻⁶/0.2 = 2.5×10⁻⁵ N/m (attractive)"
            },
            {
              "step": "Vector sum for one wire",
              "explanation": "Each wire experiences two forces of equal magnitude from the other two wires, at 60° angle to each other"
            },
            {
              "step": "Calculate resultant magnitude",
              "explanation": "F_total/L = 2 × (2.5×10⁻⁵) × cos30° = 5.0×10⁻⁵ × 0.866 = 4.33×10⁻⁵ N/m"
            },
            {
              "step": "Determine direction",
              "explanation": "Due to symmetry, resultant force on each wire points toward the center of the triangle"
            },
            {
              "step": "Check all wires",
              "explanation": "All wires experience equal magnitude forces directed toward triangle center"
            }
          ],
          "final_answer": "Force per unit length on each wire = 4.33 × 10⁻⁵ N/m, directed toward the center of the triangle. The symmetric configuration creates a contracting force system.",
          "concept_applied": "Force calculation in symmetric multi-wire system",
          "image": {
            "url": "images/three-wire-system.png",
            "alt": "Three wire system",
            "caption": "Force analysis for three parallel current-carrying wires"
          }
        },
        {
          "title": "Current Balance Calculation",
          "problem": "In a current balance experiment, two parallel wires 0.08 m apart experience a magnetic force that is balanced by a 0.15 g mass hanging from one wire. If both wires carry the same current, find the current value.",
          "step_by_step": [
            {
              "step": "Calculate gravitational force",
              "explanation": "Weight = mg = 0.00015 kg × 9.8 m/s² = 1.47×10⁻³ N"
            },
            {
              "step": "Force per unit length",
              "explanation": "Need wire length to find F/L. Assume L = 0.25 m (typical for such experiments)"
            },
            {
              "step": "Magnetic force equals weight",
              "explanation": "F_mag = (μ₀I²L)/(2πd) = 1.47×10⁻³ N"
            },
            {
              "step": "Solve for current",
              "explanation": "I² = (1.47×10⁻³ × 2π × 0.08)/(4π×10⁻⁷ × 0.25) = (7.39×10⁻⁴)/(3.14×10⁻⁷) = 2354"
            },
            {
              "step": "Calculate current",
              "explanation": "I = √2354 = 48.5 A"
            },
            {
              "step": "Check reasonableness",
              "explanation": "48.5 A is reasonable for laboratory current balance experiments"
            }
          ],
          "final_answer": "Current = 48.5 A. This demonstrates how magnetic forces can be measured using mechanical balance methods.",
          "concept_applied": "Current calculation from force balance",
          "image": {
            "url": "images/current-balance.png",
            "alt": "Current balance",
            "caption": "Current determination using magnetic force balance"
          }
        }
      ]
    },
    {
      "section_title": "2. Complex Configurations and Practical Applications",
      "introduction": "This section extends the analysis to complex current configurations, non-parallel wires, and practical applications in power systems, motors, and measurement devices, exploring equilibrium conditions and stability analysis.",

      "key_concept": {
        "definition": "Non-Parallel Currents, Equilibrium Analysis, Current Loops, Power Transmission, Motor Windings, Force Stability",
        "context": "Real-world applications often involve complex current configurations beyond simple parallel wires. Non-parallel currents exhibit angular dependence in their forces, current loops interact through their magnetic moments, and multi-wire systems can achieve equilibrium states. Understanding these complex interactions is crucial for designing efficient electrical systems and predicting their mechanical behavior.",
        "image": {
          "url": "images/complex-configurations-concepts.png",
          "alt": "Complex configurations concepts",
          "caption": "Forces in complex current configurations and practical systems"
        }
      },

      "classifications": [
        {
          "type": "Complex Current Systems",
          "value": "Classification based on system geometry and application context",
          "characteristics": [
            "Non-parallel wires: angular force dependence",
            "Current loops: magnetic moment interactions",
            "Power transmission lines: three-phase systems",
            "Motor windings: distributed force patterns",
            "Equilibrium configurations: stable and unstable",
            "Current-carrying sheets: two-dimensional distributions"
          ],
          "behavior": "Different complex systems exhibit characteristic force behaviors. Non-parallel wires have forces decreasing with angle. Current loops interact as magnetic dipoles. Power lines have balanced three-phase forces. Motor windings create rotational forces. Equilibrium states can be stable or unstable. Current sheets produce uniform force distributions.",
          "examples": [
            {
              "process": "Power Transmission Line Analysis",
              "explanation": "Calculating forces in three-phase power transmission systems",
              "image": {
                "url": "images/power-line-forces.png",
                "alt": "Power line forces",
                "caption": "Force analysis in power transmission lines"
              }
            },
            {
              "process": "Motor Winding Forces",
              "explanation": "Analyzing magnetic forces in electric motor windings",
              "image": {
                "url": "images/motor-winding-forces.png",
                "alt": "Motor winding forces",
                "caption": "Force patterns in electric motor windings"
              }
            }
          ],
          "note": "In three-phase power systems, the instantaneous forces on conductors can be complex, but the time-averaged forces often simplify due to phase relationships"
        }
      ],

      "principles": [
        {
          "principle": "Complex Configurations and Applications",
          "statement": "Non-Parallel Wires: Force depends on angle between wires. For perpendicular wires: zero net force (different segments cancel). General case: requires integration of force elements. Current Loops: Interact through their magnetic moments. Torque τ = μ × B from other loop. Force between loops depends on orientation. Power Transmission: Three-phase systems: forces vary with time but average may be simple. Bundle conductors: multiple sub-conductors per phase reduce forces. Sag calculations: include magnetic forces in mechanical design. Motor Windings: Forces create torque on rotor. Commutation reverses currents to maintain rotation. Force distributions affect mechanical stress. Equilibrium Analysis: Points where magnetic forces balance. Can be stable (restoring forces) or unstable. Multi-wire arrays: can form stable patterns. Current Sheets: Force between parallel current sheets is uniform. Applications: Circuit breakers: magnetic forces assist in arc interruption. Fuse design: magnetic forces affect melting characteristics. Current limiters: use repulsive forces for protection. Magnetic levitation: balance magnetic forces against gravity. Measurement Standards: Current balances for absolute current measurement. Force calculations for calibration.",
          "application": "Analyze forces in non-parallel wire configurations. Calculate interactions between current loops. Design power transmission systems considering magnetic forces. Analyze motor winding forces and torques. Determine equilibrium conditions in current systems. Solve practical engineering problems involving current forces.",
          "example": "Three-phase power line: forces oscillate at twice line frequency. Current loops: aligned moments attract, anti-aligned repel. Motor windings: forces create continuous torque.",
          "analogy": "Complex current systems are like 'social interactions between groups of people'. 'Parallel currents' are like people 'walking in the same direction' who naturally 'move closer together'. 'Non-parallel currents' are like people 'walking at angles' who have more complex 'interaction patterns'. 'Current loops' are like 'circles of people holding hands' - they interact as whole groups rather than individuals. 'Power transmission lines' are like 'three dance troupes moving in coordinated patterns' where the 'group dynamics' create predictable overall behavior. 'Motor windings' are like 'carefully choreographed dance moves' that create continuous 'rotational motion'. 'Equilibrium' is like finding the 'sweet spot' where all the 'social forces' balance out.",
          "image": {
            "url": "images/complex-principles.png",
            "alt": "Complex principles",
            "caption": "Forces in complex current configurations and applications"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Non-Parallel Wire Forces",
          "problem": "Two long wires intersect at 60°. One wire carries 10 A current, the other carries 15 A current. The wires are separated by 0.1 m at their closest point. Estimate the force per unit length at the point of closest approach.",
          "step_by_step": [
            {
              "step": "Analyze geometry",
              "explanation": "Wires at 60° angle, closest separation = 0.1 m. Force will be reduced compared to parallel case"
            },
            {
              "step": "Parallel wire force for reference",
              "explanation": "If parallel: F/L = (2×10⁻⁷ × 10 × 15)/0.1 = 3.0×10⁻⁴ N/m"
            },
            {
              "step": "Angular reduction factor",
              "explanation": "For non-parallel wires, effective force is reduced. At 60°, reduction is significant but not zero"
            },
            {
              "step": "Approximate calculation",
              "explanation": "Exact calculation requires integration. Reasonable estimate: F/L ≈ 1.5×10⁻⁴ N/m (about half parallel case)"
            },
            {
              "step": "Determine direction",
              "explanation": "Force direction depends on current directions and will have components both perpendicular and parallel to wires"
            }
          ],
          "final_answer": "Approximate force per unit length ≈ 1.5 × 10⁻⁴ N/m. Exact value requires integration over wire lengths. Force is significantly reduced compared to parallel case.",
          "concept_applied": "Force estimation for non-parallel wires",
          "image": {
            "url": "images/non-parallel-forces.png",
            "alt": "Non-parallel forces",
            "caption": "Force analysis for non-parallel current-carrying wires"
          }
        },
        {
          "title": "Power Transmission Line Forces",
          "problem": "A three-phase transmission line has conductors arranged in an equilateral triangle with 2 m sides. Each conductor carries 1000 A RMS current with 120° phase differences. Calculate the maximum force per unit length on any conductor.",
          "step_by_step": [
            {
              "step": "Instantaneous currents",
              "explanation": "i_a = I₀sin(ωt), i_b = I₀sin(ωt-120°), i_c = I₀sin(ωt-240°), with I₀ = 1000√2 = 1414 A peak"
            },
            {
              "step": "Force between two conductors",
              "explanation": "F/L between any pair = (μ₀i₁i₂)/(2πd) = (2×10⁻⁷ × i₁i₂)/2"
            },
            {
              "step": "Worst-case scenario",
              "explanation": "Maximum force occurs when two currents are at peak values with appropriate signs"
            },
            {
              "step": "Calculate maximum force",
              "explanation": "F_max/L = (2×10⁻⁷ × 1414 × 1414)/2 = (2×10⁻⁷ × 2×10⁶)/2 = 0.4/2 = 0.2 N/m"
            },
            {
              "step": "Compare with DC case",
              "explanation": "For DC currents of 1000 A: F/L = (2×10⁻⁷ × 10⁶)/2 = 0.1 N/m. AC gives higher peak forces"
            }
          ],
          "final_answer": "Maximum force per unit length = 0.20 N/m. This substantial force must be considered in transmission line mechanical design.",
          "concept_applied": "Force calculation in three-phase power system",
          "image": {
            "url": "images/power-line-forces-example.png",
            "alt": "Power line forces example",
            "caption": "Force calculation for three-phase transmission line"
          }
        },
        {
          "title": "Current Loop Interaction",
          "problem": "Two identical circular loops, each with radius 0.1 m carrying 5 A current, are placed coaxially 0.3 m apart with their magnetic moments parallel. Calculate the force between the loops.",
          "step_by_step": [
            {
              "step": "Magnetic moment of each loop",
              "explanation": "μ = IπR² = 5 × π × 0.01 = 0.157 A·m²"
            },
            {
              "step": "Field from one loop on axis",
              "explanation": "B = (μ₀μ)/(2πz³) for z >> R. Here z = 0.3 m, R = 0.1 m, so z > R but not >> R"
            },
            {
              "step": "More accurate axial field",
              "explanation": "B = (μ₀IR²)/(2(R² + z²)³/²) = (4π×10⁻⁷ × 5 × 0.01)/(2(0.01 + 0.09)³/²) = (6.283×10⁻⁸)/(2 × 0.0316) = 6.283×10⁻⁸/0.0632 = 9.94×10⁻⁷ T"
            },
            {
              "step": "Force on second loop",
              "explanation": "For coaxial loops with parallel moments, force is attractive. Exact calculation complex, but small for this separation"
            },
            {
              "step": "Order of magnitude estimate",
              "explanation": "F ≈ (μ₀μ²)/(2πz⁴) ≈ (4π×10⁻⁷ × 0.0246)/(2π × 0.0081) ≈ (3.09×10⁻⁸)/(0.0509) ≈ 6.07×10⁻⁷ N (very small)"
            }
          ],
          "final_answer": "Force between loops ≈ 6 × 10⁻⁷ N (attractive). Very small force demonstrates weak interaction between separated current loops.",
          "concept_applied": "Force calculation between current loops",
          "image": {
            "url": "images/loop-interaction.png",
            "alt": "Loop interaction",
            "caption": "Force calculation between coaxial current loops"
          }
        },
        {
          "title": "Equilibrium in Current System",
          "problem": "Three parallel wires are arranged with wire 2 fixed at x = 0, carrying 10 A upward. Wires 1 and 3 are movable, carrying 5 A upward and 15 A upward respectively. Find the equilibrium positions if wire 1 is to the left and wire 3 to the right of wire 2.",
          "step_by_step": [
            {
              "step": "Force balance on wire 1",
              "explanation": "F₁₂ (from wire 2) to right, F₁₃ (from wire 3) to left. At equilibrium: F₁₂ = F₁₃"
            },
            {
              "step": "Set up equation for wire 1",
              "explanation": "(μ₀×5×10)/(2πd₁₂) = (μ₀×5×15)/(2πd₁₃) → 10/d₁₂ = 15/d₁₃ → d₁₃ = 1.5d₁₂"
            },
            {
              "step": "Force balance on wire 3",
              "explanation": "F₃₂ (from wire 2) to left, F₃₁ (from wire 1) to right. At equilibrium: F₃₂ = F₃₁"
            },
            {
              "step": "Set up equation for wire 3",
              "explanation": "(μ₀×15×10)/(2πd₃₂) = (μ₀×15×5)/(2πd₃₁) → 10/d₃₂ = 5/d₃₁ → d₃₁ = 0.5d₃₂"
            },
            {
              "step": "Solve system",
              "explanation": "From geometry: d₁₂ + d₃₂ = d₁₃, and d₃₁ = d₁₃. So d₃₂ = d₁₃ - d₁₂ = 1.5d₁₂ - d₁₂ = 0.5d₁₂. Also d₃₁ = 0.5d₃₂ = 0.25d₁₂. But d₃₁ = d₁₃ = 1.5d₁₂. Contradiction - no equilibrium possible with all currents same direction"
            },
            {
              "step": "Interpret result",
              "explanation": "With all currents same direction, wires 1 and 3 both attract toward wire 2, but cannot both be in equilibrium simultaneously"
            }
          ],
          "final_answer": "No equilibrium positions exist with all currents in the same direction. Different current directions would be needed for stable equilibrium.",
          "concept_applied": "Equilibrium analysis in multi-wire current system",
          "image": {
            "url": "images/equilibrium-analysis.png",
            "alt": "Equilibrium analysis",
            "caption": "Equilibrium analysis for three parallel current-carrying wires"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Magnetic force between currents",
    "Parallel currents",
    "Force per unit length",
    "Current attraction",
    "Current repulsion",
    "Right-hand rule",
    "Superposition principle",
    "Non-parallel currents",
    "Current loops interaction",
    "Equilibrium analysis",
    "Power transmission forces",
    "Current balance"
  ],

  "common_misconceptions": [
    "Thinking the force depends on which current is \"source\" and which is \"test\"",
    "Believing currents must be equal for Newton's third law to hold",
    "Confusing the direction of attraction/repulsion with current directions",
    "Assuming all current configurations have equilibrium states",
    "Thinking magnetic forces can do net work on current systems",
    "Believing force between non-parallel wires follows simple formulas",
    "Confusing time-average and instantaneous forces in AC systems"
  ],

  "real_world_applications": [
    "Power transmission line design",
    "Electric motor and generator design",
    "Circuit breaker operation",
    "Current measurement standards",
    "Magnetic levitation systems",
    "Fuse and protection device design",
    "Particle accelerator beam focusing",
    "Plasma confinement devices",
    "Electromagnetic launching systems",
    "Current transformer design",
    "Magnetic bearing systems",
    "Laboratory current balance instruments"
  ],

  "summary": "This unit has comprehensively explored the magnetic forces between current-carrying conductors, from fundamental parallel wire configurations to complex multi-wire systems and practical applications. Students have mastered the calculation of force magnitudes and directions, applied superposition principles to complex systems, and analyzed equilibrium conditions in current-carrying arrays. The principles developed provide essential understanding for designing electrical systems, predicting mechanical behavior, and appreciating the fundamental electromagnetic interactions that underlie numerous technologies."
}
