{
  "topic": "Magnetic Fields",
  "unit_title": "Magnetic Force on Moving Charges: Lorentz Force and Vector Cross Products",
  "unit_number": "Unit 4.1",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Electricity & Magnetism",
  "duration": "3-4 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "This unit introduces the fundamental concepts of magnetic forces on moving charges, focusing on the Lorentz force law and the mathematical framework of vector cross products. Students will develop proficiency in three-dimensional vector analysis and apply these skills to predict charged particle motion in magnetic fields.",

  "learning_objectives": [
    "Apply the Lorentz force law to calculate magnetic forces on moving charges",
    "Master vector cross product operations in three dimensions",
    "Predict charged particle trajectories in uniform magnetic fields",
    "Analyze combined electric and magnetic force effects",
    "Solve problems involving magnetic force direction using right-hand rules",
    "Calculate work done by magnetic forces on moving charges"
  ],

  "prerequisites": [
    "Understanding of vector mathematics and components",
    "Proficiency with Newton's laws of motion",
    "Knowledge of electric forces and fields",
    "Experience with circular motion dynamics",
    "Familiarity with basic kinematics in two and three dimensions"
  ],

  "core_concept": {
    "principle": "Lorentz Force Law, Vector Cross Products, Right-Hand Rules, Charged Particle Motion, Magnetic Work Theorem",
    "explanation": "Moving electric charges experience magnetic forces perpendicular to both their velocity and the magnetic field direction. This fundamental relationship, described by the Lorentz force law, requires three-dimensional vector analysis using cross products and leads to characteristic circular and helical motion patterns for charged particles in magnetic fields.",
    "image": {
      "url": "images/magnetic-force-core.png",
      "alt": "Magnetic force core concept",
      "caption": "Lorentz force and charged particle motion in magnetic fields"
    }
  },

  "sections": [
    {
      "section_title": "1. Lorentz Force Law and Vector Mathematics",
      "introduction": "This section establishes the mathematical foundation for magnetic forces, introducing the Lorentz force law and developing proficiency with vector cross products in three-dimensional space.",

      "key_concept": {
        "definition": "Lorentz Force Law, Vector Cross Product, Right-Hand Rule, Force Direction, Perpendicular Relationships",
        "context": "The magnetic force on a moving charge depends on the charge's velocity, the magnetic field strength, and their relative orientation. This relationship is mathematically described by the vector cross product, which produces a force perpendicular to both the velocity and field vectors. Understanding this three-dimensional interaction is crucial for predicting charged particle behavior in magnetic fields.",
        "image": {
          "url": "images/lorentz-force-concepts.png",
          "alt": "Lorentz force concepts",
          "caption": "Vector relationships in the Lorentz force law"
        }
      },

      "classifications": [
        {
          "type": "Magnetic Force Categories",
          "value": "Classification of magnetic force scenarios based on velocity-field orientation",
          "characteristics": [
            "Perpendicular motion: maximum force and circular trajectories",
            "Parallel motion: zero force and straight-line motion",
            "Oblique motion: helical trajectories with constant speed",
            "Crossed fields: electric and magnetic force balance",
            "Time-varying fields: complex acceleration patterns",
            "Non-uniform fields: focusing and mirror effects"
          ],
          "behavior": "Different velocity-field orientations produce distinct motion patterns. Perpendicular components cause circular motion while parallel components maintain straight-line motion. Combined effects create helical paths. Crossed fields can produce straight-line motion when forces balance. Time-varying fields accelerate charges, while non-uniform fields can trap particles.",
          "examples": [
            {
              "process": "Circular Motion in Uniform B-field",
              "explanation": "Charged particles with velocity perpendicular to uniform magnetic field execute uniform circular motion",
              "image": {
                "url": "images/circular-motion-bfield.png",
                "alt": "Circular motion in B-field",
                "caption": "Charged particle executing circular motion in uniform magnetic field"
              }
            },
            {
              "process": "Velocity Selector Configuration",
              "explanation": "Crossed electric and magnetic fields that allow only particles with specific velocity to pass undeflected",
              "image": {
                "url": "images/velocity-selector.png",
                "alt": "Velocity selector",
                "caption": "Crossed fields configuration for velocity selection"
              }
            }
          ],
          "note": "The magnetic force always acts perpendicular to the velocity vector, meaning it changes the direction of motion but does no work on the charged particle"
        }
      ],

      "principles": [
        {
          "principle": "Lorentz Force and Vector Analysis",
          "statement": "Lorentz Force Law: F = q(v × B) where F is magnetic force, q is charge, v is velocity vector, B is magnetic field vector. The magnitude is F = |q|vBsinθ where θ is the angle between v and B. Vector Cross Product: A × B produces a vector perpendicular to both A and B with magnitude |A||B|sinθ. Right-Hand Rule: Point fingers in direction of first vector (v), curl toward second vector (B), thumb shows force direction for positive charge. Force Direction: Positive charges experience force according to right-hand rule. Negative charges experience opposite force. Perpendicular Nature: Magnetic force is always perpendicular to both velocity and field, resulting in zero work done. Component Analysis: For perpendicular components, F_max = |q|v⊥B. For parallel components, F = 0. Vector Components: In Cartesian coordinates, v × B = (v_yB_z - v_zB_y)i + (v_zB_x - v_xB_z)j + (v_xB_y - v_yB_x)k.",
          "application": "Calculate magnetic force magnitude and direction for given charge, velocity, and field. Determine particle acceleration from magnetic force. Analyze force components in three dimensions. Predict initial force direction using right-hand rules. Solve for unknown quantities in magnetic force equations.",
          "example": "Proton moving east in magnetic field pointing north experiences upward force. Electron with same parameters experiences downward force. Particle with velocity parallel to field experiences zero force.",
          "analogy": "The magnetic force relationship is like a 'mechanical gear system'. The 'velocity vector' is like the 'rotation of the first gear', the 'magnetic field' is like the 'orientation of the second gear', and the resulting 'force' is like the 'output rotation' that's perpendicular to both input rotations. Just as gears must mesh at right angles to transfer motion efficiently, the magnetic force acts at right angles to both the motion and the field. The 'right-hand rule' is like the 'gear engagement rule' that determines the direction of the output rotation.",
          "image": {
            "url": "images/lorentz-principles.png",
            "alt": "Lorentz force principles",
            "caption": "Vector relationships and right-hand rule applications"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Basic Lorentz Force Calculation",
          "problem": "A proton (q = +1.6 × 10⁻¹⁹ C) moves with velocity v = (3.0 × 10⁶ i + 4.0 × 10⁶ j) m/s through a magnetic field B = (0.50 k) T. Find the magnetic force on the proton.",
          "step_by_step": [
            {
              "step": "Identify known quantities",
              "explanation": "q = +1.6 × 10⁻¹⁹ C, v = (3.0 × 10⁶ i + 4.0 × 10⁶ j) m/s, B = (0.50 k) T"
            },
            {
              "step": "Apply Lorentz force formula",
              "explanation": "F = q(v × B) = q[(v_yB_z - v_zB_y)i + (v_zB_x - v_xB_z)j + (v_xB_y - v_yB_x)k]"
            },
            {
              "step": "Calculate cross product components",
              "explanation": "v × B = (4.0×10⁶ × 0.50 - 0 × 0)i + (0 × 0 - 3.0×10⁶ × 0.50)j + (3.0×10⁶ × 0 - 4.0×10⁶ × 0)k = (2.0×10⁶)i + (-1.5×10⁶)j + (0)k"
            },
            {
              "step": "Multiply by charge",
              "explanation": "F = (1.6 × 10⁻¹⁹) × (2.0×10⁶ i - 1.5×10⁶ j) = (3.2 × 10⁻¹³ i - 2.4 × 10⁻¹³ j) N"
            },
            {
              "step": "Verify direction with right-hand rule",
              "explanation": "v in xy-plane, B in +z direction, right-hand rule gives force in xy-plane perpendicular to v"
            }
          ],
          "final_answer": "F = (3.2 × 10⁻¹³ i - 2.4 × 10⁻¹³ j) N, magnitude = 4.0 × 10⁻¹³ N, direction in xy-plane",
          "concept_applied": "Lorentz force calculation with vector components",
          "image": {
            "url": "images/basic-lorentz-example.png",
            "alt": "Basic Lorentz example",
            "caption": "Vector components in Lorentz force calculation"
          }
        },
        {
          "title": "Right-Hand Rule Application",
          "problem": "An electron enters a region with uniform magnetic field pointing into the page with initial velocity to the right. Determine the direction of the initial magnetic force and describe the resulting motion.",
          "step_by_step": [
            {
              "step": "Identify charge type",
              "explanation": "Electron has negative charge (q = -e)"
            },
            {
              "step": "Apply right-hand rule for positive charge",
              "explanation": "For positive charge: point fingers right (v), curl into page (B), thumb points upward"
            },
            {
              "step": "Reverse for negative charge",
              "explanation": "Electron experiences force opposite to right-hand rule result, so force is downward"
            },
            {
              "step": "Predict motion",
              "explanation": "Force is perpendicular to velocity, causing circular motion. For downward initial force, electron will curve downward initially"
            },
            {
              "step": "Determine rotation direction",
              "explanation": "Looking from above: electron will curve clockwise (opposite to positive charge)"
            }
          ],
          "final_answer": "Initial magnetic force is downward. Electron will execute clockwise circular motion in the plane of the page.",
          "concept_applied": "Right-hand rule for negative charges and motion prediction",
          "image": {
            "url": "images/electron-motion-example.png",
            "alt": "Electron motion example",
            "caption": "Electron motion in uniform magnetic field"
          }
        },
        {
          "title": "Force Magnitude with Angular Dependence",
          "problem": "A charged particle with q = 2.0 μC moves at 5.0 × 10⁴ m/s through a 0.80 T magnetic field. Calculate the magnetic force when the angle between velocity and field is: (a) 90°, (b) 30°, (c) 0°",
          "step_by_step": [
            {
              "step": "Recall force magnitude formula",
              "explanation": "F = |q|vBsinθ"
            },
            {
              "step": "Calculate for 90°",
              "explanation": "F = (2.0 × 10⁻⁶)(5.0 × 10⁴)(0.80)sin90° = (2.0×10⁻⁶)(4.0×10⁴)(1) = 8.0 × 10⁻² N"
            },
            {
              "step": "Calculate for 30°",
              "explanation": "F = (2.0 × 10⁻⁶)(5.0 × 10⁴)(0.80)sin30° = (2.0×10⁻⁶)(4.0×10⁴)(0.5) = 4.0 × 10⁻² N"
            },
            {
              "step": "Calculate for 0°",
              "explanation": "F = (2.0 × 10⁻⁶)(5.0 × 10⁴)(0.80)sin0° = (2.0×10⁻⁶)(4.0×10⁴)(0) = 0 N"
            },
            {
              "step": "Interpret results",
              "explanation": "Maximum force at 90°, half maximum at 30°, zero force when parallel to field"
            }
          ],
          "final_answer": "(a) 0.080 N, (b) 0.040 N, (c) 0 N. Demonstrates the sinθ dependence of magnetic force.",
          "concept_applied": "Angular dependence of magnetic force magnitude",
          "image": {
            "url": "images/angular-dependence-example.png",
            "alt": "Angular dependence example",
            "caption": "Magnetic force variation with angle between v and B"
          }
        }
      ]
    },
    {
      "section_title": "2. Charged Particle Motion in Magnetic Fields",
      "introduction": "This section explores the characteristic motion patterns of charged particles in magnetic fields, including circular motion, helical paths, and applications like mass spectrometers and cyclotrons.",

      "key_concept": {
        "definition": "Circular Motion, Helical Trajectories, Gyroradius, Cyclotron Frequency, Magnetic Confinement",
        "context": "When charged particles move through uniform magnetic fields, they experience constant-magnitude forces perpendicular to their motion, resulting in characteristic curved trajectories. The perpendicular velocity component causes circular motion, while any parallel component produces helical paths. These motion patterns form the basis for numerous practical applications in particle physics and engineering.",
        "image": {
          "url": "images/particle-motion-concepts.png",
          "alt": "Particle motion concepts",
          "caption": "Charged particle trajectories in magnetic fields"
        }
      },

      "classifications": [
        {
          "type": "Particle Motion Regimes",
          "value": "Classification of charged particle trajectories based on initial conditions",
          "characteristics": [
            "Pure circular motion: velocity entirely perpendicular to B-field",
            "Helical motion: velocity has both perpendicular and parallel components",
            "Straight-line motion: velocity parallel to B-field",
            "Complex trajectories: in non-uniform or time-varying fields",
            "Magnetic mirroring: in converging field lines",
            "Drift motions: in crossed electric and magnetic fields"
          ],
          "behavior": "Different initial conditions produce distinct motion patterns. Circular motion has constant radius and period. Helical motion combines circular motion with constant drift. Straight-line motion continues unaffected. Complex trajectories occur in practical field configurations. Magnetic mirroring reflects particles in converging fields. Crossed fields cause drift perpendicular to both fields.",
          "examples": [
            {
              "process": "Cyclotron Motion",
              "explanation": "Charged particles executing circular motion with constant cyclotron frequency",
              "image": {
                "url": "images/cyclotron-motion.png",
                "alt": "Cyclotron motion",
                "caption": "Circular motion of charged particle in uniform magnetic field"
              }
            },
            {
              "process": "Magnetic Mirror Effect",
              "explanation": "Particle reflection in regions of increasing magnetic field strength",
              "image": {
                "url": "images/magnetic-mirror.png",
                "alt": "Magnetic mirror",
                "caption": "Particle reflection in converging magnetic field"
              }
            }
          ],
          "note": "The magnetic force cannot change the speed or kinetic energy of a charged particle, only its direction of motion"
        }
      ],

      "principles": [
        {
          "principle": "Charged Particle Dynamics",
          "statement": "Circular Motion: For v⊥B, magnetic force provides centripetal acceleration: |q|vB = mv²/r. Gyroradius: r = mv/(|q|B) - radius of circular path. Cyclotron Frequency: f = |q|B/(2πm) - frequency of revolution. Angular Frequency: ω = |q|B/m. Helical Motion: For v with both ⊥ and ∥ components, superposition of circular motion and constant drift. Pitch: distance between helix turns = v∥T = 2πmv∥/(|q|B). Magnetic Work Theorem: dW = F·ds = 0 since F⊥v, so magnetic fields do no work. Energy Conservation: Kinetic energy remains constant in pure magnetic fields. Speed Conservation: |v| remains constant, only direction changes. Mass Spectrometry: r ∝ m for fixed q, v, B - basis for mass separation. Velocity Selector: E = vB for straight-line motion in crossed fields.",
          "application": "Calculate radius and period of circular motion. Determine helical motion parameters. Analyze particle trajectories in magnetic fields. Solve for unknown masses or charges from motion observations. Design magnetic confinement systems. Analyze mass spectrometer operation.",
          "example": "Proton in 1 T field with 10⁶ m/s perpendicular velocity has r ≈ 0.01 m and f ≈ 15 MHz. Electron with same parameters has much smaller r and higher f.",
          "analogy": "Charged particle motion in magnetic fields is like a 'ball on a string' being swung in circles. The 'magnetic force' acts like the 'tension in the string' - always perpendicular to the motion, constantly pulling the particle into a curved path. The 'gyroradius' is like the 'length of the string' - longer for heavier particles (larger m) or faster motion (larger v), but shorter for stronger 'pull' (larger B). The 'cyclotron frequency' is like the 'swinging rate' - independent of how fast you're swinging, just depends on the 'string properties'. Helical motion is like 'swinging the ball while walking forward' - circular motion combined with linear drift.",
          "image": {
            "url": "images/particle-dynamics-principles.png",
            "alt": "Particle dynamics principles",
            "caption": "Circular and helical motion parameters in magnetic fields"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Circular Motion Parameters",
          "problem": "An electron (m = 9.11 × 10⁻³¹ kg, q = -1.6 × 10⁻¹⁹ C) moves perpendicular to a 0.010 T magnetic field with speed 2.0 × 10⁶ m/s. Find the radius, period, and frequency of its circular motion.",
          "step_by_step": [
            {
              "step": "Gyroradius formula",
              "explanation": "r = mv/(|q|B) - use magnitude of charge for radius calculation"
            },
            {
              "step": "Calculate radius",
              "explanation": "r = (9.11×10⁻³¹ kg)(2.0×10⁶ m/s)/((1.6×10⁻¹⁹ C)(0.010 T)) = (1.822×10⁻²⁴)/(1.6×10⁻²¹) = 1.14 × 10⁻³ m = 1.14 mm"
            },
            {
              "step": "Cyclotron frequency",
              "explanation": "f = |q|B/(2πm) = (1.6×10⁻¹⁹)(0.010)/(2π×9.11×10⁻³¹) = (1.6×10⁻²¹)/(5.72×10⁻³⁰) = 2.80 × 10⁸ Hz"
            },
            {
              "step": "Period of motion",
              "explanation": "T = 1/f = 1/(2.80×10⁸) = 3.57 × 10⁻⁹ s = 3.57 ns"
            },
            {
              "step": "Verify with circumference",
              "explanation": "v = 2πr/T = 2π(1.14×10⁻³)/(3.57×10⁻⁹) = 2.00 × 10⁶ m/s ✓"
            }
          ],
          "final_answer": "Radius = 1.14 mm, Frequency = 280 MHz, Period = 3.57 ns. Electron executes very rapid circular motion with small radius.",
          "concept_applied": "Circular motion parameters in magnetic field",
          "image": {
            "url": "images/circular-motion-example.png",
            "alt": "Circular motion example",
            "caption": "Electron circular motion calculation"
          }
        },
        {
          "title": "Helical Motion Analysis",
          "problem": "A proton (m = 1.67 × 10⁻²⁷ kg, q = +1.6 × 10⁻¹⁹ C) enters a 0.50 T magnetic field with velocity v = (4.0 × 10⁶ i + 3.0 × 10⁶ k) m/s. Describe its motion and find the helix radius and pitch.",
          "step_by_step": [
            {
              "step": "Identify velocity components",
              "explanation": "Assume B = B j (in y-direction). v_x = 4.0 × 10⁶ m/s, v_z = 3.0 × 10⁶ m/s, v_y = 0"
            },
            {
              "step": "Determine perpendicular component",
              "explanation": "v⊥ = √(v_x² + v_z²) = √(16 + 9)×10⁶ = 5.0 × 10⁶ m/s (since B is in y-direction, both x and z components are perpendicular)"
            },
            {
              "step": "Calculate gyroradius",
              "explanation": "r = mv⊥/(|q|B) = (1.67×10⁻²⁷)(5.0×10⁶)/((1.6×10⁻¹⁹)(0.50)) = (8.35×10⁻²¹)/(8.0×10⁻²⁰) = 0.104 m"
            },
            {
              "step": "Find parallel component",
              "explanation": "v∥ = v_y = 0 m/s (since B is in y-direction and v has no y-component)"
            },
            {
              "step": "Wait - reassess coordinate system",
              "explanation": "Problem states v = (4.0×10⁶ i + 3.0×10⁶ k) but doesn't specify B direction. Assume B = B k for this to make sense as helical motion."
            },
            {
              "step": "Correct assumption",
              "explanation": "Let B = (0.50 k) T. Then v∥ = v_z = 3.0 × 10⁶ m/s, v⊥ = v_x = 4.0 × 10⁶ m/s"
            },
            {
              "step": "Recalculate radius",
              "explanation": "r = mv⊥/(|q|B) = (1.67×10⁻²⁷)(4.0×10⁶)/((1.6×10⁻¹⁹)(0.50)) = (6.68×10⁻²¹)/(8.0×10⁻²⁰) = 0.0835 m"
            },
            {
              "step": "Calculate cyclotron period",
              "explanation": "T = 2πm/(|q|B) = 2π(1.67×10⁻²⁷)/((1.6×10⁻¹⁹)(0.50)) = (1.05×10⁻²⁶)/(8.0×10⁻²⁰) = 1.31 × 10⁻⁷ s"
            },
            {
              "step": "Find pitch",
              "explanation": "pitch = v∥T = (3.0×10⁶)(1.31×10⁻⁷) = 0.393 m"
            }
          ],
          "final_answer": "Proton executes helical motion with radius 8.35 cm and pitch 39.3 cm. Circular motion in xy-plane with drift along z-axis.",
          "concept_applied": "Helical motion parameters and analysis",
          "image": {
            "url": "images/helical-motion-example.png",
            "alt": "Helical motion example",
            "caption": "Proton helical trajectory in magnetic field"
          }
        },
        {
          "title": "Mass Spectrometer Application",
          "problem": "In a mass spectrometer, singly ionized atoms (q = +e) are accelerated through 1000 V, then enter a 0.200 T magnetic field perpendicularly. If the radius of curvature is measured as 8.50 cm, determine the atomic mass.",
          "step_by_step": [
            {
              "step": "Relate energy and velocity",
              "explanation": "Kinetic energy from acceleration: ½mv² = qV = eV"
            },
            {
              "step": "Solve for velocity",
              "explanation": "v = √(2eV/m)"
            },
            {
              "step": "Gyroradius formula",
              "explanation": "r = mv/(eB) = m√(2eV/m)/(eB) = √(2mV/e)/B"
            },
            {
              "step": "Solve for mass",
              "explanation": "r² = 2mV/(eB²) → m = r²eB²/(2V)"
            },
            {
              "step": "Calculate mass",
              "explanation": "m = (0.0850)²(1.6×10⁻¹⁹)(0.200)²/(2×1000) = (7.225×10⁻³)(6.4×10⁻²¹)/(2000) = (4.624×10⁻²³)/(2000) = 2.312 × 10⁻²⁶ kg"
            },
            {
              "step": "Convert to atomic mass units",
              "explanation": "1 u = 1.66 × 10⁻²⁷ kg, so m = (2.312×10⁻²⁶)/(1.66×10⁻²⁷) = 13.93 u"
            }
          ],
          "final_answer": "Atomic mass = 13.93 u. This identifies the atoms as nitrogen-14 (most common isotope).",
          "concept_applied": "Mass spectrometry using magnetic deflection",
          "image": {
            "url": "images/mass-spectrometer-example.png",
            "alt": "Mass spectrometer example",
            "caption": "Mass determination using magnetic deflection"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Lorentz force law",
    "Vector cross product",
    "Right-hand rule",
    "Magnetic force",
    "Gyroradius",
    "Cyclotron frequency",
    "Helical motion",
    "Magnetic confinement",
    "Velocity selector",
    "Mass spectrometer",
    "Magnetic mirror",
    "Pitch of helix"
  ],

  "common_misconceptions": [
    "Thinking magnetic forces can do work on charged particles",
    "Believing magnetic fields can change particle speed",
    "Confusing right-hand rule directions for negative charges",
    "Assuming all magnetic forces cause circular motion",
    "Thinking parallel velocity components affect circular motion radius",
    "Believing magnetic force depends on particle mass",
    "Confusing electric and magnetic force behaviors"
  ],

  "real_world_applications": [
    "Mass spectrometers for chemical analysis",
    "Particle accelerators and cyclotrons",
    "Magnetic confinement fusion (tokamaks)",
    "Cathode ray tubes and old TV displays",
    "Spacecraft propulsion (ion thrusters)",
    "Medical imaging (MRI principles)",
    "Aurora phenomena explanation",
    "Space weather and radiation belt modeling",
    "Electron microscopes",
    "Magnetic bottle plasma confinement",
    "Velocity selectors in particle beams",
    "Charged particle beam steering"
  ],

  "summary": "This unit has established the fundamental principles of magnetic forces on moving charges through the Lorentz force law and vector cross product mathematics. Students have developed proficiency in calculating magnetic forces, predicting charged particle trajectories, and understanding characteristic motion patterns including circular and helical paths. The applications to practical devices like mass spectrometers and the fundamental limitation of magnetic forces doing no work provide a comprehensive foundation for advanced study of electromagnetism."
}
