{
  "topic": "Magnetic Fields",
  "unit_title": "Problem Solving I: Advanced Magnetic Field Problems",
  "unit_number": "Unit 4.9",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Electricity & Magnetism",
  "duration": "4-5 hours",
  "difficulty_level": "advanced",
  "expanded_description": "This unit represents the culmination of magnetic field theory, challenging students with complex, multi-faceted problems that require synthesis of concepts from across magnetic field analysis. Students will tackle non-standard configurations, develop creative solution strategies, and apply multiple analysis methods to verify results in sophisticated magnetic field scenarios.",

  "learning_objectives": [
    "Synthesize multiple magnetic field analysis techniques in complex problems",
    "Develop systematic approaches for non-standard magnetic configurations",
    "Apply verification methods to ensure solution accuracy in magnetic problems",
    "Analyze systems with combined electric and magnetic field interactions",
    "Design magnetic systems to meet multiple competing requirements",
    "Solve real-world inspired magnetic problems with practical constraints"
  ],

  "prerequisites": [
    "Mastery of Biot-Savart Law and Ampere's Law applications",
    "Understanding of magnetic force and torque principles",
    "Proficiency with magnetic flux and Gauss's Law for Magnetism",
    "Experience with vector calculus and 3D coordinate systems",
    "Knowledge of charged particle motion in magnetic fields"
  ],

  "core_concept": {
    "principle": "Problem Synthesis, Multiple Method Verification, Creative Magnetic Solutions, Real-World Magnetic Constraints, Systematic Magnetic Analysis",
    "explanation": "Advanced magnetic field problems require integrating concepts from across magnetic field theory and developing sophisticated problem-solving approaches. These challenges often feature non-standard configurations, multiple valid solution paths, and real-world constraints that demand both analytical rigor and creative thinking in magnetic contexts.",
    "image": {
      "url": "images/magnetic-problems-core.png",
      "alt": "Magnetic problems core concept",
      "caption": "Synthesis of multiple analysis techniques for complex magnetic problems"
    }
  },

  "sections": [
    {
      "section_title": "1. Complex Magnetic Configurations and Multi-Method Analysis",
      "introduction": "This section tackles sophisticated magnetic field problems that defy straightforward analysis, requiring creative application of multiple techniques and systematic verification approaches to ensure accurate solutions in complex geometries.",

      "key_concept": {
        "definition": "Magnetic Field Synthesis, Multiple Analysis Methods, Magnetic Solution Verification, Constraint Satisfaction, Optimization Approaches",
        "context": "Real-world magnetic problems often involve complex current distributions, unusual boundary conditions, and requirements for multiple analysis methods to verify solutions. Developing systematic approaches for these challenges requires deep understanding of magnetic theory fundamentals and the ability to recognize which techniques are most appropriate for each situation.",
        "image": {
          "url": "images/complex-magnetic-concepts.png",
          "alt": "Complex magnetic concepts",
          "caption": "Advanced techniques for complex magnetic configuration analysis"
        }
      },

      "classifications": [
        {
          "type": "Advanced Magnetic Problem Categories",
          "value": "Classification of complex magnetic problem types and solution approaches",
          "characteristics": [
            "Non-standard geometries: configurations without obvious symmetry",
            "Multiple source systems: superposition of complex field patterns",
            "Combined field problems: electric and magnetic field interactions",
            "Boundary value problems: interfaces between different media",
            "Optimization challenges: designing magnetic systems to specifications",
            "Verification puzzles: problems requiring multiple solution methods"
          ],
          "behavior": "Different problem types require distinct solution strategies. Non-standard geometries often need numerical or approximation methods. Multiple sources require careful superposition. Combined fields involve Lorentz force analysis. Boundary problems need field continuity conditions. Optimization requires parameter variation. Verification puzzles test solution robustness.",
          "examples": [
            {
              "process": "Multi-Loop Field Analysis",
              "explanation": "Solving magnetic fields from complex arrangements of current loops using superposition and symmetry",
              "image": {
                "url": "images/multi-loop-analysis.png",
                "alt": "Multi-loop analysis",
                "caption": "Advanced analysis of multiple current loop systems"
              }
            },
            {
              "process": "Magnetic System Design",
              "explanation": "Designing current configurations to achieve specified magnetic field patterns",
              "image": {
                "url": "images/magnetic-system-design.png",
                "alt": "Magnetic system design",
                "caption": "Design approach for creating specific magnetic field distributions"
              }
            }
          ],
          "note": "The most challenging magnetic problems often have multiple valid solution approaches, and using different methods for verification is a key professional skill in electromagnetism"
        }
      ],

      "principles": [
        {
          "principle": "Complex Magnetic Problem Solving",
          "statement": "Systematic Problem Approach: 1. Understand the problem completely and identify all given quantities. 2. Determine the appropriate magnetic theory principles to apply. 3. Choose the most efficient analysis method(s). 4. Formulate equations systematically with clear coordinate systems. 5. Solve using most efficient mathematical techniques. 6. Verify using alternative magnetic analysis methods. 7. Interpret results physically and check units/dimensions. Multiple Method Verification: Solve using Biot-Savart Law, then verify with Ampere's Law where applicable. Use symmetry arguments to check field patterns. Apply superposition principle for complex systems. Use boundary conditions at interfaces. Calculate energy considerations as cross-check. Non-Standard Configurations: For asymmetric systems, use coordinate transformations. For complex geometries, break into simpler elements. For distributed currents, use integration techniques. For boundary problems, apply field continuity. Combined Field Analysis: Use full Lorentz force F = q(E + v × B). Analyze particle trajectories in crossed fields. Calculate work and energy in electromagnetic systems. Optimization Techniques: Parameter sweeping for design variables. Sensitivity analysis for critical components. Trade-off analysis for competing requirements. Robust design for manufacturing variations. Real-World Considerations: Include material permeability effects. Consider finite size and edge effects. Account for current distribution non-idealities. Include thermal and mechanical constraints.",
          "application": "Analyze complex multi-source magnetic systems. Solve magnetic boundary value problems. Design magnetic field configurations to specifications. Verify solutions using multiple independent methods. Handle real-world practical limitations in magnetic analysis. Optimize magnetic system performance parameters.",
          "example": "Helmholtz coil optimization for field uniformity. Magnetic shield design for field exclusion. Particle beam steering system design. Current distribution for specified field pattern.",
          "analogy": "Advanced magnetic problems are like complex 'magnetic architecture' challenges. 'Non-standard geometries' are like 'custom building designs' that don't follow 'standard blueprints'. 'Multiple analysis methods' are like using different 'engineering disciplines' (structural, electrical, mechanical) to verify a 'building design'. 'Combined field problems' are like designing 'smart buildings' with integrated 'electrical, mechanical, and environmental systems'. 'Optimization challenges' are like balancing 'aesthetic design', 'functional requirements', and 'budget constraints'. 'Verification' is like having multiple 'engineering firms' check the same 'design calculations'. The best 'magnetic architects' know when to use 'standard techniques' and when to develop 'creative solutions' for 'unique magnetic challenges'.",
          "image": {
            "url": "images/complex-magnetic-principles.png",
            "alt": "Complex magnetic principles",
            "caption": "Systematic approaches for complex magnetic problem solving"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Magnetic Field from Complex Current Loop",
          "problem": "A current I flows through a wire bent into an equilateral triangle of side a, with a circular arc of radius a replacing one side (arc subtends 60°). Find the magnetic field at the center of the arc.",
          "step_by_step": [
            {
              "step": "Decompose the configuration",
              "explanation": "The configuration consists of two straight segments and one circular arc"
            },
            {
              "step": "Field from straight segments",
              "explanation": "For each straight wire segment ending at the arc center: use finite wire formula B = (μ₀I/4πR)(sinθ₂ - sinθ₁). For segment pointing toward center: θ₁ = 0°, θ₂ = 60°, distance R = a√3/2"
            },
            {
              "step": "Calculate straight segment contribution",
              "explanation": "B_straight = (μ₀I/4π(a√3/2))(sin60° - sin0°) = (μ₀I/2πa√3)(√3/2) = μ₀I/4πa (for one segment). Two segments give 2 × μ₀I/4πa = μ₀I/2πa"
            },
            {
              "step": "Field from circular arc",
              "explanation": "For circular arc: B_arc = (μ₀I/4πR)(θ) where θ = 60° = π/3 radians, R = a. So B_arc = (μ₀I/4πa)(π/3) = μ₀I/12a"
            },
            {
              "step": "Determine directions and sum",
              "explanation": "All contributions are perpendicular to the plane. Straight segments and arc all give field in same direction (right-hand rule). B_total = μ₀I/2πa + μ₀I/12a = (6μ₀I/12πa + πμ₀I/12πa) = μ₀I(6+π)/12πa"
            },
            {
              "step": "Verify with alternative approach",
              "explanation": "Check limiting cases: if arc were full circle (θ=2π), should recover circle formula"
            }
          ],
          "final_answer": "Magnetic field at center = μ₀I(6+π)/12πa, directed perpendicular to the plane according to right-hand rule.",
          "concept_applied": "Superposition of magnetic fields from different current elements",
          "image": {
            "url": "images/complex-loop-field.png",
            "alt": "Complex loop field",
            "caption": "Magnetic field calculation for composite current loop"
          }
        },
        {
          "title": "Optimized Helmholtz Coil Design",
          "problem": "Design a Helmholtz coil system to produce a magnetic field of 5.0 mT at the center using standard AWG copper wire that can safely carry 3.0 A. The coils should be as compact as possible while maintaining good field uniformity (±1% over central 1/3 region).",
          "step_by_step": [
            {
              "step": "Helmholtz coil field formula",
              "explanation": "For two coils of N turns each, radius R, separation R: B = (4/5)³/² × (μ₀NI/R) = 0.7155 × (μ₀NI/R)"
            },
            {
              "step": "Solve for N/R ratio",
              "explanation": "B = 0.005 T, I = 3.0 A, μ₀ = 4π×10⁻⁷. 0.005 = 0.7155 × (4π×10⁻⁷ × N × 3.0/R) = 0.7155 × (3.77×10⁻⁶ N/R). So N/R = 0.005/(0.7155×3.77×10⁻⁶) = 1854"
            },
            {
              "step": "Consider practical constraints",
              "explanation": "Standard wire gauges: AWG 22 carries ~3A, diameter ~0.644 mm. For compact design, choose small R. Try R = 0.05 m, then N = 1854 × 0.05 = 92.7 turns → use 93 turns"
            },
            {
              "step": "Check physical feasibility",
              "explanation": "93 turns of 0.644 mm wire ≈ 60 mm length per coil. With R=5 cm, length/diameter ratio reasonable"
            },
            {
              "step": "Verify field uniformity",
              "explanation": "For Helmholtz configuration (separation = R), field is very uniform in central region. At z=R/3 from center, field decreases by <1%"
            },
            {
              "step": "Final design specification",
              "explanation": "Two coils, R=5 cm, 93 turns each of AWG 22 wire, separation 5 cm, current 3.0 A produces B=5.0 mT"
            }
          ],
          "final_answer": "Design: Two coils of radius 5.0 cm, 93 turns each, separated by 5.0 cm, carrying 3.0 A current. Produces 5.0 mT field with excellent uniformity in central region.",
          "concept_applied": "Magnetic system design with practical constraints",
          "image": {
            "url": "images/helmholtz-design.png",
            "alt": "Helmholtz design",
            "caption": "Optimized Helmholtz coil design with practical constraints"
          }
        },
        {
          "title": "Multiple Method Verification Problem",
          "problem": "A long cylindrical conductor of radius R has a cylindrical hole of radius R/2 whose axis is parallel to the conductor axis and located at distance R/2 from it. The conductor carries uniform current density J. Find the magnetic field at the center of the hole using both superposition and direct integration methods.",
          "step_by_step": [
            {
              "step": "Superposition method",
              "explanation": "Consider the configuration as superposition of: (1) solid cylinder radius R with current density J, (2) solid cylinder radius R/2 with current density -J (representing the hole)"
            },
            {
              "step": "Field from large cylinder at hole center",
              "explanation": "Use Ampere's Law for solid cylinder: B = (μ₀J r)/2 where r is distance from axis. Here r = R/2, so B₁ = (μ₀J R/2)/2 = μ₀JR/4"
            },
            {
              "step": "Field from small 'negative' cylinder",
              "explanation": "For the hole-filling cylinder (radius R/2) with current density -J: at its center, B = 0 (field is zero at axis of symmetric current distribution)"
            },
            {
              "step": "Total field by superposition",
              "explanation": "B_total = B₁ + B₂ = μ₀JR/4 + 0 = μ₀JR/4"
            },
            {
              "step": "Direct integration method",
              "explanation": "Set up coordinate system with origin at hole center. Integrate dB from all current elements using Biot-Savart Law. Due to symmetry, only component along certain direction remains"
            },
            {
              "step": "Verify methods agree",
              "explanation": "Both methods give B = μ₀JR/4, confirming the solution"
            }
          ],
          "final_answer": "Magnetic field at hole center = μ₀JR/4. The field is uniform in the hole region and parallel to the conductor axis.",
          "concept_applied": "Multiple method solution and verification",
          "image": {
            "url": "images/cylinder-with-hole.png",
            "alt": "Cylinder with hole",
            "caption": "Magnetic field in conductor with off-axis hole using superposition"
          }
        }
      ]
    },
    {
      "section_title": "2. Advanced Applications and Real-World Magnetic Systems",
      "introduction": "This section focuses on magnetic system synthesis—designing configurations to meet specific requirements—and applies advanced analysis techniques to real-world inspired problems with practical constraints and non-ideal conditions.",

      "key_concept": {
        "definition": "Magnetic System Synthesis, Real-World Constraints, Non-Ideal Conditions, Practical Design, Performance Optimization",
        "context": "Magnetic system synthesis involves working backward from desired magnetic field characteristics to create current configurations that meet specifications. Real-world problems introduce practical constraints like material limitations, power dissipation, thermal effects, and manufacturing tolerances that must be considered in both analysis and design.",
        "image": {
          "url": "images/magnetic-synthesis-concepts.png",
          "alt": "Magnetic synthesis concepts",
          "caption": "Magnetic system synthesis and real-world application challenges"
        }
      },

      "classifications": [
        {
          "type": "Synthesis and Application Challenges",
          "value": "Categories of design-oriented and real-world magnetic problems",
          "characteristics": [
            "Performance specification problems: designing to meet field metrics",
            "Material selection challenges: working with available magnetic materials",
            "Tolerance analysis: accounting for manufacturing variations",
            "Thermal management: current density and cooling constraints",
            "Geometric optimization: shaping fields through conductor placement",
            "Multi-objective optimization: balancing competing requirements"
          ],
          "behavior": "Different synthesis challenges require specialized approaches. Performance specifications drive topological choices. Material selection involves practical compromises. Tolerance analysis ensures robustness. Thermal management affects current limits. Geometric optimization uses conductor shaping. Multi-objective optimization requires trade-off analysis.",
          "examples": [
            {
              "process": "Specification-Based Magnetic Design",
              "explanation": "Creating current configurations to achieve specified magnetic field patterns and strengths",
              "image": {
                "url": "images/specification-magnetic-design.png",
                "alt": "Specification magnetic design",
                "caption": "Magnetic system design from performance specifications"
              }
            },
            {
              "process": "Real-World Constraint Handling",
              "explanation": "Accounting for practical limitations like material availability, power requirements, and thermal limits",
              "image": {
                "url": "images/real-world-magnetic-constraints.png",
                "alt": "Real-world magnetic constraints",
                "caption": "Magnetic analysis with practical real-world constraints"
              }
            }
          ],
          "note": "The most valuable magnetic system designers are those who can create practical solutions that work reliably under real-world conditions, not just theoretically correct designs"
        }
      ],

      "principles": [
        {
          "principle": "Advanced Magnetic Applications",
          "statement": "Synthesis Approaches: Field-pattern approach: start with desired magnetic field configuration. Current-distribution approach: build from practical conductor arrangements. Iterative refinement: start with simple system, add complexity as needed. Specification Translation: Convert performance requirements to mathematical constraints. Field strength requirements → current × turns relationships. Field uniformity requirements → geometric optimization. Field direction requirements → conductor orientation. Power limitations → current density constraints. Practical Constraints: Conductor size: use standard available wire gauges. Current capacity: ensure conductors can handle current. Power dissipation: consider heating effects. Temperature limits: account for thermal effects on resistance and materials. Cost limitations: balance performance and economics. Space constraints: consider physical size limitations. Non-Ideal Effects: Conductor resistance: include power losses. Magnetic materials: account for permeability and saturation. Edge effects: finite size corrections. Manufacturing tolerances: analyze sensitivity to variations. Stray fields: consider field leakage. Thermal drift: resistance changes with temperature. Optimization Techniques: Parameter sweeping: try different geometric parameters. Field mapping: calculate field patterns for different designs. Sensitivity analysis: determine critical design parameters. Trade-off analysis: balance competing requirements. Robust design: ensure performance under variations. Verification Methods: Analytical checks: compare with known solutions. Numerical simulation: use magnetic field software. Prototype testing: build and measure actual systems. Worst-case analysis: check performance boundaries. Cost-benefit analysis: evaluate practical feasibility.",
          "application": "Design magnetic systems to meet specified performance requirements. Select appropriate components considering practical constraints. Analyze systems with non-ideal conditions and real-world effects. Optimize magnetic designs for multiple competing objectives. Verify designs through analysis, simulation, and testing. Handle real-world limitations in magnetic system implementation.",
          "example": "MRI magnet design with field homogeneity specifications. Particle beam steering magnet optimization. Magnetic separator design for industrial applications. Navigation system compass calibration.",
          "analogy": "Magnetic system synthesis is like 'orchestral composition' for 'magnetic fields'. The 'performance specifications' are like the 'musical score'—desired 'volume' (field strength), 'harmony' (field uniformity), 'rhythm' (field variations). The 'current distributions' are like the 'musical instruments'—each 'conductor shape' produces a different 'magnetic tone'. 'Practical constraints' are like the 'orchestra limitations'—available 'instruments' (materials), 'musician skill' (current capacity), 'concert hall size' (space constraints). 'Optimization' is like 'orchestration'—assigning different 'instruments' to play different 'parts' to create the desired 'overall sound' (field pattern) while working within 'practical limitations'. Good 'magnetic composers' create designs that are both 'theoretically beautiful' and 'practically performable'.",
          "image": {
            "url": "images/advanced-magnetic-applications.png",
            "alt": "Advanced magnetic applications",
            "caption": "Principles for magnetic system synthesis and real-world applications"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Particle Spectrometer Design",
          "problem": "Design a magnetic spectrometer to measure momenta of charged particles from 100 MeV/c to 1 GeV/c with 1% resolution. The magnet should fit within a 2 m length and use readily available materials. Specify the magnetic field requirements and coil design.",
          "step_by_step": [
            {
              "step": "Particle bending relationship",
              "explanation": "In magnetic field, radius of curvature r = p/(qB). For momentum measurement, need precise r measurement"
            },
            {
              "step": "Determine required magnetic field",
              "explanation": "For 1 GeV/c protons (q=1.6×10⁻¹⁹ C), with r=1 m (half available length): B = p/(qr) = (1×10⁹×1.6×10⁻¹⁹)/(1.6×10⁻¹⁹×1) = 1 T"
            },
            {
              "step": "Check lower momentum limit",
              "explanation": "For 100 MeV/c protons in 1 T field: r = 0.1 m, still measurable"
            },
            {
              "step": "Resolution requirement",
              "explanation": "1% momentum resolution requires Δr/r ≈ 1%. With 2 m total path, need position measurement accuracy ~2 cm"
            },
            {
              "step": "Coil design considerations",
              "explanation": "1 T field requires substantial current. Use copper conductors with water cooling. Typical laboratory magnet: B=1 T over 0.5 m gap requires ~1000 A-turns"
            },
            {
              "step": "Practical implementation",
              "explanation": "Use C-shaped magnet with pole pieces to concentrate field. Water-cooled copper coils with several hundred turns carrying few amperes"
            }
          ],
          "final_answer": "Design: 1 T uniform magnetic field over 0.5 m gap, C-shaped magnet with water-cooled coils. Measures particle momenta from 100 MeV/c to 1 GeV/c with 1% resolution using 2 m path length.",
          "concept_applied": "Magnetic spectrometer design with performance specifications",
          "image": {
            "url": "images/spectrometer-design.png",
            "alt": "Spectrometer design",
            "caption": "Particle spectrometer design with magnetic field requirements"
          }
        },
        {
          "title": "Magnetic Shielding Analysis",
          "problem": "A sensitive experiment requires magnetic field <1 μT in a 0.2 m diameter region. The ambient field is 50 μT. Design a cylindrical magnetic shield using mu-metal (relative permeability μ_r=20,000) to achieve this attenuation.",
          "step_by_step": [
            {
              "step": "Shielding factor requirement",
              "explanation": "Need attenuation from 50 μT to <1 μT, so shielding factor >50"
            },
            {
              "step": "Cylindrical shield formula",
              "explanation": "For long cylindrical shield: shielding factor S ≈ (μ_rt)/(2R) where t is thickness, R is radius"
            },
            {
              "step": "Solve for thickness",
              "explanation": "S > 50, μ_r=20,000, R=0.1 m. t > (2RS)/μ_r = (2×0.1×50)/20000 = 10/20000 = 0.0005 m = 0.5 mm"
            },
            {
              "step": "Check practical considerations",
              "explanation": "0.5 mm mu-metal is commercially available. Multiple layers or thicker material would provide better shielding"
            },
            {
              "step": "End effects consideration",
              "explanation": "For finite length cylinder, need length >> diameter for formula to be accurate. Recommend length > 0.5 m"
            },
            {
              "step": "Final design",
              "explanation": "Cylindrical mu-metal shield: diameter 0.2 m, length 0.5 m, thickness 1 mm (provides S≈100 for safety margin)"
            }
          ],
          "final_answer": "Design: Mu-metal cylinder 0.2 m diameter × 0.5 m long × 1 mm thick. Provides >100× attenuation, reducing 50 μT ambient field to <0.5 μT inside.",
          "concept_applied": "Magnetic shielding design with material constraints",
          "image": {
            "url": "images/magnetic-shielding.png",
            "alt": "Magnetic shielding",
            "caption": "Magnetic shield design using high-permeability materials"
          }
        },
        {
          "title": "Current Sheet Field Optimization",
          "problem": "Design a current sheet arrangement to produce a uniform magnetic field of 10 mT over a 0.3 m × 0.3 m region using available 2 mm diameter copper wire carrying maximum 5 A. Minimize the power consumption.",
          "step_by_step": [
            {
              "step": "Current sheet field relationship",
              "explanation": "For infinite current sheet: B = μ₀K/2 where K is current per unit width"
            },
            {
              "step": "Required current density",
              "explanation": "B=0.01 T → K = 2B/μ₀ = 0.02/(4π×10⁻⁷) = 15915 A/m"
            },
            {
              "step": "Wire spacing calculation",
              "explanation": "Each wire carries 5 A, so spacing d = I/K = 5/15915 = 3.14×10⁻⁴ m = 0.314 mm"
            },
            {
              "step": "Check physical feasibility",
              "explanation": "Wire diameter 2 mm, spacing 0.314 mm - impossible as wires would touch. Need different approach."
            },
            {
              "step": "Alternative: Helmholtz-like configuration",
              "explanation": "Use two parallel current sheets separated by distance. For 0.3 m region, use separation ~0.3 m. Calculate required turns"
            },
            {
              "step": "Optimized design",
              "explanation": "Two arrays of 30 turns each (0.3 m/0.01 m spacing), separation 0.3 m, current 5 A produces B ≈ 12.6 mT with reasonable power"
            }
          ],
          "final_answer": "Design: Two arrays of 30 turns each, wire spacing 1 cm, arrays separated by 30 cm, current 5 A. Produces ~12.6 mT field over 30 cm region with manageable power consumption.",
          "concept_applied": "Magnetic field optimization with practical constraints",
          "image": {
            "url": "images/current-sheet-optimization.png",
            "alt": "Current sheet optimization",
            "caption": "Current sheet design optimization with wire constraints"
          }
        },
        {
          "title": "Worst-Case Tolerance Analysis",
          "problem": "A precision magnet requires field uniformity of ±0.1% over a 10 cm region. The coils are wound with positional tolerance ±0.5 mm. Analyze if this tolerance is acceptable and determine the maximum allowable tolerance.",
          "step_by_step": [
            {
              "step": "Field sensitivity to position",
              "explanation": "For Helmholtz coils, field varies approximately as B ∝ 1/r for off-axis points. Sensitivity dB/B ≈ -dr/r"
            },
            {
              "step": "Calculate field variation from tolerance",
              "explanation": "With r=5 cm (radius), dr=0.5 mm, dB/B = 0.5/50 = 1% variation - too large for 0.1% requirement"
            },
            {
              "step": "Solve for required tolerance",
              "explanation": "For dB/B < 0.001, need dr/r < 0.001 → dr < 0.001×50 = 0.05 mm"
            },
            {
              "step": "Interpret result",
              "explanation": "Position tolerance must be <0.05 mm to achieve 0.1% field uniformity - very challenging mechanically"
            },
            {
              "step": "Alternative approaches",
              "explanation": "Use larger radius to reduce sensitivity, or active compensation, or shimming techniques"
            }
          ],
          "final_answer": "Current tolerance ±0.5 mm gives ~1% field variation, unacceptable for 0.1% requirement. Need tolerance <0.05 mm or alternative approaches like larger radius or active compensation.",
          "concept_applied": "Worst-case tolerance analysis for precision magnets",
          "image": {
            "url": "images/tolerance-analysis-magnetic.png",
            "alt": "Tolerance analysis magnetic",
            "caption": "Tolerance analysis for precision magnetic field systems"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Magnetic field synthesis",
    "Multiple method verification",
    "Magnetic system design",
    "Field optimization",
    "Superposition principle",
    "Magnetic shielding",
    "Tolerance analysis",
    "Performance specification",
    "Helmholtz coils",
    "Current density optimization",
    "Worst-case analysis",
    "Real-world constraints"
  ],

  "common_misconceptions": [
    "Thinking all magnetic problems can be solved with a single standard method",
    "Believing theoretical magnetic solutions always work in practice",
    "Assuming manufacturing tolerances don't affect magnetic field accuracy",
    "Thinking magnetic materials have infinite permeability",
    "Believing optimization has a single correct answer",
    "Assuming all design requirements can be simultaneously maximized",
    "Thinking verification is unnecessary for experienced designers"
  ],

  "real_world_applications": [
    "MRI magnet design and optimization",
    "Particle accelerator magnet systems",
    "Magnetic separation equipment",
    "Navigation and compass systems",
    "Magnetic resonance equipment",
    "Electric motor and generator design",
    "Magnetic levitation transport",
    "Scientific research magnets",
    "Magnetic recording systems",
    "Current measurement standards",
    "Geophysical exploration equipment",
    "Industrial magnetic processing"
  ],

  "summary": "This unit has culminated the study of magnetic fields with advanced problems that require synthesis of concepts from across magnetic field theory. Through complex configuration analysis, magnetic system design techniques, consideration of real-world constraints, and multi-objective optimization, students have developed the sophisticated problem-solving skills needed for professional magnetic system design and analysis. The emphasis on verification methods, practical constraints, and systematic approaches provides a comprehensive foundation for tackling real-world magnetic challenges across diverse scientific and engineering applications."
}
