{
  "expanded_description": "Why do countries trade? What determines which goods a country produces domestically and which it imports? The answer lies in comparative advantage—the principle that countries should specialize in producing goods where they have a lower opportunity cost and trade for goods where they have a higher opportunity cost. First introduced by David Ricardo in the early 19th century, comparative advantage remains the foundational concept of international trade theory. It explains how trade can benefit all countries, even if one country is more efficient at producing everything. By specializing according to comparative advantage and trading, countries can consume beyond their production possibilities frontiers, increasing global output and welfare. In this section, we'll revisit comparative advantage, exploring how to determine it, how it differs from absolute advantage, how to calculate gains from trade, and the assumptions underlying the model.",
  
  "core_concept": {
    "principle": "Comparative advantage is the ability of a country to produce a good at a lower opportunity cost than another country. It is the foundation of international trade theory. A country has an absolute advantage if it can produce more of a good with the same resources (or the same amount with fewer resources) than another country. Absolute advantage is about productivity; comparative advantage is about opportunity cost. Even if one country has an absolute advantage in producing all goods, both countries can still gain from trade if they specialize according to their comparative advantage. The principle of comparative advantage states that countries should specialize in producing the goods for which they have the lowest opportunity cost and trade for other goods. This specialization and trade allows both countries to consume beyond their production possibilities frontiers (PPFs). The gains from trade arise because resources are allocated to their most efficient uses globally. To determine comparative advantage, one calculates the opportunity cost of producing each good in each country. The country with the lower opportunity cost for a good has the comparative advantage in that good. The terms of trade—the rate at which countries exchange goods—must lie between the two countries' opportunity costs for both parties to gain. For example, if Country A can produce 1 car or 2 computers with the same resources, its opportunity cost of 1 car is 2 computers. If Country B can produce 1 car or 3 computers, its opportunity cost of 1 car is 3 computers. Country A has a comparative advantage in cars (lower opportunity cost), and Country B has a comparative advantage in computers. If they trade at a rate of 1 car for 2.5 computers, both gain. The gains from trade can be shown graphically using PPFs: trade allows each country to consume outside its PPF. The assumptions of the simple comparative advantage model include: two countries and two goods, perfect competition, no transportation costs, no trade barriers, constant returns to scale, and factors of production that are mobile domestically but immobile internationally. Despite these simplifications, the principle of comparative advantage remains robust and explains much of world trade patterns.",
    
    "explanation": "Imagine two people: a skilled surgeon who is also a fast typist, and a secretary who is a slow typist but has no medical skills. The surgeon has an absolute advantage in both surgery and typing—they can do both better. But should the surgeon do their own typing? No, because the opportunity cost of the surgeon's time is high—every hour spent typing is an hour not spent performing surgery, which is far more valuable. The secretary has a comparative advantage in typing because their opportunity cost is lower. So the surgeon specializes in surgery, the secretary in typing, and they trade (the surgeon pays the secretary). Both are better off. This is comparative advantage—specialize in what you're relatively best at, even if you're absolutely best at everything.",
    
    "image": {
      "src": "images/unit10/comparative_advantage_overview.png",
      "alt": "Production possibilities frontiers for two countries showing specialization and gains from trade",
      "caption": "Figure 10.1.1: Comparative advantage allows countries to consume beyond their production possibilities frontiers through specialization and trade."
    }
  },

  "sections": [
    {
      "section_title": "10.1 Comparative Advantage Revisited",
      "introduction": "International trade is a fundamental feature of the global economy. Countries export goods they produce well and import goods they produce less efficiently. But what determines these patterns? The answer, first articulated by David Ricardo in 1817, is comparative advantage. In this section, we'll revisit this essential concept, exploring how to identify comparative advantage, how it differs from absolute advantage, how to calculate gains from trade, and the assumptions that underlie the model. Understanding comparative advantage is essential for analyzing trade patterns, trade policy, and the effects of globalization.",
      
      "introduction_image": {
        "src": "images/unit10/comparative_advantage_intro.png",
        "alt": "World map with trade flows between countries",
        "caption": "Figure 10.1.2: Comparative advantage explains patterns of international trade—why countries export certain goods and import others."
      },
      
      "key_concept": {
        "definition": "Comparative advantage is the ability of a country to produce a good at a lower opportunity cost than another country. It is the basis for mutually beneficial trade. A country has an absolute advantage if it can produce more of a good with the same resources (or the same amount with fewer resources) than another country. Absolute advantage is about productivity; comparative advantage is about opportunity cost. Even if one country has an absolute advantage in all goods, both countries can gain from trade if they specialize according to their comparative advantage. To determine comparative advantage, calculate the opportunity cost of producing each good in each country. The opportunity cost of producing one unit of a good is the amount of the other good that must be given up. For example, if with the same resources Country A can produce 10 cars or 5 computers, the opportunity cost of 1 car is 0.5 computers, and the opportunity cost of 1 computer is 2 cars. If Country B can produce 8 cars or 4 computers with the same resources, the opportunity cost of 1 car is 0.5 computers as well—same opportunity cost, so no comparative advantage. If Country B can produce 6 cars or 4 computers, the opportunity cost of 1 car is 4/6 = 0.67 computers, and 1 computer is 6/4 = 1.5 cars. Then Country A has a comparative advantage in cars (lower opportunity cost: 0.5 < 0.67), and Country B has a comparative advantage in computers (lower opportunity cost: 1.5 < 2). The terms of trade—the rate at which countries exchange goods—must lie between the two countries' opportunity costs for both to gain. If they trade 1 car for 0.6 computers, Country A gains (it gets 0.6 computers for a car that costs 0.5 computers domestically), but Country B loses (it gives up 0.6 computers to get a car that costs 0.67 computers domestically—worse than producing its own). The terms of trade must be between 0.5 and 0.67 cars per computer (or between 1.5 and 2 computers per car). Gains from trade can be shown graphically using production possibilities frontiers (PPFs). Without trade, a country consumes on its PPF. With specialization and trade, it can consume outside its PPF—a point unattainable without trade. The gains come from reallocating resources to their most efficient uses globally. The simple model assumes: two countries and two goods, perfect competition, no transportation costs, no trade barriers, constant returns to scale, and factors of production mobile domestically but immobile internationally. Despite these simplifications, the principle of comparative advantage remains a powerful explanation of trade patterns.",
        
        "context": "David Ricardo developed the theory of comparative advantage in his 1817 book \"On the Principles of Political Economy and Taxation.\" He used the example of England and Portugal trading cloth and wine to show how both countries could benefit even if Portugal was more efficient at producing both. The theory has been refined over two centuries but remains the cornerstone of international trade economics. It explains why countries trade, why trade is beneficial, and why protectionism is generally harmful. In AP Macroeconomics, comparative advantage is essential for understanding trade patterns and the effects of trade policy.",
        
        "image": {
          "src": "images/unit10/opportunity_cost_calc.png",
          "alt": "Table showing output per worker and opportunity cost calculations for two countries",
          "caption": "Figure 10.1.3: Comparative advantage is determined by comparing opportunity costs. The country with the lower opportunity cost has the comparative advantage."
        }
      },

      "classifications": [
        {
          "type": "Absolute Advantage",
          "value": "Ability to produce more with same resources",
          "characteristics": ["Based on productivity", "More output per unit of input", "Can have absolute advantage in all goods", "Not necessary for gains from trade", "About efficiency, not opportunity cost"],
          "behavior": "Absolute advantage is determined by comparing productivity. If Country A can produce 10 cars with the same resources that Country B uses to produce 8 cars, Country A has an absolute advantage in cars. If Country A can also produce 5 computers while Country B produces 4, Country A has an absolute advantage in both goods. Absolute advantage alone does not determine trade patterns—it's possible for one country to have absolute advantage in everything and still gain from trade. What matters for trade is comparative advantage. Absolute advantage affects standards of living (more productive countries are richer) but not the direction of trade. Trade is driven by differences in opportunity costs, not absolute productivity levels.",
          
          "image": {
            "src": "images/unit10/absolute_advantage.png",
            "alt": "Comparison of output per worker showing absolute advantage",
            "caption": "Figure 10.1.4: Absolute advantage means producing more with the same resources. Country A has absolute advantage in both goods here."
          },
          
          "examples": [
            {
              "process": "U.S. vs Bangladesh",
              "explanation": "The U.S. has absolute advantage in most goods due to higher productivity. Yet the U.S. trades with Bangladesh because comparative advantage differs—Bangladesh has lower opportunity cost in labor-intensive goods like textiles."
            },
            {
              "process": "Ricardo's example",
              "explanation": "Portugal had absolute advantage in both wine and cloth in Ricardo's example, but England had comparative advantage in cloth. Trade still benefited both."
            }
          ]
        },
        {
          "type": "Comparative Advantage",
          "value": "Ability to produce at lower opportunity cost",
          "characteristics": ["Based on opportunity cost", "Determines trade patterns", "Always exists unless opportunity costs equal", "Both countries gain from trade", "About relative efficiency"],
          "behavior": "Comparative advantage is determined by comparing opportunity costs. The country with the lower opportunity cost for a good has the comparative advantage in that good. Comparative advantage always exists unless opportunity costs are equal in both countries (unlikely). When countries specialize according to their comparative advantage and trade, total world output increases, and both countries can consume more than they could without trade. The gains from trade come from this reallocation of resources to their most efficient uses. Comparative advantage can arise from differences in technology, factor endowments (capital, labor, land), climate, or other factors. It explains why countries export certain goods and import others. The principle holds even if one country is less efficient in everything—that country still has a comparative advantage in the goods where its disadvantage is smallest.",
          
          "image": {
            "src": "images/unit10/comparative_advantage_detail.png",
            "alt": "PPF graphs showing specialization and gains from trade",
            "caption": "Figure 10.1.5: Comparative advantage determines trade patterns. Specialization and trade allow both countries to consume beyond their PPFs."
          },
          
          "examples": [
            {
              "process": "U.S. and China",
              "explanation": "The U.S. has comparative advantage in capital-intensive goods (aircraft, software) and services. China has comparative advantage in labor-intensive goods (textiles, electronics assembly). Trade benefits both."
            },
            {
              "process": "Saudi Arabia and Japan",
              "explanation": "Saudi Arabia has comparative advantage in oil (low opportunity cost due to abundant reserves). Japan has comparative advantage in manufactured goods. They trade oil for cars."
            }
          ]
        },
        {
          "type": "Terms of Trade",
          "value": "The rate at which goods are exchanged",
          "characteristics": ["Must lie between opportunity costs", "Determines distribution of gains", "Can be expressed as price ratio", "Affected by supply and demand", "Can change over time"],
          "behavior": "The terms of trade is the rate at which countries exchange goods—for example, 1 car for 2.5 computers. For trade to be mutually beneficial, the terms of trade must lie between the two countries' opportunity costs. If the terms of trade equal a country's opportunity cost, that country neither gains nor loses from trade—it's indifferent. If the terms of trade are outside the range, one country loses. The exact terms of trade are determined by supply and demand in world markets. If Country A's demand for computers is high, the terms of trade will move in Country B's favor (more cars per computer). The terms of trade determine how the gains from trade are distributed between countries. A country's terms of trade improve if the price of its exports rises relative to its imports. This can happen if demand for its exports increases or if its productivity grows faster than trading partners. Changes in terms of trade affect real income—improving terms of trade mean a country can buy more imports with the same exports.",
          
          "image": {
            "src": "images/unit10/terms_of_trade.png",
            "alt": "Diagram showing acceptable range for terms of trade between two countries' opportunity costs",
            "caption": "Figure 10.1.6: The terms of trade must lie between the two countries' opportunity costs for both to gain from trade."
          },
          
          "examples": [
            {
              "process": "Oil exporters",
              "explanation": "When oil prices rise, oil-exporting countries' terms of trade improve—they can buy more manufactured goods with each barrel of oil."
            },
            {
              "process": "U.S.-Mexico trade",
              "explanation": "The terms of trade between the U.S. and Mexico are determined by supply and demand for goods like cars, electronics, agricultural products, and services."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Trade Is Based on Comparative Advantage, Not Absolute Advantage",
          "statement": "The key insight of Ricardo's theory is that what matters for trade is not absolute productivity but comparative advantage—relative opportunity costs. Even if a country is less efficient at producing everything, it still has a comparative advantage in the goods where its disadvantage is smallest. By specializing in those goods and trading, it can obtain other goods at a lower opportunity cost than if it produced them domestically. This means that all countries can gain from trade, regardless of their level of development. The theory explains why low-income countries can compete in global markets—they have comparative advantage in labor-intensive goods despite lower absolute productivity. It also explains why high-income countries don't lose from trade with low-income countries—they gain by importing goods that would be expensive to produce at home.",
          "application": "When analyzing trade between countries, don't compare absolute productivity. Compare opportunity costs. A country may be less efficient in everything but still gain from trade by specializing where its disadvantage is smallest. This is why trade benefits all participants.",
          "example": "Bangladesh is less productive than the U.S. in most goods. But Bangladesh has comparative advantage in textiles because its opportunity cost (in terms of other goods forgone) is lower than in the U.S. The U.S. gains by importing textiles and exporting high-tech goods. Both benefit.",
          
          "image": {
            "src": "images/unit10/comparative_not_absolute.png",
            "alt": "Graph showing how a less productive country can still gain from trade",
            "caption": "Figure 10.1.7: Trade is based on comparative advantage, not absolute advantage. Even less productive countries gain from trade."
          }
        },
        {
          "principle": "Specialization According to Comparative Advantage Increases World Output",
          "statement": "When countries specialize in producing goods where they have comparative advantage and trade, total world output increases. Resources are allocated to their most efficient uses globally. This can be shown by comparing total production before and after specialization. Without trade, each country produces both goods, possibly inefficiently. With specialization, each country produces only the good where it has comparative advantage. The combined output of both goods increases. This increase in world output is the source of gains from trade. The gains are then distributed between countries through the terms of trade. The principle holds under the assumptions of the model and explains why trade is economically beneficial, even if it creates distributional effects within countries.",
          "application": "When evaluating the benefits of trade, consider the increase in total output. Specialization allows each country to focus on what it does relatively best, increasing global efficiency. This is why economists generally support free trade.",
          "example": "Suppose the U.S. can produce 100 cars or 200 computers with its resources, and Mexico can produce 50 cars or 100 computers. The U.S. has absolute advantage in both, but comparative advantage? U.S. opportunity cost of 1 car is 2 computers; Mexico's is also 2 computers—same, so no gains from trade. Change the numbers: U.S. 100 cars or 200 computers; Mexico 40 cars or 100 computers. U.S. opp cost car = 2 computers; Mexico opp cost car = 100/40 = 2.5 computers. U.S. has comparative advantage in cars. Mexico opp cost computer = 40/100 = 0.4 cars; U.S. opp cost computer = 100/200 = 0.5 cars. Mexico has comparative advantage in computers. Specialize: U.S. produces 100 cars, Mexico 100 computers. Total: 100 cars, 100 computers. Without trade, if each split resources, they might produce less. Trade allows both to consume more.",
          
          "image": {
            "src": "images/unit10/world_output.png",
            "alt": "Table showing production before and after specialization, with total output increasing",
            "caption": "Figure 10.1.8: Specialization according to comparative advantage increases total world output."
          }
        },
        {
          "principle": "The Terms of Trade Determine How Gains Are Distributed",
          "statement": "While specialization increases total output, the distribution of gains between countries depends on the terms of trade—the rate at which goods are exchanged. If the terms of trade are closer to Country A's opportunity cost, Country B gets most of the gains. If closer to Country B's opportunity cost, Country A gets most. The exact terms of trade are determined by supply and demand in world markets. Countries with more market power (large economies, monopolies) can influence terms of trade in their favor. Changes in terms of trade affect real income—improving terms of trade mean a country can buy more imports with the same exports. This is why countries care about export prices and import prices. The terms of trade also affect the distribution of gains within countries, as some industries expand and others contract with trade.",
          "application": "When analyzing trade between countries, consider not just whether trade occurs but also the terms of trade. A country may benefit more or less depending on the prices it receives for exports and pays for imports. This affects real income and welfare.",
          "example": "If oil prices rise, oil-exporting countries' terms of trade improve—they gain more from trade. If a country's export prices fall relative to import prices (worsening terms of trade), it loses some of the gains from trade, even if trade continues.",
          
          "image": {
            "src": "images/unit10/gains_distribution.png",
            "alt": "Graph showing how terms of trade between opportunity costs determine distribution of gains",
            "caption": "Figure 10.1.9: The terms of trade determine how the gains from trade are distributed between countries."
          }
        },
        {
          "principle": "Comparative Advantage Can Change Over Time",
          "statement": "Comparative advantage is not static. It can change as countries develop, accumulate capital, adopt new technologies, and acquire skills. A country may have comparative advantage in agriculture today but in manufactured goods tomorrow. This is called dynamic comparative advantage. It explains the changing patterns of trade as countries develop—for example, the shift of manufacturing from developed to developing countries and then to even lower-cost locations. It also explains why trade patterns evolve over time. Government policies can influence dynamic comparative advantage through investments in education, infrastructure, and technology, or through protectionist policies that nurture infant industries. However, such policies are controversial and can be costly if they protect inefficient industries.",
          "application": "When analyzing long-term trade patterns, consider how comparative advantage can shift. A country's trade profile today may not be its trade profile in 20 years. Development, investment, and policy can change comparative advantage.",
          "example": "South Korea in the 1960s had comparative advantage in labor-intensive goods like textiles. Through investment in education and capital, it developed comparative advantage in electronics, automobiles, and shipbuilding. Its trade patterns shifted dramatically.",
          
          "image": {
            "src": "images/unit10/dynamic_comparative_advantage.png",
            "alt": "Timeline showing changing comparative advantage as country develops",
            "caption": "Figure 10.1.10: Comparative advantage can change over time with development, investment, and technological change."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Opportunity Cost and Comparative Advantage",
          
          "image": {
            "src": "images/unit10/opportunity_cost_example.png",
            "alt": "Table with production data for two countries",
            "caption": "Figure 10.1.11: Use the production data to calculate opportunity costs and determine comparative advantage."
          },
          
          "problem": "Two countries, Alpha and Beta, produce two goods: wheat and cloth. With one unit of resources, Alpha can produce 10 bushels of wheat or 5 yards of cloth. Beta can produce 8 bushels of wheat or 4 yards of cloth. a) Does either country have an absolute advantage? b) Calculate the opportunity cost of producing wheat in each country. c) Calculate the opportunity cost of producing cloth in each country. d) Which country has comparative advantage in wheat? In cloth? e) What are the acceptable terms of trade for both countries to gain?",
          
          "step_by_step": [
            {
              "step": "Check absolute advantage",
              "explanation": "Alpha can produce more wheat (10 > 8) and more cloth (5 > 4) with the same resources. Alpha has absolute advantage in both goods."
            },
            {
              "step": "Opportunity cost of wheat in Alpha",
              "explanation": "To produce 1 bushel of wheat, Alpha must give up 5/10 = 0.5 yards of cloth. Opportunity cost of wheat = 0.5 cloth."
            },
            {
              "step": "Opportunity cost of wheat in Beta",
              "explanation": "Beta: 1 wheat costs 4/8 = 0.5 yards of cloth. Same as Alpha."
            },
            {
              "step": "Opportunity cost of cloth in Alpha",
              "explanation": "1 cloth costs 10/5 = 2 bushels of wheat."
            },
            {
              "step": "Opportunity cost of cloth in Beta",
              "explanation": "1 cloth costs 8/4 = 2 bushels of wheat. Same as Alpha."
            },
            {
              "step": "Comparative advantage",
              "explanation": "Opportunity costs are equal in both countries. There is no comparative advantage. Trade would not be beneficial because there are no gains from specialization."
            }
          ],
          
          "final_answer": "a) Alpha has absolute advantage in both. b) Both: 0.5 cloth. c) Both: 2 wheat. d) No comparative advantage. e) No mutually beneficial terms exist.",
          "concept_applied": "Comparative advantage requires differences in opportunity costs. If opportunity costs are equal, there is no basis for mutually beneficial trade."
        },
        {
          "title": "Determining Gains from Trade",
          
          "image": {
            "src": "images/unit10/gains_from_trade_example.png",
            "alt": "Production possibilities table for two countries",
            "caption": "Figure 10.1.12: Calculate gains from trade given production data and terms of trade."
          },
          
          "problem": "Country X can produce 100 cars or 200 computers with its resources. Country Y can produce 50 cars or 150 computers. a) Calculate opportunity costs and determine comparative advantage. b) If the countries specialize according to comparative advantage, what will each produce? c) If they trade at a rate of 1 car for 2.5 computers, show that both gain. d) What is the range of acceptable terms of trade? e) If the terms of trade were 1 car for 2 computers, who would gain and who would lose?",
          
          "step_by_step": [
            {
              "step": "Calculate opportunity costs",
              "explanation": "Country X: 1 car costs 200/100 = 2 computers; 1 computer costs 100/200 = 0.5 cars. Country Y: 1 car costs 150/50 = 3 computers; 1 computer costs 50/150 = 0.33 cars."
            },
            {
              "step": "Determine comparative advantage",
              "explanation": "X has lower opportunity cost in cars (2 < 3) → comparative advantage in cars. Y has lower opportunity cost in computers (0.33 < 0.5) → comparative advantage in computers."
            },
            {
              "step": "Specialization",
              "explanation": "X produces only cars: 100 cars. Y produces only computers: 150 computers."
            },
            {
              "step": "Trade at 1 car = 2.5 computers",
              "explanation": "Suppose X exports 40 cars to Y for 40 × 2.5 = 100 computers. X ends with: 60 cars (kept) + 100 computers. Without trade, X could have at most (if split resources) some combination. Compare: Without trade, if X produced 60 cars, it could produce at most 80 computers (since 60 cars use 60% of resources, leaving 40% for 80 computers). With trade, X has 60 cars and 100 computers—better off. Y: gets 40 cars, keeps 150 - 100 = 50 computers. Without trade, if Y wanted 40 cars, it would have to give up 40 × 3 = 120 computers, leaving only 30 computers. With trade, Y has 40 cars and 50 computers—better off. Both gain."
            },
            {
              "step": "Acceptable range",
              "explanation": "Terms of trade must be between X's opportunity cost (1 car = 2 computers) and Y's opportunity cost (1 car = 3 computers). So 2 < cars per computer? Actually, computers per car: between 2 and 3 computers per car."
            },
            {
              "step": "Terms of trade 1 car = 2 computers",
              "explanation": "This equals X's opportunity cost. X neither gains nor loses (indifferent). Y gains because it gets cars cheaper (2 computers vs its own cost of 3 computers). All gains go to Y."
            }
          ],
          
          "final_answer": "a) X: cars, Y: computers. b) X: 100 cars, Y: 150 computers. c) Both gain. d) 2 to 3 computers per car. e) X indifferent, Y gains.",
          "concept_applied": "Gains from trade depend on specialization and terms of trade within the opportunity cost range."
        },
        {
          "title": "PPF and Consumption with Trade",
          
          "image": {
            "src": "images/unit10/ppf_trade_example.png",
            "alt": "Production possibilities frontier graph",
            "caption": "Figure 10.1.13: Show consumption possibilities with trade on a PPF graph."
          },
          
          "problem": "Country A can produce 100 units of food or 50 units of clothing. Country B can produce 60 units of food or 40 units of clothing. a) Draw the PPFs for both countries (assume constant opportunity cost). b) Determine comparative advantage. c) Show the consumption possibilities frontier with trade if the terms of trade are 1 food for 0.6 clothing. d) Show that both countries can consume outside their PPFs. e) What does this illustrate about gains from trade?",
          
          "step_by_step": [
            {
              "step": "Draw PPFs",
              "explanation": "Country A: intercepts at 100 food, 50 clothing. Slope = -2 (1 clothing costs 2 food). Country B: intercepts at 60 food, 40 clothing. Slope = -1.5 (1 clothing costs 1.5 food)."
            },
            {
              "step": "Comparative advantage",
              "explanation": "Opportunity cost of food: A: 50/100 = 0.5 clothing; B: 40/60 = 0.67 clothing. A lower → A has comparative advantage in food. Opportunity cost of clothing: A: 100/50 = 2 food; B: 60/40 = 1.5 food. B lower → B has comparative advantage in clothing."
            },
            {
              "step": "Consumption with trade",
              "explanation": "Specialize: A produces 100 food, B produces 40 clothing. Trade at 1 food = 0.6 clothing means 1 clothing = 1/0.6 = 1.67 food. Suppose A exports 30 food to B for 30 × 0.6 = 18 clothing. A ends with: 70 food, 18 clothing. B ends with: 30 food, 40 - 18 = 22 clothing."
            },
            {
              "step": "Compare to PPF",
              "explanation": "For A: Without trade, to get 18 clothing, A would have to give up 36 food (since 1 clothing costs 2 food), leaving 64 food. With trade, A has 70 food and 18 clothing—better. Point (70,18) is outside A's PPF. For B: Without trade, to get 30 food, B would have to give up 20 clothing (since 1 food costs 1/1.5 = 0.67 clothing), leaving 20 clothing. With trade, B has 30 food and 22 clothing—better. Point (30,22) is outside B's PPF."
            },
            {
              "step": "Illustration",
              "explanation": "This shows that trade allows countries to consume beyond their production possibilities frontiers—they can have more of both goods than they could produce domestically. This is the fundamental gain from trade."
            }
          ],
          
          "final_answer": "a) PPFs drawn. b) A: food, B: clothing. c) A: 70 food, 18 clothing; B: 30 food, 22 clothing. d) Both points outside PPFs. e) Trade expands consumption possibilities.",
          "concept_applied": "Trade allows consumption beyond the PPF, demonstrating gains from specialization and exchange."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Calculate Opportunity Costs",
          "description": "For each country and each good, determine the opportunity cost of production.",
          "mechanism": "Opportunity cost of good X = maximum production of good Y / maximum production of good X. This shows how much of Y must be given up to produce one unit of X.",
          "result": "Opportunity costs calculated for each good in each country.",
          
          "image": {
            "src": "images/unit10/ca_step1.png",
            "alt": "Table showing production possibilities and opportunity cost calculation",
            "caption": "Figure 10.1.14: Step 1 - Calculate opportunity costs for each good in each country."
          }
        },
        {
          "step": 2,
          "process": "Identify Comparative Advantage",
          "description": "Compare opportunity costs across countries to determine who has the lower cost for each good.",
          "mechanism": "The country with the lower opportunity cost for a good has the comparative advantage in that good. Each country will have comparative advantage in one good (unless costs are equal).",
          "result": "Comparative advantage identified.",
          
          "image": {
            "src": "images/unit10/ca_step2.png",
            "alt": "Arrows pointing to country with lower opportunity cost for each good",
            "caption": "Figure 10.1.15: Step 2 - Identify comparative advantage by comparing opportunity costs."
          }
        },
        {
          "step": 3,
          "process": "Determine Terms of Trade Range",
          "description": "Find the range of exchange rates that will benefit both countries.",
          "mechanism": "The terms of trade must lie between the two countries' opportunity costs. If trading good X for good Y, the terms of trade (units of Y per X) must be between the two countries' opportunity costs of X.",
          "result": "Acceptable terms of trade range established.",
          
          "image": {
            "src": "images/unit10/ca_step3.png",
            "alt": "Number line showing opportunity costs and acceptable terms of trade range",
            "caption": "Figure 10.1.16: Step 3 - Determine the range of mutually beneficial terms of trade."
          }
        },
        {
          "step": 4,
          "process": "Specialize Production",
          "description": "Each country produces only the good in which it has comparative advantage.",
          "mechanism": "Resources are reallocated to the comparative advantage good. Total production of both goods increases compared to autarky (no trade).",
          "result": "Specialized production achieved.",
          
          "image": {
            "src": "images/unit10/ca_step4.png",
            "alt": "PPF showing movement to specialized production point",
            "caption": "Figure 10.1.17: Step 4 - Each country specializes in its comparative advantage good."
          }
        },
        {
          "step": 5,
          "process": "Trade and Consume Beyond PPF",
          "description": "Countries trade at agreed terms, allowing each to consume a combination of goods beyond their production possibilities.",
          "mechanism": "Exports are exchanged for imports. The final consumption point lies outside each country's PPF, showing gains from trade.",
          "result": "Consumption beyond PPF achieved.",
          
          "image": {
            "src": "images/unit10/ca_step5.png",
            "alt": "PPF showing consumption point outside the frontier after trade",
            "caption": "Figure 10.1.18: Step 5 - Trade allows consumption beyond the production possibilities frontier."
          }
        }
      ],

      "image": {
        "src": "images/unit10/comparative_advantage_summary.png",
        "alt": "Comprehensive summary diagram of comparative advantage: opportunity cost calculation, comparative advantage identification, terms of trade, and gains from trade",
        "caption": "Figure 10.1.19: Comparative advantage summary - determining advantage, terms of trade, and gains from specialization and exchange."
      }
    }
  ],

  "key_terms": [
    "Comparative advantage",
    "Absolute advantage",
    "Opportunity cost",
    "Production possibilities frontier (PPF)",
    "Terms of trade",
    "Specialization",
    "Gains from trade",
    "Mutually beneficial trade",
    "Autarky",
    "Trade pattern",
    "Export",
    "Import",
    "World output",
    "Consumption possibilities",
    "Production possibilities",
    "Constant opportunity cost",
    "Increasing opportunity cost",
    "Factor endowments",
    "Labor productivity",
    "Technology differences",
    "Ricardian model",
    "Heckscher-Ohlin model",
    "Dynamic comparative advantage",
    "Infant industry",
    "Learning by doing",
    "Economies of scale",
    "Intra-industry trade",
    "Inter-industry trade",
    "Trade creation",
    "Trade diversion",
    "Welfare gains",
    "Distributional effects",
    "Winners and losers from trade",
    "Compensation principle",
    "Free trade",
    "Protectionism",
    "Trade barrier"
  ],

  "summary": "Comparative advantage is the ability of a country to produce a good at a lower opportunity cost than another country. It is the foundation of international trade theory and explains why countries trade and how they gain from trade. A country has an absolute advantage if it can produce more of a good with the same resources (or the same amount with fewer resources) than another country. Absolute advantage is about productivity; comparative advantage is about opportunity cost. Even if one country has an absolute advantage in all goods, both countries can gain from trade if they specialize according to their comparative advantage. To determine comparative advantage, calculate the opportunity cost of producing each good in each country. The country with the lower opportunity cost for a good has the comparative advantage in that good. For trade to be mutually beneficial, the terms of trade—the rate at which goods are exchanged—must lie between the two countries' opportunity costs. If the terms of trade are within this range, both countries can consume beyond their production possibilities frontiers (PPFs), demonstrating gains from trade. Specialization according to comparative advantage increases total world output. The gains from trade are distributed between countries based on the terms of trade, which are determined by supply and demand in world markets. Comparative advantage can change over time as countries develop, accumulate capital, adopt new technologies, and acquire skills—this is dynamic comparative advantage. The simple model assumes two countries and two goods, perfect competition, no transportation costs, no trade barriers, constant returns to scale, and factors of production that are mobile domestically but immobile internationally. Despite these simplifications, the principle of comparative advantage remains robust and explains much of world trade patterns. Understanding comparative advantage is essential for analyzing trade policy, globalization, and the effects of trade on economic welfare."
}
