{
  "expanded_description": "What happens when countries erect barriers to trade? Who gains and who loses? How do tariffs, quotas, and other protectionist measures affect consumers, producers, government revenue, and overall economic welfare? The effects of trade barriers are complex and often counterintuitive. While they protect certain domestic industries, they impose costs on consumers, reduce efficiency, and can trigger retaliation that harms exporters. Understanding these effects is essential for evaluating trade policy debates and for making informed judgments about the costs and benefits of protectionism. In this section, we'll explore the economic impacts of trade barriers—on prices, quantities, welfare, income distribution, and the broader economy—using supply and demand analysis, and consider both the partial equilibrium effects and the general equilibrium consequences.",
  
  "core_concept": {
    "principle": "Trade barriers—tariffs, quotas, and non-tariff measures—have systematic economic effects that can be analyzed using supply and demand frameworks. In a partial equilibrium analysis of a single market, a tariff raises the domestic price of the imported good, reducing quantity demanded and increasing domestic production. Consumer surplus falls, producer surplus rises, and the government gains tariff revenue. The net effect on the importing country is a deadweight loss—the losses to consumers exceed the gains to producers and government. The deadweight loss consists of a consumption distortion (consumers buy less than they would at the world price) and a production distortion (domestic resources are used to produce goods that could be produced more cheaply abroad). The size of the deadweight loss depends on the price elasticities of demand and supply. A quota has similar effects but with two differences: it generates no government revenue (unless import licenses are auctioned), and the difference between domestic and world price (quota rent) accrues to whoever holds the import licenses. If licenses are given to foreign exporters, the quota rent goes abroad, making the quota even more costly for the importing country. Trade barriers also have broader effects: they increase prices for downstream industries that use the protected good as an input, reducing their competitiveness; they may lead to retaliation by trading partners, harming export industries; they reduce consumer choice and variety; they can lead to rent-seeking as industries lobby for protection; and they may have long-term effects on productivity and innovation by sheltering domestic firms from competition. The distributional effects are significant: consumers and industries that use imported inputs lose; import-competing producers gain; and the overall economy experiences a net loss. In a large country (one that can affect world prices), a tariff can improve the terms of trade (lower the price of imports), potentially offsetting some of the deadweight loss. The optimal tariff for a large country might be positive, but it invites retaliation and is not generally recommended. Most economists conclude that the costs of trade barriers exceed their benefits, and that free trade is the preferred policy, with adjustment assistance for displaced workers rather than protection for industries.",
    
    "explanation": "Think of a tariff as a tax on consumers. It raises the price of imported goods, so consumers pay more and buy less. Some of that extra spending goes to domestic producers (who now get higher prices) and some goes to the government (tariff revenue). But consumers lose more than producers and government gain—that's the deadweight loss. It's like taking a dollar from consumers, giving 60 cents to producers and the government, and throwing 40 cents away. A quota is similar, but instead of the government getting the 40 cents, it might go to foreign exporters, making the loss even larger. These losses don't just disappear—they represent resources that are wasted because the economy isn't using its resources efficiently.",
    
    "image": {
      "src": "images/unit10/trade_barrier_effects_overview.png",
      "alt": "Supply and demand diagram showing consumer loss, producer gain, tariff revenue, and deadweight loss from a tariff",
      "caption": "Figure 10.5.1: Trade barriers create winners and losers. The net effect is a deadweight loss—the losses to consumers exceed gains to producers and government."
    }
  },

  "sections": [
    {
      "section_title": "10.5 Effects of Trade Barriers",
      "introduction": "Trade barriers are policies that restrict international trade. They are often justified as protecting domestic industries, jobs, or national security. But they also have costs—higher prices for consumers, inefficiency, and retaliation from trading partners. In this section, we'll analyze the economic effects of trade barriers using supply and demand analysis. We'll examine who gains and who loses from tariffs and quotas, calculate the welfare effects, consider the impact on large countries, and explore the broader consequences for the economy. Understanding these effects is essential for evaluating trade policy debates and for making informed judgments about protectionism.",
      
      "introduction_image": {
        "src": "images/unit10/effects_intro.png",
        "alt": "Graph showing price increase and quantity changes from trade barrier",
        "caption": "Figure 10.5.2: Trade barriers raise domestic prices, reduce imports, and create winners and losers."
      },
      
      "key_concept": {
        "definition": "Trade barriers—tariffs, quotas, and non-tariff measures—have systematic effects on prices, quantities, and economic welfare. Using partial equilibrium analysis (analyzing a single market), we can trace these effects. Consider a small country that imports a good. The world price is $P_w$, and the country is a price taker. Under free trade, domestic consumers buy $Q_d$ at price $P_w$, domestic producers supply $Q_s$, and imports are $Q_d - Q_s$. When the government imposes a tariff of $t$ per unit, the domestic price rises to $P_w + t$. The effects are: (1) Domestic production rises from $Q_s$ to $Q_s'$ as domestic producers respond to the higher price. (2) Domestic consumption falls from $Q_d$ to $Q_d'$ as consumers reduce purchases. (3) Imports fall from $Q_d - Q_s$ to $Q_d' - Q_s'$. (4) Consumer surplus falls by the area representing higher prices and reduced consumption. (5) Producer surplus rises by the area representing higher prices and increased production. (6) Government gains tariff revenue equal to $t$ times the new quantity of imports. The net effect on the country is a deadweight loss—the loss in consumer surplus exceeds the gain in producer surplus plus tariff revenue. This deadweight loss has two components: the consumption distortion (consumers buy less than they would at the world price) and the production distortion (domestic resources are used to produce goods that could be produced more cheaply abroad). A quota has similar effects, but instead of tariff revenue, the difference between domestic and world price (the quota rent) goes to whoever holds the import licenses. If licenses are given to foreign exporters, the rent goes abroad, making the quota more costly. Trade barriers also have broader effects: they raise input costs for downstream industries, reducing their competitiveness; they may trigger retaliation, harming exporters; they reduce consumer choice and variety; they encourage rent-seeking; and they may reduce long-run productivity growth by sheltering domestic firms from competition. For a large country (one that can affect world prices), a tariff can improve the terms of trade—lowering the price of imports—which may offset some deadweight loss. The optimal tariff for a large country might be positive, but it invites retaliation and is not generally recommended. Most economists conclude that the costs of trade barriers exceed their benefits, and that free trade is the preferred policy, with adjustment assistance for displaced workers rather than protection for industries.",
        
        "context": "The analysis of trade barriers dates to Adam Smith and David Ricardo, who showed the gains from free trade. The partial equilibrium welfare analysis was developed by Alfred Marshall and later economists. The distinction between small and large countries matters for policy, as large countries can potentially gain from optimal tariffs, though retaliation risks make this risky. The WTO framework is based on the insight that unilateral protectionism is generally harmful and that a rules-based system benefits all. In AP Macroeconomics, understanding the effects of trade barriers is essential for analyzing trade policy debates and for evaluating the costs of protectionism.",
        
        "image": {
          "src": "images/unit10/tariff_welfare_analysis.png",
          "alt": "Supply and demand diagram with labeled areas for consumer loss, producer gain, tariff revenue, and deadweight loss",
          "caption": "Figure 10.5.3: Welfare effects of a tariff: consumer loss (a+b+c+d), producer gain (a), tariff revenue (c), deadweight loss (b+d)."
        }
      },

      "classifications": [
        {
          "type": "Partial Equilibrium Effects of a Tariff",
          "value": "Effects in a single market",
          "characteristics": ["Price increases", "Domestic production rises", "Domestic consumption falls", "Imports fall", "Net welfare loss (deadweight loss)"],
          "behavior": "In a single market, a tariff raises the domestic price above the world price. Domestic producers gain because they can sell more at a higher price. Domestic consumers lose because they pay more and buy less. The government gains tariff revenue. The net effect is a deadweight loss—the loss to consumers exceeds the combined gain to producers and government. This deadweight loss consists of a production distortion (domestic resources are inefficiently used to produce goods that could be produced more cheaply abroad) and a consumption distortion (consumers are forced to buy less than they would at the world price). The size of the deadweight loss depends on the price elasticities of demand and supply—more elastic curves mean larger deadweight loss for a given tariff. The analysis assumes the country is small (cannot affect world price). If the country is large, the tariff may lower the world price, creating a terms-of-trade gain that partially offsets the deadweight loss.",
          
          "image": {
            "src": "images/unit10/tariff_partial_equilibrium.png",
            "alt": "Supply and demand graph with tariff effects labeled",
            "caption": "Figure 10.5.4: Partial equilibrium effects of a tariff: price up, domestic production up, consumption down, imports down, deadweight loss."
          },
          
          "examples": [
            {
              "process": "U.S. steel tariff",
              "explanation": "When the U.S. imposed tariffs on steel, domestic steel prices rose. U.S. steel producers gained; steel-using industries (autos, construction) faced higher costs and lost; consumers paid more for steel-containing products. The net effect was a deadweight loss."
            },
            {
              "process": "Agricultural tariffs",
              "explanation": "Many countries protect agriculture with tariffs. Domestic farmers gain; consumers pay higher food prices; government gains revenue. Net deadweight loss."
            }
          ]
        },
        {
          "type": "Partial Equilibrium Effects of a Quota",
          "value": "Effects in a single market",
          "characteristics": ["Price increases", "Domestic production rises", "Domestic consumption falls", "Imports limited to quota", "Quota rent instead of tariff revenue"],
          "behavior": "A quota limits the quantity of imports to a specified level, say Q_q. This restricts supply, raising the domestic price above the world price. The effects on consumers and domestic producers are similar to a tariff: consumer surplus falls, producer surplus rises. However, instead of tariff revenue, the difference between the domestic price and the world price (the quota rent) accrues to whoever holds the import licenses. If the government auctions the licenses, it can capture the rent, making the quota equivalent to a tariff. If licenses are given to domestic importers, they capture the rent. If licenses are given to foreign exporters (as in voluntary export restraints), the rent goes abroad, making the quota more costly for the importing country. The deadweight loss from a quota is similar to that from a tariff, but if the rent goes abroad, the net loss is larger (consumer loss minus producer gain minus rent lost abroad). Quotas also create additional inefficiencies: they eliminate the price mechanism for allocating imports, potentially leading to arbitrary distribution of licenses and rent-seeking behavior.",
          
          "image": {
            "src": "images/unit10/quota_partial_equilibrium.png",
            "alt": "Supply and demand graph with quota effects labeled, showing quota rent",
            "caption": "Figure 10.5.5: Quota effects: price up, domestic production up, consumption down, imports limited. Quota rent instead of tariff revenue."
          },
          
          "examples": [
            {
              "process": "U.S. sugar quota",
              "explanation": "The U.S. restricts sugar imports with quotas, keeping domestic sugar prices about double the world price. Quota rents go to foreign producers and domestic importers. Consumers lose billions annually."
            },
            {
              "process": "VERs on Japanese cars",
              "explanation": "In the 1980s, Japan agreed to voluntary export restraints on cars to the U.S. This quota-like restriction raised car prices in the U.S., and Japanese exporters captured the quota rents."
            }
          ]
        },
        {
          "type": "General Equilibrium and Dynamic Effects",
          "value": "Broader economic consequences",
          "characteristics": ["Input-output effects", "Retaliation", "Reduced variety", "Rent-seeking", "Reduced productivity growth"],
          "behavior": "Beyond the partial equilibrium effects in a single market, trade barriers have broader consequences. (1) Input-output effects: Protected goods are often inputs for other industries. Steel tariffs raise costs for auto, construction, and machinery industries, reducing their competitiveness and harming their workers and consumers. (2) Retaliation: Trading partners may respond with their own barriers, harming export industries. A tariff on steel may lead to tariffs on U.S. agricultural exports, harming farmers. (3) Reduced variety: Trade barriers reduce consumer choice by limiting the range of available products. (4) Rent-seeking: Industries may devote resources to lobbying for protection rather than productive activities, wasting resources. (5) Reduced productivity growth: Protection shelters domestic firms from foreign competition, reducing incentives to innovate, improve efficiency, and cut costs. Over time, this can slow productivity growth and reduce living standards. (6) Political economy effects: Protection can become entrenched as industries lobby to maintain barriers, making reform difficult. These dynamic effects can be as important as the static welfare losses from tariffs and quotas.",
          
          "image": {
            "src": "images/unit10/general_equilibrium_effects.png",
            "alt": "Diagram showing ripple effects of trade barriers through the economy",
            "caption": "Figure 10.5.6: Trade barriers have broader effects: higher input costs, retaliation, reduced variety, rent-seeking, and slower productivity growth."
          },
          
          "examples": [
            {
              "process": "Steel tariffs and manufacturing",
              "explanation": "U.S. steel tariffs raised costs for manufacturers that use steel, making them less competitive against foreign rivals. Some manufacturing jobs were lost even as steel jobs were protected."
            },
            {
              "process": "U.S.-China trade war",
              "explanation": "The trade war led to tariffs on hundreds of billions of goods, harming both countries' exporters and consumers, creating uncertainty that reduced investment."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Tariffs Create Net Welfare Losses for the Importing Country",
          "statement": "The fundamental result of tariff analysis is that a tariff imposes a net loss on the importing country (assuming the country is small and cannot affect world prices). The loss to consumers exceeds the gain to domestic producers plus government tariff revenue. This net loss—the deadweight loss—represents resources that are wasted because the economy is not using its resources efficiently. The consumption distortion arises because consumers buy less of the good than they would at the world price, reducing their satisfaction. The production distortion arises because domestic resources are diverted to producing a good that could be produced more cheaply abroad. Both distortions represent a loss of real income. The magnitude of the deadweight loss depends on the price elasticities of demand and supply. More elastic curves mean larger deadweight loss. This analysis is the foundation of the economic case for free trade.",
          "application": "When evaluating a proposed tariff, calculate the deadweight loss. It represents the cost to the economy. Compare this to any claimed benefits (job preservation, national security) to assess whether the tariff is justified. In most cases, the costs exceed the benefits.",
          "example": "A study of U.S. steel tariffs found that the cost to consumers and downstream industries far exceeded the gains to steel producers and tariff revenue. The net loss was billions of dollars annually, or over $\\$200{,}000$ per steel job saved.",
          
          "image": {
            "src": "images/unit10/tariff_net_loss.png",
            "alt": "Graph highlighting deadweight loss triangles from tariff",
            "caption": "Figure 10.5.7: Tariffs create net welfare losses—the deadweight loss from consumption and production distortions."
          }
        },
        {
          "principle": "Quotas Can Be More Harmful Than Tariffs",
          "statement": "While tariffs and quotas both raise domestic prices and create deadweight loss, quotas can be more harmful for two reasons. First, tariffs generate government revenue, which can be used for public purposes or to reduce other taxes. Quotas generate quota rents, which may go to foreigners or to import license holders, not to the government. If the rents go to foreigners, the loss to the importing country is larger than with an equivalent tariff. Second, quotas eliminate the price mechanism for allocating imports, leading to arbitrary distribution and potential inefficiencies. They also create incentives for rent-seeking as firms compete for licenses. If the government auctions import licenses, the quota becomes equivalent to a tariff (the auction revenue equals tariff revenue). But in practice, licenses are often given away, creating windfall gains for license holders. Voluntary export restraints (VERs), where exporting countries agree to limit exports, are particularly harmful because the quota rents automatically go to foreign exporters.",
          "application": "When comparing trade barriers, recognize that quotas are generally worse than tariffs. If protection is to be used, tariffs are preferable because they at least generate government revenue and are more transparent. VERs are the worst form of protection.",
          "example": "The Multifiber Arrangement used quotas to restrict textile and clothing trade. The quotas created quota rents that went largely to exporting countries. Estimates suggested that the quotas cost consumers billions while providing little benefit to domestic producers, as the rents leaked abroad.",
          
          "image": {
            "src": "images/unit10/quota_vs_tariff.png",
            "alt": "Comparison of tariff and quota welfare effects, showing quota rent going abroad",
            "caption": "Figure 10.5.8: Quotas can be more harmful than tariffs because quota rents may go to foreigners, increasing the net loss."
          }
        },
        {
          "principle": "Large Countries Can Affect Their Terms of Trade with Tariffs",
          "statement": "The analysis so far assumed a small country that cannot affect world prices. For a large country (one that accounts for a significant share of world demand), a tariff can lower the world price of the imported good. This terms-of-trade gain—paying less for imports—partially offsets the deadweight loss. In principle, there is an optimal tariff for a large country that maximizes national welfare by balancing the terms-of-trade gain against the deadweight loss. However, this optimal tariff is positive but generally small, and it invites retaliation from trading partners. If other countries retaliate with their own tariffs, everyone may lose. Moreover, the terms-of-trade argument assumes that other countries do not retaliate, which is unrealistic in practice. For these reasons, even large countries generally pursue free trade, recognizing that unilateral tariffs risk trade wars that harm everyone.",
          "application": "When analyzing a tariff by a large country (like the U.S. or China), consider the terms-of-trade effect. The tariff may lower world prices, benefiting the imposing country at the expense of foreign exporters. But this is a beggar-thy-neighbor policy that risks retaliation.",
          "example": "The U.S. is a large importer of many goods. When it imposed tariffs on Chinese goods, some of the tariff burden fell on Chinese exporters, who lowered their prices to maintain market share. This terms-of-trade gain partially offset U.S. losses, but China retaliated, harming U.S. exporters.",
          
          "image": {
            "src": "images/unit10/large_country_tariff.png",
            "alt": "Supply and demand diagram showing terms-of-trade effect for large country",
            "caption": "Figure 10.5.9: A large country's tariff can lower world prices, creating a terms-of-trade gain that partially offsets deadweight loss."
          }
        },
        {
          "principle": "Trade Barriers Have Dynamic Effects That Compound Static Losses",
          "statement": "The static welfare analysis of tariffs and quotas captures the immediate effects on consumer and producer surplus. But trade barriers also have dynamic effects that can be even more important over time. By sheltering domestic firms from foreign competition, protection reduces the incentive to innovate, improve efficiency, and cut costs. Protected industries may become complacent, falling behind global productivity leaders. This reduces long-run growth and living standards. Protection also leads to misallocation of resources—capital and labor are drawn into protected industries rather than into industries where the country has comparative advantage. This reduces overall productivity. Additionally, protection encourages rent-seeking—firms spend resources lobbying for protection rather than on productive activities. These dynamic effects compound the static deadweight loss, making protection even more costly in the long run. This is why economists emphasize the importance of competition and open markets for productivity growth.",
          "application": "When evaluating the long-term effects of trade barriers, consider the dynamic costs. Protection may save jobs in the short run, but over time it reduces productivity and growth, ultimately costing more jobs and lower living standards. This is why trade liberalization is associated with faster growth.",
          "example": "India's highly protected economy before 1991 had slow growth and inefficiency. After liberalizing trade and reducing protection, growth accelerated, and productivity improved. Protected industries had fallen behind global standards; competition forced improvement.",
          
          "image": {
            "src": "images/unit10/dynamic_effects.png",
            "alt": "Graph showing productivity gap between protected and exposed industries over time",
            "caption": "Figure 10.5.10: Trade barriers have dynamic effects—reduced competition leads to slower productivity growth and innovation."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Welfare Effects of a Tariff",
          
          "image": {
            "src": "images/unit10/tariff_welfare_calc.png",
            "alt": "Supply and demand graph with numerical values",
            "caption": "Figure 10.5.11: Calculate the welfare effects of a tariff using supply and demand data."
          },
          
          "problem": "A small country imports a good. The world price is $\\$10$. Domestic demand and supply are given by: Demand: $Q_d = 200 - 5P$; Supply: $Q_s = 20 + 3P$. Under free trade: a) Find domestic consumption, domestic production, and imports. b) The government imposes a $\\$2$ tariff. Find the new domestic price, consumption, production, and imports. c) Calculate the change in consumer surplus. d) Calculate the change in producer surplus. e) Calculate the tariff revenue. f) Calculate the deadweight loss.",
          
          "step_by_step": [
            {
              "step": "Free trade equilibrium",
              "explanation": "At P = $\\$10$: Qd = 200 - 5(10) = 200 - 50 = 150. Qs = 20 + 3(10) = 20 + 30 = 50. Imports = 150 - 50 = 100."
            },
            {
              "step": "After tariff",
              "explanation": "Tariff raises domestic price to $\\$12$. Qd = 200 - 5(12) = 200 - 60 = 140. Qs = 20 + 3(12) = 20 + 36 = 56. Imports = 140 - 56 = 84."
            },
            {
              "step": "Consumer surplus change",
              "explanation": "Consumer surplus loss = area of trapezoid: rectangle $2 \\times 140 = 280$ + triangle $0.5 \\times 2 \\times (150-140) = 0.5 \\times 2 \\times 10 = 10$ = $290$."
            },
            {
              "step": "Producer surplus change",
              "explanation": "Producer surplus gain = rectangle $2 \\times 50 = 100$ + triangle $0.5 \\times 2 \\times (56-50) = 0.5 \\times 2 \\times 6 = 6$ = $106$."
            },
            {
              "step": "Tariff revenue",
              "explanation": "Tariff revenue = tariff × new imports = $2 \\times 84 = 168$."
            },
            {
              "step": "Deadweight loss",
              "explanation": "Deadweight loss = consumer loss - producer gain - tariff revenue = $290 - 106 - 168 = 16$. Alternatively, DWL = consumption distortion triangle + production distortion triangle = $0.5 \\times 2 \\times 10 + 0.5 \\times 2 \\times 6 = 10 + 6 = 16$."
            }
          ],
          
          "final_answer": "a) Qd=150, Qs=50, imports=100. b) P=$\\$12$, Qd=140, Qs=56, imports=84. c) Consumer loss = $\\$290$. d) Producer gain = $\\$106$. e) Tariff revenue = $\\$168$. f) Deadweight loss = $\\$16$.",
          "concept_applied": "Tariff welfare analysis quantifies the gains and losses. The net loss is the deadweight loss."
        },
        {
          "title": "Comparing Tariff and Quota",
          
          "image": {
            "src": "images/unit10/tariff_quota_compare.png",
            "alt": "Graphs comparing tariff and quota",
            "caption": "Figure 10.5.12: Compare the welfare effects of a tariff and an equivalent quota."
          },
          
          "problem": "Using the same demand and supply curves as in the previous example ($Q_d = 200 - 5P$, $Q_s = 20 + 3P$, world price $\\$10$), suppose the government imposes a quota of 84 units (the same quantity as imports under the $\\$2$ tariff). a) What will be the domestic price under the quota? b) Calculate the quota rent. c) If import licenses are given to domestic importers, what is the net welfare effect on the country? d) If import licenses are given to foreign exporters, what is the net welfare effect? e) Compare with the tariff result.",
          
          "step_by_step": [
            {
              "step": "Find domestic price under quota",
              "explanation": "With quota of 84, domestic supply plus imports = domestic demand. So Qs + 84 = Qd. Qs = 20 + 3P, Qd = 200 - 5P. So 20 + 3P + 84 = 200 - 5P → 104 + 3P = 200 - 5P → 8P = 96 → P = $\\$12$. Same price as with tariff."
            },
            {
              "step": "Calculate quota rent",
              "explanation": "Quota rent = (domestic price - world price) × quota quantity = ($\\$12 - \\$10$) × 84 = $2 \\times 84 = 168$."
            },
            {
              "step": "Licenses to domestic importers",
              "explanation": "Consumer loss same as tariff: $290$. Producer gain same: $106$. No tariff revenue. Quota rent of $168$ goes to domestic importers. Net welfare effect = consumer loss - producer gain - quota rent (to domestic) = $290 - 106 - 168 = 16$ deadweight loss. Same as tariff, but distribution differs: government gets nothing, importers get the rent."
            },
            {
              "step": "Licenses to foreign exporters",
              "explanation": "Consumer loss $290$, producer gain $106$, quota rent $168$ goes abroad. Net welfare effect = $290 - 106 - 0 = 184$ loss. This is much larger than tariff's $16$ loss."
            },
            {
              "step": "Comparison",
              "explanation": "Tariff: net loss $16$, government gets $168$. Quota with domestic licenses: net loss $16$, importers get $168$. Quota with foreign licenses: net loss $184$, foreigners get $168$. The quota with foreign licenses is far worse for the importing country."
            }
          ],
          
          "final_answer": "a) $\\$12$. b) $\\$168$. c) Net loss $\\$16$ (same as tariff). d) Net loss $\\$184$. e) Tariff better than quota with foreign licenses; equivalent to quota with domestic licenses.",
          "concept_applied": "Quotas can be equivalent to tariffs if rents stay home, but worse if rents go abroad."
        },
        {
          "title": "Large Country Tariff Analysis",
          
          "image": {
            "src": "images/unit10/large_country_example.png",
            "alt": "Supply and demand diagram for large country",
            "caption": "Figure 10.5.13: Analyze a tariff by a large country with terms-of-trade effects."
          },
          
          "problem": "A large country imports a good. Under free trade, the world price is $\\$10$, and the country imports 200 units. The country imposes a $\\$2$ tariff. Because it is large, the tariff reduces world demand, and the world price falls to $\\$9.50$. The domestic price rises to $\\$11.50$ ($\\$9.50 + \\$2$). Domestic consumption falls from 250 to 230, domestic production rises from 50 to 70, and imports fall from 200 to 160. a) Calculate the change in consumer surplus. b) Calculate the change in producer surplus. c) Calculate the tariff revenue. d) Calculate the terms-of-trade gain. e) Calculate the net welfare effect. f) Compare with a small country case.",
          
          "step_by_step": [
            {
              "step": "Consumer surplus change",
              "explanation": "Consumer loss = rectangle $1.50 \\times 230 = 345$ + triangle $0.5 \\times 1.50 \\times (250-230) = 0.5 \\times 1.50 \\times 20 = 15$ = $360$."
            },
            {
              "step": "Producer surplus change",
              "explanation": "Producer gain = rectangle $1.50 \\times 50 = 75$ + triangle $0.5 \\times 1.50 \\times (70-50) = 0.5 \\times 1.50 \\times 20 = 15$ = $90$."
            },
            {
              "step": "Tariff revenue",
              "explanation": "Tariff revenue = tariff × new imports = $2 \\times 160 = 320$."
            },
            {
              "step": "Terms-of-trade gain",
              "explanation": "The tariff lowered the world price by $0.50$ per unit. The country now pays $\\$0.50$ less on each of its 160 imports. Terms-of-trade gain = $0.50 \\times 160 = 80$. (This is already included in tariff revenue calculation? Actually tariff revenue is $2 \\times 160 = 320$, of which $1.50 \\times 160 = 240$ is paid by domestic consumers and $0.50 \\times 160 = 80$ is paid by foreign exporters. So the $80$ is the terms-of-trade gain captured by the tariff.)"
            },
            {
              "step": "Net welfare effect",
              "explanation": "Net effect = consumer loss - producer gain - tariff revenue? Wait, tariff revenue is a gain to government. Net = - consumer loss + producer gain + tariff revenue = -360 + 90 + 320 = 50. So the country gains $50$ from the tariff! This is possible because the terms-of-trade gain ($80$) offsets the deadweight loss ($30$). Deadweight loss = consumption distortion triangle ($15$) + production distortion triangle ($15$) = $30$. Net gain = terms-of-trade gain - deadweight loss = $80 - 30 = 50$."
            },
            {
              "step": "Compare to small country",
              "explanation": "A small country would face same world price and have deadweight loss $30$ with no terms-of-trade gain, so net loss $30$. The large country gains because it can shift some of the tariff burden onto foreigners."
            }
          ],
          
          "final_answer": "a) Consumer loss $\\$360$. b) Producer gain $\\$90$. c) Tariff revenue $\\$320$. d) Terms-of-trade gain $\\$80$. e) Net gain $\\$50$. f) Small country would lose $\\$30$.",
          "concept_applied": "Large countries can gain from tariffs through terms-of-trade effects, but this invites retaliation and is a beggar-thy-neighbor policy."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Free Trade Equilibrium Established",
          "description": "Under free trade, domestic price equals world price. Domestic consumption, production, and imports are determined.",
          "mechanism": "At world price P_w, domestic consumers buy Q_d, domestic producers supply Q_s, imports = Q_d - Q_s.",
          "result": "Free trade equilibrium.",
          
          "image": {
            "src": "images/unit10/effect_step1.png",
            "alt": "Supply and demand graph showing free trade equilibrium",
            "caption": "Figure 10.5.14: Step 1 - Free trade equilibrium at world price."
          }
        },
        {
          "step": 2,
          "process": "Trade Barrier Imposed",
          "description": "Government imposes a tariff or quota, raising the domestic price above the world price.",
          "mechanism": "Tariff adds t to price; quota limits quantity, raising price to clear market.",
          "result": "Domestic price rises to P_t.",
          
          "image": {
            "src": "images/unit10/effect_step2.png",
            "alt": "Supply and demand graph showing price increase from tariff",
            "caption": "Figure 10.5.15: Step 2 - Tariff or quota raises domestic price."
          }
        },
        {
          "step": 3,
          "process": "Quantity Adjustments Occur",
          "description": "Higher price reduces consumption and increases domestic production.",
          "mechanism": "Consumers move up demand curve; producers move up supply curve. Imports fall.",
          "result": "New quantities: Q_d' (lower), Q_s' (higher), imports = Q_d' - Q_s'.",
          
          "image": {
            "src": "images/unit10/effect_step3.png",
            "alt": "Supply and demand graph showing new consumption and production points",
            "caption": "Figure 10.5.16: Step 3 - Higher price reduces consumption and increases domestic production."
          }
        },
        {
          "step": 4,
          "process": "Welfare Effects Materialize",
          "description": "Consumer surplus falls, producer surplus rises, government gains tariff revenue (or quota rents appear).",
          "mechanism": "Areas on graph represent gains and losses. Net deadweight loss emerges.",
          "result": "Distributional and net welfare effects.",
          
          "image": {
            "src": "images/unit10/effect_step4.png",
            "alt": "Supply and demand graph with welfare areas labeled",
            "caption": "Figure 10.5.17: Step 4 - Consumer loss, producer gain, tariff revenue, and deadweight loss."
          }
        },
        {
          "step": 5,
          "process": "Broader Consequences Unfold",
          "description": "Input costs rise, retaliation may occur, dynamic effects begin.",
          "mechanism": "Downstream industries face higher costs; trading partners may retaliate; protected industries face less competition, reducing innovation over time.",
          "result": "General equilibrium and dynamic effects.",
          
          "image": {
            "src": "images/unit10/effect_step5.png",
            "alt": "Diagram showing ripple effects through economy and retaliation",
            "caption": "Figure 10.5.18: Step 5 - Broader effects include higher input costs, retaliation, and reduced productivity growth."
          }
        }
      ],

      "image": {
        "src": "images/unit10/trade_barrier_effects_summary.png",
        "alt": "Comprehensive summary diagram of trade barrier effects: partial equilibrium, large country, general equilibrium, dynamic",
        "caption": "Figure 10.5.19: Effects of trade barriers summary - welfare analysis, large country effects, and broader consequences."
      }
    }
  ],

  "key_terms": [
    "Trade barrier effects",
    "Tariff effects",
    "Quota effects",
    "Non-tariff barrier effects",
    "Partial equilibrium analysis",
    "General equilibrium effects",
    "Consumer surplus",
    "Producer surplus",
    "Tariff revenue",
    "Quota rent",
    "Deadweight loss",
    "Consumption distortion",
    "Production distortion",
    "Welfare loss",
    "Net national loss",
    "Terms of trade",
    "Terms-of-trade gain",
    "Optimal tariff",
    "Large country",
    "Small country",
    "Price taker",
    "World price",
    "Domestic price",
    "Import demand",
    "Export supply",
    "Retaliation",
    "Trade war",
    "Beggar-thy-neighbor",
    "Input-output effects",
    "Downstream industries",
    "Upstream industries",
    "Value chain",
    "Supply chain",
    "Competitiveness",
    "Rent-seeking",
    "Lobbying",
    "Protection for sale",
    "Political economy of trade",
    "Dynamic effects",
    "Productivity growth",
    "Innovation",
    "Competition",
    "Market power",
    "Economies of scale",
    "Infant industry",
    "Learning by doing",
    "X-inefficiency",
    "Misallocation of resources",
    "Comparative advantage erosion",
    "Trade adjustment assistance",
    "Compensation principle",
    "Winners and losers",
    "Distributional effects",
    "Income distribution"
  ],

  "summary": "Trade barriers—tariffs, quotas, and non-tariff measures—have systematic economic effects. Using partial equilibrium analysis, a tariff raises the domestic price above the world price, reducing consumption and increasing domestic production. Consumer surplus falls, producer surplus rises, and the government gains tariff revenue. The net effect is a deadweight loss—the loss to consumers exceeds the combined gain to producers and government. This deadweight loss consists of a consumption distortion (consumers buy less than they would at the world price) and a production distortion (domestic resources are used inefficiently to produce goods that could be produced more cheaply abroad). A quota has similar effects but generates quota rents instead of tariff revenue. If import licenses are given to foreign exporters, the rent goes abroad, making the quota more harmful than an equivalent tariff. For a large country that can affect world prices, a tariff may lower the world price, creating a terms-of-trade gain that partially offsets the deadweight loss. In principle, a large country could gain from an optimal tariff, but this invites retaliation and is a beggar-thy-neighbor policy. Beyond these partial equilibrium effects, trade barriers have broader consequences: they raise input costs for downstream industries, reducing their competitiveness; they may trigger retaliation, harming export industries; they reduce consumer choice and variety; they encourage rent-seeking as industries lobby for protection; and they reduce long-run productivity growth by sheltering domestic firms from foreign competition. These dynamic effects compound the static deadweight loss, making protection even more costly over time. The distributional effects are significant: consumers and industries that use imported inputs lose; import-competing producers gain; and the overall economy experiences a net loss. Most economists conclude that the costs of trade barriers exceed their benefits, and that free trade is the preferred policy, with adjustment assistance for displaced workers rather than protection for industries. Understanding these effects is essential for evaluating trade policy debates and for making informed judgments about the costs and benefits of protectionism."
}
