{
  "expanded_description": "What does it mean when we say the dollar is 'strong' or 'weak'? Why do currencies rise and fall in value? Currency appreciation and depreciation are central to understanding international economics. When a currency appreciates, it gains value relative to other currencies; when it depreciates, it loses value. These movements affect everything from the price of imported goods to the competitiveness of exports, from inflation to interest rates. Understanding what causes appreciation and depreciation, and what their effects are, is essential for analyzing exchange rate dynamics, trade balances, and the transmission of monetary policy in open economies.",
  
  "core_concept": {
    "principle": "Appreciation and depreciation refer to changes in the value of one currency relative to another. Appreciation means the currency has become more valuable—it can buy more of another currency. Depreciation means it has become less valuable—it buys less of another currency. These changes are determined by shifts in supply and demand in the foreign exchange market. A currency appreciates when demand for it increases (demand curve shifts right) or supply decreases (supply curve shifts left). It depreciates when demand decreases or supply increases. The main factors causing appreciation and depreciation are: (1) Relative interest rates: Higher interest rates attract foreign capital, increasing demand for the currency, causing appreciation. Lower interest rates have the opposite effect. (2) Relative inflation rates: Higher inflation makes a country's goods more expensive, reducing export demand (decreasing demand for its currency) and increasing import demand (increasing supply of its currency), causing depreciation. Lower inflation causes appreciation. (3) Relative income growth: Faster income growth increases imports, increasing supply of the currency, causing depreciation (all else equal). Slower growth has the opposite effect. (4) Expectations: If investors expect a currency to appreciate, they buy it now, increasing demand and causing appreciation—a self-fulfilling prophecy. (5) Terms of trade: An improvement in the terms of trade (export prices rise relative to import prices) increases demand for the currency, causing appreciation. (6) Productivity: Faster productivity growth makes goods cheaper and more competitive, increasing export demand and causing appreciation. (7) Government intervention: Central banks may buy or sell currencies to influence their value. The effects of appreciation and depreciation on the economy are significant. Appreciation makes imports cheaper (benefiting consumers and firms that use imported inputs) but makes exports more expensive (hurting exporters and reducing net exports). Appreciation also tends to reduce inflationary pressure by lowering import prices. Depreciation has opposite effects: it boosts exports (helping exporters) but makes imports more expensive (hurting consumers and raising inflation). Depreciation can help reduce trade deficits by making exports more competitive and imports more expensive. Both appreciation and depreciation have distributional effects—some sectors gain, others lose. Understanding these effects is essential for analyzing exchange rate policy and the impact of currency movements on the economy.",
    
    "explanation": "Think of a currency like a country's price tag in the global marketplace. When the dollar appreciates, it's like the U.S. becoming more expensive—foreigners need more of their currency to buy dollars, so U.S. goods cost them more. That's good for U.S. consumers (imports are cheaper) but bad for U.S. exporters (their goods are less competitive). When the dollar depreciates, the U.S. becomes cheaper—exports boom, imports cost more. It's like a sale on American goods. The exchange rate is constantly adjusting to balance these forces, like a seesaw moving up and down.",
    
    "image": {
      "src": "images/unit11/app_dep_overview.png",
      "alt": "Diagram showing appreciation (currency stronger, imports cheaper, exports more expensive) and depreciation (currency weaker, exports cheaper, imports more expensive)",
      "caption": "Figure 11.2.1: Appreciation makes a currency stronger, benefiting consumers but hurting exporters. Depreciation has opposite effects."
    }
  },

  "sections": [
    {
      "section_title": "11.2 Appreciation and Depreciation",
      "introduction": "Currency values are constantly changing. The dollar rises against the euro, falls against the yen, strengthens against the pound—these movements are reported daily in financial news. But what do they mean? And why do they matter? In this section, we'll explore currency appreciation and depreciation: what causes them, how they affect the economy, and who gains and loses. Understanding these concepts is essential for analyzing exchange rate dynamics, trade balances, and the transmission of monetary policy in open economies.",
      
      "introduction_image": {
        "src": "images/unit11/app_dep_intro.png",
        "alt": "Graph showing exchange rate fluctuations over time",
        "caption": "Figure 11.2.2: Exchange rates fluctuate constantly. Appreciation and depreciation reflect these changes in currency values."
      },
      
      "key_concept": {
        "definition": "Appreciation and depreciation refer to changes in the value of one currency relative to another. Appreciation means the currency has become more valuable—it can buy more units of a foreign currency. For example, if the USD/EUR rate falls from 1.20 to 1.10, the dollar appreciates because it takes fewer dollars to buy one euro. Depreciation means the currency has become less valuable—it buys fewer units of foreign currency. If the USD/EUR rate rises from 1.20 to 1.30, the dollar depreciates. These changes are determined by shifts in supply and demand in the foreign exchange market. A currency appreciates when demand for it increases (demand curve shifts right) or supply decreases (supply curve shifts left). It depreciates when demand decreases or supply increases. The main factors causing appreciation and depreciation are: (1) Relative interest rates: Higher domestic interest rates attract foreign capital, increasing demand for the domestic currency, causing appreciation. Lower rates have the opposite effect. (2) Relative inflation rates: Higher domestic inflation makes domestic goods more expensive, reducing export demand (decreasing demand for domestic currency) and increasing import demand (increasing supply of domestic currency), causing depreciation. Lower inflation causes appreciation. (3) Relative income growth: Faster domestic income growth increases imports, increasing supply of domestic currency, causing depreciation. (4) Expectations: If investors expect appreciation, they buy now, increasing demand and causing appreciation. (5) Terms of trade: An improvement in the terms of trade (export prices rise relative to import prices) increases demand for domestic currency, causing appreciation. (6) Productivity: Faster productivity growth increases competitiveness, increasing export demand and causing appreciation. (7) Government intervention: Central banks may buy or sell currencies to influence their value. The effects of appreciation and depreciation on the economy are significant. Appreciation: (a) Makes imports cheaper, benefiting consumers and firms using imported inputs. (b) Makes exports more expensive, hurting exporters and reducing net exports. (c) Reduces inflationary pressure by lowering import prices. (d) May worsen the trade balance (if demand is elastic) or improve it (if inelastic—the J-curve effect). (e) Benefits sectors that use imported inputs and consumers; hurts export-oriented sectors. Depreciation: (a) Makes exports cheaper, boosting export industries. (b) Makes imports more expensive, hurting consumers and firms relying on imports. (c) Increases inflationary pressure by raising import prices. (d) May improve the trade balance over time (J-curve). (e) Benefits export sectors; hurts consumers and import-dependent industries.",
        
        "context": "Currency appreciation and depreciation have been central to international economics since the shift to floating exchange rates in the 1970s. Major episodes include the dollar's sharp appreciation in the early 1980s (due to high interest rates) and its depreciation after the Plaza Accord in 1985; the Asian financial crisis of 1997-98 saw sharp depreciations; the dollar's rise in 2022-23 reflected Fed rate hikes. In AP Macroeconomics, understanding appreciation and depreciation is essential for analyzing exchange rate dynamics, trade, and policy.",
        
        "image": {
          "src": "images/unit11/app_dep_factors.png",
          "alt": "Diagram showing factors causing appreciation and depreciation",
          "caption": "Figure 11.2.3: Appreciation and depreciation are caused by shifts in supply and demand from interest rates, inflation, income, expectations, and other factors."
        }
      },

      "classifications": [
        {
          "type": "Causes of Appreciation",
          "value": "Factors that increase currency value",
          "characteristics": ["Higher interest rates", "Lower inflation", "Slower income growth", "Positive expectations", "Improved terms of trade", "Capital inflows"],
          "behavior": "A currency appreciates when demand increases or supply decreases. Key factors: (1) Higher domestic interest rates relative to foreign rates attract foreign capital. Investors need the domestic currency to buy domestic bonds, increasing demand and causing appreciation. (2) Lower domestic inflation makes domestic goods more competitive, increasing export demand (demand for currency) and reducing import demand (supply of currency). (3) Slower domestic income growth reduces imports, decreasing supply of currency. (4) Positive expectations: if investors expect appreciation, they buy now, increasing demand. (5) Improved terms of trade (export prices rise relative to import prices) increases export revenue, increasing demand. (6) Productivity growth increases competitiveness, increasing export demand. (7) Central bank buying of domestic currency (intervention) increases demand. (8) Safe-haven flows during global uncertainty can increase demand for stable currencies. Each of these factors shifts the demand curve right or supply curve left, causing appreciation.",
          
          "image": {
            "src": "images/unit11/appreciation_causes.png",
            "alt": "Supply and demand graph showing right shift in demand or left shift in supply causing appreciation",
            "caption": "Figure 11.2.4: Appreciation occurs when demand increases (right shift) or supply decreases (left shift)."
          },
          
          "examples": [
            {
              "process": "Fed rate hikes 2022-23",
              "explanation": "The Fed raised interest rates sharply, attracting foreign capital and causing the dollar to appreciate significantly against most currencies."
            },
            {
              "process": "Swiss franc safe haven",
              "explanation": "During the 2008 financial crisis and European debt crisis, the Swiss franc appreciated as investors sought a safe haven, increasing demand."
            }
          ]
        },
        {
          "type": "Causes of Depreciation",
          "value": "Factors that decrease currency value",
          "characteristics": ["Lower interest rates", "Higher inflation", "Faster income growth", "Negative expectations", "Worsened terms of trade", "Capital outflows"],
          "behavior": "A currency depreciates when demand decreases or supply increases. Key factors: (1) Lower domestic interest rates relative to foreign rates discourage foreign investment, reducing demand for the currency. Domestic investors may also seek higher returns abroad, increasing supply. (2) Higher domestic inflation makes domestic goods less competitive, reducing export demand (demand for currency) and increasing import demand (supply of currency). (3) Faster domestic income growth increases imports, increasing supply of currency. (4) Negative expectations: if investors expect depreciation, they sell now, increasing supply and reducing demand. (5) Worsened terms of trade (export prices fall relative to import prices) reduces export revenue, decreasing demand. (6) Productivity slowdown reduces competitiveness, decreasing export demand. (7) Central bank selling of domestic currency (intervention) increases supply. (8) Capital flight during crises can sharply increase supply and reduce demand. Each of these factors shifts the demand curve left or supply curve right, causing depreciation.",
          
          "image": {
            "src": "images/unit11/depreciation_causes.png",
            "alt": "Supply and demand graph showing left shift in demand or right shift in supply causing depreciation",
            "caption": "Figure 11.2.5: Depreciation occurs when demand decreases (left shift) or supply increases (right shift)."
          },
          
          "examples": [
            {
              "process": "Asian financial crisis",
              "explanation": "In 1997-98, capital flight from Asian countries led to sharp depreciations as investors sold local currencies and demand collapsed."
            },
            {
              "process": "Brexit vote",
              "explanation": "After the UK voted to leave the EU, the pound depreciated sharply due to negative expectations about the UK economy."
            }
          ]
        },
        {
          "type": "Effects of Appreciation",
          "value": "Economic consequences of a stronger currency",
          "characteristics": ["Cheaper imports", "More expensive exports", "Lower inflation", "Hurts exporters", "Benefits consumers and importers"],
          "behavior": "When a currency appreciates, it has widespread effects on the economy. (1) Imports become cheaper: Foreign goods cost less in domestic currency, benefiting consumers and firms that use imported inputs. This increases consumer purchasing power and can lower costs for businesses. (2) Exports become more expensive: Domestic goods cost more in foreign currency, reducing demand from abroad. Export industries lose competitiveness, which can lead to job losses and reduced profits in export sectors. (3) Net exports (exports minus imports) tend to fall, reducing aggregate demand. (4) Inflation tends to fall because import prices are lower, reducing overall price level pressures. (5) The trade balance may worsen in the short run (if demand is elastic) but could improve if demand is inelastic—the J-curve effect. (6) Domestic firms that compete with imports face increased competition as cheaper imports flood the market. (7) Sectors that use imported inputs benefit from lower costs; export-oriented sectors suffer. The distributional effects are significant: appreciation benefits consumers and import-competing industries that use imported inputs; it hurts exporters and industries that compete with imports.",
          
          "image": {
            "src": "images/unit11/appreciation_effects.png",
            "alt": "Diagram showing winners and losers from appreciation: consumers gain, exporters lose",
            "caption": "Figure 11.2.6: Appreciation benefits consumers and importers but hurts exporters and domestic industries competing with imports."
          },
          
          "examples": [
            {
              "process": "Strong dollar 2022-23",
              "explanation": "The dollar's appreciation made imports cheaper for U.S. consumers, helping to moderate inflation. But U.S. exporters faced headwinds as their goods became more expensive abroad."
            },
            {
              "process": "Japanese yen appreciation 2010-12",
              "explanation": "The strong yen hurt Japanese exporters like Toyota and Sony, reducing their profits and competitiveness, while making imports cheaper for Japanese consumers."
            }
          ]
        },
        {
          "type": "Effects of Depreciation",
          "value": "Economic consequences of a weaker currency",
          "characteristics": ["Cheaper exports", "More expensive imports", "Higher inflation", "Benefits exporters", "Hurts consumers and importers"],
          "behavior": "When a currency depreciates, it has opposite effects to appreciation. (1) Exports become cheaper: Domestic goods cost less in foreign currency, increasing demand from abroad. Export industries gain competitiveness, which can boost profits and employment in export sectors. (2) Imports become more expensive: Foreign goods cost more in domestic currency, hurting consumers and firms that rely on imported inputs. This reduces purchasing power and can raise costs for businesses. (3) Net exports tend to rise, increasing aggregate demand. (4) Inflation tends to rise because import prices are higher, adding to overall price level pressures. (5) The trade balance may improve over time as exports rise and imports fall, though there may be a short-run worsening (J-curve). (6) Domestic firms that compete with imports face less competition as imports become more expensive. (7) Sectors that use imported inputs face higher costs; export-oriented sectors benefit. Depreciation can help reduce trade deficits by making exports more competitive and imports more expensive. However, it can also fuel inflation, especially in countries heavily dependent on imports. The distributional effects are significant: depreciation benefits exporters and industries competing with imports; it hurts consumers and firms that rely on imported inputs.",
          
          "image": {
            "src": "images/unit11/depreciation_effects.png",
            "alt": "Diagram showing winners and losers from depreciation: exporters gain, consumers lose",
            "caption": "Figure 11.2.7: Depreciation benefits exporters but hurts consumers and importers through higher import prices."
          },
          
          "examples": [
            {
              "process": "Pound depreciation after Brexit",
              "explanation": "The pound's depreciation boosted UK exports and tourism but raised import prices, contributing to higher inflation in the UK."
            },
            {
              "process": "U.S. dollar depreciation 1985-87",
              "explanation": "After the Plaza Accord, the dollar depreciated to reduce the U.S. trade deficit. U.S. exports became more competitive, helping to narrow the deficit over time."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Appreciation and Depreciation Are Determined by Market Forces",
          "statement": "In a floating exchange rate system, currency values are determined by the market forces of supply and demand. Appreciation occurs when demand for the currency increases or supply decreases; depreciation occurs when demand decreases or supply increases. These shifts are driven by fundamental economic factors: interest rates, inflation, income growth, expectations, and capital flows. Understanding this market determination is essential for predicting exchange rate movements and for analyzing the effects of policy changes. For example, when the Fed raises interest rates, the dollar typically appreciates as foreign investors seek higher returns. When a country experiences high inflation, its currency tends to depreciate. These relationships are consistent with the supply and demand framework and are observed in real-world data.",
          "application": "When analyzing why a currency is appreciating or depreciating, look for changes in the underlying factors: Have interest rates changed? Is inflation different? Are there shifts in expectations or capital flows? The supply and demand framework provides a systematic way to understand exchange rate movements.",
          "example": "In 2022, the dollar appreciated sharply as the Fed raised rates while other central banks moved more slowly. Higher U.S. interest rates attracted capital, increasing demand for dollars.",
          
          "image": {
            "src": "images/unit11/market_forces.png",
            "alt": "Supply and demand graph showing how shifts cause appreciation and depreciation",
            "caption": "Figure 11.2.8: Appreciation and depreciation are determined by market forces—shifts in supply and demand driven by economic fundamentals."
          }
        },
        {
          "principle": "Appreciation and Depreciation Have Opposite Effects on Trade",
          "statement": "Appreciation and depreciation have mirror-image effects on a country's trade balance. Appreciation makes exports more expensive and imports cheaper, tending to reduce net exports (exports minus imports). Depreciation makes exports cheaper and imports more expensive, tending to increase net exports. This is the primary channel through which exchange rates affect aggregate demand. However, the relationship is not always immediate or straightforward. In the short run, a depreciation may initially worsen the trade balance because the price effect dominates the quantity effect—the J-curve phenomenon. Over time, as quantities adjust, the trade balance improves. The elasticity of demand for exports and imports determines how strongly trade responds to exchange rate changes. Countries with more elastic demand (more responsive to price changes) will see larger trade effects from exchange rate movements.",
          "application": "When evaluating the impact of exchange rate changes on trade, consider both price and quantity effects. A depreciation will eventually boost net exports, but the adjustment takes time. This is why policymakers may be patient when seeking to improve trade balances through currency depreciation.",
          "example": "After the dollar depreciated in the late 1980s, the U.S. trade deficit initially worsened before improving over several years—a classic J-curve pattern.",
          
          "image": {
            "src": "images/unit11/trade_effects.png",
            "alt": "Graph showing J-curve effect: trade balance initially worsens after depreciation, then improves",
            "caption": "Figure 11.2.9: Depreciation eventually improves the trade balance, but there may be a short-run worsening (J-curve effect)."
          }
        },
        {
          "principle": "Exchange Rate Movements Affect Inflation",
          "statement": "Exchange rate changes have significant effects on a country's inflation rate through import prices. When a currency depreciates, import prices rise, directly increasing the cost of imported goods. This can feed through to overall consumer prices, especially in countries heavily dependent on imports. The pass-through from exchange rates to inflation can be substantial. When a currency appreciates, import prices fall, reducing inflationary pressure. This is why central banks pay close attention to exchange rates—they affect the inflation outlook. In countries with inflation targeting, exchange rate movements are an important factor in policy decisions. The effect is stronger for traded goods and can spill over to domestic prices if imported inputs are widely used in production.",
          "application": "When assessing inflation risks, consider exchange rate movements. A depreciating currency adds to inflationary pressure; an appreciating currency helps contain inflation. This is why central banks may sometimes intervene to influence exchange rates.",
          "example": "In 2022, the dollar's appreciation helped moderate U.S. inflation by lowering import prices, even as domestic inflation remained high. In contrast, the pound's depreciation after Brexit contributed to higher UK inflation.",
          
          "image": {
            "src": "images/unit11/inflation_effects.png",
            "alt": "Diagram showing depreciation increasing import prices and inflation, appreciation decreasing import prices and inflation",
            "caption": "Figure 11.2.10: Exchange rate movements affect inflation through import prices. Depreciation is inflationary; appreciation is disinflationary."
          }
        },
        {
          "principle": "Appreciation and Depreciation Have Distributional Effects",
          "statement": "Exchange rate movements do not affect everyone equally. They create winners and losers within the economy. Appreciation benefits consumers (cheaper imports) and firms that use imported inputs (lower costs). It hurts exporters (reduced competitiveness) and domestic industries that compete with imports (tougher competition). Depreciation has opposite effects: it benefits exporters and import-competing industries, but hurts consumers (higher import prices) and firms reliant on imported inputs. These distributional effects explain why different sectors have different views on exchange rate policy. Export-oriented industries generally prefer a weaker currency; consumers and import-dependent industries prefer a stronger currency. Policymakers must balance these competing interests when considering exchange rate policy.",
          "application": "When evaluating the impact of exchange rate movements, consider who gains and who loses. A depreciation may be good for the trade balance but bad for consumers' purchasing power. This trade-off is central to exchange rate policy debates.",
          "example": "Japanese exporters have long favored a weaker yen to boost their competitiveness, while Japanese consumers benefit from a stronger yen that makes imports cheaper. This tension is a constant feature of Japanese policy debates.",
          
          "image": {
            "src": "images/unit11/distributional_effects.png",
            "alt": "Balance scale showing winners and losers from appreciation and depreciation",
            "caption": "Figure 11.2.11: Exchange rate movements create winners and losers. Appreciation benefits consumers; depreciation benefits exporters."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Percentage Appreciation/Depreciation",
          
          "image": {
            "src": "images/unit11/percentage_calc.png",
            "alt": "Exchange rate data table",
            "caption": "Figure 11.2.12: Calculate percentage appreciation or depreciation from exchange rate changes."
          },
          
          "problem": "The USD/EUR exchange rate changes from 1.20 to 1.10. a) Has the dollar appreciated or depreciated against the euro? b) Calculate the percentage change in the value of the dollar against the euro. c) Calculate the percentage change in the value of the euro against the dollar. d) If the USD/GBP rate changes from 1.30 to 1.40, has the dollar appreciated or depreciated against the pound? e) Calculate the percentage change in the dollar against the pound.",
          
          "step_by_step": [
            {
              "step": "Interpret USD/EUR change",
              "explanation": "USD/EUR is direct quotation (dollars per euro). A fall from 1.20 to 1.10 means fewer dollars needed to buy one euro, so dollar has appreciated."
            },
            {
              "step": "Calculate dollar appreciation against euro",
              "explanation": "Percentage change in dollar value = (new USD/EUR - old USD/EUR) / old USD/EUR × 100%? That would give (1.10 - 1.20)/1.20 = -8.33%, which is the change in the direct quote. But that's the change in the price of euros, not the dollar. To get dollar appreciation, we need the inverse. Better: Dollar value in euros = 1/(USD/EUR). Old dollar value = 1/1.20 = 0.8333 euros. New dollar value = 1/1.10 = 0.9091 euros. Percentage change = (0.9091 - 0.8333)/0.8333 × 100% = 9.09%. Dollar appreciated 9.09% against euro."
            },
            {
              "step": "Calculate euro depreciation against dollar",
              "explanation": "Euro value in dollars = USD/EUR. Old = 1.20, new = 1.10. Percentage change = (1.10 - 1.20)/1.20 × 100% = -8.33%. Euro depreciated 8.33% against dollar."
            },
            {
              "step": "Interpret USD/GBP change",
              "explanation": "USD/GBP rise from 1.30 to 1.40 means more dollars needed to buy one pound, so dollar has depreciated against pound."
            },
            {
              "step": "Calculate dollar depreciation against pound",
              "explanation": "Dollar value in pounds = 1/(USD/GBP). Old = 1/1.30 = 0.7692 pounds. New = 1/1.40 = 0.7143 pounds. Percentage change = (0.7143 - 0.7692)/0.7692 × 100% = -7.14%. Dollar depreciated 7.14%."
            }
          ],
          
          "final_answer": "a) Appreciated. b) +9.09%. c) -8.33%. d) Depreciated. e) -7.14%.",
          "concept_applied": "Percentage changes depend on which currency is being measured. Appreciation of one is depreciation of the other."
        },
        {
          "title": "Analyzing Causes of Exchange Rate Movements",
          
          "image": {
            "src": "images/unit11/causes_analysis.png",
            "alt": "List of economic events",
            "caption": "Figure 11.2.13: Determine whether each event causes appreciation or depreciation of the domestic currency."
          },
          
          "problem": "For each event, determine whether the domestic currency (U.S. dollar) will appreciate or depreciate, and explain using supply and demand. a) U.S. interest rates rise relative to foreign rates. b) U.S. inflation falls below foreign inflation. c) U.S. income grows faster than foreign income. d) Foreign investors become concerned about U.S. political stability. e) The U.S. runs a large trade deficit. f) The Federal Reserve signals future rate cuts.",
          
          "step_by_step": [
            {
              "step": "Analyze scenario a",
              "explanation": "Higher U.S. rates attract foreign capital, increasing demand for dollars → appreciation."
            },
            {
              "step": "Analyze scenario b",
              "explanation": "Lower U.S. inflation makes U.S. goods more competitive, increasing export demand (demand for dollars) and reducing import demand (supply of dollars) → appreciation."
            },
            {
              "step": "Analyze scenario c",
              "explanation": "Faster U.S. income growth increases imports, increasing supply of dollars → depreciation."
            },
            {
              "step": "Analyze scenario d",
              "explanation": "Concerns about stability reduce foreign investment, decreasing demand for dollars → depreciation."
            },
            {
              "step": "Analyze scenario e",
              "explanation": "A trade deficit means more dollars are being supplied to buy imports than are being demanded for exports. This tends to put downward pressure on the dollar → depreciation. (However, the deficit is financed by capital inflows, which increase demand, so net effect depends.)"
            },
            {
              "step": "Analyze scenario f",
              "explanation": "Signals of future rate cuts reduce expected returns, decreasing demand for dollars now → depreciation."
            }
          ],
          
          "final_answer": "a) Appreciate. b) Appreciate. c) Depreciate. d) Depreciate. e) Tend to depreciate. f) Depreciate.",
          "concept_applied": "Interest rates, inflation, income, expectations, and trade balances affect exchange rates through supply and demand."
        },
        {
          "title": "J-Curve Effect Analysis",
          
          "image": {
            "src": "images/unit11/jcurve_example.png",
            "alt": "Graph showing trade balance over time after depreciation",
            "caption": "Figure 11.2.14: Analyze the J-curve effect after a currency depreciation."
          },
          
          "problem": "A country's currency depreciates by 20%. In the first year after depreciation, the volume of exports rises by 5%, the volume of imports falls by 3%, but prices of exports in domestic currency are unchanged (they were set in domestic currency), while import prices rise by the full 20% (because foreign goods are priced in foreign currency). a) What happens to the value of exports in domestic currency? b) What happens to the value of imports in domestic currency? c) What happens to the trade balance (exports minus imports) in the short run? d) In the long run, export and import volumes adjust further: exports rise 15%, imports fall 10%. Recalculate the trade balance effect. e) Explain the J-curve phenomenon.",
          
          "step_by_step": [
            {
              "step": "Short-run export value",
              "explanation": "Export volume up 5%, price unchanged → export value up 5%."
            },
            {
              "step": "Short-run import value",
              "explanation": "Import volume down 3%, but import price up 20% → import value = (1 - 0.03) × (1 + 0.20) = 0.97 × 1.20 = 1.164, so import value up 16.4%."
            },
            {
              "step": "Short-run trade balance",
              "explanation": "Exports up 5%, imports up 16.4% → trade balance worsens (deficit increases or surplus decreases)."
            },
            {
              "step": "Long-run adjustment",
              "explanation": "Export volume up 15%, price unchanged → export value up 15%. Import volume down 10%, import price up 20% → import value = 0.90 × 1.20 = 1.08, so import value up 8%. Trade balance improves (exports up more than imports)."
            },
            {
              "step": "J-curve explanation",
              "explanation": "The J-curve shows that after depreciation, the trade balance initially worsens because the price effect dominates (imports cost more immediately, while export volumes take time to respond). Over time, as quantities adjust, the trade balance improves, tracing a J-shaped path."
            }
          ],
          
          "final_answer": "a) +5%. b) +16.4%. c) Worsens. d) Exports +15%, imports +8%, improves. e) Initial price effect dominates, then quantity effect takes over.",
          "concept_applied": "The J-curve describes the time path of the trade balance after depreciation: initial worsening, then improvement."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Initial Equilibrium",
          "description": "The exchange rate is initially at equilibrium where supply equals demand.",
          "mechanism": "At the current rate, quantity of currency supplied equals quantity demanded.",
          "result": "Stable exchange rate.",
          
          "image": {
            "src": "images/unit11/appdep_step1.png",
            "alt": "Supply and demand graph showing initial equilibrium",
            "caption": "Figure 11.2.15: Step 1 - Initial equilibrium exchange rate."
          }
        },
        {
          "step": 2,
          "process": "Shift Factor Occurs",
          "description": "An economic event changes supply or demand for the currency.",
          "mechanism": "Higher interest rates, lower inflation, expectations, etc., shift demand right or left. Income changes, etc., shift supply.",
          "result": "Supply or demand curve shifts.",
          
          "image": {
            "src": "images/unit11/appdep_step2.png",
            "alt": "Supply and demand graph showing shift in one curve",
            "caption": "Figure 11.2.16: Step 2 - A shift factor (e.g., interest rate change) shifts demand or supply."
          }
        },
        {
          "step": 3,
          "process": "Excess Supply or Demand Created",
          "description": "At the old exchange rate, there is now either excess supply or excess demand.",
          "mechanism": "If demand increases, excess demand at old rate. If supply increases, excess supply.",
          "result": "Disequilibrium.",
          
          "image": {
            "src": "images/unit11/appdep_step3.png",
            "alt": "Supply and demand graph showing excess demand or supply at old rate",
            "caption": "Figure 11.2.17: Step 3 - At the old rate, excess demand (if demand increased) or excess supply (if supply increased) appears."
          }
        },
        {
          "step": 4,
          "process": "Exchange Rate Adjusts",
          "description": "The exchange rate moves to eliminate the disequilibrium.",
          "mechanism": "Excess demand causes appreciation; excess supply causes depreciation. The rate moves until new equilibrium reached.",
          "result": "New equilibrium exchange rate.",
          
          "image": {
            "src": "images/unit11/appdep_step4.png",
            "alt": "Supply and demand graph showing movement to new equilibrium",
            "caption": "Figure 11.2.18: Step 4 - Exchange rate adjusts to new equilibrium, appreciating or depreciating."
          }
        },
        {
          "step": 5,
          "process": "Economic Effects Unfold",
          "description": "The new exchange rate affects trade, inflation, and economic activity.",
          "mechanism": "Appreciation reduces net exports and inflation; depreciation boosts net exports and increases inflation. Distributional effects occur.",
          "result": "Real economy effects.",
          
          "image": {
            "src": "images/unit11/appdep_step5.png",
            "alt": "Diagram showing effects on exports, imports, inflation",
            "caption": "Figure 11.2.19: Step 5 - The exchange rate change affects the broader economy."
          }
        }
      ],

      "image": {
        "src": "images/unit11/appreciation_depreciation_summary.png",
        "alt": "Comprehensive summary diagram of appreciation and depreciation: causes, effects, and distributional consequences",
        "caption": "Figure 11.2.20: Appreciation and depreciation summary - causes, economic effects, and winners and losers."
      }
    }
  ],

  "key_terms": [
    "Appreciation",
    "Depreciation",
    "Strong currency",
    "Weak currency",
    "Exchange rate change",
    "Percentage change",
    "Nominal appreciation",
    "Real appreciation",
    "Effective exchange rate",
    "Trade-weighted exchange rate",
    "Competitiveness",
    "Export competitiveness",
    "Import prices",
    "Pass-through",
    "J-curve",
    "Marshall-Lerner condition",
    "Elasticity approach",
    "Absorption approach",
    "Monetary approach",
    "Portfolio balance approach",
    "Overshooting",
    "Dornbusch overshooting model",
    "Safe haven",
    "Carry trade",
    "Uncovered interest parity",
    "Covered interest parity",
    "Purchasing power parity",
    "Real exchange rate",
    "Nominal exchange rate",
    "Terms of trade",
    "Trade balance",
    "Net exports",
    "Current account",
    "Capital flows",
    "Hot money",
    "Portfolio investment",
    "Foreign direct investment",
    "Speculation",
    "Expectations",
    "Market sentiment",
    "Risk appetite",
    "Risk aversion",
    "Flight to quality",
    "Currency crisis",
    "Contagion",
    "Sudden stop",
    "Capital flight",
    "Devaluation",
    "Revaluation",
    "Soft landing",
    "Hard landing",
    "Beggar-thy-neighbor",
    "Currency war",
    "Competitive depreciation"
  ],

  "summary": "Appreciation and depreciation refer to changes in the value of one currency relative to another. Appreciation means the currency has become more valuable—it can buy more foreign currency. Depreciation means it has become less valuable. These changes are determined by shifts in supply and demand in the foreign exchange market. A currency appreciates when demand increases or supply decreases; it depreciates when demand decreases or supply increases. Key factors causing appreciation and depreciation include: relative interest rates (higher rates attract capital, causing appreciation); relative inflation (higher inflation causes depreciation); relative income growth (faster growth increases imports, causing depreciation); expectations (expectations of appreciation lead to actual appreciation); terms of trade (improvement causes appreciation); productivity (faster growth causes appreciation); and government intervention. The effects of appreciation and depreciation on the economy are significant and opposite. Appreciation makes imports cheaper, benefiting consumers and firms using imported inputs, but makes exports more expensive, hurting exporters and reducing net exports. It also reduces inflationary pressure. Depreciation makes exports cheaper, boosting export industries, but makes imports more expensive, hurting consumers and raising inflation. Depreciation can improve the trade balance over time, though there may be a short-run worsening (J-curve effect). Both appreciation and depreciation have distributional effects—some sectors gain, others lose. Export-oriented industries generally prefer a weaker currency; consumers and import-dependent industries prefer a stronger currency. Exchange rate movements also affect inflation through import prices, which is why central banks monitor them closely. Understanding appreciation and depreciation is essential for analyzing exchange rate dynamics, trade balances, inflation, and the transmission of monetary policy in open economies."
}
