{
  "expanded_description": "How do countries choose their exchange rate systems? Why do some countries let their currencies float freely while others peg to the dollar or euro? The choice of exchange rate regime—whether fixed, floating, or something in between—is one of the most important policy decisions a country can make. It affects trade, inflation, monetary policy autonomy, and vulnerability to financial crises. Under a floating exchange rate system, market forces determine the currency's value. Under a fixed system, the government or central bank commits to maintaining a specific exchange rate, often against a major currency or basket of currencies. There are also intermediate regimes like managed floats, crawling pegs, and currency boards. Each system has advantages and disadvantages, and the choice depends on a country's economic structure, policy priorities, and vulnerability to shocks.",
  
  "core_concept": {
    "principle": "Exchange rate systems are the frameworks within which countries determine the value of their currencies. There are three main categories: floating, fixed, and hybrid systems. (1) Floating exchange rate system: The currency's value is determined by market forces of supply and demand without direct government intervention. Most major currencies (U.S. dollar, euro, Japanese yen, British pound) float. Advantages: Monetary policy autonomy—the central bank can focus on domestic goals like inflation and employment without having to defend a particular exchange rate. Automatic adjustment—trade imbalances can be corrected through exchange rate changes. No need to hold large foreign exchange reserves. Disadvantages: Volatility—exchange rates can fluctuate unpredictably, creating uncertainty for traders and investors. Can lead to overshooting and misalignment. May not discipline policymakers sufficiently. (2) Fixed exchange rate system: The government or central bank commits to maintaining the currency's value at a specific level against another currency or basket. This requires intervention in the forex market—buying domestic currency when it's under pressure to depreciate, selling when it's under pressure to appreciate. The central bank must hold sufficient foreign exchange reserves to defend the peg. Examples include the gold standard, Bretton Woods system (1944-1971), and currency boards like Hong Kong's peg to the U.S. dollar. Advantages: Stability—reduces uncertainty for traders and investors, promoting trade and investment. Discipline—forces the country to maintain low inflation and sound policies to avoid pressure on the peg. Can serve as a nominal anchor for monetary policy. Disadvantages: Loss of monetary policy autonomy—the central bank must subordinate domestic goals to maintaining the peg. Vulnerability to speculative attacks—if markets doubt the government's ability to defend the peg, they may sell the currency, forcing devaluation. Requires large reserves. (3) Hybrid systems: Managed float (dirty float)—the currency generally floats, but the central bank intervenes occasionally to influence its value. Crawling peg—the currency is adjusted periodically in small amounts. Pegged within a band—the currency can fluctuate within a range around a central parity (e.g., European Exchange Rate Mechanism). Currency board—a strict form of fixed exchange rate where domestic currency is fully backed by foreign reserves and automatically convertible. The choice of exchange rate regime involves trade-offs captured by the 'impossible trinity' (trilemma): a country cannot simultaneously have free capital flows, independent monetary policy, and a fixed exchange rate. It can choose at most two of the three. For example, a country with a fixed exchange rate and free capital flows must give up independent monetary policy (like Hong Kong). A country with independent monetary policy and free capital flows must have a floating rate (like the U.S.). A country with capital controls can have both fixed rates and independent policy (like China historically).",
    
    "explanation": "Think of exchange rate systems like different ways of setting the price of a good. Floating is like letting the market set the price minute by minute based on supply and demand—it fluctuates constantly. Fixed is like a government price control—the price is set by decree, and the government must stand ready to buy or sell to maintain that price. Managed float is like a price that mostly floats but with occasional government intervention to smooth out big swings. Each has pros and cons: floating gives you flexibility but volatility; fixed gives you stability but ties your hands. The impossible trinity says you can't have everything—you have to choose which two of the three you want: stable exchange rate, independent monetary policy, and free capital flows.",
    
    "image": {
      "src": "images/unit11/exchange_rate_systems.png",
      "alt": "Diagram comparing floating, fixed, and hybrid exchange rate systems",
      "caption": "Figure 11.3.1: Exchange rate systems range from floating (market-determined) to fixed (government-determined), with various hybrids in between."
    }
  },

  "sections": [
    {
      "section_title": "11.3 Exchange Rate Systems",
      "introduction": "Countries have choices about how to determine the value of their currencies. Some let the market decide, with rates fluctuating freely. Others fix their currency to another, like the U.S. dollar or euro. Still others use hybrid systems that combine elements of both. The choice of exchange rate regime is one of the most important policy decisions a country makes, affecting trade, inflation, monetary policy autonomy, and vulnerability to crises. In this section, we'll explore the different types of exchange rate systems, their advantages and disadvantages, the impossible trinity, and the historical experience with different regimes.",
      
      "introduction_image": {
        "src": "images/unit11/systems_intro.png",
        "alt": "World map with different countries colored by exchange rate regime",
        "caption": "Figure 11.3.2: Countries choose different exchange rate systems. Major currencies float; many smaller countries peg to a major currency."
      },
      
      "key_concept": {
        "definition": "Exchange rate systems are the frameworks that determine how a country's currency value is set. The main types are: (1) Floating exchange rate: The currency's value is determined by market supply and demand without direct government intervention. The central bank may occasionally intervene but does not target a specific rate. Most major currencies (U.S. dollar, euro, yen, pound) float. Floating rates provide monetary policy autonomy—the central bank can focus on domestic goals like inflation and employment. They also provide automatic adjustment to trade imbalances. However, they can be volatile and may not always reflect fundamentals. (2) Fixed exchange rate: The government or central bank commits to maintaining the currency's value at a specific level against another currency or basket. This requires intervention: buying domestic currency when it's under pressure to depreciate, selling when it's under pressure to appreciate. The central bank must hold sufficient foreign exchange reserves. Fixed rates provide stability, reducing uncertainty for traders and investors. They also impose discipline, forcing the country to maintain low inflation. However, they require sacrificing monetary policy autonomy and can be vulnerable to speculative attacks. (3) Hybrid systems: Managed float (dirty float)—the currency generally floats, but the central bank intervenes occasionally to influence its value. Crawling peg—the currency is adjusted periodically in small amounts. Pegged within a band—the currency can fluctuate within a range around a central parity. Currency board—a strict form of fixed exchange rate where domestic currency is fully backed by foreign reserves and automatically convertible. The choice of regime involves trade-offs captured by the impossible trinity (trilemma): a country cannot simultaneously have free capital flows, independent monetary policy, and a fixed exchange rate. It can choose at most two of the three. For example, a country with fixed rates and free capital flows must give up independent monetary policy (e.g., Hong Kong). A country with independent monetary policy and free capital flows must have floating rates (e.g., U.S.). A country with capital controls can have both fixed rates and independent policy (e.g., China historically). Historical exchange rate systems include the gold standard (late 19th century to 1914), the Bretton Woods system (1944-1971) of fixed but adjustable rates, and the post-Bretton Woods era of floating rates since 1973.",
        
        "context": "The choice of exchange rate regime has been debated for centuries. The gold standard provided fixed rates but collapsed during World War I. The Bretton Woods system attempted to combine fixed rates with some flexibility but broke down in 1971. Since then, countries have chosen a variety of regimes. The optimal regime depends on a country's size, openness, trade patterns, inflation history, and financial development. In AP Macroeconomics, understanding exchange rate systems is essential for analyzing international finance and policy choices.",
        
        "image": {
          "src": "images/unit11/impossible_trinity.png",
          "alt": "Triangle showing impossible trinity: fixed exchange rate, independent monetary policy, free capital flows—can only have two",
          "caption": "Figure 11.3.3: The impossible trinity: a country cannot have all three—fixed exchange rate, independent monetary policy, and free capital flows. It must choose two."
        }
      },

      "classifications": [
        {
          "type": "Floating Exchange Rate",
          "value": "Market-determined currency value",
          "characteristics": ["No government target", "Determined by supply/demand", "Monetary policy autonomy", "Automatic adjustment", "Potential volatility"],
          "behavior": "Under a floating exchange rate, the currency's value is determined entirely by market forces. The central bank does not intervene to influence the rate, though it may occasionally do so for other reasons. The exchange rate fluctuates freely in response to changes in supply and demand from trade, investment, and speculation. Advantages: (1) Monetary policy autonomy—the central bank can focus on domestic goals like inflation and employment without having to defend a particular exchange rate. (2) Automatic adjustment—trade imbalances tend to correct themselves as exchange rates adjust. A country with a trade deficit will see its currency depreciate, boosting exports and reducing imports. (3) No need to hold large foreign exchange reserves. (4) Insulation from foreign monetary policy—the country can set its own interest rates. Disadvantages: (1) Volatility—exchange rates can fluctuate unpredictably, creating uncertainty for traders and investors. (2) Can lead to overshooting—currencies may move far from fundamentals in response to speculation. (3) May not provide sufficient discipline—countries with floating rates can pursue inflationary policies without immediate penalty. Most major currencies (dollar, euro, yen, pound) float.",
          
          "image": {
            "src": "images/unit11/floating.png",
            "alt": "Graph showing fluctuating exchange rate over time with no government intervention",
            "caption": "Figure 11.3.4: Floating exchange rates are determined by market forces and fluctuate freely."
          },
          
          "examples": [
            {
              "process": "U.S. dollar",
              "explanation": "The dollar floats against other major currencies. Its value is determined by supply and demand in global forex markets. The Fed does not target a specific exchange rate."
            },
            {
              "process": "Japanese yen",
              "explanation": "The yen floats, though the Bank of Japan occasionally intervenes to smooth excessive volatility. Its value fluctuates with interest rates, trade flows, and market sentiment."
            }
          ]
        },
        {
          "type": "Fixed Exchange Rate",
          "value": "Government-determined currency value",
          "characteristics": ["Pegged to another currency", "Requires intervention", "Loss of monetary autonomy", "Stability", "Vulnerable to attacks"],
          "behavior": "Under a fixed exchange rate, the government or central bank commits to maintaining the currency's value at a specific level against another currency (or basket). This requires active intervention in the forex market. If the currency comes under pressure to depreciate (more sellers than buyers), the central bank must buy its own currency using foreign reserves, reducing supply and supporting the price. If it comes under pressure to appreciate, the central bank must sell its own currency and buy foreign currency, increasing supply and capping the price. The central bank must hold sufficient foreign reserves to defend the peg. Advantages: (1) Stability—reduces uncertainty for traders and investors, promoting trade and investment. (2) Discipline—forces the country to maintain low inflation and sound policies to avoid pressure on the peg. (3) Can serve as a nominal anchor for monetary policy, especially for countries with histories of high inflation. Disadvantages: (1) Loss of monetary policy autonomy—the central bank must subordinate domestic goals to maintaining the peg. Interest rates must be set to defend the exchange rate, not to manage the domestic economy. (2) Vulnerability to speculative attacks—if markets doubt the government's ability to defend the peg, they may sell the currency, forcing devaluation. (3) Requires large reserves—a prolonged defense can deplete reserves. (4) Can lead to crises if the peg becomes unsustainable.",
          
          "image": {
            "src": "images/unit11/fixed.png",
            "alt": "Graph showing flat line for exchange rate over time, with central bank intervention to maintain it",
            "caption": "Figure 11.3.5: Fixed exchange rates are maintained by central bank intervention—buying or selling currency as needed."
          },
          
          "examples": [
            {
              "process": "Hong Kong dollar",
              "explanation": "The Hong Kong dollar has been pegged to the U.S. dollar since 1983 at around 7.8 HKD/USD. Hong Kong's currency board ensures full backing by U.S. dollar reserves."
            },
            {
              "process": "Saudi riyal",
              "explanation": "The Saudi riyal is pegged to the U.S. dollar, reflecting the country's oil trade and desire for stability."
            }
          ]
        },
        {
          "type": "Hybrid Systems",
          "value": "Intermediate exchange rate regimes",
          "characteristics": ["Managed float", "Crawling peg", "Target zone", "Currency board", "Combine features"],
          "behavior": "Many countries use hybrid systems that combine elements of floating and fixed rates. (1) Managed float (dirty float): The currency generally floats, but the central bank intervenes occasionally to influence its value, smooth volatility, or lean against market trends. Most countries with floating rates practice some degree of managed float. (2) Crawling peg: The currency is adjusted periodically in small amounts, often to offset inflation differentials. The peg crawls over time. (3) Pegged within a band (target zone): The currency can fluctuate within a range around a central parity. The European Exchange Rate Mechanism (ERM) was an example. (4) Currency board: An extreme form of fixed exchange rate where domestic currency is fully backed by foreign reserves and automatically convertible at the fixed rate. The central bank cannot create money beyond its reserves, imposing strict discipline. Currency boards have been used in Hong Kong, Argentina (until its collapse), and several Eastern European countries. Hybrid systems attempt to combine the stability of fixed rates with some flexibility to adjust to shocks. However, they can also combine the disadvantages—they may not provide full credibility of a fixed peg while still limiting monetary policy autonomy.",
          
          "image": {
            "src": "images/unit11/hybrid_systems.png",
            "alt": "Graphs showing managed float, crawling peg, and target zone",
            "caption": "Figure 11.3.6: Hybrid systems include managed floats, crawling pegs, and target zones, combining elements of floating and fixed regimes."
          },
          
          "examples": [
            {
              "process": "Singapore dollar",
              "explanation": "Singapore uses a managed float against an undisclosed basket of currencies, allowing gradual adjustment while maintaining stability."
            },
            {
              "process": "Argentine currency board (1991-2001)",
              "explanation": "Argentina pegged the peso 1:1 to the U.S. dollar with a currency board. It brought stability but collapsed in a severe crisis when the peg became unsustainable."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Impossible Trinity Constrains Policy Choices",
          "statement": "The impossible trinity (or trilemma) is a fundamental result in international economics: a country cannot simultaneously have free capital flows, independent monetary policy, and a fixed exchange rate. It can choose at most two of the three. This constraint shapes exchange rate regime choices. (1) If a country wants free capital flows and independent monetary policy, it must have a floating exchange rate. The U.S. and Eurozone are examples—they let their currencies float so they can set interest rates for domestic goals. (2) If a country wants free capital flows and a fixed exchange rate, it must give up independent monetary policy. Hong Kong is an example—its currency is pegged to the U.S. dollar, so its interest rates follow U.S. rates. (3) If a country wants independent monetary policy and a fixed exchange rate, it must impose capital controls. China historically did this, controlling cross-border capital movements to maintain its peg while setting its own interest rates. The trilemma explains why policy choices are constrained and why countries must prioritize. It also explains why speculative attacks can occur when a country tries to maintain all three—markets bet that the policy is inconsistent and will eventually break.",
          "application": "When analyzing a country's exchange rate regime, consider how it resolves the trilemma. Does it have free capital flows? Independent monetary policy? A fixed rate? The answer reveals which two it has chosen and which it has sacrificed.",
          "example": "In the 1990s, many Asian countries had fixed exchange rates and free capital flows, but also tried to maintain some monetary independence. This inconsistent policy left them vulnerable to speculative attacks, which materialized in the 1997-98 Asian financial crisis.",
          
          "image": {
            "src": "images/unit11/trilemma_detailed.png",
            "alt": "Triangle showing three corners: free capital flows, fixed exchange rate, independent monetary policy. Each corner represents choosing two.",
            "caption": "Figure 11.3.7: The impossible trinity: a country can choose any two of the three—free capital flows, fixed exchange rate, or independent monetary policy—but not all three."
          }
        },
        {
          "principle": "Fixed Exchange Rates Provide Stability but Require Sacrifice",
          "statement": "Fixed exchange rates offer important benefits, especially for countries with unstable currencies or high inflation. By pegging to a stable currency like the U.S. dollar or euro, a country can import credibility and reduce inflation expectations. Fixed rates also reduce uncertainty for traders and investors, promoting trade and investment. However, these benefits come at a cost: the country must sacrifice monetary policy autonomy. Interest rates must be set to defend the peg, not to manage the domestic economy. If the anchor country raises rates, the pegging country must raise rates too, even if its economy is weak. The country must also hold sufficient reserves to defend the peg and may be vulnerable to speculative attacks. The choice to fix is a commitment device—it ties the hands of policymakers, which can be good if they lack discipline, but bad if they need flexibility to respond to shocks.",
          "application": "When evaluating a fixed exchange rate regime, consider whether the benefits of stability outweigh the loss of monetary autonomy. For small, open economies with close ties to a major trading partner, fixing may make sense. For larger, more diversified economies, floating may be preferable.",
          "example": "Estonia adopted a currency board pegged to the euro before joining the eurozone. This provided stability and helped control inflation, but meant Estonia had no independent monetary policy—it followed ECB rates even when they might not have been optimal for Estonia.",
          
          "image": {
            "src": "images/unit11/fixed_tradeoffs.png",
            "alt": "Balance scale weighing stability and credibility against loss of autonomy and vulnerability",
            "caption": "Figure 11.3.8: Fixed exchange rates offer stability and credibility but require sacrificing monetary policy autonomy and can be vulnerable to attacks."
          }
        },
        {
          "principle": "Floating Exchange Rates Provide Autonomy but Can Be Volatile",
          "statement": "Floating exchange rates allow countries to pursue independent monetary policy focused on domestic goals. The central bank can raise or lower interest rates to manage inflation and employment without worrying about defending a particular exchange rate. Floating rates also provide automatic adjustment to trade imbalances—a country with a trade deficit will see its currency depreciate, boosting exports and reducing imports. However, floating rates can be volatile, creating uncertainty for traders and investors. They can also overshoot, moving far from fundamentals in response to speculation or sentiment. For countries with underdeveloped financial markets or high pass-through from exchange rates to inflation, volatility can be costly. The choice to float is a choice to accept market-determined exchange rates in exchange for policy flexibility.",
          "application": "When evaluating a floating exchange rate regime, consider whether the economy can handle exchange rate volatility. Countries with deep financial markets, diversified exports, and credible monetary policy are better able to manage floating rates. Countries heavily dependent on a few exports or with high foreign currency debt may find volatility costly.",
          "example": "Canada has floated its dollar since 1970. The Canadian dollar fluctuates with commodity prices, but Canada's diversified economy and credible monetary policy allow it to manage the volatility. The Bank of Canada focuses on domestic inflation, not the exchange rate.",
          
          "image": {
            "src": "images/unit11/floating_tradeoffs.png",
            "alt": "Balance scale weighing monetary autonomy and automatic adjustment against volatility and uncertainty",
            "caption": "Figure 11.3.9: Floating rates provide monetary policy autonomy and automatic adjustment but can be volatile and create uncertainty."
          }
        },
        {
          "principle": "Exchange Rate Regimes Can Change Over Time",
          "statement": "Exchange rate regimes are not permanent. Countries may change their regime in response to economic conditions, crises, or policy shifts. The post-World War II period saw a shift from fixed (Bretton Woods) to floating for major currencies after 1971. Many countries that previously fixed have moved to floating or hybrid systems. Some have moved in the opposite direction, adopting currency boards or even giving up their currency entirely (eurozone). Regime changes are often driven by crises—when a fixed peg becomes unsustainable, countries may be forced to float, often with significant depreciation. Regime changes can also be deliberate policy choices, as when a country seeks to join a monetary union or adopt a more credible anchor. The choice of regime reflects evolving views on the trade-offs between stability and flexibility.",
          "application": "When analyzing a country's exchange rate policy, consider its history and current circumstances. A country that has experienced high inflation may prefer a fixed regime to import credibility. A country with strong institutions may prefer floating to retain flexibility. Regimes can and do change.",
          "example": "The UK left the European Exchange Rate Mechanism in 1992 after a speculative attack, floating the pound thereafter. Argentina abandoned its currency board in 2002 after a devastating crisis, moving to a floating (or heavily managed) rate.",
          
          "image": {
            "src": "images/unit11/regime_change.png",
            "alt": "Timeline showing shifts between exchange rate regimes for various countries",
            "caption": "Figure 11.3.10: Exchange rate regimes can change over time in response to crises, policy choices, or economic development."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Applying the Impossible Trinity",
          
          "image": {
            "src": "images/unit11/trilemma_example.png",
            "alt": "Triangle diagram for impossible trinity",
            "caption": "Figure 11.3.11: For each scenario, determine which two of the three the country has chosen."
          },
          
          "problem": "For each country scenario, identify which two of the three impossible trinity elements the country has, and which it has sacrificed. a) The U.S. has a floating dollar and free capital flows. The Fed sets interest rates based on domestic conditions. b) Hong Kong has a fixed exchange rate to the U.S. dollar and free capital flows. Its interest rates closely follow U.S. rates. c) China historically had a fixed exchange rate and independent monetary policy, but restricted capital movements. d) A European country joins the eurozone, adopting the euro and allowing free capital flows within the EU. e) A small island nation pegs its currency to the U.S. dollar and imposes strict capital controls to maintain monetary independence.",
          
          "step_by_step": [
            {
              "step": "Analyze scenario a",
              "explanation": "U.S.: Floating rate (not fixed), free capital flows, independent monetary policy. Chosen: free capital flows + independent policy. Sacrificed: fixed rate."
            },
            {
              "step": "Analyze scenario b",
              "explanation": "Hong Kong: Fixed rate, free capital flows, monetary policy follows U.S. (not independent). Chosen: fixed rate + free capital flows. Sacrificed: independent monetary policy."
            },
            {
              "step": "Analyze scenario c",
              "explanation": "China: Fixed rate, independent monetary policy, capital controls. Chosen: fixed rate + independent policy. Sacrificed: free capital flows."
            },
            {
              "step": "Analyze scenario d",
              "explanation": "Eurozone country: Fixed rate (within eurozone), free capital flows, no independent monetary policy (ECB sets rates). Chosen: fixed rate + free capital flows. Sacrificed: independent monetary policy."
            },
            {
              "step": "Analyze scenario e",
              "explanation": "Island nation: Fixed rate, independent monetary policy (can set own rates because capital controls prevent arbitrage), capital controls. Chosen: fixed rate + independent policy. Sacrificed: free capital flows."
            }
          ],
          
          "final_answer": "a) Free capital flows + independent policy. b) Fixed + free capital flows. c) Fixed + independent policy. d) Fixed + free capital flows. e) Fixed + independent policy.",
          "concept_applied": "The impossible trinity forces countries to choose two of the three: fixed rate, independent monetary policy, or free capital flows."
        },
        {
          "title": "Comparing Fixed and Floating",
          
          "image": {
            "src": "images/unit11/fixed_vs_floating.png",
            "alt": "Table comparing fixed and floating",
            "caption": "Figure 11.3.12: Compare fixed and floating exchange rate systems on various dimensions."
          },
          
          "problem": "Compare fixed and floating exchange rate systems on the following dimensions: a) Monetary policy autonomy. b) Vulnerability to speculative attacks. c) Certainty for traders. d) Automatic adjustment to trade imbalances. e) Need for foreign exchange reserves. For each, explain which system performs better and why.",
          
          "step_by_step": [
            {
              "step": "Monetary policy autonomy",
              "explanation": "Floating provides autonomy—central bank can set rates for domestic goals. Fixed requires sacrificing autonomy to maintain the peg. Floating better on this dimension."
            },
            {
              "step": "Vulnerability to speculative attacks",
              "explanation": "Fixed is vulnerable—if markets doubt the peg, they can attack, forcing devaluation. Floating has no target to attack. Floating better on this dimension."
            },
            {
              "step": "Certainty for traders",
              "explanation": "Fixed provides certainty—traders know future exchange rates (at least in the short run). Floating creates uncertainty. Fixed better on this dimension."
            },
            {
              "step": "Automatic adjustment to trade imbalances",
              "explanation": "Floating provides automatic adjustment—a deficit country's currency depreciates, boosting exports. Fixed requires internal adjustment (price/wage changes) which is slower and more painful. Floating better on this dimension."
            },
            {
              "step": "Need for foreign exchange reserves",
              "explanation": "Fixed requires large reserves to defend the peg. Floating requires minimal reserves (except for occasional intervention). Floating better on this dimension."
            }
          ],
          
          "final_answer": "a) Floating better. b) Floating better. c) Fixed better. d) Floating better. e) Floating better. Fixed wins only on certainty.",
          "concept_applied": "Fixed and floating each have advantages and disadvantages. The choice depends on which dimensions a country prioritizes."
        },
        {
          "title": "Analyzing a Currency Crisis",
          
          "image": {
            "src": "images/unit11/crisis_example.png",
            "alt": "Graph showing exchange rate and reserves during a crisis",
            "caption": "Figure 11.3.13: Analyze the dynamics of a currency crisis under a fixed exchange rate."
          },
          
          "problem": "A country has a fixed exchange rate pegged to the U.S. dollar. It runs large current account deficits and has high inflation. Investors begin to doubt the sustainability of the peg. a) What happens to demand for the currency? b) How does the central bank defend the peg? c) What happens to foreign exchange reserves? d) If the attack continues, what eventually happens? e) How could the country have prevented the crisis?",
          
          "step_by_step": [
            {
              "step": "Demand for currency",
              "explanation": "As doubts grow, investors sell the currency (supply increases) and demand falls. There is excess supply at the pegged rate."
            },
            {
              "step": "Central bank defense",
              "explanation": "To maintain the peg, the central bank must buy its own currency using foreign reserves, absorbing the excess supply and supporting the price."
            },
            {
              "step": "Reserves",
              "explanation": "Reserves decline as the central bank buys currency. If the attack is large and sustained, reserves can be depleted rapidly."
            },
            {
              "step": "Eventual outcome",
              "explanation": "If reserves run out, the central bank can no longer defend the peg. It is forced to devalue (let the currency depreciate) or float. The currency crashes, often overshooting. This is a currency crisis."
            },
            {
              "step": "Prevention",
              "explanation": "Prevention could include: maintaining sound policies (low inflation, sustainable deficits) to avoid doubt; holding large reserves to deter attacks; imposing capital controls; or moving to a floating rate before a crisis builds."
            }
          ],
          
          "final_answer": "a) Demand falls, supply rises. b) Buys currency with reserves. c) Reserves fall. d) Peg collapses, currency devalues. e) Sound policies, large reserves, capital controls, or early float.",
          "concept_applied": "Fixed exchange rates are vulnerable to speculative attacks if policies are inconsistent with the peg."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Country Chooses Exchange Rate Regime",
          "description": "Based on economic structure, policy priorities, and history, a country selects a regime: floating, fixed, or hybrid.",
          "mechanism": "Considerations include: size and openness of economy, inflation history, trade patterns, financial development, and desire for monetary autonomy.",
          "result": "Exchange rate regime selected.",
          
          "image": {
            "src": "images/unit11/system_step1.png",
            "alt": "Government officials deciding on exchange rate regime",
            "caption": "Figure 11.3.14: Step 1 - Country chooses an exchange rate regime based on its economic structure and policy priorities."
          }
        },
        {
          "step": 2,
          "process": "Regime Implemented",
          "description": "The chosen regime is put into practice.",
          "mechanism": "Under floating, no intervention. Under fixed, central bank stands ready to buy/sell currency at the pegged rate. Under managed float, occasional intervention.",
          "result": "Exchange rate determined accordingly.",
          
          "image": {
            "src": "images/unit11/system_step2.png",
            "alt": "Central bank operating under chosen regime",
            "caption": "Figure 11.3.15: Step 2 - Regime implemented: floating (no intervention), fixed (active intervention), or managed (occasional intervention)."
          }
        },
        {
          "step": 3,
          "process": "Economic Shocks Occur",
          "description": "The economy faces shocks—changes in interest rates, inflation, trade flows, or capital movements.",
          "mechanism": "Shocks affect supply and demand for the currency. Under floating, the exchange rate adjusts. Under fixed, the central bank must intervene.",
          "result": "Pressure on exchange rate.",
          
          "image": {
            "src": "images/unit11/system_step3.png",
            "alt": "Arrow representing shock hitting the economy",
            "caption": "Figure 11.3.16: Step 3 - Economic shocks affect supply and demand for the currency."
          }
        },
        {
          "step": 4,
          "process": "System Responds",
          "description": "The exchange rate system responds to the shock.",
          "mechanism": "Floating: rate adjusts to new equilibrium. Fixed: central bank intervenes to maintain peg, using reserves. Managed: rate may adjust with some intervention.",
          "result": "New exchange rate or reserve change.",
          
          "image": {
            "src": "images/unit11/system_step4.png",
            "alt": "Floating: rate changes; Fixed: reserves change",
            "caption": "Figure 11.3.17: Step 4 - System responds: floating rate adjusts; fixed rate requires reserve changes."
          }
        },
        {
          "step": 5,
          "process": "Outcome Evaluated",
          "description": "The outcome is assessed. If the regime proves unsustainable, the country may consider changing it.",
          "mechanism": "Persistent imbalances, reserve losses, or crises may lead to regime change. Countries may move from fixed to floating, adopt capital controls, or seek other adjustments.",
          "result": "Possible regime change.",
          
          "image": {
            "src": "images/unit11/system_step5.png",
            "alt": "Decision point: maintain or change regime",
            "caption": "Figure 11.3.18: Step 5 - Outcomes are evaluated. Unsustainable regimes may be changed."
          }
        }
      ],

      "image": {
        "src": "images/unit11/exchange_rate_systems_summary.png",
        "alt": "Comprehensive summary diagram of exchange rate systems: floating, fixed, hybrid; impossible trinity; advantages and disadvantages",
        "caption": "Figure 11.3.19: Exchange rate systems summary - types, trade-offs, impossible trinity, and regime choice."
      }
    }
  ],

  "key_terms": [
    "Exchange rate system",
    "Exchange rate regime",
    "Floating exchange rate",
    "Flexible exchange rate",
    "Fixed exchange rate",
    "Pegged exchange rate",
    "Managed float",
    "Dirty float",
    "Crawling peg",
    "Target zone",
    "Exchange rate band",
    "Currency board",
    "Dollarization",
    "Monetary union",
    "Eurozone",
    "Gold standard",
    "Bretton Woods system",
    "Smithsonian Agreement",
    "Plaza Accord",
    "Louvre Accord",
    "Impossible trinity",
    "Trilemma",
    "Mundell-Fleming model",
    "Monetary policy autonomy",
    "Capital controls",
    "Capital mobility",
    "Free capital flows",
    "Speculative attack",
    "Currency crisis",
    "Contagion",
    "Sudden stop",
    "Devaluation",
    "Revaluation",
    "Depreciation",
    "Appreciation",
    "Foreign exchange reserves",
    "International reserves",
    "Intervention",
    "Sterilized intervention",
    "Unsterilized intervention",
    "Nominal anchor",
    "Credibility",
    "Time inconsistency",
    "Moral hazard",
    "Optimal currency area",
    "Shock asymmetry",
    "Trade integration",
    "Factor mobility",
    "Fiscal transfers",
    "Sovereign risk",
    "Default risk",
    "Original sin",
    "Currency mismatch",
    "Fear of floating"
  ],

  "summary": "Exchange rate systems determine how a country's currency value is set. The main types are floating, fixed, and hybrid systems. Under a floating exchange rate, the currency's value is determined by market supply and demand without direct government intervention. Floating rates provide monetary policy autonomy, automatic adjustment to trade imbalances, and no need for large reserves, but can be volatile and create uncertainty. Major currencies like the U.S. dollar, euro, and yen float. Under a fixed exchange rate, the government commits to maintaining the currency at a specific level against another currency or basket. This requires intervention—buying or selling domestic currency—and sufficient foreign reserves. Fixed rates provide stability, reduce uncertainty for traders, and impose discipline, but require sacrificing monetary policy autonomy and are vulnerable to speculative attacks. Hybrid systems include managed floats (occasional intervention), crawling pegs (periodic adjustments), target zones (fluctuation bands), and currency boards (strict backing by reserves). The choice of regime is constrained by the impossible trinity (trilemma): a country cannot simultaneously have free capital flows, independent monetary policy, and a fixed exchange rate. It must choose two of the three. For example, the U.S. has free capital flows and independent policy with a floating rate; Hong Kong has free capital flows and a fixed rate but no independent policy; China historically had a fixed rate and independent policy with capital controls. Exchange rate regimes can change over time, often in response to crises or policy shifts. The Bretton Woods system of fixed rates collapsed in 1971, leading to floating rates for major currencies. Many countries have experienced currency crises when fixed pegs became unsustainable. The choice of regime involves trade-offs between stability, flexibility, autonomy, and vulnerability. Small, open economies may benefit from fixing to a major trading partner; larger, diversified economies often prefer floating to retain policy flexibility. Understanding exchange rate systems is essential for analyzing international finance, monetary policy, and the causes of currency crises."
}
