{
  "expanded_description": "How are exchange rates determined? Why does the dollar strengthen against some currencies and weaken against others? The answer lies in the foreign exchange market—the global marketplace where currencies are traded. The foreign exchange market is the largest financial market in the world, with daily trading volume exceeding $6 trillion. Participants include central banks, commercial banks, multinational corporations, hedge funds, and tourists. Exchange rates—the price of one currency in terms of another—are determined by the interaction of supply and demand in this market. Understanding the foreign exchange market is essential for analyzing international trade, capital flows, monetary policy, and the competitiveness of nations.",
  
  "core_concept": {
    "principle": "The foreign exchange (forex) market is the global market where currencies are traded. Exchange rates are determined by the supply and demand for different currencies. The demand for a currency derives from the demand for that country's goods, services, and assets. For example, the demand for U.S. dollars comes from: foreign buyers of U.S. exports (who need dollars to pay for goods); foreign investors wanting to buy U.S. assets (stocks, bonds, real estate); and speculators expecting the dollar to appreciate. The supply of a currency comes from: domestic residents importing foreign goods (they sell domestic currency to buy foreign currency); domestic investors buying foreign assets; and speculators selling the currency expecting depreciation. The equilibrium exchange rate is where the quantity supplied equals quantity demanded. Appreciation (increase in value) occurs when demand increases or supply decreases; depreciation (decrease in value) occurs when demand decreases or supply increases. Factors that shift demand and supply include: (1) Relative inflation rates: Higher inflation in a country makes its goods more expensive, reducing demand for its currency (to buy goods) and increasing supply (as residents buy cheaper foreign goods). (2) Relative interest rates: Higher interest rates attract foreign capital, increasing demand for the currency. (3) Relative income growth: Faster growth increases imports, increasing supply of domestic currency (to buy foreign goods). (4) Expectations: If investors expect a currency to appreciate, they buy it now, increasing demand. (5) Government intervention: Central banks may buy or sell currencies to influence exchange rates. The forex market is decentralized and operates 24 hours a day, with major trading centers in London, New York, Tokyo, Singapore, and other financial hubs. Exchange rates can be quoted in two ways: direct quotation (domestic currency per unit of foreign currency) and indirect quotation (foreign currency per unit of domestic currency). Understanding the forex market is essential for analyzing international trade, capital flows, and the effects of monetary and fiscal policy in open economies.",
    
    "explanation": "Think of currencies like any other good—they have a price determined by supply and demand. When Americans want to buy Japanese cars, they need yen, so they supply dollars and demand yen. When Japanese want to buy U.S. bonds, they need dollars, so they supply yen and demand dollars. The exchange rate adjusts to balance these flows. If more people want dollars (say because U.S. interest rates rise), the dollar appreciates. If more people want to sell dollars (say because Americans are buying lots of imports), the dollar depreciates. It's just like the market for apples, but with currencies.",
    
    "image": {
      "src": "images/unit11/forex_market_overview.png",
      "alt": "Supply and demand graph for U.S. dollars showing equilibrium exchange rate",
      "caption": "Figure 11.1.1: The foreign exchange market determines the equilibrium exchange rate where quantity supplied equals quantity demanded."
    }
  },

  "sections": [
    {
      "section_title": "11.1 Foreign Exchange Market",
      "introduction": "Every international transaction—whether buying goods, investing in foreign stocks, or traveling abroad—requires exchanging currencies. The foreign exchange market is where these exchanges happen. It's a global, decentralized market operating 24 hours a day, with participants ranging from central banks to tourists. In this section, we'll explore how the forex market works, how exchange rates are determined by supply and demand, what factors shift supply and demand, and how to interpret exchange rate quotations.",
      
      "introduction_image": {
        "src": "images/unit11/forex_intro.png",
        "alt": "Trading screens showing currency prices and world map with major forex centers",
        "caption": "Figure 11.1.2: The foreign exchange market is global and decentralized, with major trading centers in London, New York, Tokyo, and Singapore."
      },
      
      "key_concept": {
        "definition": "The foreign exchange (forex) market is the global marketplace for trading national currencies against one another. It is the largest financial market in the world, with average daily trading volume exceeding $6 trillion. The market is decentralized and operates 24 hours a day through a network of banks, brokers, and electronic trading platforms. Exchange rates are determined by the interaction of supply and demand for different currencies. The demand for a currency, say the U.S. dollar, comes from: (1) Foreigners wanting to buy U.S. goods and services (exports)—they need dollars to pay for them. (2) Foreigners wanting to invest in U.S. assets—stocks, bonds, real estate, or direct investment in businesses. (3) Speculators who believe the dollar will appreciate and want to profit. (4) Central banks intervening to support the dollar. The supply of dollars comes from: (1) U.S. residents wanting to buy foreign goods and services (imports)—they supply dollars to obtain foreign currency. (2) U.S. residents wanting to invest in foreign assets. (3) Speculators selling dollars expecting depreciation. (4) Central banks selling dollars to weaken their currency. The equilibrium exchange rate (price of one currency in terms of another) is found where the quantity of dollars supplied equals the quantity demanded. Changes in any of the factors affecting supply or demand will shift the curves and change the exchange rate. Factors that shift demand and supply include: relative inflation rates (higher inflation reduces demand for a currency because its goods are more expensive); relative interest rates (higher rates attract capital, increasing demand); relative income growth (faster growth increases imports, increasing supply); expectations about future exchange rates; and government intervention. Exchange rates can be quoted in two ways: direct quotation (domestic currency per unit of foreign currency, e.g., 1.10 USD/EUR) and indirect quotation (foreign currency per unit of domestic currency, e.g., 0.91 EUR/USD). A rise in the direct quotation means the domestic currency depreciates (it takes more domestic currency to buy one unit of foreign currency); a fall means appreciation. The forex market is essential for international trade and finance, and understanding it is crucial for analyzing open-economy macroeconomics.",
        
        "context": "The modern foreign exchange market emerged after the collapse of the Bretton Woods system of fixed exchange rates in the early 1970s. Since then, most major currencies have floated, with exchange rates determined by market forces. The market has grown enormously with globalization, financial deregulation, and electronic trading. Central banks still intervene occasionally, but the market is now dominated by private participants. In AP Macroeconomics, understanding the forex market is essential for analyzing exchange rate determination, international trade, and the effects of monetary and fiscal policy in open economies.",
        
        "image": {
          "src": "images/unit11/forex_supply_demand.png",
          "alt": "Supply and demand graph for a currency showing equilibrium",
          "caption": "Figure 11.1.3: The exchange rate is determined by supply and demand for a currency. The equilibrium rate equates quantity supplied and demanded."
        }
      },

      "classifications": [
        {
          "type": "Demand for Currency",
          "value": "Sources of demand for a country's currency",
          "characteristics": ["Foreign demand for exports", "Foreign investment in assets", "Speculation", "Central bank intervention", "Derived demand"],
          "behavior": "The demand for a currency, say the U.S. dollar, is a derived demand—people want dollars not for themselves but to buy things denominated in dollars. The main sources of demand are: (1) Foreign purchases of U.S. goods and services (exports). When a German company buys U.S. software, it needs dollars to pay, so it supplies euros and demands dollars. (2) Foreign purchases of U.S. assets. When a Japanese investor buys U.S. Treasury bonds, she needs dollars, so she supplies yen and demands dollars. (3) Speculation. If traders expect the dollar to appreciate, they buy dollars now to sell later at a profit. (4) Central bank intervention. If the Bank of Japan wants to weaken the yen, it may buy dollars (supply yen, demand dollars). The demand curve for dollars slopes downward: as the dollar depreciates (becomes cheaper), U.S. goods become cheaper to foreigners, increasing exports and thus the quantity of dollars demanded. Also, foreign assets become cheaper, increasing investment demand. So the quantity of dollars demanded is inversely related to the exchange rate.",
          
          "image": {
            "src": "images/unit11/currency_demand.png",
            "alt": "Downward-sloping demand curve for a currency with sources labeled",
            "caption": "Figure 11.1.4: Demand for a currency comes from exports, foreign investment, speculation, and central bank intervention. The demand curve slopes downward."
          },
          
          "examples": [
            {
              "process": "Export demand",
              "explanation": "When the dollar depreciates, U.S. goods become cheaper for foreigners, so export quantity rises, increasing the quantity of dollars demanded."
            },
            {
              "process": "Investment demand",
              "explanation": "If U.S. interest rates rise, foreign investors want more U.S. bonds, increasing demand for dollars at any exchange rate—the demand curve shifts right."
            }
          ]
        },
        {
          "type": "Supply of Currency",
          "value": "Sources of supply of a country's currency",
          "characteristics": ["Domestic demand for imports", "Domestic investment abroad", "Speculation", "Central bank intervention", "Derived from foreign currency demand"],
          "behavior": "The supply of a currency, say the U.S. dollar, comes from U.S. residents wanting to obtain foreign currencies to buy foreign goods, services, or assets. The main sources are: (1) U.S. purchases of foreign goods and services (imports). When an American buys a German car, she needs euros, so she supplies dollars to get euros. (2) U.S. purchases of foreign assets. When an American buys Japanese stocks, he needs yen, so he supplies dollars. (3) Speculation. If traders expect the dollar to depreciate, they sell dollars now to avoid losses. (4) Central bank intervention. If the Fed wants to weaken the dollar, it may sell dollars (supply dollars) and buy foreign currency. The supply curve for dollars slopes upward: as the dollar appreciates (becomes more expensive), foreign goods become cheaper for Americans, increasing imports and thus the quantity of dollars supplied. Also, foreign assets become cheaper, increasing investment abroad. So the quantity of dollars supplied is positively related to the exchange rate.",
          
          "image": {
            "src": "images/unit11/currency_supply.png",
            "alt": "Upward-sloping supply curve for a currency with sources labeled",
            "caption": "Figure 11.1.5: Supply of a currency comes from imports, foreign investment, speculation, and central bank intervention. The supply curve slopes upward."
          },
          
          "examples": [
            {
              "process": "Import demand",
              "explanation": "When the dollar appreciates, foreign goods become cheaper for Americans, so import quantity rises, increasing the quantity of dollars supplied."
            },
            {
              "process": "Foreign investment",
              "explanation": "If foreign interest rates rise, Americans want to buy more foreign bonds, increasing supply of dollars at any exchange rate—the supply curve shifts right."
            }
          ]
        },
        {
          "type": "Equilibrium Exchange Rate",
          "value": "Rate where quantity supplied equals quantity demanded",
          "characteristics": ["Clears the market", "Changes with shifts in supply/demand", "Determines currency value", "Affects trade and capital flows", "Can be managed by central banks"],
          "behavior": "The equilibrium exchange rate is found at the intersection of the supply and demand curves for a currency. At this rate, the quantity of the currency that people want to buy (demand) exactly equals the quantity that people want to sell (supply). If the exchange rate is above equilibrium, there is excess supply—more people want to sell the currency than buy it. The currency will depreciate (price falls) until equilibrium is restored. If below equilibrium, there is excess demand—more people want to buy than sell. The currency will appreciate (price rises). The equilibrium changes when either the supply curve or demand curve shifts. For example, if U.S. interest rates rise relative to foreign rates, demand for dollars increases (shift right), causing appreciation. If U.S. incomes grow faster than foreign incomes, imports rise, increasing supply of dollars (shift right), causing depreciation. The equilibrium exchange rate is not fixed—it fluctuates constantly with market conditions. Understanding what causes these shifts is essential for analyzing exchange rate movements.",
          
          "image": {
            "src": "images/unit11/forex_equilibrium.png",
            "alt": "Supply and demand graph showing equilibrium exchange rate",
            "caption": "Figure 11.1.6: Equilibrium exchange rate is where supply equals demand. Excess supply causes depreciation; excess demand causes appreciation."
          },
          
          "examples": [
            {
              "process": "Interest rate increase",
              "explanation": "If the Fed raises interest rates, foreign investors demand more dollars to buy U.S. bonds. Demand shifts right, dollar appreciates to new equilibrium."
            },
            {
              "process": "Inflation differential",
              "explanation": "If U.S. inflation rises faster than abroad, U.S. goods become more expensive, reducing export demand (demand for dollars left) and increasing import demand (supply right). Dollar depreciates."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Exchange Rates Are Determined by Supply and Demand",
          "statement": "Like any price in a market economy, exchange rates are determined by the interaction of supply and demand. The demand for a currency comes from foreigners wanting to buy that country's goods, services, and assets. The supply comes from domestic residents wanting to buy foreign goods, services, and assets. The equilibrium exchange rate balances these flows. When demand increases (shifts right) or supply decreases (shifts left), the currency appreciates. When demand decreases or supply increases, it depreciates. This simple supply and demand framework explains most exchange rate movements, though in practice expectations and speculation also play important roles. The framework also shows that exchange rates are relative prices—they depend on conditions in both countries, not just one.",
          "application": "When analyzing exchange rate movements, identify whether the change comes from a shift in demand or supply. For example, if U.S. exports increase, demand for dollars rises, causing appreciation. If U.S. investors buy more foreign assets, supply of dollars rises, causing depreciation.",
          "example": "In 2022-23, the Fed raised interest rates sharply. This increased demand for dollars from foreign investors seeking higher returns, causing the dollar to appreciate significantly against other currencies.",
          
          "image": {
            "src": "images/unit11/supply_demand_determination.png",
            "alt": "Supply and demand graph showing shifts and exchange rate changes",
            "caption": "Figure 11.1.7: Exchange rates are determined by supply and demand. Shifts in either curve change the equilibrium rate."
          }
        },
        {
          "principle": "Currency Values Are Affected by Relative Economic Conditions",
          "statement": "Exchange rates respond to differences in economic conditions between countries. Key factors include: (1) Relative inflation rates: A country with higher inflation will see its currency depreciate because its goods become less competitive (reducing demand) and its residents buy cheaper foreign goods (increasing supply). (2) Relative interest rates: A country with higher interest rates attracts foreign capital, increasing demand for its currency and causing appreciation. (3) Relative income growth: Faster-growing countries import more, increasing supply of their currency and causing depreciation (all else equal). (4) Relative productivity growth: Faster productivity growth makes goods cheaper and more competitive, increasing export demand and causing appreciation. These factors operate through supply and demand channels and explain long-term trends in exchange rates.",
          "application": "When predicting exchange rate movements, compare economic conditions across countries. If the U.S. has higher inflation than Europe, expect dollar depreciation. If U.S. interest rates rise relative to Japan's, expect dollar appreciation.",
          "example": "In the 1980s, high U.S. interest rates attracted foreign capital, causing the dollar to appreciate sharply. In the 2000s, the U.S. current account deficit and low savings put downward pressure on the dollar.",
          
          "image": {
            "src": "images/unit11/relative_conditions.png",
            "alt": "Table showing how inflation, interest rates, income growth affect exchange rates",
            "caption": "Figure 11.1.8: Relative economic conditions—inflation, interest rates, income growth—affect exchange rates through supply and demand."
          }
        },
        {
          "principle": "Expectations and Speculation Influence Exchange Rates",
          "statement": "In addition to fundamental factors like trade and investment flows, expectations about future exchange rates play a major role in the forex market. If traders expect a currency to appreciate, they will buy it now to profit later, increasing demand and causing the appreciation to happen immediately—a self-fulfilling prophecy. Similarly, expectations of depreciation lead to selling, causing depreciation. This is why exchange rates can be volatile and why news and market sentiment matter. Speculation can also lead to overshooting—exchange rates moving beyond their long-run equilibrium in response to shocks, then gradually correcting. Central bank credibility and policy announcements influence expectations, which is why monetary policy communications move exchange rates.",
          "application": "When analyzing exchange rate movements, consider market expectations. A currency may appreciate even without changes in fundamentals if traders anticipate future interest rate increases or strong growth. This is why forex markets react to economic data and central bank statements.",
          "example": "When the Fed signals future rate hikes, the dollar often appreciates immediately as traders anticipate higher returns, even before rates actually rise.",
          
          "image": {
            "src": "images/unit11/expectations.png",
            "alt": "Diagram showing expectations affecting demand and supply",
            "caption": "Figure 11.1.9: Expectations and speculation influence exchange rates. If traders expect appreciation, they buy now, causing appreciation."
          }
        },
        {
          "principle": "Exchange Rates Are Quoted in Two Ways",
          "statement": "Exchange rates can be quoted directly or indirectly. A direct quotation expresses the domestic currency price of one unit of foreign currency (e.g., 1.10 USD per EUR). An indirect quotation expresses the foreign currency price of one unit of domestic currency (e.g., 0.91 EUR per USD). In the U.S., direct quotations are commonly used for some currencies (e.g., USD per EUR) and indirect for others (e.g., JPY per USD). A rise in the direct quotation means the domestic currency depreciates (it takes more dollars to buy one euro). A fall means appreciation. The two quotations are reciprocals. Understanding quotations is essential for interpreting exchange rate movements and for calculating cross rates (exchange rates between two currencies using a third). In international finance, it's important to be clear which quotation is being used to avoid confusion.",
          "application": "When reading exchange rate data, note whether it's direct or indirect. A statement that 'the dollar rose' could mean either the direct quotation fell (dollar appreciates) or the indirect quotation rose. Context matters.",
          "example": "If the USD/EUR rate falls from 1.20 to 1.10, the dollar has appreciated—it takes fewer dollars to buy one euro. If the EUR/USD rate falls from 0.83 to 0.91, the dollar has depreciated—it takes more euros to buy one dollar.",
          
          "image": {
            "src": "images/unit11/quotations.png",
            "alt": "Table showing direct and indirect quotations and their relationship",
            "caption": "Figure 11.1.10: Exchange rates can be quoted directly (domestic per foreign) or indirectly (foreign per domestic). They are reciprocals."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Finding Equilibrium Exchange Rate",
          
          "image": {
            "src": "images/unit11/equilibrium_example.png",
            "alt": "Supply and demand schedules for a currency",
            "caption": "Figure 11.1.11: Use supply and demand schedules to find equilibrium exchange rate."
          },
          
          "problem": "The table shows the demand and supply schedules for U.S. dollars against the euro. The exchange rate is in USD per EUR (direct quotation). At an exchange rate of 1.00 USD/EUR, quantity demanded is 800 billion dollars, quantity supplied is 400 billion. At 1.10, demand 700, supply 500. At 1.20, demand 600, supply 600. At 1.30, demand 500, supply 700. At 1.40, demand 400, supply 800. a) What is the equilibrium exchange rate? b) At an exchange rate of 1.00, is there excess supply or demand? What happens to the dollar? c) At 1.30, is there excess supply or demand? What happens? d) If demand for dollars increases by 200 billion at every exchange rate, what is the new equilibrium? e) Graph the original and new equilibria.",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "Equilibrium is where quantity demanded = quantity supplied. From table, at 1.20, demand = supply = 600. So equilibrium rate = 1.20 USD/EUR."
            },
            {
              "step": "At 1.00",
              "explanation": "Demand 800 > supply 400, so excess demand. People want more dollars than are available. The dollar will appreciate (exchange rate falls? Wait, careful: At 1.00, the dollar is cheaper (1 dollar buys fewer euros? Actually 1.00 means 1 dollar = 1/1.00 = 1 euro). Excess demand for dollars means dollar appreciates, so exchange rate (USD/EUR) falls. At 1.00, it's below equilibrium, so it will rise toward 1.20."
            },
            {
              "step": "At 1.30",
              "explanation": "Demand 500 < supply 700, so excess supply. People want to sell more dollars than are demanded. Dollar will depreciate, so exchange rate falls toward 1.20."
            },
            {
              "step": "Demand increases by 200",
              "explanation": "New demand: at 1.00: 800+200=1000; 1.10: 700+200=900; 1.20: 600+200=800; 1.30: 500+200=700; 1.40: 400+200=600. New equilibrium where demand = supply. At 1.30, demand 700 = supply 700. New equilibrium = 1.30 USD/EUR. Dollar appreciates."
            },
            {
              "step": "Graph",
              "explanation": "Plot original D and S intersecting at 1.20. New D shifts right, intersecting S at 1.30."
            }
          ],
          
          "final_answer": "a) 1.20 USD/EUR. b) Excess demand, dollar appreciates. c) Excess supply, dollar depreciates. d) 1.30 USD/EUR. e) Graph as described.",
          "concept_applied": "Equilibrium exchange rate is where supply equals demand. Excess demand causes appreciation; excess supply causes depreciation."
        },
        {
          "title": "Analyzing Factors Affecting Exchange Rates",
          
          "image": {
            "src": "images/unit11/factors_example.png",
            "alt": "List of economic events",
            "caption": "Figure 11.1.12: Determine how each event affects the exchange rate."
          },
          
          "problem": "For each event, determine whether the U.S. dollar will appreciate or depreciate against other currencies. Explain using supply and demand analysis. a) U.S. inflation rises faster than inflation in other countries. b) The Fed raises interest rates while other central banks hold steady. c) U.S. incomes grow faster than incomes in other countries. d) Foreign investors become more optimistic about the U.S. economy. e) The U.S. government imposes tariffs on imports, reducing imports. f) A financial crisis in Europe makes U.S. assets seem safer.",
          
          "step_by_step": [
            {
              "step": "Analyze scenario a",
              "explanation": "Higher U.S. inflation makes U.S. goods more expensive, reducing export demand (demand for dollars left). Also, Americans buy more cheaper foreign goods, increasing supply of dollars (right). Both effects cause dollar depreciation."
            },
            {
              "step": "Analyze scenario b",
              "explanation": "Higher U.S. interest rates attract foreign investors, increasing demand for dollars (right). Dollar appreciates."
            },
            {
              "step": "Analyze scenario c",
              "explanation": "Faster U.S. income growth increases imports, increasing supply of dollars (right). Dollar depreciates."
            },
            {
              "step": "Analyze scenario d",
              "explanation": "Optimism about U.S. economy increases foreign investment, increasing demand for dollars (right). Dollar appreciates."
            },
            {
              "step": "Analyze scenario e",
              "explanation": "Tariffs reduce imports, decreasing supply of dollars (left). Dollar appreciates. (Note: This is partial equilibrium; retaliation could affect exports.)"
            },
            {
              "step": "Analyze scenario f",
              "explanation": "Safe-haven demand increases demand for dollars (right). Dollar appreciates."
            }
          ],
          
          "final_answer": "a) Depreciate. b) Appreciate. c) Depreciate. d) Appreciate. e) Appreciate. f) Appreciate.",
          "concept_applied": "Exchange rates respond to inflation, interest rates, income, expectations, trade policy, and risk perceptions through supply and demand."
        },
        {
          "title": "Cross Rate Calculation",
          
          "image": {
            "src": "images/unit11/cross_rate.png",
            "alt": "Exchange rate quotes",
            "caption": "Figure 11.1.13: Calculate cross exchange rates from given quotes."
          },
          
          "problem": "You are given the following exchange rates: USD/EUR = 1.10 (1.10 dollars per euro); USD/GBP = 1.30 (1.30 dollars per pound). a) Calculate the EUR/GBP cross rate (euros per pound). b) Calculate the GBP/EUR cross rate (pounds per euro). c) If the market rate for EUR/GBP is 0.90, is there an arbitrage opportunity? d) If you have $\\$1,000$, how could you profit from the mispricing? e) What would happen to the rates as arbitrage occurs?",
          
          "step_by_step": [
            {
              "step": "Calculate EUR/GBP",
              "explanation": "EUR/GBP = (USD/GBP) / (USD/EUR) = 1.30 / 1.10 = 1.1818 euros per pound."
            },
            {
              "step": "Calculate GBP/EUR",
              "explanation": "GBP/EUR = (USD/EUR) / (USD/GBP) = 1.10 / 1.30 = 0.8462 pounds per euro. (Or reciprocal of EUR/GBP: 1/1.1818 = 0.8462.)"
            },
            {
              "step": "Check for arbitrage",
              "explanation": "Market rate for EUR/GBP is 0.90, which is different from calculated 1.1818. Actually 0.90 euros per pound is less than 1.1818, so the pound is undervalued in euro terms. Arbitrage opportunity exists."
            },
            {
              "step": "Arbitrage with $\\$1,000$",
              "explanation": "Step 1: Convert dollars to pounds at USD/GBP = 1.30: $1,000 / 1.30 = 769.23 pounds. Step 2: Convert pounds to euros at market EUR/GBP = 0.90: 769.23 × 0.90 = 692.31 euros. Step 3: Convert euros to dollars at USD/EUR = 1.10: 692.31 × 1.10 = 761.54 dollars. You end with $\\$761.54$, losing money? That's not right—check direction. If EUR/GBP = 0.90 means 1 pound = 0.90 euros, that's cheaper than our calculated 1.18 euros per pound, so pound is cheap in euros. To profit, buy pounds cheap (with euros) and sell pounds dear (for dollars). Start with dollars: Buy euros with dollars at 1.10 → get 909.09 euros. Then buy pounds with euros at 0.90 → get 909.09 × 0.90 = 818.18 pounds. Then sell pounds for dollars at 1.30 → get 818.18 × 1.30 = 1,063.63 dollars. Profit = $\\$63.63$."
            },
            {
              "step": "Arbitrage effect",
              "explanation": "Arbitrage will increase demand for pounds (raising its value) and increase supply of euros (lowering its value) until the cross rate aligns with the dollar rates."
            }
          ],
          
          "final_answer": "a) 1.1818 EUR/GBP. b) 0.8462 GBP/EUR. c) Yes, arbitrage opportunity. d) Profit $\\$63.63$ as shown. e) Arbitrage eliminates discrepancy.",
          "concept_applied": "Cross rates must be consistent with direct quotes; otherwise arbitrage opportunities exist."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Participants Enter the Market",
          "description": "Various participants—exporters, importers, investors, speculators, central banks—demand and supply currencies.",
          "mechanism": "Each participant has a reason to buy or sell a currency: to pay for goods, to invest, to speculate, or to influence the exchange rate.",
          "result": "Supply and demand for each currency generated.",
          
          "image": {
            "src": "images/unit11/forex_step1.png",
            "alt": "Various participants in forex market: exporters, importers, investors, central banks",
            "caption": "Figure 11.1.14: Step 1 - Participants enter the market, creating supply and demand for currencies."
          }
        },
        {
          "step": 2,
          "process": "Supply and Demand Curves Determined",
          "description": "The total demand for a currency at each exchange rate is the sum of demands from all sources; total supply similarly.",
          "mechanism": "Demand slopes down (higher price reduces quantity demanded); supply slopes up (higher price increases quantity supplied).",
          "result": "Market supply and demand curves established.",
          
          "image": {
            "src": "images/unit11/forex_step2.png",
            "alt": "Supply and demand graph for a currency",
            "caption": "Figure 11.1.15: Step 2 - Market supply and demand curves are determined by summing individual demands and supplies."
          }
        },
        {
          "step": 3,
          "process": "Equilibrium Exchange Rate Established",
          "description": "The exchange rate adjusts until quantity supplied equals quantity demanded.",
          "mechanism": "At rates above equilibrium, excess supply pushes rate down; below equilibrium, excess demand pushes rate up.",
          "result": "Equilibrium exchange rate.",
          
          "image": {
            "src": "images/unit11/forex_step3.png",
            "alt": "Supply and demand graph showing equilibrium",
            "caption": "Figure 11.1.16: Step 3 - Equilibrium exchange rate is where supply equals demand."
          }
        },
        {
          "step": 4,
          "process": "Shifts in Supply or Demand Occur",
          "description": "Changes in economic conditions, expectations, or policy shift the curves.",
          "mechanism": "Higher inflation, interest rates, income, or expectations shift curves. Central bank intervention also shifts curves.",
          "result": "New equilibrium exchange rate.",
          
          "image": {
            "src": "images/unit11/forex_step4.png",
            "alt": "Supply and demand graph showing shifts and new equilibrium",
            "caption": "Figure 11.1.17: Step 4 - Shifts in supply or demand change the equilibrium exchange rate."
          }
        },
        {
          "step": 5,
          "process": "Exchange Rate Affects Economy",
          "description": "The new exchange rate affects exports, imports, capital flows, and aggregate demand.",
          "mechanism": "Appreciation makes exports more expensive, imports cheaper, reducing net exports. Depreciation has opposite effects.",
          "result": "Feedback to the real economy.",
          
          "image": {
            "src": "images/unit11/forex_step5.png",
            "alt": "Diagram showing exchange rate affecting trade and aggregate demand",
            "caption": "Figure 11.1.18: Step 5 - Exchange rate changes affect the broader economy through trade and capital flows."
          }
        }
      ],

      "image": {
        "src": "images/unit11/forex_summary.png",
        "alt": "Comprehensive summary diagram of foreign exchange market: supply, demand, equilibrium, shift factors, and economic effects",
        "caption": "Figure 11.1.19: Foreign exchange market summary - supply and demand determination, shift factors, and equilibrium."
      }
    }
  ],

  "key_terms": [
    "Foreign exchange market",
    "Forex",
    "FX market",
    "Exchange rate",
    "Currency",
    "Appreciation",
    "Depreciation",
    "Direct quotation",
    "Indirect quotation",
    "Base currency",
    "Quote currency",
    "Cross rate",
    "Bid-ask spread",
    "Spot rate",
    "Forward rate",
    "Swap",
    "Option",
    "Future",
    "Derivatives",
    "Liquidity",
    "Market depth",
    "Volatility",
    "Arbitrage",
    "Triangular arbitrage",
    "Covered interest arbitrage",
    "Uncovered interest parity",
    "Purchasing power parity",
    "Law of one price",
    "Real exchange rate",
    "Nominal exchange rate",
    "Effective exchange rate",
    "Trade-weighted exchange rate",
    "Demand for currency",
    "Supply of currency",
    "Export demand",
    "Import demand",
    "Capital flows",
    "Portfolio investment",
    "Foreign direct investment",
    "Speculation",
    "Safe haven",
    "Carry trade",
    "Interest rate differential",
    "Inflation differential",
    "Income growth",
    "Terms of trade",
    "Competitiveness",
    "Central bank intervention",
    "Reserves",
    "Market participants",
    "Commercial banks",
    "Investment banks",
    "Hedge funds",
    "Multinational corporations",
    "Retail traders",
    "Brokers",
    "Electronic trading platforms",
    "SWIFT",
    "CHIPS",
    "Continuous Linked Settlement"
  ],

  "summary": "The foreign exchange (forex) market is the global marketplace for trading currencies. It is the world's largest financial market, with daily trading volume exceeding $6 trillion. Exchange rates are determined by the interaction of supply and demand for different currencies. The demand for a currency comes from foreigners wanting to buy that country's goods, services, and assets, as well as from speculators and central banks. The supply comes from domestic residents wanting to buy foreign goods, services, and assets, plus speculators and central banks. The equilibrium exchange rate is where quantity supplied equals quantity demanded. Factors that shift demand and supply include: relative inflation rates (higher inflation reduces demand and increases supply, causing depreciation); relative interest rates (higher rates attract capital, increasing demand, causing appreciation); relative income growth (faster growth increases imports, increasing supply, causing depreciation); expectations (if a currency is expected to appreciate, demand increases now, causing appreciation); and government intervention. Exchange rates can be quoted directly (domestic currency per unit of foreign currency) or indirectly (foreign currency per unit of domestic currency). A rise in the direct quotation means depreciation; a fall means appreciation. The forex market is decentralized and operates 24 hours a day through a network of banks, brokers, and electronic platforms. Participants include central banks, commercial banks, corporations, hedge funds, and individual traders. Understanding the forex market is essential for analyzing international trade, capital flows, monetary policy, and the competitiveness of nations. Exchange rate movements affect exports, imports, inflation, and aggregate demand, creating feedback loops between the forex market and the real economy."
}
