{
  "expanded_description": "How do exchange rate movements affect the overall economy? When the dollar appreciates, what happens to U.S. output and employment? When it depreciates, how does it affect inflation and growth? Exchange rates are not just abstract numbers—they have real effects on aggregate demand, output, and prices through their impact on net exports. A depreciation makes exports cheaper and imports more expensive, boosting net exports and increasing aggregate demand. An appreciation has the opposite effect, reducing net exports and dampening aggregate demand. These effects are a key channel through which exchange rates transmit to the broader economy and through which monetary and fiscal policy operate in open economies. Understanding the impact of exchange rates on aggregate demand is essential for analyzing international trade, policy transmission, and the linkages between economies.",
  
  "core_concept": {
    "principle": "Exchange rate movements affect aggregate demand primarily through their impact on net exports (NX = exports - imports). Net exports are a component of aggregate demand (AD = C + I + G + NX). When a country's currency depreciates (becomes weaker), its goods become cheaper for foreigners, so exports rise. At the same time, foreign goods become more expensive for domestic residents, so imports fall. Both effects increase net exports, shifting the aggregate demand curve to the right. This increases real GDP and employment in the short run, though it may also increase inflationary pressure. When a currency appreciates (becomes stronger), exports become more expensive, reducing exports; imports become cheaper, increasing imports. Net exports fall, shifting aggregate demand left, reducing output and employment, and lowering inflationary pressure. The magnitude of these effects depends on the price elasticities of demand for exports and imports. If demand is elastic, the quantity responses are large, and the impact on net exports is substantial. If demand is inelastic, the effects are smaller. There is also a distinction between short-run and long-run effects. In the short run, quantities may not adjust fully, so the initial impact may be smaller. Over time, as consumers and firms adjust, the effects become larger. The Marshall-Lerner condition states that a depreciation will improve the trade balance if the sum of the absolute values of export and import demand elasticities is greater than one. Exchange rate effects on aggregate demand also interact with other policy effects. For example, expansionary monetary policy that lowers interest rates often causes currency depreciation, amplifying the stimulus through net exports. Contractionary monetary policy that raises rates causes appreciation, dampening demand further. This is an important channel of monetary policy transmission in open economies. Fiscal policy can also affect exchange rates: expansionary fiscal policy may raise interest rates, attracting capital and causing appreciation, which partly offsets the direct demand stimulus (crowding out through the exchange rate channel). Understanding these interactions is essential for analyzing policy in open economies.",
    
    "explanation": "Think of the exchange rate as a price tag on a country's goods. When the dollar depreciates, it's like putting U.S. goods on sale—foreigners buy more, boosting U.S. production and jobs. When the dollar appreciates, U.S. goods become more expensive, so foreigners buy less, and Americans buy more cheap imports, reducing U.S. production. The exchange rate is a powerful channel through which the economy adjusts and through which policy works. It's like an automatic stabilizer for trade.",
    
    "image": {
      "src": "images/unit11/exchange_rate_ad.png",
      "alt": "AD-AS graph showing depreciation shifting AD right (higher output) and appreciation shifting AD left (lower output)",
      "caption": "Figure 11.4.1: Exchange rate changes affect aggregate demand through net exports. Depreciation boosts AD; appreciation reduces AD."
    }
  },

  "sections": [
    {
      "section_title": "11.4 Impact on Aggregate Demand",
      "introduction": "Exchange rates are not just abstract numbers—they have real effects on the economy. When a currency depreciates, it affects the prices of exports and imports, which in turn affects spending, production, and employment. When it appreciates, the opposite happens. In this section, we'll explore how exchange rate movements affect aggregate demand through net exports, how the size of these effects depends on elasticities, the distinction between short-run and long-run impacts, and how exchange rate channels interact with monetary and fiscal policy.",
      
      "introduction_image": {
        "src": "images/unit11/ad_intro.png",
        "alt": "Diagram showing exchange rate affecting exports and imports, which affect aggregate demand",
        "caption": "Figure 11.4.2: Exchange rate changes affect net exports, a component of aggregate demand, transmitting to output and employment."
      },
      
      "key_concept": {
        "definition": "Exchange rate movements affect aggregate demand primarily through their impact on net exports (NX). Net exports are the difference between exports and imports, and they are a component of aggregate demand: AD = C + I + G + NX. When a currency depreciates (weakens), the following occurs: (1) Exports become cheaper for foreigners, so the quantity of exports demanded increases. (2) Imports become more expensive for domestic residents, so the quantity of imports demanded decreases. Both effects increase net exports, shifting the aggregate demand curve to the right. This increases real GDP and employment in the short run. When a currency appreciates (strengthens), exports become more expensive (reducing export quantity) and imports become cheaper (increasing import quantity), reducing net exports and shifting AD left, decreasing output and employment. The magnitude of these effects depends on the price elasticities of demand for exports and imports. If demand is elastic, quantity responses are large, and the impact on net exports is substantial. If demand is inelastic, the effects are smaller. The Marshall-Lerner condition states that a depreciation will improve the trade balance (increase net exports) if the sum of the absolute values of export and import demand elasticities is greater than one. Empirically, this condition is usually satisfied in the long run but may not hold in the short run, contributing to the J-curve effect (where the trade balance initially worsens after depreciation before improving). The exchange rate channel is an important transmission mechanism for monetary policy. Expansionary monetary policy that lowers interest rates often causes currency depreciation (as lower rates reduce capital inflows), which amplifies the stimulus through increased net exports. Contractionary monetary policy that raises rates causes appreciation, dampening demand further. Fiscal policy also interacts: expansionary fiscal policy may raise interest rates, attracting capital and causing appreciation, which partly offsets the direct demand stimulus (crowding out through the exchange rate). In open economies, these exchange rate effects are a crucial part of policy analysis.",
        
        "context": "The link between exchange rates and aggregate demand has been recognized since the development of the Mundell-Fleming model in the 1960s. The model showed how policy effects differ under fixed and floating rates and how exchange rate channels affect transmission. The Marshall-Lerner condition and J-curve have been empirically studied extensively. In AP Macroeconomics, understanding this link is essential for analyzing open economy policy and the effects of exchange rate movements.",
        
        "image": {
          "src": "images/unit11/nx_ad_link.png",
          "alt": "Flowchart showing depreciation → higher NX → higher AD → higher output; appreciation → lower NX → lower AD → lower output",
          "caption": "Figure 11.4.3: Exchange rate changes affect net exports, which shift aggregate demand and affect output and employment."
        }
      },

      "classifications": [
        {
          "type": "Depreciation Effect on AD",
          "value": "Currency depreciation increases aggregate demand",
          "characteristics": ["Exports become cheaper", "Imports become more expensive", "Net exports rise", "AD shifts right", "Output and employment increase"],
          "behavior": "When a currency depreciates, the immediate effect is on relative prices. Domestic goods become cheaper for foreigners, so the quantity of exports demanded increases. Foreign goods become more expensive for domestic residents, so the quantity of imports demanded decreases. Both effects increase net exports (exports minus imports). Since net exports are a component of aggregate demand, the AD curve shifts to the right. In the short run, this increases real GDP and employment. The size of the increase depends on: (1) The elasticities of export and import demand—more elastic means larger quantity responses. (2) The share of net exports in GDP—larger share means bigger impact. (3) The extent of the depreciation. Depreciation also tends to increase inflationary pressure because import prices rise, which can feed through to domestic prices. This may partly offset the real effects if the central bank responds. Depreciation can be expansionary for the domestic economy but contractionary for trading partners (beggar-thy-neighbor).",
          
          "image": {
            "src": "images/unit11/depreciation_ad.png",
            "alt": "AD-AS graph showing AD shifting right after depreciation, increasing output and price level",
            "caption": "Figure 11.4.4: Currency depreciation increases net exports, shifting AD right, raising output and employment."
          },
          
          "examples": [
            {
              "process": "U.S. dollar depreciation 1985-87",
              "explanation": "After the Plaza Accord, the dollar depreciated significantly. This boosted U.S. exports and helped reduce the trade deficit, contributing to economic growth in the late 1980s."
            },
            {
              "process": "Pound depreciation after Brexit",
              "explanation": "The pound's depreciation after the 2016 Brexit vote boosted UK exports and tourism, providing a stimulus to the economy, though it also raised inflation."
            }
          ]
        },
        {
          "type": "Appreciation Effect on AD",
          "value": "Currency appreciation decreases aggregate demand",
          "characteristics": ["Exports become more expensive", "Imports become cheaper", "Net exports fall", "AD shifts left", "Output and employment decrease"],
          "behavior": "When a currency appreciates, the opposite effects occur. Exports become more expensive for foreigners, reducing export quantity. Imports become cheaper for domestic residents, increasing import quantity. Net exports fall, shifting the aggregate demand curve to the left. In the short run, this reduces real GDP and employment. The magnitude depends on the same factors: elasticities, share of net exports, and extent of appreciation. Appreciation also reduces inflationary pressure because import prices fall, which can help contain inflation. Appreciation can be contractionary for the domestic economy but expansionary for trading partners (as their exports become more competitive). For countries heavily dependent on exports, appreciation can be painful, leading to job losses in export industries. For countries that import a lot, appreciation benefits consumers and firms that use imported inputs.",
          
          "image": {
            "src": "images/unit11/appreciation_ad.png",
            "alt": "AD-AS graph showing AD shifting left after appreciation, decreasing output and price level",
            "caption": "Figure 11.4.5: Currency appreciation reduces net exports, shifting AD left, lowering output and employment."
          },
          
          "examples": [
            {
              "process": "Strong dollar 2022-23",
              "explanation": "The dollar's sharp appreciation in 2022-23 made U.S. exports more expensive and imports cheaper, reducing net exports and acting as a drag on U.S. growth, though it also helped moderate inflation."
            },
            {
              "process": "Japanese yen appreciation 2010-12",
              "explanation": "The yen's appreciation hurt Japanese exporters like Toyota and Sony, reducing their profits and contributing to sluggish growth in Japan."
            }
          ]
        },
        {
          "type": "Marshall-Lerner Condition and J-Curve",
          "value": "Conditions for trade balance improvement",
          "characteristics": ["Elasticity condition", "Short-run vs long-run", "J-curve pattern", "Quantity adjustment lags", "Empirical regularity"],
          "behavior": "The Marshall-Lerner condition states that a currency depreciation will improve the trade balance (increase net exports) if the sum of the absolute values of the elasticities of demand for exports and imports is greater than one. If the sum is less than one, depreciation worsens the trade balance. Empirically, the condition is usually satisfied in the long run but may not hold in the short run. This gives rise to the J-curve effect: after a depreciation, the trade balance often initially worsens before improving over time. The initial worsening occurs because prices adjust immediately (imports cost more, exports earn less in domestic currency), while quantities take time to adjust (contracts, search, production lags). As quantities gradually respond, the trade balance turns around and improves, tracing a J-shaped path. The J-curve implies that the expansionary effects of depreciation on aggregate demand may be delayed. Policymakers need to be patient and recognize that the benefits of depreciation take time to materialize.",
          
          "image": {
            "src": "images/unit11/jcurve_marshall.png",
            "alt": "Graph showing J-curve: trade balance initially worsens after depreciation, then improves over time",
            "caption": "Figure 11.4.6: The J-curve shows that after depreciation, the trade balance initially worsens (price effect dominates) before improving (quantity effect dominates)."
          },
          
          "examples": [
            {
              "process": "U.S. dollar depreciation 1985",
              "explanation": "After the dollar began depreciating in 1985, the U.S. trade deficit initially continued to widen before beginning to narrow in 1987—a classic J-curve pattern."
            },
            {
              "process": "UK pound depreciation 1992",
              "explanation": "After the UK left the ERM and the pound depreciated, the trade balance improved over time, though with some initial lag."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Exchange Rate Changes Affect AD Through Net Exports",
          "statement": "The primary channel through which exchange rates affect aggregate demand is net exports. A depreciation makes domestic goods cheaper abroad, boosting exports, and makes foreign goods more expensive at home, reducing imports. Both increase net exports, shifting AD right. An appreciation has opposite effects. This relationship is direct and predictable, though the magnitude varies. The effect on AD is one of the main reasons policymakers care about exchange rates. It also means that exchange rate movements can either amplify or offset other policy effects. For example, if the Fed raises interest rates and the dollar appreciates, the contractionary effect on AD is amplified by the fall in net exports. If the Fed cuts rates and the dollar depreciates, the expansionary effect is amplified. This exchange rate channel is a key feature of monetary policy transmission in open economies.",
          "application": "When analyzing the impact of exchange rate changes, trace the effect through net exports to aggregate demand. A depreciation is expansionary; an appreciation is contractionary. The size of the effect depends on how much trade responds to price changes.",
          "example": "In 2022, the dollar's sharp appreciation acted as a drag on U.S. growth, reducing net exports even as domestic demand remained strong. This helped moderate the overall expansion and inflation.",
          
          "image": {
            "src": "images/unit11/ad_principle.png",
            "alt": "Flow diagram: exchange rate change → net exports change → AD shift → output change",
            "caption": "Figure 11.4.7: Exchange rate changes affect AD through net exports. This is a key transmission channel."
          }
        },
        {
          "principle": "The Size of the Effect Depends on Trade Elasticities",
          "statement": "Not all exchange rate changes have the same impact. The effect on net exports depends on how responsive export and import quantities are to price changes—the price elasticities of demand. If demand for a country's exports is elastic, a small depreciation leads to a large increase in export volume. If demand is inelastic, the volume response is small. Similarly, if import demand is elastic, a depreciation leads to a large drop in import volume; if inelastic, the drop is small. The Marshall-Lerner condition formalizes this: depreciation improves the trade balance if the sum of export and import elasticities (in absolute value) exceeds one. For most countries, this condition holds in the long run, but not necessarily in the short run. The elasticities depend on factors like the availability of substitutes, the nature of traded goods (commodities vs differentiated products), and the time horizon. Countries with more diversified exports and imports tend to have higher elasticities.",
          "application": "When predicting the effect of an exchange rate change, consider the elasticities. A depreciation will have a larger expansionary effect if export and import demand are elastic. This is one reason why the same depreciation can have different effects in different countries.",
          "example": "A country that exports commodities (with inelastic demand) may see little export volume increase from depreciation—the main effect is higher domestic currency revenue from the same volume. A country that exports manufactured goods (with more elastic demand) may see a larger volume response.",
          
          "image": {
            "src": "images/unit11/elasticities.png",
            "alt": "Graphs showing elastic vs inelastic demand responses to price changes",
            "caption": "Figure 11.4.8: The size of the trade response depends on elasticities. Elastic demand means larger quantity changes."
          }
        },
        {
          "principle": "The J-Curve Implies Delayed Effects",
          "statement": "The full expansionary effect of a depreciation does not occur immediately. In the short run, the trade balance may actually worsen because prices adjust faster than quantities. Import prices rise immediately, increasing the value of imports, while export volumes take time to respond to lower prices. This is the J-curve phenomenon. Over time, as contracts adjust, consumers switch to cheaper domestic goods, and exporters expand capacity, the quantity effects dominate and the trade balance improves. The J-curve implies that policymakers need to be patient—the benefits of depreciation take time. It also means that short-run data can be misleading. A country that depreciates may see its trade deficit widen initially, leading to premature policy reversal. Understanding the J-curve helps interpret trade data and design appropriate policies.",
          "application": "When evaluating the effects of a depreciation, don't expect immediate improvement. The trade balance may worsen first. Look for improvement over quarters or years as quantities adjust. This is why policy persistence matters.",
          "example": "After the dollar depreciated in 1985, the U.S. trade deficit continued to widen for about two years before beginning to narrow. Policymakers who expected immediate improvement would have been disappointed, but the long-run effect was positive.",
          
          "image": {
            "src": "images/unit11/jcurve_detail.png",
            "alt": "J-curve graph with initial worsening then improvement",
            "caption": "Figure 11.4.9: The J-curve shows delayed effects. Trade balance initially worsens (price effect) before improving (quantity effect)."
          }
        },
        {
          "principle": "Exchange Rate Effects Interact with Monetary and Fiscal Policy",
          "statement": "In open economies, exchange rate movements are not independent—they often result from policy actions and in turn affect policy outcomes. Monetary policy affects exchange rates: higher interest rates attract capital, causing appreciation; lower rates cause depreciation. This means that monetary policy has an additional channel of transmission through exchange rates. For example, when the Fed raises rates, the contractionary effect comes not only from higher domestic borrowing costs but also from the appreciation that reduces net exports. This amplifies the policy effect. Similarly, fiscal policy can affect exchange rates: expansionary fiscal policy may raise interest rates (if it increases demand for loanable funds), attracting capital and causing appreciation, which partly offsets the direct demand stimulus. This is a form of crowding out through the exchange rate. The net effect of fiscal policy depends on the strength of these channels. Understanding these interactions is essential for policy analysis in open economies.",
          "application": "When analyzing policy in an open economy, consider the exchange rate channel. A rate hike not only slows domestic spending but also appreciates the currency, further reducing demand through net exports. A rate cut has the opposite effect. Fiscal stimulus may be partly offset by appreciation.",
          "example": "In the early 1980s, tight U.S. monetary policy raised interest rates, attracted capital, and caused the dollar to appreciate sharply. This appreciation reduced net exports, amplifying the contractionary effect of high rates. The combination brought down inflation but also contributed to a deep recession.",
          
          "image": {
            "src": "images/unit11/policy_interaction.png",
            "alt": "Diagram showing monetary policy affecting exchange rate, which affects AD; fiscal policy affecting interest rates and exchange rate",
            "caption": "Figure 11.4.10: Exchange rate effects interact with monetary and fiscal policy, amplifying or offsetting their direct impacts."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating the Effect of Depreciation on Net Exports",
          
          "image": {
            "src": "images/unit11/nx_calc.png",
            "alt": "Table with export and import data",
            "caption": "Figure 11.4.11: Calculate the effect of a depreciation on net exports given elasticities."
          },
          
          "problem": "A country has exports of $\\$500$ billion and imports of $\\$600$ billion, so a trade deficit of $\\$100$ billion. The currency depreciates by 10%. The elasticity of export demand is 0.8, and the elasticity of import demand is 0.5 (in absolute value). a) By what percentage do export volumes change? b) By what percentage do import volumes change? c) Assuming export prices in domestic currency are unchanged (exporters set prices in domestic currency) and import prices in foreign currency are unchanged (so import prices in domestic currency rise by 10%), calculate the new values of exports and imports. d) What is the new trade balance? e) Does the depreciation improve the trade balance? Does the Marshall-Lerner condition hold?",
          
          "step_by_step": [
            {
              "step": "Export volume change",
              "explanation": "Export volume change = elasticity × depreciation = 0.8 × 10% = 8% increase."
            },
            {
              "step": "Import volume change",
              "explanation": "Import volume change = elasticity × (price increase) = 0.5 × 10% = 5% decrease. (Since imports become more expensive, quantity falls.)"
            },
            {
              "step": "New export value",
              "explanation": "Export value = old value × (1 + volume change) × (price change). Export price unchanged in domestic currency, so price factor = 1. New exports = $500 × 1.08 = $540$ billion."
            },
            {
              "step": "New import value",
              "explanation": "Import price rises by 10% (because foreign goods priced in foreign currency become more expensive in domestic currency). New imports = old value × (1 - volume change) × (1 + price change) = $600 × 0.95 × 1.10 = $600 × 1.045 = $627$ billion."
            },
            {
              "step": "New trade balance",
              "explanation": "New trade balance = $540 - 627 = -87$ billion. Deficit narrowed from $100$ to $87$ billion, an improvement of $13$ billion."
            },
            {
              "step": "Marshall-Lerner condition",
              "explanation": "Sum of elasticities = 0.8 + 0.5 = 1.3 > 1, so condition holds. Trade balance improves as expected."
            }
          ],
          
          "final_answer": "a) +8%. b) -5%. c) Exports $\\$540$B, imports $\\$627$B. d) -$\\$87$B (improvement). e) Yes, condition holds.",
          "concept_applied": "Depreciation improves trade balance if elasticities sum > 1. The calculation accounts for price and quantity effects."
        },
        {
          "title": "J-Curve Numerical Example",
          
          "image": {
            "src": "images/unit11/jcurve_numerical.png",
            "alt": "Table showing short-run and long-run trade balance",
            "caption": "Figure 11.4.12: Trace the J-curve effect with numbers."
          },
          
          "problem": "A country depreciates by 20%. In the short run (first year), export volumes rise by 2%, import volumes fall by 1%. Export prices in domestic currency are unchanged; import prices rise by 20%. In the long run (after three years), export volumes rise by 15%, import volumes fall by 10%. a) Calculate the short-run percentage change in export value. b) Calculate the short-run percentage change in import value. c) Calculate the short-run change in the trade balance (assume initial exports = imports = $\\$100$ for simplicity). d) Calculate the long-run changes. e) Show the J-curve pattern.",
          
          "step_by_step": [
            {
              "step": "Short-run export value change",
              "explanation": "Export value = volume × price. Price unchanged, volume up 2% → export value up 2%."
            },
            {
              "step": "Short-run import value change",
              "explanation": "Import value = volume × price. Volume down 1% (0.99), price up 20% (1.20) → import value = 0.99 × 1.20 = 1.188, up 18.8%."
            },
            {
              "step": "Short-run trade balance",
              "explanation": "Initial exports = imports = $100$. New exports = $102$, new imports = $118.8$. Trade balance = $102 - 118.8 = -16.8$ (deficit of 16.8, compared to initial 0). Trade balance worsens."
            },
            {
              "step": "Long-run export value change",
              "explanation": "Export volume up 15% → export value up 15% = $115$."
            },
            {
              "step": "Long-run import value change",
              "explanation": "Import volume down 10% (0.90), price up 20% (1.20) → import value = 0.90 × 1.20 = 1.08, up 8% = $108$."
            },
            {
              "step": "Long-run trade balance",
              "explanation": "$115 - 108 = +7$ (surplus of 7, compared to initial 0). Trade balance improves."
            },
            {
              "step": "J-curve pattern",
              "explanation": "Trade balance goes from 0 to -16.8 (worsens) in short run, then to +7 (improves) in long run—a J-shaped path."
            }
          ],
          
          "final_answer": "a) +2%. b) +18.8%. c) Worsens from 0 to -16.8. d) Exports +15%, imports +8%, balance +7. e) J-curve confirmed.",
          "concept_applied": "The J-curve shows short-run worsening followed by long-run improvement after depreciation."
        },
        {
          "title": "Policy Interaction: Monetary Policy and Exchange Rates",
          
          "image": {
            "src": "images/unit11/policy_interaction_example.png",
            "alt": "AD-AS graph showing monetary policy and exchange rate effects",
            "caption": "Figure 11.4.13: Analyze how monetary policy effects are amplified by exchange rate changes."
          },
          
          "problem": "The Fed raises interest rates to fight inflation. a) What is the direct effect on domestic investment and consumption? b) What happens to capital flows and the exchange rate? c) What happens to net exports? d) Show the combined effect on aggregate demand using an AD-AS graph. e) How does the exchange rate channel amplify the policy effect? f) If the country had a fixed exchange rate, how would this change?",
          
          "step_by_step": [
            {
              "step": "Direct effect",
              "explanation": "Higher rates increase borrowing costs, reducing investment (I) and consumption of durable goods (C). AD shifts left."
            },
            {
              "step": "Capital flows and exchange rate",
              "explanation": "Higher rates attract foreign capital, increasing demand for domestic currency. Currency appreciates."
            },
            {
              "step": "Net exports effect",
              "explanation": "Appreciation makes exports more expensive and imports cheaper, reducing net exports (NX). AD shifts left further."
            },
            {
              "step": "Combined AD effect",
              "explanation": "Both channels shift AD left—domestic spending falls and net exports fall. The total shift is larger than the direct effect alone."
            },
            {
              "step": "Amplification",
              "explanation": "The exchange rate channel amplifies monetary policy. A rate hike not only slows domestic spending but also reduces net exports, providing additional contractionary impulse."
            },
            {
              "step": "Fixed exchange rate case",
              "explanation": "Under fixed rates, the central bank cannot raise rates independently if it must defend the peg. If it tried, capital inflows would force it to intervene, expanding money supply and offsetting the rate hike. Fixed rates eliminate the exchange rate channel of monetary policy."
            }
          ],
          
          "final_answer": "a) C and I fall. b) Currency appreciates. c) NX falls. d) AD shifts left more than direct effect. e) Exchange rate channel amplifies. f) Fixed rates prevent independent policy and exchange rate adjustment.",
          "concept_applied": "Monetary policy effects are amplified by exchange rate changes in floating rate systems. Fixed rates eliminate this channel."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Exchange Rate Changes",
          "description": "The currency appreciates or depreciates due to market forces or policy.",
          "mechanism": "Interest rate changes, inflation differentials, capital flows, or central bank intervention cause exchange rate movement.",
          "result": "New exchange rate.",
          
          "image": {
            "src": "images/unit11/ad_step1.png",
            "alt": "Exchange rate graph showing appreciation or depreciation",
            "caption": "Figure 11.4.14: Step 1 - Exchange rate changes (appreciation or depreciation)."
          }
        },
        {
          "step": 2,
          "process": "Relative Prices of Traded Goods Change",
          "description": "The exchange rate change alters the prices of exports and imports.",
          "mechanism": "Depreciation makes exports cheaper for foreigners and imports more expensive domestically. Appreciation has opposite effects.",
          "result": "Price changes for traded goods.",
          
          "image": {
            "src": "images/unit11/ad_step2.png",
            "alt": "Price tags on exports and imports changing",
            "caption": "Figure 11.4.15: Step 2 - Depreciation makes exports cheaper, imports more expensive. Appreciation does the opposite."
          }
        },
        {
          "step": 3,
          "process": "Quantities of Exports and Imports Adjust",
          "description": "Over time, quantities respond to price changes.",
          "mechanism": "Lower export prices increase foreign demand; higher import prices reduce domestic demand. Adjustment takes time (J-curve).",
          "result": "Export quantity up, import quantity down (depreciation).",
          
          "image": {
            "src": "images/unit11/ad_step3.png",
            "alt": "Graphs showing export quantity rising, import quantity falling over time",
            "caption": "Figure 11.4.16: Step 3 - Quantities adjust to price changes. Depreciation increases exports, reduces imports."
          }
        },
        {
          "step": 4,
          "process": "Net Exports Change",
          "description": "The combination of price and quantity changes alters net exports.",
          "mechanism": "Depreciation increases net exports (eventually). Appreciation reduces net exports. Short-run J-curve may cause initial opposite movement.",
          "result": "Net exports increase (depreciation) or decrease (appreciation).",
          
          "image": {
            "src": "images/unit11/ad_step4.png",
            "alt": "Net exports graph rising after depreciation",
            "caption": "Figure 11.4.17: Step 4 - Net exports change, with possible J-curve pattern in short run."
          }
        },
        {
          "step": 5,
          "process": "Aggregate Demand Shifts",
          "description": "The change in net exports shifts aggregate demand, affecting output and prices.",
          "mechanism": "Higher NX shifts AD right, increasing output and employment. Lower NX shifts AD left, reducing output.",
          "result": "Output and employment respond.",
          
          "image": {
            "src": "images/unit11/ad_step5.png",
            "alt": "AD-AS graph showing AD shift and output change",
            "caption": "Figure 11.4.18: Step 5 - Aggregate demand shifts, changing output and employment."
          }
        }
      ],

      "image": {
        "src": "images/unit11/exchange_rate_ad_summary.png",
        "alt": "Comprehensive summary diagram of exchange rate effects on aggregate demand: depreciation/appreciation effects, elasticities, J-curve, policy interactions",
        "caption": "Figure 11.4.19: Impact on aggregate demand summary - exchange rate channels, elasticities, J-curve, and policy interactions."
      }
    }
  ],

  "key_terms": [
    "Aggregate demand",
    "Net exports",
    "Exports",
    "Imports",
    "Trade balance",
    "Current account",
    "Exchange rate effect",
    "Depreciation effect",
    "Appreciation effect",
    "Expenditure switching",
    "Expenditure reducing",
    "Marshall-Lerner condition",
    "J-curve",
    "Elasticity of demand",
    "Price elasticity",
    "Income elasticity",
    "Pass-through",
    "Exchange rate pass-through",
    "Competitiveness",
    "Real exchange rate",
    "Nominal exchange rate",
    "Terms of trade",
    "Trade elasticity",
    "Short-run adjustment",
    "Long-run adjustment",
    "Quantity adjustment",
    "Price adjustment",
    "Contracts",
    "Lags",
    "Hysteresis",
    "Mundell-Fleming model",
    "IS-LM-BP model",
    "Open economy multiplier",
    "Floating exchange rate",
    "Fixed exchange rate",
    "Monetary policy transmission",
    "Exchange rate channel",
    "Interest rate channel",
    "Capital flows",
    "Crowding out",
    "Crowding in",
    "Beggar-thy-neighbor",
    "Currency war",
    "Competitive depreciation",
    "Cooperative adjustment",
    "G-7 coordination",
    "Plaza Accord",
    "Louvre Accord",
    "Global imbalances",
    "Savings-investment balance"
  ],

  "summary": "Exchange rate movements affect aggregate demand primarily through their impact on net exports (NX = exports - imports), a component of AD. When a currency depreciates (weakens), exports become cheaper for foreigners, increasing export quantity; imports become more expensive for domestic residents, decreasing import quantity. Both effects increase net exports, shifting the aggregate demand curve to the right, increasing real GDP and employment in the short run. When a currency appreciates (strengthens), exports become more expensive, reducing export quantity; imports become cheaper, increasing import quantity. Net exports fall, shifting AD left, reducing output and employment. The magnitude of these effects depends on the price elasticities of demand for exports and imports. More elastic demand means larger quantity responses. The Marshall-Lerner condition states that a depreciation will improve the trade balance if the sum of the absolute values of export and import elasticities exceeds one. This condition typically holds in the long run. The J-curve describes the time path of the trade balance after depreciation: it often initially worsens because prices adjust faster than quantities, then improves over time as quantities respond. This means the expansionary effects of depreciation are delayed. Exchange rate effects interact with monetary and fiscal policy. Monetary policy affects exchange rates: higher interest rates attract capital, causing appreciation, which amplifies the contractionary effect; lower rates cause depreciation, amplifying stimulus. This exchange rate channel is an important transmission mechanism. Fiscal policy can also affect exchange rates: expansionary fiscal policy may raise interest rates, attracting capital and causing appreciation, which partly offsets the direct demand stimulus (crowding out through the exchange rate). In open economies, these interactions are crucial for policy analysis. The effects also have distributional consequences: depreciation benefits exporters and industries competing with imports, hurts consumers and firms using imported inputs; appreciation has opposite effects. Understanding the impact of exchange rates on aggregate demand is essential for analyzing international trade, policy transmission, and the linkages between economies."
}
