{
  "course": "Economics",
  "topic": "Demand and Supply",
  "problems": [
    {
      "number": 1,
      "problem": "Define demand in economics.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Demand is the quantity of a good or service that consumers are willing and able to purchase at different prices over a given period."
        }
      ],
      "final_answer": "Demand is the quantity of a good consumers are willing and able to buy at different prices."
    },
    {
      "number": 2,
      "problem": "Define law of demand.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The law of demand states that, ceteris paribus, as the price of a good increases, the quantity demanded decreases, and as the price decreases, quantity demanded increases."
        }
      ],
      "final_answer": "Law of demand: price up → demand down; price down → demand up, all else equal."
    },
    {
      "number": 3,
      "problem": "List factors that shift the demand curve.",
      "image": null,
      "step_by_step": [
        {
          "step": "Factors",
          "explanation": "Income, tastes and preferences, prices of related goods (substitutes and complements), population size, and expectations about future prices can shift demand."
        }
      ],
      "final_answer": "Demand shifts due to income, preferences, related goods prices, population, and expectations."
    },
    {
      "number": 4,
      "problem": "Define supply in economics.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Supply is the quantity of a good or service that producers are willing and able to offer for sale at different prices over a given period."
        }
      ],
      "final_answer": "Supply is the quantity of a good producers are willing and able to sell at different prices."
    },
    {
      "number": 5,
      "problem": "Define law of supply.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The law of supply states that, ceteris paribus, as the price of a good increases, the quantity supplied increases, and as the price decreases, quantity supplied decreases."
        }
      ],
      "final_answer": "Law of supply: price up → supply up; price down → supply down, all else equal."
    },
    {
      "number": 6,
      "problem": "List factors that shift the supply curve.",
      "image": null,
      "step_by_step": [
        {
          "step": "Factors",
          "explanation": "Input costs, technology, taxes and subsidies, prices of related goods, expectations, and number of sellers affect supply."
        }
      ],
      "final_answer": "Supply shifts due to input costs, technology, taxes/subsidies, related goods, expectations, and number of sellers."
    },
    {
      "number": 7,
      "problem": "Define market equilibrium.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Market equilibrium occurs when quantity demanded equals quantity supplied at a particular price."
        }
      ],
      "final_answer": "Market equilibrium is when quantity demanded equals quantity supplied at a price."
    },
    {
      "number": 8,
      "problem": "Explain the effect of a price ceiling.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "A price ceiling is a legally set maximum price, which, if below equilibrium, can cause shortages as demand exceeds supply."
        }
      ],
      "final_answer": "Price ceiling below equilibrium causes shortages by increasing demand and reducing supply."
    },
    {
      "number": 9,
      "problem": "Explain the effect of a price floor.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "A price floor is a legally set minimum price, which, if above equilibrium, can cause surpluses as supply exceeds demand."
        }
      ],
      "final_answer": "Price floor above equilibrium causes surpluses by increasing supply and reducing demand."
    },
    {
      "number": 10,
      "problem": "Explain how shifts in demand and supply affect equilibrium price and quantity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analysis",
          "explanation": "An increase in demand raises equilibrium price and quantity; a decrease in demand lowers both. An increase in supply lowers price and raises quantity; a decrease in supply raises price and lowers quantity."
        }
      ],
      "final_answer": "Shifts in demand/supply change equilibrium price and quantity: demand up → price & quantity up; supply up → price down, quantity up, etc."
    }
  ]
}
