{
  "course": "Economics",
  "topic": "Demand and Supply",
  "problems": [
    {
      "number": 1,
      "problem": "Explain the 'Income Effect' as a reason why the demand curve is downward sloping.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Price Change",
          "explanation": "When the price of a good falls, the consumer's purchasing power (real income) increases."
        },
        {
          "step": "Analyze Response",
          "explanation": "With higher real income, the consumer can afford to buy more of the good, leading to an increase in quantity demanded."
        }
      ],
      "final_answer": "The income effect shows that a lower price increases a consumer's real purchasing power, encouraging higher consumption."
    },
    {
      "number": 2,
      "problem": "Distinguish between a 'Movement Along' the demand curve and a 'Shift' of the demand curve.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Movement",
          "explanation": "Caused solely by a change in the price of the good itself (Change in Quantity Demanded)."
        },
        {
          "step": "Define Shift",
          "explanation": "Caused by non-price determinants like income, tastes, or prices of other goods (Change in Demand)."
        }
      ],
      "final_answer": "Movements are caused by price changes; shifts are caused by external factors."
    },
    {
      "number": 3,
      "problem": "The price of coffee increases significantly. Analyze the impact on the demand for tea.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Relationship",
          "explanation": "Coffee and tea are substitute goods."
        },
        {
          "step": "Analyze Substitution",
          "explanation": "As coffee becomes more expensive, consumers switch to the relatively cheaper alternative, tea."
        }
      ],
      "final_answer": "The demand curve for tea will shift to the right (increase) because they are substitutes."
    },
    {
      "number": 4,
      "problem": "Explain the impact of a successful advertising campaign on the demand curve for a product.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Determinant",
          "explanation": "Advertising influences consumer tastes and preferences."
        },
        {
          "step": "Analyze Shift",
          "explanation": "Positive preferences increase demand at every price level."
        }
      ],
      "final_answer": "A successful campaign shifts the demand curve to the right."
    },
    {
      "number": 5,
      "problem": "Define an 'Inferior Good' and explain how its demand changes when consumer income rises.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Term",
          "explanation": "A good for which demand decreases as income increases (e.g., generic brands)."
        },
        {
          "step": "Analyze Income Rise",
          "explanation": "As consumers get wealthier, they stop buying inferior goods and switch to superior/normal goods."
        }
      ],
      "final_answer": "Demand for an inferior good shifts to the left when income rises."
    },
    {
      "number": 6,
      "problem": "Explain the 'Law of Supply' and why the supply curve typically slopes upward.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Profit Motive",
          "explanation": "At higher prices, firms can earn more profit per unit."
        },
        {
          "step": "Analyze Resource Allocation",
          "explanation": "Higher prices incentivize firms to allocate more resources to production and attract new firms to the market."
        }
      ],
      "final_answer": "The supply curve slopes upward because higher prices provide a greater profit incentive for producers."
    },
    {
      "number": 7,
      "problem": "Analyze the impact of an increase in the wages of factory workers on the supply of cars.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Cost Change",
          "explanation": "Wages are a primary cost of production (Labor)."
        },
        {
          "step": "Analyze Profitability",
          "explanation": "Higher costs reduce the profit margin at every price level."
        }
      ],
      "final_answer": "The supply curve for cars will shift to the left (decrease) due to higher production costs."
    },
    {
      "number": 8,
      "problem": "How does an improvement in production technology affect the supply curve?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Efficiency",
          "explanation": "Technology allows more output to be produced with the same or fewer resources."
        },
        {
          "step": "Connect to Costs",
          "explanation": "This lowers the unit cost of production."
        }
      ],
      "final_answer": "Improved technology shifts the supply curve to the right (increase)."
    },
    {
      "number": 9,
      "problem": "Explain the concept of 'Market Equilibrium'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Condition",
          "explanation": "It occurs at the price where Quantity Demanded (QD) equals Quantity Supplied (QS)."
        }
      ],
      "final_answer": "Market equilibrium is the point where the plans of buyers and sellers match, resulting in no tendency for price to change."
    },
    {
      "number": 10,
      "problem": "A market is in 'Surplus'. Describe the relationship between Quantity Demanded and Quantity Supplied and how the market will correct itself.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Condition",
          "explanation": "Surplus occurs when QS > QD at the current price."
        },
        {
          "step": "Analyze Correction",
          "explanation": "Producers have unsold stock and will lower prices to clear inventory. As price falls, QD rises and QS falls until they are equal."
        }
      ],
      "final_answer": "In a surplus, QS > QD; the price must fall to restore equilibrium."
    },
    {
      "number": 11,
      "problem": "Analyze the effect of a simultaneous increase in demand and a decrease in supply on the equilibrium price.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Demand Increase",
          "explanation": "Pushes price up and quantity up."
        },
        {
          "step": "Analyze Supply Decrease",
          "explanation": "Pushes price up and quantity down."
        }
      ],
      "final_answer": "The equilibrium price will definitely rise, while the change in equilibrium quantity is indeterminate (depends on the size of the shifts)."
    },
    {
      "number": 12,
      "problem": "Define 'Complementary Goods' and explain the effect on the demand for printers if the price of ink cartridges rises.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Relationship",
          "explanation": "Complements are goods used together."
        },
        {
          "step": "Analyze Price Change",
          "explanation": "Higher ink prices make using a printer more expensive overall."
        }
      ],
      "final_answer": "The demand for printers will shift to the left (decrease) because their complement became more expensive."
    },
    {
      "number": 13,
      "problem": "Explain the impact of a government subsidy on the supply of solar panels.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Subsidy Effect",
          "explanation": "A subsidy effectively reduces the firm's costs of production."
        }
      ],
      "final_answer": "A subsidy shifts the supply curve to the right (increase)."
    },
    {
      "number": 14,
      "problem": "Why does a 'Shortage' put upward pressure on prices?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Condition",
          "explanation": "Shortage occurs when QD > QS (excess demand)."
        },
        {
          "step": "Analyze Behavior",
          "explanation": "Buyers compete for limited goods by bidding up the price."
        }
      ],
      "final_answer": "In a shortage, buyers are willing to pay more to secure the good, driving the price toward equilibrium."
    },
    {
      "number": 15,
      "problem": "Contrast 'Joint Supply' and 'Competitive Supply'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Joint Supply",
          "explanation": "Production of one good automatically produces another (e.g., beef and leather)."
        },
        {
          "step": "Competitive Supply",
          "explanation": "A firm uses the same resources to produce different goods; increasing one means decreasing the other (e.g., wheat vs. barley on the same land)."
        }
      ],
      "final_answer": "Joint supply products are created together; competitive supply products compete for the same resources."
    },
    {
      "number": 16,
      "problem": "Explain how an increase in the number of firms in an industry affects the market supply curve.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Determinant",
          "explanation": "The number of sellers is a non-price determinant of supply."
        }
      ],
      "final_answer": "More firms in the industry shift the market supply curve to the right."
    },
    {
      "number": 17,
      "problem": "Predict the change in equilibrium price and quantity of electric cars if gas prices rise and battery technology improves simultaneously.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Demand",
          "explanation": "Gas price rise increases demand for electric cars (substitute)."
        },
        {
          "step": "Analyze Supply",
          "explanation": "Better battery tech increases supply."
        }
      ],
      "final_answer": "Equilibrium quantity will definitely increase; the effect on price is indeterminate."
    },
    {
      "number": 18,
      "problem": "What is the 'Substitution Effect' regarding the downward slope of the demand curve?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Relative Price",
          "explanation": "When the price of Good A falls, it becomes relatively cheaper compared to other goods."
        },
        {
          "step": "Analyze Behavior",
          "explanation": "Consumers substitute the now-cheaper Good A for other more expensive alternatives."
        }
      ],
      "final_answer": "The substitution effect occurs when consumers switch to a good that has become relatively cheaper."
    },
    {
      "number": 19,
      "problem": "How does an 'Ad Valorem Tax' affect the supply curve differently than a 'Specific Tax'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Specific Tax",
          "explanation": "A fixed amount per unit; causes a parallel shift of the supply curve."
        },
        {
          "step": "Ad Valorem Tax",
          "explanation": "A percentage of the price; causes a pivotal shift (the gap widens as price increases)."
        }
      ],
      "final_answer": "Specific taxes shift the curve in a parallel way; Ad Valorem taxes cause the curve to become steeper."
    },
    {
      "number": 20,
      "problem": "Explain why a 'Maximum Price' (Price Ceiling) set below equilibrium creates a chronic shortage.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze QD",
          "explanation": "Lower prices encourage more consumers to buy (high QD)."
        },
        {
          "step": "Analyze QS",
          "explanation": "Lower prices discourage producers from supplying (low QS)."
        }
      ],
      "final_answer": "Because the price cannot rise to clear the market, the gap between high demand and low supply remains permanently."
    }
  ]
}
