{
  "course": "Economics",
  "topic": "Elasticity",
  "problems": [
    {
      "number": 1,
      "problem": "A 10% increase in the price of a luxury watch leads to a 25% decrease in quantity demanded. Calculate the Price Elasticity of Demand (PED) and state whether it is elastic or inelastic.",
      "image": null,
      "step_by_step": [
        {
          "step": "Apply Formula",
          "explanation": "PED = % Change in Quantity Demanded / % Change in Price."
        },
        {
          "step": "Calculate",
          "explanation": "-25% / +10% = -2.5."
        }
      ],
      "final_answer": "The PED is 2.5 (absolute value). Since it is greater than 1, the demand is elastic."
    },
    {
      "number": 2,
      "problem": "Explain why the demand for addictive goods like cigarettes tends to be price inelastic.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Substitutes",
          "explanation": "Addictive goods often have few close substitutes that satisfy the same craving."
        },
        {
          "step": "Analyze Necessity",
          "explanation": "For an addicted consumer, the good becomes a 'necessity' rather than a choice, making them less sensitive to price changes."
        }
      ],
      "final_answer": "Lack of substitutes and the nature of addiction make consumers less responsive to price increases, resulting in inelastic demand."
    },
    {
      "number": 3,
      "problem": "Using the 'Total Revenue Test,' explain what happens to a firm's revenue if they raise prices for a product with elastic demand.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Revenue",
          "explanation": "Total Revenue (TR) = Price (P) × Quantity (Q)."
        },
        {
          "step": "Analyze Elastic Demand",
          "explanation": "If demand is elastic, a 10% price rise causes a >10% drop in quantity."
        }
      ],
      "final_answer": "Total revenue will fall because the percentage decrease in quantity demanded is greater than the percentage increase in price."
    },
    {
      "number": 4,
      "problem": "Identify three factors that determine the Price Elasticity of Demand for a good.",
      "image": null,
      "step_by_step": [
        {
          "step": "List Factors",
          "explanation": "1. Availability of close substitutes. 2. Proportion of income spent on the good. 3. Time period (short run vs. long run)."
        }
      ],
      "final_answer": "Substitutes, income share, and time are the primary determinants of PED."
    },
    {
      "number": 5,
      "problem": "A consumer's income rises by 5%, and their demand for instant noodles falls by 10%. Calculate the Income Elasticity of Demand (YED) and classify the good.",
      "image": null,
      "step_by_step": [
        {
          "step": "Apply Formula",
          "explanation": "YED = % Change in Quantity Demanded / % Change in Income."
        },
        {
          "step": "Calculate",
          "explanation": "-10% / +5% = -2.0."
        }
      ],
      "final_answer": "The YED is -2.0. Since the value is negative, the good is an 'Inferior Good'."
    },
    {
      "number": 6,
      "problem": "Explain the difference between a 'Normal Good' and a 'Luxury Good' in terms of YED values.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Normal Goods",
          "explanation": "Normal goods have a positive YED (between 0 and 1). Demand grows slower than income."
        },
        {
          "step": "Analyze Luxury Goods",
          "explanation": "Luxury goods have a YED greater than 1. Demand grows faster than income."
        }
      ],
      "final_answer": "Normal goods are income-inelastic (0 < YED < 1), while luxury goods are income-elastic (YED > 1)."
    },
    {
      "number": 7,
      "problem": "The price of Good X rises by 20%, causing the demand for Good Y to rise by 30%. Calculate the Cross-Price Elasticity (XED) and identify the relationship between the goods.",
      "image": null,
      "step_by_step": [
        {
          "step": "Apply Formula",
          "explanation": "XED = % Change in QD of Good Y / % Change in Price of Good X."
        },
        {
          "step": "Calculate",
          "explanation": "+30% / +20% = +1.5."
        }
      ],
      "final_answer": "The XED is +1.5. Since it is positive, Goods X and Y are 'Substitutes'."
    },
    {
      "number": 8,
      "problem": "If the XED between two goods is -0.8, how will a decrease in the price of one affect the demand for the other?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Relationship",
          "explanation": "A negative XED indicates the goods are complements (used together)."
        },
        {
          "step": "Analyze Direction",
          "explanation": "If the price of one complement falls, people buy more of it, which increases demand for the other complement."
        }
      ],
      "final_answer": "The demand for the second good will increase (shift right)."
    },
    {
      "number": 9,
      "problem": "Explain why the Price Elasticity of Supply (PES) is usually higher in the long run than in the short run.",
      "image": null,
      "step_by_step": [
        {
          "step": "Short Run Constraints",
          "explanation": "In the short run, at least one factor of production (like factory size) is fixed."
        },
        {
          "step": "Long Run Flexibility",
          "explanation": "In the long run, firms can expand factories, hire more skilled labor, and new firms can enter the market."
        }
      ],
      "final_answer": "PES increases over time as producers gain the flexibility to adjust all factors of production."
    },
    {
      "number": 10,
      "problem": "Identify and explain two factors that make the supply of a product 'Inelastic'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Factor 1: Perishability",
          "explanation": "Fresh fruit cannot be stored easily; if prices fall, producers can't hold back stock, making supply inelastic."
        },
        {
          "step": "Factor 2: Capacity Constraints",
          "explanation": "If a factory is already running 24/7, it cannot produce more even if prices rise significantly."
        }
      ],
      "final_answer": "Perishability and lack of spare capacity are key reasons for inelastic supply."
    },
    {
      "number": 11,
      "problem": "Analyze the impact of 'Spare Capacity' on a firm's Price Elasticity of Supply.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Spare Capacity",
          "explanation": "This refers to unused resources (idle machines or workers) that can be quickly put to use."
        }
      ],
      "final_answer": "High spare capacity makes supply elastic because the firm can increase output rapidly in response to a price increase."
    },
    {
      "number": 12,
      "problem": "Why is the PED for salt very low (inelastic)?",
      "image": null,
      "step_by_step": [
        {
          "step": "Substitute Factor",
          "explanation": "There are no close substitutes for salt as a basic seasoning/preservative."
        },
        {
          "step": "Income Share Factor",
          "explanation": "Salt is very cheap, so a price doubling has a negligible effect on a household's total budget."
        }
      ],
      "final_answer": "Salt has low PED because it is a cheap necessity with no substitutes."
    },
    {
      "number": 13,
      "problem": "A company sells software with a PED of 0.4. If they want to increase total revenue, should they raise or lower their prices?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Elasticity",
          "explanation": "0.4 is less than 1, meaning demand is inelastic."
        },
        {
          "step": "Apply Revenue Rule",
          "explanation": "For inelastic goods, price and total revenue move in the same direction."
        }
      ],
      "final_answer": "They should raise prices. The gain from the higher price will outweigh the small loss in quantity sold."
    },
    {
      "number": 14,
      "problem": "Explain the concept of 'Unitary Elasticity' of demand.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Term",
          "explanation": "Unitary elasticity occurs when PED = 1."
        },
        {
          "step": "Analyze Revenue",
          "explanation": "The percentage change in price is exactly offset by the percentage change in quantity demanded."
        }
      ],
      "final_answer": "In unitary elasticity, total revenue remains constant regardless of price changes."
    },
    {
      "number": 15,
      "problem": "How does 'Brand Loyalty' affect the Price Elasticity of Demand for a product?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Consumer Behavior",
          "explanation": "Loyal customers perceive no close substitutes for their preferred brand."
        }
      ],
      "final_answer": "Strong brand loyalty makes demand more price-inelastic, allowing firms to raise prices without losing many customers."
    },
    {
      "number": 16,
      "problem": "A new high-speed rail link makes it much easier for workers to commute. How does this affect the PES of labor in that region?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Mobility",
          "explanation": "Better transport increases the geographical mobility of labor."
        }
      ],
      "final_answer": "The PES of labor becomes more elastic because workers can respond more quickly to wage increases in that area."
    },
    {
      "number": 17,
      "problem": "Contrast the XED of McDonald's burgers vs. Burger King burgers with the XED of burgers vs. burger buns.",
      "image": null,
      "step_by_step": [
        {
          "step": "Case 1: Substitutes",
          "explanation": "McDonald's and Burger King are close substitutes (High positive XED)."
        },
        {
          "step": "Case 2: Complements",
          "explanation": "Burgers and buns are used together (Negative XED)."
        }
      ],
      "final_answer": "Burgers and BK burgers have a high positive XED; burgers and buns have a negative XED."
    },
    {
      "number": 18,
      "problem": "Explain how the 'Definition of the Market' affects PED. (Example: Fruit vs. Bananas).",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Broad Category",
          "explanation": "Broad categories like 'Fruit' have few substitutes, so demand is inelastic."
        },
        {
          "step": "Analyze Specific Good",
          "explanation": "Specific types like 'Bananas' have many substitutes (apples, pears), so demand is more elastic."
        }
      ],
      "final_answer": "The more narrowly a good is defined, the higher its PED because more substitutes are available."
    },
    {
      "number": 19,
      "problem": "Why might a government choose to tax goods with inelastic demand (like fuel or alcohol)?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Tax Revenue",
          "explanation": "Since quantity doesn't drop much when price (including tax) rises, tax revenue is maximized."
        },
        {
          "step": "Analyze Social Impact",
          "explanation": "These taxes (Excise duties) are reliable sources of income for governments."
        }
      ],
      "final_answer": "Taxing inelastic goods ensures high tax revenue with minimal 'deadweight loss' (market disruption)."
    },
    {
      "number": 20,
      "problem": "If the YED for 'Public Transport' is -0.5, what will happen during an economic recession where incomes fall?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Good Type",
          "explanation": "Negative YED means it is an inferior good."
        },
        {
          "step": "Analyze Recession",
          "explanation": "As incomes fall, people switch from expensive private cars to cheaper public transport."
        }
      ],
      "final_answer": "The demand for public transport will increase during the recession."
    }
  ]
}
