{
  "course": "Economics",
  "topic": "Employment & Inflation",
  "problems": [
    {
      "number": 1,
      "problem": "Define 'Inflation' and explain how it differs from a 'Price Hike' for a single good.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Inflation is a sustained increase in the general price level of an economy over a period of time."
        }
      ],
      "final_answer": "Inflation refers to the average price level of all goods, whereas a price hike is an increase in the cost of one specific item."
    },
    {
      "number": 2,
      "problem": "Explain the methodology of the Consumer Price Index (CPI).",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify the Basket",
          "explanation": "Economists select a 'representative basket' of goods and services typically bought by an average household."
        },
        {
          "step": "Weighting",
          "explanation": "Items are 'weighted' based on the proportion of income spent on them (e.g., housing has a higher weight than salt)."
        }
      ],
      "final_answer": "CPI tracks the cost of a weighted basket of goods over time to measure the rate of inflation."
    },
    {
      "number": 3,
      "problem": "Distinguish between 'Demand-Pull' and 'Cost-Push' inflation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Demand-Pull",
          "explanation": "Occurs when total demand (AD) grows faster than the economy's ability to produce (too much money chasing too few goods)."
        },
        {
          "step": "Cost-Push",
          "explanation": "Occurs when production costs (wages, raw materials) rise, forcing firms to increase prices to maintain profit."
        }
      ],
      "final_answer": "Demand-pull is driven by buyers; cost-push is driven by producers' rising expenses."
    },
    {
      "number": 4,
      "problem": "Define 'Deflation' and explain why it can be dangerous for an economy.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Deflation is a sustained decrease in the general price level (negative inflation)."
        },
        {
          "step": "Analyze Behavior",
          "explanation": "Consumers delay purchases expecting lower prices in the future, which leads to a collapse in demand and production."
        }
      ],
      "final_answer": "Deflation is dangerous because it can lead to a 'deflationary spiral' of falling demand and rising unemployment."
    },
    {
      "number": 5,
      "problem": "Identify the four main types of unemployment.",
      "image": null,
      "step_by_step": [
        {
          "step": "List Types",
          "explanation": "1. Frictional (between jobs). 2. Structural (skills mismatch). 3. Cyclical (recession-based). 4. Seasonal (weather/holiday based)."
        }
      ],
      "final_answer": "The types are Frictional, Structural, Cyclical, and Seasonal unemployment."
    },
    {
      "number": 6,
      "problem": "Explain 'Structural Unemployment' and provide a real-world example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Cause",
          "explanation": "Occurs when there is a long-term decline in an industry or a mismatch between worker skills and available jobs."
        }
      ],
      "final_answer": "Example: Coal miners becoming unemployed because the economy has shifted toward renewable energy, but they lack the training for tech jobs."
    },
    {
      "number": 7,
      "problem": "Calculate the Unemployment Rate if a country has 90 million employed people, 10 million unemployed people looking for work, and 50 million people not in the labor force.",
      "image": null,
      "step_by_step": [
        {
          "step": "Find Labor Force",
          "explanation": "Labor Force = Employed + Unemployed (90m + 10m = 100m)."
        },
        {
          "step": "Calculate Rate",
          "explanation": "(Unemployed / Labor Force) × 100 = (10 / 100) × 100."
        }
      ],
      "final_answer": "The unemployment rate is 10%."
    },
    {
      "number": 8,
      "problem": "What is the 'Natural Rate of Unemployment'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Components",
          "explanation": "The sum of frictional and structural unemployment that exists even when the labor market is in equilibrium."
        }
      ],
      "final_answer": "The natural rate is the level of unemployment consistent with a stable inflation rate, where cyclical unemployment is zero."
    },
    {
      "number": 9,
      "problem": "Analyze the impact of 'Menu Costs' on a firm during high inflation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The physical and administrative costs of changing prices (e.g., reprinting catalogs or updating software)."
        }
      ],
      "final_answer": "High inflation forces firms to incur menu costs frequently, which reduces overall efficiency."
    },
    {
      "number": 10,
      "problem": "Who benefits from unanticipated inflation: a borrower with a fixed-rate loan or the bank that issued the loan?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Money Value",
          "explanation": "Inflation reduces the 'real value' of money."
        }
      ],
      "final_answer": "The borrower benefits because they repay the loan with money that has less purchasing power than when they borrowed it."
    },
    {
      "number": 11,
      "problem": "Describe the 'Shoeleather Costs' of inflation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Opportunity Cost",
          "explanation": "People spend more time and effort running to the bank to move money into interest-bearing accounts to avoid losing value to inflation."
        }
      ],
      "final_answer": "Shoeleather costs refer to the time and resources wasted when people try to minimize their holdings of cash during high inflation."
    },
    {
      "number": 12,
      "problem": "Explain the concept of 'Disinflation'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Clarify Term",
          "explanation": "A reduction in the *rate* of inflation (e.g., prices rise by 5% last year but only 2% this year)."
        }
      ],
      "final_answer": "Disinflation means prices are still rising, but at a slower pace than before."
    },
    {
      "number": 13,
      "problem": "Explain how 'Cyclical Unemployment' is related to the business cycle.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Recession",
          "explanation": "During a recession, Aggregate Demand falls."
        },
        {
          "step": "Connect to Labor",
          "explanation": "Firms produce less output and therefore require fewer workers, leading to layoffs."
        }
      ],
      "final_answer": "Cyclical unemployment rises during economic downturns and falls during periods of growth."
    },
    {
      "number": 14,
      "problem": "What is 'Underemployment'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Condition",
          "explanation": "When workers are employed in jobs that are below their skill level or are working fewer hours than they desire."
        }
      ],
      "final_answer": "Underemployment indicates that an economy is not fully utilizing its labor resources, even if the unemployment rate looks low."
    },
    {
      "number": 15,
      "problem": "Analyze the trade-off shown by the 'Short-Run Phillips Curve'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Relationship",
          "explanation": "The curve suggests an inverse relationship between inflation and unemployment."
        }
      ],
      "final_answer": "In the short run, policies that reduce unemployment (like increasing AD) often lead to higher inflation."
    },
    {
      "number": 16,
      "problem": "How does 'Hyperinflation' destroy the functions of money?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Store of Value",
          "explanation": "Money loses value so quickly that people refuse to hold it."
        },
        {
          "step": "Identify Medium of Exchange",
          "explanation": "People may revert to bartering because the currency is no longer trusted."
        }
      ],
      "final_answer": "Hyperinflation renders money useless as a store of value and a medium of exchange, often leading to economic collapse."
    },
    {
      "number": 17,
      "problem": "Define 'Stagflation'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Combined Issues",
          "explanation": "A situation where the economy faces stagnant growth (high unemployment) and high inflation simultaneously."
        }
      ],
      "final_answer": "Stagflation is particularly difficult to solve because fixing one problem (inflation) usually worsens the other (unemployment)."
    },
    {
      "number": 18,
      "problem": "Explain why 'Frictional Unemployment' is often considered 'healthy' for an economy.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Labor Flow",
          "explanation": "It represents people looking for jobs that better match their skills."
        }
      ],
      "final_answer": "Some frictional unemployment shows that workers have the freedom to move and that the labor market is dynamic."
    },
    {
      "number": 19,
      "problem": "Analyze the impact of a high 'Real Interest Rate' on inflation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Connect to Spending",
          "explanation": "High real rates make borrowing expensive and saving attractive."
        }
      ],
      "final_answer": "High real interest rates reduce Aggregate Demand, which helps to lower demand-pull inflation."
    },
    {
      "number": 20,
      "problem": "Why might a government prefer a low, stable rate of inflation (e.g., 2%) over zero inflation?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Safety Margin",
          "explanation": "It provides a 'buffer' against the risk of deflation."
        },
        {
          "step": "Wage Flexibility",
          "explanation": "It allows real wages to adjust more easily without firms having to cut nominal wages."
        }
      ],
      "final_answer": "Low inflation encourages spending and investment while providing a safety net against economic contraction."
    }
  ]
}
