{
  "course": "Economics",
  "topic": "Government Intervention and Market Failure",
  "problems": [
    {
      "number": 1,
      "problem": "Define 'Market Failure' and identify the three main types.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Market failure occurs when the price mechanism fails to allocate scarce resources efficiently or equitably."
        }
      ],
      "final_answer": "The three main types are externalities, public goods, and information gaps."
    },
    {
      "number": 2,
      "problem": "Explain the difference between 'Private Cost' and 'Social Cost' using a chemical factory as an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Private Cost",
          "explanation": "The internal costs of production paid by the firm (wages, raw materials, electricity)."
        },
        {
          "step": "Define External Cost",
          "explanation": "The cost to third parties not involved in the transaction (pollution causing health issues in the local town)."
        }
      ],
      "final_answer": "Social Cost = Private Cost + External Cost. In this case, it includes both factory expenses and the health costs of pollution."
    },
    {
      "number": 3,
      "problem": "What are the two defining characteristics of a 'Public Good'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Non-excludability",
          "explanation": "It is impossible to prevent someone from using the good once it is provided (e.g., a lighthouse)."
        },
        {
          "step": "Non-rivalry",
          "explanation": "One person's consumption of the good does not reduce the amount available for others (e.g., national defense)."
        }
      ],
      "final_answer": "Public goods are non-excludable and non-rivalrous."
    },
    {
      "number": 4,
      "problem": "Explain the 'Free Rider Problem'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Incentives",
          "explanation": "Because public goods are non-excludable, individuals have no incentive to pay for them, hoping others will cover the cost."
        }
      ],
      "final_answer": "If everyone tries to 'free ride,' the market provides zero units of the good, leading to market failure."
    },
    {
      "number": 5,
      "problem": "Analyze why 'Education' is considered a 'Merit Good'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Benefits",
          "explanation": "Education provides private benefits (higher wages) but also positive externalities (more productive workforce, lower crime rates)."
        },
        {
          "step": "Analyze Consumption",
          "explanation": "Individuals often undervalue these long-term benefits and would under-consume education in a pure market."
        }
      ],
      "final_answer": "Education is a merit good because its social benefits exceed its private benefits, leading to under-consumption."
    },
    {
      "number": 6,
      "problem": "Contrast 'Merit Goods' with 'Demerit Goods'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Merit Goods",
          "explanation": "Goods that are better for people than they realize (e.g., vaccines) and are under-consumed."
        },
        {
          "step": "Demerit Goods",
          "explanation": "Goods that are worse for people than they realize (e.g., junk food) and are over-consumed."
        }
      ],
      "final_answer": "Merit goods have positive externalities; demerit goods have negative externalities."
    },
    {
      "number": 7,
      "problem": "Explain how a 'Pigouvian Tax' (carbon tax) corrects a negative externality.",
      "image": null,
      "step_by_step": [
        {
          "step": "Internalize the Externality",
          "explanation": "The tax increases the private cost of the firm to equal the social cost."
        },
        {
          "step": "Analyze Market Response",
          "explanation": "The higher cost shifts the supply curve left, reducing the quantity produced to the socially optimal level."
        }
      ],
      "final_answer": "A carbon tax forces firms to pay for the damage they cause, correcting the over-allocation of resources."
    },
    {
      "number": 8,
      "problem": "What is 'Asymmetric Information'? Provide an example from the insurance market.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "When one party in a transaction has more or better information than the other."
        }
      ],
      "final_answer": "Example: A person buying health insurance knows more about their own lifestyle and health risks than the insurance company (Adverse Selection)."
    },
    {
      "number": 9,
      "problem": "Explain the concept of 'Moral Hazard'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Change in Behavior",
          "explanation": "When an individual is protected from risk, they may behave more recklessly."
        }
      ],
      "final_answer": "Example: A person with full car insurance might drive less carefully because they know the insurer will pay for damages."
    },
    {
      "number": 10,
      "problem": "Describe 'Government Failure' and provide one reason why it occurs.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "When government intervention to fix a market failure results in a less efficient allocation of resources."
        },
        {
          "step": "Reason: Unintended Consequences",
          "explanation": "For example, a high tax on cigarettes might lead to an increase in black market smuggling."
        }
      ],
      "final_answer": "Government failure occurs when the 'cure' is worse than the 'disease' due to poor information or political pressure."
    },
    {
      "number": 11,
      "problem": "Analyze the impact of 'Tragedy of the Commons' on a public fishing lake.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Incentive",
          "explanation": "The lake is a common resource (non-excludable but rivalrous). Each fisherman wants to catch as many fish as possible."
        }
      ],
      "final_answer": "Without regulation, the lake will be overfished and the resource depleted because no one owns it and everyone exploits it."
    },
    {
      "number": 12,
      "problem": "How does a 'Subsidy' correct a positive externality?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Cost",
          "explanation": "A subsidy lowers the private cost of production or consumption."
        }
      ],
      "final_answer": "The subsidy shifts the supply/demand curve to increase the quantity toward the socially optimal level where marginal social benefit equals marginal social cost."
    },
    {
      "number": 13,
      "problem": "Identify the difference between 'Direct Provision' and 'Legislation' as government interventions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Direct Provision",
          "explanation": "The government supplies the good itself (e.g., public parks, fire departments)."
        },
        {
          "step": "Legislation",
          "explanation": "The government makes laws to control behavior (e.g., banning smoking in public or mandating seatbelts)."
        }
      ],
      "final_answer": "Provision is about supply; Legislation is about regulation."
    },
    {
      "number": 14,
      "problem": "Explain how 'Tradable Pollution Permits' work.",
      "image": null,
      "step_by_step": [
        {
          "step": "Set a Cap",
          "explanation": "The government sets a limit on total pollution and issues permits to firms."
        },
        {
          "step": "Market Mechanism",
          "explanation": "Firms that reduce pollution easily can sell their extra permits to firms that find it expensive to reduce pollution."
        }
      ],
      "final_answer": "Permits create a market-based incentive for firms to reduce emissions efficiently."
    },
    {
      "number": 15,
      "problem": "Why is 'Monopoly Power' considered a form of market failure?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Outcome",
          "explanation": "Monopolies restrict output and charge higher prices than a competitive market."
        }
      ],
      "final_answer": "This leads to a loss of consumer surplus and 'deadweight loss,' meaning resources are not allocated to their highest-valued use."
    },
    {
      "number": 16,
      "problem": "What are 'Common Access Resources'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Traits",
          "explanation": "Resources that are rivalrous (one person's use depletes it) but non-excludable (anyone can use them)."
        }
      ],
      "final_answer": "Examples include clean air, oceans, and public forests."
    },
    {
      "number": 17,
      "problem": "Explain 'Regulatory Capture'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Players",
          "explanation": "When a government agency created to regulate an industry ends up being influenced by the firms it is supposed to control."
        }
      ],
      "final_answer": "Regulatory capture leads to policies that favor big corporations over the general public interest."
    },
    {
      "number": 18,
      "problem": "Contrast 'Quasi-Public Goods' with pure 'Public Goods'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Quas-Public",
          "explanation": "Goods that have some but not all traits of public goods (e.g., a toll road is excludable but can be non-rivalrous until it gets congested)."
        }
      ],
      "final_answer": "Quasi-public goods are 'partially' public, often becoming excludable or rivalrous under certain conditions."
    },
    {
      "number": 19,
      "problem": "How does 'Advertising' by a government for healthy eating help correct a market failure?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify the Gap",
          "explanation": "The failure here is an 'information gap'—people don't know the full benefits of a healthy diet."
        }
      ],
      "final_answer": "Government information campaigns help bridge the information gap, moving consumption toward the socially optimal level."
    },
    {
      "number": 20,
      "problem": "What is 'Deadweight Loss'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Efficiency",
          "explanation": "The loss of economic efficiency that occurs when equilibrium for a good or service is not achieved."
        }
      ],
      "final_answer": "It represents the potential gains from trade that are 'lost' to society due to taxes, monopolies, or externalities."
    }
  ]
}
