{
  "course": "Economics",
  "topic": "Introduction & Basic Concepts",
  "problems": [
    {
      "number": 1,
      "problem": "A baker has a fixed amount of flour. If they use it to bake bread, they cannot bake cakes. Explain how this scenario illustrates the 'Fundamental Economic Problem'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Scarcity",
          "explanation": "The flour is a finite resource (scarcity) while the potential uses (bread and cakes) exceed the available supply."
        },
        {
          "step": "Analyze Choice",
          "explanation": "Because the resource is scarce, the baker must make a choice, which is the core of the economic problem."
        }
      ],
      "final_answer": "The scenario illustrates the fundamental economic problem of scarcity, which necessitates making choices among competing uses for limited resources."
    },
    {
      "number": 2,
      "problem": "Classify 'High-speed Internet' as either a need or a want for a modern software developer versus a subsistence farmer.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Context",
          "explanation": "Needs are essentials for survival or primary livelihood; wants are desires that increase satisfaction but are not essential."
        },
        {
          "step": "Differentiate",
          "explanation": "For the developer, it is a 'need' as it is essential for their income. For the subsistence farmer, it is a 'want' as it is not required for their primary survival tasks."
        }
      ],
      "final_answer": "Needs and wants are subjective and contextual; what is a want for one person may be a functional need for another's livelihood."
    },
    {
      "number": 3,
      "problem": "Identify the four factors of production used in a car manufacturing plant.",
      "image": null,
      "step_by_step": [
        {
          "step": "List Factors",
          "explanation": "Land (factory site), Labor (assembly workers), Capital (robotic arms/machinery), and Entrepreneurship (the CEO/Founder taking the risk)."
        }
      ],
      "final_answer": "Land: Factory site; Labor: Workers; Capital: Machines; Entrepreneurship: Management/Ownership."
    },
    {
      "number": 4,
      "problem": "An entrepreneur decides to spend $100,000 to upgrade machinery instead of hiring 3 new employees. What is the opportunity cost?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify the Choice",
          "explanation": "The choice made was the machinery upgrade."
        },
        {
          "step": "Determine the Next Best Alternative",
          "explanation": "The next best alternative sacrificed was the hiring of the 3 employees."
        }
      ],
      "final_answer": "The opportunity cost is the output and value that the three new employees would have generated for the business."
    },
    {
      "number": 5,
      "problem": "A command economy and a market economy both face the question: 'For whom to produce?' Contrast how they solve this.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Market Approach",
          "explanation": "In a market economy, goods go to those who have the purchasing power (income) to buy them."
        },
        {
          "step": "Analyze Command Approach",
          "explanation": "In a command economy, the government decides distribution based on perceived social goals or equality."
        }
      ],
      "final_answer": "Market economies use price/income to determine distribution; command economies use government planning and quotas."
    },
    {
      "number": 6,
      "problem": "Why is a 'Mixed Economy' considered more realistic than a pure 'Market Economy'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Market Failure",
          "explanation": "Pure markets may fail to provide public goods (like roads) or protect the environment."
        },
        {
          "step": "Identify Government Role",
          "explanation": "Governments intervene to provide safety nets and regulation while allowing private enterprise."
        }
      ],
      "final_answer": "Pure market economies do not exist in reality because all modern nations require some level of government regulation and public good provision."
    },
    {
      "number": 7,
      "problem": "Determine if the following is a Microeconomic or Macroeconomic issue: 'The impact of a nationwide increase in the sales tax on the country's GDP.'",
      "image": null,
      "step_by_step": [
        {
          "step": "Check Scale",
          "explanation": "The issue involves nationwide policy and an aggregate indicator (GDP)."
        }
      ],
      "final_answer": "Macroeconomics, because it deals with an economy-wide aggregate variable (GDP) and national fiscal policy."
    },
    {
      "number": 8,
      "problem": "Identify the normative element in this statement: 'The unemployment rate is 5%, which is too high for a healthy society.'",
      "image": null,
      "step_by_step": [
        {
          "step": "Separate Fact from Value",
          "explanation": "'Unemployment is 5%' is a positive fact. 'Too high for a healthy society' is a value judgment."
        }
      ],
      "final_answer": "The normative element is the phrase 'too high,' as it expresses an opinion on what the rate 'should' be."
    },
    {
      "number": 9,
      "problem": "Explain the role of the 'Ceteris Paribus' assumption in economic modeling.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Term",
          "explanation": "It means 'all other things held constant'."
        },
        {
          "step": "Explain Purpose",
          "explanation": "It allows economists to isolate the relationship between two variables (like price and demand) without interference from others."
        }
      ],
      "final_answer": "Ceteris paribus simplifies complex reality by allowing the study of one variable's effect at a time."
    },
    {
      "number": 10,
      "problem": "In the circular flow of income, what do households provide to firms, and what do they receive in return in the resource market?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Households' Role",
          "explanation": "Households provide the factors of production (Land, Labor, Capital)."
        },
        {
          "step": "Identify Firms' Payment",
          "explanation": "Firms provide factor payments (Wages, Rent, Interest, Profit)."
        }
      ],
      "final_answer": "Households provide resources; firms provide income (factor payments)."
    },
    {
      "number": 11,
      "problem": "Explain how 'Entrepreneurship' differs from 'Labor' as a factor of production.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Labor",
          "explanation": "Labor is the physical and mental effort of workers."
        },
        {
          "step": "Define Entrepreneurship",
          "explanation": "Entrepreneurship is the ability to organize the other three factors and take risks to innovate."
        }
      ],
      "final_answer": "Labor earns wages for effort; Entrepreneurship earns profit for risk-taking and organization."
    },
    {
      "number": 12,
      "problem": "A government decides to provide free healthcare. Is this a solution to the problem of scarcity? Explain.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Scarcity",
          "explanation": "Scarcity means resources are limited. 'Free' refers only to the price, not the availability of resources."
        },
        {
          "step": "Analyze Resource Use",
          "explanation": "Doctors and medicine are still limited and must be diverted from other uses."
        }
      ],
      "final_answer": "No. Making a service 'free' at the point of use changes the distribution, but the resources used remain scarce."
    },
    {
      "number": 13,
      "problem": "How does a 'Command Economy' answer the question: 'How to produce?'",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Decision Maker",
          "explanation": "A central planning authority or government agency."
        },
        {
          "step": "Identify Method",
          "explanation": "They issue directives on techniques, labor use, and resource allocation rather than following profit motives."
        }
      ],
      "final_answer": "The government determines the production methods and resource mix through central planning."
    },
    {
      "number": 14,
      "problem": "Give a positive economic statement regarding the effect of a higher cigarette tax.",
      "image": null,
      "step_by_step": [
        {
          "step": "Ensure Objectivity",
          "explanation": "The statement must be testable and devoid of 'should' or 'ought'."
        }
      ],
      "final_answer": "Example: 'A 10% increase in the cigarette tax will lead to a 4% decrease in smoking rates among teenagers.'"
    },
    {
      "number": 15,
      "problem": "Identify the primary 'Economic Decision Maker' responsible for the supply of public goods like national defense.",
      "image": null,
      "step_by_step": [
        {
          "step": "Evaluate Roles",
          "explanation": "Households consume; Firms produce for profit; Government provides services that the market may not efficiently produce."
        }
      ],
      "final_answer": "The Government (State)."
    },
    {
      "number": 16,
      "problem": "Using the concept of 'Opportunity Cost,' explain why some students choose to drop out of college to start a business.",
      "image": null,
      "step_by_step": [
        {
          "step": "Compare Alternatives",
          "explanation": "Alternative A: Stay in college (Cost: potential business income). Alternative B: Start business (Cost: potential degree/future salary)."
        },
        {
          "step": "Analyze the Decision",
          "explanation": "If the current opportunity cost of staying in school (lost business profit) is too high, the student leaves."
        }
      ],
      "final_answer": "The student perceives the opportunity cost of their time in college (the lost profit from the business) to be greater than the benefit of the degree."
    },
    {
      "number": 17,
      "problem": "Explain why 'Money' is not considered 'Capital' in the context of the Factors of Production.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Economic Capital",
          "explanation": "Capital refers to physical goods used to produce other goods (tools, machinery)."
        },
        {
          "step": "Define Money",
          "explanation": "Money is a medium of exchange; it does not produce goods directly; it only buys the factors of production."
        }
      ],
      "final_answer": "In economics, capital is a physical resource (machinery); money is merely a financial asset used to acquire those resources."
    },
    {
      "number": 18,
      "problem": "What is the relationship between 'Choice' and 'Opportunity Cost'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Logical Link",
          "explanation": "Scarcity forces choice. Every choice involves selecting one path, which automatically creates an opportunity cost (the path not taken)."
        }
      ],
      "final_answer": "Opportunity cost is the direct result of making a choice in a world of limited resources."
    },
    {
      "number": 19,
      "problem": "A country decides to allocate more resources to 'Social Welfare' and fewer to 'Research and Development'. Show this on a Production Possibilities Frontier (PPF).",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Axes",
          "explanation": "Axis Y = Social Welfare; Axis X = Research and Development."
        },
        {
          "step": "Describe Movement",
          "explanation": "The economy moves from a point further right on the X-axis to a point higher up on the Y-axis along the curve."
        }
      ],
      "final_answer": "The decision is represented by a movement along the PPF curve toward the 'Social Welfare' axis, indicating a trade-off."
    },
    {
      "number": 20,
      "problem": "Why do economists use 'Models' despite them being simplifications of reality?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Complexity",
          "explanation": "The real world has too many variables to track at once."
        },
        {
          "step": "Analyze Predictive Power",
          "explanation": "By simplifying, models help predict general trends and the impact of specific policy changes."
        }
      ],
      "final_answer": "Models allow economists to strip away irrelevant details to understand fundamental relationships and predict outcomes."
    }
  ]
}
