{
  "course": "Economics",
  "topic": "Labour Market",
  "problems": [
    {
      "number": 1,
      "problem": "Define labour market.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The labour market is the market in which workers offer their services and employers hire them in exchange for wages."
        }
      ],
      "final_answer": "Labour market: where workers sell services and employers hire them for wages."
    },
    {
      "number": 2,
      "problem": "Define demand for labour.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Demand for labour is the quantity of workers firms are willing and able to hire at different wage levels."
        }
      ],
      "final_answer": "Demand for labour: quantity of workers firms hire at various wages."
    },
    {
      "number": 3,
      "problem": "Define supply of labour.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Supply of labour is the quantity of labour individuals are willing and able to offer at different wage rates."
        }
      ],
      "final_answer": "Supply of labour: quantity of labour individuals offer at various wages."
    },
    {
      "number": 4,
      "problem": "Define wage rate.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The wage rate is the price of labour, i.e., the payment made to workers per unit of time or output."
        }
      ],
      "final_answer": "Wage rate: payment to workers per unit of time or output."
    },
    {
      "number": 5,
      "problem": "Explain market equilibrium in the labour market.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Labour market equilibrium occurs where the quantity of labour demanded equals the quantity of labour supplied, determining the equilibrium wage and employment level."
        }
      ],
      "final_answer": "Labour market equilibrium: labour demand = labour supply, setting wage and employment."
    },
    {
      "number": 6,
      "problem": "Explain factors affecting labour demand.",
      "image": null,
      "step_by_step": [
        {
          "step": "Factors",
          "explanation": "Productivity of workers, wage rate, price of output, technology, and demand for the final product affect labour demand."
        }
      ],
      "final_answer": "Labour demand depends on productivity, wages, output price, technology, and product demand."
    },
    {
      "number": 7,
      "problem": "Explain factors affecting labour supply.",
      "image": null,
      "step_by_step": [
        {
          "step": "Factors",
          "explanation": "Population size, education and skills, wage rate, non-monetary benefits, and working conditions affect labour supply."
        }
      ],
      "final_answer": "Labour supply depends on population, skills, wages, benefits, and working conditions."
    },
    {
      "number": 8,
      "problem": "Explain minimum wage.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Minimum wage is a legally set lowest wage employers can pay workers, intended to protect workers from exploitation."
        }
      ],
      "final_answer": "Minimum wage: legally set lowest wage to protect workers."
    },
    {
      "number": 9,
      "problem": "Explain wage elasticity of labour supply.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Wage elasticity of labour supply measures how responsive the quantity of labour supplied is to a change in wage rates."
        }
      ],
      "final_answer": "Wage elasticity of labour supply: responsiveness of labour supplied to wage changes."
    },
    {
      "number": 10,
      "problem": "Explain the effect of a labour shortage on wages.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analysis",
          "explanation": "A labour shortage occurs when demand exceeds supply, which typically drives wages up until equilibrium is restored."
        }
      ],
      "final_answer": "Labour shortage → wages rise until demand = supply."
    }
  ]
}
