{
  "course": "Economics",
  "topic": "The Labour Market",
  "problems": [
    {
      "number": 1,
      "problem": "Explain why the demand for labor is described as a 'Derived Demand'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Term",
          "explanation": "Derived demand means the demand for a factor of production (labor) is dependent on the demand for the good or service it produces."
        },
        {
          "step": "Apply Example",
          "explanation": "A coffee shop doesn't want baristas for their own sake; it wants them because customers want to buy coffee."
        }
      ],
      "final_answer": "Labor demand is derived because it fluctuates based on the consumer demand for the final output."
    },
    {
      "number": 2,
      "problem": "Define 'Marginal Revenue Product' (MRP) and state the formula.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "MRP is the additional revenue a firm earns from hiring one more unit of labor."
        }
      ],
      "final_answer": "MRP = Marginal Product of Labor (MPL) × Marginal Revenue (MR)."
    },
    {
      "number": 3,
      "problem": "A firm sells its product for $10. The 5th worker hired increases total output from 50 to 58 units. Calculate the MRP of the 5th worker.",
      "image": null,
      "step_by_step": [
        {
          "step": "Find Marginal Product",
          "explanation": "MP = 58 - 50 = 8 units."
        },
        {
          "step": "Calculate MRP",
          "explanation": "MRP = 8 units × $10 = $80."
        }
      ],
      "final_answer": "The MRP of the 5th worker is $80."
    },
    {
      "number": 4,
      "problem": "Identify the profit-maximizing rule for hiring labor in a competitive market.",
      "image": null,
      "step_by_step": [
        {
          "step": "Compare Cost and Revenue",
          "explanation": "A firm should hire workers up to the point where the cost of the last worker (Wage) equals the revenue they generate (MRP)."
        }
      ],
      "final_answer": "The firm hires until Marginal Revenue Product = Marginal Resource Cost (MRP = MRC)."
    },
    {
      "number": 5,
      "problem": "Analyze the impact of a rise in consumer demand for smartphones on the demand for electronics engineers.",
      "image": null,
      "step_by_step": [
        {
          "step": "Connect to Derived Demand",
          "explanation": "Increased demand for phones leads to a need for higher production."
        }
      ],
      "final_answer": "The demand curve for electronics engineers will shift to the right."
    },
    {
      "number": 6,
      "problem": "Explain the 'Substitution Effect' and 'Income Effect' of a wage increase on an individual's labor supply.",
      "image": null,
      "step_by_step": [
        {
          "step": "Substitution Effect",
          "explanation": "As wages rise, the opportunity cost of leisure increases, so people work more."
        },
        {
          "step": "Income Effect",
          "explanation": "At very high wages, people feel rich enough to 'buy' more leisure time, so they may work less."
        }
      ],
      "final_answer": "The substitution effect encourages more work, while the income effect eventually encourages less work at high wage levels."
    },
    {
      "number": 7,
      "problem": "What is a 'Monopsony' in a labor market?",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "A market where there is only one major buyer (employer) of labor."
        }
      ],
      "final_answer": "A monopsony is a 'sole buyer' who has the power to set lower wages than a competitive market would."
    },
    {
      "number": 8,
      "problem": "Why is the 'Marginal Resource Cost' (MRC) curve above the supply curve in a monopsony?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Wage Hikes",
          "explanation": "To hire one more worker, the monopsonist must raise the wage for that worker AND all existing workers."
        }
      ],
      "final_answer": "The MRC includes the new worker's wage plus the pay raises given to everyone else already employed."
    },
    {
      "number": 9,
      "problem": "Explain the effect of a 'National Minimum Wage' set above the equilibrium in a competitive labor market.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Supply/Demand",
          "explanation": "At the higher wage, more people want to work (QS), but firms want fewer workers (QD)."
        }
      ],
      "final_answer": "A binding minimum wage creates a surplus of labor, commonly known as unemployment."
    },
    {
      "number": 10,
      "problem": "How can a Trade Union increase wages for its members? Identify two methods.",
      "image": null,
      "step_by_step": [
        {
          "step": "Method 1: Collective Bargaining",
          "explanation": "Negotiating a higher wage floor through the threat of a strike."
        },
        {
          "step": "Method 2: Restricting Supply",
          "explanation": "Limiting entry into the profession (e.g., through licensing) to shift the supply curve left."
        }
      ],
      "final_answer": "Unions use collective bargaining or supply restrictions to drive up wages."
    },
    {
      "number": 11,
      "problem": "A firm introduces new AI technology that makes workers more productive. Analyze the shift in the labor demand curve.",
      "image": null,
      "step_by_step": [
        {
          "step": "Calculate MRP Change",
          "explanation": "If workers are more productive, their Marginal Product (MP) rises."
        },
        {
          "step": "Apply Formula",
          "explanation": "Since MRP = MP × P, a higher MP increases MRP at every wage level."
        }
      ],
      "final_answer": "Increased productivity shifts the labor demand curve to the right."
    },
    {
      "number": 12,
      "problem": "What is 'Wage Discrimination'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Paying different workers different wages for doing the same job based on non-economic factors (gender, race, etc.)."
        }
      ],
      "final_answer": "Wage discrimination occurs when workers of equal productivity receive different pay based on personal characteristics."
    },
    {
      "number": 13,
      "problem": "Analyze the impact of an increase in immigration on the equilibrium wage of unskilled labor.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Determinant",
          "explanation": "Immigration increases the size of the labor force."
        }
      ],
      "final_answer": "The labor supply curve shifts to the right, causing the equilibrium wage to fall."
    },
    {
      "number": 14,
      "problem": "Define 'Human Capital' and explain its relationship with wage rates.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The skills, knowledge, and experience possessed by an individual."
        }
      ],
      "final_answer": "Higher human capital increases a worker's productivity (MRP), leading to higher wages."
    },
    {
      "number": 15,
      "problem": "Why might a surgeon earn more than a cleaner using the logic of Elasticity of Supply?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Supply",
          "explanation": "The supply of cleaners is elastic (many people can do it). The supply of surgeons is highly inelastic (long training, rare talent)."
        }
      ],
      "final_answer": "Inelastic supply and high demand for specialized skills lead to significantly higher wages."
    },
    {
      "number": 16,
      "problem": "Explain the 'Efficiency Wage Theory'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Motivation",
          "explanation": "Firms may pay *above* the equilibrium wage to increase worker morale, reduce turnover, and attract better talent."
        }
      ],
      "final_answer": "Efficiency wages are high wages paid voluntarily by firms to boost productivity and loyalty."
    },
    {
      "number": 17,
      "problem": "What is 'Occupational Crowding'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Mechanism",
          "explanation": "Discrimination or social norms push a specific group of people into a limited number of job types."
        }
      ],
      "final_answer": "Crowding increases the supply of labor in those specific jobs, driving down wages in those sectors."
    },
    {
      "number": 18,
      "problem": "Describe a 'Bilateral Monopoly'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Players",
          "explanation": "A market with a single buyer (Monopsonist) and a single seller (Trade Union)."
        }
      ],
      "final_answer": "The final wage depends on the relative bargaining power of the union and the employer."
    },
    {
      "number": 19,
      "problem": "How does 'Geographical Immobility' affect regional unemployment?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Barriers",
          "explanation": "If workers cannot move to where jobs are (due to housing costs or family ties), they remain unemployed in depressed areas."
        }
      ],
      "final_answer": "Geographical immobility creates localized pockets of high unemployment despite labor shortages elsewhere."
    },
    {
      "number": 20,
      "problem": "Predict the effect on the labor market for teachers if the government increases the required years of training.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Barrier",
          "explanation": "Increased training is a barrier to entry."
        }
      ],
      "final_answer": "The labor supply curve shifts to the left, increasing the equilibrium wage but decreasing the number of teachers."
    }
  ]
}
