{
  "course": "Economics",
  "topic": "Market Structures",
  "problems": [
    {
      "number": 1,
      "problem": "Explain why a firm in a 'Perfectly Competitive' market is considered a 'Price Taker'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Market Share",
          "explanation": "There are so many small firms that no individual firm can influence the market price by changing its output."
        },
        {
          "step": "Analyze Product Nature",
          "explanation": "Products are homogeneous (identical), so if a firm raises its price, consumers will immediately switch to a competitor."
        }
      ],
      "final_answer": "Firms must accept the market equilibrium price determined by industry supply and demand; they have no power to set prices."
    },
    {
      "number": 2,
      "problem": "Identify the profit-maximizing rule for all firms, regardless of market structure.",
      "image": null,
      "step_by_step": [
        {
          "step": "Compare Marginal Revenue and Cost",
          "explanation": "A firm should produce as long as the additional revenue from the next unit (MR) is greater than or equal to the cost of producing it (MC)."
        }
      ],
      "final_answer": "A firm maximizes profit where Marginal Revenue equals Marginal Cost ($MR = MC$)."
    },
    {
      "number": 3,
      "problem": "Explain why a Monopoly can earn 'Supernormal Profits' in the long run, while a perfectly competitive firm cannot.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Barriers to Entry",
          "explanation": "Monopolies have high barriers (patents, high start-up costs) that prevent new firms from entering to compete for profits."
        },
        {
          "step": "Analyze Perfect Competition",
          "explanation": "With no barriers, new firms enter, increasing market supply and driving the price down until only normal profit remains."
        }
      ],
      "final_answer": "High barriers to entry protect a monopolist's profit from being eroded by competitors."
    },
    {
      "number": 4,
      "problem": "Define 'Product Differentiation' and identify which market structure relies on it most.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Term",
          "explanation": "Making a product appear different from competitors through branding, quality, or features."
        }
      ],
      "final_answer": "Product differentiation is a key feature of Monopolistic Competition, allowing firms to have some control over their prices."
    },
    {
      "number": 5,
      "problem": "Explain 'Allocative Efficiency' and why a Monopoly fails to achieve it.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Efficiency",
          "explanation": "Allocative efficiency occurs when $P = MC$, meaning the value consumers place on the good equals the cost of resources used."
        },
        {
          "step": "Analyze Monopoly",
          "explanation": "Monopolies restrict output and charge a price higher than marginal cost ($P > MC$) to maximize profit."
        }
      ],
      "final_answer": "Monopolies are allocatively inefficient because they under-produce and over-charge relative to social optimum."
    },
    {
      "number": 6,
      "problem": "What is a 'Natural Monopoly'? Provide an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Economies of Scale",
          "explanation": "A natural monopoly occurs when one firm can supply the entire market at a lower cost than two or more firms could."
        }
      ],
      "final_answer": "Common examples include utility companies like water or electricity grids, where infrastructure costs are massive."
    },
    {
      "number": 7,
      "problem": "In an 'Oligopoly', explain the concept of 'Interdependence'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Decision Making",
          "explanation": "Since there are only a few large firms, the actions of one firm (e.g., a price cut) directly affect the profits and decisions of the others."
        }
      ],
      "final_answer": "Interdependence means firms must consider the likely reactions of their rivals before making changes to price or output."
    },
    {
      "number": 8,
      "problem": "How does the 'Kinked Demand Curve' explain price stability in an Oligopoly?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Price Increase",
          "explanation": "If a firm raises price, rivals won't follow, so the firm loses significant market share (elastic demand)."
        },
        {
          "step": "Analyze Price Decrease",
          "explanation": "If a firm lowers price, rivals will follow to protect their share, so the firm gains little (inelastic demand)."
        }
      ],
      "final_answer": "Because both raising and lowering prices leads to lower revenue, firms tend to keep prices stable."
    },
    {
      "number": 9,
      "problem": "Distinguish between 'Collusive' and 'Non-Collusive' Oligopolies.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Collusion",
          "explanation": "Firms act together (forming a cartel) to fix prices and restrict output to act like a monopoly."
        },
        {
          "step": "Define Non-Collusive",
          "explanation": "Firms compete aggressively against each other using price and non-price strategies."
        }
      ],
      "final_answer": "Collusion involves cooperation to maximize group profit; non-collusion involves independent competition."
    },
    {
      "number": 10,
      "problem": "Identify two 'Non-Price' competition strategies used by firms.",
      "image": null,
      "step_by_step": [
        {
          "step": "List Strategies",
          "explanation": "1. Advertising and branding. 2. Quality improvements and after-sales service."
        }
      ],
      "final_answer": "Advertising and product loyalty programs are common non-price strategies."
    },
    {
      "number": 11,
      "problem": "Explain why 'Productive Efficiency' is achieved by perfectly competitive firms in the long run.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Efficiency",
          "explanation": "Productive efficiency occurs when a firm produces at the lowest possible average cost (minimum ATC)."
        },
        {
          "step": "Analyze Long Run",
          "explanation": "Intense competition forces firms to eliminate waste and operate at the minimum point of their ATC curve to survive."
        }
      ],
      "final_answer": "Market pressure forces perfectly competitive firms to produce at the minimum of their average total cost curve."
    },
    {
      "number": 12,
      "problem": "What is 'Price Discrimination'? State one condition necessary for it to occur.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Term",
          "explanation": "Charging different prices to different consumers for the identical product."
        },
        {
          "step": "Identify Condition",
          "explanation": "The firm must be able to prevent 'resale' (arbitrage) between different groups of consumers."
        }
      ],
      "final_answer": "Price discrimination requires market power and the ability to separate consumer groups based on different elasticities."
    },
    {
      "number": 13,
      "problem": "Analyze the impact of a firm's 'Exit' from a perfectly competitive market on the remaining firms.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Supply",
          "explanation": "Firms exiting reduces the market supply, shifting the supply curve to the left."
        },
        {
          "step": "Analyze Price",
          "explanation": "This causes the market price to rise, helping the remaining firms move from loss back toward normal profit."
        }
      ],
      "final_answer": "Firm exits reduce supply and raise the market price, restoring profitability for the remaining firms."
    },
    {
      "number": 14,
      "problem": "Explain why barriers to entry are essential for a 'Monopoly' to exist.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Threat",
          "explanation": "If a monopoly is making huge profits, other firms will want to enter the market."
        },
        {
          "step": "Identify Protection",
          "explanation": "Barriers like patents or legal monopolies block that entry, maintaining the single-seller status."
        }
      ],
      "final_answer": "Without barriers, the monopoly would face competition and lose its market power."
    },
    {
      "number": 15,
      "problem": "Define 'Cartel' and explain why they are often unstable.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Term",
          "explanation": "A group of firms that formally agree to coordinate prices and output."
        },
        {
          "step": "Identify Weakness",
          "explanation": "There is a strong 'incentive to cheat' by individual members who can increase their own profit by secretly lowering prices to gain more customers."
        }
      ],
      "final_answer": "Cartels are unstable because individual firms often find it more profitable to break the agreement and undercut their partners."
    },
    {
      "number": 16,
      "problem": "Compare the 'Demand Curve' of a perfectly competitive firm to that of a Monopolist.",
      "image": null,
      "step_by_step": [
        {
          "step": "Perfect Competition",
          "explanation": "The curve is perfectly elastic (horizontal) at the market price."
        },
        {
          "step": "Monopoly",
          "explanation": "The curve is the downward-sloping market demand curve."
        }
      ],
      "final_answer": "The competitive firm faces a flat demand curve; the monopolist faces the entire market's downward-sloping demand."
    },
    {
      "number": 17,
      "problem": "What is 'Dynamic Efficiency'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Concept",
          "explanation": "Efficiency over time through investment in Research and Development (R&D) and innovation."
        }
      ],
      "final_answer": "Dynamic efficiency is achieved when firms use their supernormal profits to develop better products or production techniques."
    },
    {
      "number": 18,
      "problem": "Explain why Monopolistic Competition is considered inefficient compared to Perfect Competition.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze ATC",
          "explanation": "Because firms differentiate their products, they do not produce at the minimum point of the ATC curve (excess capacity)."
        },
        {
          "step": "Analyze Price",
          "explanation": "Because they have some market power, they charge a price above marginal cost ($P > MC$)."
        }
      ],
      "final_answer": "It fails both productive and allocative efficiency due to branding costs and downward-sloping demand curves."
    },
    {
      "number": 19,
      "problem": "Identify the 'Shut-down Point' for a firm in the short run.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Revenue vs Costs",
          "explanation": "A firm should shut down if its revenue cannot even cover its variable costs (e.g., wages and materials)."
        }
      ],
      "final_answer": "A firm shuts down if Price is less than Average Variable Cost ($P < AVC$)."
    },
    {
      "number": 20,
      "problem": "Explain 'Concentration Ratio' and its use in identifying market structures.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Term",
          "explanation": "The percentage of market share held by the top few firms (e.g., the 4-firm concentration ratio)."
        }
      ],
      "final_answer": "A high concentration ratio indicates an Oligopoly; a low ratio indicates Monopolistic or Perfect Competition."
    }
  ]
}
