{
  "course": "Economics",
  "topic": "National Income and Circular Flow",
  "problems": [
    {
      "number": 1,
      "problem": "In the basic two-sector circular flow model, identify the two primary actors and the two types of flows between them.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Actors",
          "explanation": "The two actors are Households and Firms."
        },
        {
          "step": "Identify Flows",
          "explanation": "The flows are Physical Flows (resources and goods) and Monetary Flows (wages and consumer spending)."
        }
      ],
      "final_answer": "Households and Firms exchange factors of production and goods/services for monetary payments."
    },
    {
      "number": 2,
      "problem": "Define 'Leakages' (Withdrawals) and 'Injections' in the circular flow of income.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Leakages",
          "explanation": "Money that leaves the circular flow, reducing the size of national income (Savings, Taxes, Imports)."
        },
        {
          "step": "Define Injections",
          "explanation": "Money that enters the circular flow from outside, increasing national income (Investment, Government Spending, Exports)."
        }
      ],
      "final_answer": "Leakages (S+T+M) contract the economy; Injections (I+G+X) expand it."
    },
    {
      "number": 3,
      "problem": "Explain the three methods used to calculate Gross Domestic Product (GDP).",
      "image": null,
      "step_by_step": [
        {
          "step": "Output Method",
          "explanation": "The total value of all final goods and services produced in the economy."
        },
        {
          "step": "Income Method",
          "explanation": "The sum of all incomes earned by the factors of production (Wages + Rent + Interest + Profit)."
        },
        {
          "step": "Expenditure Method",
          "explanation": "The total spending on final goods (C + I + G + (X-M))."
        }
      ],
      "final_answer": "GDP can be measured by total output, total income, or total expenditure; all three should theoretically be equal."
    },
    {
      "number": 4,
      "problem": "A country has a Nominal GDP of $500 billion in Year 1 and $550 billion in Year 2. If inflation was 10%, calculate the Real GDP for Year 2.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Formula",
          "explanation": "Real GDP = (Nominal GDP / Price Index) × 100."
        },
        {
          "step": "Calculate",
          "explanation": "($550 / 110) × 100 = $500."
        }
      ],
      "final_answer": "The Real GDP for Year 2 is $500 billion, meaning there was zero real economic growth."
    },
    {
      "number": 5,
      "problem": "Explain the 'Multiplier Effect' using the concept of the Marginal Propensity to Consume (MPC).",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Initial Spending",
          "explanation": "If the government spends $1 million, that money becomes income for someone else."
        },
        {
          "step": "Analyze Subsequent Rounds",
          "explanation": "If the MPC is 0.8, those people spend 80% of that million ($800,000), which becomes income for another group, and so on."
        }
      ],
      "final_answer": "The multiplier effect occurs because one person's spending becomes another person's income, triggering further rounds of spending."
    },
    {
      "number": 6,
      "problem": "Calculate the total increase in national income if there is an injection of $200 million and the Marginal Propensity to Save (MPS) is 0.25.",
      "image": null,
      "step_by_step": [
        {
          "step": "Find Multiplier",
          "explanation": "Multiplier (k) = 1 / MPS = 1 / 0.25 = 4."
        },
        {
          "step": "Calculate Total Change",
          "explanation": "$200 million × 4 = $800 million."
        }
      ],
      "final_answer": "The total increase in national income is $800 million."
    },
    {
      "number": 7,
      "problem": "Distinguish between GDP and GNI (Gross National Income).",
      "image": null,
      "step_by_step": [
        {
          "step": "Define GDP",
          "explanation": "Production that takes place within a country's borders, regardless of who owns the factors."
        },
        {
          "step": "Define GNI",
          "explanation": "Total income received by the residents of a country, including income from abroad minus income paid to non-residents."
        }
      ],
      "final_answer": "GDP is location-based; GNI is ownership-based."
    },
    {
      "number": 8,
      "problem": "Explain why 'Transfer Payments' (like unemployment benefits) are excluded from GDP calculations.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Production",
          "explanation": "GDP measures the value of goods and services produced."
        },
        {
          "step": "Analyze Payment",
          "explanation": "Transfer payments are shifts of tax revenue to individuals without any corresponding production of a new good or service."
        }
      ],
      "final_answer": "Transfer payments are excluded because they do not represent new economic output."
    },
    {
      "number": 9,
      "problem": "Identify three limitations of using GDP as a measure of a nation's well-being.",
      "image": null,
      "step_by_step": [
        {
          "step": "List Limitations",
          "explanation": "1. It ignores income inequality. 2. It doesn't account for environmental damage (externalities). 3. It excludes non-market activities (like housework or DIY)."
        }
      ],
      "final_answer": "GDP measures output, not quality of life, sustainability, or distribution of wealth."
    },
    {
      "number": 10,
      "problem": "What is 'GDP per Capita' and why is it used to compare countries?",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Total GDP divided by the total population."
        }
      ],
      "final_answer": "It provides a better measure of the average standard of living than total GDP alone, especially when comparing countries with different population sizes."
    },
    {
      "number": 11,
      "problem": "Analyze the effect of a rise in 'Marginal Propensity to Import' (MPM) on the size of the multiplier.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify MPM as Leakage",
          "explanation": "Importing is a leakage (withdrawal) from the circular flow."
        }
      ],
      "final_answer": "A higher MPM increases the total leakages, which reduces the value of the multiplier."
    },
    {
      "number": 12,
      "problem": "Explain the 'Green GDP' concept.",
      "image": null,
      "step_by_step": [
        {
          "step": "Concept",
          "explanation": "Adjusting GDP to subtract the costs of environmental degradation and resource depletion caused by production."
        }
      ],
      "final_answer": "Green GDP attempts to provide a more sustainable view of economic growth by accounting for environmental 'costs'."
    },
    {
      "number": 13,
      "problem": "In an open economy, under what condition will national income be in equilibrium?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Equilibrium Rule",
          "explanation": "National income is in equilibrium when total planned leakages equal total planned injections."
        }
      ],
      "final_answer": "Equilibrium occurs when S + T + M = I + G + X."
    },
    {
      "number": 14,
      "problem": "Explain the difference between 'Economic Growth' and 'Economic Development'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Economic Growth",
          "explanation": "A quantitative increase in a country's Real GDP over time."
        },
        {
          "step": "Economic Development",
          "explanation": "A qualitative improvement in the standard of living, including health, education, and human rights."
        }
      ],
      "final_answer": "Growth is about 'more' (output); Development is about 'better' (quality of life)."
    },
    {
      "number": 15,
      "problem": "How does 'Purchasing Power Parity' (PPP) help when comparing GDP between the US and China?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Price Differences",
          "explanation": "Living costs are much lower in China than in the US."
        },
        {
          "step": "Apply PPP",
          "explanation": "PPP adjusts the exchange rate so that a dollar can buy the same basket of goods in both countries."
        }
      ],
      "final_answer": "PPP allows for a fairer comparison of living standards by accounting for differences in local prices."
    },
    {
      "number": 16,
      "problem": "Define 'Gross Value Added' (GVA).",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The value of output minus the value of intermediate consumption (raw materials and services used in production)."
        }
      ],
      "final_answer": "GVA measures the contribution to the economy made by an individual producer, industry, or sector."
    },
    {
      "number": 17,
      "problem": "What is the 'Shadow Economy' (Informal Economy) and how does it affect GDP accuracy?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Activities",
          "explanation": "Illegal activities (drugs) or legal but unrecorded activities (cash-in-hand window cleaning)."
        }
      ],
      "final_answer": "The shadow economy causes GDP to be undervalued because a significant amount of economic activity goes unrecorded."
    },
    {
      "number": 18,
      "problem": "Explain how a 'Budget Deficit' acts as an injection into the circular flow.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze G vs T",
          "explanation": "A budget deficit means Government Spending (Injection) is greater than Tax Revenue (Leakage)."
        }
      ],
      "final_answer": "Since injections exceed leakages in this sector, it provides a net boost to the total circular flow of income."
    },
    {
      "number": 19,
      "problem": "Identify the relationship between 'Stock' and 'Flow' in macroeconomics using wealth and income.",
      "image": null,
      "step_by_step": [
        {
          "step": "Stock",
          "explanation": "A measurement at a specific point in time (e.g., total wealth in a bank account)."
        },
        {
          "step": "Flow",
          "explanation": "A measurement over a period of time (e.g., annual salary or income)."
        }
      ],
      "final_answer": "Income is a flow that adds to the stock of wealth over time."
    },
    {
      "number": 20,
      "problem": "Why might a high 'Marginal Propensity to Save' (MPS) be detrimental to short-term economic growth?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Multiplier",
          "explanation": "A high MPS means a low MPC, which results in a smaller multiplier."
        }
      ],
      "final_answer": "A high MPS means less money is being spent in the economy, reducing the overall expansionary effect of any new investment."
    }
  ]
}
