{
  "course": "Economics",
  "topic": "Production and Costs",
  "problems": [
    {
      "number": 1,
      "problem": "Distinguish between the 'Short Run' and the 'Long Run' in the context of economic production.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Short Run",
          "explanation": "A period of time where at least one factor of production (usually capital) is fixed."
        },
        {
          "step": "Define Long Run",
          "explanation": "A period of time where all factors of production are variable, allowing the firm to change its scale of operation."
        }
      ],
      "final_answer": "In the short run, some inputs are fixed; in the long run, all inputs can be adjusted."
    },
    {
      "number": 2,
      "problem": "Explain the 'Law of Diminishing Marginal Returns' using the example of a small kitchen with too many chefs.",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Initial Hiring",
          "explanation": "Adding a second chef allows for specialization and increases output significantly."
        },
        {
          "step": "Analyze Overcrowding",
          "explanation": "Eventually, the kitchen becomes crowded and chefs wait for the stove. The addition of the 10th chef adds very little to total output."
        }
      ],
      "final_answer": "As more units of a variable factor (labor) are added to a fixed factor (kitchen), the extra output produced by each new unit will eventually decline."
    },
    {
      "number": 3,
      "problem": "Define 'Fixed Costs' and 'Variable Costs' and provide one example of each for an airline.",
      "image": null,
      "step_by_step": [
        {
          "step": "Fixed Costs (FC)",
          "explanation": "Costs that do not change with the level of output (e.g., aircraft lease payments or insurance)."
        },
        {
          "step": "Variable Costs (VC)",
          "explanation": "Costs that change directly with output (e.g., jet fuel or in-flight meals)."
        }
      ],
      "final_answer": "Fixed costs (Leases) stay constant regardless of flights; Variable costs (Fuel) rise as more flights are operated."
    },
    {
      "number": 4,
      "problem": "A firm produces 100 units at a Total Cost of $500. If its Fixed Cost is $200, calculate the Average Variable Cost (AVC).",
      "image": null,
      "step_by_step": [
        {
          "step": "Find Total Variable Cost (TVC)",
          "explanation": "TVC = Total Cost - Fixed Cost ($500 - $200 = $300)."
        },
        {
          "step": "Calculate AVC",
          "explanation": "AVC = TVC / Output ($300 / 100)."
        }
      ],
      "final_answer": "The Average Variable Cost is $3."
    },
    {
      "number": 5,
      "problem": "Explain the relationship between 'Marginal Cost' (MC) and 'Average Total Cost' (ATC). Where do they intersect?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze the Pull Effect",
          "explanation": "If MC is lower than ATC, it pulls the average down. If MC is higher than ATC, it pulls the average up."
        }
      ],
      "final_answer": "MC intersects ATC at its lowest point (minimum efficient scale)."
    },
    {
      "number": 6,
      "problem": "Identify and explain one example of a 'Technical Economy of Scale'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Concept",
          "explanation": "Larger machines are often more efficient than smaller ones."
        }
      ],
      "final_answer": "A double-decker bus can carry twice the passengers of a single bus but doesn't require twice the fuel or two drivers."
    },
    {
      "number": 7,
      "problem": "What are 'Marketing Economies of Scale'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Ad Spend",
          "explanation": "A large firm can spread the cost of a national TV advertisement over millions of units sold."
        }
      ],
      "final_answer": "Large firms have a lower advertising cost per unit because their high volume spreads the fixed marketing expense."
    },
    {
      "number": 8,
      "problem": "Explain how 'Managerial Diseconomies of Scale' can occur in a massive global corporation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Communication Issues",
          "explanation": "As a firm becomes too large, layers of management increase, making communication slow and distorted."
        }
      ],
      "final_answer": "Diseconomies of scale occur when a firm grows so large that inefficiency and bureaucracy drive up average costs."
    },
    {
      "number": 9,
      "problem": "Define 'Marginal Product' (MP) and explain why it eventually turns negative.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define MP",
          "explanation": "The extra output created by adding one more unit of labor."
        },
        {
          "step": "Negative MP",
          "explanation": "This happens when adding a worker actually reduces total output (e.g., they get in each other's way or break equipment)."
        }
      ],
      "final_answer": "Marginal product is the change in total output from one additional worker; it turns negative when overcrowding causes total output to fall."
    },
    {
      "number": 10,
      "problem": "A company sees its average costs fall from $10 to $8 as it doubles its production capacity. Is this an example of increasing, decreasing, or constant returns to scale?",
      "image": null,
      "step_by_step": [
        {
          "step": "Evaluate ATC Trend",
          "explanation": "Falling average costs as scale increases indicates efficiency gains."
        }
      ],
      "final_answer": "This is an example of 'Increasing Returns to Scale' (Economies of Scale)."
    },
    {
      "number": 11,
      "problem": "Why does the 'Average Fixed Cost' (AFC) curve always slope downward and never touch the x-axis?",
      "image": null,
      "step_by_step": [
        {
          "step": "Spreading the Overhead",
          "explanation": "AFC = TFC / Q. As Q increases, the same fixed cost is divided by a larger number."
        }
      ],
      "final_answer": "AFC falls as output grows because fixed costs are spread over more units, but it never reaches zero because TFC is always positive."
    },
    {
      "number": 12,
      "problem": "Identify two 'Purchasing Economies of Scale'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Bulk Buying",
          "explanation": "Large firms can negotiate lower prices from suppliers because they buy in massive quantities."
        }
      ],
      "final_answer": "Bulk-buying discounts and greater bargaining power with suppliers."
    },
    {
      "number": 13,
      "problem": "Contrast 'Internal' and 'External' economies of scale.",
      "image": null,
      "step_by_step": [
        {
          "step": "Internal",
          "explanation": "Cost savings that occur within a single firm due to its own growth."
        },
        {
          "step": "External",
          "explanation": "Cost savings that occur for all firms in an industry due to the growth of the industry as a whole (e.g., better regional infrastructure)."
        }
      ],
      "final_answer": "Internal is firm-specific; External is industry-wide."
    },
    {
      "number": 14,
      "problem": "Explain the concept of 'Sunk Costs' and why they should be ignored in future business decisions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Sunk Cost",
          "explanation": "Costs that have already been incurred and cannot be recovered (e.g., past research costs)."
        }
      ],
      "final_answer": "Sunk costs are irrelevant to future decisions because they cannot be changed by any current or future action."
    },
    {
      "number": 15,
      "problem": "Analyze the impact of a rise in electricity prices on a factory's Fixed and Variable costs.",
      "image": null,
      "step_by_step": [
        {
          "step": "Categorize Expense",
          "explanation": "Electricity use usually scales with production (running machines longer)."
        }
      ],
      "final_answer": "Electricity is a variable cost; therefore, its price rise will shift the Variable Cost and Total Cost curves upward, but Fixed Costs will remain unchanged."
    },
    {
      "number": 16,
      "problem": "What is the 'Minimum Efficient Scale' (MES)?",
      "image": null,
      "step_by_step": [
        {
          "step": "Define MES",
          "explanation": "The lowest point on the Long-Run Average Cost (LRAC) curve."
        }
      ],
      "final_answer": "MES is the smallest size a firm can be while still achieving the lowest possible long-run average costs."
    },
    {
      "number": 17,
      "problem": "How does 'Financial Economy of Scale' benefit large firms over small firms?",
      "image": null,
      "step_by_step": [
        {
          "step": "Analyze Interest Rates",
          "explanation": "Banks perceive large firms as lower risk, allowing them to borrow money at lower interest rates."
        }
      ],
      "final_answer": "Large firms can access cheaper credit and a wider range of financial instruments."
    },
    {
      "number": 18,
      "problem": "Explain why the Marginal Cost curve eventually rises.",
      "image": null,
      "step_by_step": [
        {
          "step": "Connect to Productivity",
          "explanation": "The Law of Diminishing Marginal Returns states that MP eventually falls."
        },
        {
          "step": "Connect to Costs",
          "explanation": "If each additional worker adds less output than the last, the cost of producing that extra output (MC) must rise."
        }
      ],
      "final_answer": "MC rises because of diminishing marginal returns to the variable factor."
    },
    {
      "number": 19,
      "problem": "What is 'Total Product' (TP) and how is it related to 'Average Product' (AP)?",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "TP is the total quantity produced. AP is TP divided by the number of workers (TP/L)."
        }
      ],
      "final_answer": "Average product measures the productivity per worker, derived from the total product."
    },
    {
      "number": 20,
      "problem": "If a firm’s 'Marginal Product' is greater than its 'Average Product', is the Average Product rising or falling?",
      "image": null,
      "step_by_step": [
        {
          "step": "Apply the Average-Marginal Rule",
          "explanation": "If the 'new' unit (Marginal) is above the current average, it pulls the average up."
        }
      ],
      "final_answer": "The Average Product is rising."
    }
  ]
}
