{
  "course": "Economics",
  "topic": "Production and Trade",
  "problems": [
    {
      "number": 1,
      "problem": "Define production in economics.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Production is the process of combining resources (factors of production) to create goods and services that satisfy human wants."
        }
      ],
      "final_answer": "Production is the creation of goods and services using resources."
    },
    {
      "number": 2,
      "problem": "Define factors of production.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Factors of production are the inputs used to produce goods and services: land, labor, capital, and entrepreneurship."
        }
      ],
      "final_answer": "Factors of production are land, labor, capital, and entrepreneurship."
    },
    {
      "number": 3,
      "problem": "Explain the law of diminishing returns.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The law of diminishing returns states that adding more of one input, while holding others constant, will eventually produce smaller additional output."
        }
      ],
      "final_answer": "Adding more of one input eventually yields smaller increases in output."
    },
    {
      "number": 4,
      "problem": "Define opportunity cost in production.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Opportunity cost in production is the value of the next best alternative forgone when resources are used to produce one good over another."
        }
      ],
      "final_answer": "Opportunity cost is the value of the next best alternative foregone."
    },
    {
      "number": 5,
      "problem": "Define comparative advantage.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Comparative advantage occurs when a country or producer can produce a good at a lower opportunity cost than another."
        }
      ],
      "final_answer": "Comparative advantage is producing a good at lower opportunity cost than others."
    },
    {
      "number": 6,
      "problem": "Define absolute advantage.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Absolute advantage occurs when a country or producer can produce more of a good with the same resources than another."
        }
      ],
      "final_answer": "Absolute advantage is producing more output with the same resources than others."
    },
    {
      "number": 7,
      "problem": "Explain the benefits of international trade.",
      "image": null,
      "step_by_step": [
        {
          "step": "Benefits",
          "explanation": "Trade allows countries to specialize in goods with comparative advantage, increase efficiency, access more goods, and raise living standards."
        }
      ],
      "final_answer": "International trade improves efficiency, specialization, and access to goods, raising living standards."
    },
    {
      "number": 8,
      "problem": "Explain the difference between imports and exports.",
      "image": null,
      "step_by_step": [
        {
          "step": "Imports",
          "explanation": "Imports are goods and services purchased from other countries."
        },
        {
          "step": "Exports",
          "explanation": "Exports are goods and services sold to other countries."
        }
      ],
      "final_answer": "Imports: bought from abroad; Exports: sold abroad."
    },
    {
      "number": 9,
      "problem": "Explain the concept of trade balance.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Trade balance is the difference between the value of a country’s exports and imports over a period of time."
        }
      ],
      "final_answer": "Trade balance = exports minus imports."
    },
    {
      "number": 10,
      "problem": "Explain the role of specialization in production and trade.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Specialization allows producers or countries to focus on goods they produce efficiently, increasing total output and enabling mutually beneficial trade."
        }
      ],
      "final_answer": "Specialization increases efficiency and output, enabling beneficial trade."
    }
  ]
}
