{
  "course": "Economics",
  "topic": "Production & Trade",
  "problems": [
    {
      "number": 1,
      "problem": "Explain the concept of 'Division of Labour' using the example of a modern smartphone factory.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Division of Labour",
          "explanation": "It is the breaking down of a production process into small, specialized tasks performed by different workers."
        },
        {
          "step": "Apply to Context",
          "explanation": "In a smartphone factory, one worker installs screens, another solders circuits, and another performs software testing, rather than one person building the whole phone."
        }
      ],
      "final_answer": "Division of labour increases efficiency by allowing workers to become highly skilled at specific sub-tasks."
    },
    {
      "number": 2,
      "problem": "Identify and explain two advantages of specialization for a firm.",
      "image": null,
      "step_by_step": [
        {
          "step": "Increased Productivity",
          "explanation": "Workers become faster and more accurate at their specific tasks through repetition (practice makes perfect)."
        },
        {
          "step": "Time Saving",
          "explanation": "Specialization eliminates the time lost when workers switch from one tool or station to another."
        }
      ],
      "final_answer": "The primary advantages are increased output per worker and reduced production downtime."
    },
    {
      "number": 3,
      "problem": "A highly skilled surgeon is also the fastest typist in their city. Explain, using economic logic, why the surgeon should still hire a medical secretary.",
      "image": null,
      "step_by_step": [
        {
          "step": "Compare Opportunity Costs",
          "explanation": "The surgeon's opportunity cost of typing is the value of the surgeries they could be performing."
        },
        {
          "step": "Apply Comparative Advantage",
          "explanation": "Even though the surgeon has an absolute advantage in typing, they have a comparative advantage in surgery."
        }
      ],
      "final_answer": "The surgeon should specialize in surgery because their opportunity cost for typing is too high."
    },
    {
      "number": 4,
      "problem": "Distinguish between 'Geographical Mobility' and 'Occupational Mobility' of labor.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Geographical Mobility",
          "explanation": "The ability of workers to move from one location to another for work (e.g., moving from London to Manchester)."
        },
        {
          "step": "Define Occupational Mobility",
          "explanation": "The ability of workers to switch from one type of job to another (e.g., a waiter becoming a teacher)."
        }
      ],
      "final_answer": "Geographical mobility refers to location; occupational mobility refers to skill sets and industries."
    },
    {
      "number": 5,
      "problem": "Analyze how a lack of 'Occupational Mobility' can lead to structural unemployment.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Industry Shift",
          "explanation": "Imagine a country's coal mines close, but the technology sector is growing."
        },
        {
          "step": "Analyze Skill Mismatch",
          "explanation": "If coal miners lack the training to work in tech, they cannot switch jobs easily."
        }
      ],
      "final_answer": "Low occupational mobility prevents workers from moving into new industries when their old industries decline."
    },
    {
      "number": 6,
      "problem": "Country A can produce 50 units of Wheat or 25 units of Cloth. Country B can produce 20 units of Wheat or 20 units of Cloth. Identify which country has the 'Absolute Advantage' in Wheat.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Absolute Advantage",
          "explanation": "The ability to produce more of a good using the same amount of resources."
        },
        {
          "step": "Compare Output",
          "explanation": "Country A (50 Wheat) > Country B (20 Wheat)."
        }
      ],
      "final_answer": "Country A has the absolute advantage in Wheat production."
    },
    {
      "number": 7,
      "problem": "Using the data from Problem 6, calculate the opportunity cost of 1 unit of Wheat for Country A and Country B.",
      "image": null,
      "step_by_step": [
        {
          "step": "Calculate for Country A",
          "explanation": "50 Wheat = 25 Cloth. Therefore, 1 Wheat = 0.5 Cloth."
        },
        {
          "step": "Calculate for Country B",
          "explanation": "20 Wheat = 20 Cloth. Therefore, 1 Wheat = 1 Cloth."
        }
      ],
      "final_answer": "Country A's cost is 0.5 Cloth; Country B's cost is 1 Cloth."
    },
    {
      "number": 8,
      "problem": "Based on the opportunity costs in Problem 7, which country has the 'Comparative Advantage' in Wheat?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Lower Cost",
          "explanation": "Comparative advantage goes to the country with the lower opportunity cost."
        },
        {
          "step": "Compare",
          "explanation": "Country A (0.5 Cloth) is less than Country B (1 Cloth)."
        }
      ],
      "final_answer": "Country A has the comparative advantage in Wheat."
    },
    {
      "number": 9,
      "problem": "Explain one disadvantage of over-specialization for an individual worker.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Psychological Effect",
          "explanation": "Repeating the same tiny task every day leads to boredom and alienation (monotony)."
        },
        {
          "step": "Identify Economic Risk",
          "explanation": "If that specific skill becomes obsolete (e.g., due to AI), the worker has no other skills to rely on."
        }
      ],
      "final_answer": "Over-specialization can lead to worker demotivation and high risk of long-term unemployment if the industry changes."
    },
    {
      "number": 10,
      "problem": "Define 'Capital Intensive' production and give an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Term",
          "explanation": "A production process that uses a high proportion of machinery/technology relative to labor."
        }
      ],
      "final_answer": "An example is an oil refinery or an automated semiconductor plant."
    },
    {
      "number": 11,
      "problem": "Explain the difference between 'Primary', 'Secondary', and 'Tertiary' sectors of production.",
      "image": null,
      "step_by_step": [
        {
          "step": "Primary",
          "explanation": "Extraction of raw materials (Mining, Farming)."
        },
        {
          "step": "Secondary",
          "explanation": "Manufacturing and construction (Car assembly)."
        },
        {
          "step": "Tertiary",
          "explanation": "Services (Banking, Tourism)."
        }
      ],
      "final_answer": "Primary extracts, Secondary manufactures, and Tertiary provides services."
    },
    {
      "number": 12,
      "problem": "What is meant by the 'Terms of Trade'?",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Concept",
          "explanation": "It is the ratio between the index of export prices and the index of import prices."
        }
      ],
      "final_answer": "Terms of Trade measures the quantity of imports a country can purchase per unit of its exports."
    },
    {
      "number": 13,
      "problem": "Analyze how an increase in 'Labour Productivity' affects a firm's average cost of production.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define Productivity Increase",
          "explanation": "Workers are producing more output in the same amount of time."
        },
        {
          "step": "Connect to Costs",
          "explanation": "The wage cost is spread over a larger number of units, reducing the cost per unit."
        }
      ],
      "final_answer": "Higher labor productivity reduces the average cost of production, making the firm more competitive."
    },
    {
      "number": 14,
      "problem": "Explain the role of 'Entrepreneurship' in international trade.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Risk",
          "explanation": "Entrepreneurs identify gaps in foreign markets and take the risk to export goods."
        },
        {
          "step": "Identify Innovation",
          "explanation": "They organize resources to produce goods that meet international quality standards."
        }
      ],
      "final_answer": "Entrepreneurs act as the catalysts who organize factors of production to compete in global markets."
    },
    {
      "number": 15,
      "problem": "Distinguish between 'Free Trade' and 'Protectionism'.",
      "image": null,
      "step_by_step": [
        {
          "step": "Free Trade",
          "explanation": "International trade left to its natural course without tariffs, quotas, or other restrictions."
        },
        {
          "step": "Protectionism",
          "explanation": "Government actions and policies that restrict or restrain international trade, often with the intent of protecting local businesses."
        }
      ],
      "final_answer": "Free trade promotes open markets; protectionism uses barriers to shield domestic industries."
    },
    {
      "number": 16,
      "problem": "Identify one benefit and one drawback of 'Regional Specialization' for a country.",
      "image": null,
      "step_by_step": [
        {
          "step": "Benefit",
          "explanation": "Efficiency gains from specialized infrastructure (e.g., Silicon Valley for tech)."
        },
        {
          "step": "Drawback",
          "explanation": "If that industry fails, the entire region suffers severe economic depression (e.g., the 'Rust Belt')."
        }
      ],
      "final_answer": "Regional specialization increases local expertise but creates high economic vulnerability."
    },
    {
      "number": 17,
      "problem": "Explain how a 'Quota' differs from a 'Tariff' in international trade.",
      "image": null,
      "step_by_step": [
        {
          "step": "Tariff",
          "explanation": "A tax on imported goods (raises price)."
        },
        {
          "step": "Quota",
          "explanation": "A physical limit on the quantity of a good that can be imported."
        }
      ],
      "final_answer": "Tariffs use price to restrict trade; quotas use quantity."
    },
    {
      "number": 18,
      "problem": "How does 'Capital Mobility' benefit a developing nation?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Investment",
          "explanation": "Capital mobility allows Foreign Direct Investment (FDI) to flow into the country."
        },
        {
          "step": "Analyze Impact",
          "explanation": "This brings in new technology, creates jobs, and improves local infrastructure."
        }
      ],
      "final_answer": "Capital mobility allows developing nations to access funds and technology they cannot generate domestically."
    },
    {
      "number": 19,
      "problem": "A country decides to switch from 'Labour Intensive' to 'Capital Intensive' farming. What is the likely short-term impact on employment?",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify Resource Substitution",
          "explanation": "Machinery (Capital) replaces human workers (Labour)."
        }
      ],
      "final_answer": "In the short term, this will likely lead to technological unemployment for farm laborers."
    },
    {
      "number": 20,
      "problem": "Why might a government use 'Subsidies' for its domestic exporters?",
      "image": null,
      "step_by_step": [
        {
          "step": "Lower Production Costs",
          "explanation": "Subsidies reduce the costs for local firms."
        },
        {
          "step": "Global Competition",
          "explanation": "This allows firms to sell their goods at lower prices in international markets, gaining market share."
        }
      ],
      "final_answer": "Subsidies make domestic exports more price-competitive against foreign rivals."
    }
  ]
}
