
{
  "topic": "7.7 De Broglie Waves",
  "unit_title": "De Broglie Waves and Matter Wave Properties",
  "unit_number": "Unit 7.7",
  "grade_level": "Grade 12",
  "subject": "Physics",
  "duration": "2-3 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "Detailed study of de Broglie matter waves, including mathematical formulation, experimental verification, wave packet dynamics, phase and group velocities, and applications in modern physics and technology.",

  "learning_objectives": [
    "Apply de Broglie relation λ = h/p to various particles",
    "Calculate phase and group velocities of matter waves",
    "Analyze experimental evidence for matter waves",
    "Understand wave packet formation and dispersion",
    "Solve problems involving electron diffraction",
    "Apply matter wave concepts to modern technologies"
  ],

  "prerequisites": [
    "Wave-particle duality concept",
    "Basic quantum mechanics introduction",
    "Special relativity fundamentals",
    "Wave properties and interference",
    "Classical mechanics momentum"
  ],

  "core_concept": {
    "principle": "De Broglie Waves: λ = h/p, Matter wave properties, Phase velocity v_p = c²/v, Group velocity v_g = v, Wave packets, Dispersion relations, Experimental verification, Bohr-Sommerfeld quantization, Wave-particle synthesis.",
    "explanation": "De Broglie's hypothesis that all matter exhibits wave properties with wavelength inversely proportional to momentum revolutionized physics and provided the foundation for wave mechanics.",
    "image": {
      "url": "images/debroglie-waves-core.png",
      "alt": "De Broglie waves fundamental concepts",
      "caption": "De Broglie matter waves and their properties"
    }
  },

  "sections": [
    {
      "section_title": "1. De Broglie Hypothesis and Mathematical Formulation",
      "introduction": "Louis de Broglie's revolutionary proposal of matter waves, mathematical formulation, and the profound implications for quantum theory.",

      "key_concept": {
        "definition": "De Broglie hypothesis: Matter waves, Wave-particle synthesis, Phase waves, Pilot wave concept, Relativistic formulation, Frequency-momentum relations, Wave-particle symmetry, Historical context, Nobel Prize achievement, Philosophical implications.",
        "context": "De Broglie's 1924 doctoral thesis proposed that wave-particle duality applies to all matter, not just light, fundamentally changing our understanding of quantum reality.",
        "image": {
          "url": "images/debroglie-hypothesis.png",
          "alt": "De Broglie hypothesis formulation",
          "caption": "De Broglie's matter wave concept and mathematical formulation"
        }
      },

      "classifications": [
        {
          "type": "Matter Wave Types",
          "value": "Classification based on particle types and their wave manifestations",
          "characteristics": [
            "Electron matter waves",
            "Neutron matter waves",
            "Atom matter waves",
            "Molecule matter waves",
            "Proton and nuclear matter waves",
            "Macroscopic object waves"
          ],
          "behavior": "Different particles exhibit characteristic wave behaviors: electrons show atomic-scale diffraction; neutrons demonstrate nuclear and magnetic scattering; atoms display quantum interference; molecules probe quantum-classical boundary; protons reveal nuclear structure; macroscopic objects have negligible wavelengths",
          "examples": [
            {
              "process": "De Broglie Relation Derivation",
              "explanation": "Theoretical foundation connecting Einstein's photon relations to material particles through relativistic invariance",
              "image": {
                "url": "images/debroglie-derivation.png",
                "alt": "De Broglie relation derivation",
                "caption": "Theoretical derivation of de Broglie relations"
              }
            },
            {
              "process": "Phase and Group Velocities",
              "explanation": "Distinction between phase velocity (wave crest speed) and group velocity (particle speed) in matter waves",
              "image": {
                "url": "images/phase-group-velocities.png",
                "alt": "Phase and group velocities",
                "caption": "Phase velocity vs group velocity in matter waves"
              }
            }
          ],
          "note": "De Broglie (1924): λ = h/p for all particles. Inspired by photon relations: E=hν, p=h/λ. Phase velocity: v_p = ω/k = E/p = c²/v > c. Group velocity: v_g = dω/dk = dE/dp = v (particle velocity). Relativistic: λ = h/γmv. Non-relativistic: λ = h/√(2mE). Bohr-Sommerfeld quantization: nλ = 2πr for circular orbits. Significance: unified wave-particle description, foundation for Schrödinger equation."
        }
      ],

      "principles": [
        {
          "principle": "De Broglie Hypothesis and Wave-Particle Synthesis",
          "statement": "Louis de Broglie's 1924 doctoral thesis proposed a radical synthesis of wave and particle concepts that applied to all matter: Fundamental Relations: For any particle with momentum p, the associated de Broglie wavelength is $\\lambda = \\frac{h}{p}$. For non-relativistic particles: $\\lambda = \\frac{h}{mv} = \\frac{h}{\\sqrt{2mE}}$. For relativistic particles: $\\lambda = \\frac{h}{p} = \\frac{h}{\\gamma mv}$, where $\\gamma = \\frac{1}{\\sqrt{1 - v^2/c^2}}$. The associated frequency is $\\nu = \\frac{E}{h} = \\frac{\\gamma mc^2}{h}$. Wave Velocities: The phase velocity of de Broglie waves is $v_p = \\lambda\\nu = \\frac{E}{p} = \\frac{\\gamma mc^2}{\\gamma mv} = \\frac{c^2}{v}$, which exceeds c for massive particles. The group velocity (velocity of wave packets) is $v_g = \\frac{d\\omega}{dk} = \\frac{dE}{dp} = v$, matching the particle velocity. For photons (m=0), $v_p = v_g = c$. Theoretical Motivation: De Broglie was motivated by the symmetry between light and matter in relativity. If light (traditionally waves) shows particle properties, then matter (traditionally particles) should show wave properties. He introduced phase waves that guide particles, with stationary phase conditions leading to Bohr's quantization rules. For circular orbits: $n\\lambda = 2\\pi r$, which gives $mvr = n\\hbar$, exactly Bohr's angular momentum quantization. Physical Interpretation: De Broglie initially proposed pilot waves that guide particles, but the modern interpretation is probabilistic through Schrödinger's wavefunction. Matter waves are probability waves, not physical oscillations. The wave nature becomes significant when $\\lambda$ is comparable to system dimensions. Historical Impact: Einstein recognized the importance of de Broglie's work and brought it to Schrödinger's attention, leading to wave mechanics. Experimental verification came quickly through electron diffraction experiments. De Broglie received the 1929 Nobel Prize for this discovery.",
          "application": "Calculate de Broglie wavelengths for various particles and energies. Determine phase and group velocities. Apply matter wave concepts to quantization conditions. Analyze wave-particle symmetry. Design experiments demonstrating matter waves. Understand historical development of quantum mechanics.",
          "example": "Electron at 100eV: λ=1.226/√100=0.1226nm. Proton at 1MeV: λ=1.226/√(1836×1000)=2.86×10⁻⁵nm. Thermal neutron: λ=0.18nm. Phase velocity for electron at 0.1c: v_p=c²/0.1c=10c.",
          "analogy": "Like a boat creating waves - the particle is like the boat itself (localized, with specific speed), while the matter wave is like the wave pattern it creates; the boat's speed matches the group velocity of the wave pattern, while individual wave crests move faster (phase velocity); the wavelength depends on how fast the boat moves, with faster boats having shorter wave patterns",
          "image": {
            "url": "images/debroglie-synthesis.png",
            "alt": "De Broglie wave-particle synthesis",
            "caption": "De Broglie's synthesis of wave and particle concepts"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "De Broglie Wavelength Calculations",
          "problem": "Calculate de Broglie wavelengths for: (a) Electron with 10eV energy, (b) Proton with 1keV energy, (c) Thermal helium atom at 300K, (d) 500keV photon.",
          "step_by_step": [
            {
              "step": "Electron at 10eV",
              "explanation": "λ = h/√(2mE) = 1.226/√E nm (E in eV) = 1.226/√10 = 1.226/3.162 = 0.388 nm"
            },
            {
              "step": "Proton at 1keV",
              "explanation": "m_p = 1836 m_e, so λ = 1.226/√(1836×1000) = 1.226/√1,836,000 = 1.226/1355 = 9.05×10⁻⁴ nm = 9.05 pm"
            },
            {
              "step": "Thermal helium atom",
              "explanation": "Average E = 3kT/2 = 1.5×1.38×10⁻²³×300 = 6.21×10⁻²¹ J = 0.0388 eV. m_He = 4×1.67×10⁻²⁷ = 6.68×10⁻²⁷ kg. λ = h/√(2mE) = 6.63×10⁻³⁴/√(2×6.68×10⁻²⁷×6.21×10⁻²¹) = 6.63×10⁻³⁴/√(8.29×10⁻⁴⁷) = 6.63×10⁻³⁴/9.11×10⁻²⁴ = 7.28×10⁻¹¹ m = 0.0728 nm"
            },
            {
              "step": "Photon at 500keV",
              "explanation": "For photons, λ = hc/E = 1240/E (with E in eV, λ in nm) = 1240/500,000 = 0.00248 nm"
            },
            {
              "step": "Physical significance",
              "explanation": "Electron wavelength atomic scale → important for atomic structure. Proton wavelength nuclear scale → relevant for nuclear physics. Atom wavelength atomic scale → atom interferometry possible. Photon wavelength much smaller → high penetration."
            }
          ],
          "final_answer": "(a) λ_e=0.388nm, (b) λ_p=9.05pm, (c) λ_He=0.0728nm, (d) λ_γ=0.00248nm. Demonstrates wavelength scaling with mass and energy.",
          "concept_applied": "De Broglie wavelength calculation",
          "image": {
            "url": "images/debroglie-wavelength-calc.png",
            "alt": "De Broglie wavelength calculations",
            "caption": "Calculation of de Broglie wavelengths for various particles"
          }
        },
        {
          "title": "Phase and Group Velocity Analysis",
          "problem": "For electron with v=0.1c: (a) Calculate de Broglie wavelength, (b) Phase velocity, (c) Group velocity, (d) Verify v_p × v_g = c², (e) Compare with photon.",
          "step_by_step": [
            {
              "step": "de Broglie wavelength",
              "explanation": "γ = 1/√(1-0.1²) = 1/√0.99 = 1.005, p = γmv = 1.005×9.11×10⁻³¹×3×10⁷ = 2.74×10⁻²³ kg·m/s, λ = h/p = 6.63×10⁻³⁴/2.74×10⁻²³ = 2.42×10⁻¹¹ m = 0.0242 nm"
            },
            {
              "step": "Phase velocity",
              "explanation": "v_p = c²/v = (3×10⁸)²/(0.1×3×10⁸) = 9×10¹⁶/3×10⁷ = 3×10⁹ m/s = 10c"
            },
            {
              "step": "Group velocity",
              "explanation": "v_g = v = 0.1c = 3×10⁷ m/s"
            },
            {
              "step": "Verification of relation",
              "explanation": "v_p × v_g = (10c) × (0.1c) = c². Relation holds exactly."
            },
            {
              "step": "Comparison with photon",
              "explanation": "For photon: v_p = v_g = c. For massive particles: v_p > c, v_g < c, product always c²."
            },
            {
              "step": "Physical interpretation",
              "explanation": "Phase velocity > c not problematic - no information transfer. Group velocity carries information, always ≤ c. Wave packet moves at particle speed."
            }
          ],
          "final_answer": "(a) λ=0.0242nm, (b) v_p=10c, (c) v_g=0.1c, (d) v_p×v_g=c² verified, (e) Photon: v_p=v_g=c. Demonstrates matter wave velocities.",
          "concept_applied": "Phase and group velocity analysis",
          "image": {
            "url": "images/velocity-analysis.png",
            "alt": "Velocity analysis example",
            "caption": "Analysis of phase and group velocities in matter waves"
          }
        }
      ]
    },
    {
      "section_title": "2. Experimental Verification and Electron Diffraction",
      "introduction": "Historical experiments confirming de Broglie's hypothesis, including electron diffraction, neutron scattering, and modern matter wave demonstrations.",

      "key_concept": {
        "definition": "Experimental verification: Davisson-Germer experiment, Thomson electron diffraction, Neutron diffraction, Atom interferometry, Molecule interference, Low-energy electron diffraction, Reflection high-energy diffraction, Electron microscopy, Experimental techniques, Bragg's law application, Intensity measurements.",
        "context": "Experimental confirmation of matter waves came rapidly after de Broglie's theoretical prediction, revolutionizing our understanding of quantum reality.",
        "image": {
          "url": "images/experimental-verification.png",
          "alt": "Experimental verification of matter waves",
          "caption": "Key experiments demonstrating matter wave phenomena"
        }
      },

      "classifications": [
        {
          "type": "Matter Wave Experiments",
          "value": "Classification based on experimental methods and particle types",
          "characteristics": [
            "Electron diffraction experiments",
            "Neutron scattering techniques",
            "Atom interferometry methods",
            "Molecule interference studies",
            "LEED and RHEED surface analysis",
            "Transmission electron microscopy"
          ],
          "behavior": "Different experimental approaches demonstrate characteristic matter wave behaviors: electron diffraction shows atomic-scale interference; neutron scattering probes nuclear and magnetic structures; atom interferometry demonstrates quantum coherence; molecule interference tests quantum limits; surface diffraction reveals crystal structures; electron microscopy achieves atomic resolution",
          "examples": [
            {
              "process": "Davisson-Germer Experiment",
              "explanation": "First experimental verification using electron diffraction from nickel crystals with precise Bragg law agreement",
              "image": {
                "url": "images/davisson-germer-detail.png",
                "alt": "Davisson-Germer experiment detail",
                "caption": "Davisson-Germer experimental setup and results"
              }
            },
            {
              "process": "Transmission Electron Microscopy",
              "explanation": "Application of electron wave properties to achieve atomic-scale imaging resolution",
              "image": {
                "url": "images/electron-microscopy.png",
                "alt": "Transmission electron microscopy",
                "caption": "Electron microscopy principles and resolution limits"
              }
            }
          ],
          "note": "Davisson-Germer (1927): electrons on Ni crystal, Bragg peaks match λ=h/p. G.P. Thomson: electron diffraction through thin films. Neutron diffraction: thermal neutrons λ~0.1-1nm, probes crystal structure and magnetism. Atom interferometry: laser cooling → slow atoms → large λ. Molecule interference: C₆₀, large molecules. LEED: low-energy electron diffraction for surfaces. TEM: uses electron waves for atomic resolution. All confirm λ=h/p precisely."
        }
      ],

      "principles": [
        {
          "principle": "Experimental Verification of Matter Waves",
          "statement": "The experimental confirmation of de Broglie's hypothesis came through several landmark experiments that demonstrated wave behavior of material particles: Davisson-Germer Experiment (1927): Clinton Davisson and Lester Germer accidentally discovered electron diffraction while studying electron scattering from nickel crystals. Their apparatus used an electron gun producing 54-600 eV electrons incident on a nickel target. A movable detector measured scattered electron intensity versus angle. They observed sharp peaks in intensity at specific angles that followed Bragg's law: $n\\lambda = 2d\\sin\\theta$, where d is the crystal plane spacing. For 54 eV electrons, the calculated de Broglie wavelength is $\\lambda = \\frac{h}{\\sqrt{2mE}} = \\frac{1.226}{\\sqrt{54}} = 0.167$ nm. The measured spacing from Bragg peaks gave $\\lambda = 0.165$ nm, excellent agreement. This provided the first definitive evidence for electron waves. G.P. Thomson's Experiment: Independently, George Paget Thomson demonstrated electron diffraction through thin metal foils. High-energy electrons (10-50 keV) passed through thin gold or aluminum foils produced ring patterns on photographic plates, analogous to X-ray Debye-Scherrer patterns. The ring diameters followed the expected diffraction relationships with $\\lambda = h/p$. Thomson and Davisson shared the 1937 Nobel Prize for their discoveries. Neutron Diffraction: Thermal neutrons from nuclear reactors have de Broglie wavelengths around 0.1-1 nm, ideal for crystal diffraction. Neutron diffraction provides complementary information to X-ray diffraction, being sensitive to light elements and magnetic structures. The wavelength follows $\\lambda = \\frac{h}{\\sqrt{2mE}} = \\frac{h}{\\sqrt{3mkT}}$ for thermal neutrons. Modern Developments: Atom interferometry uses laser-cooled atoms with large de Broglie wavelengths (microns) to demonstrate quantum interference. Molecule interference experiments with C₆₀ and larger molecules test the quantum-classical boundary. Low-energy electron diffraction (LEED) and reflection high-energy electron diffraction (RHEED) are standard surface science techniques. Transmission electron microscopy (TEM) achieves atomic resolution using electron waves. All these experiments consistently verify $\\lambda = h/p$ with high precision across many orders of magnitude in mass and energy.",
          "application": "Analyze diffraction patterns using de Broglie wavelengths. Calculate expected diffraction angles for various particles. Design matter wave experiments. Apply Bragg's law to electron and neutron diffraction. Understand resolution limits in particle-based microscopy. Interpret experimental data confirming wave nature.",
          "example": "Electron at 100eV: λ=0.1226nm. For graphite (d=0.123nm), first Bragg peak at θ=arcsin(λ/2d)=arcsin(0.1226/0.246)=30°. Neutron at 0.025eV: λ=0.18nm, for NaCl (d=0.282nm), θ=arcsin(0.18/0.564)=18.6°.",
          "analogy": "Like testing whether different sized balls can create wave patterns - electrons are like tiny marbles that make atomic-scale ripple patterns, neutrons are like slightly larger balls for nuclear-scale patterns, atoms are like basketballs making interference patterns we can see; each follows the same rule that faster moving balls make shorter wave patterns, exactly as de Broglie predicted",
          "image": {
            "url": "images/experimental-principle.png",
            "alt": "Experimental verification principle",
            "caption": "Experimental methods for verifying matter waves"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Electron Diffraction Analysis",
          "problem": "Electrons accelerated through 100V show first diffraction maximum at 25° from crystal planes with spacing 0.145nm. Verify de Broglie hypothesis.",
          "step_by_step": [
            {
              "step": "Calculated de Broglie wavelength",
              "explanation": "λ_calculated = h/√(2mE) = 1.226/√100 = 0.1226 nm"
            },
            {
              "step": "Wavelength from Bragg's law",
              "explanation": "nλ = 2d sinθ, for first maximum (n=1): λ_measured = 2×0.145×sin25° = 0.290×0.4226 = 0.1226 nm"
            },
            {
              "step": "Comparison",
              "explanation": "λ_calculated = 0.1226 nm, λ_measured = 0.1226 nm. Perfect agreement."
            },
            {
              "step": "Experimental significance",
              "explanation": "This level of agreement (within experimental error) provided compelling evidence for electron wave nature."
            },
            {
              "step": "Modern precision",
              "explanation": "Modern experiments verify λ=h/p to very high precision, establishing matter waves as fundamental quantum property."
            },
            {
              "step": "Broader implications",
              "explanation": "Confirmation that wave-particle duality applies universally, not just to light."
            }
          ],
          "final_answer": "Calculated λ=0.1226nm, measured λ=0.1226nm. Perfect agreement confirms de Broglie hypothesis and electron wave nature.",
          "concept_applied": "Electron diffraction analysis",
          "image": {
            "url": "images/electron-diffraction-verification.png",
            "alt": "Electron diffraction verification",
            "caption": "Verification of de Broglie hypothesis through electron diffraction"
          }
        },
        {
          "title": "Neutron Diffraction Application",
          "problem": "Thermal neutrons from reactor (most probable energy kT=0.025eV) used to study iron crystal (d=0.202nm for 110 planes). Find: (a) de Broglie wavelength, (b) Bragg angles for first three orders, (c) Why neutrons vs X-rays.",
          "step_by_step": [
            {
              "step": "de Broglie wavelength",
              "explanation": "λ = h/√(2mE) = 1.226/√(1836×0.025) = 1.226/√45.9 = 1.226/6.78 = 0.181 nm"
            },
            {
              "step": "First Bragg angle",
              "explanation": "n=1: sinθ₁ = λ/2d = 0.181/(2×0.202) = 0.181/0.404 = 0.448, θ₁ = 26.6°"
            },
            {
              "step": "Second Bragg angle",
              "explanation": "n=2: sinθ₂ = 2λ/2d = λ/d = 0.181/0.202 = 0.896, θ₂ = 63.8°"
            },
            {
              "step": "Third Bragg angle",
              "explanation": "n=3: sinθ₃ = 3λ/2d = 3×0.181/(2×0.202) = 0.543/0.404 = 1.344 (not possible - no third order)"
            },
            {
              "step": "Neutron advantages",
              "explanation": "Neutrons sensitive to light elements (H, C, O); probe magnetic structures; different scattering cross sections; non-destructive; penetrate deeply."
            },
            {
              "step": "Comparison with X-rays",
              "explanation": "X-rays scatter from electrons, neutrons from nuclei. Complementary techniques for complete structure determination."
            }
          ],
          "final_answer": "(a) λ=0.181nm, (b) θ₁=26.6°, θ₂=63.8°, no third order, (c) Neutrons probe light elements and magnetism better than X-rays. Demonstrates neutron diffraction application.",
          "concept_applied": "Neutron diffraction analysis",
          "image": {
            "url": "images/neutron-diffraction.png",
            "alt": "Neutron diffraction example",
            "caption": "Neutron diffraction analysis and applications"
          }
        }
      ]
    },
    {
      "section_title": "3. Wave Packets and Modern Applications",
      "introduction": "Formation and properties of matter wave packets, dispersion relations, and contemporary applications of de Broglie waves in science and technology.",

      "key_concept": {
        "definition": "Wave packets: Superposition principle, Dispersion relations, Gaussian wave packets, Uncertainty principle connection, Packet spreading, Coherence length, Matter wave optics, Atom lasers, Quantum reflection, Neutron guides, Electron holography, Future applications.",
        "context": "Wave packets provide the mathematical description of localized quantum particles, while modern applications exploit matter wave properties for advanced technologies.",
        "image": {
          "url": "images/wave-packets-applications.png",
          "alt": "Wave packets and modern applications",
          "caption": "Wave packet dynamics and contemporary matter wave applications"
        }
      },

      "classifications": [
        {
          "type": "Matter Wave Applications",
          "value": "Classification based on technological implementations and scientific fields",
          "characteristics": [
            "Electron microscopy and holography",
            "Neutron scattering and imaging",
            "Atom interferometry and lasers",
            "Quantum reflection devices",
            "Matter wave sensors",
            "Quantum information processing"
          ],
          "behavior": "Different applications utilize specific matter wave properties: electron microscopy exploits short wavelengths for resolution; neutron scattering uses nuclear interactions for structure analysis; atom interferometry employs quantum coherence for precision measurement; quantum reflection manipulates wave evanescence; matter wave sensors achieve extreme sensitivity; quantum information processes wave superpositions",
          "examples": [
            {
              "process": "Wave Packet Dynamics",
              "explanation": "Mathematical description of localized quantum states through superposition of plane waves with dispersion",
              "image": {
                "url": "images/wave-packet-dynamics.png",
                "alt": "Wave packet dynamics",
                "caption": "Wave packet formation, spreading, and time evolution"
              }
            },
            {
              "process": "Atom Interferometry",
              "explanation": "Precision measurement technique using matter wave interference of laser-cooled atoms",
              "image": {
                "url": "images/atom-interferometry.png",
                "alt": "Atom interferometry",
                "caption": "Atom interferometer principles and applications"
              }
            }
          ],
          "note": "Wave packets: superposition of plane waves → localized particle. Gaussian packets: minimum uncertainty. Dispersion: different k-components travel at different speeds → packet spreads. Free particle: ω ∝ k² → dispersive. Coherence length: distance over which phase defined. Applications: TEM (atomic resolution), neutron imaging (non-destructive testing), atom interferometry (precision measurements), atom lasers (coherent matter waves), quantum reflection (wave evanescence), future quantum technologies."
        }
      ],

      "principles": [
        {
          "principle": "Wave Packets and Modern Matter Wave Applications",
          "statement": "The description of localized quantum particles requires wave packets, while modern technology exploits matter wave properties in numerous applications: Wave Packet Formation: A wave packet is a superposition of plane waves: $\\psi(x,t) = \\int_{-\\infty}^{\\infty} A(k)e^{i(kx - \\omega t)}dk$, where A(k) is the amplitude distribution. For a free particle, the dispersion relation is $\\omega = \\frac{\\hbar k^2}{2m}$. A Gaussian wave packet has minimum uncertainty: $\\psi(x,0) = \\frac{1}{(2\\pi\\sigma_x^2)^{1/4}}e^{-x^2/4\\sigma_x^2}e^{ip_0x/\\hbar}$, with initial width $\\sigma_x$. Wave Packet Spreading: For a free particle, the wave packet spreads with time: $\\sigma_x(t) = \\sigma_x\\sqrt{1 + \\left(\\frac{\\hbar t}{2m\\sigma_x^2}\\right)^2}$. The spreading rate is significant for light particles (electrons) but negligible for macroscopic objects. The group velocity is $v_g = \\frac{d\\omega}{dk} = \\frac{\\hbar k}{m} = \\frac{p}{m}$, matching classical velocity. Modern Applications: Electron Microscopy: Transmission electron microscopes (TEM) use electron waves with λ~0.001-0.1 nm to achieve atomic resolution. Scanning tunneling microscopes (STM) use electron wave tunneling for atomic-scale imaging. Neutron Scattering: Neutron diffraction probes crystal structures, magnetic ordering, and light element positions. Neutron imaging provides non-destructive testing for engineering components. Atom Interferometry: Laser-cooled atoms with large de Broglie wavelengths (microns) enable ultra-precise measurements of: Gravity and gravity gradients; rotations and inertial forces; Fundamental constants; Tests of general relativity. Atom Lasers: Bose-Einstein condensates can produce coherent matter waves analogous to optical lasers, with applications in precision measurement and quantum simulation. Quantum Reflection: Atoms can reflect from surfaces at energies where classical particles would stick, due to wave nature. Used in atomic mirrors and guides. Future Directions: Quantum computing using matter wave superpositions; Matter wave sensors for navigation and resource exploration; Quantum-enhanced imaging beyond classical limits; Tests of quantum foundations and gravity. These applications demonstrate that de Broglie's matter wave concept is not just a theoretical curiosity but underlies important modern technologies.",
          "application": "Calculate wave packet spreading for various particles. Design matter wave interferometers. Apply de Broglie concepts to microscopy resolution limits. Analyze coherence requirements for quantum applications. Understand technological implementations of matter waves. Predict behavior of quantum systems using wave packet dynamics.",
          "example": "Electron wave packet with σ_x=1nm: spreading time τ=2mσ_x²/ħ=2×9.11×10⁻³¹×(10⁻⁹)²/1.05×10⁻³⁴=1.74×10⁻¹⁴s. Atom wave packet with σ_x=1μm: τ=2×1.67×10⁻²⁷×(10⁻⁶)²/1.05×10⁻³⁴=3.18×10⁻⁵s. TEM resolution: δ~λ/2~0.05nm for 100keV electrons.",
          "analogy": "Like making a localized sound pulse - you need many different frequency waves added together; the pulse moves at the group speed (sound speed), but individual waves move differently; light pulses spread little (light waves), but electron pulses spread quickly (matter waves); modern applications are like using these quantum sound pulses for super-precise measurements and imaging",
          "image": {
            "url": "images/wave-packet-applications.png",
            "alt": "Wave packet applications",
            "caption": "Wave packet dynamics and modern matter wave applications"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Wave Packet Spreading Calculation",
          "problem": "Electron wave packet initially localized to 1nm width. Find: (a) Initial momentum uncertainty, (b) Time to double in size, (c) Distance traveled before doubling, (d) Compare with 1μm atom wave packet.",
          "step_by_step": [
            {
              "step": "Initial momentum uncertainty",
              "explanation": "Δp ≥ ħ/(2Δx) = 1.05×10⁻³⁴/(2×10⁻⁹) = 5.25×10⁻²⁶ kg·m/s"
            },
            {
              "step": "Time to double in size",
              "explanation": "σ_x(t) = σ_x√[1 + (ħt/2mσ_x²)²] = 2σ_x when ħt/2mσ_x² = √3, so t = 2mσ_x²√3/ħ = 2×9.11×10⁻³¹×(10⁻⁹)²×1.732/1.05×10⁻³⁴ = 3.01×10⁻¹⁴ s"
            },
            {
              "step": "Distance traveled",
              "explanation": "Average p = Δp (order of magnitude), v = p/m = 5.25×10⁻²⁶/9.11×10⁻³¹ = 5.76×10⁴ m/s, distance = vt = 5.76×10⁴×3.01×10⁻¹⁴ = 1.73×10⁻⁹ m = 1.73 nm"
            },
            {
              "step": "Atom wave packet comparison",
              "explanation": "For rubidium atom (m=1.4×10⁻²⁵kg) with σ_x=1μm: t = 2×1.4×10⁻²⁵×(10⁻⁶)²×1.732/1.05×10⁻³⁴ = 4.62×10⁻⁴ s, much longer spreading time."
            },
            {
              "step": "Physical significance",
              "explanation": "Electron wave packets spread rapidly on atomic scales. Atom wave packets spread much slower, enabling atom interferometry over macroscopic distances."
            }
          ],
          "final_answer": "(a) Δp≥5.25×10⁻²⁶kg·m/s, (b) t=3.01×10⁻¹⁴s, (c) d=1.73nm, (d) Atom packet: t=0.46ms (much slower spreading). Demonstrates wave packet dynamics.",
          "concept_applied": "Wave packet spreading calculation",
          "image": {
            "url": "images/wave-packet-spreading.png",
            "alt": "Wave packet spreading example",
            "caption": "Calculation of wave packet spreading for electrons and atoms"
          }
        },
        {
          "title": "Electron Microscopy Resolution",
          "problem": "Transmission electron microscope using 200keV electrons. Find: (a) de Broglie wavelength, (b) Theoretical resolution limit, (c) Actual resolution with aberrations, (d) Comparison with light microscope.",
          "step_by_step": [
            {
              "step": "de Broglie wavelength",
              "explanation": "Relativistic: E_total = E_kinetic + mc² = 200 + 511 = 711 keV, p = √(E_total² - (mc²)²)/c = √(711² - 511²)/c = √(505,521 - 261,121)/c = √244,400/c = 494.4 keV/c, λ = h/p = 1240/494,400 = 0.00251 nm"
            },
            {
              "step": "Theoretical resolution",
              "explanation": "Rayleigh criterion: δ ≈ λ/2 = 0.00125 nm (theoretical limit)"
            },
            {
              "step": "Actual resolution",
              "explanation": "With lens aberrations, practical resolution ~0.1-0.2 nm for best TEMs. Aberration-corrected TEMs achieve ~0.05 nm."
            },
            {
              "step": "Comparison with light microscope",
              "explanation": "Visible light λ~500nm, resolution ~250nm. TEM provides ~1000× better resolution, enabling atomic-scale imaging."
            },
            {
              "step": "Applications",
              "explanation": "Atomic structure determination, defect analysis, biological macromolecules, nanomaterials characterization."
            },
            {
              "step": "Future developments",
              "explanation": "Monochromators reduce energy spread, aberration correctors improve resolution, new detectors increase sensitivity."
            }
          ],
          "final_answer": "(a) λ=0.00251nm, (b) Theoretical δ=0.00125nm, (c) Actual δ~0.05-0.2nm, (d) 1000× better than light microscopy. Demonstrates matter wave application.",
          "concept_applied": "Electron microscopy resolution",
          "image": {
            "url": "images/electron-microscopy-resolution.png",
            "alt": "Electron microscopy resolution example",
            "caption": "Resolution analysis in electron microscopy"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "De Broglie wavelength",
    "Matter waves",
    "Phase velocity",
    "Group velocity",
    "Wave packets",
    "Dispersion relation",
    "Electron diffraction",
    "Neutron scattering",
    "Atom interferometry",
    "Wave packet spreading",
    "Bragg's law",
    "Quantum coherence"
  ],

  "common_misconceptions": [
    "Thinking matter waves are physical vibrations",
    "Believing phase velocity violation means information travels faster than light",
    "Confusing de Broglie wavelength with physical size",
    "Thinking quantum effects don't apply to macroscopic objects",
    "Believing wave packets don't spread in free space",
    "Confusing group velocity with signal velocity"
  ],

  "real_world_applications": [
    "Transmission electron microscopy",
    "Scanning tunneling microscopy",
    "Neutron diffraction for materials analysis",
    "Atom interferometry for precision measurement",
    "Low-energy electron diffraction for surfaces",
    "Quantum reflection devices",
    "Atom lasers and coherent matter waves",
    "Electron holography",
    "Neutron imaging for non-destructive testing",
    "Quantum-enhanced sensors"
  ],

  "summary": "De Broglie's hypothesis λ = h/p establishes that all matter exhibits wave properties, with experimental verification through electron diffraction (Davisson-Germer, Thomson), neutron scattering, and atom interferometry. Matter waves have phase velocity v_p = c²/v (exceeding c) and group velocity v_g = v (particle velocity). Wave packets describe localized quantum particles and spread with time due to dispersion. Modern applications include electron microscopy (atomic resolution), neutron scattering (materials analysis), atom interferometry (precision measurement), and emerging quantum technologies. De Broglie waves provide the fundamental connection between particle dynamics and wave behavior that underlies quantum mechanics and enables numerous advanced technologies."
}