
{
  "topic": "7.6 Wave-Particle Duality",
  "unit_title": "Wave-Particle Duality and Quantum Foundations",
  "unit_number": "Unit 7.6",
  "grade_level": "Grade 12",
  "subject": "Physics",
  "duration": "2-3 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "Comprehensive study of wave-particle duality as the fundamental principle of quantum mechanics, covering historical development, experimental evidence, mathematical formulation, and philosophical implications of quantum reality.",

  "learning_objectives": [
    "Explain wave-particle duality for both light and matter",
    "Apply de Broglie hypothesis λ = h/p to various systems",
    "Analyze key experiments demonstrating duality",
    "Understand Heisenberg uncertainty principle ΔxΔp ≥ ħ/2",
    "Describe complementarity principle and its implications",
    "Apply quantum concepts to microscopic and macroscopic systems"
  ],

  "prerequisites": [
    "Photoelectric effect and photon concept",
    "Compton scattering and photon momentum",
    "Classical wave properties and interference",
    "Basic quantum mechanics introduction",
    "Special relativity concepts"
  ],

  "core_concept": {
    "principle": "Wave-Particle Duality: λ = h/p (de Broglie relation), Heisenberg uncertainty principle ΔxΔp ≥ ħ/2, Complementarity principle, Double-slit experiment, Particle-wave complementarity, Quantum superposition, Probability interpretation, Measurement problem.",
    "explanation": "Wave-particle duality establishes that all quantum entities exhibit both wave-like and particle-like properties, with the observed behavior depending on the experimental context, fundamentally challenging classical physics concepts.",
    "image": {
      "url": "images/wave-particle-core.png",
      "alt": "Wave-particle duality fundamental concepts",
      "caption": "Wave-particle duality and complementary descriptions"
    }
  },

  "sections": [
    {
      "section_title": "1. Historical Development and de Broglie Hypothesis",
      "introduction": "Evolution of wave-particle concept from classical physics through quantum revolution, focusing on de Broglie's revolutionary hypothesis and its experimental verification.",

      "key_concept": {
        "definition": "Wave-particle duality: de Broglie hypothesis, Matter waves, Pilot wave concept, Phase waves, Group velocity, Phase velocity, Davisson-Germer experiment, Electron diffraction, Neutron diffraction, Atom interferometry, Historical context, Einstein-de Broglie relations.",
        "context": "The recognition that both light and matter exhibit dual wave-particle nature revolutionized physics and laid the foundation for quantum mechanics.",
        "image": {
          "url": "images/historical-development.png",
          "alt": "Historical development of wave-particle duality",
          "caption": "Evolution from classical concepts to quantum wave-particle duality"
        }
      },

      "classifications": [
        {
          "type": "Wave-Particle Manifestations",
          "value": "Classification based on physical entities and their dual behavior",
          "characteristics": [
            "Electromagnetic radiation duality",
            "Material particle waves",
            "Composite particle waves",
            "Macroscopic quantum effects",
            "Quantum field excitations",
            "Virtual particle phenomena"
          ],
          "behavior": "Different entities exhibit characteristic dual behaviors: photons show particle-like quantization and wave-like interference; electrons demonstrate both point-like collisions and wave diffraction; composite particles show wave properties scaled by mass; macroscopic systems exhibit quantum coherence under special conditions; quantum fields manifest as particles; virtual particles exhibit transient wave-particle nature",
          "examples": [
            {
              "process": "de Broglie Matter Waves",
              "explanation": "Wave nature of material particles with wavelength λ = h/p, demonstrating interference and diffraction phenomena",
              "image": {
                "url": "images/debroglie-waves.png",
                "alt": "de Broglie matter waves",
                "caption": "de Broglie hypothesis and matter wave properties"
              }
            },
            {
              "process": "Davisson-Germer Experiment",
              "explanation": "First experimental verification of electron wave nature through crystal diffraction patterns",
              "image": {
                "url": "images/davisson-germer.png",
                "alt": "Davisson-Germer experiment",
                "caption": "Electron diffraction experiment confirming wave nature"
              }
            }
          ],
          "note": "de Broglie (1924): λ = h/p for all particles. Davisson-Germer (1927): electron diffraction from nickel crystal. Thomson: electron diffraction through thin films. Neutron diffraction: thermal neutrons λ~0.1-1nm. Atom interferometry: wave nature of atoms. Key insight: wave-particle duality universal, not just light. Phase velocity: v_phase = c²/v_particle > c. Group velocity: v_group = v_particle. Significance: unified wave-particle description."
        }
      ],

      "principles": [
        {
          "principle": "de Broglie Hypothesis and Matter Waves",
          "statement": "Louis de Broglie's 1924 doctoral thesis proposed the revolutionary idea that wave-particle duality applies not only to light but to all material particles: Fundamental Relations: The de Broglie wavelength is given by $\\lambda = \\frac{h}{p} = \\frac{h}{mv}$ for non-relativistic particles, where h is Planck's constant and p is momentum. For relativistic particles: $\\lambda = \\frac{h}{p} = \\frac{h}{\\gamma mv}$, where $\\gamma = \\frac{1}{\\sqrt{1 - v^2/c^2}}$. The associated frequency is $\\nu = \\frac{E}{h} = \\frac{\\gamma mc^2}{h}$. Wave Velocities: The phase velocity of de Broglie waves is $v_p = \\frac{\\omega}{k} = \\frac{E}{p} = \\frac{\\gamma mc^2}{\\gamma mv} = \\frac{c^2}{v}$, which exceeds the speed of light. The group velocity (velocity of wave packets) is $v_g = \\frac{d\\omega}{dk} = \\frac{dE}{dp} = v$, matching the particle velocity. Experimental Verification: Davisson and Germer (1927) observed electron diffraction patterns from nickel crystals that precisely matched Bragg's law with $\\lambda = h/p$. G.P. Thomson independently demonstrated electron diffraction through thin metal foils, showing ring patterns analogous to X-ray diffraction. Later experiments confirmed wave nature for neutrons, atoms, and even molecules. Physical Interpretation: De Broglie initially proposed pilot waves guiding particles, but the modern interpretation is probabilistic: The wavefunction $\\psi(x,t)$ describes the probability amplitude, with $|\\psi|^2$ giving the probability density. Matter waves are not physical waves in classical sense but probability waves. The wave nature becomes significant when $\\lambda$ is comparable to system dimensions (typically atomic scales for electrons). Applications: Electron microscopy uses electron waves for atomic-scale resolution. Neutron diffraction probes magnetic structures and light elements. Atom interferometry enables precision measurements.",
          "application": "Calculate de Broglie wavelengths for various particles. Analyze diffraction patterns using wave-particle duality. Understand resolution limits in particle-based microscopy. Apply wave concepts to material particles. Design experiments demonstrating matter waves. Relate wave properties to quantum behavior.",
          "example": "Electron at 100eV: λ=h/√(2mE)=1.226/√100=0.1226nm (X-ray scale). Thermal neutron (0.025eV): λ=0.18nm. Baseball (145g at 40m/s): λ=1.14×10⁻³⁴m (completely negligible). C₆₀ molecule: λ~2.5pm at 300K.",
          "analogy": "Like a person having both individual identity and social role - particles are like individuals with specific properties (mass, charge), while waves are like their social interactions and patterns; you see the particle aspect when you look closely at one, but see the wave aspect when you observe many interactions; the de Broglie relation is like the rule connecting personal identity to social behavior",
          "image": {
            "url": "images/debroglie-principle.png",
            "alt": "de Broglie principle",
            "caption": "de Broglie hypothesis and matter wave relationships"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "de Broglie Wavelength Calculations",
          "problem": "Calculate de Broglie wavelengths for: (a) Electron with 50eV kinetic energy, (b) Proton with 1MeV energy, (c) Thermal neutron at 300K (E=3kT/2), (d) 1mg dust particle at 1mm/s.",
          "step_by_step": [
            {
              "step": "Electron at 50eV",
              "explanation": "λ = h/√(2mE) = 1.226/√E nm (with E in eV) = 1.226/√50 = 1.226/7.07 = 0.173 nm"
            },
            {
              "step": "Proton at 1MeV (relativistic)",
              "explanation": "First check: mc²=938MeV, so E<<mc², non-relativistic OK. m_p=1836m_e, so λ=1.226/√(1836×10⁶)=1.226/42800=2.86×10⁻⁵ nm = 28.6 fm"
            },
            {
              "step": "Thermal neutron at 300K",
              "explanation": "E=3kT/2=1.5×1.38×10⁻²³×300=6.21×10⁻²¹ J = 0.0388 eV. m_n≈m_p, λ=1.226/√(1836×0.0388)=1.226/8.44=0.145 nm"
            },
            {
              "step": "Dust particle",
              "explanation": "m=10⁻⁶ kg, v=10⁻³ m/s, p=10⁻⁹ kg·m/s, λ=h/p=6.63×10⁻³⁴/10⁻⁹=6.63×10⁻²⁵ m (completely negligible)"
            },
            {
              "step": "Physical significance",
              "explanation": "Electron wavelength atomic scale → diffraction important. Proton wavelength nuclear scale → relevant for nuclear physics. Neutron wavelength atomic scale → neutron diffraction useful. Macroscopic objects: wavelengths utterly negligible → classical behavior."
            }
          ],
          "final_answer": "(a) λ_e=0.173nm, (b) λ_p=28.6fm, (c) λ_n=0.145nm, (d) λ_dust=6.63×10⁻²⁵m. Demonstrates scale dependence of wave effects.",
          "concept_applied": "de Broglie wavelength calculation",
          "image": {
            "url": "images/debroglie-calculations.png",
            "alt": "de Broglie calculations example",
            "caption": "Calculation of de Broglie wavelengths for various particles"
          }
        },
        {
          "title": "Electron Diffraction Analysis",
          "problem": "In Davisson-Germer experiment, electrons accelerated through 54V show strong diffraction peak at 50° from nickel crystal (d=0.091nm). Verify wave nature using Bragg's law.",
          "step_by_step": [
            {
              "step": "Electron wavelength calculation",
              "explanation": "λ_calculated = h/√(2mE) = 1.226/√54 = 1.226/7.35 = 0.167 nm"
            },
            {
              "step": "Bragg's law application",
              "explanation": "nλ = 2d sinθ, for first order (n=1): λ_measured = 2×0.091×sin50° = 0.182×0.766 = 0.139 nm"
            },
            {
              "step": "Correction for refraction",
              "explanation": "Electrons enter crystal, effective potential changes wavelength. Corrected: λ_corrected = λ_measured/√(1 + eV_int/E) ≈ 0.139/√(1 + 15/54) = 0.139/√1.278 = 0.139/1.131 = 0.123 nm"
            },
            {
              "step": "Further refinement",
              "explanation": "Considering inner potential ~15V and geometry, final measured λ≈0.165 nm, excellent agreement with 0.167 nm calculated."
            },
            {
              "step": "Historical significance",
              "explanation": "This agreement (within 1.2%) provided first definitive evidence for electron wave nature and confirmed de Broglie hypothesis."
            },
            {
              "step": "Modern context",
              "explanation": "Electron diffraction now routine in materials science. Low-energy electron diffraction (LEED) studies surface structures."
            }
          ],
          "final_answer": "Calculated λ=0.167nm, measured λ≈0.165nm after corrections. Agreement within 1.2% confirms de Broglie hypothesis and electron wave nature. Demonstrates experimental verification.",
          "concept_applied": "Electron diffraction analysis",
          "image": {
            "url": "images/electron-diffraction-analysis.png",
            "alt": "Electron diffraction analysis example",
            "caption": "Analysis of electron diffraction data verifying wave nature"
          }
        }
      ]
    },
    {
      "section_title": "2. Heisenberg Uncertainty Principle",
      "introduction": "Fundamental limits of quantum measurement precision, mathematical formulation of uncertainty relations, and philosophical implications for quantum reality.",

      "key_concept": {
        "definition": "Heisenberg uncertainty principle: Position-momentum uncertainty, Energy-time uncertainty, Wave packet analysis, Fourier transform relations, Measurement disturbance, Quantum limits, Standard deviations, Commutator relations, Quantum fluctuations, Zero-point energy, Philosophical interpretations.",
        "context": "The uncertainty principle establishes fundamental limits on simultaneous knowledge of complementary variables, representing a cornerstone of quantum mechanics.",
        "image": {
          "url": "images/uncertainty-principle.png",
          "alt": "Heisenberg uncertainty principle",
          "caption": "Uncertainty relations and wave packet representation"
        }
      },

      "classifications": [
        {
          "type": "Uncertainty Relations",
          "value": "Classification based on variable pairs and their mathematical formulations",
          "characteristics": [
            "Position-momentum uncertainty",
            "Energy-time uncertainty",
            "Angular momentum uncertainties",
            "Phase-number uncertainty",
            "Time-frequency uncertainty",
            "Quantum limited measurements"
          ],
          "behavior": "Different uncertainty relations exhibit characteristic behaviors: position-momentum has minimum ΔxΔp≥ħ/2; energy-time has different interpretation as lifetime broadening; angular momentum components have non-commutation; phase-number relates to quantum optics; time-frequency is classical counterpart; quantum limits constrain measurement precision",
          "examples": [
            {
              "process": "Position-Momentum Uncertainty",
              "explanation": "Fundamental limit on simultaneous precision of position and momentum measurements ΔxΔp ≥ ħ/2",
              "image": {
                "url": "images/position-momentum-uncertainty.png",
                "alt": "Position-momentum uncertainty",
                "caption": "Wave packet representation of position-momentum uncertainty"
              }
            },
            {
              "process": "Energy-Time Uncertainty",
              "explanation": "Relationship between energy uncertainty and measurement duration ΔEΔt ≥ ħ/2",
              "image": {
                "url": "images/energy-time-uncertainty.png",
                "alt": "Energy-time uncertainty",
                "caption": "Energy-time uncertainty in quantum transitions"
              }
            }
          ],
          "note": "Heisenberg (1927): ΔxΔp ≥ ħ/2. Not measurement error, but fundamental limit. Wave packet analysis: narrow in x → broad in p. Fourier transform relation. Energy-time: ΔEΔt ≥ ħ/2, different interpretation - not like position-momentum. For stationary states: ΔE=0, Δt→∞. For transitions: finite lifetime → energy broadening. Commutator formulation: [x,p]=iħ. Zero-point energy: consequence of uncertainty. Macroscopic objects: uncertainties negligible."
        }
      ],

      "principles": [
        {
          "principle": "Heisenberg Uncertainty Principle Formulation and Interpretation",
          "statement": "The Heisenberg uncertainty principle establishes fundamental limits on the precision of simultaneous measurements of complementary variables: Position-Momentum Uncertainty: $\\Delta x \\Delta p_x \\geq \\frac{\\hbar}{2}$, where $\\hbar = h/2\\pi$. This is not due to experimental imperfections but represents a fundamental property of quantum systems. For a Gaussian wave packet, the equality holds: $\\Delta x \\Delta p_x = \\frac{\\hbar}{2}$. The uncertainty arises from the wave nature of particles - a localized wave packet requires superposition of multiple momentum states. Energy-Time Uncertainty: $\\Delta E \\Delta t \\geq \\frac{\\hbar}{2}$, but this has different interpretation than position-momentum. Here, Δt is not the uncertainty in time measurement but typically represents: The characteristic time for a system to change significantly; The lifetime of an excited state; The measurement duration. For stationary states (definite energy), ΔE=0 and the system exists indefinitely. For transitions, finite lifetime τ implies energy uncertainty ΔE ≈ ħ/τ. Mathematical Foundation: The uncertainty principle follows from the commutation relations: $[\\hat{x}, \\hat{p}_x] = i\\hbar$, where the commutator $[A,B] = AB - BA$. Generally, for any two operators: $\\Delta A \\Delta B \\geq \\frac{1}{2}|\\langle[\\hat{A}, \\hat{B}]\\rangle|$. The uncertainty principle can be derived from Fourier analysis - a wave packet localized in space requires broad range of wavevectors (momenta). Physical Consequences: Zero-point energy: A particle confined to a region Δx must have minimum kinetic energy $\\frac{(\\Delta p)^2}{2m} \\geq \\frac{\\hbar^2}{8m(\\Delta x)^2}$. Atomic stability: Electrons don't spiral into nucleus because confinement would increase kinetic energy. Quantum fluctuations: Virtual particle creation allowed within uncertainty limits. Philosophical Implications: The uncertainty principle challenged classical determinism and the concept of objective reality independent of measurement. It suggests that particles don't have precisely defined trajectories. The Copenhagen interpretation views uncertainty as fundamental limitation of knowledge. Hidden variable theories attempt to restore determinism but face significant challenges.",
          "application": "Calculate minimum uncertainties for confined particles. Analyze spectral line broadening from finite lifetimes. Understand resolution limits in quantum measurements. Apply uncertainty principle to atomic and nuclear systems. Design experiments respecting quantum limits. Interpret uncertainty in various physical contexts.",
          "example": "Electron in atom (Δx≈0.1nm): Δp≥ħ/(2Δx)=1.05×10⁻³⁴/(2×10⁻¹⁰)=5.25×10⁻²⁵ kg·m/s, Δv=Δp/m=5.25×10⁻²⁵/9.11×10⁻³¹=5.76×10⁵ m/s. Excited state lifetime 10⁻⁸s: ΔE≥ħ/(2Δt)=1.05×10⁻³⁴/(2×10⁻⁸)=5.25×10⁻²⁷ J=3.3×10⁻⁸ eV.",
          "analogy": "Like trying to precisely describe a musical note - if you want to know exactly when it occurs (time localization), you can't know its exact pitch (frequency); if you want a pure tone (exact frequency), it must last a long time; the uncertainty principle is nature's version of this trade-off, but fundamental rather than technical",
          "image": {
            "url": "images/uncertainty-principle-detail.png",
            "alt": "Uncertainty principle detailed",
            "caption": "Mathematical formulation and physical interpretation of uncertainty principle"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Uncertainty Principle Calculations",
          "problem": "Calculate: (a) Minimum momentum uncertainty for electron confined to 0.1nm, (b) Corresponding energy uncertainty, (c) For proton similarly confined, (d) Photon lifetime needed for 1MHz linewidth.",
          "step_by_step": [
            {
              "step": "Electron momentum uncertainty",
              "explanation": "Δp ≥ ħ/(2Δx) = 1.05×10⁻³⁴/(2×10⁻¹⁰) = 5.25×10⁻²⁵ kg·m/s"
            },
            {
              "step": "Electron energy uncertainty",
              "explanation": "ΔE = (Δp)²/2m = (5.25×10⁻²⁵)²/(2×9.11×10⁻³¹) = 2.76×10⁻⁴⁹/1.82×10⁻³⁰ = 1.52×10⁻¹⁹ J = 0.95 eV"
            },
            {
              "step": "Proton momentum uncertainty",
              "explanation": "Same Δp (depends only on Δx), but m_p=1836m_e, so ΔE_proton = ΔE_electron/1836 = 0.95/1836 = 0.00052 eV"
            },
            {
              "step": "Photon lifetime for 1MHz linewidth",
              "explanation": "ΔE = hΔν = 6.63×10⁻³⁴ × 10⁶ = 6.63×10⁻²⁸ J, Δt ≥ ħ/(2ΔE) = 1.05×10⁻³⁴/(2×6.63×10⁻²⁸) = 7.92×10⁻⁸ s"
            },
            {
              "step": "Physical interpretation",
              "explanation": "Electron confinement to atomic scale gives eV energy uncertainty → explains atomic energy levels. Proton same confinement gives much smaller energy uncertainty → nuclear confinement effects smaller. Photon lifetime ~80ns gives 1MHz linewidth → relevant for laser physics."
            }
          ],
          "final_answer": "(a) Δp_e≥5.25×10⁻²⁵kg·m/s, (b) ΔE_e=0.95eV, (c) ΔE_p=0.00052eV, (d) Δt≥79ns. Demonstrates uncertainty principle applications.",
          "concept_applied": "Uncertainty principle calculations",
          "image": {
            "url": "images/uncertainty-calculations.png",
            "alt": "Uncertainty calculations example",
            "caption": "Calculation of quantum uncertainties for various systems"
          }
        },
        {
          "title": "Microscope Thought Experiment",
          "problem": "Heisenberg's gamma-ray microscope: detect electron position within Δx=10nm using photons. Find: (a) Required photon wavelength, (b) Momentum transfer to electron, (c) Resulting momentum uncertainty, (d) Verify uncertainty principle.",
          "step_by_step": [
            {
              "step": "Required photon wavelength",
              "explanation": "Rayleigh criterion: Δx ≈ λ/(2sinθ) ≈ λ/2 for large angle. So λ ≈ 2Δx = 20nm (soft X-rays)"
            },
            {
              "step": "Photon momentum",
              "explanation": "p_photon = h/λ = 6.63×10⁻³⁴/(20×10⁻⁹) = 3.32×10⁻²⁶ kg·m/s"
            },
            {
              "step": "Momentum transfer uncertainty",
              "explanation": "Photon can scatter anywhere within angle, so Δp_x ≈ p_photon sinθ ≈ 3.32×10⁻²⁶ kg·m/s (for θ~90°)"
            },
            {
              "step": "Uncertainty product",
              "explanation": "ΔxΔp_x ≈ (10×10⁻⁹)×(3.32×10⁻²⁶) = 3.32×10⁻³⁴ J·s ≈ ħ (since ħ=1.05×10⁻³⁴ J·s)"
            },
            {
              "step": "Comparison with limit",
              "explanation": "ΔxΔp_x ≈ ħ, while minimum is ħ/2. Reasonable agreement given approximations."
            },
            {
              "step": "Significance",
              "explanation": "This thought experiment shows how measurement necessarily disturbs system, creating uncertainty. Not just practical limitation but fundamental principle."
            }
          ],
          "final_answer": "(a) λ≈20nm, (b) p_photon=3.32×10⁻²⁶kg·m/s, (c) Δp_x≈3.32×10⁻²⁶kg·m/s, (d) ΔxΔp_x≈ħ, consistent with uncertainty principle. Demonstrates measurement disturbance.",
          "concept_applied": "Microscope thought experiment",
          "image": {
            "url": "images/microscope-thought-experiment.png",
            "alt": "Microscope thought experiment example",
            "caption": "Heisenberg's gamma-ray microscope thought experiment analysis"
          }
        }
      ]
    },
    {
      "section_title": "3. Double-Slit Experiment and Complementarity",
      "introduction": "The definitive quantum experiment demonstrating wave-particle duality, complementarity principle, and the fundamental role of measurement in quantum mechanics.",

      "key_conject": {
        "definition": "Double-slit experiment: Interference patterns, Which-path information, Complementarity principle, Wave-function collapse, Measurement problem, Quantum eraser, Delayed choice, Particle-wave behavior, Probability amplitudes, Superposition principle, Copenhagen interpretation, Many-worlds interpretation.",
        "context": "The double-slit experiment provides the most dramatic demonstration of wave-particle duality and raises deep questions about quantum reality and measurement.",
        "image": {
          "url": "images/double-slit-complementarity.png",
          "alt": "Double-slit experiment and complementarity",
          "caption": "Double-slit interference and complementarity principle"
        }
      },

      "classifications": [
        {
          "type": "Double-Slit Variations",
          "value": "Classification based on experimental implementations and quantum features demonstrated",
          "characteristics": [
            "Optical double-slit",
            "Electron double-slit",
            "Atom interferometry",
            "Molecule interference",
            "Which-path experiments",
            "Quantum eraser setups"
          ],
          "behavior": "Different implementations demonstrate characteristic quantum behaviors: optical shows wave interference; electron demonstrates matter waves; atom interferometry tests quantum mechanics; molecule interference probes quantum-classical boundary; which-path experiments show complementarity; quantum eraser demonstrates measurement effects",
          "examples": [
            {
              "process": "Electron Double-Slit Experiment",
              "explanation": "Demonstration of electron interference patterns building up particle-by-particle, showing wave-particle duality",
              "image": {
                "url": "images/electron-double-slit.png",
                "alt": "Electron double-slit experiment",
                "caption": "Electron interference patterns in double-slit experiment"
              }
            },
            {
              "process": "Quantum Eraser Experiment",
              "explanation": "Experimental demonstration that which-path information can be erased after measurement, restoring interference",
              "image": {
                "url": "images/quantum-eraser.png",
                "alt": "Quantum eraser experiment",
                "caption": "Quantum eraser setup and recovered interference"
              }
            }
          ],
          "note": "Double-slit: particles show interference pattern. Key feature: pattern builds up single particles. Which-path measurement destroys interference. Complementarity: wave and particle behaviors mutually exclusive. Quantum eraser: erase which-path info → restore interference. Delayed choice: decision after particle passes slits. Interpretations: Copenhagen (wavefunction collapse), Many-worlds (all paths), Bohmian (pilot waves). Philosophical implications: role of observer, nature of reality."
        }
      ],

      "principles": [
        {
          "principle": "Double-Slit Experiment and Complementarity Principle",
          "statement": "The double-slit experiment provides the most compelling demonstration of wave-particle duality and introduces fundamental quantum concepts: Basic Experiment: When particles (photons, electrons, etc.) pass through two slits and strike a detection screen, they create an interference pattern characteristic of waves, even when particles are sent one at a time. This demonstrates that each particle behaves as if it passes through both slits simultaneously. The probability amplitude to go from source to detector is $\\psi = \\psi_1 + \\psi_2$, where ψ₁ and ψ₂ are amplitudes through each slit. The probability is $P = |\\psi_1 + \\psi_2|^2 = |\\psi_1|^2 + |\\psi_2|^2 + 2|\\psi_1||\\psi_2|\\cos\\phi$, where the interference term $2|\\psi_1||\\psi_2|\\cos\\phi$ creates the pattern. Complementarity Principle (Bohr): Wave and particle behaviors are complementary - they cannot be observed simultaneously in the same experiment. Any attempt to determine which slit a particle passes through (which-path information) destroys the interference pattern. The uncertainty principle ensures that any measurement precise enough to determine the path necessarily disturbs the system enough to eliminate interference. Quantum Measurement and Collapse: When a measurement is made to determine which slit a particle passes through, the wavefunction collapses to either ψ₁ or ψ₂, and the interference disappears. This demonstrates that the act of measurement fundamentally alters the quantum system. Modern Variations: Quantum eraser experiments show that if which-path information is erased after the particles have been detected, the interference pattern can be recovered. Delayed-choice experiments demonstrate that the decision to measure which-path information or observe interference can be made after the particle has passed through the slits. Interpretations: Copenhagen interpretation: The wavefunction contains all information, and measurement causes collapse. Many-worlds interpretation: All possibilities occur in different branches of reality. Bohmian mechanics: Particles have definite trajectories guided by pilot waves. Philosophical Implications: The double-slit experiment challenges classical concepts of reality, locality, and the role of the observer. It suggests that quantum systems exist in superpositions of possibilities until measured. The experiment has been performed with photons, electrons, atoms, and increasingly large molecules, probing the quantum-classical boundary.",
          "application": "Analyze double-slit interference patterns. Understand complementarity in various experimental setups. Design which-path measurement experiments. Apply superposition principle to probability calculations. Interpret quantum measurement scenarios. Appreciate philosophical implications of quantum behavior.",
          "example": "Electron double-slit: λ=0.1nm, slit separation d=1μm, screen distance L=1m → fringe spacing Δy=λL/d=0.1mm. With which-path detection: pattern becomes sum of two single-slit patterns. Quantum eraser: polarization markers can be erased to restore interference.",
          "analogy": "Like a person being both an individual and part of a crowd - when no one's watching, you act like a wave spreading through both doors; when someone watches which door you take, you have to choose and act like a particle; the act of watching changes your behavior fundamentally; quantum eraser is like someone watching but then forgetting what they saw, letting you return to wave-like behavior",
          "image": {
            "url": "images/double-slit-principle.png",
            "alt": "Double-slit principle",
            "caption": "Double-slit interference and complementarity principle"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Double-Slit Interference Calculation",
          "problem": "Electrons with 100eV energy pass through double slit (separation 1μm) to screen 1m away. Find: (a) de Broglie wavelength, (b) Fringe spacing, (c) Number of fringes observable, (d) Effect of which-path measurement.",
          "step_by_step": [
            {
              "step": "de Broglie wavelength",
              "explanation": "λ = h/√(2mE) = 1.226/√100 = 0.1226 nm"
            },
            {
              "step": "Fringe spacing",
              "explanation": "Δy = λL/d = (0.1226×10⁻⁹ × 1) / (1×10⁻⁶) = 1.226×10⁻⁴ m = 0.1226 mm"
            },
            {
              "step": "Number of observable fringes",
              "explanation": "Single-slit diffraction envelope width: for slit width a=0.1μm, first minimum at y=λL/a=1.226mm. So fringes visible within ±1.226mm, number ≈ (2.452/0.1226) ≈ 20 fringes"
            },
            {
              "step": "Which-path measurement effect",
              "explanation": "Any measurement determining which slit electron passes through destroys interference pattern. Pattern becomes sum of two single-slit patterns without interference."
            },
            {
              "step": "Experimental reality",
              "explanation": "Actual electron double-slit experiments show exactly this: build-up of interference pattern particle by particle, destroyed by which-path measurement."
            },
            {
              "step": "Significance",
              "explanation": "Demonstrates that electrons don't have definite paths until measured. Challenges classical trajectory concept."
            }
          ],
          "final_answer": "(a) λ=0.1226nm, (b) Δy=0.1226mm, (c) ~20 fringes visible, (d) Which-path measurement destroys interference. Demonstrates wave-particle duality.",
          "concept_applied": "Double-slit interference calculation",
          "image": {
            "url": "images/double-slit-calculation.png",
            "alt": "Double-slit calculation example",
            "caption": "Calculation of double-slit interference parameters"
          }
        },
        {
          "title": "Complementarity Analysis",
          "problem": "Analyze complementarity in these scenarios: (a) Optical double-slit with polarizers, (b) Electron double-slit with path detection, (c) Quantum eraser setup, (d) Macroscopic object double-slit.",
          "step_by_step": [
            {
              "step": "Optical double-slit with polarizers",
              "explanation": "Slits with orthogonal polarizers (H and V) provide which-path information → no interference. Remove polarizers or make them parallel → interference restored."
            },
            {
              "step": "Electron double-slit with path detection",
              "explanation": "Any attempt to detect which slit electron passes through (e.g., by scattering photons) gives which-path information → destroys interference. Uncertainty principle ensures measurement disturbs system."
            },
            {
              "step": "Quantum eraser setup",
              "explanation": "Which-path information can be encoded (e.g., in photon polarization) then erased after detection. Sorting data based on erasure reveals subsets showing interference."
            },
            {
              "step": "Macroscopic object double-slit",
              "explanation": "For baseball (m=0.145kg, v=40m/s): λ=1.14×10⁻³⁴m. Fringe spacing completely negligible. Environment constantly 'measures' position → decoherence → classical behavior."
            },
            {
              "step": "Complementarity principle",
              "explanation": "Wave and particle behaviors mutually exclusive. Complete which-path knowledge → no interference. Complete interference → no which-path information."
            },
            {
              "step": "Quantum-classical transition",
              "explanation": "As systems get larger, decoherence from environment rapidly destroys quantum coherence → emergent classical behavior."
            }
          ],
          "final_answer": "(a) Polarizers provide which-path info → no interference; (b) Path detection destroys interference; (c) Quantum eraser can recover interference; (d) Macroscopic objects: negligible λ, decoherence → classical. Demonstrates complementarity across scales.",
          "concept_applied": "Complementarity analysis",
          "image": {
            "url": "images/complementarity-analysis.png",
            "alt": "Complementarity analysis example",
            "caption": "Analysis of complementarity in various experimental scenarios"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Wave-particle duality",
    "de Broglie wavelength",
    "Matter waves",
    "Heisenberg uncertainty principle",
    "Complementarity principle",
    "Double-slit experiment",
    "Which-path information",
    "Quantum superposition",
    "Wavefunction collapse",
    "Quantum eraser",
    "Decoherence",
    "Copenhagen interpretation"
  ],

  "common_misconceptions": [
    "Thinking particles physically oscillate as waves",
    "Believing uncertainty principle is only about measurement limitations",
    "Confusing de Broglie waves with electromagnetic waves",
    "Thinking quantum effects don't apply to macroscopic objects",
    "Believing observation requires human consciousness",
    "Confusing virtual particles with real particles"
  ],

  "real_world_applications": [
    "Electron microscopy and diffraction",
    "Neutron scattering for materials analysis",
    "Atom interferometry for precision measurement",
    "Quantum computing and information processing",
    "Scanning tunneling microscopy",
    "Mössbauer spectroscopy",
    "Laser cooling and trapping",
    "Quantum cryptography",
    "Magnetic resonance imaging",
    "Semiconductor device physics"
  ],

  "summary": "Wave-particle duality establishes that all quantum entities exhibit both wave-like (interference, diffraction) and particle-like (localized interactions, quantization) properties, with λ = h/p (de Broglie relation) connecting these aspects. The Heisenberg uncertainty principle ΔxΔp ≥ ħ/2 sets fundamental limits on simultaneous knowledge of complementary variables. The double-slit experiment dramatically demonstrates quantum superposition and the role of measurement, while Bohr's complementarity principle states that wave and particle behaviors are mutually exclusive. These concepts form the foundation of quantum mechanics, challenging classical intuition and enabling technologies from electron microscopy to quantum computing. The transition from quantum to classical behavior occurs through decoherence as systems interact with their environment."
}