{
  "flashcards": [
    {
      "category": "Algebra 1: Graphing Linear Equations",
      "cards": [
        {
          "front": "What is a linear equation in two variables?",
          "back": "An equation that can be written in the form Ax + By = C, where A, B are not both zero."
        },
        {
          "front": "What is the standard form of a linear equation?",
          "back": "Ax + By = C, where A, B, and C are integers and A ≥ 0."
        },
        {
          "front": "What is the slope-intercept form of a linear equation?",
          "back": "y = mx + b, where m = slope and b = y-intercept."
        },
        {
          "front": "What is slope?",
          "back": "The steepness of a line; m = rise/run = (y₂ − y₁)/(x₂ − x₁)."
        },
        {
          "front": "What does a positive slope indicate?",
          "back": "The line rises from left to right."
        },
        {
          "front": "What does a negative slope indicate?",
          "back": "The line falls from left to right."
        },
        {
          "front": "What does a zero slope indicate?",
          "back": "The line is horizontal (no vertical change)."
        },
        {
          "front": "What does an undefined slope indicate?",
          "back": "The line is vertical (no horizontal change)."
        },
        {
          "front": "What is the y-intercept?",
          "back": "The point where the line crosses the y-axis: (0, b)."
        },
        {
          "front": "What is the x-intercept?",
          "back": "The point where the line crosses the x-axis: (a, 0)."
        },
        {
          "front": "How do you graph a line using slope-intercept form (y = mx + b)?",
          "back": "1) Plot y-intercept (0, b). 2) Use slope m = rise/run to plot another point. 3) Draw line through points."
        },
        {
          "front": "How do you graph a line using intercepts?",
          "back": "1) Find x-intercept (set y = 0). 2) Find y-intercept (set x = 0). 3) Plot intercepts and draw line."
        },
        {
          "front": "What is the point-slope form of a linear equation?",
          "back": "y − y₁ = m(x − x₁), where m is slope and (x₁, y₁) is a point on the line."
        },
        {
          "front": "How do you write the equation of a line given slope and a point?",
          "back": "Use point-slope form: y − y₁ = m(x − x₁), then simplify if needed."
        },
        {
          "front": "How do you write the equation of a line given two points?",
          "back": "1) Find slope m. 2) Use point-slope form with either point."
        },
        {
          "front": "What are parallel lines?",
          "back": "Lines in the same plane that never intersect; they have the same slope (m₁ = m₂)."
        },
        {
          "front": "What are perpendicular lines?",
          "back": "Lines that intersect at a right angle; their slopes are negative reciprocals (m₁ × m₂ = −1)."
        },
        {
          "front": "What is the slope of a line perpendicular to y = 2x + 3?",
          "back": "−1/2 (negative reciprocal of 2)."
        },
        {
          "front": "What is a system of linear equations?",
          "back": "Two or more linear equations with the same variables."
        },
        {
          "front": "What is the solution to a system of linear equations?",
          "back": "The ordered pair (x, y) that satisfies all equations in the system."
        },
        {
          "front": "How can you solve a system by graphing?",
          "back": "Graph both lines; the intersection point is the solution."
        },
        {
          "front": "What does it mean if a system has one solution?",
          "back": "The lines intersect at exactly one point (consistent and independent)."
        },
        {
          "front": "What does it mean if a system has no solution?",
          "back": "The lines are parallel and never intersect (inconsistent)."
        },
        {
          "front": "What does it mean if a system has infinitely many solutions?",
          "back": "The lines are the same (coincident); all points on the line are solutions."
        },
        {
          "front": "What is the horizontal line test for functions?",
          "back": "If a horizontal line intersects a graph more than once, the graph does not represent a one-to-one function."
        },
        {
          "front": "What is the slope formula given two points (x₁, y₁) and (x₂, y₂)?",
          "back": "m = (y₂ − y₁)/(x₂ − x₁)"
        },
        {
          "front": "What is a direct variation?",
          "back": "A linear relationship of the form y = kx, where k is the constant of variation."
        },
        {
          "front": "What is the graph of y = kx?",
          "back": "A line passing through the origin (0,0) with slope k."
        },
        {
          "front": "What is an identity equation?",
          "back": "An equation that is true for all values of the variable (e.g., 2x + 3 = 2x + 3)."
        },
        {
          "front": "How do you graph a vertical line?",
          "back": "Equation: x = a. It is a vertical line through x = a."
        },
        {
          "front": "How do you graph a horizontal line?",
          "back": "Equation: y = b. It is a horizontal line through y = b."
        },
        {
          "front": "What is the slope of a horizontal line?",
          "back": "0"
        },
        {
          "front": "What is the slope of a vertical line?",
          "back": "Undefined"
        },
        {
          "front": "How do you find the equation of a horizontal line through (4, −2)?",
          "back": "y = −2"
        },
        {
          "front": "How do you find the equation of a vertical line through (4, −2)?",
          "back": "x = 4"
        },
        {
          "front": "What is the midpoint formula?",
          "back": "Midpoint = ((x₁ + x₂)/2 , (y₁ + y₂)/2)"
        },
        {
          "front": "What is the distance formula?",
          "back": "Distance = √[(x₂ − x₁)² + (y₂ − y₁)²]"
        },
        {
          "front": "How do you determine if a given point lies on a line?",
          "back": "Substitute the coordinates into the equation; if true, the point lies on the line."
        },
        {
          "front": "What is a linear inequality in two variables?",
          "back": "An inequality that can be written in the form Ax + By < C, Ax + By > C, Ax + By ≤ C, or Ax + By ≥ C."
        },
        {
          "front": "How do you graph a linear inequality?",
          "back": "1) Graph the boundary line (solid for ≤ or ≥, dashed for < or >). 2) Shade the half-plane that satisfies the inequality."
        },
        {
          "front": "How do you decide which side to shade for an inequality?",
          "back": "Test a point not on the line (often (0,0)). If it satisfies the inequality, shade that side."
        }
      ]
    }
  ]
}
