{
  "expanded_description": "What is money? It's not just coins and paper currency—it's anything that serves as a medium of exchange, a unit of account, and a store of value. Money is one of humanity's greatest inventions, enabling trade, specialization, and economic complexity far beyond what barter could support. Without money, every transaction would require a double coincidence of wants—you have to want what I have, and I have to want what you have. Money solves this problem by serving as an intermediary that everyone accepts. But not everything can function as money. To be effective, money must be durable, portable, divisible, uniform, scarce, and widely accepted. Throughout history, societies have used everything from seashells and cattle to gold and paper as money. Today, we use fiat money—currency that has value because the government declares it as legal tender and people trust it. Understanding the functions and characteristics of money is essential for understanding the financial system, inflation, and monetary policy. In this section, we'll explore what money is, why it matters, and what gives it value.",
  
  "core_concept": {
    "principle": "Money is anything that is widely accepted as payment for goods and services and for repayment of debts. Money serves three essential functions: (1) Medium of exchange: Money is used to buy and sell goods and services, eliminating the need for barter's double coincidence of wants. (2) Unit of account: Money provides a standard measure of value, allowing us to compare the worth of different goods and services and to keep financial records. (3) Store of value: Money allows people to transfer purchasing power from the present to the future—it holds value over time. To perform these functions effectively, money must have certain characteristics: durability (it must withstand physical wear), portability (it must be easy to carry and transfer), divisibility (it must be easily divided into smaller units), uniformity (identical units must have the same value), scarcity (it must be limited in supply to maintain value), and acceptability (everyone must trust that others will accept it). Money has evolved over time: commodity money (gold, silver, salt) has intrinsic value; representative money (paper backed by gold) was redeemable for commodity; fiat money (today's currency) has value because the government declares it as legal tender and people have confidence in it. The money supply is measured in various ways: M1 (currency, demand deposits, traveler's checks) and M2 (M1 plus savings deposits, small time deposits, money market mutual funds).",
    
    "explanation": "Imagine you're a baker who wants to buy shoes. Under barter, you'd have to find a shoemaker who wants bread. That's the double coincidence of wants—and it's hard to find. With money, you sell bread for money to anyone, then use that money to buy shoes from anyone. Money makes trade infinitely easier. Now imagine money that rots (not durable), or is too heavy to carry (not portable), or can't be divided into small amounts (not divisible), or comes in different qualities (not uniform), or is abundant like sand (not scarce), or no one trusts (not acceptable). That money wouldn't work. This is why gold worked for centuries—it's durable, portable (in small amounts), divisible, uniform, scarce, and widely accepted. Today's paper money works because the government backs it and people trust it—but that trust can be destroyed by hyperinflation, when money loses its store of value and people stop accepting it.",
    
    "image": {
      "src": "images/unit4/money_functions.png",
      "alt": "Diagram showing three functions of money: medium of exchange (exchange), unit of account (price tags), store of value (piggy bank)",
      "caption": "Figure 4.1.1: Money serves three essential functions: medium of exchange, unit of account, and store of value."
    }
  },

  "sections": [
    {
      "section_title": "4.1 Functions and Characteristics of Money",
      "introduction": "Money is so central to modern life that we rarely think about what it actually is. But money isn't just the coins in your pocket or the numbers in your bank account—it's a social technology that enables trade, specialization, and economic complexity. In this section, we'll explore the three functions of money, the characteristics that something must have to serve as money, and how money has evolved from commodity money to fiat money. Understanding these fundamentals is essential for understanding inflation, banking, and monetary policy.",
      
      "introduction_image": {
        "src": "images/unit4/money_evolution.png",
        "alt": "Timeline showing evolution of money: barter, commodity money, representative money, fiat money, digital money",
        "caption": "Figure 4.1.2: Money has evolved from barter to commodity money to representative money to fiat money to digital forms."
      },
      
      "key_concept": {
        "definition": "Money is any asset that is widely accepted as payment for goods and services and for repayment of debts. It serves three functions: (1) Medium of exchange: Money facilitates transactions by eliminating the double coincidence of wants required in barter. Sellers accept money in exchange for goods, knowing they can use it to buy other goods. (2) Unit of account: Money provides a common measure of value, allowing us to express prices, compare values, and keep financial records. Instead of saying a car is worth 1,000 bushels of wheat or 50 cows, we say it costs $\\$30,000$. (3) Store of value: Money allows people to transfer purchasing power from the present to the future. You can earn money today, save it, and spend it later. However, inflation erodes money's store of value over time. To perform these functions effectively, money must have six characteristics: durability (must withstand physical wear), portability (must be easy to carry and transfer), divisibility (must be easily divided into smaller units), uniformity (identical units must have the same value), scarcity (must be limited in supply to maintain value), and acceptability (everyone must trust that others will accept it). Money has evolved through history: commodity money (gold, silver, salt, cattle) had intrinsic value; representative money (paper certificates redeemable for gold) was backed by commodity; fiat money (today's currency) has value because the government declares it as legal tender and people have confidence in it. The money supply is measured in aggregates: M1 includes currency, demand deposits, and traveler's checks; M2 includes M1 plus savings deposits, small time deposits, and money market mutual funds.",
        
        "context": "The concept of money has fascinated economists for centuries. Aristotle distinguished between money's use as a medium of exchange and its other functions. Adam Smith explained how money overcame the inefficiencies of barter. Milton Friedman emphasized money's role in determining prices and inflation. Today, the rise of cryptocurrencies and digital payments is challenging traditional notions of money. In AP Macroeconomics, understanding money's functions and characteristics is essential for analyzing monetary policy, inflation, and the financial system.",
        
        "image": {
          "src": "images/unit4/money_characteristics.png",
          "alt": "Diagram showing six characteristics of money: durability, portability, divisibility, uniformity, scarcity, acceptability",
          "caption": "Figure 4.1.3: Effective money must be durable, portable, divisible, uniform, scarce, and widely accepted."
        }
      },

      "classifications": [
        {
          "type": "Medium of Exchange",
          "value": "Money facilitates transactions",
          "characteristics": ["Eliminates barter's double coincidence", "Universally accepted", "Simplifies trade", "Enables specialization", "Reduces transaction costs"],
          "behavior": "As a medium of exchange, money is what you use to buy and sell goods and services. It's the intermediary that makes trade possible without requiring each party to want what the other has. Sellers accept money because they know they can use it to buy what they need from others. This function is what makes money uniquely useful—nothing else serves quite the same role. When money fails as a medium of exchange (during hyperinflation, for example), people revert to barter or use foreign currency.",
          
          "image": {
            "src": "images/unit4/medium_exchange.png",
            "alt": "Diagram showing barter requiring double coincidence vs money as universal intermediary",
            "caption": "Figure 4.1.4: As a medium of exchange, money eliminates the need for a double coincidence of wants."
          },
          
          "examples": [
            {
              "process": "Barter problem",
              "explanation": "A baker wants shoes, a shoemaker wants bread. Under barter, they can trade. But if the shoemaker wants bread and the baker wants pants, no trade happens. Money solves this: baker sells bread for money, uses money to buy shoes; shoemaker sells shoes for money, uses money to buy bread."
            },
            {
              "process": "Cash transaction",
              "explanation": "You buy coffee with $\\$5$. The coffee shop accepts the money because they can use it to pay their suppliers and employees. Money circulates continuously."
            }
          ]
        },
        {
          "type": "Unit of Account",
          "value": "Money provides a common measure of value",
          "characteristics": ["Standard measure", "Price denomination", "Value comparison", "Financial accounting", "Economic calculation"],
          "behavior": "As a unit of account, money provides a common denominator for measuring and comparing values. Instead of expressing prices in terms of other goods (a car is worth 1,000 bushels of wheat, 50 cows, or 200 shirts), we express all prices in monetary units. This simplifies economic calculation, allows for rational decision-making, and enables accounting and record-keeping. When money fails as a unit of account (during hyperinflation), prices change so rapidly that economic calculation becomes nearly impossible.",
          
          "image": {
            "src": "images/unit4/unit_account.png",
            "alt": "Price tags showing monetary values, comparing different goods",
            "caption": "Figure 4.1.5: As a unit of account, money provides a common measure of value. All prices are expressed in monetary units."
          },
          
          "examples": [
            {
              "process": "Price tags",
              "explanation": "A laptop costs $\\$1,000$, a sandwich costs $\\$5$, a car costs $\\$30,000$. You can easily compare values and make decisions. Without money, you'd have to compare laptops to sandwiches to cars in complex ratios."
            },
            {
              "process": "Financial records",
              "explanation": "Companies keep accounts in monetary units. They can add revenues, subtract costs, and calculate profits because everything is measured in the same unit."
            }
          ]
        },
        {
          "type": "Store of Value",
          "value": "Money preserves purchasing power over time",
          "characteristics": ["Transfer purchasing power to future", "Hold value over time", "Affected by inflation", "Competes with other stores", "Liquidity advantage"],
          "behavior": "As a store of value, money allows you to earn income today and spend it later. It's a way of transferring purchasing power from the present to the future. However, money is not a perfect store of value because inflation erodes its purchasing power. If inflation is 5% per year, $\\$100$ today will buy only what $\\$95$ bought a year from now. People hold money despite this because it's liquid—it can be used immediately for transactions. Other stores of value (stocks, bonds, real estate) may hold value better but are less liquid.",
          
          "image": {
            "src": "images/unit4/store_value.png",
            "alt": "Piggy bank with arrow showing money today and less purchasing power in future due to inflation",
            "caption": "Figure 4.1.6: As a store of value, money transfers purchasing power to the future, but inflation erodes its value over time."
          },
          
          "examples": [
            {
              "process": "Saving",
              "explanation": "You earn $\\$1,000$ and save it in a bank account. A year later, you withdraw it to buy something. Money allowed you to store value across time."
            },
            {
              "process": "Inflation effect",
              "explanation": "If inflation is high, money loses value quickly. In hyperinflation, people spend money immediately because it will be worth much less tomorrow. Money fails as a store of value."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Money Solves the Double Coincidence of Wants Problem",
          "statement": "In a barter economy, trade requires a double coincidence of wants: each party must want what the other has. This makes trade difficult and limits specialization. Money solves this problem by serving as a universally accepted medium of exchange. People can sell what they have for money, then use that money to buy what they want. This separation of sale and purchase greatly expands the possibilities for trade and allows for complex economies with extensive specialization. Money is one of humanity's most important innovations, enabling economic activity far beyond what barter could support.",
          "application": "When analyzing the role of money, remember that its primary function is to facilitate exchange. Anything that serves this function well can be money. This is why societies have used so many different things as money throughout history. It also explains why money must be widely accepted—if people won't take it, it can't function as a medium of exchange.",
          "example": "Imagine an economy with 100 goods. In a barter economy, there are 4,950 possible exchange ratios (100 × 99 / 2). With money, there are only 100 prices—each good priced in money. This simplification dramatically reduces transaction costs and makes trade much easier.",
          
          "image": {
            "src": "images/unit4/double_coincidence.png",
            "alt": "Diagram showing complexity of barter vs simplicity of money",
            "caption": "Figure 4.1.7: Money solves the double coincidence of wants problem, dramatically simplifying trade."
          }
        },
        {
          "principle": "Fiat Money Has Value Because of Trust, Not Backing",
          "statement": "Throughout history, money was often commodity money—gold, silver, salt—that had intrinsic value. People accepted it because it was valuable in itself. Today, most money is fiat money—currency that has no intrinsic value and is not backed by anything tangible. It has value because the government declares it as legal tender (must be accepted for payment of debts) and, more importantly, because people trust that others will accept it. This trust can be fragile. If people lose confidence in money, they may stop accepting it, leading to hyperinflation and economic collapse. Fiat money works as long as people believe it works.",
          "application": "When considering monetary policy, remember that money's value depends on confidence. If the central bank creates too much money, people lose confidence and inflation spirals. If the central bank maintains stability, confidence remains and money functions well. This is why central banks are so focused on controlling inflation—it protects the value of money.",
          "example": "In Zimbabwe in 2008, the government printed massive amounts of money, causing hyperinflation. People lost confidence in the currency and stopped using it. Stores posted prices in foreign currency or goods. The Zimbabwean dollar became worthless—not because it wasn't legal tender, but because people no longer trusted it.",
          
          "image": {
            "src": "images/unit4/fiat_money.png",
            "alt": "Photo of Zimbabwe $100 trillion note, illustrating hyperinflation and loss of confidence",
            "caption": "Figure 4.1.8: Fiat money depends on trust. Hyperinflation destroys that trust, as seen with Zimbabwe's $100 trillion note."
          }
        },
        {
          "principle": "Inflation Erodes Money's Functions",
          "statement": "Inflation damages all three functions of money. As a medium of exchange, high inflation makes people reluctant to hold money, leading to barter or use of foreign currency. As a unit of account, rapidly changing prices make economic calculation difficult. As a store of value, inflation erodes purchasing power, discouraging saving and encouraging spending now before prices rise further. Moderate, predictable inflation causes limited damage, but high or unpredictable inflation can destroy money's usefulness entirely. This is why price stability is a primary goal of monetary policy.",
          "application": "When evaluating the costs of inflation, consider its effects on money's functions. Even moderate inflation imposes costs: shoe-leather costs (time spent avoiding holding cash), menu costs (costs of changing prices), and tax distortions. High inflation can cripple an economy by making money useless for its basic functions.",
          "example": "During the German hyperinflation of 1923, workers were paid twice a day and rushed to spend their wages before prices rose further. Money failed as a store of value (worthless by day's end), medium of exchange (people preferred barter), and unit of account (prices changed by the hour). The economy nearly collapsed.",
          
          "image": {
            "src": "images/unit4/inflation_erosion.png",
            "alt": "Graph showing purchasing power of $1 over time with inflation",
            "caption": "Figure 4.1.9: Inflation erodes money's purchasing power, damaging its function as a store of value."
          }
        },
        {
          "principle": "The Money Supply Has Multiple Measures",
          "statement": "Money isn't just currency—it includes various assets that serve as media of exchange or can be quickly converted to them. Economists measure the money supply in different ways, called monetary aggregates. M1 is the narrowest measure, including currency held by the public, demand deposits (checking accounts), and traveler's checks. These are the most liquid forms of money—directly usable for transactions. M2 is a broader measure, including M1 plus savings deposits, small time deposits (under $\\$100,000$), and money market mutual funds. These are less liquid but can be converted to M1 relatively quickly. The choice of which measure to use depends on the analysis—M1 is more directly related to spending, while M2 may better capture overall monetary conditions.",
          "application": "When analyzing monetary policy, pay attention to which money supply measure is being discussed. The Federal Reserve monitors both M1 and M2, and the relationship between them can provide information about economic conditions. Rapid growth in M2 without corresponding M1 growth might indicate people are saving more; rapid M1 growth might signal increased spending.",
          "example": "In 2020, M1 grew rapidly as the Fed injected money into the economy and people held more cash. M2 grew even faster as people saved stimulus payments in savings accounts. Both measures provided information about monetary conditions during the pandemic.",
          
          "image": {
            "src": "images/unit4/money_measures.png",
            "alt": "Venn diagram showing M1 and M2 components",
            "caption": "Figure 4.1.10: M1 includes currency and checking deposits; M2 adds savings deposits, time deposits, and money market funds."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Money's Functions",
          
          "image": {
            "src": "images/unit4/functions_example.png",
            "alt": "Scenarios for identifying which money function is being used",
            "caption": "Figure 4.1.11: For each scenario, identify which function of money is being served."
          },
          
          "problem": "For each of the following, identify which function of money is being served: medium of exchange, unit of account, or store of value. a) You check the price of a new laptop and see it's $\\$1,200$. b) You pay $\\$3$ for a coffee with cash. c) You keep $\\$500$ in your savings account for a future vacation. d) A store lists all its prices in dollars. e) You receive your paycheck via direct deposit. f) You compare the cost of renting an apartment ($\\$1,500$/month) to buying a house ($\\$2,000$/month mortgage). g) You hide $\\$100$ under your mattress for emergencies.",
          
          "step_by_step": [
            {
              "step": "Analyze laptop price",
              "explanation": "Seeing the price in dollars uses money as a unit of account. It's providing a standard measure of value for comparing goods."
            },
            {
              "step": "Analyze coffee payment",
              "explanation": "Paying $\\$3$ for coffee uses money as a medium of exchange. You're using money to facilitate a transaction."
            },
            {
              "step": "Analyze savings account",
              "explanation": "Keeping money in savings for a future vacation uses money as a store of value. You're transferring purchasing power to the future."
            },
            {
              "step": "Analyze store prices",
              "explanation": "Listing all prices in dollars uses money as a unit of account. It's the common measure for expressing values."
            },
            {
              "step": "Analyze paycheck",
              "explanation": "Receiving a paycheck is payment for work. The money serves as a medium of exchange—you're being paid in a form you can use to buy things."
            },
            {
              "step": "Analyze rent vs mortgage comparison",
              "explanation": "Comparing costs in dollars uses money as a unit of account. You're using the common measure to compare alternatives."
            },
            {
              "step": "Analyze money under mattress",
              "explanation": "Hiding money for emergencies uses money as a store of value. You're preserving purchasing power for future use (though not earning interest)."
            }
          ],
          
          "final_answer": "a) Unit of account. b) Medium of exchange. c) Store of value. d) Unit of account. e) Medium of exchange. f) Unit of account. g) Store of value.",
          "concept_applied": "Money serves three functions. The same money can serve different functions at different times."
        },
        {
          "title": "Evaluating Potential Forms of Money",
          
          "image": {
            "src": "images/unit4/money_candidates.png",
            "alt": "Table listing potential money candidates and characteristics",
            "caption": "Figure 4.1.12: Evaluate each candidate against the six characteristics of good money."
          },
          
          "problem": "Evaluate each of the following as a potential form of money based on the six characteristics: durability, portability, divisibility, uniformity, scarcity, acceptability. Rate each as good, fair, or poor. a) Gold. b) Wheat. c) Cigarettes in prison. d) Seashells. e) Paper currency. f) Cryptocurrency (like Bitcoin). g) Sand.",
          
          "step_by_step": [
            {
              "step": "Evaluate gold",
              "explanation": "Gold: Durable (yes), Portable (in small amounts, but heavy for large amounts), Divisible (can be melted and divided), Uniform (high purity standard), Scarcity (limited supply), Acceptability (historically high, now limited). Overall: Good as commodity money, but not very portable for large transactions."
            },
            {
              "step": "Evaluate wheat",
              "explanation": "Wheat: Durable (poor—rots, spoils), Portable (bulky), Divisible (yes), Uniform (varies in quality), Scarcity (seasonal, varies with harvest), Acceptability (limited). Overall: Poor—fails durability and portability especially."
            },
            {
              "step": "Evaluate cigarettes in prison",
              "explanation": "Cigarettes: Durable (reasonably), Portable (easy), Divisible (can be broken into singles), Uniform (brand matters, but generally similar), Scarcity (limited by supply), Acceptability (high in prison). Overall: Good in that specific context—works as money in prisons."
            },
            {
              "step": "Evaluate seashells",
              "explanation": "Seashells: Durable (yes), Portable (easy), Divisible (not really—can't easily break), Uniform (varies in size/quality), Scarcity (depends on location), Acceptability (historically high in some cultures). Overall: Fair—lacks divisibility and uniformity."
            },
            {
              "step": "Evaluate paper currency",
              "explanation": "Paper currency: Durable (reasonably, though wears), Portable (excellent), Divisible (no—can't tear in half), Uniform (excellent), Scarcity (controlled by central bank), Acceptability (high). Overall: Good—modern money works well despite not being divisible."
            },
            {
              "step": "Evaluate cryptocurrency",
              "explanation": "Cryptocurrency: Durable (digital—doesn't wear out), Portable (excellent—can be sent anywhere), Divisible (highly divisible—to 8+ decimals), Uniform (excellent), Scarcity (capped supply for Bitcoin), Acceptability (growing but still limited). Overall: Good in many respects, but acceptability still limited."
            },
            {
              "step": "Evaluate sand",
              "explanation": "Sand: Durable (yes), Portable (poor—heavy), Divisible (yes, but messy), Uniform (varies), Scarcity (abundant), Acceptability (none). Overall: Poor—too abundant and not acceptable."
            }
          ],
          
          "final_answer": "a) Gold: Good. b) Wheat: Poor. c) Cigarettes: Good (in context). d) Seashells: Fair. e) Paper currency: Good. f) Cryptocurrency: Good (acceptability improving). g) Sand: Poor.",
          "concept_applied": "Good money must be durable, portable, divisible, uniform, scarce, and acceptable. Different forms of money meet these criteria to varying degrees."
        },
        {
          "title": "Calculating the Effects of Inflation on Money's Value",
          
          "image": {
            "src": "images/unit4/inflation_calculation.png",
            "alt": "Table showing inflation rates and purchasing power over time",
            "caption": "Figure 4.1.13: Calculate how inflation erodes purchasing power."
          },
          
          "problem": "You have $\\$1,000$ in cash under your mattress. The annual inflation rate is 3%. a) What is the real value of your $\\$1,000$ after one year (in today's dollars)? b) After five years? c) After ten years? d) If inflation were 10% instead, what would the $\\$1,000$ be worth after one year? e) What does this illustrate about money's store of value function?",
          
          "step_by_step": [
            {
              "step": "Calculate after one year at 3%",
              "explanation": "With 3% inflation, prices rise by 3%. The purchasing power of $\\$1,000$ falls by 3%. Real value = $\\$1,000 / (1 + 0.03) = \\$1,000 / 1.03 = \\$970.87$ in today's dollars."
            },
            {
              "step": "Calculate after five years at 3%",
              "explanation": "After five years, cumulative inflation factor = $(1.03)^5 = 1.1593$. Real value = $\\$1,000 / 1.1593 = \\$862.61$."
            },
            {
              "step": "Calculate after ten years at 3%",
              "explanation": "After ten years, cumulative inflation factor = $(1.03)^{10} = 1.3439$. Real value = $\\$1,000 / 1.3439 = \\$744.09$."
            },
            {
              "step": "Calculate at 10% after one year",
              "explanation": "With 10% inflation, real value after one year = $\\$1,000 / 1.10 = \\$909.09$. Much larger loss."
            },
            {
              "step": "Interpret results",
              "explanation": "Inflation erodes money's purchasing power over time. Even moderate inflation (3%) reduces the real value of cash by about 25% over ten years. High inflation destroys value much faster. This shows that money is not a perfect store of value—it loses purchasing power over time. People hold cash despite this because of its liquidity, but they may prefer other assets (stocks, real estate) to preserve value."
            }
          ],
          
          "final_answer": "a) $\\$970.87$. b) $\\$862.61$. c) $\\$744.09$. d) $\\$909.09$. e) Inflation erodes money's store of value; holding cash imposes a cost.",
          "concept_applied": "Inflation reduces the real value of money over time, damaging its function as a store of value."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Define Money",
          "description": "Money is anything widely accepted as payment for goods and services and for repayment of debts.",
          "mechanism": "Money is defined by its functions and acceptability, not by its physical form. Different societies have used different objects as money.",
          "result": "Understanding what money is.",
          
          "image": {
            "src": "images/unit4/money_step1.png",
            "alt": "Definition of money with examples",
            "caption": "Figure 4.1.14: Step 1 - Money is defined by its functions and widespread acceptance."
          }
        },
        {
          "step": 2,
          "process": "Identify the Three Functions",
          "description": "Money serves as a medium of exchange, unit of account, and store of value.",
          "mechanism": "Each function plays a distinct role in the economy. Medium of exchange facilitates transactions. Unit of account enables value comparison. Store of value allows saving.",
          "result": "Understanding what money does.",
          
          "image": {
            "src": "images/unit4/money_step2.png",
            "alt": "Three functions diagram",
            "caption": "Figure 4.1.15: Step 2 - Money serves three functions: medium of exchange, unit of account, and store of value."
          }
        },
        {
          "step": 3,
          "process": "Evaluate Characteristics",
          "description": "Effective money must be durable, portable, divisible, uniform, scarce, and acceptable.",
          "mechanism": "Each characteristic affects how well money performs its functions. Durability ensures it lasts. Portability makes it easy to use. Divisibility allows transactions of any size. Uniformity ensures equal value. Scarcity maintains value. Acceptability makes it useful.",
          "result": "Understanding what makes good money.",
          
          "image": {
            "src": "images/unit4/money_step3.png",
            "alt": "Six characteristics checklist",
            "caption": "Figure 4.1.16: Step 3 - Good money has six key characteristics."
          }
        },
        {
          "step": 4,
          "process": "Trace Evolution of Money",
          "description": "Money has evolved from commodity money to representative money to fiat money to digital forms.",
          "mechanism": "Commodity money had intrinsic value. Representative money was backed by commodity. Fiat money has value by government decree and trust. Digital money exists electronically.",
          "result": "Understanding how money has changed.",
          
          "image": {
            "src": "images/unit4/money_step4.png",
            "alt": "Evolution timeline",
            "caption": "Figure 4.1.17: Step 4 - Money has evolved from commodity to representative to fiat to digital."
          }
        },
        {
          "step": 5,
          "process": "Measure Money Supply",
          "description": "The money supply is measured in aggregates: M1 (narrow) and M2 (broad).",
          "mechanism": "M1 includes the most liquid forms: currency, demand deposits, traveler's checks. M2 adds less liquid forms: savings deposits, small time deposits, money market funds.",
          "result": "Understanding how we measure money.",
          
          "image": {
            "src": "images/unit4/money_step5.png",
            "alt": "M1 and M2 components diagram",
            "caption": "Figure 4.1.18: Step 5 - The money supply is measured as M1 (narrow) and M2 (broad)."
          }
        }
      ],

      "image": {
        "src": "images/unit4/money_summary.png",
        "alt": "Comprehensive summary diagram of money's functions, characteristics, evolution, and measures",
        "caption": "Figure 4.1.19: Money summary - functions, characteristics, evolution, and measurement."
      }
    }
  ],

  "key_terms": [
    "Money",
    "Medium of exchange",
    "Unit of account",
    "Store of value",
    "Double coincidence of wants",
    "Barter",
    "Liquidity",
    "Commodity money",
    "Representative money",
    "Fiat money",
    "Legal tender",
    "Currency",
    "Demand deposits",
    "Checking accounts",
    "Savings deposits",
    "Time deposits",
    "Money market mutual funds",
    "M1",
    "M2",
    "Monetary aggregates",
    "Durability",
    "Portability",
    "Divisibility",
    "Uniformity",
    "Scarcity",
    "Acceptability",
    "Intrinsic value",
    "Trust",
    "Confidence",
    "Hyperinflation",
    "Purchasing power",
    "Inflation tax",
    "Shoe-leather costs",
    "Menu costs",
    "Gresham's law",
    "Cryptocurrency",
    "Digital money",
    "Central bank",
    "Monetary policy"
  ],

  "summary": "Money is anything widely accepted as payment for goods and services and for repayment of debts. It serves three essential functions. As a medium of exchange, money facilitates transactions by eliminating the double coincidence of wants required in barter. As a unit of account, money provides a common measure of value, allowing us to express prices, compare values, and keep financial records. As a store of value, money allows people to transfer purchasing power from the present to the future, though inflation erodes this function. To perform these functions effectively, money must have six characteristics: durability (must withstand physical wear), portability (must be easy to carry and transfer), divisibility (must be easily divided into smaller units), uniformity (identical units must have the same value), scarcity (must be limited in supply to maintain value), and acceptability (everyone must trust that others will accept it). Money has evolved through history. Commodity money (gold, silver, salt) had intrinsic value. Representative money (paper certificates redeemable for gold) was backed by commodity. Fiat money (today's currency) has value because the government declares it as legal tender and people have confidence in it. The rise of digital money and cryptocurrencies is continuing this evolution. The money supply is measured in aggregates. M1 is the narrowest measure, including currency held by the public, demand deposits (checking accounts), and traveler's checks—the most liquid forms. M2 is broader, including M1 plus savings deposits, small time deposits (under $\\$100,000$), and money market mutual funds. Inflation damages all three functions of money. As a medium of exchange, high inflation makes people reluctant to hold money. As a unit of account, rapidly changing prices make economic calculation difficult. As a store of value, inflation erodes purchasing power. This is why price stability is a primary goal of monetary policy. Understanding money's functions and characteristics is essential for analyzing inflation, the financial system, and the effects of monetary policy. Money is a social technology that underpins modern economic life, and its properties shape how economies function."
}
