{
  "expanded_description": "Where does money come from? Most people think the government prints it all. But in modern economies, most money is created by banks through the process of lending. When a bank makes a loan, it doesn't hand out existing currency—it creates new money by crediting the borrower's account. This is fractional reserve banking: banks keep only a fraction of deposits as reserves and lend out the rest. Each loan becomes a new deposit elsewhere, which can be lent again, creating a multiplier effect. This process is how the money supply expands and contracts. Understanding money creation is essential for understanding monetary policy, inflation, and the role of banks in the economy. In this section, we'll explore how banks create money, the limits on money creation, the money multiplier, and the role of the central bank in controlling the process.",
  
  "core_concept": {
    "principle": "In a fractional reserve banking system, banks create money through the process of lending. When a bank makes a loan, it creates a new deposit in the borrower's account, which is counted as part of the money supply. This new money can then be spent, deposited in another bank, and lent again, creating a multiple expansion of the initial deposit. The extent of money creation is limited by the reserve requirement—the fraction of deposits that banks must hold as reserves (either as vault cash or deposits at the central bank). The simple money multiplier is $1 / rr$, where $rr$ is the reserve ratio. For example, if the reserve requirement is 10% ($rr = 0.10$), the money multiplier is 10. An initial $\\$1,000$ deposit can ultimately support $\\$10,000$ in new money. However, the actual multiplier is smaller due to leakages: banks may hold excess reserves (more than required), and borrowers may hold some cash (currency drain). The money creation process works in reverse when loans are repaid: money is destroyed. The central bank can influence money creation by changing the reserve requirement, conducting open market operations (buying/selling government securities), or setting the discount rate (interest rate on loans to banks). These tools allow the central bank to control the money supply and implement monetary policy.",
    
    "explanation": "Imagine you deposit $\\$1,000$ in your checking account. The bank is required to keep 10% ($\\$100$) as reserves, but it can lend out the other $\\$900$. It lends $\\$900$ to a business, which uses the money to buy equipment. The equipment seller deposits that $\\$900$ in their bank. That bank keeps 10% ($\\$90$) as reserves and lends out $\\$810$. That $\\$810$ gets deposited somewhere else, and the process continues. Adding up all the deposits: $1,000 + 900 + 810 + 729 + ... = 10,000$. Your initial $\\$1,000$ deposit ultimately supports $\\$10,000$ in total deposits across the banking system. New money has been created—not printed, but created through lending. This is how the money supply expands. When loans are repaid, the process reverses and money is destroyed. The central bank controls this process by setting reserve requirements and influencing the amount of reserves in the system.",
    
    "image": {
      "src": "images/unit4/money_creation_overview.png",
      "alt": "Diagram showing initial deposit, reserves, loans, and subsequent deposits in a chain",
      "caption": "Figure 4.3.1: Banks create money through fractional reserve lending. Each loan creates a new deposit, leading to multiple expansion."
    }
  },

  "sections": [
    {
      "section_title": "4.3 Money Creation",
      "introduction": "How does the money supply grow? It's not just the government printing more currency. In modern economies, most money is created by banks through the process of lending. When a bank makes a loan, it creates new money. This process, called fractional reserve banking, is how the money supply expands and contracts. Understanding money creation is essential for understanding monetary policy, inflation, and the role of banks. In this section, we'll explore the balance sheet mechanics of money creation, the money multiplier, and the limits on the process.",
      
      "introduction_image": {
        "src": "images/unit4/fractional_reserve.png",
        "alt": "Simple diagram showing deposits, reserves, and loans",
        "caption": "Figure 4.3.2: In fractional reserve banking, banks keep only a fraction of deposits as reserves and lend the rest."
      },
      
      "key_concept": {
        "definition": "Money creation in a fractional reserve banking system occurs when banks make loans. The process starts with a deposit. The bank holds a fraction as reserves (required reserves) and lends the remainder. The loan proceeds are deposited in another bank (or spent and then deposited), creating new deposits. That bank again holds reserves and lends, and the process continues. The total increase in the money supply is a multiple of the initial increase in reserves. The simple money multiplier is $m = 1/rr$, where $rr$ is the reserve ratio (required reserves divided by deposits). If the reserve ratio is 10% ($rr = 0.10$), the multiplier is 10. An initial $\\$1,000$ deposit can ultimately increase the money supply by $\\$10,000$. However, this simple multiplier assumes no leakages: that banks lend all excess reserves and that all loans are redeposited in the banking system. In reality, leakages occur: banks may hold excess reserves (reserves above the requirement), and borrowers may hold some cash (currency drain), reducing the multiplier. The money creation process works in reverse when loans are repaid: money is destroyed. The central bank can influence money creation through three main tools: (1) Reserve requirements: Changing the required reserve ratio changes the multiplier. (2) Open market operations: Buying government securities injects reserves into the banking system, increasing the potential for money creation; selling securities drains reserves. (3) Discount rate: The interest rate the central bank charges on loans to banks affects banks' willingness to borrow reserves and lend.",
        
        "context": "The concept of money creation through fractional reserve banking was understood by early bankers but formalized in the 20th century. It explains how the money supply is endogenous—determined by bank lending decisions—yet ultimately controlled by the central bank through reserve provision. The 2008 financial crisis showed the dangers of excessive money creation and led to new attention on bank reserves and the multiplier. In AP Macroeconomics, understanding money creation is essential for analyzing monetary policy, inflation, and the role of banks in the economy.",
        
        "image": {
          "src": "images/unit4/money_multiplier_formula.png",
          "alt": "Money multiplier formula: m = 1/rr, with example",
          "caption": "Figure 4.3.3: The simple money multiplier is 1 divided by the reserve ratio. With 10% reserves, the multiplier is 10."
        }
      },

      "classifications": [
        {
          "type": "Required Reserves",
          "value": "The fraction of deposits banks must hold as reserves",
          "characteristics": ["Set by central bank", "Usually a percentage of deposits", "Held as vault cash or central bank deposits", "Not available for lending", "Tool of monetary policy"],
          "behavior": "Required reserves are the minimum amount of reserves a bank must hold against its deposits. They ensure banks have some liquidity to meet withdrawals, but the primary purpose today is to control money creation. By changing the reserve requirement, the central bank changes the money multiplier. A higher reserve requirement reduces the multiplier and contracts the money supply; a lower requirement increases the multiplier and expands the money supply. Required reserves are not available for lending—they're idle from the perspective of money creation.",
          
          "image": {
            "src": "images/unit4/required_reserves.png",
            "alt": "Bank balance sheet showing deposits, required reserves, and excess reserves",
            "caption": "Figure 4.3.4: Required reserves are the portion of deposits banks cannot lend. Excess reserves can be lent."
          },
          
          "examples": [
            {
              "process": "10% requirement",
              "explanation": "If the reserve requirement is 10%, a bank with $\\$100$ million in deposits must hold $\\$10$ million as reserves. The other $\\$90$ million can be lent."
            },
            {
              "process": "Changing requirements",
              "explanation": "If the Fed raises the requirement to 20%, the same bank must now hold $\\$20$ million in reserves, reducing its lending capacity by $\\$10$ million."
            }
          ]
        },
        {
          "type": "Excess Reserves",
          "value": "Reserves held beyond the required amount",
          "characteristics": ["Can be lent", "Earn no interest", "Signal bank caution", "Affect money multiplier", "Increased after 2008"],
          "behavior": "Excess reserves are reserves that banks hold above the required minimum. In the simple money multiplier model, we assume banks lend all excess reserves. In reality, banks may choose to hold excess reserves for liquidity, caution, or because lending opportunities are poor. When banks hold excess reserves, the money multiplier is smaller because not all potential lending occurs. After the 2008 financial crisis, excess reserves in the U.S. ballooned as the Fed injected massive reserves and banks were reluctant to lend. This changed the dynamics of money creation.",
          
          "image": {
            "src": "images/unit4/excess_reserves.png",
            "alt": "Graph showing excess reserves spiking after 2008",
            "caption": "Figure 4.3.5: Excess reserves increased dramatically after 2008 as banks held more reserves than required."
          },
          
          "examples": [
            {
              "process": "Normal times",
              "explanation": "Before 2008, banks held few excess reserves—they lent out most of their deposits. The money multiplier was close to the simple formula."
            },
            {
              "process": "After 2008",
              "explanation": "Banks held trillions in excess reserves. The actual money multiplier fell far below the simple formula because banks weren't lending."
            }
          ]
        },
        {
          "type": "Currency Drain",
          "value": "When borrowers hold cash instead of depositing",
          "characteristics": ["Leakage from banking system", "Reduces multiplier", "Varies with confidence", "Affects money supply", "More common in crises"],
          "behavior": "The simple money multiplier assumes that all loan proceeds are redeposited in the banking system. In reality, borrowers may hold some cash—currency drain. This cash leaves the banking system and cannot support further lending. The more cash people hold, the smaller the multiplier. The currency drain ratio ($c$) is the ratio of currency held by the public to deposits. The actual money multiplier, accounting for both required reserves and currency drain, is $m = (1 + c) / (rr + c)$. This is smaller than the simple multiplier.",
          
          "image": {
            "src": "images/unit4/currency_drain.png",
            "alt": "Diagram showing some loan proceeds held as cash, reducing further deposits",
            "caption": "Figure 4.3.6: Currency drain occurs when borrowers hold cash instead of depositing it, reducing the money multiplier."
          },
          
          "examples": [
            {
              "process": "Normal times",
              "explanation": "Most loan proceeds are deposited, so currency drain is small. The multiplier is close to the simple formula."
            },
            {
              "process": "Banking crisis",
              "explanation": "If people lose confidence in banks, they may hold more cash. Currency drain increases, reducing the multiplier and contracting the money supply."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Banks Create Money by Making Loans",
          "statement": "When a bank makes a loan, it creates new money. The bank doesn't hand out existing currency—it credits the borrower's account with a new deposit. This deposit is part of the money supply (M1). The borrower can spend it, and when they do, the recipient deposits it in another bank, creating another deposit. This process multiplies the initial reserves. Money is created when banks lend; money is destroyed when loans are repaid (because the borrower uses money to repay, removing it from circulation). This is why lending and borrowing are central to the money supply.",
          "application": "When analyzing monetary policy, remember that money creation happens through bank lending. If banks are reluctant to lend (as after 2008), monetary policy may be less effective because the money supply doesn't expand as expected. This is why central banks sometimes use unconventional policies (quantitative easing) to inject reserves directly.",
          "example": "You deposit $\\$1,000$. Bank lends $\\$900$ to a business. The business spends it, and the recipient deposits $\\$900$ in another bank. That bank lends $\\$810$, and so on. Total deposits created: $\\$1,000 + 900 + 810 + ... = \\$10,000$. The initial $\\$1,000$ deposit created $\\$9,000$ of new money through lending.",
          
          "image": {
            "src": "images/unit4/loan_creation.png",
            "alt": "T-account showing loan creating new deposit",
            "caption": "Figure 4.3.7: When a bank makes a loan, it creates a new deposit—new money."
          }
        },
        {
          "principle": "The Money Multiplier Amplifies Changes in Reserves",
          "statement": "An increase in bank reserves (from a central bank purchase of securities, for example) can support a multiple expansion of the money supply. The simple money multiplier is $1/rr$. If the Fed injects $\\$1,000$ of new reserves into the banking system and the reserve requirement is 10%, the money supply can ultimately increase by $\\$10,000$. This multiplier effect works because each dollar of reserves can support multiple dollars of deposits as banks lend and relend. However, leakages—excess reserves and currency drain—reduce the actual multiplier. The multiplier also works in reverse: a decrease in reserves can cause a multiple contraction of the money supply.",
          "application": "The multiplier is central to monetary policy. When the Fed wants to increase the money supply, it buys securities, injecting reserves. The eventual increase in money is a multiple of the reserve injection. When it wants to decrease the money supply, it sells securities, draining reserves. The size of the multiplier determines how large an open market operation needs to be to achieve a given change in the money supply.",
          "example": "The Fed buys $\\$1,000$ in bonds from a bank, paying with a new reserve deposit. The bank now has $\\$1,000$ in new excess reserves (assuming it was fully lent). With a 10% reserve requirement, these reserves can support $\\$10,000$ in new deposits as the bank lends, the funds are deposited elsewhere, and so on. The money supply increases by up to $\\$10,000$.",
          
          "image": {
            "src": "images/unit4/multiplier_process.png",
            "alt": "Diagram showing initial reserve injection leading to multiple rounds of lending",
            "caption": "Figure 4.3.8: The money multiplier amplifies changes in reserves. A $\\$1,000$ reserve injection can increase the money supply by $\\$10,000$ with a 10% reserve ratio."
          }
        },
        {
          "principle": "The Money Creation Process Has Limits",
          "statement": "The money creation process is not infinite. It's limited by the reserve requirement (banks must hold a fraction of deposits), by banks' willingness to lend (they may hold excess reserves), and by the public's desire to hold cash (currency drain). In the simple model, the process ends when all excess reserves have been converted to required reserves—that is, when total reserves equal required reserves against total deposits. At that point, no bank has excess reserves to lend, and the process stops. This limit determines the maximum possible expansion given the initial reserves and the reserve ratio.",
          "application": "When predicting the effects of monetary policy, consider these limits. If banks are holding large excess reserves, injecting more reserves may not increase lending—banks may just add to their excess reserves. If the public is holding more cash, the multiplier is smaller. These factors complicate monetary policy and explain why central banks monitor bank lending behavior and currency holdings.",
          "example": "With $\\$1,000$ in new reserves and a 10% requirement, the maximum total deposits is $\\$10,000$. At that point, required reserves are $\\$1,000$ (10% of $\\$10,000$), exactly equal to the reserves in the system. No bank has excess reserves to lend further. The process stops.",
          
          "image": {
            "src": "images/unit4/multiplier_limit.png",
            "alt": "Table showing rounds of lending until reserves are exhausted",
            "caption": "Figure 4.3.9: The money creation process ends when all excess reserves are converted to required reserves."
          }
        },
        {
          "principle": "The Central Bank Controls the Money Supply Through Reserve Management",
          "statement": "While banks create money through lending, the central bank ultimately controls the process by managing the total amount of reserves in the banking system. Through open market operations (buying and selling government securities), the central bank can inject or drain reserves. Through the discount rate, it can influence banks' willingness to borrow reserves. Through reserve requirements, it can change the multiplier. These tools allow the central bank to expand or contract the money supply to achieve its policy goals—price stability, full employment, and economic growth. However, the central bank's control is not absolute; it depends on banks' willingness to lend and the public's demand for currency.",
          "application": "When analyzing monetary policy, focus on the central bank's tools and their effects on reserves. An open market purchase increases reserves, supporting money creation. An open market sale decreases reserves, contracting the money supply. Changes in reserve requirements change the multiplier. The discount rate affects banks' cost of obtaining reserves. These tools work through the money creation process.",
          "example": "To fight a recession, the Fed buys Treasury bonds. This injects reserves into the banking system, increasing banks' ability to lend. As banks lend, the money supply expands, lowering interest rates and stimulating spending. To fight inflation, the Fed sells bonds, draining reserves, reducing lending, and contracting the money supply.",
          
          "image": {
            "src": "images/unit4/cb_control.png",
            "alt": "Diagram showing central bank tools affecting reserves, affecting money supply",
            "caption": "Figure 4.3.10: The central bank controls the money supply by managing reserves through open market operations, discount rate, and reserve requirements."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating the Money Multiplier",
          
          "image": {
            "src": "images/unit4/multiplier_calc.png",
            "alt": "Table with reserve ratios for calculation",
            "caption": "Figure 4.3.11: Calculate the money multiplier for different reserve ratios."
          },
          
          "problem": "a) If the reserve requirement is 20%, what is the simple money multiplier? b) If the reserve requirement is 5%, what is the multiplier? c) If the Fed injects $\\$500$ million in reserves into the banking system with a 10% reserve requirement, what is the maximum potential increase in the money supply? d) If banks hold $\\$100$ million in excess reserves and the reserve requirement is 10%, how much additional lending can occur? e) If the public holds $\\$200$ million in cash (currency drain) and the reserve requirement is 10%, how does this affect the multiplier?",
          
          "step_by_step": [
            {
              "step": "Calculate multiplier for 20%",
              "explanation": "Simple money multiplier = $1 / rr = 1 / 0.20 = 5$."
            },
            {
              "step": "Calculate multiplier for 5%",
              "explanation": "Multiplier = $1 / 0.05 = 20$."
            },
            {
              "step": "Calculate potential increase with 10%",
              "explanation": "With 10% reserve requirement, multiplier = $1 / 0.10 = 10$. Maximum increase = Reserves × Multiplier = $\\$500$ million × 10 = $\\$5,000$ million = $\\$5$ billion."
            },
            {
              "step": "Calculate lending from excess reserves",
              "explanation": "Excess reserves of $\\$100$ million can support additional deposits of Excess Reserves × Multiplier = $\\$100$ million × 10 = $\\$1,000$ million = $\\$1$ billion, assuming banks lend them out."
            },
            {
              "step": "Explain currency drain effect",
              "explanation": "Currency drain reduces the multiplier because some money leaves the banking system and can't support further lending. The actual multiplier with currency drain is $m = (1 + c) / (rr + c)$, where $c$ is the currency drain ratio. If the public holds $\\$200$ million in cash relative to deposits, the ratio matters. The simple multiplier overstates actual money creation."
            }
          ],
          
          "final_answer": "a) 5. b) 20. c) $\\$5$ billion. d) $\\$1$ billion. e) Currency drain reduces multiplier below simple formula.",
          "concept_applied": "The money multiplier determines how much the money supply can expand from a given change in reserves. Leakages reduce the actual multiplier."
        },
        {
          "title": "T-Account Analysis of Money Creation",
          
          "image": {
            "src": "images/unit4/t_account_example.png",
            "alt": "Blank T-account for bank balance sheet",
            "caption": "Figure 4.3.12: Use T-accounts to track money creation through lending."
          },
          
          "problem": "A bank has the following initial balance sheet: Assets: Reserves $\\$100,000$, Loans $\\$900,000$. Liabilities: Deposits $\\$1,000,000$. The reserve requirement is 10%. a) Does the bank have excess reserves? If so, how much? b) The bank makes a new loan of $\\$50,000$. Show the new T-account. c) The borrower spends the $\\$50,000$, and the recipient deposits it in another bank. Show the T-account after the deposit leaves. d) What is the maximum total increase in the money supply from the initial $\\$100,000$ in reserves? e) If the bank had instead held $\\$20,000$ in excess reserves initially, how would your answers change?",
          
          "step_by_step": [
            {
              "step": "Check for excess reserves",
              "explanation": "Required reserves = 10% of deposits = 0.10 × $\\$1,000,000 = \\$100,000$. Actual reserves = $\\$100,000$. So excess reserves = $\\$0$. The bank is fully lent—no capacity for new loans."
            },
            {
              "step": "Make new loan",
              "explanation": "To make a $\\$50,000$ loan, the bank needs $\\$50,000$ in excess reserves. But it has none. So it cannot make the loan unless it first obtains additional reserves (from a deposit or Fed purchase)."
            },
            {
              "step": "Alternative: bank receives new deposit",
              "explanation": "Suppose instead the bank receives a new deposit of $\\$50,000$. New balance sheet: Assets: Reserves $\\$150,000$, Loans $\\$900,000$. Liabilities: Deposits $\\$1,050,000$. Required reserves now = 10% of $\\$1,050,000 = \\$105,000$. Excess reserves = $\\$150,000 - 105,000 = \\$45,000$. Bank can lend $\\$45,000$."
            },
            {
              "step": "Bank lends $\\$45,000$",
              "explanation": "Bank makes loan: Assets: Reserves $\\$150,000$, Loans $\\$945,000$. Liabilities: Deposits $\\$1,095,000$ (original $\\$1,050,000$ plus $\\$45,000$ loan credited to borrower)."
            },
            {
              "step": "Borrower spends, recipient deposits elsewhere",
              "explanation": "Borrower spends $\\$45,000$, recipient deposits in another bank. The first bank loses $\\$45,000$ in reserves: Assets: Reserves $\\$105,000$, Loans $\\$945,000$. Liabilities: Deposits $\\$1,050,000$ (back to original level). Now required reserves = $\\$105,000$, exactly met. The process continues at the next bank."
            },
            {
              "step": "Calculate maximum expansion",
              "explanation": "With initial reserves of $\\$100,000$ and 10% requirement, maximum deposits = Reserves / rr = $\\$100,000 / 0.10 = \\$1,000,000$. That's the initial level. The system is already at maximum. To expand, reserves must increase."
            }
          ],
          
          "final_answer": "a) No excess reserves. b) Can't lend without more reserves. c) With new deposit, excess reserves = $\\$45,000$, can lend that amount. d) Maximum deposits already at $\\$1,000,000$. e) Excess reserves would allow lending.",
          "concept_applied": "T-accounts track the effects of deposits, reserves, and loans on bank balance sheets. Money creation requires excess reserves."
        },
        {
          "title": "Money Creation with Multiple Banks",
          
          "image": {
            "src": "images/unit4/multiple_banks.png",
            "alt": "Table showing rounds of lending across multiple banks",
            "caption": "Figure 4.3.13: Track the money creation process across multiple banks."
          },
          
          "problem": "The Fed injects $\\$1,000$ of new reserves into the banking system by buying a bond from Bank A. The reserve requirement is 20%. Assume no currency drain and that banks lend all excess reserves. a) Show Bank A's balance sheet after the Fed purchase but before any lending. b) Bank A lends its excess reserves. Show the T-account after the loan is made and the funds are spent and deposited in Bank B. c) Show Bank B's balance sheet after receiving the deposit, and its lending. d) Continue for one more round (Bank C). e) What is the total increase in deposits after all rounds?",
          
          "step_by_step": [
            {
              "step": "Bank A after Fed purchase",
              "explanation": "The Fed buys a $\\$1,000$ bond from Bank A, paying by increasing Bank A's reserves. Bank A's assets: Reserves +$\\$1,000$, Securities -$\\$1,000$. Liabilities unchanged. Assuming Bank A had no excess reserves before, it now has $\\$1,000$ in new reserves. Required reserves on existing deposits unchanged. So excess reserves = $\\$1,000$."
            },
            {
              "step": "Bank A lends excess reserves",
              "explanation": "Bank A lends $\\$1,000$ to a borrower. Assets: Loans +$\\$1,000$, Reserves unchanged (loan credited to borrower's account). Liabilities: Deposits +$\\$1,000$ (borrower's account). Now borrower spends the $\\$1,000$, and the recipient deposits in Bank B. Bank A loses the reserves when the check clears: Assets: Reserves -$\\$1,000$, Loans +$\\$1,000$ (net assets unchanged). Liabilities: Deposits back to original level. Bank A ends with $\\$1,000$ more loans, $\\$1,000$ less securities (from Fed purchase), and no change in deposits or reserves from initial."
            },
            {
              "step": "Bank B receives deposit",
              "explanation": "Bank B receives a $\\$1,000$ deposit. Assets: Reserves +$\\$1,000$. Liabilities: Deposits +$\\$1,000$. Required reserves on new deposit = 20% of $\\$1,000 = \\$200$. Excess reserves = $\\$1,000 - 200 = \\$800$. Bank B can lend $\\$800$."
            },
            {
              "step": "Bank B lends",
              "explanation": "Bank B lends $\\$800$. Assets: Loans +$\\$800$, Reserves unchanged (loan credited). Liabilities: Deposits +$\\$800$. Borrower spends, recipient deposits in Bank C. Bank B loses reserves: Assets: Reserves -$\\$800$, Loans +$\\$800$. Liabilities: Deposits back to $\\$1,000$ (original deposit remains)."
            },
            {
              "step": "Bank C receives deposit",
              "explanation": "Bank C receives $\\$800$ deposit. Assets: Reserves +$\\$800$. Liabilities: Deposits +$\\$800$. Required reserves = 20% of $\\$800 = \\$160$. Excess reserves = $\\$800 - 160 = \\$640$. Bank C can lend $\\$640$."
            },
            {
              "step": "Calculate total increase",
              "explanation": "Initial deposit at Bank B: $\\$1,000$. Bank B lending created $\\$800$ deposit at Bank C. Bank C lending will create $\\$640$ at Bank D, etc. Total increase in deposits = $1,000 + 800 + 640 + 512 + ... = 1,000 × (1 / (1 - 0.8)) = 1,000 × 5 = \\$5,000$. This matches multiplier: 1/rr = 1/0.2 = 5, times initial excess reserves of $\\$1,000$."
            }
          ],
          
          "final_answer": "a) Bank A has $\\$1,000$ excess reserves. b) Bank A lends $\\$1,000$, funds go to Bank B. c) Bank B has $\\$800$ excess reserves, lends $\\$800$. d) Bank C has $\\$640$ excess reserves. e) Total increase = $\\$5,000$.",
          "concept_applied": "The money creation process works through successive banks. Each bank lends its excess reserves, creating new deposits elsewhere."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Central Bank Injects Reserves",
          "description": "The process often starts with the central bank injecting reserves into the banking system, typically through an open market purchase of government securities.",
          "mechanism": "The Fed buys bonds from a bank, paying by increasing the bank's reserve account at the Fed. The bank now has more reserves than required—excess reserves.",
          "result": "Banking system has excess reserves available for lending.",
          
          "image": {
            "src": "images/unit4/money_step1.png",
            "alt": "Fed buying bond from bank, increasing reserves",
            "caption": "Figure 4.3.14: Step 1 - Central bank injects reserves through open market purchase."
          }
        },
        {
          "step": 2,
          "process": "Bank Lends Excess Reserves",
          "description": "A bank with excess reserves can make new loans. When it makes a loan, it credits the borrower's account, creating a new deposit.",
          "mechanism": "The bank's balance sheet shows loans increase and deposits increase by the same amount. Reserves are unchanged initially. New money is created.",
          "result": "New loan and new deposit created.",
          
          "image": {
            "src": "images/unit4/money_step2.png",
            "alt": "Bank making loan, creating deposit",
            "caption": "Figure 4.3.15: Step 2 - Bank lends excess reserves, creating a new deposit."
          }
        },
        {
          "step": 3,
          "process": "Borrower Spends, Funds Deposited Elsewhere",
          "description": "The borrower spends the loan proceeds. The recipient deposits the funds in their bank (which may be a different bank).",
          "mechanism": "When the check clears, the lending bank loses reserves equal to the loan amount. The recipient bank gains reserves and a new deposit.",
          "result": "Reserves and deposits transfer to another bank.",
          
          "image": {
            "src": "images/unit4/money_step3.png",
            "alt": "Funds flowing from borrower to seller to another bank",
            "caption": "Figure 4.3.16: Step 3 - Borrower spends, recipient deposits in another bank, transferring reserves."
          }
        },
        {
          "step": 4,
          "process": "Recipient Bank Has New Excess Reserves",
          "description": "The recipient bank now has a new deposit and increased reserves. It must hold required reserves against the new deposit, but the rest are excess reserves available for lending.",
          "mechanism": "Required reserves = rr × new deposit. Excess reserves = new reserves - required reserves. These excess reserves can be lent, continuing the process.",
          "result": "Second-round excess reserves created.",
          
          "image": {
            "src": "images/unit4/money_step4.png",
            "alt": "Bank calculating required and excess reserves from new deposit",
            "caption": "Figure 4.3.17: Step 4 - Recipient bank has new excess reserves after setting aside required reserves."
          }
        },
        {
          "step": 5,
          "process": "Process Continues Until Reserves Exhausted",
          "description": "The lending-depositing cycle repeats until no bank has excess reserves—all reserves are being held as required reserves against deposits.",
          "mechanism": "Each round creates smaller excess reserves because a fraction is held as required reserves. The total increase in deposits is the initial excess reserves times the money multiplier.",
          "result": "Maximum expansion of money supply achieved.",
          
          "image": {
            "src": "images/unit4/money_step5.png",
            "alt": "Chain of banks with diminishing amounts, finally stopping",
            "caption": "Figure 4.3.18: Step 5 - The process continues through many banks until reserves are fully utilized."
          }
        }
      ],

      "image": {
        "src": "images/unit4/money_creation_summary.png",
        "alt": "Comprehensive summary diagram of money creation process, multiplier, and central bank tools",
        "caption": "Figure 4.3.19: Money creation summary - fractional reserve banking, multiplier, and central bank control."
      }
    }
  ],

  "key_terms": [
    "Money creation",
    "Fractional reserve banking",
    "Reserves",
    "Required reserves",
    "Excess reserves",
    "Reserve requirement",
    "Reserve ratio (rr)",
    "Money multiplier",
    "Simple money multiplier",
    "Actual money multiplier",
    "Currency drain",
    "Currency drain ratio",
    "Leakages",
    "Open market operations",
    "Open market purchase",
    "Open market sale",
    "Discount rate",
    "Federal funds rate",
    "Bank lending",
    "Loan creation",
    "Deposit creation",
    "T-account",
    "Balance sheet",
    "Assets",
    "Liabilities",
    "Bank run",
    "Liquidity",
    "Solvency",
    "Central bank",
    "Monetary policy",
    "Expansionary monetary policy",
    "Contractionary monetary policy",
    "Quantitative easing",
    "Excess reserves after 2008",
    "Interest on reserves",
    "Monetary base",
    "M1",
    "M2",
    "Money supply"
  ],

  "summary": "In a fractional reserve banking system, banks create money through the process of lending. When a bank makes a loan, it creates a new deposit in the borrower's account, which is counted as part of the money supply. This new money can be spent, deposited in another bank, and lent again, leading to a multiple expansion of the initial deposit. The extent of money creation is limited by the reserve requirement—the fraction of deposits that banks must hold as reserves (either as vault cash or deposits at the central bank). The simple money multiplier is $1/rr$, where $rr$ is the reserve ratio. For example, with a 10% reserve requirement, the multiplier is 10, meaning that an initial $\\$1,000$ increase in reserves can ultimately support a $\\$10,000$ increase in the money supply. However, the actual multiplier is smaller due to leakages: banks may hold excess reserves (reserves above the requirement), and borrowers may hold some cash (currency drain), both of which reduce the multiplier. The money creation process works in reverse when loans are repaid: money is destroyed as borrowers use money to repay loans, reducing deposits. The central bank controls the money supply by managing the total amount of reserves in the banking system through three main tools. Open market operations—buying and selling government securities—directly inject or drain reserves. An open market purchase increases reserves, supporting money creation; an open market sale decreases reserves, contracting the money supply. The discount rate is the interest rate the central bank charges on loans to banks, affecting banks' willingness to borrow reserves. Changing the reserve requirement alters the money multiplier: a higher requirement reduces the multiplier; a lower requirement increases it. After the 2008 financial crisis, banks began holding massive excess reserves, and the Fed began paying interest on those reserves, changing the dynamics of money creation and monetary policy. Understanding money creation is essential for analyzing monetary policy, inflation, and the role of banks in the economy."
}
