{
  "expanded_description": "How do policymakers know whether the economy needs stimulus or restraint? How do they predict the effects of their actions? The AD-AS model provides the framework. By analyzing where the economy is relative to long-run equilibrium—and where it's headed—policymakers can determine the appropriate policy response. The AD-AS model also allows them to trace the effects of policy actions through the economy, showing how changes in aggregate demand or aggregate supply affect output, employment, and prices. In this section, we'll use the AD-AS framework to analyze policy goals. We'll examine how expansionary and contractionary policies work in the model, how they affect the economy in the short run and long run, and how policymakers use the model to guide their decisions. Understanding policy in the AD-AS framework is essential for making sense of real-world policy debates and for succeeding on the AP exam.",
  
  "core_concept": {
    "principle": "The AD-AS model provides a framework for analyzing macroeconomic policy. It shows the relationship between the price level and real GDP, with aggregate demand (AD) sloping downward, short-run aggregate supply (SRAS) sloping upward, and long-run aggregate supply (LRAS) vertical at potential GDP. Policy goals—maximum employment, stable prices, and economic growth—can be understood in terms of the model. Maximum employment occurs when the economy is at potential GDP (on the LRAS curve), where unemployment is at the natural rate. Stable prices mean the price level is stable or inflation is low and predictable—in the model, this means the economy is not experiencing sustained inflationary or deflationary pressure from demand. Economic growth is shown by rightward shifts in LRAS over time as potential GDP increases. Using the AD-AS model, policymakers can diagnose the economy's position. If the economy is in a recessionary gap (short-run equilibrium with output below potential, price level below expected), expansionary policy is needed to shift AD right, increasing output and employment toward potential. If the economy is in an inflationary gap (output above potential, price level above expected), contractionary policy is needed to shift AD left, reducing output and inflationary pressure. The model also shows the effects of supply shocks and supply-side policies. A negative supply shock shifts SRAS left, causing stagflation—higher prices and lower output. Supply-side policies aim to shift LRAS and SRAS right, increasing potential output and reducing inflationary pressure. The model distinguishes short-run and long-run effects. In the short run, policy can affect real GDP. In the long run, after expectations adjust, the economy returns to potential GDP, and policy affects only the price level. This is why policymakers focus on stabilizing the economy in the short run while promoting conditions for long-run growth.",
    
    "explanation": "Imagine the economy as a car on a highway. The LRAS is the speed limit—the maximum sustainable speed. The AD and SRAS curves show where the car actually is. If the car is below the speed limit (recessionary gap), you step on the gas (expansionary policy) to speed up. If it's above the speed limit (inflationary gap), you tap the brakes (contractionary policy) to slow down before you get a ticket (inflation). The curves shift as you act. Over time, the speed limit itself increases as the economy grows (LRAS shifts right). The AD-AS model is the dashboard that shows where you are and how your actions affect the car's position.",
    
    "image": {
      "src": "images/unit4/ad_as_policy_overview.png",
      "alt": "AD-AS graph showing recessionary gap, inflationary gap, and long-run equilibrium with policy arrows",
      "caption": "Figure 4.4.1: The AD-AS model shows the economy's position relative to potential GDP and guides policy responses."
    }
  },

  "sections": [
    {
      "section_title": "4.4 Policy Goals in AD-AS",
      "introduction": "The AD-AS model is the workhorse of macroeconomic analysis. It shows how the economy behaves in the short run and long run, and how policy interventions affect output, employment, and prices. In this section, we'll use the AD-AS framework to analyze policy goals. We'll examine how to identify recessionary and inflationary gaps, how expansionary and contractionary policies work in the model, how the economy adjusts in the long run, and how supply-side policies differ from demand-side policies. Understanding policy in the AD-AS framework is essential for analyzing real-world economic conditions and policy debates.",
      
      "introduction_image": {
        "src": "images/unit4/ad_as_intro.png",
        "alt": "Basic AD-AS graph with AD, SRAS, and LRAS curves",
        "caption": "Figure 4.4.2: The AD-AS model shows the relationship between the price level and real GDP, with LRAS at potential GDP."
      },
      
      "key_concept": {
        "definition": "The AD-AS model provides a framework for analyzing macroeconomic policy. It consists of three curves. Aggregate demand (AD) shows the negative relationship between the price level and the quantity of real GDP demanded. It slopes downward due to the wealth effect, interest rate effect, and exchange rate effect. Short-run aggregate supply (SRAS) shows the positive relationship between the price level and the quantity of real GDP supplied in the short run. It slopes upward because wages and other input prices are sticky in the short run. Long-run aggregate supply (LRAS) is vertical at potential GDP—the level of output the economy can produce when all resources are fully employed. In the long run, wages and prices adjust, and the economy returns to potential. Policy goals can be understood in this framework. Maximum employment occurs when the economy is at potential GDP (on the LRAS curve), with unemployment at the natural rate. Stable prices mean the price level is stable or inflation is low—in the model, this means the economy is not experiencing sustained inflationary or deflationary pressure from demand. Economic growth is shown by rightward shifts in LRAS over time. Using the model, policymakers diagnose the economy's position. A recessionary gap occurs when short-run equilibrium output is below potential GDP. The price level is below expected, and unemployment is above the natural rate. Appropriate policy: expansionary (increase AD) to close the gap. An inflationary gap occurs when short-run equilibrium output is above potential GDP. The price level is above expected, and unemployment is below the natural rate. Appropriate policy: contractionary (decrease AD) to close the gap. The model also shows the effects of supply shocks. A negative supply shock (e.g., oil price increase) shifts SRAS left, causing stagflation—higher prices and lower output. A positive supply shock (e.g., productivity improvement) shifts SRAS right, lowering prices and increasing output. Supply-side policies aim to shift LRAS and SRAS right by increasing potential output. The model distinguishes short-run and long-run effects. In the short run, policy can affect real GDP. In the long run, after expectations adjust, the economy returns to potential GDP, and policy affects only the price level. This is the basis for the concept of monetary neutrality in the long run.",
        
        "context": "The AD-AS model was developed from Keynesian economics and refined over decades. It synthesizes classical and Keynesian insights: in the short run, sticky prices mean policy can affect output; in the long run, prices adjust and the economy returns to potential. This framework is used by central banks, governments, and international organizations to analyze economic conditions and policy options. In AP Macroeconomics, the AD-AS model is the primary tool for analyzing policy effects and is heavily tested on the exam.",
        
        "image": {
          "src": "images/unit4/ad_as_gaps.png",
          "alt": "AD-AS graph showing both recessionary gap and inflationary gap",
          "caption": "Figure 4.4.3: Recessionary gap (output below potential) and inflationary gap (output above potential) in the AD-AS model."
        }
      },

      "classifications": [
        {
          "type": "Recessionary Gap",
          "value": "Short-run equilibrium output below potential GDP",
          "characteristics": ["Output < potential", "Unemployment > natural rate", "Price level below expected", "Downward pressure on wages and prices", "Expansionary policy appropriate"],
          "behavior": "In a recessionary gap, the economy is operating below its sustainable capacity. High unemployment means resources are idle. Weak demand puts downward pressure on wages and prices—over time, the SRAS curve will shift right as wages and input prices fall, moving the economy back toward potential without policy intervention. However, this self-correction can be slow and painful. Expansionary policy (increasing AD) can speed the return to potential by shifting AD right. This increases output and employment in the short run, and if successful, returns the economy to potential with a higher price level than would otherwise occur. The policy choice is between waiting for self-correction (which may take years) or intervening to shorten the recession.",
          
          "image": {
            "src": "images/unit4/recessionary_gap.png",
            "alt": "AD-AS graph with equilibrium below LRAS, showing recessionary gap",
            "caption": "Figure 4.4.4: Recessionary gap: output below potential. Expansionary policy shifts AD right to close the gap."
          },
          
          "examples": [
            {
              "process": "2008-09 Great Recession",
              "explanation": "The economy fell into a deep recessionary gap. The Fed used expansionary monetary policy (zero rates, QE). Congress used expansionary fiscal policy (stimulus). These policies shifted AD right, helping close the gap over time."
            },
            {
              "process": "2020 pandemic recession",
              "explanation": "The economy plunged into a severe recessionary gap. Massive expansionary policy response shifted AD right, contributing to a rapid recovery."
            }
          ]
        },
        {
          "type": "Inflationary Gap",
          "value": "Short-run equilibrium output above potential GDP",
          "characteristics": ["Output > potential", "Unemployment < natural rate", "Price level above expected", "Upward pressure on wages and prices", "Contractionary policy appropriate"],
          "behavior": "In an inflationary gap, the economy is operating above its sustainable capacity. Very low unemployment means labor markets are tight, putting upward pressure on wages. Strong demand pushes prices up. Over time, the SRAS curve will shift left as wages and input prices rise, moving the economy back toward potential. But this self-correction involves inflation. Contractionary policy (decreasing AD) can shift AD left, reducing output and inflationary pressure. If done carefully, this can achieve a 'soft landing'—returning to potential without causing a recession. If policy is too aggressive, it may create a recessionary gap. The challenge is to apply just enough restraint to control inflation without overshooting.",
          
          "image": {
            "src": "images/unit4/inflationary_gap.png",
            "alt": "AD-AS graph with equilibrium above LRAS, showing inflationary gap",
            "caption": "Figure 4.4.5: Inflationary gap: output above potential. Contractionary policy shifts AD left to close the gap and reduce inflation."
          },
          
          "examples": [
            {
              "process": "Late 1990s",
              "explanation": "The economy was near or slightly above potential, with low unemployment. The Fed raised rates preemptively to prevent overheating, achieving a soft landing."
            },
            {
              "process": "2022-23",
              "explanation": "With inflation high and unemployment very low, the Fed raised rates aggressively to close the inflationary gap and bring inflation back to target."
            }
          ]
        },
        {
          "type": "Long-Run Equilibrium",
          "value": "Economy at potential GDP",
          "characteristics": ["Output = potential", "Unemployment = natural rate", "Price level at expected level", "No tendency to change", "Neutral policy stance"],
          "behavior": "In long-run equilibrium, the economy is operating at its sustainable capacity. The short-run equilibrium occurs at the intersection of AD and SRAS, which is exactly on the LRAS curve. Unemployment is at the natural rate (including frictional and structural but no cyclical unemployment). There is no tendency for output to change unless shocked. In this situation, policymakers typically maintain a neutral stance—neither expansionary nor contractionary—unless they anticipate future shocks. The long-run equilibrium is the goal of stabilization policy: to keep the economy as close to potential as possible, avoiding both costly recessions and inflationary booms.",
          
          "image": {
            "src": "images/unit4/long_run_eq.png",
            "alt": "AD-AS graph with AD, SRAS, and LRAS intersecting at same point",
            "caption": "Figure 4.4.6: Long-run equilibrium: economy at potential GDP, unemployment at natural rate."
          },
          
          "examples": [
            {
              "process": "2019",
              "explanation": "Before the pandemic, the U.S. economy was near potential GDP with unemployment at 3.5% (near estimates of the natural rate) and inflation around 2%. The Fed maintained a neutral policy stance."
            },
            {
              "process": "Ideal state",
              "explanation": "Policymakers aim to keep the economy near long-run equilibrium as much as possible, using policy to offset shocks and smooth the cycle."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Expansionary Policy Shifts AD Right",
          "statement": "Expansionary monetary or fiscal policy increases aggregate demand, shifting the AD curve to the right. In the short run, this increases real GDP and the price level. The effect on output depends on where the economy is relative to potential. If the economy is in a recessionary gap with slack resources, expansionary policy can increase output significantly with only modest inflation. As the economy approaches potential, further stimulus causes more inflation and less output gain. In the long run, after expectations adjust, expansionary policy leads only to a higher price level—real GDP returns to potential. This is why expansionary policy is most effective when the economy has substantial slack, and why policymakers must be careful not to overstimulate when the economy is near potential.",
          "application": "When analyzing expansionary policy in the AD-AS model, show the AD curve shifting right. The new short-run equilibrium has higher output and higher price level. If starting from a recessionary gap, this moves the economy toward potential. If starting from potential, it creates an inflationary gap. The magnitude of output gain versus inflation depends on the slope of SRAS—flatter SRAS means more output gain, less inflation; steeper SRAS means less output gain, more inflation.",
          "example": "In 2020, the Fed's rate cuts and Congress's stimulus shifted AD right. With the economy in a deep recessionary gap, this produced a large increase in output (rapid recovery) and initially modest inflation. As the economy rebounded and supply constraints emerged, further stimulus contributed to higher inflation.",
          
          "image": {
            "src": "images/unit4/expansionary_ad_as.png",
            "alt": "AD-AS graph showing AD shifting right, output and price level increasing",
            "caption": "Figure 4.4.7: Expansionary policy shifts AD right, increasing output and price level in the short run."
          }
        },
        {
          "principle": "Contractionary Policy Shifts AD Left",
          "statement": "Contractionary monetary or fiscal policy decreases aggregate demand, shifting the AD curve to the left. In the short run, this decreases real GDP and the price level. If the economy is in an inflationary gap, this moves it toward potential, reducing inflationary pressure. However, contractionary policy also reduces output and increases unemployment in the short run. If applied when the economy is already at potential, it creates a recessionary gap. The challenge is to apply enough restraint to control inflation without causing unnecessary unemployment. In the long run, after expectations adjust, contractionary policy leads only to a lower price level—real GDP returns to potential.",
          "application": "When analyzing contractionary policy, show the AD curve shifting left. The new short-run equilibrium has lower output and lower price level. If starting from an inflationary gap, this closes the gap. If starting from potential, it creates a recessionary gap. The output loss depends on the slope of SRAS—steeper SRAS means larger output loss for a given price reduction.",
          "example": "In 2022-23, the Fed's rate hikes shifted AD left. With the economy operating above potential and inflation high, this reduced inflationary pressure. However, there were concerns it could go too far and cause a recession—the classic risk of contractionary policy.",
          
          "image": {
            "src": "images/unit4/contractionary_ad_as.png",
            "alt": "AD-AS graph showing AD shifting left, output and price level decreasing",
            "caption": "Figure 4.4.8: Contractionary policy shifts AD left, decreasing output and price level in the short run."
          }
        },
        {
          "principle": "Supply-Side Policies Shift LRAS and SRAS Right",
          "statement": "Supply-side policies aim to increase the economy's potential output by shifting the LRAS curve right. They also shift SRAS right in the short run. These policies include investments in education and training (increasing human capital), infrastructure spending (increasing physical capital), research and development (promoting technological progress), tax reforms that improve work and investment incentives, deregulation that reduces costs and improves efficiency, and policies to increase labor force participation. In the AD-AS model, a rightward shift in both LRAS and SRAS increases potential output, reduces the price level (or inflationary pressure), and can increase actual output. Supply-side policies are particularly valuable because they address the root causes of growth and can improve the trade-off between inflation and unemployment. Unlike demand-side policies, which are cyclical, supply-side policies affect the economy's long-run trajectory.",
          "application": "When analyzing supply-side policies, show LRAS shifting right (increased potential GDP) and SRAS shifting right (lower costs). The new equilibrium has higher output and a lower price level than would otherwise occur. These policies take time to work but have lasting effects.",
          "example": "The Tax Reform Act of 1986, deregulation in transportation and communications, and increased investment in technology in the 1990s contributed to rightward shifts in LRAS, supporting non-inflationary growth. Infrastructure bills and investments in green energy today are intended as supply-side policies to boost potential output.",
          
          "image": {
            "src": "images/unit4/supply_side_ad_as.png",
            "alt": "AD-AS graph showing LRAS and SRAS shifting right, output increasing, price level decreasing",
            "caption": "Figure 4.4.9: Supply-side policies shift LRAS and SRAS right, increasing potential output and reducing inflationary pressure."
          }
        },
        {
          "principle": "The Economy Self-Corrects in the Long Run",
          "statement": "In the AD-AS model, the economy has a self-correcting mechanism. In a recessionary gap, high unemployment puts downward pressure on wages and other input prices. As these fall, SRAS shifts right, moving the economy back toward potential GDP without policy intervention. The process continues until the economy returns to long-run equilibrium at a lower price level. In an inflationary gap, low unemployment puts upward pressure on wages, shifting SRAS left, moving the economy back toward potential at a higher price level. This self-correction means that in the long run, the economy returns to potential GDP regardless of policy. However, the adjustment process can be slow and painful—waiting for wages to fall during a recession means years of high unemployment. This is why policymakers use active stabilization policy to speed the return to potential and reduce the human costs of recessions. The self-correction mechanism also implies that in the long run, monetary policy is neutral—it affects only the price level, not real GDP.",
          "application": "When analyzing policy, consider both the short-run effects and the long-run adjustment. In the short run, policy can move the economy. In the long run, after expectations adjust, the economy returns to potential. This distinction is crucial for understanding why policy has limits and why expectations matter.",
          "example": "During the Great Depression, the economy remained far below potential for years—self-correction was extremely slow. This motivated Keynesian economics and active stabilization policy. In contrast, the 1990-91 recession was followed by a relatively quick self-correction as the economy returned to potential with modest policy support.",
          
          "image": {
            "src": "images/unit4/self_correction.png",
            "alt": "AD-AS graph showing SRAS shifting right in recessionary gap and left in inflationary gap over time",
            "caption": "Figure 4.4.10: The economy self-corrects in the long run as wages adjust—SRAS shifts until the economy returns to potential."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Gaps in AD-AS",
          
          "image": {
            "src": "images/unit4/gap_identification.png",
            "alt": "Three AD-AS graphs showing different equilibria",
            "caption": "Figure 4.4.11: Identify whether each graph shows a recessionary gap, inflationary gap, or long-run equilibrium."
          },
          
          "problem": "For each scenario, draw a basic AD-AS graph (AD, SRAS, LRAS) and identify whether the economy is in a recessionary gap, inflationary gap, or long-run equilibrium. Then state whether expansionary, contractionary, or neutral policy is appropriate. a) Actual GDP is $\\$22$ trillion, potential GDP is $\\$20$ trillion. b) Actual GDP is $\\$18$ trillion, potential GDP is $\\$20$ trillion. c) Actual GDP equals potential GDP. d) Unemployment is 8%, the natural rate is 5%. e) Inflation is rising rapidly, and unemployment is 3% (natural rate 5%).",
          
          "step_by_step": [
            {
              "step": "Analyze scenario a",
              "explanation": "Actual > potential → output above potential. This is an inflationary gap. Appropriate policy: contractionary to reduce demand and close the gap."
            },
            {
              "step": "Analyze scenario b",
              "explanation": "Actual < potential → output below potential. This is a recessionary gap. Appropriate policy: expansionary to increase demand and close the gap."
            },
            {
              "step": "Analyze scenario c",
              "explanation": "Actual = potential → long-run equilibrium. Appropriate policy: neutral (no change needed)."
            },
            {
              "step": "Analyze scenario d",
              "explanation": "Unemployment (8%) above natural rate (5%) → economy below potential. Recessionary gap. Expansionary policy appropriate."
            },
            {
              "step": "Analyze scenario e",
              "explanation": "Inflation rising, unemployment (3%) below natural rate (5%) → economy above potential. Inflationary gap. Contractionary policy appropriate."
            }
          ],
          
          "final_answer": "a) Inflationary gap → contractionary. b) Recessionary gap → expansionary. c) Long-run equilibrium → neutral. d) Recessionary gap → expansionary. e) Inflationary gap → contractionary.",
          "concept_applied": "Comparing actual GDP to potential GDP (or unemployment to natural rate) identifies the economy's position and the appropriate policy direction."
        },
        {
          "title": "Graphing Policy Effects",
          
          "image": {
            "src": "images/unit4/policy_graphing.png",
            "alt": "Blank AD-AS graphs for drawing policy effects",
            "caption": "Figure 4.4.12: Draw the effects of expansionary and contractionary policy on AD-AS graphs."
          },
          
          "problem": "Draw two AD-AS graphs. On the first, show an economy in a recessionary gap. Then show the effect of expansionary monetary policy. Label the initial equilibrium E1 and the new short-run equilibrium E2. On the second, show an economy in an inflationary gap. Then show the effect of contractionary fiscal policy. Label E1 and E2. Explain what happens to output and the price level in each case.",
          
          "step_by_step": [
            {
              "step": "Draw recessionary gap graph",
              "explanation": "Draw LRAS vertical at potential GDP. Draw AD and SRAS intersecting to the left of LRAS. Label equilibrium E1 with output Y1 (< potential) and price level P1."
            },
            {
              "step": "Show expansionary policy",
              "explanation": "Expansionary policy shifts AD right. Draw new AD curve (AD2) intersecting SRAS at a point closer to LRAS. Label new equilibrium E2 with output Y2 (> Y1, closer to potential) and price level P2 (> P1)."
            },
            {
              "step": "Explain effects",
              "explanation": "Output increases (recessionary gap narrows). Price level rises (some inflation). The economy moves toward potential GDP."
            },
            {
              "step": "Draw inflationary gap graph",
              "explanation": "Draw LRAS at potential. Draw AD and SRAS intersecting to the right of LRAS. Label equilibrium E1 with output Y1 (> potential) and price level P1."
            },
            {
              "step": "Show contractionary policy",
              "explanation": "Contractionary policy shifts AD left. Draw new AD curve (AD2) intersecting SRAS at a point closer to LRAS (ideally at potential). Label new equilibrium E2 with output Y2 (< Y1, closer to potential) and price level P2 (< P1)."
            },
            {
              "step": "Explain effects",
              "explanation": "Output decreases (inflationary gap narrows). Price level falls (inflation slows). The economy moves back toward potential GDP."
            }
          ],
          
          "final_answer": "Graphs drawn as described. Expansionary policy: AD right, output ↑, price level ↑. Contractionary policy: AD left, output ↓, price level ↓.",
          "concept_applied": "Policy shifts AD. The direction of shift determines effects on output and prices in the short run."
        },
        {
          "title": "Long-Run Adjustment",
          
          "image": {
            "src": "images/unit4/long_run_adjustment.png",
            "alt": "AD-AS graph with multiple SRAS curves showing long-run adjustment",
            "caption": "Figure 4.4.13: Show how the economy self-corrects from a recessionary gap without policy."
          },
          
          "problem": "Starting from a recessionary gap, explain and show graphically how the economy self-corrects in the long run without policy intervention. What happens to wages, SRAS, output, and the price level? How does this compare to using expansionary policy? What are the costs of waiting for self-correction?",
          
          "step_by_step": [
            {
              "step": "Draw initial recessionary gap",
              "explanation": "LRAS at potential, AD and SRAS intersecting left of LRAS. Output Y1 < potential, price level P1. Unemployment above natural rate puts downward pressure on wages."
            },
            {
              "step": "Show wage adjustment",
              "explanation": "High unemployment causes wages to fall over time. Lower wages reduce firms' costs, shifting SRAS right."
            },
            {
              "step": "Show new equilibrium",
              "explanation": "SRAS shifts right until it intersects AD at LRAS. New equilibrium at potential GDP with lower price level P2 (< P1). Output returns to potential without policy."
            },
            {
              "step": "Compare to policy",
              "explanation": "With expansionary policy, AD shifts right, reaching potential at a higher price level. Policy achieves faster return to potential but with more inflation. Self-correction is slower but results in lower price level."
            },
            {
              "step": "Discuss costs",
              "explanation": "Waiting for self-correction means prolonged high unemployment—costly in human terms (joblessness, lost output, hardship). This is why policymakers often prefer active stabilization."
            }
          ],
          
          "final_answer": "Self-correction: wages fall → SRAS right → output returns to potential at lower price level. Costs: prolonged unemployment. Policy: faster return but higher price level.",
          "concept_applied": "The economy self-corrects through wage and price adjustment, but slowly. Policy can speed the process at the cost of higher inflation."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Economy's Position",
          "description": "Using data on GDP, unemployment, and inflation, determine whether the economy is at, above, or below potential GDP.",
          "mechanism": "Compare actual GDP to estimates of potential GDP. Compare unemployment to natural rate. Assess inflation relative to target.",
          "result": "Diagnosis: recessionary gap, inflationary gap, or long-run equilibrium.",
          
          "image": {
            "src": "images/unit4/ad_as_step1.png",
            "alt": "Economist looking at data charts to determine economy's position",
            "caption": "Figure 4.4.14: Step 1 - Identify whether the economy is in a recessionary gap, inflationary gap, or long-run equilibrium."
          }
        },
        {
          "step": 2,
          "process": "Determine Policy Direction",
          "description": "Based on the diagnosis, decide whether expansionary, contractionary, or neutral policy is needed.",
          "mechanism": "Recessionary gap → expansionary. Inflationary gap → contractionary. Long-run equilibrium → neutral. Consider magnitude of gap to determine how much stimulus or restraint is needed.",
          "result": "Policy direction chosen.",
          
          "image": {
            "src": "images/unit4/ad_as_step2.png",
            "alt": "Decision tree leading to expansionary, contractionary, or neutral policy",
            "caption": "Figure 4.4.15: Step 2 - Match the gap to the appropriate policy direction."
          }
        },
        {
          "step": 3,
          "process": "Choose Policy Tools",
          "description": "Select the appropriate monetary and/or fiscal tools to implement the chosen policy direction.",
          "mechanism": "For expansionary: open market purchases, lower discount rate, tax cuts, spending increases. For contractionary: open market sales, higher discount rate, tax increases, spending cuts. Consider lags, political feasibility, and coordination.",
          "result": "Policy package designed.",
          
          "image": {
            "src": "images/unit4/ad_as_step3.png",
            "alt": "Fed and Congress choosing from policy toolboxes",
            "caption": "Figure 4.4.16: Step 3 - Choose specific monetary and fiscal tools to implement the policy direction."
          }
        },
        {
          "step": 4,
          "process": "Implement Policy and Show AD Shift",
          "description": "Policy actions shift the AD curve in the intended direction. In the AD-AS model, this is shown as a right or left shift of AD.",
          "mechanism": "Expansionary policy shifts AD right. Contractionary policy shifts AD left. The new short-run equilibrium has different output and price level.",
          "result": "AD shifted; new short-run equilibrium.",
          
          "image": {
            "src": "images/unit4/ad_as_step4.png",
            "alt": "AD-AS graph showing AD shifting right or left",
            "caption": "Figure 4.4.17: Step 4 - Policy shifts AD, moving the economy to a new short-run equilibrium."
          }
        },
        {
          "step": 5,
          "process": "Monitor and Adjust",
          "description": "Observe the economy's response. If the gap persists, further action may be needed. If the economy overshoots, reverse direction may be necessary.",
          "mechanism": "Track output, employment, and inflation. Compare to forecasts. Adjust policy as needed based on new information and evolving conditions.",
          "result": "Ongoing policy management.",
          
          "image": {
            "src": "images/unit4/ad_as_step5.png",
            "alt": "Dashboard showing economic indicators with feedback loop to policymakers",
            "caption": "Figure 4.4.18: Step 5 - Monitor effects and adjust policy as needed."
          }
        }
      ],

      "image": {
        "src": "images/unit4/ad_as_policy_summary.png",
        "alt": "Comprehensive diagram linking AD-AS gaps to policy responses, with short-run and long-run effects",
        "caption": "Figure 4.4.19: Policy goals in AD-AS summary - identifying gaps, policy responses, and short-run vs long-run effects."
      }
    }
  ],

  "key_terms": [
    "Aggregate demand (AD)",
    "Short-run aggregate supply (SRAS)",
    "Long-run aggregate supply (LRAS)",
    "Potential GDP",
    "Full-employment output",
    "Recessionary gap",
    "Inflationary gap",
    "Output gap",
    "Long-run equilibrium",
    "Short-run equilibrium",
    "Expansionary policy",
    "Contractionary policy",
    "Neutral policy",
    "Demand-side policy",
    "Supply-side policy",
    "Stabilization policy",
    "Self-correction",
    "Automatic adjustment",
    "Wage flexibility",
    "Price flexibility",
    "Sticky wages",
    "Sticky prices",
    "Monetary neutrality",
    "Long-run neutrality of money",
    "Classical dichotomy",
    "Natural rate of unemployment",
    "Cyclical unemployment",
    "AD shift factors",
    "SRAS shift factors",
    "LRAS shift factors",
    "Supply shock",
    "Demand shock",
    "Cost-push inflation",
    "Demand-pull inflation",
    "Stagflation",
    "Soft landing",
    "Hard landing",
    "Overheating",
    "Slack"
  ],

  "summary": "The AD-AS model provides a framework for analyzing macroeconomic policy goals. It consists of aggregate demand (AD), short-run aggregate supply (SRAS), and long-run aggregate supply (LRAS) at potential GDP. The economy's position relative to potential determines the appropriate policy response. In a recessionary gap (output below potential, unemployment above natural rate), expansionary policy is needed to increase aggregate demand, shifting AD right, increasing output and employment toward potential. In an inflationary gap (output above potential, unemployment below natural rate, rising inflation), contractionary policy is needed to decrease aggregate demand, shifting AD left, reducing output and inflationary pressure. In long-run equilibrium (output at potential), neutral policy is appropriate. The model distinguishes short-run and long-run effects. In the short run, policy can affect real GDP. In the long run, after wages and prices adjust, the economy returns to potential GDP, and policy affects only the price level—this is the concept of monetary neutrality. The economy has a self-correcting mechanism: in a recessionary gap, falling wages shift SRAS right, returning the economy to potential at a lower price level; in an inflationary gap, rising wages shift SRAS left, returning to potential at a higher price level. However, self-correction can be slow and costly, justifying active stabilization policy. Supply-side policies aim to shift LRAS and SRAS right by increasing potential output through investments in human capital, physical capital, technology, and improved incentives. These policies increase output and reduce inflationary pressure over the long run. The AD-AS framework also shows the effects of shocks: negative supply shocks shift SRAS left, causing stagflation (higher prices, lower output); positive supply shocks shift SRAS right, lowering prices and increasing output. Understanding policy goals in the AD-AS model is essential for analyzing economic conditions, predicting policy effects, and evaluating real-world policy debates."
}
