{
  "expanded_description": "The economy doesn't grow at a steady, constant rate. Instead, it experiences periods of rapid growth followed by periods of slowdown or decline. These fluctuations—expansions and contractions—are known as the business cycle. Understanding the business cycle is essential for understanding why policymakers intervene in the economy. When the economy is in a recession, policymakers use monetary and fiscal policy to stimulate growth and create jobs. When it's overheating and causing inflation, they take action to cool it down. The business cycle is the backdrop for all macroeconomic policy. In this section, we'll explore the four phases of the business cycle: expansion, peak, contraction, and trough. We'll examine what happens in each phase, how they're measured, and why economies experience cycles rather than steady growth.",
  
  "core_concept": {
    "principle": "The business cycle refers to the fluctuations in economic activity that an economy experiences over a period of time. It is characterized by alternating periods of expansion (growth) and contraction (decline). The business cycle has four distinct phases: (1) Expansion: A period of increasing economic activity—real GDP rises, employment grows, incomes increase, and business confidence improves. Expansions can last for years and vary in strength. (2) Peak: The upper turning point of the business cycle, when expansion transitions to contraction. At the peak, economic activity is at its highest point before a downturn begins. (3) Contraction (or recession): A period of declining economic activity—real GDP falls, unemployment rises, incomes decline, and business confidence deteriorates. A severe and prolonged contraction is called a depression. (4) Trough: The lower turning point of the business cycle, when contraction transitions to expansion. At the trough, economic activity hits its lowest point before recovery begins. The business cycle is measured from peak to peak or trough to trough. Important concepts include: potential GDP (the economy's maximum sustainable output), the output gap (the difference between actual and potential GDP), and the natural rate of unemployment (the unemployment rate when the economy is at potential GDP). During expansions, actual GDP rises above potential, creating a positive output gap and putting upward pressure on inflation. During contractions, actual GDP falls below potential, creating a negative output gap and putting downward pressure on inflation. The business cycle is driven by changes in aggregate demand (consumer spending, investment, government spending, net exports) and aggregate supply (productivity, resource availability, technology). Shocks—unexpected events like oil price spikes, financial crises, or pandemics—can trigger cyclical fluctuations. Policymakers attempt to smooth the business cycle: using expansionary policy during contractions to boost demand and reduce unemployment, and contractionary policy during overheated expansions to curb inflation.",
    
    "explanation": "Imagine driving a car on a long road trip. You don't maintain exactly 60 mph the whole time—sometimes you speed up, sometimes you slow down, depending on traffic, weather, and road conditions. The economy is the same. Sometimes it speeds up (expansion), sometimes it slows down (contraction). The highest speed before you slow down is the peak. The slowest speed before you speed up again is the trough. Your target speed—the speed limit—is potential GDP. When you're above the speed limit, you risk getting a ticket (inflation). When you're below, you're not making as much progress as you could (unemployment). Policymakers are like the driver, trying to keep the economy as close to the speed limit as possible—speeding up when it's too slow, braking when it's too fast. But they can't always react instantly, and sometimes shocks (like a sudden storm) force you to slow down unexpectedly.",
    
    "image": {
      "src": "images/unit4/business_cycle_overview.png",
      "alt": "Graph showing the business cycle with four phases: expansion, peak, contraction, trough, with potential GDP line",
      "caption": "Figure 4.1.1: The business cycle consists of four phases: expansion, peak, contraction, and trough. Actual GDP fluctuates around potential GDP."
    }
  },

  "sections": [
    {
      "section_title": "4.1 The Business Cycle",
      "introduction": "Why do economies experience booms and busts? Why do periods of rapid growth and job creation inevitably give way to slowdowns and layoffs? These fluctuations—the business cycle—are a fundamental feature of market economies. Understanding them is essential for understanding why governments and central banks intervene in the economy. In this section, we'll explore the four phases of the business cycle, how they're measured, what causes them, and why they matter for economic policy. We'll also examine key concepts like potential GDP, the output gap, and the relationship between the business cycle and unemployment.",
      
      "introduction_image": {
        "src": "images/unit4/business_cycle_intro.png",
        "alt": "Line graph showing U.S. GDP over time with recessions shaded",
        "caption": "Figure 4.1.2: Real GDP fluctuates over time. Shaded areas indicate recessions (contractions)."
      },
      
      "key_concept": {
        "definition": "The business cycle is the periodic but irregular up-and-down movement in economic activity, measured by fluctuations in real GDP and other macroeconomic variables. It has four phases: (1) Expansion: A period when real GDP is increasing, unemployment is falling, and the economy is growing. Most of the time, the economy is in expansion. Expansions can last for years—the U.S. expansion from 2009 to 2020 was the longest on record. (2) Peak: The point at which expansion turns to contraction. At the peak, economic activity is at a temporary maximum. (3) Contraction (recession): A period when real GDP is decreasing, unemployment is rising, and economic activity is declining. A common rule of thumb is two consecutive quarters of negative GDP growth, though official dating by the National Bureau of Economic Research (NBER) considers multiple indicators. A severe, prolonged contraction is a depression. (4) Trough: The point at which contraction turns to expansion. At the trough, economic activity is at a temporary minimum. The business cycle is measured from peak to peak or trough to trough. Two key concepts help analyze the cycle. Potential GDP (or full-employment output) is the level of real GDP the economy would produce if all resources (labor, capital, land, entrepreneurship) were fully employed at normal levels. It grows over time as the economy's productive capacity expands. The output gap is the difference between actual GDP and potential GDP: Output gap = Actual GDP - Potential GDP. When actual exceeds potential (positive output gap), the economy is overheating—inflationary pressure builds. When actual is below potential (negative output gap), the economy is in a slump—unemployment is above the natural rate, and disinflation or deflation may occur. The business cycle is closely related to unemployment. During expansions, unemployment falls. During contractions, unemployment rises. The natural rate of unemployment is the rate when the economy is at potential GDP—it includes frictional and structural unemployment but not cyclical unemployment. The cyclical unemployment rate equals the difference between the actual unemployment rate and the natural rate.",
        
        "context": "Business cycles have been observed for centuries. Early economists like Jean-Baptiste Say and David Ricardo debated whether economies naturally tend toward full employment. The Great Depression of the 1930s, with unemployment above 25%, shattered the view that cycles were mild and self-correcting. John Maynard Keynes argued that economies could get stuck in depression and needed government intervention. Since then, understanding and managing the business cycle has been a central focus of macroeconomics. In the post-World War II era, expansions have generally become longer and recessions milder, though the 2008 financial crisis and 2020 pandemic recession were severe. In AP Macroeconomics, understanding the business cycle is essential for analyzing monetary and fiscal policy, inflation, and unemployment.",
        
        "image": {
          "src": "images/unit4/potential_gdp.png",
          "alt": "Graph showing actual GDP fluctuating around an upward-sloping potential GDP line",
          "caption": "Figure 4.1.3: Actual GDP fluctuates around potential GDP. The difference is the output gap."
        }
      },

      "classifications": [
        {
          "type": "Expansion",
          "value": "Period of increasing economic activity",
          "characteristics": ["Rising real GDP", "Falling unemployment", "Increasing incomes", "Rising business profits", "Increasing consumer spending", "Often rising inflation late in expansion"],
          "behavior": "During an expansion, the economy grows. Businesses see rising demand, so they increase production, hire more workers, and invest in new capacity. Households see incomes rise, so they spend more. Confidence improves, encouraging further spending and investment. As the expansion continues, resources become increasingly scarce—labor markets tighten, wages rise, and businesses may raise prices. Inflation often accelerates late in the expansion. Expansions don't end because of old age—they end because of shocks (oil price spikes, financial crises, pandemics) or because policymakers deliberately slow the economy to fight inflation. The period from the trough to the peak is the expansion phase.",
          
          "image": {
            "src": "images/unit4/expansion.png",
            "alt": "Upward-sloping portion of business cycle graph",
            "caption": "Figure 4.1.4: During an expansion, real GDP rises, unemployment falls, and the economy grows."
          },
          
          "examples": [
            {
              "process": "U.S. expansion 2009-2020",
              "explanation": "Following the Great Recession, the U.S. economy expanded for 128 months (June 2009 to February 2020)—the longest on record. Unemployment fell from 10% to 3.5%, and the economy added over 20 million jobs."
            },
            {
              "process": "Late expansion inflation",
              "explanation": "In the late 1990s expansion, the Fed raised interest rates to prevent overheating. In 2021-22, rapid expansion from pandemic recovery led to high inflation."
            }
          ]
        },
        {
          "type": "Peak",
          "value": "Upper turning point of the business cycle",
          "characteristics": ["Maximum economic activity", "Transition point", "High employment", "Often high inflation", "Unsustainable level"],
          "behavior": "The peak is the high point of the business cycle. At the peak, real GDP is at its maximum before a downturn begins. The economy is often operating above potential GDP (positive output gap), with very low unemployment and high capacity utilization. Inflation is typically rising or already high. The peak is not a duration—it's a turning point. It marks the end of expansion and the beginning of contraction. After the peak, economic activity begins to decline. Peaks are often associated with the emergence of imbalances—excessive debt, speculative bubbles, or supply shocks—that trigger the downturn.",
          
          "image": {
            "src": "images/unit4/peak.png",
            "alt": "Top of business cycle graph, where expansion turns to contraction",
            "caption": "Figure 4.1.5: The peak is the upper turning point—maximum economic activity before contraction begins."
          },
          
          "examples": [
            {
              "process": "December 2007 peak",
              "explanation": "The NBER dates the peak before the Great Recession as December 2007. At that point, the economy was at its highest level before the financial crisis triggered a severe contraction."
            },
            {
              "process": "February 2020 peak",
              "explanation": "The peak before the pandemic recession was February 2020. The economy was at an all-time high, with unemployment at 3.5%, before the pandemic shutdowns caused a sharp contraction."
            }
          ]
        },
        {
          "type": "Contraction (Recession)",
          "value": "Period of decreasing economic activity",
          "characteristics": ["Falling real GDP", "Rising unemployment", "Declining incomes", "Falling business profits", "Reduced consumer spending", "Often falling inflation or deflation"],
          "behavior": "During a contraction (recession), the economy shrinks. Businesses see falling demand, so they cut production, lay off workers, and reduce investment. Households see incomes fall or become uncertain, so they cut spending. Confidence deteriorates, further reducing spending and investment. Unemployment rises, often sharply. Inflation typically slows—if the contraction is severe, deflation (falling prices) can occur. Contractions can be mild (like 1990-91 or 2001) or severe (like 2007-09 or 2020). The period from peak to trough is the contraction phase. Official recession dating in the U.S. is done by the National Bureau of Economic Research (NBER), which considers depth, duration, and diffusion of economic decline across sectors.",
          
          "image": {
            "src": "images/unit4/contraction.png",
            "alt": "Downward-sloping portion of business cycle graph",
            "caption": "Figure 4.1.6: During a contraction (recession), real GDP falls, unemployment rises, and the economy shrinks."
          },
          
          "examples": [
            {
              "process": "Great Recession 2007-2009",
              "explanation": "The most severe recession since the Great Depression. Real GDP fell by 4.3%, unemployment peaked at 10%, and over 8 million jobs were lost. Caused by the housing bubble and financial crisis."
            },
            {
              "process": "Pandemic recession 2020",
              "explanation": "The shortest but deepest recession on record. Real GDP fell at a 31% annual rate in Q2 2020, unemployment hit 14.8%, but recovery began quickly as restrictions eased and policy responded."
            }
          ]
        },
        {
          "type": "Trough",
          "value": "Lower turning point of the business cycle",
          "characteristics": ["Minimum economic activity", "Transition point", "High unemployment", "Low inflation or deflation", "Beginning of recovery"],
          "behavior": "The trough is the low point of the business cycle. At the trough, real GDP is at its minimum before recovery begins. The economy is typically operating well below potential GDP (large negative output gap), with very high unemployment and substantial idle capacity. Inflation is usually low or negative. The trough is not a duration—it's a turning point. It marks the end of contraction and the beginning of expansion. After the trough, economic activity begins to increase as recovery takes hold. Troughs often follow policy interventions—monetary and fiscal stimulus—that help turn the economy around.",
          
          "image": {
            "src": "images/unit4/trough.png",
            "alt": "Bottom of business cycle graph, where contraction turns to expansion",
            "caption": "Figure 4.1.7: The trough is the lower turning point—minimum economic activity before expansion begins."
          },
          
          "examples": [
            {
              "process": "June 2009 trough",
              "explanation": "The NBER dates the trough after the Great Recession as June 2009. The economy began expanding after that point, though unemployment continued rising for months (a lagging indicator)."
            },
            {
              "process": "April 2020 trough",
              "explanation": "The trough of the pandemic recession was April 2020. The economy hit bottom and began expanding in May as businesses reopened and policy support took effect."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Economy Fluctuates Around Potential GDP",
          "statement": "Potential GDP represents the economy's maximum sustainable output—the level produced when resources are fully employed at normal rates. Actual GDP fluctuates around this potential due to changes in aggregate demand and supply. When actual GDP is above potential (positive output gap), the economy is overheating: unemployment is below the natural rate, and inflation tends to rise. When actual GDP is below potential (negative output gap), the economy is in a slump: unemployment is above the natural rate, and inflation tends to fall. These fluctuations are the business cycle. Policymakers aim to minimize the output gap—keeping the economy as close to potential as possible.",
          "application": "When analyzing the economy's position, compare actual GDP to potential GDP. A positive output gap suggests inflationary pressure and possible policy tightening. A negative output gap suggests slack and possible policy stimulus. The size of the output gap indicates how much adjustment may be needed.",
          "example": "In 2019, the U.S. output gap was estimated to be slightly positive—unemployment was 3.5% (below estimates of the natural rate), and inflation was modest but rising. The Fed had been gradually raising interest rates to prevent overheating. In 2020, the pandemic created a huge negative output gap—unemployment soared to 14.8%, and the Fed cut rates to zero and provided massive stimulus.",
          
          "image": {
            "src": "images/unit4/output_gap.png",
            "alt": "Graph showing actual GDP above potential (positive gap) and below potential (negative gap)",
            "caption": "Figure 4.1.8: The output gap is the difference between actual and potential GDP. Positive gaps create inflation; negative gaps create unemployment."
          }
        },
        {
          "principle": "Recessions Are Costly",
          "statement": "Recessions impose substantial costs on society. Workers lose jobs—sometimes for extended periods—causing financial hardship, stress, and long-term damage to careers and earnings. Businesses fail, destroying capital and organizational knowledge. Investment falls, reducing future productive capacity. Government revenues decline while spending on unemployment and social programs rises, increasing budget deficits. The human cost—anxiety, family stress, lost opportunities—is immeasurable but real. These costs are why policymakers try to prevent recessions or shorten them when they occur. The deeper and longer the recession, the greater the costs.",
          "application": "When evaluating policy responses to recessions, consider the costs of inaction. Allowing a recession to run its course without intervention might seem fiscally prudent, but the human and economic costs are enormous. This justifies aggressive policy responses—monetary stimulus, fiscal stimulus—to shorten recessions and speed recovery.",
          "example": "During the Great Recession, U.S. output fell by over $\\$2$ trillion (cumulative) relative to pre-recession trends. Unemployment peaked at 10%, with over 8 million jobs lost. Millions lost homes to foreclosure. The Congressional Budget Office estimated that the recession reduced potential output permanently by several percentage points. These costs justified the policy responses—the Fed's zero interest rates and quantitative easing, and the fiscal stimulus under the American Recovery and Reinvestment Act.",
          
          "image": {
            "src": "images/unit4/recession_costs.png",
            "alt": "Chart showing rising unemployment and falling GDP during recession",
            "caption": "Figure 4.1.9: Recessions impose heavy costs: lost output, unemployment, business failures, and human hardship."
          }
        },
        {
          "principle": "Booms Can Also Be Costly",
          "statement": "While expansions are generally good, excessive booms—when the economy overheats—also impose costs. When actual GDP exceeds potential for too long, inflation accelerates. High inflation distorts price signals, creates uncertainty, and redistributes wealth arbitrarily. It can lead to speculative bubbles in assets (housing, stocks) that eventually burst, triggering financial instability and recession. The central bank must then raise interest rates to fight inflation, potentially causing a downturn. This is why policymakers try to prevent overheating, not just recessions. The goal is sustainable growth, not boom-and-bust.",
          "application": "When evaluating policy, recognize that fighting inflation is not about punishing the economy—it's about preventing the costs of high inflation and the even harsher correction that might follow. Preemptive tightening to cool an overheating economy can extend the expansion by preventing the buildup of imbalances.",
          "example": "In the late 1990s, the Fed raised interest rates to prevent overheating, and the expansion continued until 2001. In the mid-2000s, the Fed kept rates low for too long, contributing to a housing bubble. When the bubble burst, the result was the Great Recession. This illustrates the costs of allowing booms to go too far.",
          
          "image": {
            "src": "images/unit4/boom_costs.png",
            "alt": "Graph showing inflation rising during boom, then bubble bursting leading to recession",
            "caption": "Figure 4.1.10: Excessive booms cause inflation and can create speculative bubbles that lead to financial crises."
          }
        },
        {
          "principle": "The Business Cycle Is Driven by Shocks and Policy Responses",
          "statement": "Business cycles are caused by shocks—unexpected events that shift aggregate demand or aggregate supply—and by the economy's adjustment to those shocks, including policy responses. Demand shocks: Changes in consumer confidence, investment spending, government policy, or foreign demand. Supply shocks: Changes in oil prices, technology, productivity, or labor force. Policy shocks: Changes in monetary or fiscal policy. These shocks push the economy away from potential GDP. Then, adjustment mechanisms—like changes in wages and prices, or policy interventions—gradually return the economy toward potential. The cycle's length and severity depend on the shock's size and the speed of adjustment. This is why economies don't follow a smooth, predictable path.",
          "application": "When analyzing business cycle fluctuations, identify the underlying shocks. Was it a demand shock (like a drop in consumer confidence) or a supply shock (like an oil price spike)? How did policymakers respond? This helps explain why the economy behaved as it did and what might happen next.",
          "example": "The 2008 recession was caused by a massive negative demand shock (the financial crisis) combined with supply-side disruptions (credit freeze). The Fed responded with aggressive monetary stimulus; Congress passed fiscal stimulus. The recovery was slow because of the shock's severity and the need for household and bank deleveraging. The 2020 recession was caused by a supply shock (pandemic shutdowns) that also became a demand shock. Massive policy responses led to a rapid recovery.",
          
          "image": {
            "src": "images/unit4/cycle_causes.png",
            "alt": "Diagram showing shocks (demand, supply, policy) affecting the economy",
            "caption": "Figure 4.1.11: Business cycles are driven by shocks—demand, supply, and policy—and the economy's adjustment to them."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Business Cycle Phases",
          
          "image": {
            "src": "images/unit4/cycle_identification.png",
            "alt": "Graph of GDP over time with points labeled A through F",
            "caption": "Figure 4.1.12: Identify the phases of the business cycle at each point."
          },
          
          "problem": "The graph shows real GDP over time. Point A is a low point, followed by rising GDP to point B, then falling GDP to point C, then rising again to point D, then falling to point E, then rising to point F. a) Identify the phase (expansion, peak, contraction, trough) at each point. b) Between which points is the economy in expansion? c) Between which points is it in contraction? d) If potential GDP is growing steadily, at which points is the output gap most likely positive? Negative?",
          
          "step_by_step": [
            {
              "step": "Identify point A",
              "explanation": "Point A is a low point before a rise. This is a trough."
            },
            {
              "step": "Identify point B",
              "explanation": "Point B is a high point before a fall. This is a peak."
            },
            {
              "step": "Identify point C",
              "explanation": "Point C is a low point before a rise. This is a trough."
            },
            {
              "step": "Identify point D",
              "explanation": "Point D is a high point before a fall. This is a peak."
            },
            {
              "step": "Identify point E",
              "explanation": "Point E is a low point before a rise. This is a trough."
            },
            {
              "step": "Identify point F",
              "explanation": "Point F is not followed by a fall in the graph, but it's after a rise—it could be a peak or still in expansion depending on what comes next. Based on available information, it's at the end of an expansion, possibly a peak."
            },
            {
              "step": "Identify expansion periods",
              "explanation": "Expansions are periods of rising GDP: from A to B, from C to D, and from E to F."
            },
            {
              "step": "Identify contraction periods",
              "explanation": "Contractions are periods of falling GDP: from B to C and from D to E."
            },
            {
              "step": "Analyze output gaps",
              "explanation": "Positive output gaps occur when actual GDP is above potential—likely near peaks (B, D, possibly F). Negative output gaps occur when actual is below potential—likely near troughs (A, C, E)."
            }
          ],
          
          "final_answer": "a) A: trough, B: peak, C: trough, D: peak, E: trough, F: possible peak. b) A-B, C-D, E-F. c) B-C, D-E. d) Positive near peaks; negative near troughs.",
          "concept_applied": "The business cycle has alternating peaks and troughs. Expansions are rises; contractions are falls. Output gaps vary with the cycle."
        },
        {
          "title": "Calculating Output Gaps",
          
          "image": {
            "src": "images/unit4/output_gap_calc.png",
            "alt": "Table with GDP and potential GDP data",
            "caption": "Figure 4.1.13: Calculate the output gap and interpret the economy's position."
          },
          
          "problem": "In year 1, actual GDP is $\\$20$ trillion, potential GDP is $\\$19.5$ trillion. In year 2, actual GDP is $\\$19$ trillion, potential GDP has grown to $\\$20$ trillion. a) Calculate the output gap for each year (in dollars and as a percentage of potential GDP). b) In which year is the economy overheating? In which year is it in a slump? c) What would you expect to happen to inflation in each year? d) What would you expect to happen to unemployment relative to the natural rate?",
          
          "step_by_step": [
            {
              "step": "Calculate year 1 output gap",
              "explanation": "Output gap = Actual - Potential = $\\$20$T - $\\$19.5$T = $\\$0.5$ trillion. As percentage of potential: ($0.5 / 19.5) × 100% = 2.56%."
            },
            {
              "step": "Calculate year 2 output gap",
              "explanation": "Output gap = $\\$19$T - $\\$20$T = -$\\$1$ trillion. As percentage: (-1 / 20) × 100% = -5%."
            },
            {
              "step": "Interpret year 1",
              "explanation": "Year 1 has a positive output gap (2.56%). The economy is operating above potential—overheating. Inflationary pressure is building."
            },
            {
              "step": "Interpret year 2",
              "explanation": "Year 2 has a negative output gap (-5%). The economy is operating below potential—in a slump. Disinflation or deflationary pressure exists."
            },
            {
              "step": "Predict inflation",
              "explanation": "In year 1, inflation should rise. In year 2, inflation should fall (or become negative if the gap is large enough)."
            },
            {
              "step": "Predict unemployment",
              "explanation": "In year 1, unemployment should be below the natural rate. In year 2, unemployment should be above the natural rate."
            }
          ],
          
          "final_answer": "a) Year 1: +$\\$0.5$T (+2.56%). Year 2: -$\\$1$T (-5%). b) Year 1 overheating, year 2 slump. c) Year 1 rising inflation, year 2 falling inflation. d) Year 1 unemployment below natural rate, year 2 above.",
          "concept_applied": "The output gap measures the economy's position relative to potential. Positive gaps cause inflation and low unemployment; negative gaps cause disinflation and high unemployment."
        },
        {
          "title": "Business Cycle and Unemployment",
          
          "image": {
            "src": "images/unit4/cycle_unemployment.png",
            "alt": "Graph showing unemployment rate and GDP growth over time",
            "caption": "Figure 4.1.14: Trace the relationship between the business cycle and unemployment."
          },
          
          "problem": "The natural rate of unemployment is estimated to be 5%. In year 1, actual unemployment is 4%. In year 2, it's 6%. In year 3, it's 9%. a) What phase of the business cycle is the economy likely in during each year? b) What is the cyclical unemployment rate each year? c) If actual GDP equals potential GDP in year 0, what happened to output in years 1-3? d) How would you expect inflation to change over these years?",
          
          "step_by_step": [
            {
              "step": "Analyze year 1",
              "explanation": "Unemployment (4%) is below the natural rate (5%). This suggests the economy is overheating—likely in late expansion, possibly near a peak. Cyclical unemployment = Actual - Natural = 4% - 5% = -1% (negative cyclical unemployment means employment above normal)."
            },
            {
              "step": "Analyze year 2",
              "explanation": "Unemployment (6%) is above the natural rate (5%). The economy is in a slump—likely in contraction or early recovery. Cyclical unemployment = 6% - 5% = +1%."
            },
            {
              "step": "Analyze year 3",
              "explanation": "Unemployment (9%) is well above the natural rate. The economy is in a deep recession—likely trough or early expansion if recovery has begun. Cyclical unemployment = 9% - 5% = +4%."
            },
            {
              "step": "Infer output path",
              "explanation": "In year 0, output was at potential. By year 1, output likely rose above potential (positive output gap). By year 2, output likely fell below potential (negative output gap). By year 3, output likely fell further below potential (larger negative gap)."
            },
            {
              "step": "Predict inflation",
              "explanation": "In year 1, with output above potential, inflation likely rose. In year 2, with output below potential, inflation likely began to fall. In year 3, with large negative gap, inflation likely fell further—possibly toward zero or negative."
            }
          ],
          
          "final_answer": "a) Year 1: late expansion/peak. Year 2: contraction. Year 3: deep recession/trough. b) Year 1: -1%. Year 2: +1%. Year 3: +4%. c) Year 1 above potential, Year 2 below, Year 3 further below. d) Year 1 rising, Year 2 falling, Year 3 falling more.",
          "concept_applied": "Unemployment relative to the natural rate indicates the business cycle phase. Cyclical unemployment is positive in recessions, negative in booms. Output gaps and inflation move accordingly."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Expansion: Economy Grows",
          "description": "The economy enters an expansion phase. Real GDP rises, unemployment falls, incomes and profits increase.",
          "mechanism": "Rising demand leads businesses to increase production and hire. Confidence grows, fueling further spending and investment. The expansion feeds on itself.",
          "result": "Growing economy, falling unemployment.",
          
          "image": {
            "src": "images/unit4/cycle_step1.png",
            "alt": "Up arrow on GDP graph, factories running, people working",
            "caption": "Figure 4.1.15: Step 1 - Expansion: The economy grows, unemployment falls."
          }
        },
        {
          "step": 2,
          "process": "Peak: Economy at Maximum",
          "description": "The expansion reaches its peak. Economic activity is at its highest point before a downturn.",
          "mechanism": "At the peak, resources are fully employed—unemployment is low, capacity utilization is high. Inflation is often rising. Imbalances (debt, speculation) may be building.",
          "result": "Maximum output, low unemployment, rising inflation.",
          
          "image": {
            "src": "images/unit4/cycle_step2.png",
            "alt": "Top of cycle graph, warning signs appearing",
            "caption": "Figure 4.1.16: Step 2 - Peak: Economy at maximum, imbalances may be building."
          }
        },
        {
          "step": 3,
          "process": "Contraction: Economy Shrinks",
          "description": "A shock or imbalance triggers a downturn. Real GDP falls, unemployment rises, incomes and profits decline.",
          "mechanism": "Falling demand leads businesses to cut production and lay off workers. Confidence deteriorates, reducing spending further. The contraction feeds on itself.",
          "result": "Shrinking economy, rising unemployment.",
          
          "image": {
            "src": "images/unit4/cycle_step3.png",
            "alt": "Down arrow on GDP graph, factories idle, unemployment lines",
            "caption": "Figure 4.1.17: Step 3 - Contraction: Economy shrinks, unemployment rises."
          }
        },
        {
          "step": 4,
          "process": "Trough: Economy at Minimum",
          "description": "The contraction reaches its trough. Economic activity is at its lowest point before recovery.",
          "mechanism": "At the trough, unemployment is high, capacity is idle, inflation is low. Eventually, stabilizing forces (lower interest rates, policy stimulus, pent-up demand) begin to turn the economy around.",
          "result": "Minimum output, high unemployment, low inflation.",
          
          "image": {
            "src": "images/unit4/cycle_step4.png",
            "alt": "Bottom of cycle graph, stimulus arriving",
            "caption": "Figure 4.1.18: Step 4 - Trough: Economy at minimum, policy stimulus helps turn the corner."
          }
        },
        {
          "step": 5,
          "process": "Recovery and Next Expansion Begin",
          "description": "From the trough, the economy begins to recover. Growth resumes, and a new expansion begins.",
          "mechanism": "Policy stimulus, natural market adjustments, and renewed confidence lead to increasing demand. Businesses begin hiring and investing again. The cycle repeats.",
          "result": "Recovery begins, new expansion starts.",
          
          "image": {
            "src": "images/unit4/cycle_step5.png",
            "alt": "GDP beginning to rise from trough, new expansion starting",
            "caption": "Figure 4.1.19: Step 5 - Recovery: From the trough, a new expansion begins."
          }
        }
      ],

      "image": {
        "src": "images/unit4/business_cycle_summary.png",
        "alt": "Comprehensive summary diagram of business cycle: phases, indicators, output gap, policy responses",
        "caption": "Figure 4.1.20: Business cycle summary - phases, key indicators, output gaps, and policy implications."
      }
    }
  ],

  "key_terms": [
    "Business cycle",
    "Expansion",
    "Peak",
    "Contraction",
    "Recession",
    "Depression",
    "Trough",
    "Recovery",
    "Potential GDP",
    "Full-employment output",
    "Output gap",
    "Positive output gap",
    "Negative output gap",
    "Inflationary gap",
    "Recessionary gap",
    "Natural rate of unemployment",
    "Cyclical unemployment",
    "Actual GDP",
    "Economic fluctuations",
    "Boom",
    "Bust",
    "Demand shock",
    "Supply shock",
    "Policy shock",
    "National Bureau of Economic Research (NBER)",
    "Business cycle dating committee",
    "Leading indicators",
    "Lagging indicators",
    "Coincident indicators",
    "Consumer confidence",
    "Business confidence",
    "Capacity utilization",
    "Inventory cycle",
    "Overheating",
    "Soft landing",
    "Hard landing",
    "Double-dip recession",
    "Stagflation"
  ],

  "summary": "The business cycle refers to the periodic fluctuations in economic activity—expansions and contractions—that all market economies experience. It has four phases. Expansion is a period of increasing real GDP, falling unemployment, and rising incomes and profits. Most of the time, the economy is in expansion. The peak is the upper turning point, when expansion transitions to contraction. At the peak, economic activity is at its maximum, unemployment is low, and inflation is often rising. Contraction (recession) is a period of decreasing real GDP, rising unemployment, and declining incomes and profits. A severe, prolonged contraction is a depression. The trough is the lower turning point, when contraction transitions to expansion. At the trough, economic activity is at its minimum, unemployment is high, and inflation is low. Two key concepts help analyze the cycle. Potential GDP is the economy's maximum sustainable output—the level produced when resources are fully employed at normal rates. It grows over time as the economy's productive capacity expands. The output gap is the difference between actual GDP and potential GDP: Output gap = Actual GDP - Potential GDP. When actual exceeds potential (positive output gap), the economy is overheating—inflationary pressure builds, and unemployment is below the natural rate. When actual is below potential (negative output gap), the economy is in a slump—unemployment is above the natural rate, and disinflation or deflation may occur. The business cycle is closely related to unemployment. During expansions, unemployment falls; during contractions, unemployment rises. The natural rate of unemployment (including frictional and structural) is the rate when the economy is at potential GDP. Cyclical unemployment is the difference between actual and natural unemployment. Business cycles are caused by shocks—unexpected events that shift aggregate demand or aggregate supply—and by the economy's adjustment to those shocks, including policy responses. Demand shocks include changes in consumer confidence, investment, government policy, or foreign demand. Supply shocks include changes in oil prices, technology, productivity, or labor force. Policy shocks include changes in monetary or fiscal policy. Recessions impose substantial costs: lost output, unemployment, business failures, and human hardship. Booms can also be costly if they lead to high inflation or speculative bubbles that eventually burst. Policymakers attempt to smooth the business cycle—using expansionary policy during contractions to boost demand and reduce unemployment, and contractionary policy during overheated expansions to curb inflation. The goal is sustainable growth, not boom-and-bust. Understanding the business cycle is essential for analyzing monetary and fiscal policy, inflation, unemployment, and the overall health of the economy."
}
