{
  "flashcards": [
    {
      "category": "Nuclear Chemistry & Comprehensive Review",
      "cards": [
        {
          "front": "What is **radioactivity**?",
          "back": "The spontaneous decay of an unstable atomic nucleus, accompanied by the emission of radiation."
        },
        {
          "front": "What are the characteristics of **Alpha (α) particles**?",
          "back": "Composed of 2 protons and 2 neutrons (a Helium nucleus: $^4_2He$); they have a $+2$ charge and low penetrating power."
        },
        {
          "front": "What are the characteristics of **Beta (β) particles**?",
          "back": "High-speed electrons ($^0_{-1}e$) emitted when a neutron turns into a proton; they have a $-1$ charge and moderate penetrating power."
        },
        {
          "front": "What are **Gamma (γ) rays**?",
          "back": "High-energy electromagnetic radiation with no mass or charge; they have the highest penetrating power."
        },
        {
          "front": "What is a **half-life ($t_{1/2}$)** in nuclear decay?",
          "back": "The time required for half of the radioactive nuclei in a sample to decay."
        },
        {
          "front": "What is **Nuclear Fission**?",
          "back": "The splitting of a heavy nucleus into two lighter nuclei, releasing a massive amount of energy (used in nuclear power plants)."
        },
        {
          "front": "What is **Nuclear Fusion**?",
          "back": "The combining of two light nuclei to form a heavier, more stable nucleus; it powers stars but requires extreme temperatures."
        },
        {
          "front": "What is the **Mass Defect**?",
          "back": "The difference between the mass of an atom and the sum of the masses of its individual nucleons; this mass is converted into binding energy ($E=mc^2$)."
        },
        {
          "front": "Define **Transmutation**.",
          "back": "The conversion of an atom of one element into an atom of another element through nuclear decay or bombardment."
        },
        {
          "front": "Review: What is the **Octet Rule**?",
          "back": "The tendency of atoms to prefer to have eight electrons in the valence shell to achieve stability."
        },
        {
          "front": "Review: What is **Le Chatelier's Principle**?",
          "back": "If a system at equilibrium is disturbed, the system will shift its equilibrium position to counteract the disturbance."
        },
        {
          "front": "Review: What is **Electronegativity**?",
          "back": "The measure of the ability of an atom in a chemical compound to attract electrons."
        },
        {
          "front": "Review: What is the **Ideal Gas Law** equation?",
          "back": "$PV = nRT$"
        },
        {
          "front": "Review: What is a **Lewis Base**?",
          "back": "A substance that can donate a pair of electrons to form a covalent bond."
        },
        {
          "front": "Review: What is **Molarity**?",
          "back": "Moles of solute per liter of solution ($M = n/V$)."
        }
      ]
    }
  ]
}
