{
  "flashcards": [
    {
      "category": "Organic Reaction Mechanisms",
      "cards": [
        {
          "front": "What is the **$S_N2$ mechanism**?",
          "back": "Substitution Nucleophilic Bimolecular: A concerted, one-step process where the nucleophile attacks from the backside, causing an inversion of configuration (Walden inversion)."
        },
        {
          "front": "What is the **$S_N1$ mechanism**?",
          "back": "Substitution Nucleophilic Unimolecular: A two-step process involving the formation of a carbocation intermediate; results in a racemic mixture of products."
        },
        {
          "front": "Define **Electrophilic Addition**.",
          "back": "A reaction common in alkenes and alkynes where a $\\pi$ bond is broken and two new $\\sigma$ bonds are formed as an electrophile attacks the electron-rich double bond."
        },
        {
          "front": "What is **Markovnikov's Rule**?",
          "back": "In the addition of $HX$ to an alkene, the hydrogen atom bonds to the carbon with the most hydrogen atoms already attached (\"The rich get richer\")."
        },
        {
          "front": "What is the **E2 mechanism**?",
          "back": "Elimination Bimolecular: A one-step process where a strong base removes a $\\beta$-proton and the leaving group departs simultaneously to form a double bond; requires anti-periplanar geometry."
        },
        {
          "front": "What is the **E1 mechanism**?",
          "back": "Elimination Unimolecular: A two-step process where the leaving group departs first to form a carbocation, followed by the loss of a proton to form an alkene."
        },
        {
          "front": "What is **Zaitsev's Rule**?",
          "back": "In an elimination reaction, the most substituted alkene (the one with the most alkyl groups attached to the double bond) is typically the major product."
        },
        {
          "front": "What is **Electrophilic Aromatic Substitution (EAS)**?",
          "back": "A reaction where an electrophile replaces a hydrogen atom on an aromatic ring (e.g., nitration, halogenation, or Friedel-Crafts alkylation)."
        },
        {
          "front": "What is a **nucleophile**?",
          "back": "An electron-rich species (Lewis base) that donates an electron pair to an electrophile to form a chemical bond."
        },
        {
          "front": "What is an **electrophile**?",
          "back": "An electron-deficient species (Lewis acid) that accepts an electron pair from a nucleophile."
        },
        {
          "front": "What is the role of a **carbocation intermediate**?",
          "back": "A positively charged carbon atom formed during $S_N1$ or E1 reactions; its stability follows the trend: $3^\\circ > 2^\\circ > 1^\\circ > \\text{methyl}$."
        },
        {
          "front": "What is **Nucleophilic Acyl Substitution**?",
          "back": "A mechanism characteristic of carboxylic acid derivatives where a nucleophile replaces a leaving group (like $Cl^-$ or $OR^-$) attached to a carbonyl carbon."
        },
        {
          "front": "What does a **curved arrow** represent in a mechanism?",
          "back": "The movement of a pair of electrons from an electron source (lone pair or bond) to an electron sink."
        },
        {
          "front": "What is a **radical mechanism**?",
          "back": "A reaction involving unpaired electrons (radicals), typically occurring in three steps: initiation, propagation, and termination."
        },
        {
          "front": "What is the **Hydration of Alkenes**?",
          "back": "An electrophilic addition reaction where water is added across a double bond in the presence of an acid catalyst to form an alcohol."
        }
      ]
    }
  ]
}
