{
  "expanded_description": "What happens when governments set maximum or minimum prices? Price controls—like rent control (price ceiling) and minimum wage (price floor)—are among the most common government interventions in markets. While they are often intended to help consumers or workers, they create predictable side effects: shortages, surpluses, and deadweight loss. Understanding how price controls work, their consequences, and why they create inefficiency is essential for evaluating real-world policies and for debates about housing affordability, labor markets, and consumer protection.",
  
  "core_concept": {
    "principle": "Price controls are government-mandated maximum or minimum prices. (1) Price ceiling: A legal maximum price. If set below the equilibrium price, it creates a persistent shortage (excess demand). Quantity traded falls to the quantity supplied. Consequences: non-price rationing (lines, waiting lists), black markets, reduced quality, discrimination. (2) Price floor: A legal minimum price. If set above the equilibrium price, it creates a persistent surplus (excess supply). Quantity traded falls to the quantity demanded. Consequences: unsold goods, government purchases (for agricultural price supports), unemployment (in labor markets), waste. (3) Both price ceilings and floors create deadweight loss by reducing quantity below the efficient level. (4) The size of the shortage or surplus depends on the elasticities of supply and demand. More elastic curves lead to larger shortages/surpluses for a given price control.",
    
    "explanation": "Think of rent control in a city. The government sets a maximum rent below what the market would charge. More people want apartments at that low price, but landlords aren't willing to supply as many. The result: a housing shortage, long waiting lists, and apartments that are poorly maintained. Or think of a minimum wage above the market wage. More people want to work at that wage, but employers hire fewer workers. The result: unemployment. Both are price controls with predictable consequences.",
    
    "image": {
      "src": "images/unit9/price_controls_overview.png",
      "alt": "Graphs showing price ceiling (shortage) and price floor (surplus)",
      "caption": "Figure 9.4.1: Price ceilings create shortages; price floors create surpluses."
    }
  },

  "sections": [
    {
      "section_title": "9.4 Price Controls",
      "introduction": "What happens when governments set maximum or minimum prices? Price controls—like rent control (price ceiling) and minimum wage (price floor)—are among the most common government interventions in markets. While they are often intended to help consumers or workers, they create predictable side effects: shortages, surpluses, and deadweight loss. Understanding how price controls work, their consequences, and why they create inefficiency is essential for evaluating real-world policies and for debates about housing affordability, labor markets, and consumer protection.",
      
      "introduction_image": {
        "src": "images/unit9/price_controls_intro.png",
        "alt": "Long line for apartments (shortage) and farmers with unsold crops (surplus)",
        "caption": "Figure 9.4.2: Price controls lead to shortages or surpluses."
      },
      
      "key_concept": {
        "definition": "Price controls are government policies that set maximum or minimum prices. (1) Price ceiling: A legal maximum price. To be binding (affect the market), it must be set below the equilibrium price. At the ceiling price, quantity demanded exceeds quantity supplied, creating a shortage. The actual quantity traded is the quantity supplied (since sellers won't provide more). The shortage = $Q_d - Q_s$. Consequences: non-price rationing (first-come first-served, discrimination, lotteries), black markets, reduced quality, wasted time waiting, and deadweight loss. (2) Price floor: A legal minimum price. To be binding, it must be set above the equilibrium price. At the floor price, quantity supplied exceeds quantity demanded, creating a surplus. The actual quantity traded is the quantity demanded. The surplus = $Q_s - Q_d$. Consequences: unsold goods, government purchases (for agricultural price supports), unemployment (in labor markets), waste, and deadweight loss. (3) Both price ceilings and floors create deadweight loss by reducing quantity below the efficient (equilibrium) level. The deadweight loss is the triangle between supply and demand from the actual quantity to the equilibrium quantity. (4) The size of the shortage or surplus depends on the elasticities of supply and demand. More elastic curves lead to larger gaps for a given price control.",
        
        "context": "Price controls have been used throughout history, from ancient Roman grain price controls to modern rent control and minimum wage laws. Economists generally oppose price controls because of their inefficiency and unintended consequences, but they remain politically popular. Understanding price controls is essential for evaluating policy debates about housing affordability, agricultural policy, and labor markets. In AP Microeconomics, you'll need to analyze price controls graphically, calculate shortages/surpluses and deadweight loss, and explain their consequences.",
        
        "image": {
          "src": "images/unit9/price_controls_graph.png",
          "alt": "Price ceiling graph with shortage and deadweight loss; price floor graph with surplus and deadweight loss",
          "caption": "Figure 9.4.3: Price ceilings and floors create deadweight loss."
        }
      },

      "classifications": [
        {
          "type": "Price Ceiling",
          "value": "Legal maximum price",
          "characteristics": ["Set below equilibrium to be binding", "Creates shortage ($Q_d > Q_s$)", "Quantity traded = $Q_s$", "Non-price rationing needed", "Deadweight loss"],
          "behavior": "A price ceiling is a maximum price allowed by law. When set below the equilibrium price, it prevents the market from reaching equilibrium. At the ceiling price, consumers want to buy more than producers are willing to supply, creating a shortage. Since prices cannot rise to eliminate the shortage, other mechanisms must allocate the scarce goods: first-come first-served (lines), seller discrimination (landlords choosing tenants), lotteries, or coupons. Black markets often emerge where the good is sold illegally at higher prices. Quality also tends to deteriorate because sellers have no incentive to maintain quality when they can't raise prices. The quantity traded falls from $Q^*$ to $Q_s$, creating deadweight loss equal to the triangle between supply and demand from $Q_s$ to $Q^*$. Famous examples: rent control in New York City and other cities, price controls on gasoline in the 1970s.",
          
          "image": {
            "src": "images/unit9/price_ceiling.png",
            "alt": "Price ceiling graph with shortage and DWL",
            "caption": "Figure 9.4.4: A binding price ceiling creates a shortage and deadweight loss."
          },
          
          "examples": [
            {
              "process": "Rent control",
              "explanation": "In cities with rent control, below-equilibrium rents create housing shortages, long waiting lists, and deterioration of controlled units."
            },
            {
              "process": "1970s gasoline price controls",
              "explanation": "Price controls on gasoline led to long lines at gas stations and rationing by waiting time."
            }
          ]
        },
        {
          "type": "Price Floor",
          "value": "Legal minimum price",
          "characteristics": ["Set above equilibrium to be binding", "Creates surplus ($Q_s > Q_d$)", "Quantity traded = $Q_d$", "Unsold goods or unemployment", "Deadweight loss"],
          "behavior": "A price floor is a minimum price allowed by law. When set above the equilibrium price, it prevents the market from reaching equilibrium. At the floor price, producers want to supply more than consumers are willing to buy, creating a surplus. Since prices cannot fall to eliminate the surplus, the excess supply must go somewhere. For goods, this often means unsold inventory, government purchases (agricultural price supports), or waste. For labor (minimum wage), the surplus takes the form of unemployment—workers who want jobs at the minimum wage cannot find them. The quantity traded falls from $Q^*$ to $Q_d$, creating deadweight loss equal to the triangle between supply and demand from $Q_d$ to $Q^*$. Famous examples: agricultural price supports (the government buys surplus crops), minimum wage laws, and airline price regulation (before deregulation).",
          
          "image": {
            "src": "images/unit9/price_floor.png",
            "alt": "Price floor graph with surplus and DWL",
            "caption": "Figure 9.4.5: A binding price floor creates a surplus and deadweight loss."
          },
          
          "examples": [
            {
              "process": "Minimum wage",
              "explanation": "A minimum wage above the market-clearing wage creates unemployment—more workers seek jobs than employers want to hire."
            },
            {
              "process": "Agricultural price supports",
              "explanation": "The government sets minimum prices for crops, then buys the resulting surpluses to maintain the price, costing taxpayers."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Binding Price Controls Create Shortages or Surpluses",
          "statement": "When a price control is binding—a ceiling below equilibrium or a floor above equilibrium—it prevents the market from clearing. The result is either a shortage (excess demand) or a surplus (excess supply). The size of the gap depends on the elasticities of supply and demand: more elastic curves lead to larger gaps for a given price control. These gaps are not just theoretical—they manifest as real-world phenomena: long lines, waiting lists, black markets, unsold goods, and unemployment. Understanding this helps explain why price controls often have consequences opposite to their intentions. Rent control aims to make housing affordable but creates housing shortages. Minimum wage aims to help low-income workers but can create unemployment among the least skilled.",
          "application": "To predict the effects of a price control, compare the controlled price to equilibrium. If ceiling below equilibrium, expect shortage and non-price rationing. If floor above equilibrium, expect surplus and unsold goods or unemployment.",
          "example": "A city imposes rent control at $\\$800$ when equilibrium rent is $\\$1000$. At $\\$800$, quantity demanded exceeds quantity supplied, creating a housing shortage. Landlords may discriminate among applicants, and waiting lists grow.",
          
          "image": {
            "src": "images/unit9/shortage_surplus.png",
            "alt": "Shortage and surplus illustrated",
            "caption": "Figure 9.4.6: Binding price controls create shortages or surpluses."
          }
        },
        {
          "principle": "Price Controls Create Deadweight Loss",
          "statement": "Both price ceilings and price floors create deadweight loss—a reduction in total surplus below the efficient level. This loss occurs because some mutually beneficial transactions do not occur. Under a price ceiling, some consumers who value the good more than its cost cannot buy it because quantity supplied is too low. Under a price floor, some producers who could produce at a cost below consumers' value cannot sell because quantity demanded is too low. The deadweight loss measures the value of these lost transactions. It is a pure efficiency loss—a reduction in the total pie available to society. This is the main economic argument against price controls: they make society worse off overall, even if they help some individuals at the expense of others.",
          "application": "To find deadweight loss from a price control, identify the quantity traded (the smaller of $Q_d$ and $Q_s$ at the controlled price) and calculate the area between supply and demand from that quantity to the equilibrium quantity.",
          "example": "In the rent control example, if equilibrium is 10,000 units at $\\$1000$ and controlled quantity is 8,000 units, the deadweight loss is the triangle between supply and demand from 8,000 to 10,000.",
          
          "image": {
            "src": "images/unit9/dwl_price_controls.png",
            "alt": "Deadweight loss triangles for price ceiling and floor",
            "caption": "Figure 9.4.7: Price controls create deadweight loss by reducing quantity."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing a Price Ceiling",
          
          "image": {
            "src": "images/unit9/controls_example1.png",
            "alt": "Apartment market data",
            "caption": "Figure 9.4.8: Analyze effects of rent control."
          },
          
          "problem": "The apartment market has demand $Q_d = 1000 - 2P$ and supply $Q_s = 200 + 2P$, where $P$ is monthly rent in dollars and $Q$ is number of apartments. The city imposes a rent ceiling of $\\$150$.<br>a) Find equilibrium rent and quantity without rent control.<br>b) Is the price ceiling binding?<br>c) What are quantity demanded and quantity supplied at the ceiling?<br>d) What is the shortage of apartments?<br>e) Calculate the deadweight loss from rent control.<br>f) What problems will likely arise?",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "$1000 - 2P = 200 + 2P$ → $800 = 4P$ → $P = 200$, $Q = 1000 - 400 = 600$."
            },
            {
              "step": "Check if binding",
              "explanation": "Ceiling $150 < 200$, so binding."
            },
            {
              "step": "Quantity at ceiling",
              "explanation": "$Q_d = 1000 - 2(150) = 1000 - 300 = 700$. $Q_s = 200 + 2(150) = 200 + 300 = 500$."
            },
            {
              "step": "Shortage",
              "explanation": "$700 - 500 = 200$ apartments."
            },
            {
              "step": "Deadweight loss",
              "explanation": "DWL is triangle between supply and demand from $Q_s=500$ to $Q^*=600$. Need prices on demand and supply at $Q=500$. Demand: $P = 500 - 0.5Q$, at $Q=500$, $P_d = 500 - 250 = 250$. Supply: $P = 0.5Q - 100$, at $Q=500$, $P_s = 250 - 100 = 150$. Height at $Q=500$ is $P_d - P_s = 250 - 150 = 100$. Base = $600 - 500 = 100$. DWL = $\\frac{1}{2} × 100 × 100 = 5000$."
            },
            {
              "step": "Problems",
              "explanation": "Long waiting lists, discrimination by landlords, black markets, reduced quality and maintenance, reduced construction."
            }
          ],
          
          "final_answer": "a) $P=200$, $Q=600$. b) Yes. c) $Q_d=700$, $Q_s=500$. d) Shortage=200. e) $DWL=5000$. f) Lines, discrimination, black markets, quality decline.",
          "concept_applied": "Binding price ceiling creates shortage and deadweight loss."
        },
        {
          "title": "Analyzing a Price Floor",
          
          "image": {
            "src": "images/unit9/controls_example2.png",
            "alt": "Agricultural market data",
            "caption": "Figure 9.4.9: Analyze effects of agricultural price support."
          },
          
          "problem": "The wheat market has demand $Q_d = 500 - 10P$ and supply $Q_s = 100 + 10P$, where $P$ is price per bushel, $Q$ is millions of bushels. The government sets a price floor of $\\$25$ per bushel and agrees to buy any surplus.<br>a) Find equilibrium price and quantity.<br>b) Is the price floor binding?<br>c) What are quantity demanded and quantity supplied at the floor?<br>d) What is the surplus? How much will the government need to buy?<br>e) What is the cost to the government?<br>f) Calculate the deadweight loss from the price floor.",
          
          "step_by_step": [
            {
              "step": "Find equilibrium",
              "explanation": "$500 - 10P = 100 + 10P$ → $400 = 20P$ → $P = 20$, $Q = 500 - 200 = 300$ million."
            },
            {
              "step": "Check binding",
              "explanation": "Floor $25 > 20$, so binding."
            },
            {
              "step": "Quantity at floor",
              "explanation": "$Q_d = 500 - 10(25) = 500 - 250 = 250$. $Q_s = 100 + 10(25) = 100 + 250 = 350$."
            },
            {
              "step": "Surplus",
              "explanation": "$350 - 250 = 100$ million bushels. Government buys this."
            },
            {
              "step": "Government cost",
              "explanation": "$100$ million × $\\$25 = \\$2.5$ billion."
            },
            {
              "step": "Deadweight loss",
              "explanation": "DWL is triangle between supply and demand from $Q_d=250$ to $Q^*=300$. Need prices at $Q=250$. Demand: $P = 50 - 0.1Q$, at $Q=250$, $P_d = 50 - 25 = 25$. Supply: $P = 0.1Q - 10$, at $Q=250$, $P_s = 25 - 10 = 15$. Height = $P_d - P_s = 25 - 15 = 10$. Base = $300 - 250 = 50$. DWL = $\\frac{1}{2} × 10 × 50 = 250$ million."
            }
          ],
          
          "final_answer": "a) $P=20$, $Q=300$. b) Yes. c) $Q_d=250$, $Q_s=350$. d) Surplus=100 million, government buys it. e) $\\$2.5$ billion. f) $DWL=250$ million.",
          "concept_applied": "Binding price floor creates surplus, government purchases, and deadweight loss."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Find Equilibrium",
          "description": "Determine equilibrium price and quantity without controls.",
          "mechanism": "$Q_d = Q_s$",
          "result": "$P^*$, $Q^*$.",
          
          "image": {
            "src": "images/unit9/controls_step1.png",
            "alt": "Finding equilibrium",
            "caption": "Figure 9.4.10: Step 1 - Find equilibrium."
          }
        },
        {
          "step": 2,
          "process": "Compare Control Price to Equilibrium",
          "description": "Determine if price control is binding.",
          "mechanism": "If ceiling below $P^*$ or floor above $P^*$, binding.",
          "result": "Binding status.",
          
          "image": {
            "src": "images/unit9/controls_step2.png",
            "alt": "Comparing control price to equilibrium",
            "caption": "Figure 9.4.11: Step 2 - Check if control is binding."
          }
        },
        {
          "step": 3,
          "process": "Calculate Qd and Qs at Control Price",
          "description": "Find quantities demanded and supplied at the controlled price.",
          "mechanism": "Plug control price into demand and supply functions.",
          "result": "$Q_d$, $Q_s$.",
          
          "image": {
            "src": "images/unit9/controls_step3.png",
            "alt": "Finding Qd and Qs at control price",
            "caption": "Figure 9.4.12: Step 3 - Calculate Qd and Qs at control price."
          }
        },
        {
          "step": 4,
          "process": "Determine Actual Quantity Traded",
          "description": "Quantity traded is the smaller of $Q_d$ and $Q_s$.",
          "mechanism": "For ceiling, $Q = Q_s$ (supply constraint). For floor, $Q = Q_d$ (demand constraint).",
          "result": "Actual quantity.",
          
          "image": {
            "src": "images/unit9/controls_step4.png",
            "alt": "Determining actual quantity",
            "caption": "Figure 9.4.13: Step 4 - Determine actual quantity traded."
          }
        },
        {
          "step": 5,
          "process": "Calculate Shortage/Surplus and Deadweight Loss",
          "description": "Find gap and efficiency loss.",
          "mechanism": "Shortage = $Q_d - Q_s$; Surplus = $Q_s - Q_d$. DWL = $\\frac{1}{2} × (P_d - P_s) × (Q^* - Q_t)$.",
          "result": "Shortage/surplus and DWL.",
          
          "image": {
            "src": "images/unit9/controls_step5.png",
            "alt": "Calculating shortage/surplus and DWL",
            "caption": "Figure 9.4.14: Step 5 - Calculate shortage/surplus and deadweight loss."
          }
        }
      ],

      "image": {
        "src": "images/unit9/price_controls_summary.png",
        "alt": "Comprehensive summary: price ceilings, price floors, shortages, surpluses, deadweight loss",
        "caption": "Figure 9.4.15: Price controls summary."
      }
    }
  ],

  "key_terms": [
    "Price ceiling",
    "Price floor",
    "Binding price control",
    "Non-binding price control",
    "Shortage",
    "Excess demand",
    "Surplus",
    "Excess supply",
    "Rent control",
    "Minimum wage",
    "Agricultural price supports",
    "Non-price rationing",
    "Black market",
    "Deadweight loss",
    "Consumer surplus",
    "Producer surplus",
    "Total surplus",
    "Elasticity",
    "Quantity traded",
    "Government purchases"
  ],

  "summary": "Price controls are government-mandated maximum or minimum prices. A binding price ceiling (set below equilibrium) creates a shortage—quantity demanded exceeds quantity supplied. The actual quantity traded falls to the quantity supplied, and non-price rationing (lines, discrimination, lotteries) allocates the scarce goods. Black markets may emerge, and quality often deteriorates. A binding price floor (set above equilibrium) creates a surplus—quantity supplied exceeds quantity demanded. The actual quantity traded falls to the quantity demanded. For goods, this leads to unsold inventory and often government purchases (agricultural price supports). For labor (minimum wage), it creates unemployment. Both price ceilings and floors create deadweight loss—a reduction in total surplus below the efficient level—because they reduce quantity below the equilibrium level. The size of the shortage or surplus depends on the elasticities of supply and demand: more elastic curves lead to larger gaps for a given price control. Understanding price controls is essential for evaluating policies like rent control, minimum wage laws, and agricultural subsidies, and for understanding why economists generally view price controls as inefficient despite their political popularity."
}
