{
  "expanded_description": "This section introduces series-parallel combination circuits, which contain both series and parallel connections. Analyzing such circuits requires identifying which parts are in series and which are in parallel, then simplifying step by step using the rules for equivalent resistance. Understanding series-parallel circuits is essential for real‑world applications, as most practical circuits are not purely series or purely parallel.",
  "core_concept": {
    "principle": "A series-parallel circuit is a combination of resistors where some are connected in series and others in parallel. The equivalent resistance of the entire circuit is found by systematically simplifying the network: identify parallel groups, replace them with their equivalent resistance, then combine series resistances, repeating until a single equivalent resistance remains. Current and voltage in each branch can then be found by working backwards through the simplification steps.",
    "explanation": "Many circuits, from simple voltage dividers with loads to complex electronic networks, are series-parallel. The analysis method is straightforward: first, identify clearly which resistors are in series (same current) and which are in parallel (same voltage). Then reduce each parallel combination to an equivalent resistance, and each series combination to a sum. Continue simplifying until you have a single equivalent resistance seen by the source. After finding total current, use Ohm's law and current/voltage divider rules to find currents and voltages in the original branches.",
    "image": {
      "src": "images/unit9/series_parallel_example.png",
      "alt": "Example circuit with a series combination of two parallel groups and a single resistor",
      "caption": "A typical series-parallel circuit can be simplified by reducing parallel branches first."
    }
  },
  "sections": [
    {
      "section_title": "Analyzing Series-Parallel Circuits",
      "introduction": "Real‑world circuits rarely consist of only series or only parallel connections. Most are combinations of both. To analyze them, we apply the rules we've learned in a systematic way.",
      "key_concept": {
        "definition": "A series-parallel circuit is a circuit that contains both series and parallel combinations of resistors. The equivalent resistance is found by repeatedly simplifying groups of resistors until a single resistance remains.",
        "context": "This skill is essential for understanding voltage dividers under load, designing filter circuits, and troubleshooting electronic devices. The process is like solving a puzzle: identify, simplify, repeat."
      },
      "principles": [
        {
          "principle": "Identify Series and Parallel Sections",
          "statement": "Before simplifying, identify which resistors are in series (same current path, no junctions between them) and which are in parallel (connected between the same two nodes). Redraw the circuit if necessary to make these relationships clear.",
          "application": "Look for junctions where current splits or merges. Resistors between two junctions without any other junctions between them are in parallel. Resistors that are end‑to‑end with no branching between them are in series.",
          "example": "In a circuit with two parallel resistors in series with a third resistor, the two parallel resistors form a group; their equivalent is then in series with the third."
        },
        {
          "principle": "Simplify Step by Step",
          "statement": "Replace each parallel combination with its equivalent resistance, and each series combination with its equivalent. Then redraw the circuit with the new equivalents and repeat until only one resistor remains.",
          "application": "Work from the innermost part of the circuit outward. Often you may need to combine parallel groups first, then combine series resistances, then perhaps find another parallel group, etc.",
          "example": "If a circuit has two parallel resistors in series with another parallel group, first reduce each parallel group, then add the two resulting resistances in series."
        },
        {
          "principle": "Work Backwards to Find Branch Currents and Voltages",
          "statement": "After finding the total current from the source using the final equivalent resistance, go back through the simplification steps to determine currents and voltages in each branch. Use Ohm's law, voltage divider rule, and current divider rule as appropriate.",
          "application": "Start from the source and move outward: find voltage across each equivalent resistance, then expand parallel groups to find individual branch currents using current division, and series groups to find voltage drops across each resistor using voltage division.",
          "example": "If a parallel group equivalent resistance $R_{eq}$ has a known voltage $V$, each resistor in that group has the same $V$, and the current through each is $V/R_i$."
        }
      ],
      "worked_examples": [
        {
          "title": "Basic Series-Parallel Reduction",
          "problem": "Find the equivalent resistance of the circuit shown: a 10 Ω resistor in series with a parallel combination of a 20 Ω and a 30 Ω resistor. Also find the total current if a 12 V battery is connected.",
          "step_by_step": [
            {
              "step": "Identify the parallel group",
              "explanation": "The 20 Ω and 30 Ω resistors are in parallel. Their equivalent resistance $R_p$ is given by $\\frac{1}{R_p} = \\frac{1}{20} + \\frac{1}{30} = \\frac{3}{60} + \\frac{2}{60} = \\frac{5}{60}$, so $R_p = 60/5 = 12$ Ω."
            },
            {
              "step": "Now the circuit simplifies to a series combination of 10 Ω and 12 Ω",
              "explanation": "$R_{eq} = 10 + 12 = 22$ Ω."
            },
            {
              "step": "Total current from 12 V source",
              "explanation": "$I_{total} = V / R_{eq} = 12 / 22 = 0.545$ A."
            }
          ],
          "final_answer": "$R_{eq} = 22$ Ω, $I_{total} = 0.545$ A.",
          "concept_applied": "Parallel group first, then series addition."
        },
        {
          "title": "Finding Currents in Branches",
          "problem": "For the same circuit (10 Ω in series with parallel 20 Ω and 30 Ω, 12 V source), find the current through the 20 Ω resistor.",
          "step_by_step": [
            {
              "step": "Find voltage across the parallel group",
              "explanation": "From the simplified circuit, the voltage across the 12 Ω equivalent resistor is $V_p = I_{total} \\times R_p = 0.545 \\times 12 = 6.54$ V. This is the voltage across both the 20 Ω and 30 Ω resistors (since they are in parallel)."
            },
            {
              "step": "Find current through 20 Ω",
              "explanation": "$I_{20} = V_p / 20 = 6.54 / 20 = 0.327$ A."
            }
          ],
          "final_answer": "$0.327$ A through the 20 Ω resistor.",
          "concept_applied": "After reduction, expand parallel group using voltage across it."
        },
        {
          "title": "More Complex Network",
          "problem": "Consider a circuit with three resistors: $R_1 = 4$ Ω, $R_2 = 6$ Ω, and $R_3 = 12$ Ω. $R_2$ and $R_3$ are in parallel, and this combination is in series with $R_1$. A 24 V battery is connected across the entire combination. Find (a) the total current, (b) the current through $R_2$, and (c) the voltage across $R_1$.",
          "step_by_step": [
            {
              "step": "Find equivalent of parallel $R_2$ and $R_3$",
              "explanation": "$R_{23} = \\frac{6 \\times 12}{6 + 12} = \\frac{72}{18} = 4$ Ω."
            },
            {
              "step": "Total equivalent resistance",
              "explanation": "$R_{eq} = R_1 + R_{23} = 4 + 4 = 8$ Ω."
            },
            {
              "step": "Total current",
              "explanation": "$I_{total} = V / R_{eq} = 24 / 8 = 3$ A."
            },
            {
              "step": "Voltage across parallel group",
              "explanation": "$V_{23} = I_{total} \\times R_{23} = 3 \\times 4 = 12$ V."
            },
            {
              "step": "Current through $R_2$",
              "explanation": "$I_2 = V_{23} / R_2 = 12 / 6 = 2$ A."
            },
            {
              "step": "Voltage across $R_1$",
              "explanation": "$V_1 = I_{total} \\times R_1 = 3 \\times 4 = 12$ V (or $V_1 = 24 - V_{23} = 12$ V)."
            }
          ],
          "final_answer": "$I_{total} = 3$ A, $I_2 = 2$ A, $V_1 = 12$ V.",
          "concept_applied": "Step‑by‑step reduction and back‑substitution."
        },
        {
          "title": "Circuit with Multiple Parallel Groups",
          "problem": "A circuit has $R_1 = 10$ Ω in series with a parallel combination of $R_2 = 20$ Ω and $R_3 = 30$ Ω. This whole branch is then in parallel with $R_4 = 40$ Ω, and the entire network is connected to a 24 V source. Find the equivalent resistance and the current through $R_4$.",
          "step_by_step": [
            {
              "step": "First reduce the series-parallel branch",
              "explanation": "As before, $R_{23} = \\frac{20 \\times 30}{20+30} = \\frac{600}{50} = 12$ Ω. Then $R_{123} = R_1 + R_{23} = 10 + 12 = 22$ Ω."
            },
            {
              "step": "Now $R_{123}$ is in parallel with $R_4$",
              "explanation": "$\\frac{1}{R_{eq}} = \\frac{1}{22} + \\frac{1}{40} = \\frac{40}{880} + \\frac{22}{880} = \\frac{62}{880}$, so $R_{eq} = 880/62 = 14.19$ Ω."
            },
            {
              "step": "Total current from source",
              "explanation": "$I_{total} = 24 / 14.19 = 1.69$ A."
            },
            {
              "step": "Voltage across $R_{123}$ and $R_4$ (they are in parallel, so same voltage)",
              "explanation": "$V_{parallel} = I_{total} \\times R_{eq} = 24$ V? Wait, careful: $V_{parallel}$ is actually $V_{source} = 24$ V because they are directly across the source? Yes, $R_{123}$ and $R_4$ are in parallel directly with the source, so each has 24 V across it. So $I_4 = 24 / 40 = 0.6$ A."
            },
            {
              "step": "Check: current through $R_{123}$ branch",
              "explanation": "$I_{123} = 24 / 22 = 1.09$ A. Total $0.6 + 1.09 = 1.69$ A, matching $I_{total}$."
            }
          ],
          "final_answer": "$R_{eq} = 14.2$ Ω, $I_4 = 0.6$ A.",
          "concept_applied": "Multiple levels of combination: series-parallel branch then parallel with another resistor."
        }
      ],
      "image": {
        "src": "images/unit9/series_parallel_analysis.png",
        "alt": "Step-by-step reduction of a series-parallel circuit to equivalent resistance",
        "caption": "Systematic reduction: identify parallel groups, replace, then combine series resistances."
      }
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when analyzing series-parallel circuits.",
      "classifications": [
        {
          "type": "Incorrectly Identifying Series vs. Parallel",
          "value": "Misclassifying resistors due to drawing or misreading the circuit",
          "characteristics": [
            "Thinking two resistors are in series when there is a junction between them",
            "Believing resistors are in parallel when they are not connected to the same two nodes"
          ],
          "behavior": "Two resistors are in series only if they are connected end‑to‑end with no other junction between them. Two resistors are in parallel only if both ends are connected directly together. Redrawing the circuit often helps clarify.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "In a circuit with a junction between two resistors, student treats them as series."
            },
            {
              "process": "Correct",
              "explanation": "They are actually in parallel if the junction connects to the same node on both sides, or they are part of a more complex network."
            }
          ]
        },
        {
          "type": "Forgetting to Work Step by Step",
          "value": "Trying to compute equivalent resistance in one step without simplifying",
          "characteristics": [
            "Attempting to use product‑over‑sum for more than two resistors at once incorrectly",
            "Not breaking the circuit into manageable pieces"
          ],
          "behavior": "Always simplify systematically: identify a simple parallel or series group, replace it, redraw, and repeat. This avoids errors.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student tries to combine three resistors in parallel using product‑over‑sum formula incorrectly."
            },
            {
              "process": "Correct",
              "explanation": "Combine them stepwise: first two, then combine result with the third using parallel formula, or use the reciprocal formula correctly."
            }
          ]
        },
        {
          "type": "Voltage and Current Division Misapplication",
          "value": "Using voltage divider on a parallel branch or current divider on a series branch",
          "characteristics": [
            "Applying voltage divider to find voltage across a resistor in a parallel group (voltage is same across all parallel resistors, so no division needed)",
            "Using current divider in a series path (current is same through series resistors)"
          ],
          "behavior": "Voltage divider applies only to resistors in series. Current divider applies only to resistors in parallel. Know which situation you have.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student uses voltage divider formula for two parallel resistors."
            },
            {
              "process": "Correct",
              "explanation": "Parallel resistors have the same voltage; use Ohm's law for each."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit9/series_parallel_mistakes.png",
        "alt": "Common mistakes in series-parallel analysis",
        "caption": "Avoid these common errors when analyzing series-parallel circuits."
      }
    }
  ],
  "key_terms": [
    "Series-parallel circuit",
    "Combination circuit",
    "Equivalent resistance",
    "Simplify",
    "Reduce",
    "Work backwards",
    "Current divider",
    "Voltage divider",
    "Node",
    "Junction"
  ],
  "summary": "Series-parallel circuits contain both series and parallel connections. To find the equivalent resistance, systematically identify and replace parallel groups with their equivalents, then combine series resistances, repeating until a single resistance remains. After finding total current from the source, work backwards through the simplification steps to determine voltages across and currents through individual resistors, using Ohm's law, voltage division, and current division as appropriate. Common mistakes include misidentifying series/parallel relationships, trying to combine too many resistors at once, and misapplying voltage/current divider rules. Mastering series-parallel analysis is essential for understanding real-world circuits."
}
