{
  "course": "Grade 10 Biology",
  "topic": "Biochemistry: Proteins and Nucleic Acids",
  "problems": [
    {
      "number": 1,
      "problem": "Define protein.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Proteins are organic macromolecules composed of amino acids linked by peptide bonds."
        }
      ],
      "final_answer": "Proteins are macromolecules made of amino acids connected by peptide bonds."
    },
    {
      "number": 2,
      "problem": "List the levels of protein structure.",
      "image": null,
      "step_by_step": [
        {
          "step": "Levels",
          "explanation": "Primary: sequence of amino acids; Secondary: alpha-helix or beta-sheet; Tertiary: 3D folding; Quaternary: multiple polypeptide chains."
        }
      ],
      "final_answer": "Primary, Secondary, Tertiary, and Quaternary structures describe protein organization."
    },
    {
      "number": 3,
      "problem": "Explain the function of enzymes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Enzymes are proteins that act as biological catalysts."
        },
        {
          "step": "Function",
          "explanation": "They speed up chemical reactions without being consumed."
        }
      ],
      "final_answer": "Enzymes are proteins that speed up biochemical reactions without being used up."
    },
    {
      "number": 4,
      "problem": "Explain the role of the active site in enzyme activity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define active site",
          "explanation": "Region on the enzyme where the substrate binds."
        },
        {
          "step": "Function",
          "explanation": "Facilitates conversion of substrate to product by lowering activation energy."
        }
      ],
      "final_answer": "The active site binds substrates and facilitates the reaction by lowering activation energy."
    },
    {
      "number": 5,
      "problem": "Explain the difference between DNA and RNA.",
      "image": null,
      "step_by_step": [
        {
          "step": "DNA",
          "explanation": "Deoxyribonucleic acid; double-stranded; stores genetic information; contains deoxyribose sugar and thymine."
        },
        {
          "step": "RNA",
          "explanation": "Ribonucleic acid; single-stranded; involved in protein synthesis; contains ribose sugar and uracil."
        }
      ],
      "final_answer": "DNA: double-stranded, stores genes, has deoxyribose and thymine; RNA: single-stranded, protein synthesis, ribose and uracil."
    },
    {
      "number": 6,
      "problem": "Define nucleotide and its components.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "A nucleotide is the building block of nucleic acids."
        },
        {
          "step": "Components",
          "explanation": "Consists of a sugar (ribose or deoxyribose), a phosphate group, and a nitrogenous base (A, T, G, C, or U)."
        }
      ],
      "final_answer": "A nucleotide is a sugar + phosphate + nitrogenous base, forming the building block of nucleic acids."
    },
    {
      "number": 7,
      "problem": "Explain the role of mRNA, tRNA, and rRNA in protein synthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "mRNA",
          "explanation": "Carries the genetic code from DNA to ribosomes."
        },
        {
          "step": "tRNA",
          "explanation": "Transfers amino acids to the ribosome according to the mRNA codon sequence."
        },
        {
          "step": "rRNA",
          "explanation": "Forms the core of ribosome structure and catalyzes peptide bond formation."
        }
      ],
      "final_answer": "mRNA: genetic code carrier; tRNA: delivers amino acids; rRNA: forms ribosome and catalyzes peptide bonds."
    },
    {
      "number": 8,
      "problem": "Explain the difference between essential and non-essential amino acids.",
      "image": null,
      "step_by_step": [
        {
          "step": "Essential amino acids",
          "explanation": "Cannot be synthesized by the body and must be obtained from diet."
        },
        {
          "step": "Non-essential amino acids",
          "explanation": "Can be synthesized by the body and do not need to be obtained from diet."
        }
      ],
      "final_answer": "Essential amino acids must be obtained from food; non-essential amino acids can be made by the body."
    },
    {
      "number": 9,
      "problem": "Explain denaturation of proteins.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Denaturation is the structural alteration of a protein caused by heat, pH, or chemicals."
        },
        {
          "step": "Effect",
          "explanation": "Protein loses its shape and function but primary sequence remains intact."
        }
      ],
      "final_answer": "Denaturation changes protein structure and function due to external factors, without breaking the amino acid sequence."
    },
    {
      "number": 10,
      "problem": "Explain how DNA stores genetic information.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "DNA has a double helix with complementary base pairs (A-T, G-C)."
        },
        {
          "step": "Function",
          "explanation": "Sequence of bases encodes instructions for synthesizing proteins and controlling cellular functions."
        }
      ],
      "final_answer": "DNA stores genetic information in base sequences, which guide protein synthesis and cell regulation."
    }
  ]
}
