{
  "course": "Grade 10 Biology",
  "topic": "Cell Processes: Photosynthesis",
  "problems": [
    {
      "number": 1,
      "problem": "Define photosynthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Photosynthesis is the process by which green plants, algae, and some bacteria convert light energy into chemical energy in the form of glucose."
        }
      ],
      "final_answer": "Photosynthesis is the process by which light energy is converted into chemical energy (glucose) in plants and some organisms."
    },
    {
      "number": 2,
      "problem": "Write the overall chemical equation for photosynthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Equation",
          "explanation": "6 CO₂ + 6 H₂O + light energy → C₆H₁₂O₆ + 6 O₂"
        }
      ],
      "final_answer": "6 CO₂ + 6 H₂O + light → C₆H₁₂O₆ + 6 O₂"
    },
    {
      "number": 3,
      "problem": "Explain the role of chlorophyll in photosynthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Chlorophyll is the green pigment in chloroplasts."
        },
        {
          "step": "Function",
          "explanation": "It absorbs light energy required to drive the synthesis of glucose from carbon dioxide and water."
        }
      ],
      "final_answer": "Chlorophyll absorbs light energy needed to convert CO₂ and H₂O into glucose during photosynthesis."
    },
    {
      "number": 4,
      "problem": "Differentiate between the light-dependent and light-independent reactions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Light-dependent reactions",
          "explanation": "Occur in the thylakoid membranes; convert light energy into ATP and NADPH, and release O₂ from water."
        },
        {
          "step": "Light-independent reactions (Calvin cycle)",
          "explanation": "Occur in the stroma; use ATP and NADPH to fix CO₂ into glucose."
        }
      ],
      "final_answer": "Light-dependent: produce ATP/NADPH and O₂; Light-independent: use ATP/NADPH to make glucose from CO₂."
    },
    {
      "number": 5,
      "problem": "Explain the importance of photosynthesis to life on Earth.",
      "image": null,
      "step_by_step": [
        {
          "step": "Importance",
          "explanation": "Produces oxygen for aerobic organisms, provides glucose for energy, and forms the base of food chains."
        }
      ],
      "final_answer": "Photosynthesis produces oxygen, supplies glucose, and supports all food chains."
    },
    {
      "number": 6,
      "problem": "Explain the function of stomata in photosynthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Stomata are small pores on the leaf surface."
        },
        {
          "step": "Function",
          "explanation": "Allow CO₂ to enter for photosynthesis and release O₂ as a by-product."
        }
      ],
      "final_answer": "Stomata let CO₂ in and O₂ out, enabling photosynthesis."
    },
    {
      "number": 7,
      "problem": "Explain the role of water in photosynthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Water is split during light-dependent reactions to release electrons, hydrogen ions, and O₂."
        }
      ],
      "final_answer": "Water provides electrons and hydrogen ions for reactions and releases oxygen as a by-product."
    },
    {
      "number": 8,
      "problem": "Explain the role of ATP and NADPH in the Calvin cycle.",
      "image": null,
      "step_by_step": [
        {
          "step": "ATP",
          "explanation": "Provides energy to drive the synthesis of glucose from CO₂."
        },
        {
          "step": "NADPH",
          "explanation": "Provides reducing power (electrons and hydrogen) to convert CO₂ into glucose."
        }
      ],
      "final_answer": "ATP provides energy and NADPH provides electrons to fix CO₂ into glucose during the Calvin cycle."
    },
    {
      "number": 9,
      "problem": "Explain the effect of light intensity on the rate of photosynthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Effect",
          "explanation": "Increasing light intensity increases the rate of photosynthesis up to a point, after which other factors become limiting."
        }
      ],
      "final_answer": "Higher light intensity increases photosynthesis rate until another factor limits the process."
    },
    {
      "number": 10,
      "problem": "Explain how carbon dioxide concentration affects photosynthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Effect",
          "explanation": "Increasing CO₂ concentration increases the rate of photosynthesis until the plant reaches its maximum capacity."
        }
      ],
      "final_answer": "Higher CO₂ levels increase photosynthesis rate until saturation occurs."
    }
  ]
}
