{
  "course": "Grade 10 Biology",
  "topic": "Cell Processes: Enzymes and Cellular Respiration",
  "problems": [
    {
      "number": 1,
      "problem": "Define enzyme.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Enzymes are proteins that act as biological catalysts, speeding up chemical reactions without being consumed."
        }
      ],
      "final_answer": "Enzymes are proteins that catalyze biochemical reactions without being used up."
    },
    {
      "number": 2,
      "problem": "Explain the role of the active site in enzyme activity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Active site",
          "explanation": "The active site is the region of an enzyme where the substrate binds and the reaction occurs."
        },
        {
          "step": "Function",
          "explanation": "It lowers activation energy and facilitates conversion of substrate to product."
        }
      ],
      "final_answer": "The active site binds the substrate and facilitates the reaction by lowering activation energy."
    },
    {
      "number": 3,
      "problem": "Explain the effect of temperature and pH on enzyme activity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Temperature",
          "explanation": "Each enzyme has an optimum temperature; high heat can denature it and reduce activity."
        },
        {
          "step": "pH",
          "explanation": "Each enzyme has an optimum pH; extremes can alter its shape and reduce activity."
        }
      ],
      "final_answer": "Enzyme activity is highest at optimum temperature and pH; extremes can denature and reduce activity."
    },
    {
      "number": 4,
      "problem": "Define cellular respiration.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Cellular respiration is the process by which cells convert glucose and oxygen into energy (ATP), carbon dioxide, and water."
        }
      ],
      "final_answer": "Cellular respiration converts glucose and oxygen into ATP, CO₂, and H₂O."
    },
    {
      "number": 5,
      "problem": "Write the general chemical equation for aerobic respiration.",
      "image": null,
      "step_by_step": [
        {
          "step": "Equation",
          "explanation": "C₆H₁₂O₆ + 6 O₂ → 6 CO₂ + 6 H₂O + energy (ATP)"
        }
      ],
      "final_answer": "C₆H₁₂O₆ + 6 O₂ → 6 CO₂ + 6 H₂O + ATP"
    },
    {
      "number": 6,
      "problem": "Differentiate between aerobic and anaerobic respiration.",
      "image": null,
      "step_by_step": [
        {
          "step": "Aerobic respiration",
          "explanation": "Requires oxygen; produces maximum ATP (36–38 per glucose)."
        },
        {
          "step": "Anaerobic respiration",
          "explanation": "Occurs without oxygen; produces less ATP (2 per glucose) and lactic acid or ethanol."
        }
      ],
      "final_answer": "Aerobic: needs O₂, more ATP; Anaerobic: no O₂, less ATP, produces lactic acid or ethanol."
    },
    {
      "number": 7,
      "problem": "Explain glycolysis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Glycolysis is the first step of cellular respiration that occurs in the cytoplasm."
        },
        {
          "step": "Function",
          "explanation": "Breaks glucose (6C) into 2 pyruvate (3C), producing 2 ATP and 2 NADH molecules."
        }
      ],
      "final_answer": "Glycolysis splits glucose into 2 pyruvate, producing 2 ATP and 2 NADH in the cytoplasm."
    },
    {
      "number": 8,
      "problem": "Explain the role of mitochondria in cellular respiration.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "Mitochondria are the site of the Krebs cycle and electron transport chain, producing most ATP in aerobic respiration."
        }
      ],
      "final_answer": "Mitochondria produce most ATP via the Krebs cycle and electron transport chain."
    },
    {
      "number": 9,
      "problem": "Explain the electron transport chain (ETC) and its importance.",
      "image": null,
      "step_by_step": [
        {
          "step": "ETC definition",
          "explanation": "Series of protein complexes in the inner mitochondrial membrane that transfer electrons."
        },
        {
          "step": "Function",
          "explanation": "Generates a proton gradient that drives ATP synthesis by ATP synthase."
        }
      ],
      "final_answer": "ETC transfers electrons and creates a proton gradient to produce most of the ATP in aerobic respiration."
    },
    {
      "number": 10,
      "problem": "Explain fermentation and give examples.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Fermentation is anaerobic respiration producing ATP without oxygen."
        },
        {
          "step": "Examples",
          "explanation": "Lactic acid fermentation (muscle cells), alcoholic fermentation (yeast)."
        }
      ],
      "final_answer": "Fermentation is ATP production without oxygen: lactic acid in muscles, alcohol in yeast."
    }
  ]
}
