{
  "course": "Grade 10 Biology",
  "topic": "Evolution and Natural Selection",
  "problems": [
    {
      "number": 1,
      "problem": "Define evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Evolution is the change in the heritable characteristics of populations over successive generations."
        }
      ],
      "final_answer": "Evolution is the change in heritable traits of populations over generations."
    },
    {
      "number": 2,
      "problem": "Explain natural selection.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Natural selection is the process by which organisms with advantageous traits are more likely to survive and reproduce."
        }
      ],
      "final_answer": "Natural selection favors individuals with advantageous traits, increasing their frequency in the population."
    },
    {
      "number": 3,
      "problem": "List the conditions required for natural selection to occur.",
      "image": null,
      "step_by_step": [
        {
          "step": "Conditions",
          "explanation": "1. Variation in traits, 2. Differential survival or reproduction, 3. Heredity, 4. Overproduction of offspring."
        }
      ],
      "final_answer": "Natural selection requires variation, differential survival/reproduction, heredity, and overproduction."
    },
    {
      "number": 4,
      "problem": "Explain the difference between adaptation and acclimatization.",
      "image": null,
      "step_by_step": [
        {
          "step": "Adaptation",
          "explanation": "A heritable trait that increases fitness and is shaped over generations by natural selection."
        },
        {
          "step": "Acclimatization",
          "explanation": "A reversible physiological response to environmental changes within an individual's lifetime."
        }
      ],
      "final_answer": "Adaptation: heritable trait over generations; Acclimatization: reversible change in an individual."
    },
    {
      "number": 5,
      "problem": "Define mutation and explain its role in evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Mutation",
          "explanation": "A mutation is a change in the DNA sequence."
        },
        {
          "step": "Role",
          "explanation": "Mutations create genetic variation, which can be acted upon by natural selection."
        }
      ],
      "final_answer": "Mutations change DNA, producing variation that drives evolution."
    },
    {
      "number": 6,
      "problem": "Explain the concept of fitness in evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Fitness is the ability of an organism to survive, reproduce, and pass on its genes to the next generation."
        }
      ],
      "final_answer": "Fitness is an organism's ability to survive and reproduce successfully."
    },
    {
      "number": 7,
      "problem": "Explain the difference between divergent and convergent evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Divergent evolution",
          "explanation": "Species with a common ancestor evolve different traits to adapt to different environments."
        },
        {
          "step": "Convergent evolution",
          "explanation": "Unrelated species evolve similar traits due to similar environmental pressures."
        }
      ],
      "final_answer": "Divergent: same ancestor, different traits; Convergent: different ancestors, similar traits."
    },
    {
      "number": 8,
      "problem": "Explain how fossils provide evidence for evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role of fossils",
          "explanation": "Fossils show the progression of life forms over time, transitional species, and extinct organisms."
        }
      ],
      "final_answer": "Fossils document changes in organisms over time, supporting evolutionary history."
    },
    {
      "number": 9,
      "problem": "Explain the concept of speciation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Speciation is the formation of new species from existing ones due to reproductive isolation and genetic divergence."
        }
      ],
      "final_answer": "Speciation is the creation of new species through genetic divergence and reproductive isolation."
    },
    {
      "number": 10,
      "problem": "Explain the role of selective pressures in evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Selective pressures are environmental factors that affect survival and reproduction, influencing which traits are advantageous."
        }
      ],
      "final_answer": "Selective pressures determine which traits increase fitness, guiding evolution."
    }
  ]
}
