{
  "course": "Grade 10 Biology",
  "topic": "Human Physiology: Control Systems",
  "problems": [
    {
      "number": 1,
      "problem": "Define homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Homeostasis is the maintenance of a stable internal environment despite changes in the external environment."
        }
      ],
      "final_answer": "Homeostasis is the regulation of internal conditions to maintain stability."
    },
    {
      "number": 2,
      "problem": "Explain the role of the nervous system in homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "The nervous system detects changes in the environment and sends rapid electrical signals to effectors to maintain balance."
        }
      ],
      "final_answer": "The nervous system maintains homeostasis by detecting changes and sending signals to effectors quickly."
    },
    {
      "number": 3,
      "problem": "Explain the role of the endocrine system in homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "The endocrine system releases hormones into the bloodstream to regulate processes like growth, metabolism, and water balance."
        }
      ],
      "final_answer": "The endocrine system maintains homeostasis by releasing hormones that regulate body functions."
    },
    {
      "number": 4,
      "problem": "Define negative feedback and give an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Negative feedback is a mechanism where a change in a variable triggers responses that counteract the change."
        },
        {
          "step": "Example",
          "explanation": "Regulation of blood glucose: high glucose triggers insulin release to lower it."
        }
      ],
      "final_answer": "Negative feedback counteracts changes; e.g., insulin lowers high blood glucose."
    },
    {
      "number": 5,
      "problem": "Define positive feedback and give an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Positive feedback amplifies a change, moving the system further from its original state."
        },
        {
          "step": "Example",
          "explanation": "During childbirth, oxytocin release intensifies contractions."
        }
      ],
      "final_answer": "Positive feedback amplifies changes; e.g., oxytocin intensifies contractions during labor."
    },
    {
      "number": 6,
      "problem": "Explain the role of the hypothalamus in homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "The hypothalamus acts as the body's thermostat, regulating temperature, hunger, thirst, and hormone release."
        }
      ],
      "final_answer": "The hypothalamus regulates temperature, hunger, thirst, and hormone release to maintain homeostasis."
    },
    {
      "number": 7,
      "problem": "Explain the role of insulin and glucagon in blood glucose regulation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Insulin",
          "explanation": "Released when blood glucose is high; promotes glucose uptake by cells and storage as glycogen."
        },
        {
          "step": "Glucagon",
          "explanation": "Released when blood glucose is low; stimulates glycogen breakdown to release glucose."
        }
      ],
      "final_answer": "Insulin lowers high blood glucose; glucagon raises low blood glucose."
    },
    {
      "number": 8,
      "problem": "Explain the role of the autonomic nervous system in homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "The autonomic nervous system controls involuntary actions like heart rate, digestion, and respiratory rate to maintain internal balance."
        }
      ],
      "final_answer": "The autonomic nervous system maintains homeostasis by regulating involuntary processes."
    },
    {
      "number": 9,
      "problem": "Explain the role of the kidney in homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "Kidneys regulate water, salt balance, and remove metabolic wastes, maintaining blood composition and pressure."
        }
      ],
      "final_answer": "Kidneys maintain homeostasis by regulating water, salts, and removing wastes."
    },
    {
      "number": 10,
      "problem": "Explain how the body responds to temperature changes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Response to heat",
          "explanation": "Sweating and vasodilation help dissipate heat."
        },
        {
          "step": "Response to cold",
          "explanation": "Shivering and vasoconstriction help conserve heat."
        }
      ],
      "final_answer": "Body maintains temperature via sweating/vasodilation in heat and shivering/vasoconstriction in cold."
    }
  ]
}
