{
  "course": "Grade 10 Biology",
  "topic": "Human Physiology and Ecology",
  "problems": [
    {
      "number": 1,
      "problem": "Define ecology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Ecology is the study of interactions between organisms and their environment."
        }
      ],
      "final_answer": "Ecology is the study of interactions between organisms and their environment."
    },
    {
      "number": 2,
      "problem": "Define ecosystem.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "An ecosystem consists of a community of living organisms and their physical environment interacting as a system."
        }
      ],
      "final_answer": "An ecosystem is a community of organisms and their environment interacting as a system."
    },
    {
      "number": 3,
      "problem": "Explain the role of producers, consumers, and decomposers in an ecosystem.",
      "image": null,
      "step_by_step": [
        {
          "step": "Producers",
          "explanation": "Organisms like plants that produce energy through photosynthesis."
        },
        {
          "step": "Consumers",
          "explanation": "Organisms that consume other organisms for energy (herbivores, carnivores, omnivores)."
        },
        {
          "step": "Decomposers",
          "explanation": "Organisms like fungi and bacteria that break down dead matter, recycling nutrients."
        }
      ],
      "final_answer": "Producers make energy; consumers eat other organisms; decomposers recycle nutrients."
    },
    {
      "number": 4,
      "problem": "Define food chain and food web.",
      "image": null,
      "step_by_step": [
        {
          "step": "Food chain",
          "explanation": "A linear sequence showing energy transfer from one organism to another."
        },
        {
          "step": "Food web",
          "explanation": "A complex network of interconnected food chains showing energy flow in an ecosystem."
        }
      ],
      "final_answer": "Food chain: linear energy flow; Food web: interconnected chains showing energy flow."
    },
    {
      "number": 5,
      "problem": "Explain energy flow in an ecosystem and the 10% rule.",
      "image": null,
      "step_by_step": [
        {
          "step": "Energy flow",
          "explanation": "Energy flows from producers to consumers and decomposers."
        },
        {
          "step": "10% rule",
          "explanation": "Only about 10% of energy is transferred to the next trophic level; the rest is lost as heat."
        }
      ],
      "final_answer": "Energy flows through trophic levels, with ~10% transferred to the next level."
    },
    {
      "number": 6,
      "problem": "Explain biotic and abiotic factors.",
      "image": null,
      "step_by_step": [
        {
          "step": "Biotic factors",
          "explanation": "Living components of an ecosystem (plants, animals, bacteria)."
        },
        {
          "step": "Abiotic factors",
          "explanation": "Non-living components (temperature, water, sunlight, soil)."
        }
      ],
      "final_answer": "Biotic: living; Abiotic: non-living components affecting ecosystems."
    },
    {
      "number": 7,
      "problem": "Explain carrying capacity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Carrying capacity is the maximum number of individuals of a species an environment can support sustainably."
        }
      ],
      "final_answer": "Carrying capacity is the maximum sustainable population an environment can support."
    },
    {
      "number": 8,
      "problem": "Explain the difference between mutualism, commensalism, and parasitism.",
      "image": null,
      "step_by_step": [
        {
          "step": "Mutualism",
          "explanation": "Both species benefit (e.g., bees and flowers)."
        },
        {
          "step": "Commensalism",
          "explanation": "One species benefits, the other is unaffected (e.g., barnacles on whales)."
        },
        {
          "step": "Parasitism",
          "explanation": "One species benefits at the expense of the other (e.g., tapeworms in humans)."
        }
      ],
      "final_answer": "Mutualism: both benefit; Commensalism: one benefits, other unaffected; Parasitism: one benefits, other harmed."
    },
    {
      "number": 9,
      "problem": "Explain the role of the human respiratory system in homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "The respiratory system maintains oxygen and carbon dioxide balance in the blood, which is essential for cellular respiration and homeostasis."
        }
      ],
      "final_answer": "The respiratory system regulates O₂ and CO₂ levels to maintain homeostasis."
    },
    {
      "number": 10,
      "problem": "Explain the role of the human circulatory system in ecology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "The circulatory system transports nutrients, gases, and wastes, connecting humans to the environment through energy use and nutrient cycling."
        }
      ],
      "final_answer": "The circulatory system transports materials and links humans to ecosystems via energy and nutrient flow."
    }
  ]
}
