{
  "course": "Grade 10 Biology",
  "topic": "Molecular Genetics and Protein Synthesis",
  "problems": [
    {
      "number": 1,
      "problem": "Define DNA replication.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "DNA replication is the process by which a cell makes an identical copy of its DNA before cell division."
        }
      ],
      "final_answer": "DNA replication is the process of copying DNA to produce an identical molecule before cell division."
    },
    {
      "number": 2,
      "problem": "Explain the role of DNA polymerase in replication.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "DNA polymerase adds complementary nucleotides to the growing DNA strand and proofreads for errors."
        }
      ],
      "final_answer": "DNA polymerase synthesizes new DNA strands by adding nucleotides and proofreading for errors."
    },
    {
      "number": 3,
      "problem": "Define transcription.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Transcription is the process by which mRNA is synthesized from a DNA template."
        }
      ],
      "final_answer": "Transcription is the synthesis of mRNA from a DNA template."
    },
    {
      "number": 4,
      "problem": "Explain the role of RNA polymerase in transcription.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "RNA polymerase binds to the DNA promoter, unwinds the DNA, and assembles RNA nucleotides complementary to the DNA template."
        }
      ],
      "final_answer": "RNA polymerase synthesizes mRNA by assembling nucleotides complementary to the DNA template."
    },
    {
      "number": 5,
      "problem": "Define translation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Translation is the process by which ribosomes synthesize proteins using the sequence of codons in mRNA."
        }
      ],
      "final_answer": "Translation is the synthesis of proteins at ribosomes using the mRNA sequence."
    },
    {
      "number": 6,
      "problem": "Explain the role of mRNA, tRNA, and rRNA in protein synthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "mRNA",
          "explanation": "Carries genetic code from DNA to ribosome."
        },
        {
          "step": "tRNA",
          "explanation": "Transfers specific amino acids to the ribosome according to mRNA codons."
        },
        {
          "step": "rRNA",
          "explanation": "Forms the core of ribosomes and catalyzes peptide bond formation."
        }
      ],
      "final_answer": "mRNA: carries code; tRNA: delivers amino acids; rRNA: forms ribosome and catalyzes peptide bonds."
    },
    {
      "number": 7,
      "problem": "Explain the role of codons and anticodons in translation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Codon",
          "explanation": "A three-nucleotide sequence on mRNA that codes for a specific amino acid."
        },
        {
          "step": "Anticodon",
          "explanation": "A complementary three-nucleotide sequence on tRNA that pairs with the mRNA codon."
        }
      ],
      "final_answer": "Codons on mRNA specify amino acids; anticodons on tRNA pair with codons to deliver correct amino acids."
    },
    {
      "number": 8,
      "problem": "Explain the difference between introns and exons.",
      "image": null,
      "step_by_step": [
        {
          "step": "Exons",
          "explanation": "Coding regions of a gene that are expressed in the protein."
        },
        {
          "step": "Introns",
          "explanation": "Non-coding regions of a gene that are removed during RNA processing."
        }
      ],
      "final_answer": "Exons are coding regions kept in mRNA; introns are non-coding regions removed during RNA processing."
    },
    {
      "number": 9,
      "problem": "Explain the central dogma of molecular biology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The central dogma states that genetic information flows from DNA → RNA → Protein."
        }
      ],
      "final_answer": "DNA is transcribed to RNA, which is translated into protein."
    },
    {
      "number": 10,
      "problem": "Explain the effect of mutations on protein synthesis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Mutations are changes in DNA sequence."
        },
        {
          "step": "Effect",
          "explanation": "They can alter the mRNA codons and change the amino acid sequence, potentially producing nonfunctional proteins."
        }
      ],
      "final_answer": "Mutations change DNA sequences, which can alter proteins and affect their function."
    }
  ]
}
