{
  "expanded_description": "The conservation of energy is one of the most fundamental and powerful principles in all of physics. It states that energy cannot be created or destroyed—only transformed from one form to another. Total energy in an isolated system remains constant, providing a universal constraint on physical processes and an invaluable problem-solving tool.",
  "core_concept": {
    "principle": "Law of Conservation of Energy: In an isolated system (no external forces, no energy entering or leaving), the total energy remains constant. Energy can transform between forms (kinetic ↔ potential ↔ thermal ↔ chemical, etc.), but the total amount never changes: $E_{\\text{total,initial}} = E_{\\text{total,final}}$. For mechanical systems with only conservative forces: $KE_i + PE_i = KE_f + PE_f$ or equivalently $\\frac{1}{2}mv_i^2 + mgh_i = \\frac{1}{2}mv_f^2 + mgh_f$.",
    "explanation": "Energy conservation is perhaps the most important principle in physics. It applies universally—from subatomic particles to galaxies, from chemical reactions to nuclear processes, from biological systems to mechanical devices. The key insight: Energy never disappears or appears from nothing. It only changes form. When ball falls, gravitational potential energy doesn't vanish—it converts to kinetic energy. When friction slows sliding block, kinetic energy doesn't disappear—it converts to thermal energy (heat). When battery powers phone, chemical potential energy doesn't evaporate—it converts to electrical energy, then to light, sound, computation. Total energy is always conserved. For mechanical systems (focus of this chapter), conservation of mechanical energy applies when only conservative forces (gravity, springs, electric) do work: Total mechanical energy $E = KE + PE$ remains constant. Object gains KE → loses equal PE (or vice versa). Sum stays constant. If non-conservative forces (friction, air resistance) are present, mechanical energy decreases (converts to heat), but total energy (including thermal) still conserved. Energy conservation provides powerful problem-solving approach: Instead of tracking forces and accelerations throughout motion (Newton's Second Law approach), analyze initial and final energy states. If energy conserved: $E_i = E_f$. Often much simpler than force analysis, especially for complex paths, varying forces, or when interested only in final state (not detailed trajectory). Energy conservation also constrains what's possible: Perpetual motion machines impossible (would create energy from nothing—violates conservation). Can't lift yourself by pulling on your own bootstraps (no external energy input). Can't get more energy out of system than you put in (best case: energy conserved; realistic: some lost to heat). Energy conservation is both fundamental physics principle and practical engineering tool—central to understanding everything from roller coasters to power plants, from planetary orbits to metabolism.",
    "image": {
      "src": "images/unit5/energy_conservation_concept.png",
      "alt": "Diagram showing energy transformations with total energy constant: PE↔KE in pendulum, with equation Ei=Ef",
      "caption": "Conservation of Energy: Total energy constant. Forms transform (PE↔KE) but total never changes: $E_i = E_f$"
    }
  },
  "sections": [
    {
      "section_title": "The Principle of Energy Conservation",
      "introduction": "Energy conservation is a fundamental law of nature with no known exceptions. Understanding this principle provides deep insight into how the universe works.",
      "key_concept": {
        "definition": "Conservation of Energy: The total energy of an isolated system remains constant over time. Energy cannot be created or destroyed—only transformed from one form to another. Mathematically: $E_{\\text{total}} = \\text{constant}$ or $E_{\\text{initial}} = E_{\\text{final}}$ where $E_{\\text{total}} = KE + PE_{\\text{grav}} + PE_{\\text{elastic}} + PE_{\\text{chemical}} + E_{\\text{thermal}} + ...$",
        "context": "This is one of physics' most profound principles. Every physical process ever observed obeys energy conservation. It's a constraint on what can happen—events that violate energy conservation simply don't occur in nature."
      },
      "principles": [
        {
          "principle": "Energy Is Never Created or Destroyed",
          "statement": "Energy cannot appear from nothing or disappear into nothing. Total amount of energy in isolated system is constant. Energy can only transform: one form decreases, another increases by equal amount.",
          "application": "When tracking energy, account for all forms. Apparent 'losses' mean transformation to another form (often heat).",
          "example": "Burning wood: Chemical PE in wood → heat + light + sound. Energy not created—was stored in chemical bonds. Battery dying: Chemical PE → electrical energy → light/heat in bulb. Energy not destroyed—transformed and eventually dissipated as heat. Falling object: Gravitational PE → KE. Energy not created—was stored as PE, now as KE."
        },
        {
          "principle": "Isolated System Requirement",
          "statement": "Energy conservation strictly applies to isolated systems (no external forces, no energy in/out). For non-isolated systems, energy can enter or leave, but total energy (system + surroundings) still conserved.",
          "application": "Define system boundaries. If energy crosses boundary (work done by external force, heat flow, etc.), account for it.",
          "example": "Isolated: Object in free fall (only gravity, internal to Earth-object system). Energy conserved: PE + KE = constant. Non-isolated: Rocket accelerating (burning fuel from inside, but exhaust leaves system). Energy leaves with exhaust. System (rocket alone) loses energy. System + exhaust: energy conserved."
        },
        {
          "principle": "Energy Transformations Are Fundamental",
          "statement": "Energy constantly transforms between forms. Identifying transformations is key to understanding processes. Common transformations: KE ↔ PE (falling/rising, springs), Mechanical → Thermal (friction, air resistance), Chemical → Thermal + Mechanical (combustion in engines), Electrical → Light + Thermal (light bulbs), Nuclear → Thermal → Electrical (nuclear power plants).",
          "application": "For any process, identify: What energy forms present initially? What forms finally? How did transformation occur?",
          "example": "Hydroelectric dam: Gravitational PE (elevated water) → KE (falling water) → Mechanical (turbine rotation) → Electrical (generator) → Various (in homes: light, heat, mechanical in appliances). Multiple transformations, total energy conserved through chain."
        },
        {
          "principle": "Conservation Is Universal",
          "statement": "Energy conservation applies everywhere: Mechanics (this chapter focus), Thermodynamics (heat, entropy), Electromagnetism (electric/magnetic fields), Quantum mechanics (particle physics), Nuclear physics (including mass-energy via $E=mc^2$), Cosmology (universe-scale). No exceptions ever observed.",
          "application": "Use energy conservation to analyze any physical system at any scale.",
          "example": "Atom: Electron transitions between energy levels conserve energy (photon emitted/absorbed carries exact energy difference). Galaxy: Total energy (kinetic of stars, gravitational PE of galaxy, dark energy) conserved as galaxy evolves. Chemical reaction: Bond energies before = bond energies after + heat released/absorbed. Universal principle."
        },
        {
          "principle": "Energy Conservation vs Mass Conservation",
          "statement": "In non-relativistic physics (everyday speeds): mass conserved separately, energy conserved separately. In relativistic physics (near light speed, nuclear reactions): mass and energy interconvertible ($E = mc^2$), combined mass-energy conserved. For this course (mechanics): treat mass and energy as separately conserved.",
          "application": "At everyday speeds and energies, mass doesn't convert to energy significantly. Separate conservation laws suffice.",
          "example": "Chemical reaction: Mass before = mass after (within measurement precision). Energy before = energy after (chemical PE + thermal). Both conserved independently. Nuclear reaction: Tiny mass converts to energy ($E = mc^2$). Mass-energy total conserved, but mass alone not conserved, energy alone not conserved. Need combined conservation law (beyond scope of mechanics course)."
        }
      ],
      "image": {
        "src": "images/unit5/energy_conservation_principle.png",
        "alt": "Flow diagram showing energy transformations in various systems, all conserving total energy",
        "caption": "Energy conservation: Total energy constant. Forms transform but sum never changes. Universal principle across all physics."
      }
    },
    {
      "section_title": "Mechanical Energy Conservation",
      "introduction": "When only conservative forces act, mechanical energy (KE + PE) is conserved—a powerful simplification for solving mechanics problems.",
      "key_concept": {
        "definition": "Mechanical energy is sum of kinetic and potential energies: $E_{\\text{mech}} = KE + PE$. For systems where only conservative forces do work (gravity, springs, no friction/air resistance), mechanical energy conserves: $E_{\\text{mech,i}} = E_{\\text{mech,f}}$ or $KE_i + PE_i = KE_f + PE_f$ or $\\frac{1}{2}mv_i^2 + mgh_i = \\frac{1}{2}mv_f^2 + mgh_f$ (gravitational), or $\\frac{1}{2}mv_i^2 + \\frac{1}{2}kx_i^2 = \\frac{1}{2}mv_f^2 + \\frac{1}{2}kx_f^2$ (elastic).",
        "context": "This is incredibly useful for solving problems. Instead of analyzing forces and accelerations throughout motion (potentially complex), compare initial and final energies (often simple). Works for any conservative-force system regardless of path complexity."
      },
      "principles": [
        {
          "principle": "Mechanical Energy Conservation Equation",
          "statement": "For conservative forces only: $KE_i + PE_i = KE_f + PE_f$. Can rearrange: $\\frac{1}{2}mv_i^2 + PE_i = \\frac{1}{2}mv_f^2 + PE_f$. Gain in KE = loss in PE (or vice versa).",
          "application": "Set up equation with initial KE + PE on left, final KE + PE on right. Solve for unknown.",
          "example": "Ball dropped from height $h$: Initial: $v_i = 0$ (rest), height = $h$. $E_i = 0 + mgh = mgh$. Final (just before hitting ground): height = 0, $v_f = ?$. $E_f = \\frac{1}{2}mv_f^2 + 0 = \\frac{1}{2}mv_f^2$. Conservation: $mgh = \\frac{1}{2}mv_f^2$. Solve: $v_f = \\sqrt{2gh}$. Simple result without using forces or kinematics!"
        },
        {
          "principle": "Energy Transformations in Conservative Systems",
          "statement": "In conservative systems: Increasing height (or spring compression) → KE converts to PE (slows down). Decreasing height (or spring releasing) → PE converts to KE (speeds up). Total $E = KE + PE$ constant throughout.",
          "application": "Track energy transformations to understand motion without calculating forces.",
          "example": "Pendulum: At highest points: maximum PE, minimum KE (momentarily stopped at turning points). At lowest point: minimum PE, maximum KE (fastest point). As swings: PE ↔ KE continuously, total constant. Roller coaster: Top of hill: high PE, low KE (slow). Bottom of hill: low PE, high KE (fast). Energy converts back and forth, total conserved (ignoring friction)."
        },
        {
          "principle": "When Mechanical Energy Conservation Applies",
          "statement": "Mechanical energy conserved when: Only conservative forces (gravity, springs, electric) do work, OR non-conservative forces present but do zero work (perpendicular to motion, or no displacement). Mechanical energy NOT conserved when: Friction, air resistance, or other dissipative forces do work (convert mechanical to thermal energy).",
          "application": "Check forces present. Conservative only → use energy conservation. Non-conservative present → account for energy dissipation.",
          "example": "Applies: Free fall (only gravity). Pendulum (only gravity and tension; tension perpendicular, does no work). Mass on frictionless ramp (only gravity and normal; normal perpendicular). Doesn't apply: Block sliding with friction (friction converts KE to heat). Car coasting to stop (air resistance + friction dissipate KE). Parachutist at terminal velocity (air resistance converts PE to heat)."
        },
        {
          "principle": "Problem-Solving Strategy with Energy Conservation",
          "statement": "Steps: (1) Identify initial and final states clearly. (2) Calculate $KE_i$ and $PE_i$ for initial state. (3) Calculate $KE_f$ and $PE_f$ for final state (may have unknowns). (4) Set $KE_i + PE_i = KE_f + PE_f$. (5) Solve for unknown.",
          "application": "Systematic approach for conservative-force problems.",
          "example": "Find launch speed needed for projectile to reach height $h$: Initial (launch): $KE_i = \\frac{1}{2}mv^2$ (unknown $v$), $PE_i = 0$ (ground level). Final (peak): $KE_f = 0$ (momentarily stopped at peak), $PE_f = mgh$. Conservation: $\\frac{1}{2}mv^2 + 0 = 0 + mgh$. Solve: $v = \\sqrt{2gh}$. Simple and powerful."
        }
      ],
      "worked_examples": [
        {
          "title": "Free Fall with Energy Conservation",
          "problem": "A 2 kg ball is dropped from rest at a height of 15 m. Use energy conservation to find its speed just before hitting the ground. (Ignore air resistance.)",
          "step_by_step": [
            {
              "step": "Identify states",
              "explanation": "Initial: At rest, height 15 m. Final: Just before impact, height 0 m (ground level)."
            },
            {
              "step": "Initial energy",
              "explanation": "$KE_i = \\frac{1}{2}mv_i^2 = \\frac{1}{2}(2)(0)^2 = 0$ (dropped from rest). $PE_i = mgh_i = 2 × 9.8 × 15 = 294$ J. $E_i = 0 + 294 = 294$ J"
            },
            {
              "step": "Final energy",
              "explanation": "$KE_f = \\frac{1}{2}mv_f^2 = \\frac{1}{2}(2)v_f^2 = v_f^2$ (unknown speed). $PE_f = mgh_f = 2 × 9.8 × 0 = 0$ J (ground level). $E_f = v_f^2 + 0 = v_f^2$"
            },
            {
              "step": "Apply conservation",
              "explanation": "$E_i = E_f$. $294 = v_f^2$",
              "calculation": "$v_f = \\sqrt{294} \\approx 17.1$ m/s"
            },
            {
              "step": "Verify with kinematics",
              "explanation": "$v^2 = v_0^2 + 2g\\Delta h = 0 + 2(9.8)(15) = 294$ → $v = 17.1$ m/s ✓. Energy method gives same answer, often simpler!"
            }
          ],
          "final_answer": "$v_f \\approx 17.1$ m/s",
          "concept_applied": "Energy conservation: Initial PE converts to final KE. $mgh_i = \\frac{1}{2}mv_f^2$. Solve for final speed without tracking forces during fall."
        },
        {
          "title": "Pendulum Energy Conservation",
          "problem": "A 0.5 kg pendulum bob is released from rest when the string makes 60° angle with vertical. The string is 1.2 m long. Find the bob's speed at the lowest point.",
          "step_by_step": [
            {
              "step": "Identify heights",
              "explanation": "Choose lowest point as reference ($h = 0$). Initial height: Bob is $L - L\\cos 60° = 1.2(1 - 0.5) = 0.6$ m above lowest point. Final height: 0 m (lowest point)."
            },
            {
              "step": "Initial energy",
              "explanation": "$KE_i = 0$ (released from rest). $PE_i = mgh_i = 0.5 × 9.8 × 0.6 = 2.94$ J. $E_i = 2.94$ J"
            },
            {
              "step": "Final energy",
              "explanation": "$KE_f = \\frac{1}{2}mv_f^2 = \\frac{1}{2}(0.5)v_f^2 = 0.25v_f^2$. $PE_f = 0$ (lowest point). $E_f = 0.25v_f^2$"
            },
            {
              "step": "Conservation",
              "explanation": "$E_i = E_f$. $2.94 = 0.25v_f^2$. $v_f^2 = 11.76$",
              "calculation": "$v_f \\approx 3.43$ m/s"
            },
            {
              "step": "Interpret",
              "explanation": "All PE at release converts to KE at bottom. Pendulum fastest at lowest point (maximum KE), slowest at highest points (maximum PE, KE = 0)."
            }
          ],
          "final_answer": "$v_f \\approx 3.43$ m/s",
          "concept_applied": "Pendulum: PE at height converts to KE at bottom. Tension does no work (perpendicular), only gravity matters. Energy conservation elegant solution."
        },
        {
          "title": "Spring-Launched Projectile",
          "problem": "A spring ($k = 400$ N/m) is compressed 0.25 m and used to launch a 0.8 kg ball vertically upward. Find the maximum height the ball reaches above the spring's launch position.",
          "step_by_step": [
            {
              "step": "Initial state (compressed spring)",
              "explanation": "$KE_i = 0$ (ball at rest before launch). $PE_{s,i} = \\frac{1}{2}kx^2 = \\frac{1}{2}(400)(0.25)^2 = 12.5$ J (elastic PE). $PE_{g,i} = 0$ (define launch position as $h = 0$). $E_i = 12.5$ J"
            },
            {
              "step": "Final state (maximum height)",
              "explanation": "$KE_f = 0$ (momentarily stopped at peak). $PE_{s,f} = 0$ (spring returned to natural length). $PE_{g,f} = mgh$ (gravitational PE at height $h$). $E_f = mgh$"
            },
            {
              "step": "Conservation",
              "explanation": "$E_i = E_f$. $12.5 = mgh = 0.8 × 9.8 × h = 7.84h$"
            },
            {
              "step": "Solve for height",
              "explanation": "$h = \\frac{12.5}{7.84}$",
              "calculation": "$h \\approx 1.59$ m"
            },
            {
              "step": "Energy flow",
              "explanation": "Elastic PE (spring) → KE (during launch, ball accelerating) → Gravitational PE (as ball rises). At peak: all energy is gravitational PE, 1.59 m above launch."
            }
          ],
          "final_answer": "$h \\approx 1.59$ m above launch position",
          "concept_applied": "Energy conservation with multiple PE forms: Elastic PE converts to gravitational PE. $\\frac{1}{2}kx^2 = mgh$. No need to find launch velocity—direct height calculation."
        },
        {
          "title": "Roller Coaster Problem",
          "problem": "A roller coaster car (mass 500 kg) is released from rest at the top of a 40 m high hill. What is its speed at the bottom of a 10 m high valley? (Ignore friction.)",
          "step_by_step": [
            {
              "step": "Choose reference",
              "explanation": "Let valley bottom (10 m hill) be $h = 0$. Initial height: 40 m. Final height: 10 m."
            },
            {
              "step": "Initial energy (top of 40 m hill)",
              "explanation": "$KE_i = 0$ (released from rest). $PE_i = mgh_i = 500 × 9.8 × 40 = 196,000$ J. $E_i = 196,000$ J"
            },
            {
              "step": "Final energy (top of 10 m hill)",
              "explanation": "$KE_f = \\frac{1}{2}mv_f^2 = \\frac{1}{2}(500)v_f^2 = 250v_f^2$. $PE_f = mgh_f = 500 × 9.8 × 10 = 49,000$ J. $E_f = 250v_f^2 + 49,000$"
            },
            {
              "step": "Conservation",
              "explanation": "$E_i = E_f$. $196,000 = 250v_f^2 + 49,000$. $250v_f^2 = 147,000$. $v_f^2 = 588$",
              "calculation": "$v_f \\approx 24.2$ m/s"
            },
            {
              "step": "Interpret",
              "explanation": "Lost 30 m of height (40 → 10 m), converting that PE to KE. Speed at 10 m height: ~24 m/s (~87 km/h). If went all the way to ground (h=0), even faster."
            }
          ],
          "final_answer": "$v_f \\approx 24.2$ m/s at top of 10 m hill",
          "concept_applied": "Partial height drop: some PE converts to KE, some remains as PE at new height. $mgh_i = \\frac{1}{2}mv_f^2 + mgh_f$."
        },
        {
          "title": "Finding Minimum Initial Speed",
          "problem": "A skateboarder wants to roll over a 2.5 m high half-pipe. What minimum speed at the bottom is needed to just reach the top? (Ignore friction.)",
          "step_by_step": [
            {
              "step": "Identify states",
              "explanation": "Initial: Bottom (h = 0), speed $v_i$ (unknown minimum). Final: Top (h = 2.5 m), speed $v_f$ (minimum means just barely, so $v_f \\approx 0$)."
            },
            {
              "step": "Initial energy",
              "explanation": "$KE_i = \\frac{1}{2}mv_i^2$ (need to find $v_i$). $PE_i = 0$ (bottom, h = 0). $E_i = \\frac{1}{2}mv_i^2$"
            },
            {
              "step": "Final energy",
              "explanation": "$KE_f \\approx 0$ (just reaches top, $v_f \\approx 0$). $PE_f = mgh_f = mg(2.5)$. $E_f = 2.5mg$"
            },
            {
              "step": "Conservation",
              "explanation": "$E_i = E_f$. $\\frac{1}{2}mv_i^2 = 2.5mg$. Mass cancels: $\\frac{1}{2}v_i^2 = 2.5g = 2.5(9.8) = 24.5$. $v_i^2 = 49$",
              "calculation": "$v_i = 7$ m/s"
            },
            {
              "step": "Interpret",
              "explanation": "Minimum speed at bottom: 7 m/s (~25 km/h). This converts entirely to PE at top (just reaches). Any less: won't make it. Any more: will have KE remaining at top (go over and down other side)."
            }
          ],
          "final_answer": "Minimum speed at bottom: $v_i = 7$ m/s",
          "concept_applied": "Find minimum initial speed: set final KE = 0 (just reaches), all initial KE converts to final PE. $\\frac{1}{2}mv_i^2 = mgh_f$ → $v_i = \\sqrt{2gh_f}$."
        }
      ],
      "image": {
        "src": "images/unit5/mechanical_energy_conservation.png",
        "alt": "Diagram showing roller coaster with energy bar graphs at different points showing KE+PE=constant",
        "caption": "Mechanical energy conservation: $KE + PE = \\text{constant}$. High PE → low KE (top). Low PE → high KE (bottom). Total constant."
      }
    },
    {
      "section_title": "Energy Conservation with Non-Conservative Forces",
      "introduction": "When friction or air resistance are present, mechanical energy is not conserved—it converts to thermal energy (heat). However, total energy (including thermal) is still conserved.",
      "key_concept": {
        "definition": "With non-conservative forces (friction, air resistance, etc.): Mechanical energy decreases, converted to thermal energy (heat): $E_{\\text{mech,i}} = E_{\\text{mech,f}} + E_{\\text{thermal}}$ or $(KE + PE)_i = (KE + PE)_f + Q$ where $Q$ is heat generated. Work-energy including friction: $W_{\\text{non-conservative}} = \\Delta KE + \\Delta PE$ (negative work by friction reduces mechanical energy). Equivalently: $W_{\\text{friction}} = -f \\cdot d = -Q$ (friction work is negative, equals heat generated).",
        "context": "Real-world systems always have some friction/air resistance. Mechanical energy gradually dissipates to heat. Total energy (mechanical + thermal) still conserved, but mechanical energy alone decreases. Must account for energy 'lost' to heat when solving problems."
      },
      "principles": [
        {
          "principle": "Friction Converts Mechanical Energy to Heat",
          "statement": "Friction does negative work (opposes motion), removing mechanical energy: $W_{\\text{friction}} = -fd$. This energy becomes heat: $Q = fd$ (surfaces warm). Mechanical energy lost = heat gained: $\\Delta E_{\\text{mech}} = -Q$.",
          "application": "With friction: mechanical energy decreases by amount of heat generated.",
          "example": "Block slides 5 m on rough surface, friction 20 N: $W_{\\text{friction}} = -20 × 5 = -100$ J (negative work). Mechanical energy decreases by 100 J (block slows, loses KE). Heat generated: 100 J (surfaces warm slightly). Total energy conserved: mechanical loss = thermal gain."
        },
        {
          "principle": "Energy Equation with Friction",
          "statement": "Initial mechanical energy = Final mechanical energy + Heat generated: $E_{\\text{mech,i}} = E_{\\text{mech,f}} + fd$ or $(KE + PE)_i = (KE + PE)_f + fd$ where $f$ is friction force magnitude, $d$ is distance traveled.",
          "application": "Include friction term when setting up energy conservation equation.",
          "example": "Object slides down ramp with friction: $mgh_i + \\frac{1}{2}mv_i^2 = mgh_f + \\frac{1}{2}mv_f^2 + fd$. Some initial energy goes to heat ($fd$ term), not all converts to KE. Final speed lower than frictionless case."
        },
        {
          "principle": "Air Resistance and Terminal Velocity",
          "statement": "Air resistance does negative work, converting mechanical energy to heat in air. Falling with air resistance: PE decreases continuously, but KE stops increasing at terminal velocity (air resistance = weight, forces balanced, no further acceleration). From then on: all PE loss → heat, no KE change. Mechanical energy continuously decreases.",
          "application": "With air resistance, falling object doesn't convert all PE to KE—much becomes heat.",
          "example": "Skydiver falls 1000 m: Without air resistance: $\\Delta PE = mgh$ all converts to KE. With air resistance: $\\Delta PE = \\Delta KE + Q$ where $Q$ is heat from air resistance. At terminal velocity: $\\Delta KE = 0$, so $\\Delta PE = Q$ (all PE → heat in air). Parachute: increases air resistance → more mechanical energy to heat → slower descent, safer landing."
        },
        {
          "principle": "Total Energy Always Conserved",
          "statement": "Even with friction/air resistance: Total energy (mechanical + thermal + sound + deformation + ...) conserved. Mechanical energy not conserved (decreases), but it doesn't disappear—transforms to other forms. Including all forms: $E_{\\text{total,i}} = E_{\\text{total,f}}$ always.",
          "application": "Mechanical energy alone useful when conservative forces only. With dissipation, track where energy goes.",
          "example": "Car crash: Initial KE + PE (if on slope) → Deformation (crumple zones), Heat (friction, metal deforming), Sound (crash noise), Etc. Mechanical energy dramatically reduced. Total energy conserved—all accounted for in various forms. Safety systems designed to maximize deformation/heat, minimize energy delivered to occupants."
        }
      ],
      "worked_examples": [
        {
          "title": "Sliding with Friction",
          "problem": "A 5 kg block slides down a 10 m long ramp (vertical drop 6 m) with kinetic friction coefficient 0.2. It starts from rest. Find its speed at the bottom.",
          "step_by_step": [
            {
              "step": "Initial energy",
              "explanation": "$KE_i = 0$ (starts from rest). $PE_i = mgh = 5 × 9.8 × 6 = 294$ J. $E_{\\text{mech,i}} = 294$ J"
            },
            {
              "step": "Final energy (mechanical)",
              "explanation": "$KE_f = \\frac{1}{2}mv_f^2 = \\frac{1}{2}(5)v_f^2 = 2.5v_f^2$. $PE_f = 0$ (bottom). $E_{\\text{mech,f}} = 2.5v_f^2$"
            },
            {
              "step": "Calculate friction work (heat)",
              "explanation": "Need normal force: On ramp, $F_N = mg\\cos\\theta$. Ramp angle: $\\sin\\theta = 6/10 = 0.6$ → $\\cos\\theta = 0.8$. $F_N = 5 × 9.8 × 0.8 = 39.2$ N. Friction: $f = \\mu_k F_N = 0.2 × 39.2 = 7.84$ N. Distance: 10 m. Heat: $Q = fd = 7.84 × 10 = 78.4$ J"
            },
            {
              "step": "Energy conservation with friction",
              "explanation": "$E_{\\text{mech,i}} = E_{\\text{mech,f}} + Q$. $294 = 2.5v_f^2 + 78.4$. $2.5v_f^2 = 215.6$. $v_f^2 = 86.24$",
              "calculation": "$v_f \\approx 9.29$ m/s"
            },
            {
              "step": "Compare to frictionless",
              "explanation": "Without friction: $mgh = \\frac{1}{2}mv_f^2$ → $v_f = \\sqrt{2gh} = \\sqrt{2 × 9.8 × 6} \\approx 10.8$ m/s. With friction: 9.29 m/s (lower—some energy lost to heat)."
            }
          ],
          "final_answer": "$v_f \\approx 9.29$ m/s",
          "concept_applied": "With friction: Initial PE = Final KE + Heat from friction. Some energy dissipates, reducing final speed compared to frictionless case."
        },
        {
          "title": "Stopping Distance with Friction",
          "problem": "A 1200 kg car traveling at 25 m/s brakes to a stop. The friction force is 8000 N. How far does it travel before stopping?",
          "step_by_step": [
            {
              "step": "Initial mechanical energy",
              "explanation": "$KE_i = \\frac{1}{2}mv^2 = \\frac{1}{2}(1200)(25)^2 = 600 × 625 = 375,000$ J. $PE_i = 0$ (horizontal road, or choose this as reference). $E_{\\text{mech,i}} = 375,000$ J"
            },
            {
              "step": "Final mechanical energy",
              "explanation": "$KE_f = 0$ (stopped). $PE_f = 0$. $E_{\\text{mech,f}} = 0$"
            },
            {
              "step": "Energy to heat",
              "explanation": "All mechanical energy converts to heat via friction: $Q = E_{\\text{mech,i}} - E_{\\text{mech,f}} = 375,000 - 0 = 375,000$ J"
            },
            {
              "step": "Find distance from heat",
              "explanation": "Heat generated: $Q = fd$ where $f = 8000$ N, $d = ?$. $375,000 = 8000 × d$",
              "calculation": "$d = 375,000 / 8000 = 46.875$ m"
            },
            {
              "step": "Verify with work-energy",
              "explanation": "$W_{\\text{friction}} = \\Delta KE$. $-fd = 0 - \\frac{1}{2}mv^2$. $-8000d = -375,000$. $d = 46.875$ m ✓ Same answer."
            }
          ],
          "final_answer": "Stopping distance = 46.875 m",
          "concept_applied": "Stopping: All KE converts to heat via friction. $\\frac{1}{2}mv^2 = fd$ → $d = \\frac{mv^2}{2f}$. Stopping distance ∝ $v^2$ (quadratic speed dependence)."
        },
        {
          "title": "Spring with Friction",
          "problem": "A 2 kg block is pushed against a horizontal spring ($k = 600$ N/m), compressing it 0.3 m, then released. The block slides across a surface with friction coefficient 0.25. How far does the block travel before stopping?",
          "step_by_step": [
            {
              "step": "Initial energy",
              "explanation": "$PE_{s,i} = \\frac{1}{2}kx^2 = \\frac{1}{2}(600)(0.3)^2 = 300 × 0.09 = 27$ J (compressed spring). $KE_i = 0$, $PE_{g,i} = 0$ (horizontal). $E_i = 27$ J"
            },
            {
              "step": "Final state",
              "explanation": "Block stopped at distance $d$ from spring. $KE_f = 0$ (stopped), $PE_{s,f} = 0$ (spring relaxed), $PE_{g,f} = 0$ (horizontal). $E_f = 0$"
            },
            {
              "step": "Energy to heat",
              "explanation": "All initial elastic PE → heat: $Q = 27$ J"
            },
            {
              "step": "Calculate friction force",
              "explanation": "$f = \\mu_k F_N = \\mu_k mg = 0.25 × 2 × 9.8 = 4.9$ N"
            },
            {
              "step": "Find distance",
              "explanation": "$Q = fd$. $27 = 4.9 × d$",
              "calculation": "$d = 27 / 4.9 \\approx 5.51$ m"
            },
            {
              "step": "Interpret",
              "explanation": "Spring's stored 27 J dissipates over 5.51 m of sliding. Friction converts elastic PE to heat, stopping block."
            }
          ],
          "final_answer": "Block travels ~5.51 m before stopping",
          "concept_applied": "Spring releases energy, friction dissipates it: $\\frac{1}{2}kx^2 = fd$. All elastic PE converts to heat over sliding distance."
        }
      ],
      "image": {
        "src": "images/unit5/energy_with_friction.png",
        "alt": "Diagram showing block sliding with energy bars: initial ME decreases, heat increases, total constant",
        "caption": "With friction: Mechanical energy (KE+PE) decreases, heat increases. Total energy conserved: $E_{\\text{mech,i}} = E_{\\text{mech,f}} + Q$"
      }
    },
    {
      "section_title": "Applications and Implications of Energy Conservation",
      "introduction": "Energy conservation is not just a problem-solving tool—it constrains what's possible in nature and underpins countless technologies.",
      "categories": [
        {
          "type": "Impossibility of Perpetual Motion",
          "description": "Energy conservation prohibits perpetual motion machines.",
          "examples": [
            {
              "process": "First kind perpetual motion",
              "explanation": "Machine that produces work without energy input (creates energy from nothing). Violates energy conservation—energy cannot be created. Impossible. Many inventions claimed (overbalanced wheels, self-flowing water, etc.)—all fail. Careful analysis always finds hidden energy input or measurement error."
            },
            {
              "process": "Second kind perpetual motion",
              "explanation": "Machine that converts heat entirely to work with 100% efficiency, or extracts energy from single temperature reservoir. Violates second law of thermodynamics (entropy), not conservation, but also impossible. No heat engine can be 100% efficient—some energy must be 'wasted' as heat to colder reservoir."
            },
            {
              "process": "Why people try",
              "explanation": "Perpetual motion would solve energy crisis—unlimited free energy. Appeals emotionally. But physics doesn't care about desires—conservation law is absolute. Understanding why perpetual motion impossible helps recognize fraudulent claims."
            }
          ]
        },
        {
          "type": "Renewable Energy",
          "description": "Harnessing naturally replenished energy sources.",
          "examples": [
            {
              "process": "Hydroelectric power",
              "explanation": "Sun evaporates water (solar energy → water PE). Rain falls on mountains. Water flows downhill (PE → KE). Dams capture KE, convert to electricity. Renewable because sun continuously adds energy (evaporation). Not perpetual motion—external energy source (sun). Energy from sun → water PE → electrical. Efficient transformation chain."
            },
            {
              "process": "Wind power",
              "explanation": "Sun heats air unevenly (solar energy → thermal energy → pressure differences). Air moves (thermal/pressure → KE of wind). Turbines extract KE (wind KE → rotation → electrical). Renewable—sun continuously drives wind. Energy from sun → wind KE → electrical."
            },
            {
              "process": "Solar panels",
              "explanation": "Direct conversion: solar energy (photons) → electrical energy. Photovoltaic effect: photons excite electrons in semiconductor, creating current. Not 100% efficient (some energy becomes heat), but no moving parts, very reliable. Energy from sun → directly electrical."
            },
            {
              "process": "Why 'renewable' not 'free'",
              "explanation": "Energy itself renewable (sun continuously supplies). But infrastructure costs money and energy to build (panels, turbines, dams). Maintenance required. 'Renewable' means won't run out (like fossil fuels will), not zero cost. Energy conservation: can't get more energy out than available from source (sun, wind, water flow)."
            }
          ]
        },
        {
          "type": "Energy Storage",
          "description": "Converting abundant energy to storable forms for later use.",
          "examples": [
            {
              "process": "Batteries (chemical storage)",
              "explanation": "Convert electrical energy to chemical PE (charging). Store for hours/days/years. Convert back to electrical (discharging). Energy loss in conversions (not 100% efficient), but very portable. Phone battery: electrical (charging) → chemical PE (stored) → electrical (usage)."
            },
            {
              "process": "Pumped hydro storage",
              "explanation": "Use excess electricity to pump water uphill (electrical → gravitational PE). Store water in elevated reservoir. Release when need electricity: water flows down, drives turbines (gravitational PE → electrical). Large-scale grid storage. Typically ~70-80% efficient (some energy lost to friction, heat)."
            },
            {
              "process": "Flywheels (kinetic storage)",
              "explanation": "Spin heavy wheel to high speed using motor (electrical → rotational KE). Store energy as rotation. Extract by using wheel as generator (rotational KE → electrical). Very high power density, but energy drains over time (friction in bearings). Used for short-term, high-power applications."
            },
            {
              "process": "Compressed air",
              "explanation": "Use electricity to compress air (electrical → PE in compressed gas, like spring). Store in tanks/caverns. Release air through turbines to generate electricity (PE → KE → electrical). Energy lost as heat during compression/expansion. ~40-70% efficient."
            }
          ]
        },
        {
          "type": "Efficiency and Energy Quality",
          "description": "Not all energy forms equally useful—transformations involve efficiency.",
          "examples": [
            {
              "process": "Energy quality",
              "explanation": "High-quality energy: Easily converted to useful work (electrical, mechanical KE, chemical PE in fuels). Low-quality energy: Difficult to convert to work (low-temperature heat, dispersed thermal energy). Second law of thermodynamics: Energy transformations tend toward lower quality (more dispersed, less organized). Example: Burning coal: High-quality chemical PE → mix of useful work + low-quality waste heat. Can't fully reverse—can't gather dispersed heat back into concentrated coal."
            },
            {
              "process": "Efficiency limits",
              "explanation": "No real process 100% efficient—some energy always becomes waste heat (unusable low-quality form). Best gasoline engines: ~25-30% efficient (70-75% of fuel energy → waste heat). Power plants: ~33-40% efficient (coal/gas/nuclear heat → electricity). LEDs: ~40-50% efficient (electrical → light; rest is heat). Best case still loses energy to heat. Energy conservation: total energy conserved. But useful energy decreases (quality degrades)."
            },
            {
              "process": "Why efficiency matters",
              "explanation": "Lower efficiency → more fuel/energy input needed for same work output → higher cost, more pollution, faster resource depletion. Improving efficiency: Major engineering goal. Get more useful work from same energy input. Example: LED vs incandescent: Same light output, LEDs use 1/10 energy. 90% energy savings from efficiency improvement."
            }
          ]
        },
        {
          "type": "Biological Energy Systems",
          "description": "Living organisms obey energy conservation.",
          "examples": [
            {
              "process": "Metabolism",
              "explanation": "Food contains chemical PE. Digestion + cellular respiration break molecular bonds, releasing energy. Energy → Powers muscle contraction (mechanical work), maintains body temperature (thermal), biosynthesis (building molecules), nerve signals (electrical). Waste heat exhaled/radiated. Energy in (food) = Energy out (work + heat + waste). Humans ~25% efficient converting food to mechanical work (like engines)—most becomes heat (why you warm when exercising)."
            },
            {
              "process": "Photosynthesis",
              "explanation": "Plants capture solar energy (light). Use it to build glucose from CO₂ + H₂O (chemical PE storage). Overall: Light energy → Chemical PE (glucose). ~3-6% efficient (most sunlight doesn't convert—wrong wavelength, reflection, heat losses). But enough to power all life on Earth. Energy from sun → plant chemical PE → animal food → metabolism → work + heat. All life ultimately solar-powered (except chemosynthetic organisms near thermal vents)."
            },
            {
              "process": "Food chains and energy loss",
              "explanation": "Energy flows through ecosystems: Sun → plants (photosynthesis) → herbivores (eating) → carnivores. Each transfer: ~90% energy lost as heat (metabolism inefficiency). Only ~10% passes to next level. This is why: Food chains rarely exceed 4-5 levels (not enough energy left). Carnivores rarer than herbivores. Eating plants more energy-efficient for humans than eating meat (fewer transfers). Energy conservation governs ecosystem structure."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit5/energy_conservation_applications.png",
        "alt": "Illustrations showing perpetual motion X (impossible), renewable energy ✓, efficiency <100%, biological systems",
        "caption": "Energy conservation implications: Perpetual motion impossible. Renewable energy possible (external source). Efficiency <100% always. Biology obeys conservation."
      }
    }
  ],
  "key_terms": [
    "Conservation of energy",
    "$E_{\\text{total,i}} = E_{\\text{total,f}}$",
    "Mechanical energy",
    "$E_{\\text{mech}} = KE + PE$",
    "Isolated system",
    "Conservative forces",
    "Non-conservative forces",
    "Energy transformation",
    "Heat (thermal energy)",
    "Efficiency",
    "Perpetual motion",
    "Dissipative forces"
  ],
  "summary": "Conservation of Energy: Universal principle stating total energy in isolated system remains constant. Energy cannot be created or destroyed—only transformed between forms: $E_{\\text{total,initial}} = E_{\\text{total,final}}$. Applies everywhere: mechanics, thermodynamics, electromagnetism, quantum mechanics, cosmology. No exceptions ever observed. For mechanical systems with only conservative forces (gravity, springs, no friction): Mechanical energy conserved: $KE + PE = \\text{constant}$ or $\\frac{1}{2}mv_i^2 + mgh_i = \\frac{1}{2}mv_f^2 + mgh_f$ (gravitational) or $\\frac{1}{2}mv_i^2 + \\frac{1}{2}kx_i^2 = \\frac{1}{2}mv_f^2 + \\frac{1}{2}kx_f^2$ (elastic). Energy transformations in conservative systems: Rising → KE converts to PE (slows down). Falling → PE converts to KE (speeds up). Pendulum/roller coaster: KE ↔ PE continuously, total constant. Problem-solving with energy conservation: (1) Identify initial/final states. (2) Calculate initial energy: $E_i = KE_i + PE_i$. (3) Calculate final energy: $E_f = KE_f + PE_f$ (may contain unknowns). (4) Set $E_i = E_f$. (5) Solve. Much simpler than force analysis for many problems—no need to track accelerations, works for complex paths, varying forces. With non-conservative forces (friction, air resistance): Mechanical energy NOT conserved—decreases, converted to heat: $E_{\\text{mech,i}} = E_{\\text{mech,f}} + Q$ where $Q = fd$ is heat from friction over distance $d$. Total energy (mechanical + thermal) still conserved: mechanical loss = thermal gain. Applications: (1) Perpetual motion impossible—would create energy from nothing, violates conservation. (2) Renewable energy—harness naturally replenished sources (solar, wind, hydro). Sun continuously supplies energy; not perpetual motion (external source). (3) Energy storage—convert abundant energy to storable forms (batteries, pumped hydro, flywheels) for later use. Efficiency <100% always—some energy becomes unusable heat. (4) Biological systems—metabolism converts food chemical PE to work + heat. Photosynthesis stores solar energy as chemical PE. Food chains limited by energy loss (~90% per level). Energy conservation is fundamental constraint on nature and technology. Explains why certain processes impossible (perpetual motion), others inevitable (energy dissipation to heat), and provides powerful problem-solving tool (initial energy = final energy, bypass complex force tracking). Next sections build on this foundation to explore power (energy per time) and machines (energy transformation devices)."
}
