{
  "expanded_description": "Energy is the capacity to do work or cause change. Kinetic energy is the energy of motion—energy possessed by any moving object. Understanding kinetic energy and its relationship to work provides a powerful alternative to force-based analysis for solving mechanics problems.",
  "core_concept": {
    "principle": "Kinetic energy (KE) is the energy an object possesses due to its motion, calculated as $KE = \\frac{1}{2}mv^2$ where $m$ is mass (kg) and $v$ is speed (m/s). Kinetic energy is measured in joules (J), the same unit as work. The work-energy theorem states: Net work done on an object equals its change in kinetic energy: $W_{\\text{net}} = \\Delta KE = KE_f - KE_i$.",
    "explanation": "Energy is one of physics' most fundamental concepts—it appears in every branch of physics and is conserved (total energy cannot be created or destroyed, only transformed). Energy exists in many forms: kinetic (motion), potential (position/configuration), thermal (heat), chemical (molecular bonds), nuclear (atomic nuclei), electromagnetic (light, radiation). All forms can transform into others, but total energy remains constant. Kinetic energy specifically is the energy of motion. Any moving object—car, molecule, planet, electron—has kinetic energy. The faster it moves or the more massive it is, the more kinetic energy it has. Formula $KE = \\frac{1}{2}mv^2$ shows: (1) Kinetic energy proportional to mass—doubling mass doubles KE (linear relationship). (2) Kinetic energy proportional to velocity squared—doubling speed quadruples KE (quadratic relationship). This $v^2$ dependence is crucial: high-speed collisions are far more destructive than low-speed ones because kinetic energy increases dramatically with speed. The work-energy theorem connects work (energy transfer via force) to kinetic energy change. When net work is done on object, its kinetic energy changes by exactly that amount. This provides alternative problem-solving approach: Instead of tracking forces and accelerations through motion (Newton's Second Law), can analyze initial and final energies using work-energy theorem. Often simpler, especially when forces vary or path is complex. Example: To find how far car takes to stop, can either (1) use kinematics with acceleration from braking force (Newton's approach), or (2) use work-energy: braking work must equal initial kinetic energy (energy approach—often easier). Kinetic energy is scalar (no direction), always positive or zero (never negative—$v^2$ is always positive), and tells how much work object can do as it stops (how much force × distance needed to bring it to rest).",
    "image": {
      "src": "images/unit5/kinetic_energy_concept.png",
      "alt": "Diagram showing moving objects with velocity vectors and KE formula, plus work-energy relationship",
      "caption": "Kinetic energy: Energy of motion, $KE = \\frac{1}{2}mv^2$ (joules). Work-energy theorem: $W_{\\text{net}} = \\Delta KE$"
    }
  },
  "sections": [
    {
      "section_title": "Understanding Energy",
      "introduction": "Energy is a fundamental concept describing the capacity to cause change or do work. It takes many forms but is always conserved.",
      "key_concept": {
        "definition": "Energy is the capacity to do work or produce change. It's a scalar quantity measured in joules (J). Energy exists in various forms (kinetic, potential, thermal, chemical, etc.) and can transform between forms, but total energy in isolated system remains constant (conservation of energy).",
        "context": "Energy is abstract—can't see or touch it directly—but its effects are everywhere. Moving car has kinetic energy (can do work in collision). Lifted object has gravitational potential energy (can do work falling). Compressed spring has elastic potential energy (can do work expanding). Gasoline has chemical energy (can do work when burned in engine). Energy is currency of physics—tracks what's possible and what's conserved."
      },
      "principles": [
        {
          "principle": "Energy Is the Capacity to Do Work",
          "statement": "Object with energy can exert force over distance, doing work. The more energy an object has, the more work it can do as it releases that energy.",
          "application": "Energy quantifies potential for causing change.",
          "example": "Moving car (kinetic energy): Can do work crumpling metal in collision, pushing another car, compressing barrier. Amount of work car can do = its kinetic energy. Lifted weight (potential energy): Can do work falling—lifting other objects via pulley, driving pile into ground. Amount of work weight can do = gravitational potential energy (mgh)."
        },
        {
          "principle": "Energy Is Conserved",
          "statement": "In isolated system (no external forces, no energy entering or leaving), total energy remains constant. Energy transforms between forms but never created or destroyed: $E_{\\text{total,initial}} = E_{\\text{total,final}}$",
          "application": "Most powerful principle in physics—enables solving problems by tracking energy rather than forces.",
          "example": "Ball thrown upward: Initial kinetic energy → gradually converts to potential energy as rises → at peak, all potential energy (KE = 0) → converts back to kinetic as falls. Total energy (KE + PE) constant throughout (ignoring air resistance). Pendulum: Kinetic ↔ potential energy back and forth, total constant."
        },
        {
          "principle": "Energy Is Scalar",
          "statement": "Unlike force or velocity (vectors with direction), energy is scalar—just a number (with units). Energy doesn't point anywhere, has no direction. Can simply add energies algebraically.",
          "application": "Simplifies calculations—no vector components, just add/subtract numbers.",
          "example": "Object has 100 J kinetic energy moving north, then 100 J moving east. Total kinetic energy: 100 + 100 = 200 J (simple addition). If it were momentum (vector): directions would matter, couldn't just add. Energy is simpler."
        },
        {
          "principle": "Many Forms of Energy",
          "statement": "Energy appears in multiple forms: kinetic (motion), potential (position—gravitational, elastic, etc.), thermal (heat), chemical (bonds), nuclear (atomic), electromagnetic (light), etc. All measured in joules, all can transform into other forms.",
          "application": "Recognize different energy forms in situations, track transformations.",
          "example": "Hydroelectric dam: Potential energy (elevated water) → kinetic energy (falling water) → kinetic energy (spinning turbine) → electrical energy (generator) → light/heat (your home). Multiple transformations, total energy conserved (minus losses to heat from friction, inefficiency)."
        },
        {
          "principle": "Units of Energy: Joules",
          "statement": "SI unit of energy is joule (J): 1 J = 1 N·m = 1 kg·m²/s². Same unit as work (work and energy are equivalent—work is energy transfer). Other units: calorie (nutrition, 1 cal = 4.184 J), kilowatt-hour (electricity, 1 kWh = 3.6 × 10⁶ J), electronvolt (atomic physics).",
          "application": "Use joules for mechanical energy calculations.",
          "example": "Lifting 1 kg object 1 meter: $W = mgh = 1 × 9.8 × 1 = 9.8$ J. Object gains 9.8 J of gravitational potential energy. Running 100 m sprint: person might expend ~1000 J of kinetic energy. Light bulb (100 W) for 1 hour: consumes 100 J/s × 3600 s = 360,000 J = 0.1 kWh."
        }
      ],
      "image": {
        "src": "images/unit5/energy_forms.png",
        "alt": "Diagram showing different energy forms with examples and transformation arrows",
        "caption": "Energy forms: Kinetic (motion), Potential (position), Thermal (heat), Chemical (bonds), etc. All measured in joules, can transform between forms."
      }
    },
    {
      "section_title": "Kinetic Energy: Energy of Motion",
      "introduction": "Kinetic energy is the energy possessed by any moving object. It depends on both mass and velocity.",
      "key_concept": {
        "definition": "Kinetic energy (KE) is the energy of motion: $KE = \\frac{1}{2}mv^2$ where $m$ is mass (kg) and $v$ is speed (m/s). Kinetic energy measured in joules (J). It's always positive or zero (since $v^2 \\geq 0$), and represents how much work object can do via its motion.",
        "context": "Every moving object has kinetic energy—from molecules vibrating in materials to galaxies rotating in space. Kinetic energy determines collision damage, stopping distance, momentum effects, and energy available from moving systems."
      },
      "principles": [
        {
          "principle": "Kinetic Energy Formula",
          "statement": "For object with mass $m$ moving at speed $v$: $KE = \\frac{1}{2}mv^2$. The factor $\\frac{1}{2}$ comes from integration of force over distance (derived using calculus or work-energy theorem).",
          "application": "Calculate kinetic energy from mass and speed.",
          "example": "Car (mass 1200 kg) traveling at 20 m/s: $KE = \\frac{1}{2} × 1200 × 20^2 = \\frac{1}{2} × 1200 × 400 = 240,000$ J = 240 kJ. Ball (mass 0.5 kg) thrown at 15 m/s: $KE = \\frac{1}{2} × 0.5 × 15^2 = \\frac{1}{2} × 0.5 × 225 = 56.25$ J."
        },
        {
          "principle": "KE Depends Linearly on Mass",
          "statement": "Kinetic energy proportional to mass: double mass → double KE (if same speed). $KE \\propto m$ (linear relationship).",
          "application": "Heavier objects at same speed have proportionally more kinetic energy.",
          "example": "Comparing objects at 10 m/s: 5 kg object: $KE = \\frac{1}{2} × 5 × 10^2 = 250$ J. 10 kg object (double mass): $KE = \\frac{1}{2} × 10 × 10^2 = 500$ J (double KE). 20 kg object (4× mass): $KE = \\frac{1}{2} × 20 × 10^2 = 1000$ J (4× KE). Linear relationship."
        },
        {
          "principle": "KE Depends Quadratically on Speed",
          "statement": "Kinetic energy proportional to velocity squared: double speed → quadruple KE. Triple speed → nine times KE. $KE \\propto v^2$ (quadratic relationship). This makes high speeds far more dangerous.",
          "application": "Small speed increases cause large KE increases. Critical for safety considerations.",
          "example": "Car (1000 kg) at different speeds: 10 m/s (36 km/h): $KE = \\frac{1}{2} × 1000 × 10^2 = 50,000$ J = 50 kJ. 20 m/s (72 km/h, double speed): $KE = \\frac{1}{2} × 1000 × 20^2 = 200,000$ J = 200 kJ (4× KE). 30 m/s (108 km/h, triple speed): $KE = \\frac{1}{2} × 1000 × 30^2 = 450,000$ J = 450 kJ (9× KE). Doubling speed from 50 to 100 km/h quadruples collision energy—why high-speed crashes so much more severe."
        },
        {
          "principle": "KE Is Always Positive or Zero",
          "statement": "Since $v^2$ is always positive (squaring eliminates sign), kinetic energy always positive or zero. Never negative. Zero only when $v = 0$ (object at rest).",
          "application": "Direction doesn't matter for KE—only speed magnitude.",
          "example": "Object moving at 10 m/s north: $KE = \\frac{1}{2}mv^2$ (positive). Same object at 10 m/s south: $KE = \\frac{1}{2}mv^2$ (same KE—direction irrelevant). Object at rest: $v = 0$, $KE = 0$. Kinetic energy cares about how fast, not which direction."
        },
        {
          "principle": "KE Represents 'Work Capacity'",
          "statement": "Object's kinetic energy equals the work it could do in coming to rest (work done by object on whatever stops it, or work needed to stop it).",
          "application": "Higher KE → more work to stop → longer stopping distance or larger force needed.",
          "example": "Car with 200 kJ kinetic energy: Must do 200 kJ of work to stop (via brakes, friction). If braking force is 5000 N: stopping distance $d = W/F = 200,000/5000 = 40$ m. Double the initial speed (4× KE = 800 kJ): stopping distance = 800,000/5000 = 160 m (4× longer—quadratic dependence on speed)."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Kinetic Energy",
          "problem": "A 1500 kg car travels at 25 m/s. Calculate its kinetic energy.",
          "step_by_step": [
            {
              "step": "Identify given values",
              "explanation": "Mass: $m = 1500$ kg. Speed: $v = 25$ m/s"
            },
            {
              "step": "Apply kinetic energy formula",
              "explanation": "$KE = \\frac{1}{2}mv^2 = \\frac{1}{2} × 1500 × 25^2$"
            },
            {
              "step": "Calculate",
              "explanation": "$25^2 = 625$. $KE = \\frac{1}{2} × 1500 × 625 = 750 × 625$",
              "calculation": "$KE = 468,750$ J = 468.75 kJ"
            },
            {
              "step": "Interpret",
              "explanation": "Car has 469 kJ of kinetic energy. This energy must be dissipated (via brakes, air resistance) to stop car. Represents car's capacity to do work in collision or braking."
            }
          ],
          "final_answer": "$KE = 469$ kJ",
          "concept_applied": "Kinetic energy: $KE = \\frac{1}{2}mv^2$. Larger mass or higher speed increases KE. Units: kg × (m/s)² = kg·m²/s² = J."
        },
        {
          "title": "Comparing Kinetic Energies",
          "problem": "Compare kinetic energies of: (a) 2 kg object at 6 m/s, (b) 4 kg object at 6 m/s, (c) 2 kg object at 12 m/s.",
          "step_by_step": [
            {
              "step": "(a) 2 kg at 6 m/s",
              "explanation": "$KE_a = \\frac{1}{2} × 2 × 6^2 = 1 × 36$",
              "calculation": "$KE_a = 36$ J"
            },
            {
              "step": "(b) 4 kg at 6 m/s",
              "explanation": "$KE_b = \\frac{1}{2} × 4 × 6^2 = 2 × 36$",
              "calculation": "$KE_b = 72$ J"
            },
            {
              "step": "(c) 2 kg at 12 m/s",
              "explanation": "$KE_c = \\frac{1}{2} × 2 × 12^2 = 1 × 144$",
              "calculation": "$KE_c = 144$ J"
            },
            {
              "step": "Compare",
              "explanation": "(b) vs (a): Double mass (4 vs 2 kg), same speed → double KE (72 vs 36 J). Linear relationship with mass ✓. (c) vs (a): Same mass, double speed (12 vs 6 m/s) → quadruple KE (144 vs 36 J). Quadratic relationship with speed ($v^2$ dependence) ✓. Speed has stronger effect than mass on KE."
            }
          ],
          "final_answer": "(a) 36 J, (b) 72 J (double mass → double KE), (c) 144 J (double speed → 4× KE)",
          "concept_applied": "KE ∝ m (linear) and KE ∝ v² (quadratic). Doubling speed has larger effect than doubling mass."
        },
        {
          "title": "Finding Speed from Kinetic Energy",
          "problem": "A 0.5 kg ball has kinetic energy 12.5 J. What is its speed?",
          "step_by_step": [
            {
              "step": "Write KE formula",
              "explanation": "$KE = \\frac{1}{2}mv^2$. Know: $KE = 12.5$ J, $m = 0.5$ kg. Need: $v$"
            },
            {
              "step": "Rearrange for speed",
              "explanation": "$v^2 = \\frac{2 \\times KE}{m}$. $v = \\sqrt{\\frac{2 \\times KE}{m}}$"
            },
            {
              "step": "Substitute values",
              "explanation": "$v = \\sqrt{\\frac{2 × 12.5}{0.5}} = \\sqrt{\\frac{25}{0.5}} = \\sqrt{50}$",
              "calculation": "$v \\approx 7.07$ m/s"
            },
            {
              "step": "Check",
              "explanation": "Verify: $KE = \\frac{1}{2} × 0.5 × 7.07^2 \\approx \\frac{1}{2} × 0.5 × 50 = 12.5$ J ✓"
            }
          ],
          "final_answer": "$v \\approx 7.07$ m/s",
          "concept_applied": "From KE, find speed: $v = \\sqrt{\\frac{2KE}{m}}$. Rearrange KE formula to solve for desired variable."
        },
        {
          "title": "Kinetic Energy in Collisions",
          "problem": "Two cars: Car A (1000 kg, 15 m/s), Car B (1500 kg, 10 m/s). Which has more kinetic energy?",
          "step_by_step": [
            {
              "step": "Calculate Car A kinetic energy",
              "explanation": "$KE_A = \\frac{1}{2} × 1000 × 15^2 = 500 × 225$",
              "calculation": "$KE_A = 112,500$ J = 112.5 kJ"
            },
            {
              "step": "Calculate Car B kinetic energy",
              "explanation": "$KE_B = \\frac{1}{2} × 1500 × 10^2 = 750 × 100$",
              "calculation": "$KE_B = 75,000$ J = 75 kJ"
            },
            {
              "step": "Compare",
              "explanation": "Car A: 112.5 kJ. Car B: 75 kJ. Car A has more kinetic energy (50% more) despite being lighter. Why? Car A faster: $v^2$ dependence outweighs mass difference. Speed's quadratic effect dominates."
            }
          ],
          "final_answer": "Car A has more KE (112.5 kJ vs 75 kJ). Faster speed compensates for lower mass.",
          "concept_applied": "KE depends on both mass and speed, but $v^2$ term makes speed very influential. Faster light object can have more KE than slower heavy object."
        }
      ],
      "image": {
        "src": "images/unit5/kinetic_energy_formula.png",
        "alt": "Diagram showing KE formula with examples at different masses and speeds",
        "caption": "Kinetic energy: $KE = \\frac{1}{2}mv^2$. Doubles with mass, quadruples with doubled speed. Always positive, measured in joules."
      }
    },
    {
      "section_title": "The Work-Energy Theorem",
      "introduction": "The work-energy theorem connects work (force × distance) to kinetic energy change, providing a powerful tool for analyzing motion without tracking forces at every instant.",
      "key_concept": {
        "definition": "Work-Energy Theorem: The net work done on an object equals the change in its kinetic energy: $W_{\\text{net}} = \\Delta KE = KE_f - KE_i = \\frac{1}{2}mv_f^2 - \\frac{1}{2}mv_i^2$ where $v_i$ is initial speed and $v_f$ is final speed. This holds for any path and any forces (constant or varying).",
        "context": "This theorem is derived from Newton's Second Law but provides alternative problem-solving approach. Instead of analyzing forces and accelerations throughout motion (Newton's approach requiring calculus for varying forces), can analyze initial and final states using energy (often much simpler)."
      },
      "principles": [
        {
          "principle": "Net Work Equals Kinetic Energy Change",
          "statement": "When net work $W_{\\text{net}}$ done on object: If $W_{\\text{net}} > 0$ (positive): KE increases, object speeds up. If $W_{\\text{net}} < 0$ (negative): KE decreases, object slows down. If $W_{\\text{net}} = 0$: KE unchanged, speed constant.",
          "application": "Calculate net work from all forces, equals change in kinetic energy.",
          "example": "Car accelerating: Engine does positive work, friction/air resistance do negative work. If net work = +50 kJ, car's KE increases by 50 kJ (speeds up). Car braking: Brakes do negative work (no positive work if coasting). If net work = -80 kJ, car's KE decreases by 80 kJ (slows down)."
        },
        {
          "principle": "Deriving Speed Change from Work",
          "statement": "From work-energy theorem: $W_{\\text{net}} = \\frac{1}{2}m(v_f^2 - v_i^2)$. Can solve for final speed: $v_f = \\sqrt{v_i^2 + \\frac{2W_{\\text{net}}}{m}}$",
          "application": "Find final speed from initial speed and net work (or vice versa) without knowing forces or time details.",
          "example": "Object (5 kg) initially at 10 m/s. Net work of 150 J done on it. Final speed: $v_f = \\sqrt{10^2 + \\frac{2 × 150}{5}} = \\sqrt{100 + 60} = \\sqrt{160} \\approx 12.6$ m/s. Speeds up from 10 to 12.6 m/s."
        },
        {
          "principle": "Work-Energy vs Force-Acceleration Approach",
          "statement": "Newton's Second Law approach: Track forces → find acceleration → integrate to get velocity/position (requires calculus for varying forces). Work-Energy approach: Calculate work done → find KE change → directly get final speed. Often simpler, especially for complex force situations.",
          "application": "Use work-energy when interested in speeds, not detailed trajectory. Ideal for variable forces.",
          "example": "Spring launching ball: Force varies with compression ($F = kx$). Newton approach: complex (varying force). Work-energy approach: Work by spring = $\\frac{1}{2}kx^2$ = ball's final KE → directly find launch speed. Much simpler!"
        },
        {
          "principle": "Work-Energy for Stopping Distance",
          "statement": "To stop moving object: must do negative work equal to its kinetic energy. $W_{\\text{stop}} = -KE_i$. If constant braking force $F$: stopping distance $d = \\frac{KE_i}{F} = \\frac{mv_i^2}{2F}$",
          "application": "Predict stopping distance from speed and braking force.",
          "example": "Car (1200 kg) at 20 m/s. Braking force 6000 N. Kinetic energy: $KE = \\frac{1}{2} × 1200 × 20^2 = 240,000$ J. Work to stop = -240,000 J. Stopping distance: $d = 240,000/6000 = 40$ m. If speed doubles to 40 m/s: $KE = 4 × 240,000 = 960,000$ J → $d = 960,000/6000 = 160$ m. Four times farther (speed squared relationship)."
        }
      ],
      "worked_examples": [
        {
          "title": "Applying Work-Energy Theorem",
          "problem": "A 2 kg object initially at rest is pushed by a net force doing 50 J of work. What is its final speed?",
          "step_by_step": [
            {
              "step": "Identify initial and final states",
              "explanation": "Initial: at rest, $v_i = 0$, $KE_i = 0$. Final: $v_f = ?$, $KE_f = ?$. Net work: $W_{\\text{net}} = 50$ J"
            },
            {
              "step": "Apply work-energy theorem",
              "explanation": "$W_{\\text{net}} = \\Delta KE = KE_f - KE_i$. $50 = KE_f - 0$",
              "calculation": "$KE_f = 50$ J"
            },
            {
              "step": "Find final speed from KE",
              "explanation": "$KE_f = \\frac{1}{2}mv_f^2$. $50 = \\frac{1}{2} × 2 × v_f^2$. $50 = v_f^2$",
              "calculation": "$v_f = \\sqrt{50} \\approx 7.07$ m/s"
            }
          ],
          "final_answer": "$v_f \\approx 7.07$ m/s",
          "concept_applied": "Work-energy theorem: net work equals KE gain. Started from rest (KE = 0), 50 J work → 50 J final KE → find speed from KE."
        },
        {
          "title": "Finding Work from Speed Change",
          "problem": "A 10 kg object slows from 8 m/s to 3 m/s. How much work was done on it?",
          "step_by_step": [
            {
              "step": "Calculate initial kinetic energy",
              "explanation": "$KE_i = \\frac{1}{2}mv_i^2 = \\frac{1}{2} × 10 × 8^2 = 5 × 64$",
              "calculation": "$KE_i = 320$ J"
            },
            {
              "step": "Calculate final kinetic energy",
              "explanation": "$KE_f = \\frac{1}{2}mv_f^2 = \\frac{1}{2} × 10 × 3^2 = 5 × 9$",
              "calculation": "$KE_f = 45$ J"
            },
            {
              "step": "Apply work-energy theorem",
              "explanation": "$W_{\\text{net}} = \\Delta KE = KE_f - KE_i = 45 - 320$",
              "calculation": "$W_{\\text{net}} = -275$ J"
            },
            {
              "step": "Interpret",
              "explanation": "Negative work (energy removed from object). Object slowed down, lost 275 J of kinetic energy. This energy converted to heat via friction, absorbed by brakes, etc."
            }
          ],
          "final_answer": "$W_{\\text{net}} = -275$ J (negative—object lost energy)",
          "concept_applied": "Work-energy: $W_{\\text{net}} = \\Delta KE$. Slowing down → KE decreases → negative work done on object."
        },
        {
          "title": "Stopping Distance Problem",
          "problem": "A 1500 kg car travels at 30 m/s. Brakes provide 12,000 N friction force. Find stopping distance.",
          "step_by_step": [
            {
              "step": "Calculate initial kinetic energy",
              "explanation": "$KE_i = \\frac{1}{2} × 1500 × 30^2 = 750 × 900$",
              "calculation": "$KE_i = 675,000$ J = 675 kJ"
            },
            {
              "step": "Recognize work needed to stop",
              "explanation": "To stop: final KE = 0. Work needed: $W = KE_f - KE_i = 0 - 675,000 = -675,000$ J. Friction does this negative work."
            },
            {
              "step": "Relate work to distance",
              "explanation": "Work by friction: $W = -Fd$ (negative because opposes motion). $-675,000 = -12,000 × d$"
            },
            {
              "step": "Solve for distance",
              "explanation": "$d = \\frac{675,000}{12,000}$",
              "calculation": "$d = 56.25$ m"
            },
            {
              "step": "Verify with $v^2$ dependence",
              "explanation": "Double initial speed to 60 m/s → 4× initial KE → 4× stopping distance = 225 m. Stopping distance ∝ $v^2$ (why speed limits matter for safety)."
            }
          ],
          "final_answer": "Stopping distance = 56.25 m",
          "concept_applied": "Work-energy: work to stop = initial KE. With constant friction force: $d = KE/F$. Higher speed → much longer stopping distance ($v^2$ relationship)."
        },
        {
          "title": "Combining Forces Using Work-Energy",
          "problem": "A 5 kg box is pushed 10 m across a floor. Applied force is 40 N, friction is 15 N. Both horizontal. Find final speed if starts from rest.",
          "step_by_step": [
            {
              "step": "Calculate work by each force",
              "explanation": "Applied force: $W_1 = 40 × 10 = 400$ J (positive, in motion direction). Friction: $W_2 = -15 × 10 = -150$ J (negative, opposes motion)."
            },
            {
              "step": "Find net work",
              "explanation": "$W_{\\text{net}} = W_1 + W_2 = 400 + (-150)$",
              "calculation": "$W_{\\text{net}} = 250$ J"
            },
            {
              "step": "Apply work-energy theorem",
              "explanation": "Initial KE: 0 (starts from rest). $W_{\\text{net}} = \\Delta KE = KE_f - 0$. $250 = KE_f$"
            },
            {
              "step": "Find final speed",
              "explanation": "$KE_f = \\frac{1}{2}mv_f^2$. $250 = \\frac{1}{2} × 5 × v_f^2$. $250 = 2.5 v_f^2$. $v_f^2 = 100$",
              "calculation": "$v_f = 10$ m/s"
            }
          ],
          "final_answer": "$v_f = 10$ m/s",
          "concept_applied": "Work-energy with multiple forces: calculate net work (sum with signs), equals KE change. Avoids needing to find acceleration and use kinematics."
        }
      ],
      "image": {
        "src": "images/unit5/work_energy_theorem.png",
        "alt": "Diagram showing object speeding up with positive work and slowing down with negative work, with equations",
        "caption": "Work-Energy Theorem: $W_{\\text{net}} = \\Delta KE$. Positive work → speeds up. Negative work → slows down. Zero work → constant speed."
      }
    },
    {
      "section_title": "Applications of Kinetic Energy and Work-Energy Theorem",
      "introduction": "Understanding kinetic energy and the work-energy relationship explains many real-world phenomena and enables practical problem-solving.",
      "categories": [
        {
          "type": "Vehicle Safety and Collisions",
          "description": "Kinetic energy determines collision severity and safety requirements.",
          "examples": [
            {
              "process": "Crash energy and speed limits",
              "explanation": "Vehicle kinetic energy ∝ $v^2$. Doubling speed quadruples collision energy. This is why speed limits exist and why high-speed crashes are so dangerous. Example: Car at 50 km/h vs 100 km/h (double speed): 4× kinetic energy in collision → 4× damage potential → much higher injury/fatality risk. Speed limit reductions in residential areas (50 → 30 km/h): Reduces KE by factor of $(50/30)^2 = 2.78$ → significantly safer for pedestrians."
            },
            {
              "process": "Crumple zones and airbags",
              "explanation": "In crash, vehicle's KE must be dissipated (converted to other forms—deformation, heat). Work-energy: $W_{\\text{stopping}} = -KE$. Crumple zones: Increase stopping distance → reduce average force ($W = Fd$, larger $d$ means smaller $F$ for same work). Airbags: Extend stopping time and distance for occupant → reduce peak force on body. Both use work-energy principle: same KE to dissipate, longer distance/time → smaller forces → reduced injury."
            },
            {
              "process": "Stopping distance vs speed",
              "explanation": "Braking work must equal KE: $Fd = \\frac{1}{2}mv^2$. Stopping distance: $d = \\frac{mv^2}{2F}$. Distance ∝ $v^2$ (quadratic). Double speed → 4× stopping distance (why tailgating at high speed extremely dangerous). Triple speed → 9× stopping distance. This is fundamental physics constraint—no amount of technology changes $v^2$ dependence (though can increase braking force $F$ to reduce distance somewhat)."
            }
          ]
        },
        {
          "type": "Sports and Athletics",
          "description": "Athletes manipulate kinetic energy to optimize performance.",
          "examples": [
            {
              "process": "Running and sprinting",
              "explanation": "Sprinter accelerates from blocks: Muscles do work pushing against blocks/ground → Work converts to kinetic energy → Runner speeds up. Maximum speed determined by how much work muscles can do. Kinetic energy at top speed = total work done accelerating. Fatigue limits work capacity → limits achievable KE → limits speed."
            },
            {
              "process": "Jumping",
              "explanation": "Vertical jump: Legs do work extending (force over distance during push-off) → Converts to kinetic energy at takeoff. Higher takeoff KE → higher maximum height reached (KE converts to potential energy). Long jump/high jump: Maximize horizontal/vertical KE at takeoff through technique optimizing work done by muscles."
            },
            {
              "process": "Ball sports",
              "explanation": "Throwing/kicking: Arm/leg does work on ball → Ball gains KE → Leaves hand/foot with velocity. Harder throw = more work done = more KE = higher ball speed. Catching: Ball's KE absorbed → Negative work done by hands over catching distance → Reduces peak force (extend arms, 'soft hands' increases distance → lower force for same work)."
            }
          ]
        },
        {
          "type": "Renewable Energy",
          "description": "Harnessing kinetic energy from natural sources.",
          "examples": [
            {
              "process": "Wind turbines",
              "explanation": "Moving air has kinetic energy: $KE = \\frac{1}{2}m_{\\text{air}}v_{\\text{wind}}^2$. Wind turbine blades extract some of this KE (do work on turbine) → Rotates generator → Electrical energy. Power extracted ∝ $v_{\\text{wind}}^3$ (kinetic energy flux—energy per time through area ∝ $v^3$). Double wind speed → 8× power (why turbines need minimum wind speed, why high-wind locations valuable)."
            },
            {
              "process": "Hydroelectric power",
              "explanation": "Falling water has kinetic energy (converted from gravitational potential energy). Water's KE at bottom of dam → Does work on turbine blades → Spins generator → Electricity. Power = energy per time = rate of KE delivery = $\\frac{1}{2}(dm/dt)v^2$ where $dm/dt$ is mass flow rate."
            },
            {
              "process": "Tidal energy",
              "explanation": "Ocean tides create moving water (kinetic energy from lunar/solar gravitational potential). Tidal turbines extract KE from flowing water (like underwater wind turbines). Emerging technology harnessing Moon's gravitational work on Earth's oceans."
            }
          ]
        },
        {
          "type": "Everyday Examples",
          "description": "Kinetic energy in daily life.",
          "examples": [
            {
              "process": "Hammering nails",
              "explanation": "Swing hammer: Muscles do work accelerating hammer → Hammer gains KE. Impact: Hammer's KE does work on nail (drives it into wood) → KE converts to work deforming wood, heat. Heavier hammer or faster swing → more KE → nail driven farther per strike."
            },
            {
              "process": "Throwing objects",
              "explanation": "Throw ball: Arm does work over throwing distance → Ball gains KE, leaves hand with velocity. Catch ball: Ball's KE must be absorbed → Hands do negative work (over catching distance) → KE converts to heat, sound, slight deformation. Catching distance too short → high force → painful (why 'give' with throw, don't rigidly stop it)."
            },
            {
              "process": "Sliding on ice",
              "explanation": "Push off, slide: Initial KE from push-off work. Sliding on ice: Very low friction → small negative work → KE decreases slowly → slide far. Sliding on rough ground: High friction → large negative work → KE decreases quickly → stop soon. Same initial KE, different friction determines slide distance via work-energy."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit5/ke_applications.png",
        "alt": "Collage showing crash testing, athlete jumping, wind turbine, hammer hitting nail",
        "caption": "KE applications: Crashes (KE determines damage), Sports (optimize KE), Wind power (harvest KE), Tools (KE does work)"
      }
    }
  ],
  "key_terms": [
    "Energy",
    "Kinetic energy",
    "$KE = \\frac{1}{2}mv^2$",
    "Joule (J)",
    "Work-energy theorem",
    "$W_{\\text{net}} = \\Delta KE$",
    "Energy conservation",
    "Scalar quantity",
    "Energy transformation",
    "Stopping distance",
    "Speed squared dependence"
  ],
  "summary": "Energy is the capacity to do work or cause change, conserved in isolated systems (cannot be created or destroyed, only transformed). Measured in joules (J), same unit as work. Energy exists in many forms: kinetic (motion), potential (position), thermal, chemical, etc. Kinetic energy (KE) is energy of motion: $KE = \\frac{1}{2}mv^2$ where $m$ is mass (kg) and $v$ is speed (m/s). Key characteristics: (1) Always positive or zero (since $v^2 \\geq 0$), never negative. (2) Scalar—no direction, just magnitude. (3) Depends linearly on mass (double mass → double KE at same speed). (4) Depends quadratically on speed (double speed → quadruple KE). This $v^2$ dependence critical for safety: high-speed collisions far more severe than low-speed because KE increases dramatically with speed. Work-Energy Theorem: Net work done on object equals change in kinetic energy: $W_{\\text{net}} = \\Delta KE = KE_f - KE_i = \\frac{1}{2}m(v_f^2 - v_i^2)$. Implications: Positive net work → KE increases → speeds up. Negative net work → KE decreases → slows down. Zero net work → KE constant → constant speed. Provides powerful problem-solving alternative to force-acceleration approach: can find final speed from work done without tracking forces throughout motion. Stopping distance: Work to stop equals initial KE. For constant braking force $F$: $d = \\frac{mv^2}{2F}$. Distance ∝ $v^2$ (double speed → 4× stopping distance). Applications: Vehicle safety—collision energy ∝ $v^2$ makes speed limits critical; crumple zones/airbags increase stopping distance to reduce forces. Sports—athletes optimize work done by muscles to maximize KE (running speed, jump height, throw velocity). Renewable energy—wind turbines and hydroelectric dams extract KE from moving air/water. Everyday—hammering (KE drives nail), throwing/catching (KE transfer and absorption), sliding (friction does negative work removing KE). Understanding kinetic energy and work-energy relationship enables analyzing motion through energy rather than forces—often simpler approach, especially with variable forces or complex paths. Energy perspective complements force perspective from Unit 4, providing complete toolkit for mechanics."
}
