{
  "expanded_description": "Potential energy is stored energy—energy possessed by an object due to its position or configuration. Unlike kinetic energy (energy of motion), potential energy represents the capacity to do work by changing position or configuration. Understanding potential energy completes the energy picture and enables analyzing systems through energy conservation.",
  "core_concept": {
    "principle": "Potential energy (PE) is energy stored in a system due to position (gravitational, electric), configuration (elastic—springs, compressed materials), or internal structure (chemical, nuclear). It represents work that could be done as the system returns to a reference state. The two most common types in mechanics are: (1) Gravitational potential energy: $PE_g = mgh$ where $m$ is mass, $g$ is gravitational field strength, and $h$ is height above reference level. (2) Elastic potential energy: $PE_s = \\frac{1}{2}kx^2$ where $k$ is spring constant and $x$ is displacement from equilibrium position.",
    "explanation": "Potential energy is 'stored' energy—energy that isn't currently doing anything but could be released to do work. Lift an object: You do work against gravity, and that energy is stored as gravitational potential energy. Release the object, and potential energy converts back to kinetic energy as it falls. Compress a spring: You do work against the spring force, and that energy is stored as elastic potential energy. Release the spring, and it does work on whatever it pushes, converting stored potential energy to kinetic energy. Key insights: (1) Potential energy is relative—depends on choice of reference level (zero point). For gravitational PE, choosing ground as $h = 0$ or tabletop as $h = 0$ gives different PE values, but changes in PE are the same (what matters for energy conservation). (2) Potential energy is associated with conservative forces (forces for which work done is path-independent—only depends on start and end positions). Gravity and spring forces are conservative; friction is not (work depends on path length). (3) Potential energy and kinetic energy can transform into each other. Pendulum: PE ↔ KE continuously as it swings. Roller coaster: PE at top of hill converts to KE as descends, then back to PE climbing next hill. (4) Total mechanical energy (KE + PE) is conserved when only conservative forces do work (no friction, air resistance, or other dissipative forces). This conservation principle is immensely powerful for problem-solving. Potential energy exists in many forms beyond gravitational and elastic: Chemical potential energy in molecular bonds (food, fuel, batteries), Electric potential energy from charge positions in electric fields, Nuclear potential energy in atomic nuclei, Gravitational potential energy on cosmic scales (planets, stars). All represent stored energy that can be released to do work.",
    "image": {
      "src": "images/unit5/potential_energy_concept.png",
      "alt": "Diagram showing elevated object (gravitational PE) and compressed spring (elastic PE) with formulas",
      "caption": "Potential energy: Stored energy from position or configuration. Gravitational: $PE_g = mgh$. Elastic: $PE_s = \\frac{1}{2}kx^2$"
    }
  },
  "sections": [
    {
      "section_title": "Gravitational Potential Energy",
      "introduction": "Gravitational potential energy is energy stored when an object is elevated in a gravitational field. It represents the work gravity could do as the object falls.",
      "key_concept": {
        "definition": "Gravitational potential energy near Earth's surface: $PE_g = mgh$ where $m$ is mass (kg), $g = 9.8$ m/s² is gravitational field strength, and $h$ is height (m) above chosen reference level. Unit: joules (J). Represents work done lifting object to height $h$ against gravity, or equivalently, work gravity would do if object fell from height $h$.",
        "context": "When you lift an object, you do positive work against gravity ($W = mgh$). This work doesn't vanish—it's stored as gravitational potential energy. Release the object, and gravity does positive work as it falls ($W = mgh$), converting stored PE back to kinetic energy. Gravitational PE is energy 'waiting to be released.'"
      },
      "principles": [
        {
          "principle": "Gravitational PE Formula",
          "statement": "For object of mass $m$ at height $h$ above reference level: $PE_g = mgh$. This is work required to lift object to that height (or work gravity would do if it fell from that height).",
          "application": "Calculate gravitational PE from mass and height above chosen reference.",
          "example": "10 kg object on shelf 2 m above floor: Choose floor as reference ($h = 0$). $PE_g = 10 × 9.8 × 2 = 196$ J. If object falls to floor, gravity does 196 J of work, converting PE to KE. Book (1.5 kg) on table 0.8 m above floor: $PE_g = 1.5 × 9.8 × 0.8 = 11.76$ J above floor level."
        },
        {
          "principle": "Reference Level Choice",
          "statement": "Gravitational PE depends on where you choose $h = 0$ (reference level). Different choices give different PE values, but changes in PE ($\\Delta PE$) are independent of choice. What matters physically is energy change, not absolute value.",
          "application": "Choose convenient reference level (often ground, floor, or lowest point in problem). Calculate heights relative to this reference.",
          "example": "Ball on 5 m high roof. Reference at ground: $h = 5$ m, $PE_g = mgh = m × 9.8 × 5 = 49m$ J. Reference at roof level: $h = 0$ m, $PE_g = 0$ J. Different absolute values. But if ball falls 3 m (to 2 m above ground): Ground reference: $\\Delta PE = mg(2) - mg(5) = -29.4m$ J. Roof reference: $\\Delta PE = mg(-3) - 0 = -29.4m$ J. Same change in PE! This change converts to KE (what matters)."
        },
        {
          "principle": "Work-Energy and Gravitational PE",
          "statement": "Lifting object at constant velocity (no KE change): Work done by lifter = gain in gravitational PE. $W_{\\text{lifter}} = \\Delta PE_g = mg\\Delta h$. Falling object (no air resistance): Loss in gravitational PE = gain in kinetic energy. $\\Delta KE = -\\Delta PE_g$ (PE decreases, KE increases by same amount).",
          "application": "Connect work to PE change, or PE change to KE change.",
          "example": "Lift 5 kg box from floor to 1.5 m shelf at constant speed: $W = \\Delta PE = 5 × 9.8 × 1.5 = 73.5$ J. You do 73.5 J work, stored as PE. Drop box from shelf: $\\Delta PE = -73.5$ J (decreases). $\\Delta KE = +73.5$ J (increases by same amount). Just before hitting floor: $KE = 73.5$ J (if dropped from rest, all PE converted to KE)."
        },
        {
          "principle": "PE Is Scalar and Can Be Negative",
          "statement": "Gravitational PE is scalar (no direction). Can be positive, negative, or zero depending on reference choice. Negative PE means object below reference level (gravity would do negative work lifting it to reference, or positive work if it fell further).",
          "application": "Sign indicates position relative to reference, not energy type.",
          "example": "Choose ground as reference ($h = 0$, $PE_g = 0$). Object on shelf: $h > 0$, $PE_g > 0$ (above reference). Object in basement below ground: $h < 0$, $PE_g < 0$ (below reference). Both valid—sign just indicates direction from reference."
        },
        {
          "principle": "Only Changes in PE Matter",
          "statement": "Absolute gravitational PE value is arbitrary (depends on reference choice). Only differences in PE have physical meaning—they equal work done by/against gravity.",
          "application": "When solving problems, focus on $\\Delta PE = mg\\Delta h$, not absolute PE values.",
          "example": "Object falls 10 m: $\\Delta PE = mg(-10) = -98m$ J (negative—PE decreases). This converts to KE regardless of whether you call starting point 100 m above ground or 5 m above floor. Only the 10 m drop (change) matters for energy transformation."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Gravitational Potential Energy",
          "problem": "A 3 kg book sits on a shelf 2.5 m above the floor. Taking the floor as the reference level, find the book's gravitational potential energy.",
          "step_by_step": [
            {
              "step": "Identify given information",
              "explanation": "Mass: $m = 3$ kg. Height above reference (floor): $h = 2.5$ m. Gravitational field: $g = 9.8$ m/s²"
            },
            {
              "step": "Apply gravitational PE formula",
              "explanation": "$PE_g = mgh = 3 × 9.8 × 2.5$"
            },
            {
              "step": "Calculate",
              "explanation": "$PE_g = 3 × 9.8 × 2.5 = 73.5$ J"
            },
            {
              "step": "Interpret",
              "explanation": "Book has 73.5 J of gravitational potential energy above floor level. If it falls to floor, this 73.5 J converts to kinetic energy (and then to heat/sound in impact). To lift book from floor to shelf required doing 73.5 J of work against gravity."
            }
          ],
          "final_answer": "$PE_g = 73.5$ J",
          "concept_applied": "Gravitational PE: $PE_g = mgh$ above chosen reference level. Represents stored energy from elevated position."
        },
        {
          "title": "Change in Gravitational PE",
          "problem": "A 50 kg person climbs stairs from ground level to 8 m height. How much does their gravitational potential energy increase?",
          "step_by_step": [
            {
              "step": "Identify height change",
              "explanation": "Initial height: $h_i = 0$ m (ground level). Final height: $h_f = 8$ m. Change: $\\Delta h = 8 - 0 = 8$ m"
            },
            {
              "step": "Calculate PE change",
              "explanation": "$\\Delta PE_g = mg\\Delta h = 50 × 9.8 × 8$",
              "calculation": "$\\Delta PE_g = 3920$ J = 3.92 kJ"
            },
            {
              "step": "Interpret",
              "explanation": "Person's PE increases by 3920 J. This equals work done by muscles against gravity climbing stairs. Energy comes from chemical energy in muscles (from food), converts to gravitational PE."
            }
          ],
          "final_answer": "$\\Delta PE_g = 3920$ J = 3.92 kJ",
          "concept_applied": "Change in gravitational PE: $\\Delta PE_g = mg\\Delta h$. Climbing stairs: do work against gravity, gain PE."
        },
        {
          "title": "Different Reference Levels",
          "problem": "A 2 kg ball is 3 m above the floor and 10 m above the ground outside. Find its PE using (a) floor as reference, (b) ground as reference, (c) its current position as reference. (d) What is PE change if it falls 1.5 m?",
          "step_by_step": [
            {
              "step": "(a) Floor reference ($h = 0$ at floor)",
              "explanation": "Height above floor: $h = 3$ m. $PE_g = 2 × 9.8 × 3 = 58.8$ J"
            },
            {
              "step": "(b) Ground reference ($h = 0$ at ground)",
              "explanation": "Height above ground: $h = 10$ m. $PE_g = 2 × 9.8 × 10 = 196$ J"
            },
            {
              "step": "(c) Current position as reference",
              "explanation": "$h = 0$ at ball's position. $PE_g = 2 × 9.8 × 0 = 0$ J"
            },
            {
              "step": "(d) Falls 1.5 m",
              "explanation": "$\\Delta h = -1.5$ m (downward). $\\Delta PE_g = mg\\Delta h = 2 × 9.8 × (-1.5) = -29.4$ J. Same regardless of reference choice! Floor ref: 58.8 → 29.4 J (change -29.4). Ground ref: 196 → 166.6 J (change -29.4). Current ref: 0 → -29.4 J (change -29.4). Changes match ✓"
            }
          ],
          "final_answer": "(a) 58.8 J, (b) 196 J, (c) 0 J. (d) $\\Delta PE = -29.4$ J (same for all references)",
          "concept_applied": "Absolute PE depends on reference choice. Changes in PE independent of reference—physically meaningful quantity."
        },
        {
          "title": "PE to KE Conversion",
          "problem": "A 1.5 kg rock is dropped from rest at height 20 m above ground. Ignoring air resistance, find its speed just before hitting ground.",
          "step_by_step": [
            {
              "step": "Initial state",
              "explanation": "Height: $h_i = 20$ m. Velocity: $v_i = 0$ (dropped from rest). $PE_i = mgh_i = 1.5 × 9.8 × 20 = 294$ J. $KE_i = 0$ J"
            },
            {
              "step": "Final state (just before impact)",
              "explanation": "Height: $h_f = 0$ m (ground level). $PE_f = 0$ J. $KE_f = ?$"
            },
            {
              "step": "Energy conservation",
              "explanation": "No friction/air resistance → mechanical energy conserved. $PE_i + KE_i = PE_f + KE_f$. $294 + 0 = 0 + KE_f$",
              "calculation": "$KE_f = 294$ J"
            },
            {
              "step": "Find speed from KE",
              "explanation": "$KE_f = \\frac{1}{2}mv_f^2$. $294 = \\frac{1}{2} × 1.5 × v_f^2$. $294 = 0.75 v_f^2$. $v_f^2 = 392$",
              "calculation": "$v_f = \\sqrt{392} \\approx 19.8$ m/s"
            },
            {
              "step": "Verify with kinematics",
              "explanation": "Free fall: $v^2 = v_0^2 + 2g\\Delta h = 0 + 2(9.8)(20) = 392$ → $v = 19.8$ m/s ✓. Energy method gives same result!"
            }
          ],
          "final_answer": "$v_f \\approx 19.8$ m/s",
          "concept_applied": "Gravitational PE converts to KE when falling. Energy conservation: initial PE = final KE (if starts from rest). Simpler than kinematics approach!"
        }
      ],
      "image": {
        "src": "images/unit5/gravitational_pe.png",
        "alt": "Diagram showing objects at different heights with PE values, and ball falling with PE→KE conversion",
        "caption": "Gravitational PE: $PE_g = mgh$ (height above reference). Falling: PE decreases, KE increases by equal amount."
      }
    },
    {
      "section_title": "Elastic Potential Energy",
      "introduction": "Elastic potential energy is energy stored when elastic materials (springs, rubber bands, etc.) are compressed or stretched from their natural length.",
      "key_concept": {
        "definition": "Elastic potential energy in a spring: $PE_s = \\frac{1}{2}kx^2$ where $k$ is the spring constant (N/m, measure of spring stiffness) and $x$ is displacement from equilibrium position (m). Measured in joules (J). Represents work done compressing or stretching spring, stored as potential energy that can be released.",
        "context": "Springs obey Hooke's Law: restoring force proportional to displacement, $F = -kx$. Negative sign means force opposes displacement (compressed spring pushes back, stretched spring pulls back). To compress/stretch spring distance $x$, must do work against this varying force. Work done = $\\frac{1}{2}kx^2$ (area under force-displacement graph, triangle). This work stores as elastic PE."
      },
      "principles": [
        {
          "principle": "Elastic PE Formula",
          "statement": "Spring compressed or stretched distance $x$ from equilibrium: $PE_s = \\frac{1}{2}kx^2$. Stiffer spring (larger $k$) stores more energy for same displacement. Larger displacement stores more energy ($x^2$ dependence—quadratic).",
          "application": "Calculate stored elastic PE from spring constant and compression/stretch distance.",
          "example": "Spring with $k = 200$ N/m compressed $x = 0.15$ m: $PE_s = \\frac{1}{2} × 200 × 0.15^2 = 100 × 0.0225 = 2.25$ J. Stretched same distance: same PE (depends on $x^2$, sign doesn't matter—compression and stretch store energy equally)."
        },
        {
          "principle": "Hooke's Law and Spring Force",
          "statement": "Spring force: $F = -kx$ where $x$ is displacement from natural length, negative sign indicates restoring force (opposes displacement). Work to compress/stretch from equilibrium to displacement $x$: $W = \\frac{1}{2}kx^2$ (integral of varying force, or average force × distance).",
          "application": "Spring constant $k$ characterizes stiffness: high $k$ = stiff (hard to compress), low $k$ = soft (easy to compress).",
          "example": "Stiff spring: $k = 1000$ N/m. Force to compress 0.1 m: $F = kx = 1000 × 0.1 = 100$ N (large force, hard to compress). Soft spring: $k = 50$ N/m. Force to compress 0.1 m: $F = 50 × 0.1 = 5$ N (small force, easy to compress)."
        },
        {
          "principle": "Elastic PE Is Always Positive",
          "statement": "Unlike gravitational PE (can be negative below reference), elastic PE always positive or zero. $PE_s = \\frac{1}{2}kx^2 \\geq 0$ (since $x^2 \\geq 0$). Zero only at equilibrium ($x = 0$), positive for any compression or stretch.",
          "application": "Elastic PE has natural zero point (equilibrium/natural length). No arbitrary reference choice needed.",
          "example": "Spring at natural length: $x = 0$, $PE_s = 0$. Compressed 0.2 m: $x = 0.2$ m, $PE_s > 0$. Stretched 0.2 m: $x = 0.2$ m (magnitude), $PE_s > 0$ (same value). Both compression and stretch increase PE from zero."
        },
        {
          "principle": "Elastic PE to KE Conversion",
          "statement": "Compressed/stretched spring released: Elastic PE converts to kinetic energy of object attached (or spring itself). If released from rest: $PE_{s,initial} = KE_{final}$ (assuming no friction). $\\frac{1}{2}kx^2 = \\frac{1}{2}mv^2$",
          "application": "Find launch velocity from spring compression and spring constant.",
          "example": "Spring ($k = 400$ N/m) compressed $x = 0.2$ m launches 0.5 kg ball. Stored PE: $\\frac{1}{2} × 400 × 0.2^2 = 8$ J. Released: PE → KE. $8 = \\frac{1}{2} × 0.5 × v^2$. $v^2 = 32$. $v = \\sqrt{32} \\approx 5.66$ m/s. Spring's stored energy becomes ball's motion energy."
        },
        {
          "principle": "Elastic PE in Real Materials",
          "statement": "Not just springs—any elastic material stores elastic PE when deformed: Rubber bands, bow strings, trampolines, diving boards, car shock absorbers. All follow similar principle: deformation stores energy (does work against restoring force), energy releases when deformation reversed.",
          "application": "Recognize elastic PE storage in deformable materials.",
          "example": "Bow and arrow: Drawing bow (bending limbs) stores elastic PE in bow. Release: PE converts to KE of arrow. Trampoline: Jumper's KE deforms trampoline (stores elastic PE), then PE pushes jumper back up (converts to KE again). Pole vault: Running KE → bends pole (elastic PE) → PE lifts vaulter (gravitational PE) → clears bar."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Elastic Potential Energy",
          "problem": "A spring with spring constant 150 N/m is compressed 0.25 m from its natural length. How much elastic potential energy is stored?",
          "step_by_step": [
            {
              "step": "Identify given values",
              "explanation": "Spring constant: $k = 150$ N/m. Compression: $x = 0.25$ m"
            },
            {
              "step": "Apply elastic PE formula",
              "explanation": "$PE_s = \\frac{1}{2}kx^2 = \\frac{1}{2} × 150 × 0.25^2$"
            },
            {
              "step": "Calculate",
              "explanation": "$0.25^2 = 0.0625$. $PE_s = \\frac{1}{2} × 150 × 0.0625 = 75 × 0.0625$",
              "calculation": "$PE_s = 4.69$ J"
            },
            {
              "step": "Interpret",
              "explanation": "Spring stores 4.69 J of elastic PE. This energy can be released to do work (launch projectile, move mechanism, etc.). Work done compressing spring = 4.69 J."
            }
          ],
          "final_answer": "$PE_s = 4.69$ J",
          "concept_applied": "Elastic PE: $PE_s = \\frac{1}{2}kx^2$. Energy stored in compressed or stretched spring."
        },
        {
          "title": "Spring Launching Object",
          "problem": "A spring ($k = 500$ N/m) is compressed 0.3 m and then released, launching a 2 kg block horizontally. Ignoring friction, find the block's speed as it leaves the spring.",
          "step_by_step": [
            {
              "step": "Calculate initial elastic PE",
              "explanation": "Compressed spring stores: $PE_s = \\frac{1}{2}kx^2 = \\frac{1}{2} × 500 × 0.3^2 = 250 × 0.09$",
              "calculation": "$PE_s = 22.5$ J"
            },
            {
              "step": "Initial state",
              "explanation": "Block at rest against compressed spring. $PE_s = 22.5$ J (elastic). $KE = 0$ (not moving yet)"
            },
            {
              "step": "Final state (block leaves spring)",
              "explanation": "Spring returns to natural length: $PE_s = 0$ (no longer compressed). Block moving: $KE = ?$"
            },
            {
              "step": "Energy conservation",
              "explanation": "Elastic PE converts to KE: $PE_{s,initial} = KE_{final}$. $22.5 = \\frac{1}{2}mv^2 = \\frac{1}{2} × 2 × v^2$. $22.5 = v^2$",
              "calculation": "$v = \\sqrt{22.5} \\approx 4.74$ m/s"
            }
          ],
          "final_answer": "$v \\approx 4.74$ m/s",
          "concept_applied": "Elastic PE converts to KE when spring releases. Energy conservation: stored PE becomes motion KE."
        },
        {
          "title": "Finding Spring Constant from Energy",
          "problem": "Compressing a spring 0.4 m stores 32 J of energy. What is the spring constant?",
          "step_by_step": [
            {
              "step": "Write elastic PE formula",
              "explanation": "$PE_s = \\frac{1}{2}kx^2$. Know: $PE_s = 32$ J, $x = 0.4$ m. Need: $k$"
            },
            {
              "step": "Rearrange for spring constant",
              "explanation": "$k = \\frac{2 PE_s}{x^2}$"
            },
            {
              "step": "Substitute values",
              "explanation": "$k = \\frac{2 × 32}{0.4^2} = \\frac{64}{0.16}$",
              "calculation": "$k = 400$ N/m"
            },
            {
              "step": "Check",
              "explanation": "Verify: $PE_s = \\frac{1}{2} × 400 × 0.4^2 = 200 × 0.16 = 32$ J ✓"
            }
          ],
          "final_answer": "$k = 400$ N/m",
          "concept_applied": "From stored energy and compression, find spring constant: $k = \\frac{2PE_s}{x^2}$. Rearrange elastic PE formula to solve for unknown."
        },
        {
          "title": "Comparing Compression Distances",
          "problem": "Spring A ($k = 200$ N/m) stores 20 J. Spring B ($k = 800$ N/m) also stores 20 J. Which spring is compressed more?",
          "step_by_step": [
            {
              "step": "Find compression for Spring A",
              "explanation": "$PE_s = \\frac{1}{2}kx^2$. $20 = \\frac{1}{2} × 200 × x_A^2$. $20 = 100 x_A^2$. $x_A^2 = 0.2$",
              "calculation": "$x_A = \\sqrt{0.2} \\approx 0.447$ m"
            },
            {
              "step": "Find compression for Spring B",
              "explanation": "$20 = \\frac{1}{2} × 800 × x_B^2$. $20 = 400 x_B^2$. $x_B^2 = 0.05$",
              "calculation": "$x_B = \\sqrt{0.05} \\approx 0.224$ m"
            },
            {
              "step": "Compare",
              "explanation": "Spring A compressed ~0.447 m (softer spring, larger compression). Spring B compressed ~0.224 m (stiffer spring, smaller compression). Same energy stored, but stiffer spring needs less compression. Makes sense: $PE \\propto kx^2$. Larger $k$ → smaller $x$ for same PE."
            }
          ],
          "final_answer": "Spring A compressed more (~0.447 m vs ~0.224 m). Stiffer spring stores same energy with less compression.",
          "concept_applied": "For same stored energy: stiffer spring (larger $k$) compressed less. $PE_s = \\frac{1}{2}kx^2$ → $x = \\sqrt{\\frac{2PE_s}{k}}$ → larger $k$ gives smaller $x$."
        }
      ],
      "image": {
        "src": "images/unit5/elastic_pe.png",
        "alt": "Diagram showing compressed and stretched spring with PE formula, and spring launching ball",
        "caption": "Elastic PE: $PE_s = \\frac{1}{2}kx^2$ (energy stored in deformed spring). Release: PE → KE."
      }
    },
    {
      "section_title": "Other Forms of Potential Energy",
      "introduction": "Beyond gravitational and elastic, potential energy exists in many forms throughout physics and everyday life.",
      "categories": [
        {
          "type": "Chemical Potential Energy",
          "description": "Energy stored in molecular bonds, released in chemical reactions.",
          "examples": [
            {
              "process": "Food and metabolism",
              "explanation": "Food molecules (carbohydrates, fats, proteins) contain chemical PE in their bonds. Digestion and metabolism break these bonds, releasing energy (converts chemical PE to thermal energy and work done by muscles). Calories in nutrition measure chemical PE content. 1 food Calorie = 1000 calories = 4184 J of chemical PE."
            },
            {
              "process": "Fossil fuels",
              "explanation": "Gasoline, coal, natural gas store chemical PE. Combustion (burning) breaks bonds, releases energy as heat and work. Car engine: chemical PE in gasoline → thermal energy (heat) → mechanical work (pistons move) → kinetic energy (car moves). Power plants: chemical PE in coal/gas → heat → steam → turbine rotation → electrical energy."
            },
            {
              "process": "Batteries",
              "explanation": "Chemical PE stored in battery materials. Chemical reactions inside battery convert PE to electrical energy. Rechargeable batteries: electrical energy can reverse reactions, storing energy again as chemical PE (charging). Phone battery: chemical PE → electrical energy → powers circuits → light, computation, communication."
            },
            {
              "process": "Explosives",
              "explanation": "High chemical PE stored in unstable molecules. Rapid release (explosion) converts to kinetic energy (flying debris), thermal energy (heat), pressure waves (sound). Example: TNT molecules have chemical bonds that break exothermically (release energy), producing gas expansion and shock waves."
            }
          ]
        },
        {
          "type": "Electric Potential Energy",
          "description": "Energy from positions of electric charges in electric fields.",
          "examples": [
            {
              "process": "Charged particles",
              "explanation": "Like charges (both positive or both negative) repel → have electric PE when close (can do work separating). Opposite charges attract → have electric PE when separated (can do work coming together). Similar to gravitational PE but with attraction or repulsion. Example: Electron near proton has negative electric PE (attraction—would release energy falling toward proton). Two electrons near each other have positive electric PE (repulsion—would release energy if allowed to separate)."
            },
            {
              "process": "Capacitors",
              "explanation": "Device storing electric charge, creating electric field between plates. Stores electric PE: $PE = \\frac{1}{2}QV$ where $Q$ is charge, $V$ is voltage. Flash camera: battery charges capacitor (stores electric PE), flash discharge releases energy rapidly as light. Defibrillator: capacitor stores large electric PE, released through patient to restart heart."
            },
            {
              "process": "Lightning",
              "explanation": "Charge separation in thunderclouds creates electric PE. Lightning strike: rapid conversion of electric PE to light, heat, sound, electromagnetic radiation. Enormous energy release in fraction of second."
            }
          ]
        },
        {
          "type": "Nuclear Potential Energy",
          "description": "Energy stored in atomic nuclei, released in nuclear reactions.",
          "examples": [
            {
              "process": "Nuclear fission",
              "explanation": "Heavy nuclei (uranium, plutonium) split into smaller nuclei, releasing nuclear PE as kinetic energy and radiation. Nuclear power plants: fission releases heat → boils water → steam drives turbines → electrical energy. Enormous energy per atom (millions of times more than chemical reactions) due to strong nuclear forces."
            },
            {
              "process": "Nuclear fusion",
              "explanation": "Light nuclei (hydrogen isotopes) combine into heavier nucleus (helium), releasing nuclear PE. Powers the Sun and stars. Hydrogen nuclei fuse → helium + energy (light, heat). Fusion reactors (experimental): trying to harness this for clean energy on Earth. Potential for nearly unlimited energy if technical challenges solved."
            },
            {
              "process": "Mass-energy equivalence",
              "explanation": "Einstein's $E = mc^2$: mass itself is a form of potential energy. Nuclear reactions convert tiny amount of mass into enormous energy ($c^2$ is huge: ~$9 \\times 10^{16}$ J per kg). This is why nuclear energy so powerful—directly tapping mass as energy source."
            }
          ]
        },
        {
          "type": "Magnetic Potential Energy",
          "description": "Energy from positions/orientations of magnets or magnetic materials in magnetic fields.",
          "examples": [
            {
              "process": "Compass and Earth's field",
              "explanation": "Compass needle (magnet) in Earth's magnetic field has orientation-dependent magnetic PE. Lowest PE when aligned with field (north-pointing). Rotating away from alignment increases PE. Release: needle rotates back to low-PE alignment (north-south). Energy to rotate needle against field becomes magnetic PE."
            },
            {
              "process": "Electric motors and generators",
              "explanation": "Motor: electrical energy creates magnetic forces that do work rotating armature (convert electrical → magnetic interaction → mechanical work). Generator: mechanical work rotates magnets in magnetic field, inducing electric current (convert mechanical → magnetic interaction → electrical energy). Both involve magnetic PE changes."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit5/other_pe_forms.png",
        "alt": "Illustrations of chemical (food, fuel), electric (charges), nuclear (atoms), and magnetic PE",
        "caption": "Other PE forms: Chemical (bonds), Electric (charges), Nuclear (nuclei), Magnetic (field orientation). All store energy for later release."
      }
    },
    {
      "section_title": "Potential Energy and Conservative Forces",
      "introduction": "Potential energy is associated with conservative forces—forces for which work done is path-independent.",
      "key_concept": {
        "definition": "Conservative force: Force for which work done moving object from point A to point B is independent of path taken—depends only on endpoints. For conservative forces, can define potential energy function: work done by force = negative change in PE: $W_{\\text{conservative}} = -\\Delta PE$. Examples: gravity, spring forces, electric forces. Non-conservative forces (friction, air resistance): work depends on path length—cannot define unique PE.",
        "context": "Conservative forces allow energy conservation and PE definition. Non-conservative forces (dissipative forces) convert mechanical energy to heat—mechanical energy not conserved, but total energy (including heat) still conserved."
      },
      "principles": [
        {
          "principle": "Path Independence of Conservative Forces",
          "statement": "For conservative force, work from A to B is same regardless of path. Move object from floor to table: same work whether lifted straight up, carried up ramp, or zigzag path—only height change matters (for gravity).",
          "application": "Can calculate work from endpoints only, ignore path details.",
          "example": "Lift 5 kg book from floor to 1 m shelf: Path 1 (straight up 1 m): $W = mgh = 5 × 9.8 × 1 = 49$ J. Path 2 (lift 0.5 m, move horizontal 2 m, lift 0.5 m more): $W = mg(0.5 + 0.5) = 49$ J (same—horizontal movement does zero work against gravity). Path 3 (spiral up): $W = 49$ J (same—only vertical component matters). Conservative: work = $mgh$ regardless of path."
        },
        {
          "principle": "Work-PE Relationship for Conservative Forces",
          "statement": "Work done BY conservative force equals negative change in potential energy: $W_{\\text{by force}} = -\\Delta PE = -(PE_f - PE_i) = PE_i - PE_f$. Object moves to lower PE: force does positive work. Object moves to higher PE: force does negative work (work done against force).",
          "application": "Relates force's work to PE change.",
          "example": "Ball falls from 10 m to ground: Gravity does work. $W_{\\text{gravity}} = -\\Delta PE_g = -(0 - mgh) = mgh$ (positive—PE decreases, gravity does positive work). Lift ball from ground to 10 m: You do work against gravity. $W_{\\text{you}} = +mgh$ (positive work by you). $W_{\\text{gravity}} = -mgh$ (negative work by gravity—opposes motion). Your work increases ball's PE; gravity's negative work means you work against it."
        },
        {
          "principle": "Round Trip: Zero Net Work for Conservative Forces",
          "statement": "For conservative force, work around closed loop (return to starting point) is zero. $W_{\\text{closed loop}} = 0$. Back at start → same PE → no net PE change → no net work.",
          "application": "Test for conservative force: round trip work should be zero.",
          "example": "Throw ball up, catch it at same height: Gravity does negative work going up (slows ball), equal positive work coming down (speeds ball). Net work by gravity = 0 (closed loop). Ball's KE at catch equals KE at throw—no net energy change. Contrast with friction: push box in circle on rough floor. Friction opposes motion entire loop → negative work throughout → net work < 0 (energy lost to heat). Not conservative—round trip doesn't return to same energy state."
        },
        {
          "principle": "Non-Conservative Forces and Energy Dissipation",
          "statement": "Non-conservative forces (friction, air resistance, drag): work depends on path length (longer path → more work against friction). Cannot define unique PE. Convert mechanical energy to heat (dissipate ordered energy to random molecular motion).",
          "application": "Non-conservative forces make total mechanical energy (KE + PE) decrease—energy goes to heat.",
          "example": "Block slides down ramp with friction: Gravitational PE decreases (height drops). Some converts to KE (block speeds up). Some lost to heat via friction (surfaces warm). $\\Delta PE = \\Delta KE + Q_{\\text{heat}}$ where $Q$ is heat generated. If no friction: all PE → KE. With friction: PE → KE + heat (mechanical energy not fully conserved, but total energy including heat conserved)."
        }
      ],
      "image": {
        "src": "images/unit5/conservative_forces.png",
        "alt": "Diagram showing two paths between same points, conservative force (same work) vs friction (different work)",
        "caption": "Conservative forces: Work path-independent (gravity—same work for any path between heights). Non-conservative: Work path-dependent (friction—more work for longer path)."
      }
    }
  ],
  "key_terms": [
    "Potential energy",
    "Gravitational potential energy",
    "$PE_g = mgh$",
    "Elastic potential energy",
    "$PE_s = \\frac{1}{2}kx^2$",
    "Spring constant",
    "Hooke's Law",
    "Reference level",
    "Conservative force",
    "Non-conservative force",
    "Path independence",
    "Chemical potential energy",
    "Electric potential energy"
  ],
  "summary": "Potential energy is stored energy due to position or configuration, representing capacity to do work. Measured in joules (J), same as kinetic energy and work. Main types in mechanics: (1) Gravitational potential energy: $PE_g = mgh$ where $m$ is mass, $g = 9.8$ m/s², $h$ is height above reference level. Represents work done lifting object or work gravity could do if object falls. Reference level arbitrary (ground, floor, tabletop)—different choices give different PE values, but changes $\\Delta PE = mg\\Delta h$ are independent of reference (physically meaningful). Gravitational PE can be positive (above reference), negative (below reference), or zero (at reference). (2) Elastic potential energy: $PE_s = \\frac{1}{2}kx^2$ where $k$ is spring constant (N/m, stiffness measure) and $x$ is compression/stretch distance from equilibrium. Represents work done deforming spring, stored as PE. Always positive or zero (natural zero at equilibrium). Stiffer spring (larger $k$) stores more energy for same displacement. Energy conversions: Gravitational PE ↔ KE (falling/rising objects—PE decreases/increases, KE increases/decreases by equal amounts). Elastic PE → KE (spring releases—stored PE becomes motion). Chemical PE → thermal/mechanical (food, fuel, batteries—bonds break, release energy). Work-PE relationship for conservative forces: $W_{\\text{conservative}} = -\\Delta PE$ (force does positive work when PE decreases, negative work when PE increases). Other PE forms: Chemical (molecular bonds—food, fuel, explosives), Electric (charge positions—batteries, capacitors, lightning), Nuclear (atomic nuclei—fission, fusion, mass-energy), Magnetic (field orientations—motors, generators). Conservative forces (gravity, springs, electric): Work path-independent, depends only on endpoints, can define unique PE function, round-trip work = 0. Non-conservative forces (friction, air resistance): Work path-dependent (longer path → more work), cannot define unique PE, dissipate mechanical energy to heat. Understanding potential energy completes energy picture: objects have energy from motion (KE) and position/configuration (PE). Total mechanical energy $E = KE + PE$ transforms between forms but conserves when only conservative forces act (next section: conservation of energy). Potential energy provides alternative perspective to force analysis—instead of tracking forces constantly, can analyze initial/final energy states (often simpler, especially with varying forces like springs or gravity on non-straight paths)."
}
