{
  "expanded_description": "Work is the process of transferring energy to or from an object by applying a force that causes displacement. It quantifies how much energy a force delivers when moving an object, forming the crucial bridge between force (mechanics) and energy (thermodynamics).",
  "core_concept": {
    "principle": "Work is defined as the product of force and displacement in the direction of the force: $W = F \\cdot d \\cdot \\cos\\theta$ where $F$ is the applied force magnitude, $d$ is the displacement magnitude, and $\\theta$ is the angle between force and displacement vectors. In the simplest case (force parallel to displacement), $W = Fd$. Work represents energy transfer—positive work adds energy to an object, negative work removes energy.",
    "explanation": "The concept of work in physics differs from everyday usage. Physically, work only occurs when a force causes displacement. Holding a heavy box stationary does no work (no displacement, though it requires effort). Carrying a box horizontally at constant velocity does no work in the vertical direction (vertical force perpendicular to horizontal displacement). Pushing a wall that doesn't move does no work (no displacement). Work requires both force AND motion in the direction of force. The mathematical definition $W = Fd\\cos\\theta$ captures this: (1) Larger force → more work (proportional to $F$). (2) Larger displacement → more work (proportional to $d$). (3) Force perpendicular to motion ($\\theta = 90°$) → zero work ($\\cos 90° = 0$). (4) Force opposite to motion ($\\theta = 180°$) → negative work ($\\cos 180° = -1$, work is negative). Work is measured in joules (J) in SI units, where 1 J = 1 N·m (one newton of force moving an object one meter). Work is a scalar (number with no direction), though it can be positive or negative. Positive work: force component in direction of motion → adds energy to object (speeds it up, lifts it, compresses spring). Negative work: force component opposite to motion → removes energy from object (slows it down, friction, air resistance). Understanding work is essential because it provides energy-based approach to mechanics: Instead of analyzing forces and accelerations at each instant (Newton's laws), can analyze initial and final states using energy (often much simpler). Work-energy relationship is one of physics' most powerful problem-solving tools.",
    "image": {
      "src": "images/unit5/work_concept.png",
      "alt": "Diagram showing force applied to object causing displacement, with work formula W=Fd",
      "caption": "Work: Energy transferred when force causes displacement. $W = Fd\\cos\\theta$ (energy in joules)"
    }
  },
  "sections": [
    {
      "section_title": "Defining Work: Force and Displacement",
      "introduction": "Work is precisely defined in physics as the energy transfer that occurs when a force causes displacement.",
      "key_concept": {
        "definition": "Work $W$ done by a constant force is the product of the force component in the direction of displacement and the displacement magnitude: $W = F_{\\parallel} \\cdot d = F \\cdot d \\cdot \\cos\\theta$ where $F$ is force magnitude, $d$ is displacement magnitude, $\\theta$ is angle between force and displacement vectors, and $F_{\\parallel} = F\\cos\\theta$ is the force component parallel to displacement.",
        "context": "Work quantifies energy transfer. When you push a box across a floor, you transfer energy from your muscles to the box (increasing its kinetic energy) and to the floor (heating it via friction). The work you do equals the energy transferred."
      },
      "principles": [
        {
          "principle": "Work Requires Both Force and Displacement",
          "statement": "For work to be done, both force and displacement must occur. No displacement → no work (regardless of force magnitude). No force → no work (regardless of displacement).",
          "application": "Check both conditions: Is force present? Is displacement occurring?",
          "example": "Holding 20 kg box stationary: Large upward force (to support weight ~196 N), but zero displacement → Work = 0. Box sitting on table: No force from you, no displacement → Work = 0. Pushing box 3 meters with 50 N force → Force AND displacement present → Work = 50 × 3 = 150 J."
        },
        {
          "principle": "Only Force Component Parallel to Motion Does Work",
          "statement": "Force component parallel to displacement does work: $W = F_{\\parallel} d = (F\\cos\\theta) d$. Force component perpendicular to displacement does zero work.",
          "application": "Resolve force into parallel and perpendicular components. Only parallel component counts for work.",
          "example": "Pulling box with rope at 30° above horizontal: If pull force is 100 N and box moves 5 m horizontally: Parallel component: $F_{\\parallel} = 100\\cos 30° = 86.6$ N. Work: $W = 86.6 × 5 = 433$ J. Perpendicular component (100 sin 30° = 50 N upward) does zero work on horizontal motion."
        },
        {
          "principle": "Work Formula for Constant Force",
          "statement": "When constant force $F$ acts at angle $\\theta$ to displacement $d$: $W = Fd\\cos\\theta$. Special cases: $\\theta = 0°$ (force parallel to motion): $W = Fd$ (maximum positive work). $\\theta = 90°$ (force perpendicular): $W = 0$ (no work). $\\theta = 180°$ (force opposite to motion): $W = -Fd$ (maximum negative work).",
          "application": "Calculate work using force magnitude, displacement magnitude, and angle between them.",
          "example": "Push box with 80 N force parallel to motion, box moves 4 m: $\\theta = 0°$, $W = 80 × 4 × \\cos 0° = 80 × 4 × 1 = 320$ J. Push with same 80 N but at 60° to motion direction, box still moves 4 m: $W = 80 × 4 × \\cos 60° = 80 × 4 × 0.5 = 160$ J (half the work, only half the force is useful)."
        },
        {
          "principle": "Work Is a Scalar",
          "statement": "Work is a scalar quantity (has magnitude and sign but no direction). Can be positive, negative, or zero, but doesn't point in any direction.",
          "application": "Unlike force and displacement (vectors), work is just a number (with units).",
          "example": "Push box eastward with 50 N doing 200 J of work. Later push box northward with 50 N doing 200 J of work. Total work = 200 + 200 = 400 J (simple addition, no vector components). Forces had different directions, but work is scalar—just add algebraically."
        },
        {
          "principle": "Units of Work: Joules",
          "statement": "SI unit of work is the joule (J): 1 J = 1 N·m (one newton of force acting over one meter of displacement). Joule is also the unit of energy (work and energy are equivalent—work is energy transfer).",
          "application": "Calculate work in joules by multiplying force (N) by displacement (m).",
          "example": "Lift 2 kg book (weight ~19.6 N) vertically 1.5 m: $W = 19.6 × 1.5 = 29.4$ J. Push car with 500 N force over 10 m: $W = 500 × 10 = 5000$ J = 5 kJ."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Work: Force Parallel to Displacement",
          "problem": "A person pushes a shopping cart with a constant horizontal force of 25 N for a distance of 12 m across a level floor. How much work does the person do?",
          "step_by_step": [
            {
              "step": "Identify given information",
              "explanation": "Force: $F = 25$ N (horizontal). Displacement: $d = 12$ m (horizontal, same direction as force). Angle between force and displacement: $\\theta = 0°$ (parallel)."
            },
            {
              "step": "Choose work formula",
              "explanation": "For constant force: $W = Fd\\cos\\theta$"
            },
            {
              "step": "Substitute values",
              "explanation": "$W = 25 × 12 × \\cos 0° = 25 × 12 × 1$",
              "calculation": "$W = 300$ J"
            },
            {
              "step": "Interpret",
              "explanation": "Person transfers 300 J of energy to the cart (and floor via friction). Positive work—energy added to system."
            }
          ],
          "final_answer": "$W = 300$ J",
          "concept_applied": "Work with parallel force and displacement: $W = Fd$. Positive work means energy transferred from person to cart/floor."
        },
        {
          "title": "Work with Force at an Angle",
          "problem": "A child pulls a wagon with a force of 40 N at an angle of 35° above the horizontal. The wagon moves 8 m horizontally. How much work does the child do?",
          "step_by_step": [
            {
              "step": "Identify information",
              "explanation": "Force: $F = 40$ N at 35° above horizontal. Displacement: $d = 8$ m horizontal. Angle between force and displacement: $\\theta = 35°$"
            },
            {
              "step": "Apply work formula",
              "explanation": "$W = Fd\\cos\\theta = 40 × 8 × \\cos 35°$"
            },
            {
              "step": "Calculate",
              "explanation": "$\\cos 35° \\approx 0.819$. $W = 40 × 8 × 0.819$",
              "calculation": "$W = 262$ J"
            },
            {
              "step": "Alternative approach (components)",
              "explanation": "Horizontal component of force: $F_x = 40\\cos 35° = 32.8$ N. Work: $W = F_x × d = 32.8 × 8 = 262$ J. Same result—only horizontal component does work on horizontal displacement."
            }
          ],
          "final_answer": "$W = 262$ J",
          "concept_applied": "Angled force: Only component parallel to displacement does work. Use $W = Fd\\cos\\theta$ or find parallel component first."
        },
        {
          "title": "Zero Work: Perpendicular Force",
          "problem": "A person carries a 15 kg suitcase (weight ~147 N) while walking 20 m horizontally at constant velocity. How much work does the upward force from the person's hand do on the suitcase?",
          "step_by_step": [
            {
              "step": "Identify forces and displacement",
              "explanation": "Upward force from hand: $F = 147$ N (supports weight). Displacement: $d = 20$ m horizontal. Angle between force (upward) and displacement (horizontal): $\\theta = 90°$"
            },
            {
              "step": "Calculate work",
              "explanation": "$W = Fd\\cos 90° = 147 × 20 × 0$",
              "calculation": "$W = 0$ J"
            },
            {
              "step": "Explain",
              "explanation": "Upward force perpendicular to horizontal displacement does no work. The person expends biological energy (tires muscles), but does zero work on suitcase in physics sense. Suitcase's kinetic energy doesn't change (constant velocity), potential energy doesn't change (same height)—no energy transferred to suitcase by upward force."
            }
          ],
          "final_answer": "$W = 0$ J (perpendicular force does no work)",
          "concept_applied": "Force perpendicular to displacement: $\\theta = 90°$, $\\cos 90° = 0$, so $W = 0$. Common misconception: carrying objects horizontally feels like work, but does zero work on object."
        },
        {
          "title": "Lifting Object: Work Against Gravity",
          "problem": "A worker lifts a 25 kg box vertically from the floor to a shelf 2.0 m high at constant velocity. How much work does the worker do on the box?",
          "step_by_step": [
            {
              "step": "Determine force needed",
              "explanation": "Box weight: $W_{\\text{gravity}} = mg = 25 × 9.8 = 245$ N downward. To lift at constant velocity: upward force must equal weight (net force = 0, no acceleration). Upward force from worker: $F = 245$ N"
            },
            {
              "step": "Identify displacement",
              "explanation": "Displacement: $d = 2.0$ m upward (vertical). Angle between upward force and upward displacement: $\\theta = 0°$ (parallel)"
            },
            {
              "step": "Calculate work",
              "explanation": "$W = Fd\\cos 0° = 245 × 2.0 × 1$",
              "calculation": "$W = 490$ J"
            },
            {
              "step": "Interpret",
              "explanation": "Worker does 490 J of positive work on box, transferring 490 J of energy to box. This energy becomes gravitational potential energy (box is higher, has stored energy). Gravity does negative work: $W_{\\text{gravity}} = -490$ J (force down, displacement up). Net work on box = 490 + (-490) = 0 J, consistent with no change in kinetic energy (constant velocity)."
            }
          ],
          "final_answer": "$W = 490$ J (by worker on box)",
          "concept_applied": "Lifting at constant velocity: upward force = weight, displacement upward, work = $mgh$. Positive work by lifter, negative work by gravity, net zero (constant kinetic energy)."
        }
      ],
      "image": {
        "src": "images/unit5/work_force_displacement.png",
        "alt": "Diagrams showing force parallel, perpendicular, and at angle to displacement with work calculations",
        "caption": "Work depends on angle: Parallel ($\\theta=0°$): $W=Fd$ (max). Perpendicular ($\\theta=90°$): $W=0$. Angled: $W=Fd\\cos\\theta$"
      }
    },
    {
      "section_title": "Positive, Negative, and Zero Work",
      "introduction": "The sign of work (positive, negative, or zero) indicates the direction of energy transfer and has important physical meaning.",
      "key_concept": {
        "definition": "Positive work ($W > 0$): Force component in direction of motion → energy transferred TO object → object gains energy (speeds up, rises, compresses). Negative work ($W < 0$): Force component opposite to motion → energy transferred FROM object → object loses energy (slows down, descends against pull, stretches). Zero work ($W = 0$): No force, or force perpendicular to motion, or no displacement → no energy transfer.",
        "context": "Work's sign tells us whether force adds energy to or removes energy from an object. This is crucial for understanding energy conservation and transformations."
      },
      "principles": [
        {
          "principle": "Positive Work: Energy Added",
          "statement": "When $0° \\leq \\theta < 90°$ (force component in motion direction), work is positive. Object gains energy from the force.",
          "application": "Forces that speed up objects, lift objects, or compress springs do positive work.",
          "example": "Engine force accelerating car forward: Force forward, motion forward, $\\theta = 0°$ → $W > 0$ (positive). Energy from fuel → kinetic energy of car. Lifting book upward: Applied force up, displacement up, $\\theta = 0°$ → $W > 0$. Your chemical energy → book's gravitational potential energy. Compressing spring: Push spring, spring compresses in direction of force → $W > 0$. Your energy → spring's elastic potential energy."
        },
        {
          "principle": "Negative Work: Energy Removed",
          "statement": "When $90° < \\theta \\leq 180°$ (force component opposite to motion), work is negative. Object loses energy to the force.",
          "application": "Forces that slow objects down or resist motion do negative work.",
          "example": "Friction slowing sliding box: Friction force backward, motion forward, $\\theta = 180°$ → $W = -Fd$ (negative). Box's kinetic energy → heat in surfaces via friction. Gravity on object thrown upward: Gravity down, motion up (while rising), $\\theta = 180°$ → $W < 0$. Object's kinetic energy → potential energy, object slows. Air resistance on falling object: Drag upward, motion downward, $\\theta = 180°$ → $W < 0$. Object's kinetic or potential energy → heat in air."
        },
        {
          "principle": "Zero Work: No Energy Transfer",
          "statement": "When $\\theta = 90°$ (force perpendicular to motion), or when $F = 0$, or when $d = 0$, work is zero. No energy transferred.",
          "application": "Centripetal forces, normal forces perpendicular to motion, and static friction (no displacement) do zero work.",
          "example": "Moon orbiting Earth: Gravity provides centripetal force (toward Earth center), always perpendicular to velocity (tangent to orbit). $\\theta = 90°$ → $W = 0$. Moon's kinetic energy constant (circular orbit, constant speed). Normal force on box sliding horizontally: Normal upward, displacement horizontal, $\\theta = 90°$ → $W = 0$. Normal doesn't change kinetic energy. Static friction preventing motion: Force present but $d = 0$ → $W = 0$. Object doesn't move, no energy transfer."
        },
        {
          "principle": "Net Work: Sum of All Work Done",
          "statement": "Multiple forces may act on object. Net work = sum of work done by each force (algebraic sum, including signs): $W_{\\text{net}} = W_1 + W_2 + W_3 + ...$",
          "application": "Calculate work by each force separately, then add (respecting positive/negative signs).",
          "example": "Box sliding with friction: Applied force 60 N forward over 5 m, friction 20 N backward. Work by applied force: $W_1 = 60 × 5 = 300$ J (positive). Work by friction: $W_2 = -20 × 5 = -100$ J (negative, opposite to motion). Net work: $W_{\\text{net}} = 300 + (-100) = 200$ J. Net positive work → box gains 200 J of kinetic energy."
        }
      ],
      "classifications": [
        {
          "type": "Categorizing Work by Sign",
          "value": "Determining if work is positive, negative, or zero",
          "characteristics": [
            "Check angle between force and displacement",
            "Determine energy flow direction"
          ],
          "behavior": "Sign indicates energy transfer direction.",
          "examples": [
            {
              "process": "Positive work examples",
              "explanation": "Rocket thrust (force forward, motion forward). Cyclist pedaling (force tangent to wheel, motion forward). Hammer hitting nail (force downward, nail moves downward). Stretching rubber band (force outward, ends move outward). All: force component along motion → energy into object/system."
            },
            {
              "process": "Negative work examples",
              "explanation": "Brakes on car (force backward, motion forward). Parachute (drag upward, motion downward). Gravity on rocket ascending (force down, motion up while rising). Shooting arrow (bow pushes arrow forward, but arrow's motion draws string backward—bow does negative work on string, string does positive work on arrow). All: force component against motion → energy out of object/system."
            },
            {
              "process": "Zero work examples",
              "explanation": "Tension in rope for pendulum (tension toward pivot, motion perpendicular—arc). Magnetic force on charged particle in uniform magnetic field (force perpendicular to velocity, causes circular motion but doesn't change speed). Person holding box while standing still ($d = 0$). Normal force on car driving horizontally (normal vertical, motion horizontal). All: perpendicular force or no displacement → no energy transfer."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Positive and Negative Work",
          "problem": "A 10 kg block slides 6 m down a frictionless ramp inclined at 30°. Identify the work done by (a) gravity, (b) the normal force.",
          "step_by_step": [
            {
              "step": "Analyze displacement",
              "explanation": "Block moves 6 m down the ramp (along inclined surface)."
            },
            {
              "step": "(a) Work by gravity",
              "explanation": "Gravity: $F_g = mg = 10 × 9.8 = 98$ N straight downward (vertical). Displacement: 6 m along ramp at 30° below horizontal. Angle between gravity (downward) and displacement (down the ramp): $\\theta = 30°$ (gravity is steeper than ramp, so angle is 30° between them). $W_{\\text{gravity}} = F_g d \\cos 30° = 98 × 6 × 0.866$",
              "calculation": "$W_{\\text{gravity}} = 509$ J (positive—gravity component along ramp does positive work, adding energy as block speeds up)"
            },
            {
              "step": "Alternative for gravity",
              "explanation": "Component of gravity along ramp: $F_{\\parallel} = mg\\sin 30° = 98 × 0.5 = 49$ N down ramp. Work: $W = 49 × 6 = 294$ J. Wait—different answer! Error: vertical drop, not ramp distance, matters for $mgh$ approach. Using angle method is correct here: $W = 98 × 6 × \\cos 30° = 509$ J."
            },
            {
              "step": "(b) Work by normal force",
              "explanation": "Normal force: perpendicular to ramp surface (outward from ramp). Displacement: along ramp surface. Angle: $\\theta = 90°$ (perpendicular). $W_{\\text{normal}} = F_N d \\cos 90° = F_N × 6 × 0 = 0$ J. Normal force does zero work (perpendicular to motion)."
            }
          ],
          "final_answer": "(a) Gravity does $+509$ J (positive work, speeds block up), (b) Normal does 0 J (perpendicular)",
          "concept_applied": "Gravity component along motion does positive work (speeds object). Normal perpendicular to motion does zero work. Signs indicate energy transfer direction."
        },
        {
          "title": "Net Work from Multiple Forces",
          "problem": "A 5 kg box is pushed 8 m across a rough floor. Applied force is 40 N horizontal, friction is 15 N. Find: (a) work by applied force, (b) work by friction, (c) net work.",
          "step_by_step": [
            {
              "step": "(a) Work by applied force",
              "explanation": "Applied force: 40 N in direction of motion (horizontal). Displacement: 8 m horizontal (same direction). $\\theta = 0°$. $W_{\\text{applied}} = 40 × 8 × \\cos 0° = 40 × 8$",
              "calculation": "$W_{\\text{applied}} = 320$ J (positive)"
            },
            {
              "step": "(b) Work by friction",
              "explanation": "Friction: 15 N opposite to motion direction. Displacement: 8 m. $\\theta = 180°$ (friction opposes motion). $W_{\\text{friction}} = 15 × 8 × \\cos 180° = 15 × 8 × (-1)$",
              "calculation": "$W_{\\text{friction}} = -120$ J (negative—removes energy)"
            },
            {
              "step": "(c) Net work",
              "explanation": "Net work = sum of all work (with signs): $W_{\\text{net}} = W_{\\text{applied}} + W_{\\text{friction}} = 320 + (-120)$",
              "calculation": "$W_{\\text{net}} = 200$ J"
            },
            {
              "step": "Interpret",
              "explanation": "Applied force adds 320 J, friction removes 120 J. Net: box gains 200 J of kinetic energy (speeds up). If started from rest, final kinetic energy = 200 J."
            }
          ],
          "final_answer": "(a) $W_{\\text{applied}} = 320$ J, (b) $W_{\\text{friction}} = -120$ J, (c) $W_{\\text{net}} = 200$ J",
          "concept_applied": "Net work = algebraic sum of individual works (include signs). Positive net work → object gains kinetic energy."
        },
        {
          "title": "Work in Opposite Directions",
          "problem": "Gravity does -300 J of work on a ball thrown upward. What work does the thrower's hand do on the ball during the throw?",
          "step_by_step": [
            {
              "step": "Understand the situation",
              "explanation": "Ball thrown upward: hand applies upward force during throw, then releases. While rising (after release), gravity does negative work (opposes upward motion). Question asks about work during throw (while hand in contact)."
            },
            {
              "step": "During throw: hand's work",
              "explanation": "Hand pushes ball upward (force up, displacement up during acceleration phase). This is positive work—hand adds energy to ball. Let's call this $W_{\\text{hand}}$."
            },
            {
              "step": "After release: gravity's work",
              "explanation": "Given: gravity does -300 J while ball rises. This is negative work (force down, motion up → $\\theta = 180°$). Energy removed from ball by gravity as it slows."
            },
            {
              "step": "Relate the two phases",
              "explanation": "If ball returns to original height when caught, all kinetic energy given by hand is removed by gravity. If gravity does -300 J slowing ball, hand must have done +300 J speeding it up (energy conservation—covered later, but intuitive). If ball doesn't return to same height, problem is ambiguous. Assuming question implies ball's total energy change: $W_{\\text{hand}} \\approx 300$ J (opposite of gravity's work)."
            }
          ],
          "final_answer": "Hand does approximately $+300$ J (positive work, adds energy; gravity does -300 J removing that energy as ball rises)",
          "concept_applied": "Positive work adds energy, negative work removes energy. Equal magnitude, opposite sign works cancel over full cycle."
        }
      ],
      "image": {
        "src": "images/unit5/positive_negative_work.png",
        "alt": "Three diagrams: force with motion (positive W), force against motion (negative W), force perpendicular (zero W)",
        "caption": "Work sign: Force along motion → $W > 0$ (energy added). Force against motion → $W < 0$ (energy removed). Force perpendicular → $W = 0$"
      }
    },
    {
      "section_title": "Work in Different Contexts",
      "introduction": "Work appears in many physical situations, each revealing how energy transfers through forces.",
      "categories": [
        {
          "type": "Work Done by Gravity",
          "description": "Gravitational work depends on vertical displacement only.",
          "examples": [
            {
              "process": "Lifting objects (against gravity)",
              "explanation": "Lifting object at constant velocity: Applied force $F = mg$ upward, displacement $h$ upward. Work by applied force: $W = F \\cdot h = mgh$ (positive—energy added to object). Work by gravity: $W_g = -mgh$ (negative—force down, displacement up, $\\theta = 180°$). Net work = $mgh + (-mgh) = 0$ (kinetic energy unchanged, constant velocity). Energy added by lifter becomes gravitational potential energy."
            },
            {
              "process": "Lowering objects (with gravity)",
              "explanation": "Lowering object slowly (constant velocity): Applied force $F = mg$ upward (prevents free fall), displacement $h$ downward. Work by applied force: $W = -mgh$ (force up, displacement down, $\\theta = 180°$, negative). Work by gravity: $W_g = mgh$ (force down, displacement down, $\\theta = 0°$, positive). Net work = 0 (constant velocity). Gravitational potential energy converted to heat in muscles controlling descent."
            },
            {
              "process": "Object sliding down frictionless ramp",
              "explanation": "Component of gravity along ramp does positive work: $W = mgh$ where $h$ is vertical drop (not ramp length). Object gains kinetic energy equal to $mgh$ (potential energy converted to kinetic). Work by gravity depends only on vertical displacement, not path taken (ramp length, angle don't matter for work—only height change)."
            }
          ]
        },
        {
          "type": "Work Done by Friction",
          "description": "Friction opposes motion, always doing negative work (removes kinetic energy, converts to heat).",
          "examples": [
            {
              "process": "Sliding friction",
              "explanation": "Object sliding across surface: Kinetic friction $f_k = \\mu_k F_N$ opposes motion direction. Work by friction: $W_f = -f_k \\cdot d = -\\mu_k F_N d$ (negative—$\\theta = 180°$). Energy removed from object's kinetic energy, converted to heat (temperature rise in surfaces). Example: Box sliding 10 m with $f_k = 25$ N. Work: $W_f = -25 × 10 = -250$ J. Box loses 250 J kinetic energy (slows down), 250 J becomes heat."
            },
            {
              "process": "Work to overcome friction",
              "explanation": "To push object at constant velocity despite friction: Applied force must equal friction ($F = f_k$). Work by applied force: $W = f_k \\cdot d$ (positive—in motion direction). Work by friction: $W_f = -f_k \\cdot d$ (negative—opposes motion). Net work = 0 (kinetic energy constant). Applied force's energy ultimately goes to heat via friction (not increasing object's kinetic energy)."
            },
            {
              "process": "Braking",
              "explanation": "Brakes apply friction force opposite to motion. Work by friction: $W = -f \\cdot d$ (negative). Removes kinetic energy, converts to heat in brake pads/rotors (why brakes get hot). Stopping distance determined by how much work friction must do to remove all kinetic energy."
            }
          ]
        },
        {
          "type": "Work by Tension",
          "description": "Rope/cable tension can do work when rope length changes or when object moves in tension's direction.",
          "examples": [
            {
              "process": "Elevator lifted by cable",
              "explanation": "Cable tension pulls elevator upward. If elevator rises with constant velocity: Tension $T = mg$ (balances weight). Displacement $d$ upward. Work by tension: $W = T \\cdot d = mgd$ (positive—force up, motion up). Work by gravity: $W_g = -mgd$ (negative). Net work = 0 (constant velocity). Tension transfers energy from motor to elevator's gravitational potential energy."
            },
            {
              "process": "Towing a car",
              "explanation": "Tow rope tension pulls car forward. Tension does positive work: $W = T \\cdot d$ (force and displacement both forward). This work accelerates car or overcomes friction to maintain constant velocity. Energy flows from towing vehicle → through rope tension → to towed vehicle."
            },
            {
              "process": "Pendulum",
              "explanation": "Rope tension on pendulum bob: Tension always toward pivot (perpendicular to arc motion at each instant). Work by tension: $W = 0$ throughout swing (perpendicular force, $\\theta = 90°$ always). Tension changes bob's direction but not speed. Energy conserved: potential ↔ kinetic without tension doing work."
            }
          ]
        },
        {
          "type": "Work by Springs and Elastic Forces",
          "description": "Springs exert forces that vary with displacement—more complex work calculation.",
          "examples": [
            {
              "process": "Compressing or stretching spring",
              "explanation": "Spring force (Hooke's Law): $F = -kx$ where $k$ is spring constant, $x$ is displacement from equilibrium, negative sign means force opposes displacement. Work to compress/stretch: Force required increases linearly with displacement. Work = average force × displacement: $W = \\frac{1}{2}kx^2$ (derived using calculus or graphical method—area under $F$ vs $x$ graph is triangle). This work becomes elastic potential energy stored in spring."
            },
            {
              "process": "Spring releasing",
              "explanation": "Compressed spring released: Spring force does positive work on object attached to it. Work done: $W = \\frac{1}{2}kx^2$ where $x$ is initial compression. Elastic potential energy converts to kinetic energy of object. Example: Compressed spring (k = 200 N/m, x = 0.1 m) releases: $W = \\frac{1}{2} × 200 × 0.1^2 = 1$ J given to object."
            }
          ]
        },
        {
          "type": "Work in Circular Motion",
          "description": "Centripetal forces do no work because always perpendicular to velocity.",
          "examples": [
            {
              "process": "Uniform circular motion",
              "explanation": "Centripetal force (gravity for orbits, tension for whirling object, friction for turning car) always points toward circle center, perpendicular to velocity (tangent to circle). Work: $W = 0$ (perpendicular force throughout motion). Centripetal force changes velocity direction but not speed. Kinetic energy constant in uniform circular motion (constant speed). No work done by centripetal force → no energy transfer."
            },
            {
              "process": "Satellite orbiting Earth",
              "explanation": "Gravity provides centripetal force, always toward Earth, perpendicular to satellite velocity. Work by gravity: $W = 0$. Satellite maintains constant speed and kinetic energy in circular orbit. For elliptical orbit: velocity changes (faster when closer, slower when farther), gravity does alternating positive/negative work, but total work per orbit = 0 (round trip back to same point → same kinetic energy)."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit5/work_contexts.png",
        "alt": "Multiple scenarios: lifting (positive W), friction (negative W), pendulum (zero W), spring (variable F)",
        "caption": "Work in contexts: Lifting (+W, against gravity), Friction (-W, removes KE), Pendulum (W=0, perpendicular T), Springs (W=½kx²)"
      }
    },
    {
      "section_title": "Common Misconceptions About Work",
      "introduction": "The physics definition of work differs from everyday usage, leading to common confusions.",
      "categories": [
        {
          "type": "Misconception: Effort = Work",
          "description": "Holding heavy objects or pushing immovable objects feels like work, but does zero work physically.",
          "examples": [
            {
              "process": "Holding box stationary",
              "explanation": "Feels effortful (muscles tire, consume energy biochemically). But no displacement → $W = 0$ physically. Your biological energy converts to heat in muscles (maintaining contraction), but no energy transferred to box (position and energy unchanged). Physics work ≠ biological effort."
            },
            {
              "process": "Pushing wall that doesn't move",
              "explanation": "You exert force, feel tired. Wall doesn't move → $d = 0$ → $W = 0$. No energy transferred to wall. Your chemical energy becomes heat (muscles inefficient). Physics: no work done on wall. Biology: energy expended internally."
            },
            {
              "process": "Why the difference?",
              "explanation": "Physics work is about energy transfer to/from objects. Biological effort involves internal energy expenditure regardless of external work. Muscles consume energy even maintaining static contraction (inefficiency of biological systems). This is why holding heavy object tires you despite doing zero work on it."
            }
          ]
        },
        {
          "type": "Misconception: Movement = Work",
          "description": "Not all movement involves work—force must be in (or against) direction of motion.",
          "examples": [
            {
              "process": "Carrying object horizontally",
              "explanation": "Carrying suitcase while walking horizontally: Upward force (supporting weight), horizontal displacement. Forces perpendicular ($\\theta = 90°$) → $W = 0$ by upward force. Object's kinetic energy doesn't change (constant velocity). Object's potential energy doesn't change (constant height). No work done on object by upward support force, despite movement."
            },
            {
              "process": "Moon orbiting Earth",
              "explanation": "Moon constantly moving (high speed, ~1 km/s). Gravity constantly acting (provides centripetal force). But work by gravity = 0 (force perpendicular to motion at all times). Moon's kinetic energy constant in circular orbit. Movement without work when force perpendicular."
            }
          ]
        },
        {
          "type": "Misconception: Force Magnitude Alone Determines Work",
          "description": "Large force doesn't necessarily mean large work—displacement and angle matter too.",
          "examples": [
            {
              "process": "Static friction preventing motion",
              "explanation": "Static friction can be very large force (preventing heavy object from sliding). But $d = 0$ (object doesn't move) → $W = 0$. Large force, zero work. Contrast with small force moving object far: Small $F$, large $d$ → possibly larger work than large force with no movement."
            },
            {
              "process": "Normal force on car",
              "explanation": "Normal force from road on car is large (supports car's weight, ~10,000 N for typical car). Car drives long distance (say, 100 km). But normal perpendicular to horizontal motion → $W = 0$ by normal force. Large force, long distance, zero work (wrong angle)."
            }
          ]
        },
        {
          "type": "Misconception: Negative Work Means 'Bad' or 'Inefficient'",
          "description": "Negative work is not wasteful—it's energy removal, often useful and necessary.",
          "examples": [
            {
              "process": "Braking",
              "explanation": "Brakes do negative work (friction opposes motion, removes kinetic energy). This is desired function—slow vehicle safely. Negative work = energy removal, which is the goal. Not wasteful, essential for control."
            },
            {
              "process": "Lowering objects gently",
              "explanation": "Lowering heavy object slowly: applied force does negative work (opposes downward motion, prevents free fall). This controlled descent is safer than free fall. Negative work extracts gravitational potential energy gradually. Useful application of negative work."
            },
            {
              "process": "Proper understanding",
              "explanation": "Negative work simply means energy removed from object (transferred to something else—heat, another object, potential energy elsewhere). Can be intentional and beneficial. Sign indicates energy flow direction, not quality or efficiency."
            }
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Work",
    "$W = Fd\\cos\\theta$",
    "Joule (J)",
    "Energy transfer",
    "Positive work",
    "Negative work",
    "Parallel component",
    "Perpendicular force",
    "Displacement",
    "Scalar quantity",
    "Net work",
    "Work by gravity",
    "Work by friction"
  ],
  "summary": "Work is energy transfer through force causing displacement: $W = Fd\\cos\\theta$ where $F$ is force magnitude, $d$ is displacement magnitude, $\\theta$ is angle between force and displacement vectors. SI unit: joule (J) = N·m. Work is scalar (no direction) but can be positive, negative, or zero. Key principles: (1) Work requires both force AND displacement—no displacement or no force means zero work. (2) Only force component parallel to displacement does work—perpendicular component contributes zero: $W = F_{\\parallel} d = (F\\cos\\theta)d$. (3) Special angles: parallel ($\\theta = 0°$): $W = Fd$ (maximum positive work), perpendicular ($\\theta = 90°$): $W = 0$ (zero work), opposite ($\\theta = 180°$): $W = -Fd$ (maximum negative work). Positive work ($W > 0$): force component along motion → energy added to object → speeds up, rises, or compresses. Examples: engine accelerating car, lifting object, compressing spring. Negative work ($W < 0$): force component opposite to motion → energy removed from object → slows down, descends against resistance. Examples: friction slowing motion, gravity on rising object, air resistance. Zero work: force perpendicular to displacement, or no force, or no displacement → no energy transfer. Examples: normal force on horizontal motion, centripetal force in circular motion, holding stationary object. Net work equals sum of work by all forces (algebraic sum with signs): $W_{\\text{net}} = W_1 + W_2 + ...$. Contexts: Gravity does work $W = ±mgh$ depending on vertical displacement direction (+ for descending, - for ascending against gravity). Friction always does negative work (opposes motion): $W = -fd$, converting kinetic energy to heat. Tension does work when displacement occurs in tension direction. Springs: work to compress/stretch is $W = \\frac{1}{2}kx^2$ (elastic potential energy stored). Circular motion: centripetal force perpendicular to motion → zero work → constant kinetic energy. Common misconceptions: Physics work ≠ biological effort (holding objects stationary: zero work despite effort). Movement doesn't guarantee work (force must have component along displacement—perpendicular forces do zero work). Large force doesn't mean large work (need displacement and proper angle). Negative work isn't wasteful (it's energy removal, often desired—braking, controlled lowering). Understanding work is foundational for energy analysis—work quantifies energy transfer, connecting forces (Unit 4) to energy (Unit 5 focus)."
}
