{
  "expanded_description": "Linear programming is a powerful tool for making optimal decisions in business, economics, engineering, and other fields. After learning the graphical method, the next step is applying it to a variety of real-world optimization problems. This section focuses on translating word problems into mathematical models, identifying decision variables, formulating constraints and objective functions, and then using the graphical method to find optimal solutions. You will encounter problems involving maximizing profit, minimizing cost, optimizing product mix, diet planning, and resource allocation. Understanding these applications builds a bridge between abstract mathematics and practical decision-making.",
  
  "core_concept": {
    "principle": "Real-world optimization problems can be modeled as linear programming problems by identifying decision variables, expressing constraints as linear inequalities, and defining a linear objective function to maximize or minimize. The graphical method then yields the optimal solution at a corner point of the feasible region.",
    "explanation": "Consider a factory that produces two products. Each product requires certain amounts of labor and material. The factory has limited labor hours and material units. The profit per unit is known. The goal is to determine how many units of each product to make to maximize total profit. This translates into variables (units of each product), constraints (labor and material limits), and an objective function (profit). Solving the linear program gives the optimal production plan. This pattern applies to many situations: diet problems (minimize cost while meeting nutritional requirements), transportation problems (minimize shipping cost), and investment problems (maximize return under risk limits).",
    "image": {
      "src": "images/13.6/optimization_concept.png",
      "alt": "Flowchart showing problem → model → solve → solution",
      "caption": "The process of solving real-world optimization problems with linear programming."
    }
  },

  "sections": [
    {
      "section_title": "Formulating Optimization Problems",
      "introduction": "The first and most crucial step in solving an optimization problem is translating the verbal description into a mathematical model. This involves identifying decision variables, writing constraints, and defining the objective function.",
      "image": {
        "src": "images/13.6/formulation.png",
        "alt": "Diagram of translating words into equations and inequalities",
        "caption": "Formulating a linear program from a word problem."
      },
      "key_concept": {
        "definition": "To formulate a linear programming problem: (1) Identify the decision variables (usually what you are trying to decide, like quantities to produce). (2) Identify the constraints: limitations on resources, requirements, etc. Express each as a linear inequality. (3) Identify the objective: what you want to maximize or minimize (profit, cost, etc.). Write it as a linear function of the decision variables. (4) Include non-negativity constraints if the variables cannot be negative.",
        "context": "The hardest part is often interpreting the language of the problem. Look for keywords: 'at most' means ≤, 'at least' means ≥, 'exactly' means =. 'Profit' suggests maximization, 'cost' suggests minimization."
      },
      "classifications": [
        {
          "type": "Product Mix Problems",
          "value": "Determine how many units of each product to produce to maximize profit, subject to resource constraints.",
          "characteristics": [
            "Variables represent quantities of products.",
            "Constraints represent limited resources (labor, materials, machine time).",
            "Objective is to maximize total profit."
          ],
          "behavior": "Each product uses a certain amount of each resource per unit. Sum the usage across products and compare to available resources.",
          "examples": [
            {
              "process": "A bakery makes cakes and pies. Each cake requires 2 cups of flour and 1 cup of sugar; each pie requires 1 cup of flour and 2 cups of sugar. Available: 100 cups flour, 80 cups sugar. Profit: cake $10, pie $8. Formulate.",
              "explanation": "Let x = cakes, y = pies. Flour: 2x + y ≤ 100; Sugar: x + 2y ≤ 80; x ≥ 0, y ≥ 0; Maximize z = 10x + 8y."
            },
            {
              "process": "A furniture workshop makes chairs and tables. Each chair requires 3 hours of carpentry and 1 hour of finishing; each table requires 4 hours of carpentry and 2 hours of finishing. Weekly carpentry capacity: 120 hours; finishing capacity: 50 hours. Profit: chair $40, table $60. Formulate.",
              "explanation": "Let x = chairs, y = tables. Carpentry: 3x + 4y ≤ 120; Finishing: x + 2y ≤ 50; x ≥ 0, y ≥ 0; Maximize z = 40x + 60y."
            }
          ]
        },
        {
          "type": "Diet Problems",
          "value": "Find the cheapest combination of foods that meets nutritional requirements.",
          "characteristics": [
            "Variables represent amounts of each food.",
            "Constraints represent minimum requirements for nutrients.",
            "Objective is to minimize total cost."
          ],
          "behavior": "Each food contributes a certain amount of each nutrient per unit. Sum contributions and require at least the minimum.",
          "examples": [
            {
              "process": "A diet requires at least 20 units of protein and 15 units of carbohydrates. Food A provides 2 units protein, 1 unit carbohydrate per ounce, costs $0.30/oz. Food B provides 1 unit protein, 3 units carbohydrate per ounce, costs $0.20/oz. Formulate.",
              "explanation": "Let x = ounces of A, y = ounces of B. Protein: 2x + y ≥ 20; Carbs: x + 3y ≥ 15; x ≥ 0, y ≥ 0; Minimize cost = 0.30x + 0.20y."
            },
            {
              "process": "A vitamin supplement must contain at least 50 units of vitamin C and 30 units of vitamin D. Brand X provides 10 units C and 5 units D per tablet, costs $0.05. Brand Y provides 5 units C and 10 units D per tablet, costs $0.08. Formulate.",
              "explanation": "Let x = tablets of X, y = tablets of Y. Vitamin C: 10x + 5y ≥ 50; Vitamin D: 5x + 10y ≥ 30; x ≥ 0, y ≥ 0; Minimize cost = 0.05x + 0.08y."
            }
          ]
        },
        {
          "type": "Transportation Problems",
          "value": "Minimize shipping cost from multiple sources to multiple destinations.",
          "characteristics": [
            "Variables represent quantities shipped along each route.",
            "Constraints include supply limits at sources and demand requirements at destinations.",
            "Objective is to minimize total shipping cost."
          ],
          "behavior": "For two sources and two destinations, the problem can be formulated with two variables if one route's quantity is determined by the others. More complex problems require more variables.",
          "examples": [
            {
              "process": "Two warehouses (A and B) supply two stores (1 and 2). Warehouse A has 100 units, B has 80 units. Store 1 needs 70 units, Store 2 needs 90 units. Shipping cost per unit: A→1: $5, A→2: $6, B→1: $4, B→2: $7. Formulate.",
              "explanation": "Let x = units shipped from A to 1, y = units shipped from A to 2. Then from B to 1: 70 - x, from B to 2: 90 - y. Constraints: x ≥ 0, y ≥ 0, x ≤ 70, y ≤ 90, 70-x ≥ 0, 90-y ≥ 0, also total from A: x + y ≤ 100, from B: (70-x)+(90-y) ≤ 80 ⇒ 160 - x - y ≤ 80 ⇒ x + y ≥ 80. Objective: minimize cost = 5x + 6y + 4(70-x) + 7(90-y) = 5x+6y+280-4x+630-7y = x - y + 910. So minimize z = x - y + 910, with constraints above."
            }
          ]
        }
      ]
    },

    {
      "section_title": "Solving Maximization Problems",
      "introduction": "Maximization problems are common in business, where the goal is to maximize profit, revenue, or efficiency. The graphical method finds the corner point with the highest objective value.",
      "key_concept": {
        "definition": "To solve a maximization problem graphically: (1) Graph the feasible region. (2) Find all corner points. (3) Evaluate the objective function at each corner. (4) Choose the corner with the largest value. If the region is unbounded and the objective can increase without limit, the problem has no finite maximum.",
        "context": "Most real-world maximization problems have bounded regions due to resource limits, so a finite maximum exists."
      },
      "worked_examples": [
        {
          "title": "Maximizing Profit",
          "problem": "A company produces two products: A and B. Each unit of A requires 2 hours of labor and 3 units of material, and yields a profit of $40. Each unit of B requires 3 hours of labor and 2 units of material, and yields a profit of $50. The company has 120 labor hours and 130 material units available per day. Find the number of units of A and B to maximize profit.",
          "step_by_step": [
            {
              "step": "Define variables",
              "explanation": "Let $x$ = units of A, $y$ = units of B.",
              "calculation": "$x \\ge 0$, $y \\ge 0$."
            },
            {
              "step": "Write constraints",
              "explanation": "Labor: $2x + 3y \\le 120$; Material: $3x + 2y \\le 130$."
            },
            {
              "step": "Write objective function",
              "explanation": "Profit $z = 40x + 50y$ (maximize)."
            },
            {
              "step": "Graph constraints and find feasible region",
              "explanation": "Graph the lines $2x+3y=120$ (intercepts (60,0) and (0,40)) and $3x+2y=130$ (intercepts (43.33,0) and (0,65)). Shade below each (since ≤). The feasible region is in the first quadrant bounded by these lines and axes."
            },
            {
              "step": "Find corner points",
              "explanation": "Corner points: (0,0), (0,40), (43.33,0), and intersection of the two lines.",
              "calculation": "Solve $2x+3y=120$ and $3x+2y=130$: multiply first by 3: $6x+9y=360$; second by 2: $6x+4y=260$. Subtract: $5y=100$ ⇒ $y=20$. Then $2x+60=120$ ⇒ $2x=60$ ⇒ $x=30$. So (30,20)."
            },
            {
              "step": "Evaluate objective at each corner",
              "explanation": "$z(0,0)=0$; $z(0,40)=40(0)+50(40)=2000$; $z(43.33,0)=40(43.33)+50(0)≈1733.2$; $z(30,20)=40(30)+50(20)=1200+1000=2200$."
            },
            {
              "step": "Select maximum",
              "explanation": "The highest profit is $2200 at (30,20)."
            }
          ],
          "final_answer": "Produce 30 units of A and 20 units of B for a maximum profit of $2200.",
          "concept_applied": "Graphical method: corner points and objective evaluation.",
          "image": {
            "src": "images/13.6/profit_max_example.png",
            "alt": "Feasible region with corner points (0,0), (0,40), (30,20), (43.33,0)",
            "caption": "Feasible region for the profit maximization problem."
          }
        }
      ]
    },

    {
      "section_title": "Solving Minimization Problems",
      "introduction": "Minimization problems aim to reduce cost, waste, or time. The graphical method is similar, but you choose the corner with the smallest objective value. However, if the feasible region is unbounded, a minimum may still exist if the objective decreases to a finite limit.",
      "key_concept": {
        "definition": "For minimization problems, follow the same steps: graph, find corners, evaluate objective, and pick the smallest value. If the region is unbounded, check whether the objective can be made arbitrarily small; if not, a finite minimum exists.",
        "context": "Minimization often appears in diet problems, cost reduction, and efficiency studies."
      },
      "worked_examples": [
        {
          "title": "Minimizing Cost",
          "problem": "A diet requires at least 20 units of protein and 15 units of carbohydrates. Food A provides 2 units protein and 1 unit carbohydrate per ounce, costs $0.30 per ounce. Food B provides 1 unit protein and 3 units carbohydrate per ounce, costs $0.20 per ounce. Find the combination that minimizes cost.",
          "step_by_step": [
            {
              "step": "Define variables",
              "explanation": "Let $x$ = ounces of A, $y$ = ounces of B.",
              "calculation": "$x \\ge 0$, $y \\ge 0$."
            },
            {
              "step": "Write constraints",
              "explanation": "Protein: $2x + y \\ge 20$; Carbohydrates: $x + 3y \\ge 15$."
            },
            {
              "step": "Write objective function",
              "explanation": "Cost $c = 0.30x + 0.20y$ (minimize)."
            },
            {
              "step": "Graph constraints and find feasible region",
              "explanation": "Graph the lines $2x+y=20$ (intercepts (10,0) and (0,20)) and $x+3y=15$ (intercepts (15,0) and (0,5)). Shade above each (since ≥). The feasible region is the intersection of these half-planes in the first quadrant. It is unbounded upward and to the right."
            },
            {
              "step": "Find corner points",
              "explanation": "Corner points occur where the two lines intersect, and where each line meets an axis (but only if that intersection satisfies the other inequality).",
              "calculation": "Intersection of lines: solve $2x+y=20$ and $x+3y=15$. From first, $y=20-2x$. Substitute: $x+3(20-2x)=15$ ⇒ $x+60-6x=15$ ⇒ $-5x=-45$ ⇒ $x=9$, then $y=20-18=2$. So (9,2) is a corner.\nIntersection of $2x+y=20$ with $x=0$: (0,20) → check $x+3y=0+60=60 ≥15$ ok, so (0,20) is a corner.\nIntersection of $x+3y=15$ with $y=0$: (15,0) → check $2x+y=30+0=30 ≥20$ ok, so (15,0) is a corner.\nIntersection with $y=0$ on first line? (10,0) but that's on $2x+y=20$, but check $x+3y=10+0=10 <15$, so not feasible. Similarly (0,5) on second line gives $2x+y=0+5=5 <20$, not feasible. So corners: (0,20), (9,2), (15,0)."
            },
            {
              "step": "Evaluate objective at each corner",
              "explanation": "$c(0,20)=0.30(0)+0.20(20)=4.00$; $c(9,2)=0.30(9)+0.20(2)=2.70+0.40=3.10$; $c(15,0)=0.30(15)+0.20(0)=4.50$."
            },
            {
              "step": "Select minimum",
              "explanation": "The smallest cost is $3.10 at (9,2)."
            }
          ],
          "final_answer": "The optimal diet is 9 ounces of A and 2 ounces of B, costing $3.10.",
          "concept_applied": "Minimization with a bounded feasible region (though unbounded overall, the objective has a finite minimum at a corner).",
          "image": {
            "src": "images/13.6/diet_problem.png",
            "alt": "Feasible region for diet problem with corner points (0,20), (9,2), (15,0)",
            "caption": "Feasible region and corner points for the diet problem."
          }
        }
      ]
    },

    {
      "section_title": "Interpreting Solutions",
      "introduction": "Once you find the optimal corner point, you must interpret the result in the context of the original problem. This often involves stating the optimal values of the decision variables and the optimal objective value, and sometimes discussing whether the solution is integer, realistic, or whether resources are fully used.",
      "key_concept": {
        "definition": "Interpretation involves: (1) Stating the optimal decision (e.g., produce x units of A and y units of B). (2) Stating the optimal objective value (e.g., maximum profit $P). (3) Checking if the solution makes sense (e.g., variables should be integers in some contexts). (4) Analyzing which constraints are binding (i.e., hold as equalities) at the optimum.",
        "context": "Binding constraints show which resources are fully utilized; slack in other constraints indicates unused capacity. This information can guide future decisions, like increasing resources or adjusting production."
      },
      "classifications": [
        {
          "type": "Binding vs. Slack Constraints",
          "value": "A constraint is binding if the optimal point lies on its boundary (the inequality is an equality). Otherwise, the constraint has slack.",
          "characteristics": [
            "Binding constraints limit the optimum; if you could relax them, the objective could improve.",
            "Slack constraints indicate resources not fully used."
          ],
          "behavior": "Plug the optimal point into each constraint to see if it saturates it.",
          "examples": [
            {
              "process": "In the profit maximization example, at (30,20): labor 2(30)+3(20)=60+60=120 (binding), material 3(30)+2(20)=90+40=130 (binding). Both constraints are binding."
            },
            {
              "process": "In the diet minimization example, at (9,2): protein 2(9)+2=18+2=20 (binding), carbs 9+3(2)=9+6=15 (binding). Both constraints are binding."
            }
          ]
        }
      ]
    },

    {
      "section_title": "Common Mistakes and How to Avoid Them",
      "introduction": "When solving optimization problems, students often make errors in formulation, graphing, or interpretation.",
      "key_concept": {
        "definition": "Common mistakes include misreading inequality direction, forgetting non-negativity, incorrectly identifying corner points, and misinterpreting the objective sense (max vs min).",
        "context": "Take time to carefully translate the problem, graph accurately, and double-check calculations."
      },
      "classifications": [
        {
          "type": "Mistake 1: Wrong Inequality Direction",
          "value": "Using ≤ when the problem says 'at least' (≥) or vice versa.",
          "characteristics": [
            "Keywords: at most → ≤, at least → ≥, exactly → =."
          ],
          "behavior": "Circle key phrases in the problem and double-check the inequality sign.",
          "examples": [
            {
              "process": "Wrong: 'at least 20 units of protein' written as ≤ 20. Correct: ≥ 20."
            }
          ]
        },
        {
          "type": "Mistake 2: Forgetting Non-Negativity",
          "value": "Omitting $x \\ge 0$, $y \\ge 0$ when quantities cannot be negative.",
          "characteristics": [
            "Most real-world problems require non-negative variables."
          ],
          "behavior": "Always include $x \\ge 0$, $y \\ge 0$ unless stated otherwise.",
          "examples": [
            {
              "process": "In a production problem, forgetting non-negativity could lead to negative production, which is impossible."
            }
          ]
        },
        {
          "type": "Mistake 3: Incorrectly Identifying Corners",
          "value": "Missing a corner or including a point that is not in the feasible region.",
          "characteristics": [
            "Solve all pairs of boundary lines, including axes.",
            "Check each candidate against all constraints."
          ],
          "behavior": "List all boundary lines, solve each pair, and test feasibility.",
          "examples": [
            {
              "process": "In the diet problem, (10,0) solves $2x+y=20$ but fails $x+3y \\ge 15$, so it's not a corner."
            }
          ]
        }
      ]
    }
  ],

  "key_terms": [
    "Optimization",
    "Linear programming",
    "Decision variables",
    "Objective function",
    "Constraints",
    "Feasible region",
    "Corner point",
    "Maximization",
    "Minimization",
    "Binding constraint",
    "Slack",
    "Product mix",
    "Diet problem",
    "Transportation problem"
  ],

  "summary": "Real-world optimization problems can be modeled and solved using linear programming with two variables. The key steps are: formulate the problem by defining variables, constraints, and objective; graph the feasible region; find all corner points; evaluate the objective at each corner; and select the optimal point based on whether you are maximizing or minimizing. Common applications include product mix, diet planning, and transportation. Always interpret the solution in context, noting binding constraints and any slack. Careful formulation and accurate graphing are essential to avoid mistakes."
}
