{
  "expanded_description": "Just as you can graph a single linear inequality in two variables, you can graph a system of linear inequalities. The solution to a system of linear inequalities is the set of all points that satisfy every inequality in the system. This region is called the feasible region and is typically a polygon (or unbounded region) formed by the intersection of half-planes. Graphing these systems is essential for linear programming, where you optimize an objective function subject to constraints. Understanding how to find and shade the feasible region, identify corner points, and interpret bounded vs. unbounded regions prepares you for real-world optimization problems.",
  
  "core_concept": {
    "principle": "The solution to a system of linear inequalities is the intersection of the half-planes defined by each inequality. Graphically, this is the region where all shaded areas overlap. The boundary lines may be solid (≤ or ≥) or dashed (< or >).",
    "explanation": "Each linear inequality divides the plane into two half-planes: one that satisfies the inequality and one that does not. When you have multiple inequalities, the solution is the region where all conditions are true simultaneously—the overlap of all the shaded half-planes. This region is often a polygon, and its vertices (corner points) are found by solving pairs of boundary equations. The region may be bounded (enclosed) or unbounded (extending infinitely).",
    "image": {
      "src": "images/13.3/feasible_region.png",
      "alt": "Graph showing overlapping half-planes forming a polygonal feasible region",
      "caption": "The feasible region is the intersection of all half-planes defined by the system."
    }
  },

  "sections": [
    {
      "section_title": "Graphing a Single Linear Inequality",
      "introduction": "Before tackling systems, you must be comfortable graphing a single linear inequality. This is the foundation for building the feasible region.",
      "image": {
        "src": "images/13.3/linear_inequality.png",
        "alt": "Graph of y > 2x - 1 with shaded region and dashed boundary",
        "caption": "A linear inequality divides the plane into two half-planes."
      },
      "key_concept": {
        "definition": "To graph a linear inequality $ax + by < c$, $ax + by > c$, $ax + by \\le c$, or $ax + by \\ge c$: (1) Graph the boundary line $ax + by = c$. Use a dashed line for < or >, and a solid line for ≤ or ≥. (2) Choose a test point not on the line (often (0,0) if it's not on the line). (3) If the test point satisfies the inequality, shade the half-plane containing it; otherwise, shade the opposite half-plane.",
        "context": "The test point method is reliable because a line divides the plane into two regions; all points on one side satisfy the inequality if and only if any one point on that side does."
      },
      "classifications": [
        {
          "type": "Boundary Line Style",
          "value": "Solid vs. dashed indicates whether points on the line are included.",
          "characteristics": [
            "≤ or ≥: solid line (points on line are solutions).",
            "< or >: dashed line (points on line are NOT solutions)."
          ],
          "behavior": "Always check the inequality symbol before drawing the boundary line.",
          "examples": [
            {
              "process": "Graph $y > 2x - 1$",
              "explanation": "Boundary line $y = 2x - 1$ is dashed. Test point (0,0): $0 > -1$ is true, so shade the side containing (0,0)."
            },
            {
              "process": "Graph $x + y \\le 3$",
              "explanation": "Boundary line $x + y = 3$ is solid. Test point (0,0): $0 \\le 3$ is true, so shade below the line."
            }
          ]
        }
      ]
    },

    {
      "section_title": "Graphing Systems of Linear Inequalities",
      "introduction": "When graphing a system, you graph each inequality on the same coordinate plane. The feasible region is where all the shading overlaps.",
      "image": {
        "src": "images/13.3/system_graph.png",
        "alt": "Graph of three inequalities with overlapping shaded region",
        "caption": "The feasible region is the overlap of all shaded half-planes."
      },
      "key_concept": {
        "definition": "To graph a system of linear inequalities: (1) Graph each inequality on the same axes, shading its solution half-plane. (2) The feasible region is the area where all shadings overlap. (3) The boundaries of the feasible region are segments of the boundary lines. (4) Find corner points by solving pairs of boundary equations that intersect within the feasible region.",
        "context": "The feasible region may be a polygon (bounded) or an unbounded region. Its corner points are critical for optimization problems in linear programming."
      },
      "classifications": [
        {
          "type": "Finding Corner Points",
          "value": "Corner points (vertices) occur where two boundary lines intersect, provided that intersection lies within the feasible region.",
          "characteristics": [
            "Solve the system of equations for each pair of boundary lines.",
            "Check that the intersection point satisfies all inequalities (i.e., lies in the feasible region)."
          ],
          "behavior": "List all intersection points that are part of the feasible region. These are the vertices of the feasible polygon.",
          "examples": [
            {
              "process": "Find corner points for $\\begin{cases} x \\ge 0 \\\\ y \\ge 0 \\\\ x + y \\le 4 \\\\ 2x + y \\le 6 \\end{cases}$",
              "explanation": "Boundaries: $x=0$, $y=0$, $x+y=4$, $2x+y=6$. Intersection points: (0,0), (0,4) from x=0 and x+y=4, (2,2) from x+y=4 and 2x+y=6, (3,0) from y=0 and 2x+y=6. All satisfy the inequalities, so corner points are (0,0), (0,4), (2,2), (3,0)."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Graphing a System and Finding Corner Points",
          "problem": "Graph the system and find the corner points: $\\begin{cases} x \\ge 0 \\\\ y \\ge 0 \\\\ x + 2y \\le 8 \\\\ 3x + y \\le 9 \\end{cases}$",
          "step_by_step": [
            {
              "step": "Graph the first two inequalities",
              "explanation": "$x \\ge 0$ and $y \\ge 0$ restrict the region to the first quadrant. Shade accordingly."
            },
            {
              "step": "Graph $x + 2y \\le 8$",
              "explanation": "Boundary line $x + 2y = 8$ has intercepts (8,0) and (0,4). Test (0,0): $0 \\le 8$ true, so shade below the line. Use solid line."
            },
            {
              "step": "Graph $3x + y \\le 9$",
              "explanation": "Boundary line $3x + y = 9$ has intercepts (3,0) and (0,9). Test (0,0): $0 \\le 9$ true, so shade below the line. Use solid line."
            },
            {
              "step": "Identify the feasible region",
              "explanation": "The feasible region is the overlap of all four shadings—a polygon in the first quadrant."
            },
            {
              "step": "Find corner points",
              "explanation": "Corner points occur at intersections of boundary lines:",
              "calculation": "• (0,0): intersection of $x=0$ and $y=0$.\n• (0,4): intersection of $x=0$ and $x+2y=8$ ⇒ $0+2y=8$ ⇒ $y=4$.\n• (3,0): intersection of $y=0$ and $3x+y=9$ ⇒ $3x=9$ ⇒ $x=3$.\n• Intersection of $x+2y=8$ and $3x+y=9$: solve system: $x+2y=8$, $3x+y=9$. Multiply second by 2: $6x+2y=18$. Subtract first: $(6x+2y) - (x+2y) = 18-8$ ⇒ $5x=10$ ⇒ $x=2$. Then $2+2y=8$ ⇒ $2y=6$ ⇒ $y=3$. So (2,3)."
            },
            {
              "step": "Verify all points satisfy all inequalities",
              "explanation": "(2,3): $2+2(3)=8 \\le 8$ ✓, $3(2)+3=9 \\le 9$ ✓."
            }
          ],
          "final_answer": "The corner points are $(0,0)$, $(0,4)$, $(2,3)$, and $(3,0)$.",
          "concept_applied": "Graphing each inequality and finding intersections of boundary lines gives the vertices of the feasible region.",
          "image": {
            "src": "images/13.3/feasible_region_example.png",
            "alt": "Graph of the system with feasible region shaded and corner points labeled",
            "caption": "Feasible region for the system with corner points (0,0), (0,4), (2,3), (3,0)."
          }
        }
      ]
    },

    {
      "section_title": "Bounded vs. Unbounded Regions",
      "introduction": "The feasible region can be either bounded (enclosed within a finite area) or unbounded (extending infinitely in some direction). This affects optimization problems.",
      "key_concept": {
        "definition": "A region is bounded if it can be enclosed within a circle of finite radius. Otherwise, it is unbounded. In a system of linear inequalities, a bounded region is typically a polygon; an unbounded region looks like a half-plane or a V-shaped region extending to infinity.",
        "context": "In linear programming, if the feasible region is bounded, a maximum and minimum of a linear objective function will exist at corner points. If unbounded, a maximum or minimum may not exist (the function may increase or decrease without bound)."
      },
      "classifications": [
        {
          "type": "Recognizing Bounded vs. Unbounded",
          "value": "Look at the constraints: if they enclose the region on all sides, it's bounded. If there is a direction with no constraint, it's unbounded.",
          "characteristics": [
            "Bounded: often has constraints like $x \\ge 0$, $y \\ge 0$, and upper bounds on combinations of $x$ and $y$.",
            "Unbounded: missing constraints in some direction, e.g., only $x \\ge 0$, $y \\ge 0$, and $x - y \\le 5$ leaves the region open to the northeast."
          ],
          "behavior": "Sketch the region to see if it extends infinitely.",
          "examples": [
            {
              "process": "Bounded example: $x \\ge 0$, $y \\ge 0$, $x + y \\le 5$, $2x + y \\le 8$ forms a polygon.",
              "explanation": "All directions are constrained by either axes or slanted lines."
            },
            {
              "process": "Unbounded example: $x \\ge 0$, $y \\ge 0$, $x - y \\le 3$",
              "explanation": "As $x$ and $y$ increase together, $x-y$ remains small; region extends infinitely in the direction of increasing $x$ and $y$."
            }
          ]
        }
      ]
    },

    {
      "section_title": "Applications and Interpretation",
      "introduction": "Systems of linear inequalities model real-world situations with constraints, such as resource limitations, production capacities, or budget restrictions.",
      "key_concept": {
        "definition": "In applications, variables represent quantities (like units produced) and inequalities represent constraints (like limited materials or labor). The feasible region shows all possible combinations that satisfy the constraints.",
        "context": "Once the feasible region is graphed, you can analyze it to answer questions like: Is a particular combination possible? What are the extreme points? This leads directly to linear programming optimization."
      },
      "worked_examples": [
        {
          "title": "Modeling Production Constraints",
          "problem": "A company produces two products, A and B. Each unit of A requires 2 hours of labor and 1 unit of material. Each unit of B requires 1 hour of labor and 2 units of material. The company has 100 hours of labor and 80 units of material available daily. Write and graph the system of inequalities representing the production possibilities, assuming nonnegative production.",
          "step_by_step": [
            {
              "step": "Define variables",
              "explanation": "Let $x$ = units of product A, $y$ = units of product B."
            },
            {
              "step": "Labor constraint",
              "explanation": "Each A needs 2 labor hours, each B needs 1 hour, total ≤ 100.",
              "calculation": "$2x + y \\le 100$"
            },
            {
              "step": "Material constraint",
              "explanation": "Each A needs 1 material unit, each B needs 2 units, total ≤ 80.",
              "calculation": "$x + 2y \\le 80$"
            },
            {
              "step": "Nonnegativity constraints",
              "explanation": "Cannot produce negative amounts.",
              "calculation": "$x \\ge 0$, $y \\ge 0$"
            },
            {
              "step": "Graph the system",
              "explanation": "Graph each inequality in the first quadrant. The feasible region is the overlap."
            },
            {
              "step": "Find corner points",
              "explanation": "Intersections: (0,0), (0,40) from $x=0$ and $x+2y=80$, (50,0) from $y=0$ and $2x+y=100$, and intersection of $2x+y=100$ and $x+2y=80$.",
              "calculation": "Solve: multiply second by 2: $2x+4y=160$. Subtract first: $(2x+4y) - (2x+y) = 160-100$ ⇒ $3y=60$ ⇒ $y=20$. Then $2x+20=100$ ⇒ $2x=80$ ⇒ $x=40$. So (40,20)."
            }
          ],
          "final_answer": "The system is $\\begin{cases} x \\ge 0 \\\\ y \\ge 0 \\\\ 2x + y \\le 100 \\\\ x + 2y \\le 80 \\end{cases}$. The feasible region has corner points $(0,0)$, $(0,40)$, $(40,20)$, and $(50,0)$.",
          "concept_applied": "Translating word constraints into inequalities and graphing to find the feasible region.",
          "image": {
            "src": "images/13.3/production_feasible.png",
            "alt": "Feasible region for production problem with corner points labeled",
            "caption": "Production possibilities feasible region."
          }
        }
      ]
    },

    {
      "section_title": "Common Mistakes and How to Avoid Them",
      "introduction": "Students often make errors when graphing systems of inequalities. Here are the most frequent pitfalls.",
      "key_concept": {
        "definition": "Common mistakes include shading the wrong side, using the wrong line style, misidentifying corner points, and forgetting nonnegativity constraints.",
        "context": "Always test a point, use a solid/dashed line correctly, and systematically find intersections."
      },
      "classifications": [
        {
          "type": "Mistake 1: Shading the Wrong Half-Plane",
          "value": "Choosing the side that does not satisfy the inequality.",
          "characteristics": [
            "Always use a test point, especially (0,0) if available."
          ],
          "behavior": "After graphing the boundary, pick a test point and plug it into the inequality to determine which side to shade.",
          "examples": [
            {
              "process": "For $x + y > 3$, test (0,0): $0 > 3$ false, so shade opposite side from (0,0)."
            }
          ]
        },
        {
          "type": "Mistake 2: Using Wrong Line Style",
          "value": "Drawing a solid line for < or >, or a dashed line for ≤ or ≥.",
          "characteristics": [
            "Solid line includes boundary points as solutions.",
            "Dashed line excludes boundary points."
          ],
          "behavior": "Check the inequality symbol carefully before drawing.",
          "examples": [
            {
              "process": "$y \\le 2x$ uses a solid line; $y < 2x$ uses a dashed line."
            }
          ]
        },
        {
          "type": "Mistake 3: Missing Corner Points",
          "value": "Forgetting to include intersections of non-axes boundaries, or including points that aren't in the feasible region.",
          "characteristics": [
            "Solve all pairs of boundary equations that might intersect within the feasible region.",
            "Check each candidate against all inequalities."
          ],
          "behavior": "List all boundary lines, solve each pair, and verify the point satisfies every inequality.",
          "examples": [
            {
              "process": "In the production example, (40,20) is a corner, but (0,0), (0,40), (50,0) are also corners. Don't miss any."
            }
          ]
        }
      ]
    }
  ],

  "key_terms": [
    "System of linear inequalities",
    "Feasible region",
    "Half-plane",
    "Boundary line",
    "Solid line",
    "Dashed line",
    "Test point",
    "Corner point (vertex)",
    "Bounded region",
    "Unbounded region",
    "Intersection",
    "Constraint"
  ],

  "summary": "A system of linear inequalities in two variables is graphed by graphing each inequality separately and identifying the overlapping region—the feasible region. Each inequality's boundary line is solid (≤, ≥) or dashed (<, >). The feasible region may be a bounded polygon or an unbounded region. Corner points, found by solving intersecting boundary equations, are crucial for optimization. Applications model real-world constraints like production limits or resource allocation. Careful graphing and systematic corner point identification are essential skills for linear programming."
}
