{
  "expanded_description": "This section introduces the fundamental nature of light, exploring its behavior as an electromagnetic wave and its dual wave-particle nature. Students will learn about the properties of light, its speed, and how it differs from other waves, establishing the foundation for understanding reflection, refraction, and optical phenomena.",
  "core_concept": {
    "principle": "Light is a form of electromagnetic radiation that travels as transverse waves at the ultimate speed limit of the universe. It exhibits both wave-like and particle-like properties, allowing it to travel through empty space and interact with matter in unique ways.",
    "explanation": "Imagine light as ripples in electric and magnetic fields—self-sustaining disturbances that can travel through absolutely nothing. Unlike sound waves that need air, light waves create their own electric and magnetic fields as they go, which is why sunlight can cross the vacuum of space to reach Earth. This remarkable property makes light our primary window to the universe.",
    "image": {
      "src": "images/unit9/light_nature.png",
      "alt": "Diagram showing light as oscillating electric and magnetic fields perpendicular to each other and to direction of travel",
      "caption": "Light consists of oscillating electric and magnetic fields—a self-sustaining electromagnetic wave"
    }
  },
  "sections": [
    {
      "section_title": "What Is Light?",
      "introduction": "Light is so familiar that we rarely stop to think about what it actually is. Yet understanding light's true nature reveals why we can see stars billions of light-years away, why rainbows form, and why a mirror shows your reflection.",
      "key_concept": {
        "definition": "Light is electromagnetic radiation—a form of energy that travels as transverse waves consisting of oscillating electric and magnetic fields perpendicular to each other and to the direction of travel.",
        "context": "Light is unique among waves because it does not require a medium. It can travel through the vacuum of space at an incredible speed of 300,000 kilometers per second (3 × 10⁸ m/s)."
      },
      "principles": [
        {
          "principle": "Light Is an Electromagnetic Wave",
          "statement": "Light consists of electric and magnetic fields that oscillate perpendicular to each other and to the direction the wave travels.",
          "application": "This transverse wave nature explains many of light's behaviors, including polarization (blocking light waves oscillating in certain directions).",
          "example": "Polarized sunglasses work by blocking light waves with electric fields oscillating in specific directions, reducing glare.",
          "analogy": "Think of light like a rope wave: you can shake it up and down (vertical polarization) or side to side (horizontal polarization). Polarized lenses act like a picket fence—only waves oriented a certain way get through."
        },
        {
          "principle": "Light Does Not Need a Medium",
          "statement": "Unlike sound waves, light does not require any material to travel through. It propagates through completely empty space.",
          "application": "This is why we can see the Sun, stars, and distant galaxies—their light travels millions or billions of kilometers through the vacuum of space to reach us.",
          "example": "The Sun is about 150 million kilometers away, and its light takes about 8.3 minutes to reach Earth, traveling through empty space the entire way."
        },
        {
          "principle": "Light Has a Finite Speed",
          "statement": "Light travels at approximately 300,000 kilometers per second in vacuum—the fastest possible speed in the universe. Nothing can travel faster.",
          "application": "This finite speed means that when we look at distant objects, we're seeing them as they were in the past. The light from a star 100 light-years away left that star 100 years ago.",
          "example": "When you look at the Moon, you're seeing it as it was about 1.3 seconds ago. When you look at the Sun, you're seeing it as it was 8.3 minutes ago."
        }
      ],
      "classifications": [
        {
          "type": "Wave Properties",
          "value": "Light behaves as a wave",
          "characteristics": [
            "Transverse wave nature",
            "Can be reflected, refracted, diffracted",
            "Exhibits interference and polarization",
            "Has wavelength and frequency"
          ],
          "behavior": "As a wave, light follows all the rules we've learned: it has amplitude (brightness), wavelength (color), and frequency (also color). It reflects off surfaces, bends when changing mediums, and spreads around obstacles.",
          "examples": [
            {
              "process": "Rainbows",
              "explanation": "Rainbows form when sunlight is refracted (bent) and reflected inside water droplets, separating into different colors by wavelength."
            },
            {
              "process": "Thin film interference",
              "explanation": "Oil slicks on water show colorful patterns because light waves reflect off both the top and bottom of the oil film and interfere with each other."
            }
          ]
        },
        {
          "type": "Particle Properties",
          "value": "Light behaves as particles (photons)",
          "characteristics": [
            "Travels in discrete packets of energy called photons",
            "Can knock electrons off atoms (photoelectric effect)",
            "Carries momentum",
            "Can be counted one photon at a time"
          ],
          "behavior": "In some experiments, light acts as if it's made of tiny particles. Each photon has a specific energy determined by its frequency—higher frequency (bluer) light has more energetic photons.",
          "examples": [
            {
              "process": "Solar panels",
              "explanation": "Photons from sunlight knock electrons loose in solar cells, creating an electric current—this is the photoelectric effect in action."
            },
            {
              "process": "Digital camera sensors",
              "explanation": "Millions of tiny light sensors detect individual photons to create digital images."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit9/wave_particle_duality.png",
        "alt": "Diagram illustrating both wave nature (oscillating fields) and particle nature (stream of photons) of light",
        "caption": "Light exhibits both wave and particle properties—a concept called wave-particle duality"
      },
      "note": "The fact that light behaves as both a wave and a particle is called wave-particle duality. Which behavior you observe depends on how you measure it—light is genuinely both, not one or the other!"
    },
    {
      "section_title": "The Speed of Light",
      "introduction": "Light's speed is not just fast—it's a fundamental constant of the universe that shapes our understanding of space, time, and reality.",
      "key_concept": {
        "definition": "The speed of light in vacuum is exactly 299,792,458 meters per second, usually rounded to 3.00 × 10⁸ m/s. This speed is the cosmic speed limit—nothing can travel faster.",
        "context": "Light's speed is denoted by the letter c (from the Latin celeritas, meaning 'swift'). It's the same for all observers, no matter how fast they're moving—a fact that led Einstein to develop the theory of relativity."
      },
      "principles": [
        {
          "principle": "Constant for All Observers",
          "statement": "No matter how fast you're moving, you'll always measure the speed of light as exactly c. This defies everyday intuition but has been proven experimentally.",
          "application": "This constancy means that time and space themselves must adjust to keep light's speed the same for everyone—leading to time dilation and length contraction.",
          "example": "If you're in a spaceship traveling at 90% of light speed and shine a flashlight forward, you'll measure the light beam moving away at c. Someone watching from Earth will ALSO measure that same light beam moving at c, not faster."
        },
        {
          "principle": "Light Slows Down in Materials",
          "statement": "When light enters a transparent material like glass or water, it slows down. The ratio of light's speed in vacuum to its speed in a material is called the refractive index.",
          "application": "This slowing causes refraction—light bends when entering a new medium at an angle. Different colors slow by different amounts, which is why prisms separate white light into rainbows.",
          "example": "Light travels at about 225,000 km/s in water (refractive index 1.33) and about 200,000 km/s in glass (refractive index 1.5)."
        }
      ],
      "classifications": [
        {
          "type": "Speed in Different Mediums",
          "value": "Light speed varies by material",
          "characteristics": [
            "Vacuum: 300,000 km/s (3.00 × 10⁸ m/s)",
            "Air: almost the same as vacuum (about 0.03% slower)",
            "Water: about 225,000 km/s",
            "Glass: about 200,000 km/s",
            "Diamond: about 124,000 km/s"
          ],
          "behavior": "Light slows down in materials because it interacts with atoms, being absorbed and re-emitted, which takes time. The denser the material, the slower light travels.",
          "examples": [
            {
              "process": "Why diamonds sparkle",
              "explanation": "Diamond slows light dramatically, causing extreme refraction and total internal reflection, creating brilliant sparkle."
            },
            {
              "process": "Apparent depth in water",
              "explanation": "Because light slows in water, objects underwater appear closer to the surface than they really are."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit9/light_speed.png",
        "alt": "Diagram comparing light speed in vacuum, air, water, and glass with relative speeds shown",
        "caption": "Light travels fastest in vacuum and slows down in transparent materials"
      }
    },
    {
      "section_title": "Light as Energy",
      "introduction": "Light carries energy from one place to another. This energy can be absorbed, transformed into heat, converted to electricity, or even knock electrons loose from atoms.",
      "principles": [
        {
          "principle": "Light Transports Energy",
          "statement": "Light waves carry energy from their source to wherever they travel. The amount of energy depends on the light's amplitude (brightness) and frequency (color).",
          "application": "The Sun constantly radiates enormous amounts of light energy into space. A tiny fraction reaches Earth, driving weather, photosynthesis, and life itself.",
          "example": "A magnifying glass can focus sunlight to start a fire—the light energy is concentrated and converted to heat."
        },
        {
          "principle": "Photon Energy Depends on Frequency",
          "statement": "Each photon carries energy proportional to its frequency: E = hf, where h is Planck's constant. Higher frequency (bluer) photons carry more energy than lower frequency (redder) photons.",
          "application": "This is why ultraviolet light can cause sunburn and skin damage—its photons have enough energy to damage DNA molecules—while visible light photons don't.",
          "example": "Red light photons have energy around 1.8 electronvolts; blue light photons around 3.1 electronvolts; ultraviolet photons can exceed 4 electronvolts."
        }
      ],
      "classifications": [
        {
          "type": "Energy Effects",
          "value": "What light energy can do",
          "characteristics": [
            "Heating: absorbed light becomes thermal energy",
            "Photoelectric: light knocks electrons loose",
            "Photosynthesis: plants convert light to chemical energy",
            "Vision: light triggers chemical reactions in our eyes"
          ],
          "behavior": "When light is absorbed, its energy transforms into other forms—heat, electrical energy, chemical energy, or electrical signals in our eyes.",
          "examples": [
            {
              "process": "Solar panels",
              "explanation": "Photons knock electrons loose in silicon, creating an electric current that can power homes."
            },
            {
              "process": "Green plants",
              "explanation": "Chlorophyll absorbs blue and red photons, using their energy to build sugars from carbon dioxide and water."
            },
            {
              "process": "Blacktop roads",
              "explanation": "Dark surfaces absorb visible light and convert it to heat, which is why they get hot in the sun."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Light Sources",
      "introduction": "Light comes from many sources—some natural, some human-made. Understanding how light is produced helps us appreciate its nature.",
      "classifications": [
        {
          "type": "Natural Light Sources",
          "value": "Light from nature",
          "characteristics": [
            "Sun: nuclear fusion creates enormous light output",
            "Stars: similar to Sun, but at vast distances",
            "Fire: chemical reactions produce light and heat",
            "Bioluminescence: living creatures create light chemically",
            "Lightning: electrical discharge excites air molecules"
          ],
          "behavior": "Natural light sources involve various physical processes—nuclear fusion, chemical reactions, electrical discharges, or biological processes—that release energy as light.",
          "examples": [
            {
              "process": "Sunlight",
              "explanation": "The Sun converts 4 million tons of mass to energy every second, radiating light in all directions."
            },
            {
              "process": "Fireflies",
              "explanation": "Special chemicals in fireflies' abdomens react to produce cold light—bioluminescence with almost no heat."
            }
          ]
        },
        {
          "type": "Artificial Light Sources",
          "value": "Human-made light",
          "characteristics": [
            "Incandescent: heated filament glows",
            "Fluorescent: UV excites phosphor coating",
            "LED: electrons moving through semiconductor emit photons",
            "Lasers: stimulated emission produces coherent light",
            "Candles: burning wax produces flame"
          ],
          "behavior": "Artificial lights use various technologies to convert electrical or chemical energy into visible light, each with different efficiency and color properties.",
          "examples": [
            {
              "process": "LED bulbs",
              "explanation": "Semiconductors convert electricity directly into light with high efficiency—up to 90% of energy becomes light rather than heat."
            },
            {
              "process": "Incandescent bulbs",
              "explanation": "Electric current heats a thin filament until it glows—but 90% of energy becomes heat, only 10% light."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit9/light_sources.png",
        "alt": "Collage showing Sun, stars, fire, LED bulb, and bioluminescent creatures",
        "caption": "Light comes from many sources—both natural and artificial"
      }
    },
    {
      "section_title": "Interaction of Light with Matter",
      "introduction": "When light encounters matter, several things can happen. These interactions are the basis for everything from vision to photography to solar power.",
      "principles": [
        {
          "principle": "Transmission",
          "statement": "Light passes through transparent materials like glass, water, and clear air. Transparent materials allow light to travel through with little absorption.",
          "application": "Windows, eyeglasses, and camera lenses all rely on transmission—they let light through while sometimes bending it to focus images.",
          "example": "You can see through a clean window because glass transmits most visible light."
        },
        {
          "principle": "Absorption",
          "statement": "Light can be absorbed by materials, with its energy converted to heat or other forms. Dark materials absorb more light than light-colored ones.",
          "application": "Solar panels are designed to absorb light efficiently; black clothing gets hotter in sun than white because it absorbs more light energy.",
          "example": "A black car left in sunlight becomes much hotter than a white car because black paint absorbs more visible light."
        },
        {
          "principle": "Reflection",
          "statement": "Light bounces off surfaces. Smooth surfaces like mirrors reflect light in an organized way; rough surfaces scatter light in all directions.",
          "application": "We see most objects by reflected light. A book, a tree, another person—all visible because they reflect light from some source into our eyes.",
          "example": "You can see yourself in a calm pond because the smooth water surface reflects light like a mirror."
        },
        {
          "principle": "Refraction",
          "statement": "Light bends when it passes from one transparent material to another at an angle. This happens because light changes speed in the new material.",
          "application": "Lenses use refraction to focus light, enabling glasses, microscopes, telescopes, and cameras.",
          "example": "A straw in a glass of water appears bent because light refracts at the air-water boundary."
        }
      ],
      "image": {
        "src": "images/unit9/light_interactions.png",
        "alt": "Diagram showing transmission through glass, absorption by dark surface, reflection from mirror, and refraction through prism",
        "caption": "Light can be transmitted, absorbed, reflected, or refracted when it encounters matter"
      }
    },
    {
      "section_title": "Historical Understanding of Light",
      "introduction": "Our understanding of light has evolved over centuries, with different models explaining different aspects of light's behavior.",
      "classifications": [
        {
          "type": "Particle Theory (Newton)",
          "value": "17th-18th century",
          "characteristics": [
            "Proposed by Isaac Newton",
            "Light consists of tiny particles (corpuscles)",
            "Explained reflection and straight-line travel",
            "Couldn't fully explain refraction or interference"
          ],
          "behavior": "Newton's particle theory explained why light travels in straight lines and reflects like bouncing balls, but struggled to explain why light bends when entering water.",
          "examples": [
            {
              "process": "Shadows",
              "explanation": "Sharp shadows made sense if light consists of particles traveling in straight lines."
            }
          ]
        },
        {
          "type": "Wave Theory (Huygens, Young)",
          "value": "18th-19th century",
          "characteristics": [
            "Light travels as waves",
            "Explained interference and diffraction",
            "Required hypothetical medium 'aether'",
            "Successfully predicted many phenomena"
          ],
          "behavior": "Wave theory explained why light could bend around corners (diffraction) and create interference patterns—things particle theory couldn't explain.",
          "examples": [
            {
              "process": "Double-slit experiment",
              "explanation": "Light passing through two tiny slits creates an interference pattern of bright and dark bands—proof of wave nature."
            }
          ]
        },
        {
          "type": "Electromagnetic Theory (Maxwell)",
          "value": "1860s",
          "characteristics": [
            "Light is an electromagnetic wave",
            "Unified electricity, magnetism, and light",
            "Predicted speed of light from electric and magnetic constants",
            "Eliminated need for mechanical medium"
          ],
          "behavior": "Maxwell showed that light is actually oscillating electric and magnetic fields—a completely new understanding that didn't require any physical medium.",
          "examples": [
            {
              "process": "Radio waves",
              "explanation": "Maxwell's theory predicted that other electromagnetic waves (like radio) should exist—they were later discovered."
            }
          ]
        },
        {
          "type": "Quantum Theory (Einstein, Planck)",
          "value": "20th century",
          "characteristics": [
            "Light consists of photons (particle-like packets)",
            "Photon energy = hf",
            "Explained photoelectric effect",
            "Wave-particle duality"
          ],
          "behavior": "Quantum theory revealed that light is both wave and particle—the photon model explains how light interacts with matter (like knocking electrons loose), while wave model explains how light travels.",
          "examples": [
            {
              "process": "Photoelectric effect",
              "explanation": "Einstein showed that light must consist of particle-like photons to explain how it ejects electrons from metal surfaces."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit9/history_of_light.png",
        "alt": "Timeline showing Newton, Huygens, Maxwell, and Einstein with their light models",
        "caption": "Our understanding of light evolved from particles to waves to electromagnetic waves to quantum particles"
      }
    },
    {
      "section_title": "Simple Light Experiments",
      "introduction": "You can explore light's properties with simple materials at home or in class.",
      "process_flow": [
        {
          "step": "1",
          "process": "Pinhole camera",
          "description": "Make a small hole in one end of a cardboard box. Cover the other end with wax paper or tracing paper.",
          "mechanism": "Point the hole at a bright scene. An inverted image appears on the paper.",
          "result": "This demonstrates that light travels in straight lines—rays from the top of the object go to the bottom of the image, and vice versa.",
          "applications": [
            "Shows rectilinear propagation of light",
            "Demonstrates image formation",
            "Precursor to modern cameras"
          ]
        },
        {
          "step": "2",
          "process": "Bending light with water",
          "description": "Place a coin in an empty cup. Position yourself so the coin is just hidden by the cup's edge.",
          "mechanism": "Add water without moving the cup or your head.",
          "result": "The coin becomes visible! Light from the coin bends (refracts) as it leaves the water, making the coin appear higher than it really is.",
          "applications": [
            "Demonstrates refraction",
            "Explains why objects in water appear closer"
          ]
        },
        {
          "step": "3",
          "process": "Color mixing",
          "description": "Use three flashlights with red, green, and blue cellophane covers.",
          "mechanism": "Shine the lights onto a white surface, overlapping them in different combinations.",
          "result": "Red + green = yellow; red + blue = magenta; green + blue = cyan; all three = white.",
          "applications": [
            "Demonstrates additive color mixing",
            "Explains how TV and computer screens create colors"
          ]
        },
        {
          "step": "4",
          "process": "Polarization",
          "description": "Get two pairs of polarized sunglasses or polarizing filters.",
          "mechanism": "Look through one filter at a light source. Then hold the second filter in front and rotate it.",
          "result": "As you rotate, the light gets brighter and dimmer, and can even become completely black at certain angles.",
          "applications": [
            "Demonstrates transverse wave nature of light",
            "Shows how polarized sunglasses reduce glare"
          ]
        }
      ]
    },
    {
      "section_title": "Practice Questions",
      "introduction": "Apply your understanding of the nature of light.",
      "worked_examples": [
        {
          "title": "Problem 1: Light vs Sound",
          "problem": "Explain why we see lightning before we hear thunder, even though both originate from the same event.",
          "step_by_step": [
            {
              "step": "Identify wave types",
              "explanation": "Light is an electromagnetic wave; sound is a mechanical wave."
            },
            {
              "step": "Compare speeds",
              "explanation": "Light travels at 300,000 km/s; sound travels at only about 0.34 km/s in air."
            },
            {
              "step": "Conclusion",
              "explanation": "Light reaches us almost instantly; sound takes several seconds per kilometer of distance."
            }
          ],
          "final_answer": "We see lightning first because light travels nearly a million times faster than sound.",
          "concept_applied": "Light speed vs sound speed."
        },
        {
          "title": "Problem 2: Light's Medium",
          "problem": "Does light need a medium to travel through? Support your answer with an example.",
          "step_by_step": [
            {
              "step": "Recall property",
              "explanation": "Light is an electromagnetic wave—it does not require a medium."
            },
            {
              "step": "Provide example",
              "explanation": "Sunlight travels through the vacuum of space to reach Earth, proving no medium is needed."
            }
          ],
          "final_answer": "No, light does not need a medium. Sunlight reaches Earth through empty space.",
          "concept_applied": "Electromagnetic waves vs mechanical waves."
        },
        {
          "title": "Problem 3: Wave-Particle Duality",
          "problem": "Describe two experiments or phenomena that show light's wave nature and two that show its particle nature.",
          "step_by_step": [
            {
              "step": "Wave nature evidence",
              "explanation": "Interference (double-slit experiment) and diffraction (light bending around edges) show wave behavior."
            },
            {
              "step": "Particle nature evidence",
              "explanation": "Photoelectric effect (light knocking electrons loose) and individual photon detection show particle behavior."
            }
          ],
          "final_answer": "Wave nature: interference, diffraction. Particle nature: photoelectric effect, photon counting.",
          "concept_applied": "Evidence for wave-particle duality."
        },
        {
          "title": "Problem 4: Light Speed in Materials",
          "problem": "Light travels at 300,000 km/s in vacuum. In glass, it travels at about 200,000 km/s. What happens to light's frequency and wavelength when it enters glass?",
          "step_by_step": [
            {
              "step": "Recall relationship",
              "explanation": "v = fλ, and frequency (f) is determined by the source—it doesn't change when entering a new medium."
            },
            {
              "step": "Analyze change",
              "explanation": "If v decreases and f stays constant, then λ must decrease proportionally."
            }
          ],
          "final_answer": "Frequency stays the same; wavelength decreases (becomes shorter) in glass.",
          "concept_applied": "Wave equation in different mediums."
        },
        {
          "title": "Problem 5: Photon Energy",
          "problem": "Blue light has higher frequency than red light. Which color photons carry more energy? Why?",
          "step_by_step": [
            {
              "step": "Recall photon energy formula",
              "explanation": "E = hf, where h is Planck's constant and f is frequency."
            },
            {
              "step": "Compare frequencies",
              "explanation": "Higher frequency means higher energy. Blue light has higher frequency than red."
            }
          ],
          "final_answer": "Blue photons carry more energy because energy is proportional to frequency.",
          "concept_applied": "Photon energy-frequency relationship."
        }
      ]
    },
    {
      "section_title": "Common Misconceptions",
      "introduction": "Here are frequent misunderstandings about the nature of light.",
      "principles": [
        {
          "principle": "Misconception: Light travels instantly",
          "statement": "Many people think light reaches us immediately, with no travel time.",
          "application": "Light has a finite speed—about 300,000 km/s. It takes time to travel, though the times are usually too short to notice on Earth.",
          "example": "Moonlight takes about 1.3 seconds to reach Earth; sunlight takes 8.3 minutes; starlight can take years or centuries."
        },
        {
          "principle": "Misconception: Light needs a medium like sound",
          "statement": "Some assume light, like sound, needs something to travel through.",
          "application": "Light is an electromagnetic wave—it creates its own electric and magnetic fields and needs no medium.",
          "example": "If light needed a medium, we couldn't see the Sun or stars through the vacuum of space."
        },
        {
          "principle": "Misconception: Light is either a wave OR a particle",
          "statement": "Students often think light must be one or the other, like a coin that's either heads or tails.",
          "application": "Light is genuinely both—it exhibits wave properties in some experiments and particle properties in others. Which aspect you observe depends on how you measure it.",
          "example": "The double-slit experiment shows wave interference; the photoelectric effect shows particle behavior."
        },
        {
          "principle": "Misconception: All light is visible",
          "statement": "Many assume \"light\" means only what we can see.",
          "application": "Visible light is just a tiny sliver of the electromagnetic spectrum. Radio waves, microwaves, infrared, ultraviolet, X-rays, and gamma rays are all forms of light—just with different frequencies.",
          "example": "Your remote control uses infrared light (invisible); microwaves are a form of light that heats food; X-rays are light that can pass through soft tissue."
        },
        {
          "principle": "Misconception: Light slows down because it \"tires\"",
          "statement": "Some think light gets tired or worn out when passing through materials.",
          "application": "Light slows in materials because it interacts with atoms—being absorbed and re-emitted, which takes time. It's not tired; it's interacting.",
          "example": "When light exits glass back into air, it immediately returns to its full speed—it hasn't been permanently affected."
        }
      ]
    }
  ],
  "key_terms": [
    "Light",
    "Electromagnetic radiation",
    "Electromagnetic wave",
    "Photon",
    "Speed of light (c)",
    "Wave-particle duality",
    "Transverse wave",
    "Electric field",
    "Magnetic field",
    "Vacuum",
    "Refraction",
    "Reflection",
    "Absorption",
    "Transmission",
    "Photoelectric effect",
    "Frequency",
    "Wavelength",
    "Amplitude",
    "Polarization",
    "Photon energy (E = hf)"
  ],
  "summary": "Light is electromagnetic radiation that travels as transverse waves at the ultimate speed of 300,000 km/s in vacuum. Unlike mechanical waves, light requires no medium—it propagates through empty space via self-sustaining oscillations of electric and magnetic fields. Light exhibits wave-particle duality: it behaves as waves (showing interference, diffraction, and polarization) in some experiments and as particles (photons) in others (photoelectric effect). Each photon carries energy proportional to its frequency: E = hf. Light travels fastest in vacuum and slows down in transparent materials like water and glass due to interactions with atoms. When light encounters matter, it can be transmitted (pass through), absorbed (energy converted to heat or other forms), reflected (bounce off), or refracted (bend). Understanding light's true nature—as both wave and particle, as the fastest thing in the universe, and as the carrier of energy across space—is essential for exploring reflection, mirrors, and all optical phenomena in the sections ahead."
}
