{
  "expanded_description": "This section explores the properties of plane (flat) mirrors, the simplest and most common type of mirror. Students will learn how images are formed in plane mirrors, why images appear behind the mirror, how image size compares to object size, and why left and right appear swapped. These fundamental concepts establish the foundation for understanding more complex curved mirrors.",
  "core_concept": {
    "principle": "Plane mirrors produce virtual images that appear behind the mirror at the same distance as the object is in front. The image is upright, the same size as the object, and laterally inverted (left and right are swapped).",
    "explanation": "When you look into a flat mirror, you see what appears to be another person standing behind the glass. This image isn't really there—it's virtual, created by your brain tracing reflected rays back to where they seem to originate. The light rays themselves are reflecting off the mirror, but your brain assumes they traveled in straight lines, so it projects them behind the mirror. The result is an image that's exactly the same size as you, the same distance behind as you are in front, but with your left and right sides swapped.",
    "image": {
      "src": "images/unit9/plane_mirror_basics.png",
      "alt": "Diagram showing an object in front of a plane mirror, with reflected rays appearing to come from a virtual image behind the mirror",
      "caption": "Plane mirrors create virtual images that appear behind the mirror at the same distance as the object is in front"
    }
  },
  "sections": [
    {
      "section_title": "How Plane Mirrors Form Images",
      "introduction": "When you look into a flat mirror, you see a complete image of yourself. Understanding how this image forms requires tracing what happens to light rays reflecting off the mirror.",
      "key_concept": {
        "definition": "A plane mirror is a flat, smooth surface that reflects light specularly. It forms a virtual image located behind the mirror at the same distance as the object is in front.",
        "context": "The image is called 'virtual' because light rays don't actually come from behind the mirror—they only appear to. You can't project a virtual image onto a screen because the rays don't really meet there."
      },
      "principles": [
        {
          "principle": "Ray Tracing",
          "statement": "To locate an image, we trace at least two rays from a point on the object to the mirror and follow the law of reflection. Where the reflected rays appear to come from (when extended behind the mirror) is the image point.",
          "application": "By tracing rays from the top and bottom of an object, we can determine the location, size, and orientation of the entire image.",
          "example": "A ray from the top of your head hits the mirror and reflects. Your eye traces this ray back in a straight line behind the mirror. Another ray from your chin does the same. Where these imaginary lines meet is where you see the top and bottom of your image.",
          "analogy": "It's like seeing a reflection in water: the tree appears underwater because your brain assumes light traveled straight, but it actually reflected off the surface."
        },
        {
          "principle": "Virtual Images",
          "statement": "The image in a plane mirror is virtual—light rays do not actually come from the image location. They only appear to diverge from that point when traced backward.",
          "application": "This is why you can't place a screen behind a mirror and catch the image. The image exists only in your perception.",
          "example": "If you stand in front of a mirror and hold a piece of paper behind the mirror, you won't see your image on the paper—the light never reaches there."
        }
      ],
      "image": {
        "src": "images/unit9/ray_tracing_plane_mirror.png",
        "alt": "Ray diagram showing two rays from an object reflecting off a plane mirror and appearing to diverge from a virtual image behind the mirror",
        "caption": "Tracing rays shows that the image appears behind the mirror at the same distance as the object"
      }
    },
    {
      "section_title": "Characteristics of Plane Mirror Images",
      "introduction": "Images in plane mirrors have four key characteristics that you can observe every time you look into a mirror.",
      "classifications": [
        {
          "type": "Image Distance",
          "value": "Image distance = Object distance",
          "characteristics": [
            "Image appears as far behind the mirror as object is in front",
            "If you stand 1 m from mirror, image appears 1 m behind",
            "Distance measured perpendicular to mirror surface"
          ],
          "behavior": "This relationship holds because each ray reflects symmetrically. The path length from object to mirror equals the apparent path length from mirror to image.",
          "examples": [
            {
              "process": "Moving closer",
              "explanation": "When you walk toward a mirror, your image moves closer too—it always stays the same distance behind as you are in front."
            },
            {
              "process": "Measuring distance",
              "explanation": "If you place an object 50 cm from a mirror, the image appears 50 cm behind, so total distance between object and image is 100 cm."
            }
          ]
        },
        {
          "type": "Image Size",
          "value": "Image height = Object height",
          "characteristics": [
            "Image is exactly the same size as the object",
            "No magnification or reduction",
            "You see yourself at actual size"
          ],
          "behavior": "Because rays reflect symmetrically, the angular size of the image equals the angular size of the object, making them appear the same size.",
          "examples": [
            {
              "process": "Full-length mirror",
              "explanation": "To see your entire body, you only need a mirror half your height, placed appropriately—not a full-length mirror!"
            },
            {
              "process": "Child vs adult",
              "explanation": "A child sees a child-sized image; an adult sees an adult-sized image—the mirror doesn't change size."
            }
          ]
        },
        {
          "type": "Image Orientation",
          "value": "Upright (not inverted)",
          "characteristics": [
            "Image is right-side up",
            "Top of object corresponds to top of image",
            "No vertical flipping"
          ],
          "behavior": "Plane mirrors do not invert images vertically. What's up in reality is up in the image.",
          "examples": [
            {
              "process": "Standing vs handstand",
              "explanation": "Stand normally, your image stands normally. Do a handstand, your image does a handstand too—the mirror doesn't flip you."
            }
          ]
        },
        {
          "type": "Lateral Inversion",
          "value": "Left and right are swapped",
          "characteristics": [
            "Your left hand appears as right hand in image",
            "Text appears backwards",
            "Also called 'mirror reversal'"
          ],
          "behavior": "The mirror doesn't actually swap left and right—it reverses front to back. This creates the appearance of left-right swap because we interpret the image as a rotated version of ourselves.",
          "examples": [
            {
              "process": "AMBULANCE lettering",
              "explanation": "Ambulances have 'AMBULANCE' written backwards on the hood so drivers see it correctly in their rearview mirrors."
            },
            {
              "process": "Reading in mirror",
              "explanation": "Hold a page up to a mirror—the text appears backwards and is difficult to read."
            },
            {
              "process": "Parting your hair",
              "explanation": "If you part your hair on the left, your mirror image appears to part it on the right."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit9/mirror_characteristics.png",
        "alt": "Diagram showing object and image with equal distances, equal sizes, upright orientation, and left-right swap",
        "caption": "Plane mirror images are the same distance, same size, upright, but laterally inverted"
      },
      "note": "Lateral inversion is why it's difficult to cut your own hair while looking in a mirror—your brain has to compensate for the left-right reversal."
    },
    {
      "section_title": "Why Left and Right Appear Swapped",
      "introduction": "Everyone notices that mirrors swap left and right, but have you ever wondered why they don't swap up and down? The answer reveals something important about how mirrors work.",
      "key_concept": {
        "definition": "Lateral inversion occurs because mirrors reverse the direction perpendicular to their surface (front-to-back), not left-to-right. We interpret this as a left-right swap because we mentally rotate ourselves to face the image.",
        "context": "The mirror doesn't actually swap your left and right hands—it reflects the hand that's on the left side of the mirror, which corresponds to your right hand when you face the mirror."
      },
      "principles": [
        {
          "principle": "Front-to-Back Reversal",
          "statement": "A mirror reverses the direction perpendicular to its surface. If you point toward the mirror, your image points back at you. This is the only reversal that actually occurs.",
          "application": "Your left hand is still on the left side of the mirror—but because the image is facing you, that side corresponds to your right hand from your perspective.",
          "example": "Point north at a mirror facing south. Your image points south (back at you). Your left hand (west) appears on the west side of the image, but because the image faces you, that's your right hand from your view.",
          "analogy": "Imagine a transparent person standing behind the glass facing you. If they raise their right hand, it matches your left. That's what the mirror does—it creates a person facing you."
        },
        {
          "principle": "Why Up and Down Aren't Swapped",
          "statement": "The mirror doesn't reverse up and down because those directions are parallel to the mirror surface, not perpendicular. Gravity provides a consistent reference that we don't mentally rotate.",
          "application": "Up is still up in the image because we don't imagine the image doing a headstand—we see it as facing us, not upside down.",
          "example": "Raise your right hand while looking in a mirror. Your image raises the hand on the same side of the mirror—but because it's facing you, that looks like its left hand. Raise both hands, and both go up—up is still up."
        }
      ],
      "image": {
        "src": "images/unit9/lateral_inversion_explanation.png",
        "alt": "Diagram showing that mirrors reverse front-to-back, which we interpret as left-right swap because the image faces us",
        "caption": "Mirrors reverse front-to-back, not left-to-right. The apparent left-right swap comes from the image facing you."
      }
    },
    {
      "section_title": "Minimum Mirror Height",
      "introduction": "Have you ever wondered how tall a mirror needs to be to see your entire body? The answer is surprisingly small—only half your height!",
      "key_concept": {
        "definition": "To see your full height in a vertical plane mirror, you only need a mirror half your height, positioned correctly. The top of the mirror should be at eye level, and the bottom halfway between your eyes and feet.",
        "context": "This works because the angle of incidence equals the angle of reflection—light from your feet reaches your eyes after reflecting at a point halfway up the mirror."
      },
      "principles": [
        {
          "principle": "Ray Diagram Proof",
          "statement": "A ray from your feet to your eyes strikes the mirror at a point halfway between your feet and eyes. A ray from the top of your head strikes at a point halfway between your eyes and head. The mirror need only span between these two points.",
          "application": "If your eyes are at height E and your feet at 0, the ray from your feet hits at height E/2. The ray from the top of your head (height H) hits at height (E+H)/2. The required mirror height is (E+H)/2 - E/2 = H/2.",
          "example": "For a person 1.6 m tall with eyes at 1.5 m, the mirror needs to extend from 0.75 m (E/2) to 1.55 m ((E+H)/2)—a height of 0.8 m, exactly half the person's height.",
          "analogy": "Think of bouncing a ball to yourself: to catch a ball you throw at the floor, it must hit at the midpoint between you and where you'll catch it. Light does the same."
        },
        {
          "principle": "Position Matters",
          "statement": "The mirror must be positioned so that its top is at the level of the ray from your eyes to the top of your head, and its bottom at the level of the ray from your eyes to your feet.",
          "application": "If you move closer or farther, the required mirror height doesn't change—only its vertical position matters. The mirror can be any distance away as long as it's in the right vertical location.",
          "example": "A full-length mirror isn't necessary—a half-height mirror placed correctly shows your entire body. Try it with a small mirror against a wall!"
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Minimum Mirror Height",
          "problem": "A person is 170 cm tall with eyes at 160 cm above the floor. What is the minimum mirror height needed to see their full height, and where should it be placed?",
          "step_by_step": [
            {
              "step": "Identify given values",
              "explanation": "Total height H = 170 cm, eye height E = 160 cm"
            },
            {
              "step": "Calculate minimum mirror height",
              "explanation": "Minimum height = H/2 = 170/2 = 85 cm"
            },
            {
              "step": "Find top of mirror",
              "explanation": "Top of mirror at (E+H)/2 = (160+170)/2 = 330/2 = 165 cm"
            },
            {
              "step": "Find bottom of mirror",
              "explanation": "Bottom of mirror at E/2 = 160/2 = 80 cm"
            }
          ],
          "final_answer": "A mirror 85 cm tall, placed with its bottom at 80 cm and top at 165 cm above the floor, will show the person's full height.",
          "concept_applied": "Minimum mirror height formula."
        },
        {
          "title": "Verifying with Different Eye Heights",
          "problem": "Two people are both 160 cm tall. Person A has eyes at 155 cm, Person B has eyes at 150 cm. Do they need different mirror positions?",
          "step_by_step": [
            {
              "step": "Calculate for Person A",
              "explanation": "E = 155, H = 160. Bottom = 155/2 = 77.5 cm, Top = (155+160)/2 = 157.5 cm"
            },
            {
              "step": "Calculate for Person B",
              "explanation": "E = 150, H = 160. Bottom = 150/2 = 75 cm, Top = (150+160)/2 = 155 cm"
            },
            {
              "step": "Compare",
              "explanation": "Different eye heights require different mirror positions, even though total height is the same."
            }
          ],
          "final_answer": "Yes, they need different mirror positions because eye height affects where rays strike the mirror.",
          "concept_applied": "Eye height affects mirror placement."
        }
      ],
      "image": {
        "src": "images/unit9/minimum_mirror_height.png",
        "alt": "Ray diagram showing light from feet and head reflecting to eyes, demonstrating that only half-height mirror is needed",
        "caption": "You only need a mirror half your height to see your full reflection"
      }
    },
    {
      "section_title": "Multiple Reflections",
      "introduction": "When two or more mirrors face each other, light can reflect multiple times, creating multiple images. This is the principle behind kaleidoscopes and some dressing room mirrors.",
      "principles": [
        {
          "principle": "Two Parallel Mirrors",
          "statement": "When two mirrors face each other parallel, light can bounce back and forth many times, creating an infinite series of images receding into the distance.",
          "application": "Each reflection creates a new virtual image. The first image in each mirror becomes the object for the next reflection, creating images at regular intervals.",
          "example": "In a clothing store fitting room with mirrors on opposite walls, you see countless copies of yourself stretching to infinity."
        },
        {
          "principle": "Mirrors at an Angle",
          "statement": "When two mirrors are at an angle, the number of images depends on the angle. The formula is n = (360°/θ) - 1, where θ is the angle between mirrors.",
          "application": "Smaller angles produce more images. At 90°, you see 3 images; at 60°, you see 5 images; at 45°, you see 7 images.",
          "example": "A kaleidoscope uses mirrors at 60° angles with colored objects to create beautiful symmetrical patterns."
        }
      ],
      "classifications": [
        {
          "type": "Common Mirror Angles",
          "value": "Number of images produced",
          "characteristics": [
            "180° (flat): 1 image",
            "90° (right angle): 3 images",
            "60°: 5 images",
            "45°: 7 images",
            "0° (parallel): infinite images"
          ],
          "behavior": "Each image is formed by light reflecting off one or both mirrors. The total number includes the original object and all reflections.",
          "examples": [
            {
              "process": "Dressing room corner",
              "explanation": "Two mirrors at 90° in a store corner let you see yourself from multiple angles."
            },
            {
              "process": "Kaleidoscope",
              "explanation": "Three mirrors at 60° create endless symmetrical patterns from small colored objects."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit9/multiple_reflections.png",
        "alt": "Diagrams showing multiple reflections in parallel mirrors (infinite series) and angled mirrors (finite number)",
        "caption": "Multiple mirrors create multiple images—infinite with parallel mirrors, finite with angled mirrors"
      }
    },
    {
      "section_title": "Real-World Applications of Plane Mirrors",
      "introduction": "Plane mirrors are everywhere, and understanding their properties helps us use them effectively.",
      "categories": [
        {
          "type": "Everyday Use",
          "description": "Common applications in daily life.",
          "examples": [
            {
              "process": "Bathroom mirrors",
              "explanation": "Allow us to see ourselves for grooming—the image distance equals object distance, so we see ourselves at actual size."
            },
            {
              "process": "Rearview mirrors",
              "explanation": "Flat mirrors in cars let drivers see behind them. Some have a day/night adjustment that tilts the mirror to reduce glare."
            },
            {
              "process": "Full-length mirrors",
              "explanation": "Larger mirrors show entire body—though technically only half height is needed, full-length is more convenient."
            },
            {
              "process": "Makeup/shaving mirrors",
              "explanation": "Some are flat; others are magnifying (curved) for detailed work."
            }
          ]
        },
        {
          "type": "Optical Instruments",
          "description": "Scientific and technical applications.",
          "examples": [
            {
              "process": "Periscopes",
              "explanation": "Two parallel mirrors at 45° allow viewing over obstacles—used in submarines and tanks."
            },
            {
              "process": "Kaleidoscopes",
              "explanation": "Angled mirrors create symmetrical patterns from colored objects."
            },
            {
              "process": "Interferometers",
              "explanation": "Precision instruments use multiple reflections to measure tiny distances."
            },
            {
              "process": "Laser cavities",
              "explanation": "Highly reflective mirrors at ends of laser tubes bounce light back and forth to amplify it."
            }
          ]
        },
        {
          "type": "Safety and Security",
          "description": "Using mirrors for visibility and monitoring.",
          "examples": [
            {
              "process": "Convex security mirrors",
              "explanation": "Though curved, they're related—placed in stores to see around corners."
            },
            {
              "process": "Blind spot mirrors",
              "explanation": "Small convex mirrors attached to side mirrors reduce blind spots."
            },
            {
              "process": "ATM mirrors",
              "explanation": "Small mirrors let users see behind them for security."
            }
          ]
        },
        {
          "type": "Art and Entertainment",
          "description": "Creative uses of reflection.",
          "examples": [
            {
              "process": "Mirror mazes",
              "explanation": "Arrays of mirrors create confusing paths and infinite reflections for entertainment."
            },
            {
              "process": "Infinity rooms",
              "explanation": "Art installations with parallel mirrors create the illusion of endless space."
            },
            {
              "process": "Theater illusions",
              "explanation": "The famous 'Pepper's Ghost' illusion uses a mirror to make ghostly images appear on stage."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit9/plane_mirror_applications.png",
        "alt": "Collage showing rearview mirror, periscope, kaleidoscope, and mirror maze",
        "caption": "Plane mirrors are used everywhere—from cars to submarines to art installations"
      }
    },
    {
      "section_title": "Simple Plane Mirror Experiments",
      "introduction": "You can explore plane mirror properties with simple materials.",
      "process_flow": [
        {
          "step": "1",
          "process": "Image distance verification",
          "description": "Place a mirror vertically on a table. Put an object (like a small toy) in front of it.",
          "mechanism": "Try to touch the image by reaching behind the mirror. Then measure distances.",
          "result": "You can't touch the image—it's virtual. Measure object distance from mirror and image distance from mirror (by marking where image appears and measuring behind). They're equal.",
          "applications": [
            "Demonstrates image distance = object distance",
            "Shows image is virtual"
          ]
        },
        {
          "step": "2",
          "process": "Lateral inversion demonstration",
          "description": "Write your name on a piece of paper. Hold it up to a mirror.",
          "mechanism": "Observe how the text appears in the mirror. Try to read it.",
          "result": "The text appears backwards. This is lateral inversion.",
          "applications": [
            "Demonstrates left-right reversal",
            "Explains why ambulance lettering is reversed"
          ]
        },
        {
          "step": "3",
          "process": "Minimum mirror height test",
          "description": "Find a small mirror and a wall. Mark your eye height and top of head on the wall with tape.",
          "mechanism": "Have a friend hold the mirror vertically and move it until you can see both your feet and head. Measure the mirror height.",
          "result": "The mirror needed is about half your height, positioned with its top near eye level.",
          "applications": [
            "Verifies minimum mirror height principle",
            "Shows practical application of ray diagrams"
          ]
        },
        {
          "step": "4",
          "process": "Multiple reflections",
          "description": "Place two mirrors facing each other (parallel) or at an angle (try 90°, 60°, 45°). Put a small object between them.",
          "mechanism": "Count the images you see at each angle. For parallel mirrors, observe the infinite series.",
          "result": "You'll see multiple images—the number increases as angle decreases.",
          "applications": [
            "Demonstrates multiple reflections",
            "Shows how kaleidoscopes work"
          ]
        }
      ]
    },
    {
      "section_title": "Practice Questions",
      "introduction": "Apply your understanding of plane mirrors.",
      "worked_examples": [
        {
          "title": "Problem 1: Image Distance",
          "problem": "You stand 2.5 meters in front of a plane mirror. How far behind the mirror does your image appear? What is the distance between you and your image?",
          "step_by_step": [
            {
              "step": "Image distance",
              "explanation": "Image distance = object distance = 2.5 m behind mirror"
            },
            {
              "step": "Total distance",
              "explanation": "You to mirror = 2.5 m, mirror to image = 2.5 m, total = 5 m"
            }
          ],
          "final_answer": "Image appears 2.5 m behind mirror; distance between you and image is 5 m.",
          "concept_applied": "Image distance equals object distance."
        },
        {
          "title": "Problem 2: Mirror Height",
          "problem": "A person is 180 cm tall with eyes at 170 cm. What is the minimum mirror height needed to see their full height? Where should the top and bottom of the mirror be?",
          "step_by_step": [
            {
              "step": "Calculate minimum height",
              "explanation": "H/2 = 180/2 = 90 cm"
            },
            {
              "step": "Find top position",
              "explanation": "(E+H)/2 = (170+180)/2 = 350/2 = 175 cm"
            },
            {
              "step": "Find bottom position",
              "explanation": "E/2 = 170/2 = 85 cm"
            }
          ],
          "final_answer": "Mirror height = 90 cm, placed from 85 cm to 175 cm above floor.",
          "concept_applied": "Minimum mirror height formula."
        },
        {
          "title": "Problem 3: Lateral Inversion",
          "problem": "You hold a sign reading 'HELP' in front of a mirror. How will it appear? Why?",
          "step_by_step": [
            {
              "step": "Apply lateral inversion",
              "explanation": "The image will show the letters reversed left to right."
            },
            {
              "step": "Write result",
              "explanation": "It will appear as 'qIɘH' (roughly—the exact appearance depends on letter shapes)."
            }
          ],
          "final_answer": "The text appears backwards because mirrors reverse front-to-back, which we perceive as left-right reversal.",
          "concept_applied": "Lateral inversion in mirrors."
        },
        {
          "title": "Problem 4: Multiple Reflections",
          "problem": "Two mirrors are placed at a 60° angle. How many images will you see of an object placed between them?",
          "step_by_step": [
            {
              "step": "Use formula",
              "explanation": "n = (360°/θ) - 1 = (360/60) - 1 = 6 - 1 = 5 images"
            }
          ],
          "final_answer": "You will see 5 images.",
          "concept_applied": "Multiple reflections in angled mirrors."
        },
        {
          "title": "Problem 5: Ray Diagram Reasoning",
          "problem": "Explain why you only need a mirror half your height to see your entire body, but a full-length mirror shows your entire body more conveniently.",
          "step_by_step": [
            {
              "step": "Half-height explanation",
              "explanation": "Ray tracing shows that rays from feet and head strike the mirror at points that are only half your height apart."
            },
            {
              "step": "Convenience factor",
              "explanation": "A half-height mirror requires precise positioning. A full-length mirror works for people of different heights and doesn't need exact placement."
            }
          ],
          "final_answer": "Physics requires only half your height, but practical convenience makes full-length mirrors more useful.",
          "concept_applied": "Theory vs practice in mirror design."
        }
      ]
    },
    {
      "section_title": "Common Misconceptions",
      "introduction": "Here are frequent misunderstandings about plane mirrors.",
      "principles": [
        {
          "principle": "Misconception: Mirrors swap left and right",
          "statement": "Many people believe mirrors specifically exchange left and right.",
          "application": "Mirrors actually reverse front-to-back. The left-right swap is how we interpret that reversal when facing the image.",
          "example": "Point east at a mirror facing west. Your image points west (back at you). Your left hand (north) appears on the north side of the image—but because it faces you, that's your right hand from your view."
        },
        {
          "principle": "Misconception: The image is on the mirror surface",
          "statement": "Some think the image exists right on the mirror's surface.",
          "application": "The image appears behind the mirror, at the same distance as the object is in front. You can demonstrate this by trying to touch the image—you reach behind the mirror.",
          "example": "If you place a candle 30 cm from a mirror, its image appears 30 cm behind. The total distance between candle and image is 60 cm."
        },
        {
          "principle": "Misconception: You need a full-length mirror to see your whole body",
          "statement": "Many assume a mirror must be as tall as you to show your entire body.",
          "application": "Ray diagrams prove you only need a mirror half your height, properly positioned. Try it with a small mirror against a wall!",
          "example": "A 90 cm mirror can show a 180 cm tall person if placed correctly."
        },
        {
          "principle": "Misconception: Moving closer makes your image larger",
          "statement": "People think their image grows as they approach a mirror.",
          "application": "Your image stays exactly the same size. It appears to fill more of your field of view because it's closer, but its actual size doesn't change.",
          "example": "A ruler held next to your face and its image would measure the same size at any distance."
        },
        {
          "principle": "Misconception: Mirrors show you as others see you",
          "statement": "Many believe their mirror image is exactly what others see.",
          "application": "Others see you without left-right reversal. Your mirror image is reversed. Photos show you as others see you (unless also reversed).",
          "example": "This is why people often feel their photo looks 'wrong'—they're used to their reversed mirror image."
        }
      ]
    }
  ],
  "key_terms": [
    "Plane mirror",
    "Flat mirror",
    "Virtual image",
    "Image distance",
    "Object distance",
    "Ray tracing",
    "Law of reflection",
    "Upright image",
    "Same size image",
    "Lateral inversion",
    "Mirror reversal",
    "Minimum mirror height",
    "Multiple reflections",
    "Parallel mirrors",
    "Angled mirrors",
    "Periscope",
    "Kaleidoscope"
  ],
  "summary": "Plane (flat) mirrors produce virtual images that appear behind the mirror at the same distance as the object is in front. The images are upright, exactly the same size as the object, and laterally inverted (left and right appear swapped). This left-right swap occurs because mirrors reverse front-to-back, not left-to-right—we interpret this as a left-right swap because the image faces us. Ray tracing using the law of reflection explains all these properties. A surprising result is that you only need a mirror half your height to see your entire body, positioned with its top at eye level and bottom halfway between eyes and feet. When two mirrors face each other, multiple reflections occur—parallel mirrors create an infinite series of images, while angled mirrors produce a finite number given by n = (360°/θ) - 1. Plane mirrors have countless applications: rearview mirrors in vehicles, periscopes for viewing over obstacles, kaleidoscopes for entertainment, and everyday grooming. Understanding plane mirrors establishes the foundation for exploring curved mirrors (concave and convex), where image size and orientation can change dramatically."
}
