{
  "expanded_description": "How can we analyze situations where outcomes depend on what multiple decision-makers do? Game theory provides the tools. Originally developed to analyze parlor games, it has become essential for understanding oligopoly, bargaining, auctions, and many other economic interactions. In oligopoly, firms are like players in a game—each chooses a strategy, and the payoff to each depends on what all do. Key concepts like the prisoner's dilemma and Nash equilibrium help explain why oligopolists often struggle to cooperate, even when cooperation would make them all better off. Understanding game theory is essential for analyzing strategic behavior in economics and beyond.",
  
  "core_concept": {
    "principle": "Game theory is the study of strategic decision-making in situations where the outcome for each participant depends on the choices of all. (1) Key elements: Players (decision-makers), strategies (possible actions), payoffs (outcomes for each combination of strategies), and information (what players know). (2) Nash equilibrium: A set of strategies where no player can improve their payoff by unilaterally changing their strategy, given what others are doing. Each player is playing their best response to others' strategies. (3) Prisoner's dilemma: A famous game where individual rationality leads to a worse outcome for all than if they had cooperated. It explains why cooperation is difficult to sustain. (4) Dominant strategy: A strategy that is best for a player regardless of what others do. (5) Applications in oligopoly: Pricing decisions, advertising, output choices, and collusion can all be modeled as games. The prisoner's dilemma helps explain why cartels often break down.",
    
    "explanation": "Think of two prisoners interrogated separately. Each can confess or remain silent. If both stay silent, they get light sentences. If one confesses and implicates the other, the confessor goes free while the other gets a harsh sentence. If both confess, both get medium sentences. Individually, each is better off confessing no matter what the other does. But when both confess, they end up worse than if both had stayed silent. This is the prisoner's dilemma—and it explains why competitors often end up in price wars even though they'd both prefer high prices.",
    
    "image": {
      "src": "images/unit7/game_theory_overview.png",
      "alt": "Prisoner's dilemma payoff matrix showing two prisoners' choices",
      "caption": "Figure 7.4.1: Game theory analyzes strategic interactions like the prisoner's dilemma."
    }
  },

  "sections": [
    {
      "section_title": "7.4 Game Theory Introduction",
      "introduction": "How can we analyze situations where outcomes depend on what multiple decision-makers do? Game theory provides the tools. Originally developed to analyze parlor games, it has become essential for understanding oligopoly, bargaining, auctions, and many other economic interactions. In oligopoly, firms are like players in a game—each chooses a strategy, and the payoff to each depends on what all do. Key concepts like the prisoner's dilemma and Nash equilibrium help explain why oligopolists often struggle to cooperate, even when cooperation would make them all better off. Understanding game theory is essential for analyzing strategic behavior in economics and beyond.",
      
      "introduction_image": {
        "src": "images/unit7/game_theory_intro.png",
        "alt": "Two players at a game board, each thinking about the other's move",
        "caption": "Figure 7.4.2: Game theory analyzes strategic interactions where each player's outcome depends on others' choices."
      },
      
      "key_concept": {
        "definition": "Game theory is a framework for analyzing strategic interactions—situations where the outcome for each participant depends on the choices of all. (1) Elements of a game: (a) Players: The decision-makers (e.g., firms, individuals, countries). (b) Strategies: The possible actions each player can take (e.g., set high price or low price, advertise or not). (c) Payoffs: The outcomes for each player given the combination of strategies chosen, often represented in a payoff matrix. (d) Information: What players know about the game and others' payoffs. (2) Types of games: Cooperative vs. non-cooperative, simultaneous vs. sequential, one-shot vs. repeated, zero-sum vs. variable-sum. (3) Key concepts: (a) Dominant strategy: A strategy that is best for a player regardless of what others do. (b) Nash equilibrium: A set of strategies where no player can improve their payoff by unilaterally changing their strategy. Each player is playing their best response to others' strategies. (c) Prisoner's dilemma: A game where each player has a dominant strategy to defect, leading to an outcome that is worse for all than if they had cooperated. (4) Applications in economics: Oligopoly pricing, advertising decisions, R&D races, bargaining, auctions, and many others.",
        
        "context": "Game theory was developed by mathematicians John von Neumann and Oskar Morgenstern in their 1944 book \"Theory of Games and Economic Behavior.\" John Nash (subject of the film \"A Beautiful Mind\") developed the concept of Nash equilibrium in the 1950s. Today, game theory is used throughout economics, political science, biology, and other fields. In AP Microeconomics, understanding basic game theory is essential for analyzing oligopoly behavior, particularly why collusion is difficult to sustain and why firms often end up in situations like the prisoner's dilemma.",
        
        "image": {
          "src": "images/unit7/game_elements.png",
          "alt": "Diagram showing players, strategies, payoffs, and information",
          "caption": "Figure 7.4.3: Every game has players, strategies, payoffs, and information."
        }
      },

      "classifications": [
        {
          "type": "Prisoner's Dilemma",
          "value": "Game where individual rationality leads to collective irrationality",
          "characteristics": ["Each player has dominant strategy to defect", "Mutual defection worse than mutual cooperation", "Explains why cooperation fails", "Common in oligopoly", "One-shot vs. repeated matters"],
          "behavior": "The prisoner's dilemma is the most famous game in social science. In the classic story, two prisoners are interrogated separately. Each can confess (defect) or remain silent (cooperate). The payoffs are structured so that each player has a dominant strategy to confess, regardless of what the other does. But when both confess, they get a worse outcome than if both had remained silent. The dilemma is that individually rational behavior leads to a collectively inferior outcome. This game explains many real-world phenomena: price competition in oligopoly (firms would be better off with high prices, but each has incentive to cut prices), arms races, environmental agreements, and more. In one-shot interactions, defection is inevitable. In repeated interactions, cooperation may be possible through strategies like tit-for-tat.",
          
          "image": {
            "src": "images/unit7/prisoners_dilemma.png",
            "alt": "Payoff matrix for prisoner's dilemma",
            "caption": "Figure 7.4.4: Prisoner's dilemma payoff matrix."
          },
          
          "examples": [
            {
              "process": "Oligopoly pricing",
              "explanation": "Two firms can charge high prices (cooperate) and both earn high profits, or cut prices (defect) to gain market share. Each has incentive to cut, but when both cut, profits fall—a prisoner's dilemma."
            },
            {
              "process": "Advertising competition",
              "explanation": "Two firms can both avoid advertising (cooperate) and save costs, or advertise to steal customers. Each has incentive to advertise, but mutual advertising just cancels out and wastes money."
            }
          ]
        },
        {
          "type": "Nash Equilibrium",
          "value": "Stable state where no player wants to change unilaterally",
          "characteristics": ["Each player plays best response to others", "No profitable unilateral deviation", "May not be unique", "May not be Pareto optimal", "Fundamental solution concept"],
          "behavior": "Nash equilibrium is the most important solution concept in game theory. A set of strategies forms a Nash equilibrium if no player can improve their payoff by changing their own strategy, assuming others' strategies remain fixed. Each player is playing a best response to the strategies of others. In a Nash equilibrium, all players are simultaneously doing the best they can given what others are doing. Nash equilibria can be found by looking for cells in a payoff matrix where neither player would want to change unilaterally. A game may have one Nash equilibrium, multiple equilibria, or none (in pure strategies). The prisoner's dilemma has a unique Nash equilibrium (both confess), which is not Pareto optimal. Nash equilibrium is used to analyze everything from oligopoly pricing to international trade negotiations.",
          
          "image": {
            "src": "images/unit7/nash_eq.png",
            "alt": "Payoff matrix with Nash equilibrium circled",
            "caption": "Figure 7.4.5: Nash equilibrium occurs where no player wants to change unilaterally."
          },
          
          "examples": [
            {
              "process": "Prisoner's dilemma",
              "explanation": "In the prisoner's dilemma, the Nash equilibrium is both confess. Neither prisoner can improve by changing alone—if one confesses and the other is silent, the confessor does better; if both confess, neither can improve by switching to silent."
            }
          ]
        },
        {
          "type": "Dominant Strategy",
          "value": "Strategy that is best regardless of others' choices",
          "characteristics": ["Always optimal", "Simplifies analysis", "Strong prediction", "Not always present", "Leads to clear equilibrium"],
          "behavior": "A dominant strategy is one that yields the highest payoff for a player no matter what strategies the other players choose. If a player has a dominant strategy, they will always play it, regardless of their beliefs about others. This makes the analysis simple—the player's choice is determined without needing to predict others' behavior. When all players have dominant strategies, the outcome is determined straightforwardly. In the prisoner's dilemma, both players have dominant strategies to confess. However, dominant strategies are not always present. In many games, the best response depends on what others do, requiring more subtle analysis. The absence of dominant strategies is why game theory becomes interesting—players must think strategically about others' likely actions.",
          
          "image": {
            "src": "images/unit7/dominant.png",
            "alt": "Payoff matrix showing dominant strategy",
            "caption": "Figure 7.4.6: A dominant strategy is best regardless of others' choices."
          },
          
          "examples": [
            {
              "process": "Prisoner's dilemma",
              "explanation": "In the classic prisoner's dilemma, confess is a dominant strategy for each prisoner—it yields a better outcome whether the other confesses or stays silent."
            }
          ]
        },
        {
          "type": "Best Response",
          "value": "Optimal strategy given what others do",
          "characteristics": ["Conditional on others' choices", "Foundation of Nash equilibrium", "Can be found by analysis", "May change as others change", "Strategic thinking"],
          "behavior": "A best response is the strategy that maximizes a player's payoff given the strategies chosen by other players. Unlike a dominant strategy (which is best regardless of others), a best response is conditional. In Nash equilibrium, every player is playing a best response to the strategies of others. Finding best responses is the key to solving games. For each possible action by others, we determine what the player should do. Then we look for combinations where everyone's actions are mutually best responses. Best response analysis is the foundation of strategic thinking—it requires putting yourself in others' shoes and anticipating their actions.",
          
          "image": {
            "src": "images/unit7/best_response.png",
            "alt": "Player thinking about what others will do",
            "caption": "Figure 7.4.7: A best response is optimal given what others do."
          },
          
          "examples": [
            {
              "process": "Matching game",
              "explanation": "In a simple coordination game, your best response might be to match what the other player does—if they go left, you go left; if they go right, you go right."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Prisoner's Dilemma Shows Why Cooperation Is Difficult",
          "statement": "The prisoner's dilemma is a powerful metaphor for many real-world situations where individually rational behavior leads to collectively undesirable outcomes. In business, firms would often be better off if they could cooperate to keep prices high, limit advertising, or restrain capacity. But each firm has an individual incentive to cheat—cut prices, advertise more, expand capacity—to gain at rivals' expense. When all cheat, everyone ends up worse off. This explains why cartels are unstable, why price wars occur, and why industries often end up in low-profit equilibria despite potential for higher profits. The dilemma can be resolved through repeated interaction, where the threat of future punishment can sustain cooperation (as in the \"tit-for-tat\" strategy). But in one-shot interactions, defection is inevitable.",
          "application": "When analyzing an oligopoly, consider whether the situation resembles a prisoner's dilemma. If so, predict that without mechanisms to enforce cooperation, firms will end up in the low-profit Nash equilibrium.",
          "example": "Two gas stations across the street from each other face a prisoner's dilemma. Both could keep prices high and earn $\\$1,000$ each daily. But each is tempted to cut prices to steal customers. If both cut, they earn only $\\$600$ each. The Nash equilibrium is both cut prices, even though they'd both prefer the high-price outcome.",
          
          "image": {
            "src": "images/unit7/pd_principle.png",
            "alt": "Prisoner's dilemma matrix with arrows showing incentives",
            "caption": "Figure 7.4.8: Prisoner's dilemma shows why cooperation is hard to sustain."
          }
        },
        {
          "principle": "Nash Equilibrium Is the Central Solution Concept",
          "statement": "Nash equilibrium provides a way to predict outcomes in strategic situations. It says that an outcome is stable if no player can improve by changing their own strategy unilaterally. This doesn't mean the outcome is necessarily good (it can be terrible, as in the prisoner's dilemma), but it means that once there, no one wants to move. Nash equilibrium is widely used because it applies to a vast range of games and captures the idea of mutual best responses. Finding Nash equilibria involves looking for strategy combinations where each player's choice is optimal given what others are doing. In some games, there may be multiple Nash equilibria (e.g., coordination games), requiring additional criteria to select among them. In others, there may be no Nash equilibrium in pure strategies, requiring mixed strategies (randomizing).",
          "application": "To find Nash equilibrium, check each cell in a payoff matrix. For each player, ask: Given the other's strategy, could this player do better by switching? If no player wants to switch, that cell is a Nash equilibrium.",
          "example": "In a simple coordination game where two drivers choose left or right, there are two Nash equilibria: (Left, Left) and (Right, Right). Neither driver wants to switch unilaterally.",
          
          "image": {
            "src": "images/unit7/nash_principle.png",
            "alt": "Multiple Nash equilibria in coordination game",
            "caption": "Figure 7.4.9: Nash equilibrium is where no player can improve unilaterally."
          }
        },
        {
          "principle": "Repeated Play Can Enable Cooperation",
          "statement": "In the one-shot prisoner's dilemma, cooperation is impossible—the only Nash equilibrium is mutual defection. But if the same players interact repeatedly, cooperation may emerge. In repeated games, players can use strategies that condition future behavior on past actions. The most famous is \"tit-for-tat\": cooperate on the first move, then copy whatever the other player did on the previous move. This strategy can sustain cooperation because defection is punished in future rounds, making the short-term gain from cheating less attractive than the long-term benefit of continued cooperation. The possibility of cooperation in repeated games depends on factors like the discount rate (how much players value future vs. present), the length of the game, and the ability to monitor and punish defections. This explains why cartels are more stable in industries with frequent interaction and good monitoring.",
          "application": "When analyzing whether firms might cooperate, consider whether they interact repeatedly. If they do, and if they value future profits sufficiently, cooperation may be sustainable even without explicit collusion.",
          "example": "Two airlines compete on the same route daily. They might sustain high prices through tacit collusion—each knows that a price cut today will trigger matching cuts tomorrow, wiping out future profits. The threat of future retaliation supports cooperation.",
          
          "image": {
            "src": "images/unit7/repeated_game.png",
            "alt": "Timeline of repeated interactions with tit-for-tat",
            "caption": "Figure 7.4.10: Repeated play can enable cooperation through strategies like tit-for-tat."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing a Prisoner's Dilemma",
          
          "image": {
            "src": "images/unit7/game_example1.png",
            "alt": "Payoff matrix for two firms",
            "caption": "Figure 7.4.11: Analyze the prisoner's dilemma for two firms."
          },
          
          "problem": "Two firms, A and B, are deciding whether to advertise. The payoff matrix (profits in millions) is:<br>Firm A choices: Advertise or Not Advertise<br>Firm B choices: Advertise or Not Advertise<br>Payoffs (A,B):<br>If both advertise: (4,4)<br>If A advertises, B does not: (8,2)<br>If A does not, B advertises: (2,8)<br>If neither advertises: (6,6)<br>a) Does either firm have a dominant strategy?<br>b) Find the Nash equilibrium.<br>c) Is this a prisoner's dilemma? Explain.<br>d) If the firms could collude, what would they choose? Is this sustainable?",
          
          "step_by_step": [
            {
              "step": "Check for dominant strategies",
              "explanation": "For Firm A: If B advertises, A gets 4 if advertises, 2 if not → advertise better. If B doesn't advertise, A gets 8 if advertises, 6 if not → advertise better. So A has dominant strategy to advertise. Similarly for B: If A advertises, B gets 4 vs 2 → advertise. If A doesn't advertise, B gets 8 vs 6 → advertise. Both have dominant strategy to advertise."
            },
            {
              "step": "Find Nash equilibrium",
              "explanation": "With dominant strategies, the Nash equilibrium is both advertise, giving (4,4). Check: Neither can improve by changing alone. If A changed to not advertise while B advertises, A gets 2 < 4. So no incentive to change."
            },
            {
              "step": "Is this prisoner's dilemma?",
              "explanation": "Yes. The Nash equilibrium (4,4) is worse for both than the cooperative outcome (6,6) where neither advertises. Individual rationality leads to a collectively worse outcome—the defining feature of prisoner's dilemma."
            },
            {
              "step": "Collusion and sustainability",
              "explanation": "If they could collude, they would agree not to advertise, earning (6,6) each. But this is not sustainable because each has incentive to cheat—if A cheats while B follows agreement, A gets 8. Without enforcement, collusion breaks down."
            }
          ],
          
          "final_answer": "a) Both have dominant strategy to advertise. b) Nash equilibrium: (Advertise, Advertise) with (4,4). c) Yes, because individually rational choice leads to worse outcome than cooperation. d) Collude on (Not Advertise, Not Advertise) with (6,6), but unsustainable due to cheating incentive.",
          "concept_applied": "Prisoner's dilemma: dominant strategies lead to inferior Nash equilibrium; cooperation is unstable."
        },
        {
          "title": "Finding Nash Equilibrium",
          
          "image": {
            "src": "images/unit7/game_example2.png",
            "alt": "Payoff matrix for two firms with different payoffs",
            "caption": "Figure 7.4.12: Find Nash equilibrium in a game without dominant strategies."
          },
          
          "problem": "Two firms choose prices: High or Low. The payoff matrix (profits in millions) is:<br>Firm A choices: High, Low<br>Firm B choices: High, Low<br>Payoffs (A,B):<br>(High, High): (10,10)<br>(High, Low): (2,12)<br>(Low, High): (12,2)<br>(Low, Low): (6,6)<br>a) Does either firm have a dominant strategy?<br>b) Find the Nash equilibrium or equilibria.<br>c) Is this a prisoner's dilemma? Why or why not?",
          
          "step_by_step": [
            {
              "step": "Check for dominant strategies",
              "explanation": "For Firm A: If B chooses High, A gets 10 from High, 12 from Low → Low better. If B chooses Low, A gets 2 from High, 6 from Low → Low better. So A has dominant strategy to choose Low. For Firm B: If A chooses High, B gets 10 from High, 12 from Low → Low better. If A chooses Low, B gets 2 from High, 6 from Low → Low better. So B also has dominant strategy to choose Low."
            },
            {
              "step": "Find Nash equilibrium",
              "explanation": "With both having dominant strategies, the Nash equilibrium is (Low, Low) with payoff (6,6)."
            },
            {
              "step": "Is this prisoner's dilemma?",
              "explanation": "Compare to cooperative outcome (High, High) with (10,10). The Nash equilibrium (6,6) is worse for both. So yes, this is a prisoner's dilemma—individually rational choice leads to collectively worse outcome."
            }
          ],
          
          "final_answer": "a) Both have dominant strategy to choose Low. b) Nash equilibrium: (Low, Low) with (6,6). c) Yes, because (6,6) < (10,10) for both.",
          "concept_applied": "Even with symmetric payoffs, dominant strategies can lead to prisoner's dilemma."
        },
        {
          "title": "Coordination Game",
          
          "image": {
            "src": "images/unit7/game_example3.png",
            "alt": "Payoff matrix for coordination game",
            "caption": "Figure 7.4.13: Find Nash equilibria in a coordination game."
          },
          
          "problem": "Two firms are choosing between two technologies, A and B. The payoff matrix (profits) is:<br>Firm 1 choices: A, B<br>Firm 2 choices: A, B<br>Payoffs (1,2):<br>(A,A): (5,5)<br>(A,B): (0,0)<br>(B,A): (0,0)<br>(B,B): (5,5)<br>a) Does either firm have a dominant strategy?<br>b) Find all Nash equilibria.<br>c) If the firms could communicate, what would they do?<br>d) What problem might arise even with communication?",
          
          "step_by_step": [
            {
              "step": "Check for dominant strategies",
              "explanation": "For Firm 1: If Firm 2 chooses A, 1 gets 5 from A, 0 from B → A better. If Firm 2 chooses B, 1 gets 0 from A, 5 from B → B better. No dominant strategy—best response depends on other's choice. Same for Firm 2."
            },
            {
              "step": "Find Nash equilibria",
              "explanation": "Check each cell:<br>(A,A): 1 gets 5, can't improve by switching to B (0); 2 gets 5, can't improve by switching to B (0). Nash equilibrium.<br>(A,B): 1 gets 0, could switch to B for 5; 2 gets 0, could switch to A for 5. Not equilibrium.<br>(B,A): 1 gets 0, could switch to A for 5; 2 gets 0, could switch to B for 5. Not equilibrium.<br>(B,B): 1 gets 5, can't improve; 2 gets 5, can't improve. Nash equilibrium.<br>So two Nash equilibria: (A,A) and (B,B)."
            },
            {
              "step": "With communication",
              "explanation": "If they can communicate, they would agree on one technology (say A) and both choose it, achieving (5,5)."
            },
            {
              "step": "Problem even with communication",
              "explanation": "They might disagree on which technology to choose (A or B). If each prefers a different one, they need to coordinate. This is a coordination problem—they need to agree on a focal point."
            }
          ],
          
          "final_answer": "a) No dominant strategies. b) Nash equilibria: (A,A) and (B,B). c) Agree on one technology. d) Coordination problem—which one to choose?",
          "concept_applied": "Coordination games have multiple Nash equilibria. Communication helps but doesn't guarantee agreement."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Players, Strategies, and Payoffs",
          "description": "Determine who is playing, what choices they have, and what each combination yields.",
          "mechanism": "Construct a payoff matrix with players' strategies and corresponding payoffs.",
          "result": "Game specification.",
          
          "image": {
            "src": "images/unit7/game_step1.png",
            "alt": "Empty payoff matrix",
            "caption": "Figure 7.4.14: Step 1 - Identify players, strategies, and payoffs."
          }
        },
        {
          "step": 2,
          "process": "Check for Dominant Strategies",
          "description": "For each player, determine if any strategy is best regardless of others' choices.",
          "mechanism": "Compare payoffs for each strategy across all possible opponent moves.",
          "result": "Identification of dominant strategies (if any).",
          
          "image": {
            "src": "images/unit7/game_step2.png",
            "alt": "Checking for dominant strategies",
            "caption": "Figure 7.4.15: Step 2 - Check for dominant strategies."
          }
        },
        {
          "step": 3,
          "process": "Find Best Responses",
          "description": "For each player, determine the best response to each possible opponent strategy.",
          "mechanism": "For each column (opponent's choice), find the row that gives highest payoff. Mark or note.",
          "result": "Best response mapping.",
          
          "image": {
            "src": "images/unit7/game_step3.png",
            "alt": "Marking best responses",
            "caption": "Figure 7.4.16: Step 3 - Find best responses."
          }
        },
        {
          "step": 4,
          "process": "Identify Nash Equilibria",
          "description": "Find strategy combinations where each player is playing a best response to the other.",
          "mechanism": "Cells where both players' strategies are best responses are Nash equilibria.",
          "result": "Nash equilibrium (or equilibria).",
          
          "image": {
            "src": "images/unit7/game_step4.png",
            "alt": "Circled Nash equilibrium",
            "caption": "Figure 7.4.17: Step 4 - Identify Nash equilibria."
          }
        },
        {
          "step": 5,
          "process": "Interpret the Outcome",
          "description": "Analyze whether the outcome is efficient, whether it's a prisoner's dilemma, etc.",
          "mechanism": "Compare Nash equilibrium to other possible outcomes. Consider if cooperation would improve payoffs.",
          "result": "Strategic insights.",
          
          "image": {
            "src": "images/unit7/game_step5.png",
            "alt": "Comparing outcomes",
            "caption": "Figure 7.4.18: Step 5 - Interpret the outcome."
          }
        }
      ],

      "image": {
        "src": "images/unit7/game_theory_summary.png",
        "alt": "Comprehensive summary: prisoner's dilemma, Nash equilibrium, dominant strategies, best responses",
        "caption": "Figure 7.4.19: Game theory introduction summary."
      }
    }
  ],

  "key_terms": [
    "Game theory",
    "Players",
    "Strategies",
    "Payoffs",
    "Payoff matrix",
    "Dominant strategy",
    "Nash equilibrium",
    "Best response",
    "Prisoner's dilemma",
    "Cooperation",
    "Defection",
    "Collusion",
    "Zero-sum game",
    "Coordination game",
    "Repeated game",
    "Tit-for-tat",
    "Strategic behavior",
    "Mutual interdependence",
    "Pareto optimal",
    "Social optimum"
  ],

  "summary": "Game theory provides tools for analyzing strategic interactions where outcomes depend on the choices of all participants. Key concepts include: (1) Players, strategies, and payoffs—the elements of any game, often represented in a payoff matrix. (2) Dominant strategy—a strategy that is best regardless of what others do. (3) Nash equilibrium—a set of strategies where no player can improve by changing unilaterally; each is playing a best response to others. (4) Prisoner's dilemma—a game where each player has a dominant strategy to defect, leading to an outcome worse for all than mutual cooperation. This explains why cooperation is difficult to sustain in one-shot interactions. (5) Best response analysis—finding optimal strategies conditional on others' choices. Games can have one Nash equilibrium, multiple equilibria (coordination games), or none in pure strategies. In repeated games, cooperation may emerge through strategies like tit-for-tat, where future retaliation can deter cheating. Game theory is essential for understanding oligopoly behavior, including pricing, advertising, and collusion decisions."
}
