{
  "expanded_description": "Most real-world markets fall somewhere between the extremes of perfect competition and monopoly. In these markets, firms have some market power but also face competition. Two important market structures occupy this middle ground: monopolistic competition, with many firms selling differentiated products, and oligopoly, with a few firms whose decisions are interdependent. Understanding these structures is essential for analyzing industries like restaurants, retail, automobiles, and telecommunications. In this unit, we'll explore how firms behave when products are differentiated, how they interact strategically, and how game theory helps us understand the complex dynamics of oligopoly.",
  
  "core_concept": {
    "principle": "Imperfect competition refers to market structures between perfect competition and monopoly. The two main types are: (1) Monopolistic competition: Many firms sell differentiated products, with relatively easy entry and exit. Each firm faces a downward-sloping demand curve but competes with many others offering similar products. Examples: restaurants, hair salons, retail stores. (2) Oligopoly: A few firms dominate the market, with significant barriers to entry. Firms are interdependent—each firm's decisions affect others and must consider rivals' reactions. Examples: automobiles, airlines, telecommunications, soft drinks. (3) Key differences: Monopolistic competition involves many small firms with no strategic interaction; oligopoly involves few large firms with strategic interdependence. (4) Game theory provides tools for analyzing strategic behavior in oligopoly, including the prisoner's dilemma, Nash equilibrium, and concepts of collusion and cartels.",
    
    "explanation": "Think of restaurants in a city. There are many, each offering something slightly different (differentiated products). You can open a new restaurant fairly easily (easy entry). That's monopolistic competition. Now think of wireless carriers. There are only a few, and they watch each other closely—if Verizon cuts prices, T-Mobile and AT&T react. That's oligopoly. The two structures are very different, and we need different tools to analyze them.",
    
    "image": {
      "src": "images/unit7/imperfect_overview.png",
      "alt": "Spectrum from perfect competition to monopoly with monopolistic competition and oligopoly in between",
      "caption": "Figure 7.0.1: Imperfect competition includes monopolistic competition and oligopoly."
    }
  },

  "sections": [
    {
      "section_title": "7.1 Monopolistic Competition",
      "introduction": "What do restaurants, hair salons, and clothing boutiques have in common? They operate in markets with many competitors, but each offers something slightly different. This market structure—monopolistic competition—combines features of both monopoly and perfect competition. Like a monopolist, each firm faces a downward-sloping demand curve for its differentiated product. Like perfect competition, there are many firms and free entry and exit. Understanding this structure helps explain why we see so much product variety and why firms advertise and differentiate their products.",
      
      "introduction_image": {
        "src": "images/unit7/monopolistic_intro.png",
        "alt": "Street with many different restaurants, each slightly different",
        "caption": "Figure 7.1.1: Monopolistic competition features many firms with differentiated products."
      },
      
      "key_concept": {
        "definition": "Monopolistic competition is a market structure characterized by: (1) Many firms: There are many sellers, each small relative to the market. No single firm's actions directly affect competitors. (2) Differentiated products: Each firm sells a product that is slightly different from others—through quality, location, branding, or service. Products are close but not perfect substitutes. This gives each firm some market power (downward-sloping demand). (3) Free entry and exit: Firms can enter and exit the industry without significant barriers. (4) Independent decision-making: Because there are many firms, each ignores the reactions of competitors when making decisions. There is no strategic interdependence. (5) Downward-sloping demand: Product differentiation means each firm faces a downward-sloping demand curve, unlike perfect competition's horizontal demand. However, demand is relatively elastic because of many close substitutes. (6) Examples: Restaurants, hair salons, dry cleaners, clothing stores, hotels, bookstores.",
        
        "context": "The theory of monopolistic competition was developed independently by Edward Chamberlin in the US and Joan Robinson in the UK in the 1930s. It filled a gap between the extremes of perfect competition and monopoly. The model helps explain real-world phenomena like product differentiation, advertising, and brand loyalty. In AP Microeconomics, understanding monopolistic competition is essential for analyzing industries that are competitive but not perfectly so, and for understanding the trade-off between variety and efficiency.",
        
        "image": {
          "src": "images/unit7/monopolistic_chart.png",
          "alt": "Characteristics of monopolistic competition: many firms, differentiated products, free entry, downward-sloping demand",
          "caption": "Figure 7.1.2: Four key characteristics of monopolistic competition."
        }
      },

      "classifications": [
        {
          "type": "Many Firms",
          "value": "Numerous sellers, each small",
          "characteristics": ["Large number of competitors", "No single firm dominates", "No strategic interdependence", "Firms ignore rivals' reactions", "Similar to perfect competition"],
          "behavior": "In monopolistic competition, there are many firms, each producing a slightly different product. Because there are so many, no single firm's actions directly affect others. If one restaurant changes its price, it doesn't significantly impact the demand faced by any other specific restaurant—the effect is spread across many. This means firms make decisions independently, without worrying about strategic reactions from competitors. This is different from oligopoly, where firms must consider rivals' responses. The many-firms condition ensures that there is no interdependence, simplifying the analysis.",
          
          "image": {
            "src": "images/unit7/many_firms_mc.png",
            "alt": "Many small shops, each independent",
            "caption": "Figure 7.1.3: Many firms, each too small to affect others."
          },
          
          "examples": [
            {
              "process": "Restaurants in a city",
              "explanation": "A city may have hundreds of restaurants. One Italian restaurant's pricing decisions don't significantly affect any single competitor."
            }
          ]
        },
        {
          "type": "Differentiated Products",
          "value": "Products are close but not perfect substitutes",
          "characteristics": ["Product differentiation", "Brand loyalty", "Non-price competition", "Downward-sloping demand", "Close substitutes available"],
          "behavior": "Product differentiation is the key feature that distinguishes monopolistic competition from perfect competition. Firms make their products different from competitors' through: physical quality, location, service, branding, packaging, or marketing. Because products are differentiated, each firm faces a downward-sloping demand curve—it has some market power. If it raises price, it loses some customers but not all (some loyal customers stay). However, because there are many close substitutes, demand is relatively elastic. Firms compete not only on price but also on product attributes, advertising, and location. This non-price competition is a hallmark of monopolistic competition.",
          
          "image": {
            "src": "images/unit7/differentiated.png",
            "alt": "Different products: different styles, brands, locations",
            "caption": "Figure 7.1.4: Differentiated products give firms some market power."
          },
          
          "examples": [
            {
              "process": "Coffee shops",
              "explanation": "Starbucks, Dunkin', and local cafes offer differentiated coffee experiences—atmosphere, brand, menu items. They compete but are not perfect substitutes."
            }
          ]
        },
        {
          "type": "Free Entry and Exit",
          "value": "No significant barriers to entry or exit",
          "characteristics": ["Low startup costs", "No legal barriers", "Firms can enter when profits exist", "Firms exit when losses occur", "Drives long-run profit to zero"],
          "behavior": "Like perfect competition, monopolistically competitive industries have free entry and exit. There are no significant barriers—no patents, licenses, or huge capital requirements. This means that when existing firms earn economic profits, new firms enter, offering similar but differentiated products. Entry reduces demand for each existing firm (shifts their demand curves left) until profits are eliminated. When firms incur losses, some exit, increasing demand for remaining firms until losses disappear. In the long run, free entry and exit drive economic profit to zero, just as in perfect competition. However, unlike perfect competition, firms do not produce at minimum average cost in long-run equilibrium.",
          
          "image": {
            "src": "images/unit7/free_entry_mc.png",
            "alt": "New restaurants opening, some closing",
            "caption": "Figure 7.1.5: Free entry and exit drive long-run profit to zero."
          },
          
          "examples": [
            {
              "process": "Restaurant openings and closings",
              "explanation": "In many cities, restaurants open and close frequently. When a new popular restaurant earns profits, others open similar concepts until profits normalize."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Monopolistic Competition Combines Features of Monopoly and Perfect Competition",
          "statement": "Monopolistic competition is a hybrid market structure. Like monopoly, each firm faces a downward-sloping demand curve because its product is differentiated. This gives it some market power—it can raise price without losing all customers. Like perfect competition, there are many firms and free entry and exit, which drives economic profit to zero in the long run. The result is a market with product variety and some market power, but no long-run economic profits. This hybrid nature explains many real-world markets where firms have some brand loyalty but face intense competition from similar products.",
          "application": "When analyzing a firm in monopolistic competition, use monopoly analysis for short-run decisions (downward-sloping demand, $MR = MC$) but remember that entry and exit will eliminate profits in the long run.",
          "example": "A new coffee shop opens and faces downward-sloping demand. It sets price where $MR = MC$ and may earn short-run profit. But if profits are good, more coffee shops open, reducing demand until profits disappear.",
          
          "image": {
            "src": "images/unit7/hybrid.png",
            "alt": "Venn diagram showing monopoly and competition features overlapping",
            "caption": "Figure 7.1.6: Monopolistic competition combines features of both market structures."
          }
        },
        {
          "principle": "Product Differentiation Creates Downward-Sloping Demand",
          "statement": "The key to market power in monopolistic competition is product differentiation. By making their product different from competitors', firms create a niche where they face a downward-sloping demand curve. The degree of market power depends on how differentiated the product is—more differentiation leads to less elastic demand. However, because there are many close substitutes, demand is still relatively elastic. The downward-sloping demand means that $MR < P$, just like monopoly. Firms maximize profit where $MR = MC$. But unlike monopoly, the presence of close substitutes limits the markup firms can charge. This explains why similar products can have different prices without customers all flocking to the cheapest—differentiation creates loyalty.",
          "application": "To assess a firm's market power, look at the elasticity of demand. More differentiation → less elastic demand → more market power. But close substitutes keep elasticity relatively high.",
          "example": "A restaurant with a unique atmosphere and signature dishes has more market power than a generic diner. It can charge higher prices without losing all customers.",
          
          "image": {
            "src": "images/unit7/differentiation_power.png",
            "alt": "Demand curves: more differentiation = steeper demand",
            "caption": "Figure 7.1.7: Product differentiation creates downward-sloping demand."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Short-Run Profit in Monopolistic Competition",
          
          "image": {
            "src": "images/unit7/mc_example1.png",
            "alt": "Demand and cost data",
            "caption": "Figure 7.1.8: Calculate short-run profit for a monopolistically competitive firm."
          },
          
          "problem": "A monopolistically competitive firm faces demand $P = 50 - 2Q$ and has total cost $TC = 100 + 10Q$.<br>a) Find the profit-maximizing quantity and price.<br>b) Calculate profit or loss.<br>c) Is this a short-run or long-run equilibrium? Explain.<br>d) What will happen in the long run?",
          
          "step_by_step": [
            {
              "step": "Find MR and MC",
              "explanation": "$MR = 50 - 4Q$, $MC = 10$"
            },
            {
              "step": "Set MR = MC",
              "explanation": "$50 - 4Q = 10$ → $4Q = 40$ → $Q = 10$"
            },
            {
              "step": "Find price",
              "explanation": "$P = 50 - 2(10) = 50 - 20 = 30$"
            },
            {
              "step": "Calculate profit",
              "explanation": "$TR = 30 × 10 = 300$. $TC = 100 + 10(10) = 100 + 100 = 200$. Profit = $300 - 200 = 100$."
            },
            {
              "step": "Short-run or long-run?",
              "explanation": "This is a short-run equilibrium because the firm is earning positive economic profit ($100$). In long-run equilibrium, free entry would drive profit to zero."
            },
            {
              "step": "Long-run adjustment",
              "explanation": "Positive profit attracts new firms to enter with similar differentiated products. This reduces demand for existing firms (demand shifts left) until profit is eliminated."
            }
          ],
          
          "final_answer": "a) $Q=10$, $P=30$. b) Profit = $100$. c) Short-run (positive profit). d) Entry will occur, reducing demand until profit = 0.",
          "concept_applied": "Monopolistically competitive firms can earn short-run profits, but entry eliminates profits in long run."
        },
        {
          "title": "Comparing Monopolistic Competition to Other Structures",
          
          "image": {
            "src": "images/unit7/mc_example2.png",
            "alt": "Comparison table",
            "caption": "Figure 7.1.9: Compare market structures."
          },
          
          "problem": "Complete the table comparing perfect competition, monopolistic competition, and monopoly on these characteristics:<br>a) Number of firms<br>b) Type of product<br>c) Firm's demand curve<br>d) Long-run profit<br>e) Efficiency (P = MC?)<br>f) Examples",
          
          "step_by_step": [
            {
              "step": "Number of firms",
              "explanation": "Perfect competition: many. Monopolistic competition: many. Monopoly: one."
            },
            {
              "step": "Type of product",
              "explanation": "Perfect competition: homogeneous. Monopolistic competition: differentiated. Monopoly: unique, no close substitutes."
            },
            {
              "step": "Firm's demand curve",
              "explanation": "Perfect competition: horizontal (perfectly elastic). Monopolistic competition: downward-sloping, relatively elastic. Monopoly: downward-sloping, less elastic."
            },
            {
              "step": "Long-run profit",
              "explanation": "Perfect competition: zero. Monopolistic competition: zero. Monopoly: can be positive (barriers to entry)."
            },
            {
              "step": "Efficiency",
              "explanation": "Perfect competition: $P = MC$ (allocative efficiency), produces at min ATC (productive efficiency). Monopolistic competition: $P > MC$ (allocative inefficiency), not at min ATC (excess capacity). Monopoly: $P > MC$, may not be at min ATC."
            },
            {
              "step": "Examples",
              "explanation": "Perfect competition: wheat farming. Monopolistic competition: restaurants, hotels. Monopoly: local water utility, patented drug."
            }
          ],
          
          "final_answer": "Completed table as shown.",
          "concept_applied": "Monopolistic competition shares features with both perfect competition (many firms, zero long-run profit) and monopoly (downward-sloping demand, $P > MC$)."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Number of Firms",
          "description": "Determine if there are many firms or few.",
          "mechanism": "Count firms or assess concentration. Many firms suggest monopolistic competition or perfect competition.",
          "result": "Initial classification.",
          
          "image": {
            "src": "images/unit7/mc_step1.png",
            "alt": "Many small firms",
            "caption": "Figure 7.1.10: Step 1 - Are there many firms?"
          }
        },
        {
          "step": 2,
          "process": "Assess Product Differentiation",
          "description": "Determine if products are identical or differentiated.",
          "mechanism": "Are products essentially the same, or do firms differentiate through quality, branding, location?",
          "result": "Differentiation assessment.",
          
          "image": {
            "src": "images/unit7/mc_step2.png",
            "alt": "Different products",
            "caption": "Figure 7.1.11: Step 2 - Are products differentiated?"
          }
        },
        {
          "step": 3,
          "process": "Check Entry Barriers",
          "description": "Determine if entry is free or blocked.",
          "mechanism": "Are there significant barriers (patents, licenses, huge capital requirements)?",
          "result": "Entry condition assessment.",
          
          "image": {
            "src": "images/unit7/mc_step3.png",
            "alt": "Open door for entry",
            "caption": "Figure 7.1.12: Step 3 - Is entry free?"
          }
        },
        {
          "step": 4,
          "process": "Analyze Demand Curve",
          "description": "Determine the shape of the firm's demand curve.",
          "mechanism": "Differentiation → downward-sloping. Many substitutes → relatively elastic.",
          "result": "Demand curve shape.",
          
          "image": {
            "src": "images/unit7/mc_step4.png",
            "alt": "Downward-sloping but relatively flat demand",
            "caption": "Figure 7.1.13: Step 4 - Firm faces downward-sloping demand."
          }
        },
        {
          "step": 5,
          "process": "Classify Market Structure",
          "description": "Based on findings, classify as monopolistic competition.",
          "mechanism": "If many firms, differentiated products, free entry → monopolistic competition.",
          "result": "Market structure classification.",
          
          "image": {
            "src": "images/unit7/mc_step5.png",
            "alt": "Monopolistic competition label",
            "caption": "Figure 7.1.14: Step 5 - Classify as monopolistic competition."
          }
        }
      ],

      "image": {
        "src": "images/unit7/monopolistic_summary.png",
        "alt": "Comprehensive summary: characteristics, demand, profit maximization, comparison to other structures",
        "caption": "Figure 7.1.15: Monopolistic competition summary."
      }
    }
  ],

  "key_terms": [
    "Monopolistic competition",
    "Product differentiation",
    "Many firms",
    "Free entry and exit",
    "Downward-sloping demand",
    "Non-price competition",
    "Brand loyalty",
    "Close substitutes",
    "Elastic demand",
    "Short-run profit",
    "Long-run equilibrium",
    "Zero economic profit",
    "Excess capacity",
    "Markup",
    "Advertising",
    "Differentiated products"
  ],

  "summary": "Monopolistic competition is a market structure characterized by many firms selling differentiated products with free entry and exit. Each firm faces a downward-sloping demand curve because its product is different from competitors', giving it some market power. However, because there are many close substitutes, demand is relatively elastic. Firms maximize profit where $MR = MC$, just like monopolists. In the short run, firms can earn economic profits or incur losses. In the long run, free entry and exit drive economic profit to zero—profits attract new firms, shifting demand left until profits disappear; losses cause exit, shifting demand right until losses vanish. In long-run equilibrium, firms produce where $P > MC$ (allocative inefficiency) and not at minimum average total cost (excess capacity). Monopolistic competition combines features of perfect competition (many firms, free entry, zero long-run profit) and monopoly (downward-sloping demand, $P > MC$). This structure explains many real-world markets like restaurants, retail stores, and service businesses where product differentiation is important."
}
