{
  "expanded_description": "What happens when an industry is dominated by a few large firms? Unlike perfect competition or monopolistic competition, firms in an oligopoly cannot ignore each other. Each firm's decisions about price, output, and advertising directly affect its rivals, and those rivals will respond. This interdependence makes oligopoly the most complex and fascinating market structure. Understanding oligopoly requires new tools—like game theory—to analyze strategic behavior. In this section, we'll explore the characteristics of oligopoly, the sources of barriers to entry, and the fundamental interdependence that defines this market structure.",
  
  "core_concept": {
    "principle": "Oligopoly is a market structure characterized by a few large firms, significant barriers to entry, and strategic interdependence among firms. (1) Few large firms: The industry is dominated by a small number of firms, each large enough that its actions affect market conditions. The exact number varies, but typically 2-10 firms dominate. (2) Interdependence: Each firm must consider how its rivals will respond to its decisions. This strategic interaction is the defining feature of oligopoly. (3) Barriers to entry: Significant obstacles prevent new firms from entering, allowing existing firms to earn long-run economic profits. Barriers include economies of scale, patents, control of resources, and strategic behavior. (4) Products may be homogeneous (steel, oil) or differentiated (automobiles, smartphones). (5) Behavior ranges from competitive to cooperative. Firms may compete aggressively (price wars) or collude (form cartels) to maximize joint profits. (6) Game theory is the primary tool for analyzing oligopoly behavior, including concepts like Nash equilibrium, prisoner's dilemma, and strategic moves.",
    
    "explanation": "Think of the wireless carrier market: Verizon, T-Mobile, AT&T. If one cuts prices, the others must decide whether to match. If they don't, they lose customers. If they do, everyone's profits fall. This interdependence—each firm's profit depending on others' choices—is the essence of oligopoly. It's like a chess game where each move depends on anticipating the opponent's response.",
    
    "image": {
      "src": "images/unit7/oligopoly_overview.png",
      "alt": "A few large firms (Verizon, AT&T, T-Mobile) with arrows showing interdependence",
      "caption": "Figure 7.3.1: Oligopoly features a few interdependent firms."
    }
  },

  "sections": [
    {
      "section_title": "7.3 Oligopoly and Interdependence",
      "introduction": "What happens when an industry is dominated by a few large firms? Unlike perfect competition or monopolistic competition, firms in an oligopoly cannot ignore each other. Each firm's decisions about price, output, and advertising directly affect its rivals, and those rivals will respond. This interdependence makes oligopoly the most complex and fascinating market structure. Understanding oligopoly requires new tools—like game theory—to analyze strategic behavior. In this section, we'll explore the characteristics of oligopoly, the sources of barriers to entry, and the fundamental interdependence that defines this market structure.",
      
      "introduction_image": {
        "src": "images/unit7/oligopoly_intro.png",
        "alt": "Chess board representing strategic interaction among few firms",
        "caption": "Figure 7.3.2: Oligopoly involves strategic interdependence—each firm's actions affect others."
      },
      
      "key_concept": {
        "definition": "Oligopoly is a market structure with a small number of large firms, significant barriers to entry, and strategic interdependence. (1) Few large firms: The industry is concentrated—a small number of firms account for most or all of the output. The concentration ratio (share of top firms) and Herfindahl-Hirschman Index (HHI) measure concentration. Typically, a 4-firm concentration ratio above 40% indicates oligopoly. (2) Interdependence: Each firm's decisions about price, output, advertising, and product characteristics affect its rivals. Firms must anticipate and react to competitors' moves. This strategic interaction is analyzed using game theory. (3) Barriers to entry: Significant obstacles protect existing firms from new competitors. Sources include: (a) Economies of scale: Large-scale production lowers costs, making it difficult for small entrants to compete. (b) Patents and technology: Legal protection of innovations. (c) Control of essential resources: Ownership of key inputs. (d) Brand loyalty and advertising: Established brands are hard to overcome. (e) Strategic barriers: Predatory pricing, excess capacity, and other tactics to deter entry. (4) Product differentiation: Oligopolies may produce homogeneous goods (steel, oil, cement) or differentiated goods (automobiles, smartphones, breakfast cereals). (5) Behavior spectrum: Oligopoly behavior ranges from intense competition (price wars) to cooperation (collusion and cartels). The outcome depends on factors like number of firms, product differentiation, and ease of coordination. (6) Measurement: Concentration ratios and HHI are used to identify oligopoly and assess market power.",
        
        "context": "Oligopoly is ubiquitous in modern economies. Major industries like automobiles, airlines, telecommunications, banking, pharmaceuticals, and technology are all oligopolies. Understanding oligopoly is essential for antitrust policy, business strategy, and economic analysis. In AP Microeconomics, you'll need to identify oligopolies, understand their characteristics, and use game theory to analyze strategic behavior.",
        
        "image": {
          "src": "images/unit7/oligopoly_chart.png",
          "alt": "Characteristics of oligopoly: few firms, interdependence, barriers to entry",
          "caption": "Figure 7.3.3: Three key characteristics of oligopoly."
        }
      },

      "classifications": [
        {
          "type": "Few Large Firms",
          "value": "Industry dominated by small number of firms",
          "characteristics": ["High concentration", "Each firm has significant market share", "Actions affect market outcomes", "Mutual interdependence", "Measured by concentration ratios"],
          "behavior": "In oligopoly, a small number of firms account for most or all of industry output. Each firm is large enough that its decisions about price, output, or product characteristics affect market conditions. This concentration can be measured by the concentration ratio (e.g., the share of the top 4 firms) or the Herfindahl-Hirschman Index (sum of squared market shares). A 4-firm concentration ratio above 40% typically indicates oligopoly; above 60% indicates tight oligopoly. The HHI ranges from near 0 (perfect competition) to 10,000 (monopoly). Markets with HHI above 2,500 are considered highly concentrated. The presence of few firms means that each must consider rivals' reactions—there is no anonymity as in perfect competition.",
          
          "image": {
            "src": "images/unit7/few_firms.png",
            "alt": "Pie chart showing few firms dominating market share",
            "caption": "Figure 7.3.4: A few large firms dominate the market."
          },
          
          "examples": [
            {
              "process": "Wireless carriers",
              "explanation": "In the US, Verizon, AT&T, and T-Mobile account for over 90% of wireless subscriptions. Their actions directly affect each other."
            },
            {
              "process": "Soft drinks",
              "explanation": "Coca-Cola and Pepsi dominate the carbonated soft drink market. Their strategic interactions are classic oligopoly behavior."
            }
          ]
        },
        {
          "type": "Barriers to Entry",
          "value": "Obstacles preventing new firms from entering",
          "characteristics": ["Economies of scale", "Patents", "Brand loyalty", "Control of resources", "Strategic deterrence"],
          "behavior": "Barriers to entry protect oligopolists from new competition, allowing them to earn long-run economic profits. Major barriers include: (1) Economies of scale: If minimum efficient scale is large relative to market size, new firms cannot enter profitably. (2) Patents and intellectual property: Legal protection of innovations gives exclusive rights. (3) Brand loyalty and advertising: Established brands are difficult to overcome; new entrants must spend heavily on advertising. (4) Control of essential resources: Ownership of key inputs. (5) Network effects: Value increases with users, creating advantage for incumbents. (6) Strategic barriers: Incumbents may engage in predatory pricing (temporarily lowering prices to drive out entrants), maintain excess capacity as a threat, or use exclusive contracts with suppliers or distributors. These barriers explain why oligopoly profits can persist.",
          
          "image": {
            "src": "images/unit7/barriers_oligopoly.png",
            "alt": "Wall with various barrier types",
            "caption": "Figure 7.3.5: Barriers to entry protect oligopolists from competition."
          },
          
          "examples": [
            {
              "process": "Automobile industry",
              "explanation": "Huge economies of scale (billions to develop new models) create a significant barrier to entry. New automakers rarely succeed."
            },
            {
              "process": "Pharmaceutical industry",
              "explanation": "Patents and huge R&D costs create barriers. Generic entry only after patents expire."
            }
          ]
        },
        {
          "type": "Interdependence",
          "value": "Firms must consider rivals' reactions",
          "characteristics": ["Strategic behavior", "Game theory analysis", "Reaction functions", "Mutual dependence", "Uncertainty"],
          "behavior": "Interdependence is the defining feature of oligopoly. Because there are few firms, each firm's profit depends not only on its own decisions but also on the decisions of its rivals. When a firm considers changing its price, output, or advertising, it must anticipate how competitors will respond. Will they match a price cut? Will they ignore a price increase? This strategic interaction makes oligopoly behavior complex and unpredictable. Unlike perfect competition (where firms ignore each other) or monopoly (where there are no rivals), oligopoly requires game theory for analysis. Firms may compete aggressively, leading to price wars, or they may cooperate, tacitly or explicitly, to maximize joint profits. The outcome depends on factors like number of firms, product differentiation, and the ability to monitor and punish deviations.",
          
          "image": {
            "src": "images/unit7/interdependence.png",
            "alt": "Arrows showing each firm affecting others",
            "caption": "Figure 7.3.6: Firms are interdependent—each must consider rivals' reactions."
          },
          
          "examples": [
            {
              "process": "Airline pricing",
              "explanation": "When one airline cuts fares on a route, others quickly match to avoid losing customers. This interdependence leads to fare matching and price leadership."
            },
            {
              "process": "Gas stations",
              "explanation": "Gas stations on the same corner watch each other's prices closely. A price change by one is quickly matched by others."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Interdependence Creates Strategic Uncertainty",
          "statement": "The key difference between oligopoly and other market structures is strategic interdependence. In perfect competition, firms are price takers—they don't worry about rivals. In monopoly, there are no rivals. In oligopoly, each firm's optimal decision depends on what others do. This creates strategic uncertainty: a firm cannot simply set $P = MC$ or $MR = MC$ without considering rivals' reactions. The same firm might behave very differently depending on its expectations of competitors' behavior. This is why there is no single model of oligopoly—different assumptions about firm behavior lead to different predictions. Game theory provides a framework for analyzing these strategic interactions, with concepts like Nash equilibrium, dominant strategies, and reaction functions.",
          "application": "When analyzing an oligopoly, never assume firms act independently. Always consider how rivals might respond. Use game theory to model the strategic interaction and predict outcomes.",
          "example": "If Pepsi considers a price cut, it must ask: Will Coke match? If yes, the price cut may just start a price war that hurts both. If no, Pepsi might gain market share. The optimal decision depends on Coke's expected response.",
          
          "image": {
            "src": "images/unit7/strategic_uncertainty.png",
            "alt": "Question marks between firms representing uncertainty about reactions",
            "caption": "Figure 7.3.7: Interdependence creates strategic uncertainty."
          }
        },
        {
          "principle": "Barriers to Entry Allow Long-Run Economic Profits",
          "statement": "Like monopoly, oligopoly can sustain long-run economic profits because barriers to entry prevent new competitors from eroding those profits. However, the level of profits depends on the intensity of competition among existing firms. If oligopolists compete aggressively (price wars), profits may be driven down toward competitive levels even without entry. If they cooperate (collude), they can earn near-monopoly profits. The existence of barriers ensures that when firms do earn profits, those profits are not immediately competed away by new entrants. This is why oligopoly is often a target of antitrust policy—persistent high profits may indicate anticompetitive behavior.",
          "application": "To assess whether an oligopoly is likely to earn long-run profits, evaluate both barriers to entry (to prevent new competition) and the degree of rivalry among existing firms. High barriers and low rivalry → high profits.",
          "example": "The global aircraft manufacturing industry has high barriers (enormous R&D costs, economies of scale) and only two major players (Boeing and Airbus). Both have earned long-run profits despite their rivalry.",
          
          "image": {
            "src": "images/unit7/barriers_profit_oligopoly.png",
            "alt": "Barriers preventing entry, allowing profits",
            "caption": "Figure 7.3.8: Barriers to entry allow long-run economic profits."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying Oligopoly with Concentration Measures",
          
          "image": {
            "src": "images/unit7/oligopoly_example1.png",
            "alt": "Market share data",
            "caption": "Figure 7.3.9: Calculate concentration measures and identify oligopoly."
          },
          
          "problem": "An industry has the following market shares: Firm A 30%, Firm B 25%, Firm C 20%, Firm D 15%, Firms E-H each 2.5% (4 firms).<br>a) Calculate the 4-firm concentration ratio.<br>b) Calculate the Herfindahl-Hirschman Index (HHI).<br>c) Based on DOJ/FTC guidelines (HHI < 1500 unconcentrated, 1500-2500 moderately concentrated, >2500 highly concentrated), classify this industry.<br>d) Is this an oligopoly? Explain.",
          
          "step_by_step": [
            {
              "step": "4-firm concentration ratio",
              "explanation": "Sum of top 4 firms: $30 + 25 + 20 + 15 = 90\\%$. This is very high, indicating tight oligopoly."
            },
            {
              "step": "Calculate HHI",
              "explanation": "Square each share and sum: $30^2 + 25^2 + 20^2 + 15^2 + 4×(2.5^2) = 900 + 625 + 400 + 225 + 4×6.25 = 900+625+400+225+25 = 2175$."
            },
            {
              "step": "Classify by HHI",
              "explanation": "HHI = 2175, which falls in the 1500-2500 range, so moderately concentrated."
            },
            {
              "step": "Is this oligopoly?",
              "explanation": "Yes. The 4-firm concentration ratio of 90% indicates that a few firms dominate. Even though the HHI is in the moderate range, the top firms are large and likely interdependent. This fits the definition of oligopoly."
            }
          ],
          
          "final_answer": "a) 90%. b) 2175. c) Moderately concentrated. d) Yes, few firms dominate (90% market share).",
          "concept_applied": "Concentration measures help identify oligopoly. High concentration ratios indicate few firms dominate."
        },
        {
          "title": "Analyzing Interdependence",
          
          "image": {
            "src": "images/unit7/oligopoly_example2.png",
            "alt": "Scenario about airline pricing",
            "caption": "Figure 7.3.10: Analyze strategic interdependence."
          },
          
          "problem": "Two airlines, AirEast and WestAir, compete on a route. Currently, both charge $\\$300$ per ticket and each carries 200 passengers daily (profit = $\\$60,000$ each). AirEast is considering lowering its fare to $\\$250$ to gain market share.<br>a) If AirEast lowers price and WestAir does not respond, what will happen?<br>b) If WestAir matches the price cut, what will happen?<br>c) Why can't AirEast ignore WestAir's potential response?<br>d) What does this illustrate about oligopoly?",
          
          "step_by_step": [
            {
              "step": "No response scenario",
              "explanation": "If WestAir does not respond, AirEast gains passengers while WestAir loses. AirEast's profit likely increases (more than offsetting lower fare). WestAir's profit falls. This is good for AirEast, bad for WestAir."
            },
            {
              "step": "Matching response",
              "explanation": "If WestAir matches, both have the same price again. Total passengers may increase slightly (lower price stimulates demand), but each gets about half. With lower fares and similar volumes, both firms' profits likely fall."
            },
            {
              "step": "Why can't AirEast ignore response?",
              "explanation": "AirEast must anticipate WestAir's reaction because WestAir has a strong incentive to respond. If WestAir doesn't respond, it loses market share and profit. So WestAir will likely match to protect its position. AirEast must consider this likely outcome."
            },
            {
              "step": "Illustration",
              "explanation": "This illustrates strategic interdependence—each firm's profit depends on the other's actions, and they must anticipate reactions. This is the defining feature of oligopoly."
            }
          ],
          
          "final_answer": "a) AirEast gains, WestAir loses. b) Both profits likely fall. c) WestAir has incentive to respond to protect market share. d) Illustrates strategic interdependence.",
          "concept_applied": "In oligopoly, firms cannot ignore rivals' likely responses. This interdependence shapes all decisions."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Count Firms and Measure Concentration",
          "description": "Determine number of firms and their market shares.",
          "mechanism": "Calculate concentration ratio and HHI. Few firms with high shares suggest oligopoly.",
          "result": "Concentration assessment.",
          
          "image": {
            "src": "images/unit7/oligo_step1.png",
            "alt": "Pie chart with few large slices",
            "caption": "Figure 7.3.11: Step 1 - Are there few firms with high concentration?"
          }
        },
        {
          "step": 2,
          "process": "Assess Barriers to Entry",
          "description": "Identify obstacles that prevent new firms from entering.",
          "mechanism": "Check for economies of scale, patents, brand loyalty, resource control, strategic barriers.",
          "result": "Barrier assessment.",
          
          "image": {
            "src": "images/unit7/oligo_step2.png",
            "alt": "Wall with barrier types",
            "caption": "Figure 7.3.12: Step 2 - Are there significant barriers to entry?"
          }
        },
        {
          "step": 3,
          "process": "Analyze Interdependence",
          "description": "Determine if firms' decisions affect each other.",
          "mechanism": "If few firms, each firm's actions will noticeably impact others. They must consider rivals' reactions.",
          "result": "Interdependence recognition.",
          
          "image": {
            "src": "images/unit7/oligo_step3.png",
            "alt": "Arrows between firms",
            "caption": "Figure 7.3.13: Step 3 - Are firms interdependent?"
          }
        },
        {
          "step": 4,
          "process": "Consider Product Type",
          "description": "Determine if products are homogeneous or differentiated.",
          "mechanism": "Homogeneous (steel, oil) leads to different dynamics than differentiated (automobiles, smartphones).",
          "result": "Product differentiation assessment.",
          
          "image": {
            "src": "images/unit7/oligo_step4.png",
            "alt": "Identical vs. different products",
            "caption": "Figure 7.3.14: Step 4 - Are products homogeneous or differentiated?"
          }
        },
        {
          "step": 5,
          "process": "Classify Market Structure",
          "description": "Based on findings, classify as oligopoly.",
          "mechanism": "If few firms, high barriers, interdependence → oligopoly.",
          "result": "Market structure classification.",
          
          "image": {
            "src": "images/unit7/oligo_step5.png",
            "alt": "Oligopoly label",
            "caption": "Figure 7.3.15: Step 5 - Classify as oligopoly."
          }
        }
      ],

      "image": {
        "src": "images/unit7/oligopoly_summary.png",
        "alt": "Comprehensive summary: characteristics, barriers, interdependence, concentration measures",
        "caption": "Figure 7.3.16: Oligopoly and interdependence summary."
      }
    }
  ],

  "key_terms": [
    "Oligopoly",
    "Few large firms",
    "Concentration ratio",
    "Herfindahl-Hirschman Index (HHI)",
    "Barriers to entry",
    "Economies of scale",
    "Patents",
    "Brand loyalty",
    "Strategic barriers",
    "Predatory pricing",
    "Interdependence",
    "Strategic behavior",
    "Game theory",
    "Mutual dependence",
    "Price wars",
    "Collusion",
    "Cartels",
    "Product differentiation",
    "Homogeneous products",
    "Differentiated products"
  ],

  "summary": "Oligopoly is a market structure characterized by a few large firms, significant barriers to entry, and strategic interdependence. Key features include: (1) Few firms dominate the industry, measured by concentration ratios and HHI. A 4-firm concentration ratio above 40% typically indicates oligopoly. (2) Barriers to entry protect existing firms from new competitors, allowing long-run economic profits. Barriers include economies of scale, patents, brand loyalty, control of resources, and strategic deterrence. (3) Interdependence is the defining feature—each firm's decisions affect its rivals, and firms must anticipate competitors' reactions. This creates strategic uncertainty and makes oligopoly behavior complex. (4) Products may be homogeneous (steel, oil) or differentiated (automobiles, smartphones). (5) Behavior ranges from intense competition (price wars) to cooperation (collusion). Game theory is the primary tool for analyzing strategic interactions in oligopoly. Understanding oligopoly is essential for analyzing real-world industries like airlines, telecommunications, automobiles, and technology, and for evaluating antitrust policy."
}
