{
  "expanded_description": "The AP exam often asks questions that require you to connect concepts across different units. For example, how does a change in input prices affect both cost curves and market equilibrium? How does a tax affect consumer surplus, producer surplus, and deadweight loss? This section helps you build the mental connections needed to tackle integrated questions. Understanding these relationships is what separates good scores from great scores.",
  
  "core_concept": {
    "principle": "Connecting concepts means understanding the relationships between different microeconomic models and how changes in one part of the economy ripple through others. Key connections include: (1) Production and costs: The shape of cost curves derives from the production function and diminishing returns. (2) Costs and supply: The firm's supply curve is the $MC$ curve above $AVC$. (3) Market structure and efficiency: Perfect competition achieves allocative efficiency ($P = MC$) and productive efficiency (min $ATC$); monopoly and monopolistic competition do not. (4) Factor markets and product markets: Labor demand derives from product demand and productivity ($MRP = MP \\times MR$). Changes in product markets affect factor markets. (5) Taxes and surplus: Taxes create deadweight loss by reducing quantity below efficient level; incidence depends on elasticities. (6) Trade and welfare: Trade affects consumer and producer surplus; tariffs create deadweight loss. (7) Externalities and market failure: Externalities cause divergence between private and social incentives; corrective policies can improve efficiency.",
    
    "explanation": "Think of microeconomics as a web of interconnected ideas. A change in one area—like a new technology that increases productivity—doesn't just stay there. It affects costs, which affects supply, which affects market price, which affects consumer and producer surplus, which may affect labor demand. Understanding these connections helps you see the whole picture, not just isolated pieces.",
    
    "image": {
      "src": "images/unit12/connections_overview.png",
      "alt": "Mind map connecting microeconomic concepts",
      "caption": "Figure 12.2.1: Success requires understanding how concepts connect."
    }
  },

  "sections": [
    {
      "section_title": "12.2 Connecting Concepts",
      "introduction": "The AP exam often asks questions that require you to connect concepts across different units. For example, how does a change in input prices affect both cost curves and market equilibrium? How does a tax affect consumer surplus, producer surplus, and deadweight loss? This section helps you build the mental connections needed to tackle integrated questions. Understanding these relationships is what separates good scores from great scores.",
      
      "introduction_image": {
        "src": "images/unit12/connections_intro.png",
        "alt": "Network diagram showing connections between topics",
        "caption": "Figure 12.2.2: Microeconomic concepts are deeply interconnected."
      },
      
      "key_concept": {
        "definition": "Connecting concepts means understanding the relationships between different microeconomic models and how changes in one part of the economy ripple through others. (1) Production → Costs → Supply: The production function determines marginal product, which determines marginal cost ($MC = w/MP$). Marginal cost above average variable cost is the firm's supply curve. (2) Product Markets → Factor Markets: Labor demand is derived from product demand and productivity ($MRP = MP \\times MR$). Changes in product markets shift labor demand. (3) Elasticity → Tax Incidence → Deadweight Loss: The more inelastic side of the market bears more of a tax burden. Deadweight loss increases with elasticity. (4) Market Structure → Efficiency: Perfect competition achieves $P = MC$ (allocative efficiency) and min $ATC$ (productive efficiency). Monopoly and monopolistic competition do not. (5) Externalities → Market Failure → Corrective Policy: Externalities cause divergence between private and social incentives. Corrective taxes (for negative externalities) and subsidies (for positive externalities) can restore efficiency. (6) Trade → Welfare: Opening to trade changes consumer and producer surplus. Tariffs create deadweight loss and government revenue (or quota rents).",
        
        "context": "The AP exam increasingly emphasizes these connections. Multiple-choice questions may require combining concepts from different units. Free response questions often have multiple parts that build on each other, testing your ability to apply concepts sequentially. Mastering these connections is key to earning a 5.",
        
        "image": {
          "src": "images/unit12/connections_map.png",
          "alt": "Concept map showing relationships between topics",
          "caption": "Figure 12.2.3: Understanding connections between concepts is essential."
        }
      },

      "classifications": [
        {
          "type": "Production → Costs → Supply",
          "value": "The production-cost-supply chain",
          "characteristics": ["Production function determines $MP$", "$MP$ determines shape of $MC$ ($MC = w/MP$)", "$MC$ above $AVC$ is firm's supply", "Industry supply aggregates firm supply"],
          "behavior": "This is the fundamental connection between real-side production and market outcomes. The production function shows how inputs transform into output. Diminishing returns cause $MP$ to fall, which causes $MC$ to rise. The $MC$ curve (above $AVC$) becomes the firm's supply curve. Aggregating across firms gives market supply. Changes in technology (shifting production function) or input prices directly affect costs and thus supply. For example, if the wage rate increases from $\\$20$ to $\\$25$, $MC = w/MP$ increases at every output level, shifting the firm's supply curve leftward. This leftward shift in individual firm supply curves aggregates to a leftward shift in market supply, increasing equilibrium price and decreasing quantity in the product market.",
          
          "image": {
            "src": "images/unit12/production_connection.png",
            "alt": "Production to costs to supply diagram",
            "caption": "Figure 12.2.4: Production determines costs, which determine supply."
          },
          
          "examples": [
            {
              "process": "Wage increase effect",
              "explanation": "A minimum wage increase from $\\$7.25$ to $\\$15$ raises marginal cost for firms, shifting supply curves left. Market price rises, quantity falls."
            }
          ]
        },
        {
          "type": "Product Markets → Factor Markets",
          "value": "Derived demand connection",
          "characteristics": ["Labor demand $= MRP = MP \\times MR$", "Product demand affects $MR$", "Productivity affects $MP$", "Factor prices affect product supply"],
          "behavior": "Factor markets and product markets are linked through derived demand. The demand for labor comes from the demand for the products labor produces. An increase in product demand increases $MR$, shifting labor demand right. An increase in productivity increases $MP$, also shifting labor demand right. Changes in factor prices (wages) affect firms' costs, shifting product supply. This two-way connection means shocks in one market ripple to the other. For example, a surge in demand for electric vehicles increases $MR$ for auto manufacturers, increasing their demand for auto workers. This raises wages, which increases production costs, potentially affecting the supply of electric vehicles. The size of these effects depends on elasticities in both markets.",
          
          "image": {
            "src": "images/unit12/factor_connection.png",
            "alt": "Product and factor market connection",
            "caption": "Figure 12.2.5: Product markets and factor markets are linked."
          },
          
          "examples": [
            {
              "process": "Tech boom",
              "explanation": "Increased demand for software raises $MRP$ of programmers, increasing demand for programmers and raising wages."
            }
          ]
        },
        {
          "type": "Elasticity → Tax Incidence → Deadweight Loss",
          "value": "Tax analysis connection",
          "characteristics": ["Elasticity determines incidence", "Incidence affects who bears tax", "Tax wedge reduces quantity", "Elasticity determines $DWL$ size"],
          "behavior": "The effects of a tax are determined by elasticities. The more inelastic side bears more of the tax burden. If demand elasticity is $0.4$ and supply elasticity is $1.2$, consumers bear approximately $\\frac{1.2}{0.4+1.2} = 75\\%$ of the tax. The tax wedge reduces quantity below equilibrium, creating deadweight loss. The size of deadweight loss increases with elasticity—more elastic curves mean larger quantity reduction for a given tax. For a tax of $t$ per unit, $DWL = \\frac{1}{2} \\times t \\times \\Delta Q$. This connection explains why taxes on goods with inelastic demand (cigarettes, gasoline) raise revenue with relatively little deadweight loss, while taxes on elastic goods create larger inefficiency. It also explains why the same tax can have very different effects in different markets.",
          
          "image": {
            "src": "images/unit12/tax_connection.png",
            "alt": "Elasticity to incidence to DWL diagram",
            "caption": "Figure 12.2.6: Elasticity determines tax incidence and deadweight loss."
          },
          
          "examples": [
            {
              "process": "Cigarette tax",
              "explanation": "Cigarette demand is inelastic ($PED \\approx 0.4$). A $\\$1.00$ tax raises price by about $\\$0.80$ and reduces quantity by about $20\\%$, with relatively small deadweight loss."
            }
          ]
        },
        {
          "type": "Market Structure → Efficiency",
          "value": "Welfare implications",
          "characteristics": ["Perfect competition: $P = MC$, min $ATC$", "Monopoly: $P > MC$, $DWL$", "Monopolistic competition: $P > MC$, excess capacity", "Oligopoly: variable, often $DWL$"],
          "behavior": "Different market structures have different efficiency properties. Perfect competition achieves allocative efficiency ($P = MC$) and productive efficiency (min $ATC$). Monopoly creates deadweight loss ($P > MC$) and may not produce at min $ATC$. Monopolistic competition also has $P > MC$ and excess capacity (not at min $ATC$)—the gap between actual output and the output that minimizes $ATC$ represents productive inefficiency. Oligopoly outcomes vary but often involve deadweight loss. Understanding these connections helps you evaluate the welfare implications of different market structures and the potential role for policy. For example, comparing monopoly to perfect competition, the monopoly produces less ($Q_m < Q_c$) and charges a higher price ($P_m > P_c$), creating deadweight loss equal to the triangle between demand and $MC$ from $Q_m$ to $Q_c$.",
          
          "image": {
            "src": "images/unit12/structure_connection.png",
            "alt": "Market structure to efficiency diagram",
            "caption": "Figure 12.2.7: Market structure determines efficiency outcomes."
          },
          
          "examples": [
            {
              "process": "Monopoly vs competition",
              "explanation": "A monopolist produces where $MR = MC$, charging $P_m > MC$. Compared to perfect competition, output is lower and price is higher, creating deadweight loss."
            }
          ]
        },
        {
          "type": "Externalities → Market Failure → Corrective Policy",
          "value": "Government intervention rationale",
          "characteristics": ["Negative externality: $SMC > PMC$", "Positive externality: $SMB > PMB$", "Market over/underproduces", "$DWL$ from externality", "Pigouvian tax/subsidy corrects"],
          "behavior": "Externalities cause market failure because private decisions ignore social costs or benefits. With a negative externality, social marginal cost exceeds private marginal cost ($SMC > PMC$). The market produces where $P = PMC$, but efficiency requires $P = SMC$. This leads to overproduction and deadweight loss equal to the area between $SMC$ and demand from $Q_s$ to $Q_m$. A Pigouvian tax equal to the marginal external cost shifts the private cost curve up to $SMC$, achieving efficiency. With a positive externality, social marginal benefit exceeds private marginal benefit ($SMB > PMB$). The market underproduces, and a Pigouvian subsidy equal to the marginal external benefit can achieve efficiency. These connections show how government intervention can potentially improve outcomes when markets fail.",
          
          "image": {
            "src": "images/unit12/externality_connection.png",
            "alt": "Externality to policy diagram",
            "caption": "Figure 12.2.8: Externalities create market failure; corrective policies can help."
          },
          
          "examples": [
            {
              "process": "Pollution tax",
              "explanation": "A factory's pollution imposes $\\$50$ per unit external cost. A $\\$50$ tax internalizes the externality, leading to socially optimal output."
            }
          ]
        },
        {
          "type": "Trade → Welfare → Policy",
          "value": "International trade connections",
          "characteristics": ["Trade based on comparative advantage", "World price determines imports/exports", "Trade changes $CS$ and $PS$", "Tariffs create $DWL$", "Protectionism arguments"],
          "behavior": "International trade connects to domestic welfare through changes in consumer and producer surplus. When a country opens to trade, the domestic price adjusts to the world price. If the world price is below autarky price, the country imports: consumers gain area $A$, producers lose area $B$, total surplus increases by area $C$. If the world price is above autarky price, the country exports: producers gain, consumers lose, total surplus increases. Tariffs and quotas reduce these gains, creating deadweight loss. For a tariff of $t$ per unit, the deadweight loss consists of a production distortion triangle and a consumption distortion triangle. The arguments for protectionism (national security, infant industry, anti-dumping, jobs, fair trade) must be weighed against these efficiency losses. Understanding these connections helps evaluate real-world trade policy debates.",
          
          "image": {
            "src": "images/unit12/trade_connection.png",
            "alt": "Trade to welfare to policy diagram",
            "caption": "Figure 12.2.9: Trade affects welfare; tariffs create deadweight loss."
          },
          
          "examples": [
            {
              "process": "Steel tariff",
              "explanation": "A $25\\%$ tariff on steel raises domestic prices, benefits domestic producers, hurts consumers, and creates deadweight loss. The government gains tariff revenue."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Changes in One Market Ripple Through Related Markets",
          "statement": "Microeconomic markets are interconnected. A change in one market affects others through derived demand, input-output relationships, and substitution effects. For example, an increase in demand for cars increases demand for steel, which increases demand for iron ore and coal, which affects wages in mining communities. These ripple effects mean that partial equilibrium analysis (looking at one market in isolation) may miss important feedback effects. On the AP exam, you may need to trace these connections across markets. The key is to follow the chain: identify the initial change, determine its direct effect, then identify related markets and trace secondary effects.",
          "application": "When analyzing a change, ask: What markets are directly affected? What markets are indirectly affected through derived demand or substitution? How do these effects feed back to the original market? Draw diagrams to trace the connections.",
          "example": "An increase in the minimum wage from $\\$7.25$ to $\\$15$ affects the labor market directly (potentially causing unemployment). But it also affects product markets (higher production costs shift supply left, raising prices) and may lead firms to substitute capital for labor, affecting capital goods markets.",
          
          "image": {
            "src": "images/unit12/ripple.png",
            "alt": "Ripple effects across markets",
            "caption": "Figure 12.2.10: Changes ripple through interconnected markets."
          }
        },
        {
          "principle": "Always Trace Through to Efficiency and Welfare",
          "statement": "When analyzing any change in microeconomics—a policy, a shift in demand, a technological change—always trace through to the effects on efficiency and welfare. Ask: How does this affect consumer surplus? Producer surplus? Total surplus? Is there deadweight loss? Who gains and who loses? This welfare analysis is the ultimate measure of whether a change is good for society. For example, a price ceiling may help some consumers (those who get the good) but hurts others (those who can't find it) and creates deadweight loss. A tax creates government revenue but also deadweight loss. Trade creates winners and losers but increases total surplus. Making this connection automatically will help you answer both multiple-choice and free response questions effectively.",
          "application": "For any change, draw the supply and demand graph (or appropriate market graph) and identify the changes in consumer surplus, producer surplus, government revenue (if applicable), and total surplus. This will reveal the efficiency and distributional effects.",
          "example": "When analyzing a tariff, always identify: the change in consumer surplus (loss), change in producer surplus (gain), government revenue (gain), and deadweight loss (loss). The net effect is negative, showing the inefficiency of the tariff.",
          
          "image": {
            "src": "images/unit12/welfare_connection.png",
            "alt": "Tracing to welfare effects",
            "caption": "Figure 12.2.11: Always trace through to effects on surplus and efficiency."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Connecting Production, Costs, and Supply",
          
          "image": {
            "src": "images/unit12/connect_example1.png",
            "alt": "Production data and cost questions",
            "caption": "Figure 12.2.12: Trace the connection from production to supply."
          },
          
          "problem": "A firm's production function shows diminishing marginal product. The wage rate is $\\$20$ per hour.<br>a) Explain how diminishing marginal product affects the shape of the marginal cost curve.<br>b) If the wage rate increases to $\\$25$ per hour, what happens to the marginal cost curve?<br>c) How does this affect the firm's supply curve?<br>d) In a competitive market with many identical firms, how would this affect market supply and equilibrium price?",
          
          "step_by_step": [
            {
              "step": "Diminishing MP and MC",
              "explanation": "$MC = w/MP$. As $MP$ diminishes (falls), $MC$ rises. So the $MC$ curve slopes upward. The shape of $MC$ directly reflects diminishing returns—when $MP$ is high, $MC$ is low; when $MP$ falls, $MC$ rises."
            },
            {
              "step": "Wage increase effect",
              "explanation": "Higher wage increases $MC$ at every output level: $MC_{new} = 25/MP > 20/MP = MC_{old}$. The $MC$ curve shifts upward."
            },
            {
              "step": "Supply curve effect",
              "explanation": "The firm's supply curve is the $MC$ curve above $AVC$. So the supply curve also shifts upward (leftward)—at any given price, the firm supplies less than before."
            },
            {
              "step": "Market effects",
              "explanation": "All firms in the industry face higher wages, so each firm's supply shifts left. Market supply (the horizontal sum of individual supplies) shifts left. This increases equilibrium price and decreases equilibrium quantity in the product market."
            }
          ],
          
          "final_answer": "a) Diminishing $MP$ causes $MC$ to rise, giving $MC$ its upward slope. b) $MC$ shifts up at all output levels. c) Firm's supply curve (which is $MC$ above $AVC$) shifts left. d) Market supply shifts left, increasing price and decreasing quantity.",
          "concept_applied": "Changes in input prices or productivity affect costs, which affect supply, which affects market equilibrium."
        },
        {
          "title": "Connecting Product and Factor Markets",
          
          "image": {
            "src": "images/unit12/connect_example2.png",
            "alt": "Product and factor market scenario",
            "caption": "Figure 12.2.13: Trace connections between product and factor markets."
          },
          
          "problem": "The demand for new homes increases significantly.<br>a) How does this affect the market for construction workers? Show using supply and demand graphs for both markets.<br>b) How does the change in construction wages affect the market for new homes?<br>c) What happens to consumer surplus and producer surplus in both markets?",
          
          "step_by_step": [
            {
              "step": "Effect on construction labor market",
              "explanation": "Increased demand for homes increases the price of homes, which increases $MR$ for construction firms. This increases the marginal revenue product of construction workers ($MRP = MP \\times MR$). Labor demand shifts right. In the labor market, this increases both employment and wages."
            },
            {
              "step": "Effect back on housing market",
              "explanation": "Higher construction wages increase firms' costs, shifting supply in the housing market left. This puts upward pressure on home prices and reduces the quantity of homes built, partially offsetting the initial increase in demand."
            },
            {
              "step": "Welfare effects",
              "explanation": "In the labor market, both worker surplus (producer surplus in labor market) and firm surplus (consumer surplus in labor market) increase. In the housing market, consumer surplus may increase or decrease depending on relative shifts—higher prices hurt consumers, but more homes are built initially. The net effect depends on elasticities."
            }
          ],
          
          "final_answer": "a) Labor demand shifts right, increasing wages and employment. b) Higher wages shift housing supply left, increasing prices. c) Labor market surplus increases; housing market effects ambiguous.",
          "concept_applied": "Product market changes affect factor markets through derived demand; factor market changes feed back to product markets through costs."
        },
        {
          "title": "Connecting Elasticity, Tax Incidence, and Deadweight Loss",
          
          "image": {
            "src": "images/unit12/connect_example3.png",
            "alt": "Tax analysis with elasticities",
            "caption": "Figure 12.2.14: Use elasticities to predict tax effects."
          },
          
          "problem": "Two markets have the same equilibrium price of $\\$10$ and quantity of 100 units. Market A has demand elasticity $0.5$ and supply elasticity $1.5$. Market B has demand elasticity $1.5$ and supply elasticity $0.5$. A $\\$2$ per-unit tax is imposed in each market.<br>a) In which market do consumers bear more of the tax burden?<br>b) In which market is deadweight loss larger?<br>c) Calculate approximate tax incidence shares for each market.<br>d) Explain why the results differ.",
          
          "step_by_step": [
            {
              "step": "Tax incidence comparison",
              "explanation": "The more inelastic side bears more tax. In Market A, demand is more inelastic ($0.5 < 1.5$), so consumers bear more. In Market B, supply is more inelastic ($0.5 < 1.5$), so producers bear more."
            },
            {
              "step": "Deadweight loss comparison",
              "explanation": "$DWL$ increases with elasticity. Market A has one elastic side (supply) and one inelastic side (demand). Market B has one elastic side (demand) and one inelastic side (supply). The total elasticity (sum of absolute elasticities) determines $DWL$ size. Market A sum = $0.5 + 1.5 = 2.0$. Market B sum = $1.5 + 0.5 = 2.0$. Same sum, so $DWL$ approximately equal."
            },
            {
              "step": "Incidence calculation",
              "explanation": "Market A: consumer share = $\\frac{1.5}{0.5+1.5} = \\frac{1.5}{2.0} = 75\\%$, producer share = $25\\%$. Market B: consumer share = $\\frac{0.5}{1.5+0.5} = \\frac{0.5}{2.0} = 25\\%$, producer share = $75\\%$."
            },
            {
              "step": "Explanation",
              "explanation": "Incidence depends on relative elasticities—the side that can't easily change behavior bears more tax. $DWL$ depends on total elasticity—more responsive behavior means larger quantity reduction and larger $DWL$."
            }
          ],
          
          "final_answer": "a) Market A (consumers bear more). b) Approximately equal $DWL$ (same total elasticity). c) Market A: consumers 75%, producers 25%; Market B: consumers 25%, producers 75%. d) Incidence depends on relative elasticities; $DWL$ depends on total elasticity.",
          "concept_applied": "Elasticity determines both tax incidence (who bears the burden) and deadweight loss (how much inefficiency is created)."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Initial Change",
          "description": "Determine what is changing and in which market.",
          "mechanism": "Read scenario carefully. Is it a change in demand, supply, technology, input price, government policy?",
          "result": "Initial shock identified.",
          
          "image": {
            "src": "images/unit12/connect_step1.png",
            "alt": "Identifying initial change",
            "caption": "Figure 12.2.15: Step 1 - Identify the initial change."
          }
        },
        {
          "step": 2,
          "process": "Trace Direct Effects",
          "description": "Determine the immediate effects in the directly affected market.",
          "mechanism": "Use supply and demand analysis for product markets; factor market analysis for input markets. Identify changes in price, quantity, surplus.",
          "result": "Direct effects identified.",
          
          "image": {
            "src": "images/unit12/connect_step2.png",
            "alt": "Tracing direct effects",
            "caption": "Figure 12.2.16: Step 2 - Trace direct effects."
          }
        },
        {
          "step": 3,
          "process": "Identify Related Markets",
          "description": "Determine which other markets are linked through derived demand, input-output relationships, or substitution.",
          "mechanism": "Consider: Does this good use inputs that have their own markets? Is it an input to other goods? Are there substitute or complementary goods?",
          "result": "Related markets list.",
          
          "image": {
            "src": "images/unit12/connect_step3.png",
            "alt": "Identifying related markets",
            "caption": "Figure 12.2.17: Step 3 - Identify related markets."
          }
        },
        {
          "step": 4,
          "process": "Trace Indirect Effects",
          "description": "Analyze effects in related markets.",
          "mechanism": "Apply appropriate models to each related market. For input markets, use factor market analysis. For output markets, use supply and demand.",
          "result": "Indirect effects identified.",
          
          "image": {
            "src": "images/unit12/connect_step4.png",
            "alt": "Tracing indirect effects",
            "caption": "Figure 12.2.18: Step 4 - Trace indirect effects."
          }
        },
        {
          "step": 5,
          "process": "Consider Feedback Loops",
          "description": "Determine if changes in related markets feed back to the original market.",
          "mechanism": "Look for two-way connections that may amplify or dampen initial effects. This may require iterative analysis.",
          "result": "Complete analysis.",
          
          "image": {
            "src": "images/unit12/connect_step5.png",
            "alt": "Considering feedback loops",
            "caption": "Figure 12.2.19: Step 5 - Consider feedback loops."
          }
        }
      ],

      "image": {
        "src": "images/unit12/connections_summary.png",
        "alt": "Summary of key concept connections",
        "caption": "Figure 12.2.20: Connecting concepts summary."
      }
    }
  ],

  "key_terms": [
    "Connecting concepts",
    "Derived demand",
    "Marginal revenue product ($MRP$)",
    "Marginal cost ($MC$)",
    "Marginal product ($MP$)",
    "Tax incidence",
    "Deadweight loss ($DWL$)",
    "Elasticity",
    "Allocative efficiency",
    "Productive efficiency",
    "Market structure",
    "Perfect competition",
    "Monopoly",
    "Monopolistic competition",
    "Externality",
    "Pigouvian tax",
    "Pigouvian subsidy",
    "Social cost",
    "Social benefit",
    "Consumer surplus ($CS$)",
    "Producer surplus ($PS$)",
    "Total surplus",
    "Comparative advantage",
    "Tariff",
    "Quota",
    "Ripple effects",
    "Feedback loops",
    "Welfare analysis"
  ],

  "summary": "Connecting concepts across microeconomics is essential for success on the AP exam. Key connections include: (1) Production → Costs → Supply: The production function determines $MP$, which determines $MC = w/MP$, and $MC$ above $AVC$ is the firm's supply curve. (2) Product Markets → Factor Markets: Labor demand is derived from product demand and productivity ($MRP = MP \\times MR$). Changes in product markets shift factor demand; changes in factor prices shift product supply. (3) Elasticity → Tax Incidence → Deadweight Loss: The more inelastic side bears more tax burden. $DWL$ increases with total elasticity. (4) Market Structure → Efficiency: Perfect competition achieves $P = MC$ and min $ATC$; monopoly and monopolistic competition do not. (5) Externalities → Market Failure → Corrective Policy: Externalities create divergence between private and social incentives; Pigouvian taxes/subsidies can restore efficiency. (6) Trade → Welfare → Policy: Trade changes $CS$ and $PS$, increasing total surplus; tariffs create $DWL$. When analyzing any change, trace through to effects on efficiency and welfare—identify changes in $CS$, $PS$, government revenue, and total surplus. Understanding these connections helps you see the big picture and tackle integrated questions effectively."
}
