{
  "expanded_description": "Graphs are the language of microeconomics. On the AP exam, you'll need to draw, label, and interpret graphs quickly and accurately. This section reviews the essential graphs you must master, provides templates for each, and offers tips for drawing them under timed conditions. From supply and demand to cost curves, from market structures to externalities, mastering these graphs is one of the most effective ways to improve your exam score.",
  
  "core_concept": {
    "principle": "Success on the AP Microeconomics exam requires mastery of approximately 15 essential graphs. (1) Supply and demand: basic equilibrium, shifts, price controls, taxes, tariffs. (2) Elasticity: comparing elastic and inelastic demand curves. (3) Production and costs: total product, marginal product, cost curves (MC, ATC, AVC, AFC). (4) Perfect competition: firm and market graphs in short-run and long-run equilibrium. (5) Monopoly: demand, MR, MC, ATC, profit, deadweight loss. (6) Monopolistic competition: short-run profit, long-run equilibrium with excess capacity. (7) Oligopoly: game theory payoff matrices (not a traditional graph). (8) Factor markets: labor demand (MRP), labor supply, market equilibrium, monopsony. (9) Externalities: negative and positive externality graphs with social costs/benefits. (10) International trade: importing/exporting graphs with world price, tariff analysis.",
    
    "explanation": "Think of graphs as the vocabulary of economics. Just as you need words to form sentences, you need graphs to analyze economic situations. On the AP exam, correctly drawn and labeled graphs can earn you points even if your written explanation is incomplete. Mastering these graphs is like building a toolkit—each graph is a tool for a specific job.",
    
    "image": {
      "src": "images/unit12/graphing_overview.png",
      "alt": "Collection of essential microeconomics graphs",
      "caption": "Figure 12.1.1: Mastering these 10-15 graphs is essential for exam success."
    }
  },

  "sections": [
    {
      "section_title": "12.1 Graphing Bootcamp",
      "introduction": "Graphs are the language of microeconomics. On the AP exam, you'll need to draw, label, and interpret graphs quickly and accurately. This section reviews the essential graphs you must master, provides templates for each, and offers tips for drawing them under timed conditions. From supply and demand to cost curves, from market structures to externalities, mastering these graphs is one of the most effective ways to improve your exam score.",
      
      "introduction_image": {
        "src": "images/unit12/graphing_intro.png",
        "alt": "Student drawing graphs with timer",
        "caption": "Figure 12.1.2: Practice drawing graphs until they become automatic."
      },
      
      "key_concept": {
        "definition": "The essential graphs for AP Microeconomics can be organized by topic. (1) Supply and demand: basic graph, shifts, price controls, taxes, tariffs. (2) Elasticity: comparing elastic and inelastic demand curves. (3) Production and costs: total product, marginal product, cost curves (MC, ATC, AVC, AFC). (4) Perfect competition: firm and market graphs in short-run and long-run equilibrium, profit/loss situations. (5) Monopoly: demand, MR, MC, ATC, profit, deadweight loss. (6) Monopolistic competition: short-run profit, long-run equilibrium with excess capacity. (7) Oligopoly: game theory payoff matrices (not a traditional graph but essential). (8) Factor markets: labor demand (MRP), labor supply, market equilibrium, monopsony. (9) Externalities: negative and positive externality graphs with social costs/benefits, corrective taxes/subsidies. (10) International trade: importing/exporting graphs with world price, tariff/quota analysis. For each graph, you must be able to: draw it from memory, label all axes and curves, identify equilibrium points, shade relevant areas (CS, PS, profit, DWL), and show the effects of changes.",
        
        "context": "Graphing is not just about drawing—it's about demonstrating understanding. On free response questions, correctly labeled graphs can earn you partial credit even if your analysis is incomplete. According to the College Board, many students lose points on FRQs because their graphs are missing labels or are incorrectly drawn. Mastering these graphs is one of the most effective ways to improve your exam score.",
        
        "image": {
          "src": "images/unit12/graphing_templates.png",
          "alt": "Template graphs with labeling tips",
          "caption": "Figure 12.1.3: Practice drawing these graphs until they become automatic."
        }
      },

      "classifications": [
        {
          "type": "Supply and Demand Graphs",
          "value": "Foundation graphs",
          "characteristics": ["Basic equilibrium", "Shifts vs. movements", "Price ceilings and floors", "Tax incidence", "Tariffs and quotas"],
          "behavior": "Master these variations of the supply and demand graph: (1) Basic equilibrium: draw axes (Price, Quantity), downward-sloping demand curve, upward-sloping supply curve. Label equilibrium price $P^*$ and quantity $Q^*$. (2) Shifts: show and label shifts in supply or demand with arrows. Identify new equilibrium. (3) Price controls: for a binding price ceiling, show the maximum price below equilibrium, identify shortage ($Q_d > Q_s$), and shade deadweight loss. For a binding price floor, show minimum price above equilibrium, identify surplus ($Q_s > Q_d$), and shade deadweight loss. (4) Taxes: show tax wedge between consumer price $P_c$ and producer price $P_p$. Identify tax revenue rectangle and deadweight loss triangle. (5) Tariffs: start from free trade import situation, show world price $P_w$, then show price rising to $P_w + t$. Identify changes in domestic production, consumption, imports, government revenue, and deadweight loss triangles.",
          
          "image": {
            "src": "images/unit12/sd_graphs.png",
            "alt": "Supply and demand graph variations",
            "caption": "Figure 12.1.4: Master these five supply and demand graph variations."
          },
          
          "examples": [
            {
              "process": "Tax graph",
              "explanation": "Draw supply and demand. Show original equilibrium. Then shift supply up by tax amount, or show wedge between $P_c$ and $P_p$. Label consumer burden, producer burden, tax revenue, and deadweight loss."
            }
          ]
        },
        {
          "type": "Cost and Production Graphs",
          "value": "Firm-level analysis",
          "characteristics": ["Total product and marginal product", "MC, ATC, AVC, AFC", "Long-run ATC", "Economies/diseconomies of scale"],
          "behavior": "Essential cost and production graphs: (1) Production function: draw total product curve (increasing, then flattening as diminishing returns set in). Below it, draw marginal product curve (rising then falling) and average product curve (inverted U-shape). Show where MP intersects AP at AP's maximum. (2) Cost curves: draw MC, ATC, AVC, and AFC on the same graph. Remember: MC falls then rises, intersects ATC and AVC at their minima; ATC and AVC are U-shaped; AFC declines continuously. Label all curves. (3) Long-run ATC: draw U-shaped LRATC showing economies of scale (downward-sloping portion), constant returns (flat portion), and diseconomies of scale (upward-sloping portion). Label minimum efficient scale. (4) Relationship between MP and MC: show inverse relationship—when MP rises, MC falls; when MP falls, MC rises.",
          
          "image": {
            "src": "images/unit12/cost_graphs.png",
            "alt": "Cost and production curves",
            "caption": "Figure 12.1.5: Master cost and production graph relationships."
          },
          
          "examples": [
            {
              "process": "Short-run cost curves",
              "explanation": "Draw MC, ATC, AVC, AFC. Show MC intersecting ATC and AVC at their minima. Label each curve clearly."
            }
          ]
        },
        {
          "type": "Market Structure Graphs",
          "value": "Perfect competition, monopoly, monopolistic competition",
          "characteristics": ["Perfect competition: firm and market", "Monopoly: with profit and DWL", "Monopolistic competition: short and long run", "Natural monopoly regulation"],
          "behavior": "For each market structure: (1) Perfect competition: draw two graphs side by side—market (supply and demand) and firm (cost curves). Show market equilibrium price. In firm graph, draw horizontal demand at that price, MC, ATC. For short-run profit, show price above ATC, shade profit rectangle. For long-run equilibrium, show price tangent to ATC at minimum point. (2) Monopoly: draw demand, MR, MC, ATC. Find profit-maximizing $Q$ where $MR = MC$, then price from demand. Shade profit rectangle if $P > ATC$. Show deadweight loss triangle between demand and MC from $Q_m$ to competitive $Q_c$. (3) Monopolistic competition: for short-run profit, same as monopoly. For long-run equilibrium, show demand tangent to ATC at $Q^*$, with $P = ATC$ but $P > MC$, and excess capacity (gap between $Q^*$ and minimum ATC). (4) Natural monopoly: show declining ATC over relevant range. Show unregulated monopoly price and quantity. Show regulated options: marginal cost pricing ($P = MC$, may cause loss) and average cost pricing ($P = ATC$, zero profit).",
          
          "image": {
            "src": "images/unit12/market_structure_graphs.png",
            "alt": "Market structure graphs",
            "caption": "Figure 12.1.6: Master graphs for each market structure."
          },
          
          "examples": [
            {
              "process": "Monopoly with profit",
              "explanation": "Draw demand, MR, MC, ATC. Show $Q_m$ at $MR=MC$, $P_m$ from demand, $ATC$ at $Q_m$. Shade profit rectangle $(P_m - ATC) \\times Q_m$. Show deadweight loss triangle."
            }
          ]
        },
        {
          "type": "Factor Market Graphs",
          "value": "Labor markets",
          "characteristics": ["Competitive labor market", "Monopsony", "Labor demand = MRP", "Market power effects"],
          "behavior": "Factor market graphs: (1) Competitive labor market: draw labor supply and labor demand (which is the sum of firms' $MRP$ curves). Show equilibrium wage $W^*$ and employment $L^*$. (2) Firm's labor demand: draw $MRP$ curve (downward-sloping). Show optimal hiring where $MRP = W$. (3) Monopsony: draw upward-sloping labor supply $S$, marginal factor cost $MFC$ above supply, and $MRP$. Show monopsonist hires where $MRP = MFC$ at $L_m$, then pays wage $W_m$ from supply curve. Compare to competitive outcome ($L_c$, $W_c$) where $S = MRP$. Show deadweight loss. (4) Unions: can show union setting wage above equilibrium, creating surplus of labor (unemployment).",
          
          "image": {
            "src": "images/unit12/factor_market_graphs.png",
            "alt": "Factor market graphs",
            "caption": "Figure 12.1.7: Master competitive and monopsony labor market graphs."
          },
          
          "examples": [
            {
              "process": "Monopsony graph",
              "explanation": "Draw upward-sloping labor supply $S$, $MFC$ above it, and downward-sloping $MRP$. Show $L_m$ at $MRP = MFC$, $W_m$ from supply at that $L$. Show competitive $L_c$, $W_c$ at $S = MRP$. Shade deadweight loss."
            }
          ]
        },
        {
          "type": "Externality Graphs",
          "value": "Market failures",
          "characteristics": ["Negative externalities", "Positive externalities", "Social vs. private curves", "Corrective policies"],
          "behavior": "Externality graphs: (1) Negative externality (pollution): draw private marginal cost $PMC$ (supply) and demand $D$. Add social marginal cost $SMC$ above $PMC$ by amount of external cost. Show market quantity $Q_m$ at $D = PMC$, social optimum $Q_s$ at $D = SMC$. Shade deadweight loss triangle. Show corrective tax = external cost shifting $PMC$ to $SMC$. (2) Positive externality (education): draw private marginal benefit $PMB$ (demand) and supply $S$. Add social marginal benefit $SMB$ above $PMB$ by amount of external benefit. Show market quantity $Q_m$ at $PMB = S$, social optimum $Q_s$ at $SMB = S$. Shade deadweight loss triangle. Show corrective subsidy = external benefit shifting $PMB$ to $SMB$.",
          
          "image": {
            "src": "images/unit12/externality_graphs.png",
            "alt": "Externality graphs",
            "caption": "Figure 12.1.8: Master negative and positive externality graphs."
          },
          
          "examples": [
            {
              "process": "Negative externality",
              "explanation": "Draw $PMC$, $SMC$ (above $PMC$), and demand. Show $Q_m$ at $PMC = D$, $Q_s$ at $SMC = D$. Shade DWL triangle. Show tax arrow from $PMC$ to $SMC$."
            }
          ]
        },
        {
          "type": "International Trade Graphs",
          "value": "Trade policy",
          "characteristics": ["Importing country with world price", "Exporting country with world price", "Tariff analysis", "Quota analysis"],
          "behavior": "Trade graphs: (1) Importing country: draw domestic supply $S$ and demand $D$. Show autarky equilibrium $P_a$, $Q_a$. Show world price $P_w$ below $P_a$. At $P_w$, identify domestic consumption $C_w$, domestic production $Q_w$, imports = $C_w - Q_w$. Shade consumer gain, producer loss, net gain from trade. (2) Exporting country: same but $P_w$ above $P_a$. At $P_w$, identify domestic consumption $C_w$, domestic production $Q_w$, exports = $Q_w - C_w$. Shade producer gain, consumer loss, net gain. (3) Tariff: start from import situation. Show new price $P_t = P_w + t$. Identify new domestic production $Q_t$, consumption $C_t$, imports = $C_t - Q_t$. Show government revenue rectangle and deadweight loss triangles from production and consumption distortions. (4) Quota: similar to tariff but with quota rents instead of government revenue.",
          
          "image": {
            "src": "images/unit12/trade_graphs.png",
            "alt": "International trade graphs",
            "caption": "Figure 12.1.9: Master importing, exporting, and tariff graphs."
          },
          
          "examples": [
            {
              "process": "Tariff graph",
              "explanation": "Start from import situation. Show $P_w$, then $P_t = P_w + t$. Show new domestic production $Q_s'$, new consumption $Q_d'$. Shade government revenue rectangle and two deadweight loss triangles."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Label Everything on Your Graphs",
          "statement": "On the AP exam, you earn points for correct labels. Every graph should have: axes labeled (Price, Quantity, etc.), curves labeled (D, S, MC, ATC, MR, etc.), equilibrium points labeled, areas shaded or identified (consumer surplus, producer surplus, deadweight loss, profit, etc.), and any shifts clearly indicated with arrows. Even if your analysis is imperfect, correctly labeled graphs can earn you partial credit. Develop the habit of labeling automatically—it should become second nature. Before you consider a graph complete, run through a mental checklist: Are axes labeled? Are all curves labeled? Are key points marked? Are requested areas shaded?",
          "application": "Before drawing any graph, mentally check: What are the axes? What curves go where? What points need to be identified? What areas might need shading? Then draw and label systematically.",
          "example": "For a monopoly profit graph, you need: axes (Price, Quantity), curves (D, MR, MC, ATC), profit-maximizing quantity where $MR=MC$, price from demand at that quantity, $ATC$ at that quantity, profit rectangle shaded and labeled, and deadweight loss triangle shaded and labeled.",
          
          "image": {
            "src": "images/unit12/labeling.png",
            "alt": "Fully labeled monopoly graph",
            "caption": "Figure 12.1.10: Label everything—points are earned for correct labels."
          }
        },
        {
          "principle": "Practice Drawing Graphs from Memory",
          "statement": "The best way to master graphs is to practice drawing them from memory, under timed conditions. Set a timer for 2-3 minutes and try to draw a complete, correctly labeled graph. Then check against a template. Repeat until you can draw each essential graph quickly and accurately. On exam day, you won't have time to figure out how to draw a graph—it needs to be automatic. This muscle memory frees up mental energy for analysis. Create a study schedule: each day, practice 3-5 graphs. Focus on the ones you struggle with. By exam day, drawing these graphs should feel as natural as writing your name.",
          "application": "Create a list of essential graphs. Each day, pick 3-5 and draw them from memory. Time yourself. Check your work. Focus on the ones you struggle with.",
          "example": "Day 1: Perfect competition short-run profit, monopoly with deadweight loss, negative externality. Day 2: Labor market monopsony, tariff, monopolistic competition long-run. Day 3: Tax incidence, importing country, cost curves.",
          
          "image": {
            "src": "images/unit12/practice.png",
            "alt": "Student timing graph drawing practice",
            "caption": "Figure 12.1.11: Practice drawing graphs from memory until they become automatic."
          }
        },
        {
          "principle": "Understand the Story Each Graph Tells",
          "statement": "A graph is not just a collection of lines—it tells a story about economic relationships. When you draw a graph, you should be able to explain what each curve represents, why it has its shape, and what the intersections mean. For example, the $MC$ curve slopes upward because of diminishing returns. The intersection of $MC$ and $ATC$ occurs at the minimum of $ATC$ because when marginal cost is below average, average falls; when above, average rises. Understanding these stories helps you remember the graphs and also helps you explain them on free response questions. Don't just memorize shapes—understand the economics behind them.",
          "application": "For each graph, practice explaining it out loud: \"This is the demand curve, which slopes down because of the law of demand. This is the marginal revenue curve for a monopolist, which lies below demand because...\" Teaching the graph reinforces your understanding.",
          "example": "The production function graph tells the story of diminishing returns: total product increases at a decreasing rate after some point, which is why the marginal product curve eventually slopes downward.",
          
          "image": {
            "src": "images/unit12/story.png",
            "alt": "Graph with explanation",
            "caption": "Figure 12.1.12: Understand the economic story behind each graph."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Drawing a Complete Monopoly Graph",
          
          "image": {
            "src": "images/unit12/graph_example1.png",
            "alt": "Blank graph for monopoly",
            "caption": "Figure 12.1.13: Draw and label a complete monopoly graph showing profit."
          },
          
          "problem": "Draw a correctly labeled graph of a monopoly earning positive economic profit. Include all relevant curves, labels, and areas. Identify the profit-maximizing quantity and price, shade the profit area, and shade the deadweight loss.",
          
          "step_by_step": [
            {
              "step": "Draw axes",
              "explanation": "Vertical axis: Price, Cost. Horizontal axis: Quantity."
            },
            {
              "step": "Draw demand and MR",
              "explanation": "Draw downward-sloping demand curve $D$. Draw marginal revenue curve $MR$ below demand, starting at same intercept on price axis but twice as steep. Label both."
            },
            {
              "step": "Draw MC and ATC",
              "explanation": "Draw U-shaped marginal cost curve $MC$. Draw U-shaped average total cost curve $ATC$ above $MC$ at low quantities, intersecting $MC$ at $ATC$'s minimum. Label both."
            },
            {
              "step": "Find profit-maximizing Q",
              "explanation": "Find where $MR = MC$. From that intersection, draw a vertical line down to the quantity axis. Label this quantity $Q_m$."
            },
            {
              "step": "Find price",
              "explanation": "From $Q_m$, go vertically up to the demand curve. From that point, draw a horizontal line to the price axis. Label this price $P_m$."
            },
            {
              "step": "Find ATC at Q_m",
              "explanation": "At $Q_m$, find the point on the $ATC$ curve. Label this point. The height is $ATC_m$."
            },
            {
              "step": "Shade profit",
              "explanation": "Profit = $(P_m - ATC_m) \\times Q_m$. Shade this rectangle and label \"Profit\"."
            },
            {
              "step": "Find competitive quantity",
              "explanation": "Find where demand intersects $MC$. Label this quantity $Q_c$ (the competitive outcome)."
            },
            {
              "step": "Shade deadweight loss",
              "explanation": "Deadweight loss is the triangle between demand and $MC$ from $Q_m$ to $Q_c$. Shade this triangle and label \"DWL\"."
            }
          ],
          
          "final_answer": "Graph should show all curves labeled ($D$, $MR$, $MC$, $ATC$), $Q_m$ at $MR=MC$, $P_m$ from demand, $ATC_m$ at $Q_m$, profit rectangle shaded, $Q_c$ at $P=MC$, and deadweight loss triangle shaded.",
          "concept_applied": "Complete labeling is essential for earning full credit on graph-based questions."
        },
        {
          "title": "Drawing a Negative Externality Graph",
          
          "image": {
            "src": "images/unit12/graph_example2.png",
            "alt": "Blank graph for externality",
            "caption": "Figure 12.1.14: Draw and label a negative externality graph."
          },
          
          "problem": "Draw a correctly labeled graph showing a negative externality (pollution) in production. Include private marginal cost, social marginal cost, demand, market equilibrium, social optimum, and deadweight loss. Show how a corrective tax would achieve the social optimum.",
          
          "step_by_step": [
            {
              "step": "Draw axes",
              "explanation": "Vertical axis: Price, Cost. Horizontal axis: Quantity."
            },
            {
              "step": "Draw demand",
              "explanation": "Draw downward-sloping demand curve $D$. This represents marginal private benefit (also marginal social benefit if no consumption externality)."
            },
            {
              "step": "Draw private MC",
              "explanation": "Draw upward-sloping private marginal cost curve $PMC$ (supply). Label."
            },
            {
              "step": "Draw social MC",
              "explanation": "Draw social marginal cost curve $SMC$ above $PMC$, parallel if constant external cost. The vertical distance between $SMC$ and $PMC$ is the marginal external cost. Label $SMC$."
            },
            {
              "step": "Identify market equilibrium",
              "explanation": "Find where $D$ intersects $PMC$. Label this quantity $Q_m$ and price $P_m$."
            },
            {
              "step": "Identify social optimum",
              "explanation": "Find where $D$ intersects $SMC$. Label this quantity $Q_s$ and price $P_s$."
            },
            {
              "step": "Shade deadweight loss",
              "explanation": "Deadweight loss is the triangle between $SMC$ and $D$ from $Q_s$ to $Q_m$. Shade this triangle and label \"DWL\"."
            },
            {
              "step": "Show corrective tax",
              "explanation": "Draw an arrow from $PMC$ up to $SMC$ labeled \"Tax = external cost\". Show that with tax, private cost becomes $SMC$, so market would produce at $Q_s$."
            }
          ],
          
          "final_answer": "Graph should show $D$, $PMC$, $SMC$, $Q_m$, $Q_s$, deadweight loss triangle, and tax arrow.",
          "concept_applied": "Externality graphs show the divergence between private and social costs and the role of corrective policy."
        },
        {
          "title": "Drawing a Tariff Graph",
          
          "image": {
            "src": "images/unit12/graph_example3.png",
            "alt": "Blank graph for tariff",
            "caption": "Figure 12.1.15: Draw and label a tariff graph."
          },
          
          "problem": "Draw a correctly labeled graph showing the effects of a tariff on an importing country. Include domestic supply and demand, world price, tariff-inclusive price, domestic production, domestic consumption, imports, government revenue, and deadweight loss.",
          
          "step_by_step": [
            {
              "step": "Draw axes",
              "explanation": "Vertical axis: Price. Horizontal axis: Quantity."
            },
            {
              "step": "Draw domestic supply and demand",
              "explanation": "Draw downward-sloping domestic demand $D_d$ and upward-sloping domestic supply $S_d$. Label both."
            },
            {
              "step": "Show world price",
              "explanation": "Draw a horizontal line at world price $P_w$, below the autarky equilibrium. Label $P_w$."
            },
            {
              "step": "Identify free trade quantities",
              "explanation": "At $P_w$, find domestic consumption $C_{ft}$ on demand curve and domestic production $Q_{ft}$ on supply curve. Label these points. Imports $= C_{ft} - Q_{ft}$."
            },
            {
              "step": "Show tariff-inclusive price",
              "explanation": "Draw a horizontal line at $P_t = P_w + t$, above $P_w$ but below autarky price. Label $P_t$."
            },
            {
              "step": "Identify post-tariff quantities",
              "explanation": "At $P_t$, find domestic consumption $C_t$ on demand and domestic production $Q_t$ on supply. Label these points. New imports $= C_t - Q_t$."
            },
            {
              "step": "Shade government revenue",
              "explanation": "Government revenue = tariff per unit × quantity of imports after tariff = $t \\times (C_t - Q_t)$. This is a rectangle. Shade and label \"Gov't Revenue\"."
            },
            {
              "step": "Shade deadweight loss",
              "explanation": "Deadweight loss has two triangles: (1) Production distortion: triangle between supply and $P_w$ from $Q_{ft}$ to $Q_t$. (2) Consumption distortion: triangle between demand and $P_w$ from $C_t$ to $C_{ft}$. Shade both and label \"DWL\"."
            }
          ],
          
          "final_answer": "Graph should show $D_d$, $S_d$, $P_w$, $P_t$, free trade quantities, post-tariff quantities, government revenue rectangle, and two deadweight loss triangles.",
          "concept_applied": "Tariff graphs show how trade restrictions affect domestic markets and create deadweight loss."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Graph Type",
          "description": "Determine which graph the question requires.",
          "mechanism": "Read question carefully. Look for keywords: monopoly, perfect competition, externality, tariff, etc.",
          "result": "Graph type identified.",
          
          "image": {
            "src": "images/unit12/graph_step1.png",
            "alt": "Identifying graph type",
            "caption": "Figure 12.1.16: Step 1 - Identify the required graph type."
          }
        },
        {
          "step": 2,
          "process": "Recall Template",
          "description": "Visualize the standard template for that graph.",
          "mechanism": "Think: What curves go where? What are the key points? What needs to be labeled?",
          "result": "Mental template.",
          
          "image": {
            "src": "images/unit12/graph_step2.png",
            "alt": "Recalling graph template",
            "caption": "Figure 12.1.17: Step 2 - Recall the standard template."
          }
        },
        {
          "step": 3,
          "process": "Draw Axes and Curves",
          "description": "Sketch the basic structure first.",
          "mechanism": "Draw axes, then add curves in correct positions. Use light pencil for initial sketch.",
          "result": "Basic graph.",
          
          "image": {
            "src": "images/unit12/graph_step3.png",
            "alt": "Drawing axes and curves",
            "caption": "Figure 12.1.18: Step 3 - Draw axes and curves."
          }
        },
        {
          "step": 4,
          "process": "Label Everything",
          "description": "Add all necessary labels: axes, curves, points, areas.",
          "mechanism": "Go through checklist: axes labeled? curves labeled? equilibrium points? shaded areas?",
          "result": "Complete labeled graph.",
          
          "image": {
            "src": "images/unit12/graph_step4.png",
            "alt": "Labeling graph",
            "caption": "Figure 12.1.19: Step 4 - Label everything."
          }
        },
        {
          "step": 5,
          "process": "Check Against Requirements",
          "description": "Verify that graph includes everything the question asked for.",
          "mechanism": "Reread question. Did you include all required elements? Are all labels correct?",
          "result": "Final graph ready.",
          
          "image": {
            "src": "images/unit12/graph_step5.png",
            "alt": "Checking graph",
            "caption": "Figure 12.1.20: Step 5 - Check against requirements."
          }
        }
      ],

      "image": {
        "src": "images/unit12/graphing_summary.png",
        "alt": "Summary of essential graphs with key features",
        "caption": "Figure 12.1.21: Graphing bootcamp summary."
      }
    }
  ],

  "key_terms": [
    "Graphing bootcamp",
    "Essential graphs",
    "Supply and demand",
    "Price ceiling",
    "Price floor",
    "Tax incidence",
    "Tariff",
    "Quota",
    "Cost curves",
    "Marginal cost",
    "Average total cost",
    "Perfect competition",
    "Monopoly",
    "Deadweight loss",
    "Monopolistic competition",
    "Excess capacity",
    "Factor markets",
    "Monopsony",
    "Marginal revenue product",
    "Negative externality",
    "Positive externality",
    "Social cost",
    "Social benefit",
    "Pigouvian tax",
    "Pigouvian subsidy",
    "International trade",
    "World price",
    "Imports",
    "Exports",
    "Labeling",
    "Graphing from memory"
  ],

  "summary": "Graphing Bootcamp reviews the essential graphs you must master for the AP Microeconomics exam. These include: (1) Supply and demand variations—basic equilibrium, shifts, price controls, taxes, tariffs. (2) Cost and production graphs—total product, marginal product, cost curves (MC, ATC, AVC, AFC), long-run ATC. (3) Market structure graphs—perfect competition (firm and market), monopoly (with profit and deadweight loss), monopolistic competition (short-run and long-run), natural monopoly regulation. (4) Factor market graphs—competitive labor market, firm's labor demand, monopsony. (5) Externality graphs—negative externalities (pollution) showing social cost, positive externalities (education) showing social benefit, corrective taxes and subsidies. (6) International trade graphs—importing and exporting countries, tariff and quota analysis. Key principles for success: (1) Label everything on your graphs—every axis, curve, point, and area earns points. (2) Practice drawing graphs from memory until they become automatic. (3) Understand the economic story behind each graph—why curves have their shapes and what intersections mean. With consistent practice, you'll be able to draw any required graph quickly and accurately on exam day, earning maximum points on graph-based questions."
}
