{
  "expanded_description": "Even well-prepared students lose points on the AP exam due to common mistakes and misconceptions. Confusing similar concepts, mislabeling graphs, making calculation errors, or falling for common traps can cost you valuable points. This section identifies the most frequent errors students make, explains why they happen, and shows you how to avoid them. Knowing these pitfalls in advance is like having a map of the potholes on the road to a 5.",
  
  "core_concept": {
    "principle": "Common mistakes on the AP Microeconomics exam fall into several categories: (1) Graph errors: mislabeling axes, incorrect curve shapes, missing labels, confusing shifts and movements. (2) Concept confusion: mixing up normal vs. inferior goods, substitutes vs. complements, movement vs. shift, short run vs. long run. (3) Calculation errors: incorrect use of the midpoint formula, misapplying elasticity formulas, arithmetic mistakes. (4) Definition errors: misunderstanding key terms like economic profit vs. accounting profit, consumer surplus vs. producer surplus. (5) Application errors: incorrectly predicting the effects of changes, misidentifying market structures, misapplying tax incidence rules. (6) Reading errors: missing key words like \"except,\" \"not,\" or \"most likely.\"",
    
    "explanation": "Think of these common mistakes like traps in a video game. If you know where they are, you can avoid them. The students who earn 5s aren't necessarily smarter—they've just learned to avoid the common pitfalls that trip up other students. This section is your guide to spotting and sidestepping those traps.",
    
    "image": {
      "src": "images/unit12/mistakes_overview.png",
      "alt": "Warning signs for common mistakes: graph errors, concept confusion, calculation mistakes",
      "caption": "Figure 12.3.1: Knowing common mistakes helps you avoid them."
    }
  },

  "sections": [
    {
      "section_title": "12.3 Common Mistakes and Misconceptions",
      "introduction": "Even well-prepared students lose points on the AP exam due to common mistakes and misconceptions. Confusing similar concepts, mislabeling graphs, making calculation errors, or falling for common traps can cost you valuable points. This section identifies the most frequent errors students make, explains why they happen, and shows you how to avoid them. Knowing these pitfalls in advance is like having a map of the potholes on the road to a 5.",
      
      "introduction_image": {
        "src": "images/unit12/mistakes_intro.png",
        "alt": "Student looking at test with red marks",
        "caption": "Figure 12.3.2: Learn from common mistakes to avoid losing points."
      },
      
      "key_concept": {
        "definition": "Common mistakes on the AP Microeconomics exam can be categorized by type. (1) Graph errors: forgetting to label axes, drawing curves with incorrect shapes (e.g., drawing $MC$ as downward-sloping), missing labels like $MR$ on monopoly graphs, confusing shifts of curves with movements along curves, forgetting to shade areas like profit or deadweight loss. (2) Concept confusion: mixing up normal goods (demand increases when income increases) with inferior goods (demand decreases when income increases); confusing substitutes (positive cross-price elasticity) with complements (negative cross-price elasticity); confusing short-run concepts (at least one fixed input) with long-run concepts (all inputs variable); confusing economic profit (includes opportunity cost) with accounting profit (does not). (3) Calculation errors: using simple percentage change instead of midpoint formula for elasticity, forgetting that $PED$ is negative, miscomputing $MRP = MP \\times P$ for competitive firms vs. $MP \\times MR$ for firms with market power, arithmetic errors in surplus calculations. (4) Definition errors: thinking \"normal profit\" means zero economic profit (it does), but confusing it with positive accounting profit; thinking consumer surplus is just \"what consumers save\" rather than the area under demand above price. (5) Application errors: predicting that a price ceiling below equilibrium will create a surplus (it creates a shortage); thinking that a tax on sellers means sellers bear the full burden (incidence depends on elasticities); assuming monopolists always earn profit (they can incur losses in short run). (6) Reading errors: missing words like \"except,\" \"not,\" or \"most likely\" that change the meaning of questions; answering a different question than asked.",
        
        "context": "The College Board's AP Microeconomics exam reports consistently show that students lose points on the same types of questions year after year. By understanding these common mistakes, you can avoid them and earn points that other students miss. This is one of the most effective ways to improve your score.",
        
        "image": {
          "src": "images/unit12/mistakes_categories.png",
          "alt": "Categories of common mistakes",
          "caption": "Figure 12.3.3: Common mistakes fall into several categories."
        }
      },

      "classifications": [
        {
          "type": "Graph Errors",
          "value": "Mistakes in drawing and labeling graphs",
          "characteristics": ["Unlabeled axes", "Wrong curve shapes", "Missing curves", "No equilibrium points", "Unshaded areas", "Shift vs. movement confusion"],
          "behavior": "Graph errors are among the most common and costly mistakes on the AP exam. Students lose points because they: (1) Forget to label axes—every graph needs Price on the vertical axis and Quantity on the horizontal. (2) Draw curves with incorrect shapes—demand slopes down, supply slopes up, $MC$ is U-shaped, $ATC$ and $AVC$ are U-shaped with $ATC$ above $AVC$, $AFC$ declines continuously. (3) Forget to include all required curves—monopoly graphs need $D$, $MR$, $MC$, and often $ATC$; perfect competition needs firm and market graphs. (4) Fail to identify equilibrium points—label $P^*$ and $Q^*$ where appropriate. (5) Forget to shade areas—profit, consumer surplus, producer surplus, deadweight loss should be shaded and labeled. (6) Confuse shifts of curves with movements along curves—a change in price causes movement along; a change in any other factor causes shift. To avoid these errors, use a mental checklist before considering a graph complete.",
          
          "image": {
            "src": "images/unit12/graph_errors.png",
            "alt": "Common graph errors highlighted",
            "caption": "Figure 12.3.4: Graph errors cost many points."
          },
          
          "examples": [
            {
              "process": "Missing MR curve",
              "explanation": "In a monopoly graph, students often draw demand and $MC$ but forget the $MR$ curve. Without $MR$, you cannot find the profit-maximizing quantity where $MR = MC$."
            },
            {
              "process": "Wrong $MC$ shape",
              "explanation": "Drawing $MC$ as downward-sloping throughout instead of U-shaped shows misunderstanding of diminishing returns and loses points."
            }
          ]
        },
        {
          "type": "Concept Confusion",
          "value": "Mixing up related but different concepts",
          "characteristics": ["Normal vs. inferior goods", "Substitutes vs. complements", "Movement vs. shift", "Short run vs. long run", "Economic vs. accounting profit"],
          "behavior": "Concept confusion occurs when students mix up terms that sound similar or are related but have distinct meanings. Common confusions: (1) Normal goods (demand increases when income increases) vs. inferior goods (demand decreases when income increases). Remember: most goods are normal; inferior goods are things like generic brands or public transit that people buy less of as they get richer. (2) Substitutes (positive cross-price elasticity) vs. complements (negative cross-price elasticity). If the price of coffee increases and tea demand increases, they're substitutes. If the price of printers increases and ink demand decreases, they're complements. (3) Movement along a curve (caused by price change) vs. shift of a curve (caused by change in any other factor). (4) Short run (at least one fixed input) vs. long run (all inputs variable). (5) Economic profit (total revenue minus total cost including opportunity cost) vs. accounting profit (total revenue minus explicit costs only). Normal profit means zero economic profit, not zero accounting profit.",
          
          "image": {
            "src": "images/unit12/concept_confusion.png",
            "alt": "Concept pairs often confused",
            "caption": "Figure 12.3.5: Many students confuse similar-sounding concepts."
          },
          
          "examples": [
            {
              "process": "Normal vs. inferior",
              "explanation": "A question asks: \"If income increases and demand for Good X decreases, Good X is:\" The correct answer is inferior good. Many students incorrectly say normal good."
            },
            {
              "process": "Movement vs. shift",
              "explanation": "\"An increase in the price of coffee will cause:\" Answer: a movement along the demand curve for coffee (decrease in quantity demanded). Students often say \"decrease in demand\" (which would be a shift)."
            }
          ]
        },
        {
          "type": "Calculation Errors",
          "value": "Mistakes in quantitative problems",
          "characteristics": ["Wrong elasticity formula", "Midpoint formula misuse", "$MRP$ calculation errors", "Arithmetic mistakes", "Unit errors"],
          "behavior": "Calculation errors cost points even when students understand the underlying concepts. Common calculation mistakes: (1) Using simple percentage change instead of the midpoint formula for elasticity. The midpoint formula is $\\frac{Q_2 - Q_1}{(Q_2 + Q_1)/2} \\div \\frac{P_2 - P_1}{(P_2 + P_1)/2}$. This gives the same elasticity regardless of direction. (2) Forgetting that price elasticity of demand is negative, but economists often use absolute value for interpretation. (3) Confusing $MRP$ calculations: for a competitive firm, $MRP = MP \\times P$; for a firm with market power, $MRP = MP \\times MR$. (4) Arithmetic errors in surplus calculations—finding areas of triangles ($\\frac{1}{2} \\times base \\times height$) and rectangles. (5) Unit errors—forgetting that quantities might be in thousands or millions. To avoid these, write out formulas step by step and double-check arithmetic.",
          
          "image": {
            "src": "images/unit12/calc_errors.png",
            "alt": "Common calculation errors",
            "caption": "Figure 12.3.6: Calculation errors are avoidable with careful work."
          },
          
          "examples": [
            {
              "process": "Midpoint formula",
              "explanation": "When price rises from $\\$4$ to $\\$6$ and quantity falls from 100 to 80, the correct $PED$ using midpoint is $\\frac{80-100}{90} \\div \\frac{6-4}{5} = \\frac{-20}{90} \\div \\frac{2}{5} = -0.222 \\div 0.4 = -0.556$. Using simple percentage gives $\\frac{-20\\%}{50\\%} = -0.4$, which is incorrect."
            }
          ]
        },
        {
          "type": "Definition Errors",
          "value": "Misunderstanding key terms",
          "characteristics": ["Economic vs. accounting profit", "Consumer vs. producer surplus", "Normal profit", "Allocative vs. productive efficiency", "Explicit vs. implicit costs"],
          "behavior": "Definition errors occur when students haven't mastered the precise meaning of key terms. Common definition mistakes: (1) Thinking economic profit and accounting profit are the same. Economic profit = total revenue - total cost (including opportunity cost). Accounting profit = total revenue - explicit costs only. (2) Confusing consumer surplus (benefit to buyers) with producer surplus (benefit to sellers). (3) Misunderstanding \"normal profit\"—this means zero economic profit, not zero accounting profit. A firm earning normal profit is covering all costs including opportunity cost. (4) Mixing up allocative efficiency ($P = MC$) with productive efficiency (production at minimum $ATC$). (5) Not distinguishing explicit costs (out-of-pocket payments) from implicit costs (opportunity costs of using resources the firm already owns). These definitions are tested directly and are also essential for applying concepts correctly.",
          
          "image": {
            "src": "images/unit12/definition_errors.png",
            "alt": "Common definition errors",
            "caption": "Figure 12.3.7: Precise definitions matter."
          },
          
          "examples": [
            {
              "process": "Normal profit",
              "explanation": "A question asks: \"If a firm is earning normal profit, its economic profit is:\" Answer: zero. Many students incorrectly say positive because they confuse normal profit with accounting profit."
            }
          ]
        },
        {
          "type": "Application Errors",
          "value": "Misapplying concepts to scenarios",
          "characteristics": ["Price ceiling effects", "Tax incidence", "Monopoly profit", "Externality policies", "Trade effects"],
          "behavior": "Application errors happen when students know the concepts but apply them incorrectly to specific situations. Common application mistakes: (1) Predicting that a price ceiling below equilibrium will create a surplus—it actually creates a shortage because quantity demanded exceeds quantity supplied. (2) Thinking that a tax on sellers means sellers bear the full burden—incidence depends on elasticities, not on who writes the check. (3) Assuming monopolists always earn positive economic profit—they can incur losses in the short run if demand is low. (4) Confusing the correct policy for externalities—using a tax for positive externalities (should be subsidy) or subsidy for negative externalities (should be tax). (5) Misidentifying whether a country becomes an importer or exporter based on world price relative to autarky price. To avoid these, always draw the relevant graph and trace through the effects step by step.",
          
          "image": {
            "src": "images/unit12/application_errors.png",
            "alt": "Common application errors",
            "caption": "Figure 12.3.8: Application errors show misunderstanding of how concepts work."
          },
          
          "examples": [
            {
              "process": "Tax incidence",
              "explanation": "A question asks: \"A $\\$1$ tax is imposed on sellers. Who bears the burden?\" The correct answer depends on elasticities. Students often incorrectly say \"sellers\" because the tax is on sellers."
            }
            }
          ]
        },
        {
          "type": "Reading Errors",
          "value": "Misreading the question",
          "characteristics": ["Missing 'except' or 'not'", "Answering wrong part", "Overlooking qualifiers", "Misinterpreting what's asked"],
          "behavior": "Reading errors are perhaps the most frustrating because they cost points even when you know the material. Common reading mistakes: (1) Missing words like \"except,\" \"not,\" or \"least likely\" that completely change the meaning. A question that asks \"All of the following are true EXCEPT\" requires you to find the false statement. (2) Answering a different question than asked—for example, explaining producer surplus when the question asked for consumer surplus. (3) Overlooking qualifiers like \"in the short run\" or \"assuming constant costs\" that change the analysis. (4) Misinterpreting what a question is asking—for example, confusing \"identify\" (just name it) with \"explain\" (give reasons) with \"calculate\" (show work and give number). To avoid reading errors, circle key words, read each question twice, and check that your answer matches what was asked.",
          
          "image": {
            "src": "images/unit12/reading_errors.png",
            "alt": "Common reading errors",
            "caption": "Figure 12.3.9: Reading errors cost points even when you know the material."
          },
          
          "examples": [
            {
              "process": "Except questions",
              "explanation": "A question lists four characteristics of perfect competition and one that is not. Students who don't see \"except\" might choose the first correct characteristic rather than the one that is false."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Always Check Your Graphs Against a Mental Checklist",
          "statement": "Before you consider a graph complete, run through a mental checklist: (1) Are both axes labeled? (Price and Quantity, or appropriate labels for factor markets). (2) Are all curves labeled? (D, S, MC, ATC, AVC, MR, etc.). (3) Are equilibrium points marked? ($P^*$, $Q^*$, or $W^*$, $L^*$). (4) Are requested areas shaded? (Consumer surplus, producer surplus, profit, deadweight loss). (5) Are shifts clearly shown with arrows? (6) Does the graph match the market structure? (Perfect competition has horizontal demand for firm; monopoly has downward-sloping demand and MR below it). Developing this habit will prevent most graph errors.",
          "application": "After drawing any graph on the exam, pause for 10 seconds and mentally check each item on your checklist. Add any missing labels before moving on.",
          "example": "For a monopoly graph, your checklist: axes (Price, Quantity)? curves (D, MR, MC, ATC)? $Q^*$ at $MR=MC$? $P^*$ from demand? $ATC$ at $Q^*$? profit rectangle shaded? deadweight loss triangle shaded?",
          
          "image": {
            "src": "images/unit12/checklist.png",
            "alt": "Graph checklist",
            "caption": "Figure 12.3.10: Use a mental checklist to avoid graph errors."
          }
        },
        {
          "principle": "Read Questions Carefully—Twice",
          "statement": "Many points are lost not because students don't know the material, but because they misread the question. Before answering: (1) Read the question once to understand what's being asked. (2) Read it again, circling key words: \"except,\" \"not,\" \"most likely,\" \"in the short run,\" \"assuming.\" (3) Identify what type of answer is required: identify, explain, calculate, draw. (4) Make sure you're answering exactly what's asked, not a related question you've seen before. This extra 30 seconds can save you from costly reading errors.",
          "application": "On multiple-choice questions, read all answer choices before selecting. On free response, underline the action words in each part (identify, explain, calculate) and make sure your response matches.",
          "example": "If a question asks \"Which of the following would NOT cause an increase in demand?\" circling \"NOT\" reminds you that you're looking for the exception, not the causes.",
          
          "image": {
            "src": "images/unit12/read_twice.png",
            "alt": "Reading carefully",
            "caption": "Figure 12.3.11: Read each question twice to avoid misreading."
          }
        },
        {
          "principle": "Show Your Work for Calculations",
          "statement": "On calculation questions, showing your work serves two purposes: (1) It helps you avoid errors by making your steps clear. (2) It earns partial credit even if your final answer is wrong. AP readers can award points for correct steps even when the final answer is incorrect. Write out formulas before plugging in numbers. Use the midpoint formula explicitly. Show how you find areas of triangles and rectangles. This habit can make the difference between a 4 and a 5.",
          "application": "For any calculation, write: the formula, the numbers substituted, the intermediate step, and the final answer with units. Even if you're short on time, jotting down the formula shows the reader what you intended.",
          "example": "For elasticity: $PED = \\frac{(Q_2 - Q_1)}{(Q_2 + Q_1)/2} \\div \\frac{(P_2 - P_1)}{(P_2 + P_1)/2} = \\frac{80-100}{90} \\div \\frac{6-4}{5} = \\frac{-20}{90} \\div \\frac{2}{5} = -0.222 \\div 0.4 = -0.556$.",
          
          "image": {
            "src": "images/unit12/show_work.png",
            "alt": "Showing work",
            "caption": "Figure 12.3.12: Showing work earns partial credit."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying and Correcting Common Mistakes",
          
          "image": {
            "src": "images/unit12/mistakes_example1.png",
            "alt": "Student answers with mistakes",
            "caption": "Figure 12.3.13: Identify the mistake in each scenario."
          },
          
          "problem": "For each scenario, identify the mistake and explain the correct answer:<br>a) A student draws a monopoly graph and labels the profit-maximizing quantity where $P = MC$.<br>b) A student says that if the price of coffee increases, the demand for tea will decrease because they are substitutes.<br>c) A student calculates elasticity as $(20\\%)/(10\\%) = 2$ when price increases from $\\$10$ to $\\$12$ and quantity decreases from 100 to 80.<br>d) A student says that a $\\$1$ tax on sellers will be paid entirely by sellers.<br>e) A student draws a price ceiling below equilibrium and labels the resulting surplus.",
          
          "step_by_step": [
            {
              "step": "Scenario a",
              "explanation": "Mistake: Monopolist maximizes where $MR = MC$, not $P = MC$. $P = MC$ is the competitive outcome. Correct: Profit-maximizing quantity is where $MR = MC$; price is then read from demand curve."
            },
            {
              "step": "Scenario b",
              "explanation": "Mistake: Confusing substitutes and complements. Coffee and tea are substitutes—if coffee price increases, tea demand should increase, not decrease. Correct: Substitutes have positive cross-price elasticity; when price of one increases, demand for the other increases."
            },
            {
              "step": "Scenario c",
              "explanation": "Mistake: Using simple percentage change instead of midpoint formula. Correct: Midpoint formula gives $\\frac{80-100}{90} \\div \\frac{12-10}{11} = \\frac{-20}{90} \\div \\frac{2}{11} = -0.222 \\div 0.182 = -1.22$ (elastic)."
            },
            {
              "step": "Scenario d",
              "explanation": "Mistake: Confusing statutory incidence with economic incidence. Correct: Tax burden depends on elasticities—the more inelastic side bears more of the tax, regardless of who writes the check."
            },
            {
              "step": "Scenario e",
              "explanation": "Mistake: Price ceiling below equilibrium creates a shortage ($Q_d > Q_s$), not a surplus. Correct: Label the gap as shortage, and show that quantity traded is $Q_s$."
            }
          ],
          
          "final_answer": "a) Should use $MR = MC$. b) Tea demand should increase (substitutes). c) Should use midpoint formula. d) Incidence depends on elasticities. e) Price ceiling creates shortage, not surplus.",
          "concept_applied": "Identifying common mistakes helps you avoid them on your own exam."
        },
        {
          "title": "Correcting Graph Errors",
          
          "image": {
            "src": "images/unit12/mistakes_example2.png",
            "alt": "Flawed monopoly graph",
            "caption": "Figure 12.3.14: Identify and correct the errors in this graph."
          },
          
          "problem": "A student drew the monopoly graph shown. Identify at least five errors in the graph and explain how to correct each.",
          
          "step_by_step": [
            {
              "step": "Error 1",
              "explanation": "Missing $MR$ curve. Monopoly graphs must include marginal revenue, which lies below demand. Correction: Draw $MR$ starting at same intercept as demand but twice as steep."
            },
            {
              "step": "Error 2",
              "explanation": "$MC$ curve drawn as downward-sloping. $MC$ should be U-shaped (falling then rising) due to diminishing returns. Correction: Draw U-shaped $MC$."
            },
            {
              "step": "Error 3",
              "explanation": "No $ATC$ curve. To show profit or loss, $ATC$ is needed. Correction: Draw U-shaped $ATC$ above $MC$ at low quantities, intersecting $MC$ at $ATC$'s minimum."
            },
            {
              "step": "Error 4",
              "explanation": "Profit-maximizing quantity shown at $P = MC$. Should be at $MR = MC$. Correction: Find where $MR$ would intersect $MC$, label that $Q^*$."
            },
            {
              "step": "Error 5",
              "explanation": "Axes not labeled. Every graph needs labeled axes. Correction: Label vertical axis \"Price, Cost\" and horizontal axis \"Quantity\"."
            },
            {
              "step": "Error 6",
              "explanation": "No deadweight loss shown. Monopoly creates deadweight loss. Correction: Find where $P = MC$ (competitive outcome), shade triangle between demand and $MC$ from $Q^*$ to $Q_c$."
            }
          ],
          
          "final_answer": "Errors: missing $MR$, wrong $MC$ shape, missing $ATC$, wrong $Q^*$, unlabeled axes, missing $DWL$. Corrections as described.",
          "concept_applied": "Graphs must include all required elements and have correct shapes."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Potential Pitfall",
          "description": "Recognize when a question might test a common mistake.",
          "mechanism": "Look for keywords, familiar scenarios, or concepts that students often confuse.",
          "result": "Awareness of trap.",
          
          "image": {
            "src": "images/unit12/mistake_step1.png",
            "alt": "Identifying potential pitfall",
            "caption": "Figure 12.3.15: Step 1 - Recognize potential pitfalls."
          }
        },
        {
          "step": 2,
          "process": "Recall Correct Concept",
          "description": "Retrieve the correct economic principle.",
          "mechanism": "Mentally review definitions, relationships, or formulas.",
          "result": "Correct understanding.",
          
          "image": {
            "src": "images/unit12/mistake_step2.png",
            "alt": "Recalling correct concept",
            "caption": "Figure 12.3.16: Step 2 - Recall the correct concept."
          }
        },
        {
          "step": 3,
          "process": "Check Against Common Errors",
          "description": "Compare your thinking to common mistakes.",
          "mechanism": "Ask: Am I falling for any of the typical traps?",
          "result": "Error check.",
          
          "image": {
            "src": "images/unit12/mistake_step3.png",
            "alt": "Checking against common errors",
            "caption": "Figure 12.3.17: Step 3 - Check against common mistakes."
          }
        },
        {
          "step": 4,
          "process": "Apply Correctly",
          "description": "Proceed with the correct analysis.",
          "mechanism": "Use correct formulas, draw correct graphs, apply correct logic.",
          "result": "Correct answer.",
          
          "image": {
            "src": "images/unit12/mistake_step4.png",
            "alt": "Applying correctly",
            "caption": "Figure 12.3.18: Step 4 - Apply the correct concept."
          }
        },
        {
          "step": 5,
          "process": "Review Answer",
          "description": "Double-check that you haven't made an obvious error.",
          "mechanism": "Quick mental review: Does this make sense? Does it match economic intuition?",
          "result": "Final confidence.",
          
          "image": {
            "src": "images/unit12/mistake_step5.png",
            "alt": "Reviewing answer",
            "caption": "Figure 12.3.19: Step 5 - Review your answer."
          }
        }
      ],

      "image": {
        "src": "images/unit12/mistakes_summary.png",
        "alt": "Summary of common mistakes and how to avoid them",
        "caption": "Figure 12.3.20: Common mistakes and misconceptions summary."
      }
    }
  ],

  "key_terms": [
    "Graph errors",
    "Labeling",
    "Curve shapes",
    "Movement vs. shift",
    "Normal goods",
    "Inferior goods",
    "Substitutes",
    "Complements",
    "Short run",
    "Long run",
    "Economic profit",
    "Accounting profit",
    "Normal profit",
    "Midpoint formula",
    "Price elasticity",
    "Marginal revenue product",
    "Consumer surplus",
    "Producer surplus",
    "Tax incidence",
    "Statutory incidence",
    "Economic incidence",
    "Price ceiling",
    "Price floor",
    "Shortage",
    "Surplus",
    "Deadweight loss",
    "Allocative efficiency",
    "Productive efficiency",
    "Explicit costs",
    "Implicit costs"
  ],

  "summary": "Common mistakes on the AP Microeconomics exam fall into six categories: graph errors, concept confusion, calculation errors, definition errors, application errors, and reading errors. Graph errors include unlabeled axes, incorrect curve shapes, missing curves, and missing equilibrium points. Concept confusion includes mixing up normal vs. inferior goods, substitutes vs. complements, movement vs. shift, short run vs. long run, and economic vs. accounting profit. Calculation errors include misusing the midpoint formula, incorrect $MRP$ calculations, and arithmetic mistakes. Definition errors include misunderstanding key terms like normal profit, consumer surplus, and allocative efficiency. Application errors include mispredicting the effects of price controls, taxes, and policies. Reading errors include missing words like \"except\" and answering the wrong question. To avoid these mistakes: (1) Use a mental checklist for graphs. (2) Read questions twice, circling key words. (3) Show your work for calculations. (4) Test your understanding by explaining concepts out loud. (5) Practice identifying common pitfalls. Knowing these mistakes in advance helps you avoid them and earn points that other students miss."
}
