{
  "unit_title": "Frequency and Period: Temporal Wave Characteristics",
  "unit_number": "Unit 6.7",
  "grade_level": "Grade 10",
  "subject": "Physics",
  "expanded_description": "Master frequency as oscillations per second and period as time per oscillation. Understand their reciprocal relationship, measurement techniques, and applications from musical pitch to communication systems and quantum phenomena.",
  "core_concept": {
    "principle": "Frequency (f) measures oscillations per second (Hz), while period (T) measures seconds per oscillation, with the fundamental relationship $f = \\frac{1}{T}$ connecting these complementary temporal descriptions of wave motion.",
    "explanation": "This reciprocal relationship allows conversion between counting oscillations in time and measuring time per oscillation, providing complete temporal characterization of wave behavior.",
    "image": {
      "url": "images/grade-10-frequency-period-core.png",
      "alt": "Wave diagram showing one complete cycle with period T and frequency f = 1/T",
      "caption": "Period (T) is the time for one complete oscillation cycle. Frequency (f) is the number of cycles per second. They are reciprocals: $f = \\frac{1}{T}$."
    }
  },
  "sections": [
    {
      "section_title": "1. Fundamental Frequency and Period Concepts",
      "introduction": "Frequency and period provide complementary temporal descriptions of wave motion, with frequency counting oscillations per unit time and period measuring the time for each oscillation. Understanding these fundamental concepts enables complete characterization of wave behavior in time and explains phenomena from musical pitch to atomic transitions.",
      "key_concept": {
        "definition": "Frequency is the number of complete oscillation cycles per unit time, measured in Hertz (Hz), while period is the time duration of one complete cycle, measured in seconds, with the mathematical relationship $f = \\frac{1}{T}$.",
        "context": "These temporal properties determine wave perception (pitch for sound, color for light) and govern resonance conditions across physical systems."
      },
      "principles": [
        {
          "principle": "Reciprocal Relationship Principle",
          "statement": "Frequency and period are mathematical reciprocals - doubling frequency halves the period, and vice versa, maintaining the relationship $f = \\frac{1}{T}$",
          "application": "This enables easy conversion between counting oscillations in time and measuring time per oscillation for different measurement and analysis purposes",
          "example": "A wave with frequency 50 Hz has period 0.02 seconds; doubling to 100 Hz gives period 0.01 seconds - half the time per oscillation",
          "analogy": "Like measuring speed - you can measure km per hour or hours per km, with each being the reciprocal of the other"
        },
        {
          "principle": "Source Determination Principle",
          "statement": "Wave frequency is determined by the source that creates the wave and remains constant as the wave propagates through different media",
          "application": "This explains why light color doesn't change when entering different materials, and why musical pitch remains constant when sound travels through different gases",
          "example": "A 440 Hz tuning fork produces sound waves that remain 440 Hz whether traveling through air, water, or steel, even though speed and wavelength change",
          "analogy": "Like the rhythm of a drummer - the beat frequency stays the same regardless of how fast the sound travels to different listeners"
        },
        {
          "principle": "Perceptual Quality Determination",
          "statement": "Frequency determines perceived qualities of waves - pitch for sound, color for light, while period determines the timing and rhythm of wave phenomena",
          "application": "This enables musical instrument design, color reproduction systems, and timing-based technologies from clocks to digital communications",
          "example": "Higher frequency sounds are perceived as higher pitches, while higher frequency light is perceived as bluer colors, with human ranges of 20 Hz-20 kHz for hearing and 430-750 THz for vision",
          "analogy": "Like the difference between how fast a fan blades spin (frequency) and how long each revolution takes (period) - one determines the blurring effect, the other the timing between blade passages"
        }
      ],
      "categories": [
        {
          "type": "Frequency and Period Contexts",
          "description": "Different interpretations and measurement approaches for frequency and period",
          "examples": [
            {
              "process": "Cyclic Frequency (f)",
              "explanation": "Oscillations per second, measured in Hertz (Hz) - the most common frequency measurement for waves and vibrations"
            },
            {
              "process": "Angular Frequency (ω)", 
              "explanation": "Radians per second, related to cyclic frequency by $ω = 2πf$ - used in mathematical analysis and rotational systems"
            },
            {
              "process": "Period (T)",
              "explanation": "Seconds per oscillation, the time for one complete cycle - useful for timing applications and wave synchronization"
            },
            {
              "process": "Temporal Frequency",
              "explanation": "General term for oscillations per unit time, as opposed to spatial frequency (wave number) which measures oscillations per unit distance"
            },
            {
              "process": "Fundamental vs Harmonic Frequencies",
              "explanation": "Fundamental frequency is the lowest frequency of a complex wave; harmonics are integer multiples that create the wave's timbre or color"
            }
          ]
        }
      ]
    },
    {
      "section_title": "2. Mathematical Relationships and Calculations",
      "introduction": "The mathematical framework connecting frequency, period, wavelength, and wave speed provides powerful tools for wave analysis and prediction. Understanding these relationships enables calculation of unknown wave parameters and explains how waves behave in different media and contexts.",
      "key_concept": {
        "definition": "The complete wave description connects frequency and period through $f = \\frac{1}{T}$, relates them to wavelength and speed through $v = f\\lambda$, and connects to angular frequency through $\\omega = 2\\pi f = \\frac{2\\pi}{T}$.",
        "context": "This mathematical framework unifies temporal and spatial wave descriptions and applies universally across mechanical and electromagnetic waves."
      },
      "image": {
        "url": "images/grade-10-frequency-calculations.png",
        "alt": "Mathematical relationships between frequency, period, wavelength, and wave speed",
        "caption": "Complete wave relationships: $f = \\frac{1}{T}$, $v = f\\lambda$, $\\omega = 2\\pi f$. Frequency remains constant across media while speed and wavelength change proportionally."
      },
      "classifications": [
        {
          "type": "Frequency-Period Calculations",
          "value": "Mathematical operations involving frequency and period relationships",
          "characteristics": ["Reciprocal operations", "Unit conversions", "Wave equation applications", "Harmonic relationships"],
          "behavior": "Different calculation scenarios use the fundamental relationships to solve for unknown parameters, convert between units, and analyze complex wave systems",
          "examples": [
            {
              "process": "Basic Frequency-Period Conversions",
              "explanation": "Direct reciprocal calculations: f = 1/T, T = 1/f. Example: f = 60 Hz → T = 1/60 = 0.01667 s. T = 2 ms = 0.002 s → f = 1/0.002 = 500 Hz. For angular frequency: ω = 2πf = 2π/T. Example: f = 50 Hz → ω = 2π(50) = 314 rad/s. These basic conversions are fundamental to wave analysis, allowing easy switching between counting oscillations per second and measuring time per oscillation depending on which is more convenient for a particular application."
            },
            {
              "process": "Wave Equation Applications",
              "explanation": "Using v = fλ with frequency or period: f = v/λ, T = λ/v. Example: Sound in air (v = 343 m/s) with λ = 0.5 m: f = 343/0.5 = 686 Hz, T = 0.5/343 = 0.00146 s. Light (c = 3×10⁸ m/s) with λ = 600 nm = 6×10⁻⁷ m: f = 3×10⁸/6×10⁻⁷ = 5×10¹⁴ Hz, T = 2×10⁻¹⁵ s. These calculations demonstrate the enormous frequency range in nature - from seismic waves with periods of minutes to gamma rays with periods of attoseconds."
            },
            {
              "process": "Harmonic Frequency Calculations",
              "explanation": "For systems with harmonics: f_n = nf₁, where f₁ is fundamental frequency. String fixed at both ends: f_n = nv/2L. Air column open at both ends: f_n = nv/2L. Air column closed at one end: f_n = nv/4L (n odd only). Example: Guitar string L = 0.65 m, v = 400 m/s: f₁ = 400/(2×0.65) = 308 Hz, f₂ = 616 Hz, f₃ = 924 Hz, etc. These harmonic relationships create the characteristic timbres of musical instruments and enable frequency multiplication in electronic systems."
            },
            {
              "process": "Beat Frequency Calculations",
              "explanation": "When two waves of similar frequency interfere: f_beat = |f₁ - f₂|. Example: Tuning forks at 440 Hz and 442 Hz produce beats at 2 Hz - two loudness pulsations per second. Musical instruments tune by minimizing beat frequency. Radar speed guns use beat frequency between transmitted and reflected waves: f_beat = 2vf/c for target speed v. Ultrasound Doppler measurements use beat frequency to measure blood flow. These applications demonstrate how small frequency differences create measurable beat phenomena useful for measurement and tuning."
            }
          ]
        }
      ],
      "process_flow": [
        {
          "step": 1,
          "process": "Parameter Identification",
          "description": "Identify known and unknown frequency/period related parameters",
          "mechanism": "List given values of f, T, v, λ, or ω; determine which relationships apply to the problem",
          "result": "Clear understanding of known quantities and required calculations",
          "applications": ["Problem analysis", "Experimental design", "System specification"]
        },
        {
          "step": 2,
          "process": "Relationship Selection",
          "description": "Choose appropriate mathematical relationships based on knowns and unknowns",
          "mechanism": "Select from f = 1/T, v = fλ, ω = 2πf, or harmonic relationships f_n = nf₁ as needed",
          "result": "Correct mathematical approach for the specific calculation",
          "applications": ["Equation application", "Calculation planning", "Method selection"]
        },
        {
          "step": 3,
          "process": "Calculation Execution",
          "description": "Perform mathematical operations with proper units and significant figures",
          "mechanism": "Apply reciprocal operations, multiplication/division, unit conversions, and algebraic manipulation",
          "result": "Numerical solution for unknown parameters",
          "applications": ["Parameter calculation", "Design values", "Performance prediction"]
        },
        {
          "step": 4,
          "process": "Result Interpretation",
          "description": "Analyze calculated frequencies/periods in physical context",
          "mechanism": "Compare to human perception ranges, system capabilities, or physical constraints; verify reasonableness",
          "result": "Physically meaningful interpretation of mathematical results",
          "applications": ["Practical application", "System verification", "Performance assessment"]
        }
      ]
    },
    {
      "section_title": "3. Frequency Ranges and Natural Phenomena",
      "introduction": "Frequency spans an enormous range across natural phenomena and technological applications, from the slow oscillations of planetary motions to the rapid vibrations of atomic nuclei. Understanding these frequency ranges reveals the unity of wave phenomena across scales and enables targeted applications in specific frequency bands.",
      "key_concept": {
        "definition": "Natural and technological phenomena occupy specific frequency ranges determined by physical scales and mechanisms, with characteristic behaviors and applications unique to each frequency domain across the spectrum from infrasound to gamma rays.",
        "context": "This frequency classification organizes wave phenomena by temporal scale and enables efficient technology design for specific frequency applications."
      },
      "categories": [
        {
          "type": "Mechanical Wave Frequency Ranges",
          "description": "Frequency domains for sound, vibration, and seismic phenomena",
          "detailed_mechanism": "Different frequency ranges in mechanical waves correspond to different generation mechanisms, propagation characteristics, and detection methods",
          "examples": [
            {
              "process": "Infrasound (f < 20 Hz)",
              "explanation": "Frequencies below human hearing, generated by large-scale phenomena. Natural sources: earthquakes (0.01-10 Hz), volcanic eruptions, severe weather, ocean waves (0.05-0.1 Hz). Animal communication: elephants (14-35 Hz), whales (10-30 Hz). Propagation: very low attenuation, travels thousands of kilometers. Applications: nuclear test monitoring, tsunami warning, atmospheric research. Detection: specialized microphones and pressure sensors. The 2013 Chelyabinsk meteor generated 0.01-10 Hz infrasound detected globally, demonstrating long-range propagation."
            },
            {
              "process": "Audible Sound (20 Hz - 20 kHz)",
              "explanation": "Human hearing range with pitch perception. Speech: 85-255 Hz (fundamental), 100 Hz-8 kHz (harmonics and consonants). Music: piano 27.5-4186 Hz, violin 196-3136 Hz. Perception: logarithmic frequency scale - octaves double frequency. Equal temperament: 12√2 frequency ratio between semitones. A₄ = 440 Hz standard pitch. Applications: audio engineering, communication, music, sonar. Hearing damage risk above 85 dB exposure. Most sensitive around 1-4 kHz where speech intelligibility occurs."
            },
            {
              "process": "Ultrasound (f > 20 kHz)",
              "explanation": "Frequencies above human hearing. Medical imaging: 2-18 MHz for various depths and resolutions. Industrial testing: 50 kHz-10 MHz for flaw detection. Animal use: bats (20-200 kHz), dolphins (75-150 kHz), moths (up to 240 kHz). Propagation: shorter wavelengths provide better resolution but more attenuation. Applications: medical diagnostics, non-destructive testing, cleaning, ranging. High-intensity ultrasound: surgical cutting, lithotripsy (kidney stone breaking). Frequencies chosen based on trade-off between resolution and penetration depth."
            },
            {
              "process": "Seismic Frequencies",
              "explanation": "Earth vibration frequencies from 0.001 Hz to 50 Hz. Surface waves: 0.01-0.1 Hz (long-period), travel long distances. Body waves: 0.1-10 Hz, used for earthquake location. High-frequency: 10-50 Hz, attenuate rapidly, indicate near-source motion. Building resonance: 0.5-5 Hz for typical structures. Applications: earthquake engineering, oil exploration, Earth structure studies. The 2011 Tohoku earthquake had dominant periods of 3-5 minutes (0.003-0.006 Hz) for the slow slip component."
            }
          ]
        },
        {
          "type": "Electromagnetic Frequency Ranges",
          "description": "Frequency domains across the electromagnetic spectrum",
          "examples": [
            {
              "process": "Radio Waves (3 Hz - 300 GHz)",
              "explanation": "Lowest frequency EM waves. ELF (3-30 Hz): submarine communication. VLF (3-30 kHz): navigation, time signals. AM radio (535-1605 kHz): amplitude modulation. FM radio (88-108 MHz): frequency modulation. TV (54-806 MHz): video broadcasting. Microwave (300 MHz-300 GHz): radar, satellite, Wi-Fi. Applications: broadcasting, communication, radar, medical diathermy. Propagation characteristics change dramatically with frequency - ground waves at low frequencies, line-of-sight at high frequencies."
            },
            {
              "process": "Infrared (300 GHz - 430 THz)",
              "explanation": "Thermal radiation frequencies. Far-IR (300 GHz-20 THz): molecular rotation spectra. Mid-IR (20-120 THz): molecular vibration spectra. Near-IR (120-430 THz): electronic transitions, fiber optics. Blackbody radiation: room temperature peaks at 30 THz (10 μm). Applications: thermal imaging, remote temperature sensing, spectroscopy, night vision. Earth's heat radiation to space: 20-60 THz, crucial for climate balance. CO₂ absorption at 20.0, 20.8, 21.7 THz creates greenhouse effect."
            },
            {
              "process": "Visible Light (430-750 THz)",
              "explanation": "Human vision range. Violet: 430-480 THz, Blue: 480-510 THz, Green: 510-600 THz, Yellow: 600-630 THz, Orange: 630-680 THz, Red: 680-750 THz. Photopic vision peak: 555 THz (540 nm). Scotopic vision peak: 590 THz (507 nm). Applications: vision, photography, displays, solar power. Color perception uses three cone types with different frequency sensitivities. Sunlight peak: 540 THz matching human vision peak efficiency."
            },
            {
              "process": "Ultraviolet to Gamma Rays (750 THz - 300 EHz)",
              "explanation": "High-frequency EM radiation. UV-A: 750-950 THz, UV-B: 950-1100 THz, UV-C: 1100-3000 THz. X-rays: 30 PHz-30 EHz, gamma rays: >30 EHz. Generation: electron transitions (UV), electron deceleration (X-rays), nuclear transitions (gamma). Applications: sterilization, medical imaging, cancer treatment, materials analysis. Penetration increases with frequency but biological damage also increases. Atmosphere blocks most UV-C, X-rays, and gamma rays, protecting life."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Frequency Scaling Law",
          "statement": "The frequency of natural oscillations typically scales inversely with the physical size of the system, with larger systems oscillating slower and smaller systems oscillating faster",
          "application": "This enables estimation of system frequencies from physical dimensions and explains why atomic vibrations are much faster than building vibrations",
          "example": "A pendulum period scales with √(L/g) - longer pendulums swing slower. A string fundamental frequency scales with 1/L - longer strings produce lower pitches",
          "analogy": "Like animals - elephants take slow, deliberate steps while hummingbirds beat their wings rapidly, with smaller creatures generally moving at higher frequencies"
        },
        {
          "principle": "Frequency Band Optimization",
          "statement": "Different applications operate in specific frequency bands optimized for propagation characteristics, information capacity, safety, and technological feasibility",
          "application": "This drives frequency allocation for communications, selection of medical imaging modalities, and design of sensing systems for specific purposes",
          "example": "Wi-Fi uses 2.4 GHz and 5 GHz bands that balance building penetration and data capacity, while medical MRI uses 64-300 MHz that safely penetrate tissue and provide nuclear resonance",
          "analogy": "Like using different vehicle types - bicycles for short trips, cars for medium distances, planes for long journeys, each optimized for different scales"
        },
        {
          "principle": "Frequency Conservation",
          "statement": "Wave frequency remains constant during propagation through different media and during reflections, while speed and wavelength may change",
          "application": "This enables frequency-based identification of sources and explains why color perception is stable despite light traveling through different materials",
          "example": "A 1000 Hz sound remains 1000 Hz when reflecting from walls or traveling from air to water, and blue light remains blue when refracting through glass or reflecting from mirrors",
          "analogy": "Like a person's voice - it keeps the same pitch whether speaking in a small room or large hall, even though the sound travels differently"
        }
      ]
    },
    {
      "section_title": "4. Measurement Techniques and Technological Applications",
      "introduction": "Frequency measurement enables characterization of wave sources, system tuning, and precise timing across science and technology. Applications ranging from musical instruments to atomic clocks to medical diagnostics all rely on accurate frequency determination and control.",
      "key_concept": {
        "definition": "Frequency measurement employs counting, comparison, resonance, and interference techniques, with applications spanning timekeeping, communications, medical imaging, and scientific research that exploit specific frequency properties.",
        "context": "The ability to measure and control frequency enables technologies from global positioning systems to magnetic resonance imaging to digital communications."
      },
      "process_flow": [
        {
          "step": 1,
          "process": "Measurement Method Selection",
          "description": "Choose appropriate frequency measurement technique based on wave type, frequency range, and precision requirements",
          "mechanism": "Select from counting methods, comparison techniques, resonance approaches, or spectral analysis depending on application needs",
          "result": "Appropriate measurement strategy for the specific frequency measurement task",
          "organization": "Methodology optimization"
        },
        {
          "step": 2,
          "process": "Instrument Configuration",
          "description": "Set up measurement apparatus with proper calibration and signal conditioning",
          "mechanism": "Configure frequency counters, oscilloscopes, spectrum analyzers, or resonance detectors with appropriate input conditioning and reference standards",
          "result": "Calibrated measurement system ready for frequency determination",
          "organization": "Experimental setup implementation"
        },
        {
          "step": 3,
          "process": "Frequency Determination",
          "description": "Measure oscillation rate using selected method and calculate frequency",
          "mechanism": "Count cycles in known time, measure period and take reciprocal, identify resonance peaks, or analyze spectral content",
          "result": "Quantitative frequency measurement with uncertainty analysis",
          "organization": "Systematic data acquisition and analysis"
        },
        {
          "step": 4,
          "process": "Application Implementation",
          "description": "Use measured or controlled frequencies for specific technological purposes",
          "mechanism": "Apply frequency information to communication systems, timing devices, medical treatments, or scientific measurements",
          "result": "Functional applications based on precise frequency control or measurement",
          "organization": "Technology deployment and operation"
        }
      ],
      "classifications": [
        {
          "type": "Frequency Measurement Techniques",
          "value": "Methods for determining frequency across different ranges and applications",
          "characteristics": ["Direct counting", "Period measurement", "Comparison methods", "Spectral analysis"],
          "behavior": "Different measurement approaches provide various trade-offs between precision, speed, frequency range, and complexity for diverse application requirements",
          "examples": [
            {
              "process": "Frequency Counting Methods",
              "explanation": "Direct cycle counting in precise time intervals. Frequency counters gate input signal for exactly 1 second (or 0.1s, 10s for better resolution), count cycles, display frequency. Accuracy depends on timebase stability - crystal oscillators provide 1-100 ppm accuracy. Reciprocal counters measure period and compute frequency for better low-frequency accuracy. Applications: oscillator testing, musical instrument tuning, rotational speed measurement. Modern counters achieve 12-digit resolution, essential for metrology and fundamental constant measurements."
            },
            {
              "process": "Oscilloscope Period Measurement",
              "explanation": "Measure period on oscilloscope display and calculate f = 1/T. Timebase accuracy typically 1-3%. Cursors provide precise time measurements. Lissajous figures compare unknown frequency to known reference by creating patterns from X and Y inputs. Applications: electronic circuit debugging, waveform analysis, educational demonstrations. Modern digital oscilloscopes include automatic frequency measurement with FFT analysis for complex waveforms. Essential for verifying digital clock frequencies and analyzing signal integrity in electronic systems."
            },
            {
              "process": "Heterodyne and Comparison Methods",
              "explanation": "Mix unknown frequency with known reference, measure difference (beat) frequency. Superheterodyne receivers convert RF signals to fixed IF for amplification and filtering. Phase-locked loops lock to input frequency, providing precise tracking. Frequency synthesizers generate multiple frequencies from single reference. Applications: radio receivers, frequency standards, communications systems. These methods enable precise frequency measurement and generation across wide ranges using stable reference oscillators as benchmarks."
            },
            {
              "process": "Spectral Analysis Techniques",
              "explanation": "Fourier transform decomposes complex signals into frequency components. Spectrum analyzers display amplitude vs frequency. FFT algorithms compute digital frequency spectra. Applications: vibration analysis, audio engineering, electromagnetic compatibility testing. Modern analyzers cover DC to 110 GHz with microhertz resolution. Used for identifying resonant frequencies in structures, analyzing musical timbres, detecting interference in communications, and characterizing noise sources across engineering disciplines."
            }
          ]
        },
        {
          "type": "Frequency-Based Technologies",
          "value": "Systems that exploit specific frequency properties for practical applications",
          "characteristics": ["Resonance utilization", "Spectral selection", "Timing applications", "Communication systems"],
          "behavior": "These technologies use frequency-specific phenomena for timekeeping, communication, sensing, and treatment by operating at optimized frequencies for each application domain",
          "examples": [
            {
              "process": "Time and Frequency Standards",
              "explanation": "Atomic clocks use hyperfine transitions: cesium-133 (9,192,631,770 Hz), hydrogen maser (1,420,405,752 Hz). Crystal oscillators (1-100 MHz) provide stable references. GPS satellites carry atomic clocks for precise positioning. Network time protocol synchronizes computer clocks. Applications: telecommunications, navigation, scientific research, financial transactions. The cesium frequency defines the second in SI units. Modern optical lattice clocks using strontium (429,228,004,229,952 Hz) achieve 10⁻¹⁸ accuracy, enabling tests of fundamental physics."
            },
            {
              "process": "Communication Systems",
              "explanation": "Radio communications use specific frequency bands: AM (535-1605 kHz), FM (88-108 MHz), TV (54-806 MHz), cellular (700 MHz-2.5 GHz). Frequency division multiplexing separates channels by frequency. Spread spectrum uses frequency hopping. Software-defined radios process signals digitally. Applications: broadcasting, mobile phones, Wi-Fi, satellite communications. Frequency allocation is managed internationally to prevent interference. Different frequencies offer trade-offs between coverage area, data capacity, and building penetration for various communication needs."
            },
            {
              "process": "Medical Imaging and Treatment",
              "explanation": "MRI uses radio frequencies (64-300 MHz) that match nuclear spin precession in magnetic fields. Ultrasound imaging: 2-18 MHz for various depths. RF ablation: 450-500 kHz for tissue heating. Diathermy: 27 MHz for deep heating. Lithotripsy: shock waves with 0.5-2 MHz frequency content. Applications: diagnostic imaging, cancer treatment, physical therapy. Frequencies chosen for specific tissue interactions - penetration depth, absorption characteristics, and safety considerations determine optimal frequencies for each medical application."
            },
            {
              "process": "Musical and Audio Systems",
              "explanation": "Equal temperament tuning: A₄ = 440 Hz standard. Digital audio: CD quality 44.1 kHz sampling, 20 Hz-20 kHz bandwidth. Electronic tuners detect fundamental frequencies. Pitch correction software modifies frequencies. Applications: music performance, recording, broadcasting, instrument manufacturing. The human auditory system analyzes complex sounds by separating frequency components. Audio compression algorithms (MP3, AAC) exploit frequency masking effects where loud sounds at one frequency hide quiet sounds at nearby frequencies."
            }
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Frequency",
    "Period", 
    "Hertz (Hz)",
    "$f = \\frac{1}{T}$",
    "Oscillations per second",
    "Angular frequency",
    "$\\omega = 2\\pi f$",
    "Wave equation",
    "$v = f\\lambda$",
    "Fundamental frequency",
    "Harmonics",
    "Beat frequency",
    "Resonance",
    "Pitch",
    "Color",
    "Frequency spectrum",
    "Bandwidth",
    "Sampling frequency",
    "Carrier frequency",
    "Natural frequency"
  ],
  "summary": "Frequency (f) measures oscillations per second in Hertz (Hz), while period (T) measures seconds per oscillation, connected by the fundamental relationship $f = \\frac{1}{T}$. These temporal properties determine wave perception (pitch for sound, color for light) and are conserved during wave propagation through different media. Frequency ranges span from infrasound (<20 Hz) to gamma rays (>30 EHz), with different natural phenomena and technologies optimized for specific frequency bands. Measurement techniques include direct counting, period measurement, heterodyne methods, and spectral analysis. Applications exploit frequency properties for timekeeping (atomic clocks at precise frequencies), communications (radio bands from kHz to GHz), medical imaging (MRI at 64-300 MHz, ultrasound at 2-18 MHz), and music (A₄ = 440 Hz standard). Understanding frequency and period enables prediction of wave behavior, design of resonant systems, and development of technologies that depend on precise temporal control across science, engineering, and daily life."
}
