{
  "unit_title": "Introduction to Waves: Energy Transfer Through Oscillations",
  "unit_number": "Unit 6.1",
  "grade_level": "Grade 10",
  "subject": "Physics",
  "expanded_description": "Explore the fundamental nature of waves as mechanisms for energy transfer without mass transport. Learn to classify waves, understand their basic properties, and recognize their importance in natural phenomena and technological applications.",
  "core_concept": {
    "principle": "A wave is a disturbance that travels through space and time, transferring energy from one point to another without permanent displacement of the medium.",
    "explanation": "Waves propagate energy through oscillations or vibrations, creating characteristic patterns that can be described mathematically and observed in countless physical systems.",
    "image": {
      "url": "images/grade-10-wave-basics-core.png",
      "alt": "Wave diagram showing crest, trough, wavelength, and amplitude",
      "caption": "Basic wave parameters: Amplitude measures energy, wavelength measures spatial period, and frequency measures temporal oscillation rate."
    }
  },
  "sections": [
    {
      "section_title": "1. Fundamental Wave Concepts and Definitions",
      "introduction": "Waves represent one of nature's most fundamental mechanisms for energy transfer, appearing in contexts ranging from ocean surfaces to electromagnetic radiation. Understanding wave basics provides the foundation for analyzing diverse physical phenomena.",
      "key_concept": {
        "definition": "A wave is a propagating dynamic disturbance that transfers energy through a medium or field, characterized by oscillations about equilibrium positions.",
        "context": "This definition encompasses both mechanical waves requiring a medium and electromagnetic waves that propagate through vacuum."
      },
      "principles": [
        {
          "principle": "Energy Transfer Principle",
          "statement": "Waves transfer energy without transferring matter - the medium particles oscillate about fixed positions while energy moves forward",
          "application": "This explains how sound reaches our ears without air traveling from the source, and how light carries energy across empty space",
          "example": "Ocean waves transfer energy toward shore while water molecules move in circular orbits, returning nearly to their original positions",
          "analogy": "Like spectators doing 'the wave' in a stadium - people stand up and sit down (oscillate) while the wave pattern moves around the stadium"
        },
        {
          "principle": "Disturbance Propagation",
          "statement": "Waves represent the propagation of a disturbance from its source, with the wavefront moving at characteristic speed",
          "application": "This principle allows prediction of when wave effects will reach distant points and how they will interact with obstacles",
          "example": "A pebble dropped in water creates ripples that expand outward at constant speed, with the disturbance diminishing with distance",
          "analogy": "Like rumors spreading through a crowd - the information moves while individuals stay in place"
        },
        {
          "principle": "Superposition Principle",
          "statement": "When multiple waves meet, the net displacement equals the sum of individual displacements at each point",
          "application": "This enables interference patterns, standing waves, and complex wave behavior analysis",
          "example": "Two overlapping water waves create regions of enhanced amplitude (constructive interference) and reduced amplitude (destructive interference)",
          "analogy": "Like multiple conversations in a room - sound waves add together, sometimes making it harder to hear individual speakers"
        }
      ],
      "categories": [
        {
          "type": "Wave Definition Components",
          "description": "Essential elements that define and characterize all waves",
          "examples": [
            {
              "process": "Medium Requirement",
              "explanation": "Mechanical waves require a physical medium (solid, liquid, gas) while electromagnetic waves can propagate through vacuum"
            },
            {
              "process": "Disturbance Nature",
              "explanation": "The specific physical quantity that oscillates: displacement for mechanical waves, electric and magnetic fields for EM waves"
            },
            {
              "process": "Propagation Mechanism",
              "explanation": "How the disturbance moves: through particle interactions in mechanical waves, through field oscillations in EM waves"
            },
            {
              "process": "Energy Transport",
              "explanation": "Kinetic and potential energy alternate as the wave propagates, with total energy conserved but redistributed"
            },
            {
              "process": "Wave Speed Determination",
              "explanation": "Mechanical wave speed depends on medium properties; EM wave speed is constant in vacuum ($c = 3\\times10^8$ m/s)"
            }
          ]
        }
      ]
    },
    {
      "section_title": "2. Classification of Waves",
      "introduction": "Waves can be categorized based on their propagation direction, medium requirements, and energy transfer mechanisms. Understanding these classifications helps predict wave behavior in different contexts.",
      "key_concept": {
        "definition": "Waves are systematically classified by the relationship between oscillation direction and propagation direction (transverse vs. longitudinal), by medium requirements (mechanical vs. electromagnetic), and by dimensionality of propagation.",
        "context": "This classification system provides a framework for understanding diverse wave phenomena across physics."
      },
      "image": {
        "url": "images/grade-10-wave-classification.png",
        "alt": "Diagrams comparing transverse and longitudinal waves",
        "caption": "Transverse waves oscillate perpendicular to propagation direction; longitudinal waves oscillate parallel to propagation direction."
      },
      "classifications": [
        {
          "type": "Transverse Waves",
          "value": "Waves where particle oscillation is perpendicular to propagation direction",
          "characteristics": ["Perpendicular oscillation", "Can exhibit polarization", "Characteristic of electromagnetic waves", "Show clear crests and troughs"],
          "behavior": "Particles move at right angles to energy flow, creating distinctive wave patterns with crests and troughs",
          "examples": [
            {
              "process": "Electromagnetic Waves",
              "explanation": "Light, radio waves, X-rays - oscillating electric and magnetic fields propagate through vacuum at speed of light ($3\\times10^8$ m/s). These waves can be polarized and exhibit both wave and particle properties. The electromagnetic spectrum ranges from radio waves (long wavelength, low frequency) to gamma rays (short wavelength, high frequency)."
            },
            {
              "process": "String Waves",
              "explanation": "Waves on a stretched string or rope - particles move up and down while wave pattern moves horizontally. Speed depends on tension and linear density: $v = \\sqrt{\\frac{T}{\\mu}}$. These waves demonstrate reflection at fixed ends (inversion) and free ends (no inversion)."
            },
            {
              "process": "Water Surface Waves",
              "explanation": "Ocean waves, ripples - water particles move in circular orbits while wave pattern advances. In deep water, speed depends on wavelength: $v = \\sqrt{\\frac{g\\lambda}{2\\pi}}$. These are actually combinations of transverse and longitudinal motion, with particle paths being elliptical in shallow water."
            },
            {
              "process": "Seismic S-Waves",
              "explanation": "Secondary waves in earthquakes - shear waves that move rock perpendicular to propagation direction. Cannot travel through liquids, which is how scientists determined Earth's liquid outer core. Speed in crustal rock is typically 2-4 km/s, slower than P-waves."
            }
          ]
        },
        {
          "type": "Longitudinal Waves",
          "value": "Waves where particle oscillation is parallel to propagation direction",
          "characteristics": ["Parallel oscillation", "Create compressions and rarefactions", "Cannot be polarized", "Travel well through all states of matter"],
          "behavior": "Particles oscillate back and forth in the direction of energy flow, creating regions of compression and rarefaction",
          "examples": [
            {
              "process": "Sound Waves",
              "explanation": "Pressure variations in gases, liquids, and solids - air molecules oscillate parallel to propagation direction. Speed depends on medium: ~343 m/s in air, ~1480 m/s in water, ~5000 m/s in steel. These are mechanical waves requiring a medium, with intensity decreasing with distance due to spreading and absorption."
            },
            {
              "process": "Seismic P-Waves",
              "explanation": "Primary waves in earthquakes - compression waves that are the fastest seismic waves. Can travel through solids, liquids, and gases. Speed increases with depth in Earth: 5-8 km/s in crust and mantle. These waves cause the initial jolt in earthquakes and are used to locate epicenters."
            },
            {
              "process": "Spring Waves",
              "explanation": "Compression waves along a slinky or spring - coils oscillate parallel to the spring's length. Clearly demonstrates compressions (close-spaced coils) and rarefactions (wide-spaced coils). Speed depends on spring tension and coil density. Excellent for visualizing longitudinal wave concepts."
            },
            {
              "process": "Ultrasound Waves",
              "explanation": "High-frequency sound waves used in medical imaging and industrial testing - longitudinal waves in the 1-15 MHz range. Can penetrate tissues and create detailed images from reflections. Speed variations in different tissues enable imaging of internal structures."
            }
          ]
        },
        {
          "type": "Surface Waves",
          "value": "Waves that occur at the interface between two different media",
          "characteristics": ["Interface phenomena", "Combined motion types", "Amplitude decreases with depth", "Complex particle motion"],
          "behavior": "Particles move in elliptical paths, combining transverse and longitudinal motion, with motion decreasing exponentially with depth",
          "examples": [
            {
              "process": "Ocean Surface Waves",
              "explanation": "Gravity waves at air-water interface - most familiar wave type with circular particle motion. Energy provided by wind, with wavelength determining wave behavior. In shallow water, waves slow down and wavelength decreases while height increases, eventually breaking. Tsunamis are extreme examples with very long wavelengths."
            },
            {
              "process": "Seismic Surface Waves",
              "explanation": "Love waves and Rayleigh waves - travel along Earth's surface and cause most earthquake damage. Love waves are transverse horizontal motion; Rayleigh waves combine vertical and horizontal motion in retrograde ellipses. These waves have larger amplitudes and longer durations than body waves, and their amplitude decreases slowly with distance."
            },
            {
              "process": "Capillary Waves",
              "explanation": "Small water waves dominated by surface tension - wavelength less than 1.7 cm. Restoring force is surface tension rather than gravity. Travel faster than gravity waves of same wavelength. Important in initial stage of wind wave generation and affect gas exchange at air-water interfaces."
            }
          ]
        },
        {
          "type": "Electromagnetic Waves",
          "value": "Waves consisting of oscillating electric and magnetic fields that propagate through vacuum",
          "characteristics": ["No medium required", "Transverse nature", "Constant speed in vacuum", "Dual wave-particle behavior"],
          "behavior": "Self-propagating waves with electric and magnetic fields oscillating perpendicular to each other and to direction of propagation",
          "examples": [
            {
              "process": "Radio Waves",
              "explanation": "Longest wavelength EM waves (1 mm to 100 km) - used for communication, broadcasting, and radar. Generated by accelerating electrons in antennas. Can be reflected by ionosphere for long-distance communication. Frequency range: 3 Hz to 300 GHz."
            },
            {
              "process": "Visible Light",
              "explanation": "Narrow band of EM spectrum (400-700 nm) detectable by human eye - different wavelengths perceived as different colors. Speed in materials is less than in vacuum: $v = c/n$ where n is refractive index. Exhibits reflection, refraction, diffraction, and interference phenomena."
            },
            {
              "process": "X-Rays",
              "explanation": "High-frequency EM waves (0.01-10 nm) - penetrate materials based on density and atomic number. Generated by electron deceleration or inner electron transitions. Used in medical imaging, security screening, and materials analysis. Can cause ionization and damage to biological tissues."
            },
            {
              "process": "Microwaves",
              "explanation": "Short-wavelength radio waves (1 mm to 1 m) - used for communication, radar, and cooking. Water, fats, and sugars absorb microwave energy efficiently, causing heating through molecular rotation. Microwave ovens use 2.45 GHz frequency, which is strongly absorbed by water molecules."
            }
          ]
        }
      ],
      "process_flow": [
        {
          "step": 1,
          "process": "Identify Oscillation Direction",
          "description": "Determine whether particle motion is perpendicular or parallel to energy flow",
          "mechanism": "Observe medium particle movement relative to wave propagation direction",
          "result": "Classification as transverse or longitudinal",
          "applications": ["Wave type identification", "Behavior prediction", "Medium requirement analysis"]
        },
        {
          "step": 2,
          "process": "Determine Medium Requirements",
          "description": "Establish whether the wave requires a physical medium for propagation",
          "mechanism": "Check if wave can travel through vacuum or requires material substance",
          "result": "Classification as mechanical or electromagnetic",
          "applications": ["Propagation environment analysis", "Speed calculation", "Application suitability"]
        },
        {
          "step": 3,
          "process": "Analyze Propagation Context",
          "description": "Examine whether wave occurs at interfaces or within bulk material",
          "mechanism": "Identify if wave is confined to boundaries between different media",
          "result": "Identification as surface wave or body wave",
          "applications": ["Boundary effect analysis", "Energy distribution understanding", "Practical application design"]
        },
        {
          "step": 4,
          "process": "Characterize Wave Parameters",
          "description": "Measure or calculate wavelength, frequency, amplitude, and speed",
          "mechanism": "Apply wave equations and measurement techniques to quantify properties",
          "result": "Complete wave description and classification",
          "applications": ["Quantitative analysis", "Wave behavior prediction", "Engineering applications"]
        }
      ]
    },
    {
      "section_title": "3. Fundamental Wave Properties and Characteristics",
      "introduction": "All waves share common properties that describe their behavior and energy content. Understanding these fundamental characteristics enables quantitative analysis and prediction of wave interactions.",
      "key_concept": {
        "definition": "Waves are characterized by measurable properties including amplitude (energy), wavelength (spatial period), frequency (temporal period), speed (propagation rate), and phase (position in cycle), related through the fundamental wave equation $v = f\\lambda$.",
        "context": "These universal properties apply to all wave types and provide the mathematical framework for wave analysis across physics."
      },
      "categories": [
        {
          "type": "Basic Wave Parameters",
          "description": "Essential measurable quantities that define any wave",
          "detailed_mechanism": "These parameters are interrelated through the wave equation and determine energy content and propagation behavior",
          "examples": [
            {
              "process": "Amplitude ($A$)",
              "explanation": "Maximum displacement from equilibrium position - determines wave energy and intensity. For a wave, energy is proportional to amplitude squared: $E \\propto A^2$. In sound waves, amplitude relates to loudness; in light waves, to brightness. Measured in meters for mechanical waves, volts/meter for electric field in EM waves. Larger amplitude means more energy transfer per unit time."
            },
            {
              "process": "Wavelength ($\\lambda$)",
              "explanation": "Distance between successive identical points on wave (crest-to-crest or trough-to-trough) - the spatial period of the wave. Determines how wave interacts with obstacles: diffraction significant when obstacle size comparable to wavelength. Measured in meters. Different wavelengths in light produce different colors; in sound, different pitches. Related to wave number: $k = \\frac{2\\pi}{\\lambda}$."
            },
            {
              "process": "Frequency ($f$) and Period ($T$)",
              "explanation": "Frequency: number of oscillations per second (Hz); Period: time for one complete oscillation (seconds). Related by $f = \\frac{1}{T}$. Human hearing: 20 Hz to 20,000 Hz; Visible light: $4.3\\times10^{14}$ Hz to $7.5\\times10^{14}$ Hz. Higher frequency means more energy per photon for EM waves. Determines temporal characteristics of wave phenomena."
            },
            {
              "process": "Wave Speed ($v$)",
              "explanation": "Speed at which wave pattern propagates through medium - related to frequency and wavelength by $v = f\\lambda$. For mechanical waves, depends on medium properties: $v = \\sqrt{\\frac{B}{\\rho}}$ for longitudinal waves in fluids (B=bulk modulus, ρ=density). For EM waves in vacuum: $c = 3\\times10^8$ m/s constant. In materials, speed decreases due to interactions with atoms."
            }
          ]
        },
        {
          "type": "Wave Relationships and Equations",
          "description": "Mathematical relationships connecting wave parameters",
          "examples": [
            {
              "process": "Fundamental Wave Equation",
              "explanation": "$v = f\\lambda$ - connects speed, frequency, and wavelength. If wave speed is constant (EM in vacuum), frequency and wavelength are inversely proportional. Example: Radio station at 101.5 MHz has wavelength $\\lambda = \\frac{c}{f} = \\frac{3\\times10^8}{101.5\\times10^6} = 2.96$ meters. If frequency doubles, wavelength halves for constant speed. This relationship allows calculation of any one parameter if the other two are known."
            },
            {
              "process": "Energy and Intensity",
              "explanation": "Wave energy proportional to amplitude squared: $E \\propto A^2$. Intensity (power per unit area) also proportional to amplitude squared: $I \\propto A^2$. For spherical waves, intensity decreases with distance squared: $I = \\frac{P}{4\\pi r^2}$. Example: If amplitude doubles, energy and intensity quadruple. This explains why loud sounds (large amplitude) can cause damage - they transfer much more energy to eardrums."
            },
            {
              "process": "Phase and Phase Difference",
              "explanation": "Phase describes position within wave cycle, measured in degrees or radians. Phase difference between two waves determines interference: same phase (0° difference) = constructive interference; opposite phase (180° difference) = destructive interference. Critical for understanding standing waves, beats, and interference patterns. Phase velocity is speed at which phase propagates: $v_p = \\frac{\\omega}{k}$."
            },
            {
              "process": "Wave Number and Angular Frequency",
              "explanation": "Wave number $k = \\frac{2\\pi}{\\lambda}$ (radians/meter) - spatial frequency. Angular frequency $\\omega = 2\\pi f$ (radians/second) - temporal frequency. Wave function: $y(x,t) = A\\sin(kx - \\omega t + \\phi)$. These simplify wave mathematics and are essential for quantum mechanics and advanced wave theory. Phase velocity: $v_p = \\frac{\\omega}{k} = \\frac{2\\pi f}{2\\pi/\\lambda} = f\\lambda = v$."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Wave Equation Universality",
          "statement": "The relationship $v = f\\lambda$ applies to all wave types, connecting propagation speed with temporal and spatial characteristics",
          "application": "This enables calculation of unknown wave parameters and prediction of behavior across different media",
          "example": "Knowing light frequency ($5\\times10^{14}$ Hz) and speed ($3\\times10^8$ m/s), calculate wavelength: $\\lambda = \\frac{v}{f} = 6\\times10^{-7}$ m = 600 nm (orange light)",
          "analogy": "Like calculating travel time: distance = speed × time, where wavelength is 'distance per cycle' and period is 'time per cycle'"
        },
        {
          "principle": "Energy-Amplitude Relationship",
          "statement": "Wave energy is proportional to the square of amplitude, making amplitude the primary determinant of energy transfer capability",
          "application": "This explains why small amplitude increases cause large energy increases and why wave intensity relates to amplitude squared",
          "example": "Doubling sound wave amplitude quadruples the energy reaching your eardrum, explaining the logarithmic nature of loudness perception",
          "analogy": "Like the damage from falling - kinetic energy depends on velocity squared, so small speed increases cause large energy increases"
        },
        {
          "principle": "Frequency Invariance",
          "statement": "Wave frequency remains constant when waves cross boundaries between different media, while wavelength and speed change",
          "application": "This allows tracking waves through multiple media and explains color constancy in light refraction",
          "example": "Light entering glass slows down and wavelength decreases, but frequency (color) remains unchanged",
          "analogy": "Like a marching band crossing from pavement to mud - marchers take shorter steps (wavelength decreases) and slow down, but step frequency (frequency) stays the same"
        }
      ]
    },
    {
      "section_title": "4. Importance and Applications of Waves",
      "introduction": "Wave phenomena underpin countless natural processes and technological applications. Understanding wave principles enables both comprehension of the natural world and development of advanced technologies.",
      "key_concept": {
        "definition": "Wave-based technologies and natural wave phenomena are essential to communication, energy transfer, sensing, medical applications, and fundamental scientific research, demonstrating the universal importance of wave principles.",
        "context": "From cellular communication to astronomical observations, wave principles enable technologies that define modern civilization."
      },
      "process_flow": [
        {
          "step": 1,
          "process": "Natural Wave Phenomenon Identification",
          "description": "Recognize wave-based processes in natural systems",
          "mechanism": "Observe oscillatory behavior, energy transfer patterns, and characteristic wave properties in natural contexts",
          "result": "Understanding of fundamental natural processes",
          "organization": "Systematic observation and classification"
        },
        {
          "step": 2,
          "process": "Wave Principle Application",
          "description": "Apply wave properties and behaviors to solve practical problems",
          "mechanism": "Utilize reflection, refraction, interference, diffraction, and other wave behaviors for specific applications",
          "result": "Development of wave-based technologies and solutions",
          "organization": "Engineering design and implementation"
        },
        {
          "step": 3,
          "process": "Technology Development",
          "description": "Create devices and systems that exploit wave properties",
          "mechanism": "Design transducers, antennas, lenses, and other components that generate, manipulate, or detect waves",
          "result": "Functional wave-based technologies",
          "organization": "Technical design and optimization"
        },
        {
          "step": 4,
          "process": "Impact Assessment",
          "description": "Evaluate the societal and scientific importance of wave applications",
          "mechanism": "Analyze benefits, limitations, and broader implications of wave technologies",
          "result": "Comprehensive understanding of wave importance",
          "organization": "Critical analysis and contextual understanding"
        }
      ],
      "classifications": [
        {
          "type": "Communication Technologies",
          "value": "Systems using waves to transmit information over distance",
          "characteristics": ["Information encoding", "Long-distance transmission", "Modulation techniques", "Signal processing"],
          "behavior": "Waves carry encoded information through various media, enabling rapid communication across global distances",
          "examples": [
            {
              "process": "Radio and Television Broadcasting",
              "explanation": "EM waves carry audio and video information through amplitude modulation (AM) or frequency modulation (FM). Radio waves (kHz-MHz range) travel long distances, reflected by ionosphere for beyond-line-of-sight communication. Television uses higher frequencies (VHF/UHF) with more bandwidth for video signals. Satellite communication uses microwave frequencies for global coverage. These technologies revolutionized information dissemination in the 20th century."
            },
            {
              "process": "Cellular Networks",
              "explanation": "Microwave frequencies (800 MHz-2.5 GHz) enable mobile communication through cellular infrastructure. Digital modulation encodes voice and data onto carrier waves. Multiple access techniques (TDMA, CDMA, OFDMA) allow many users to share frequencies. 5G technology uses millimeter waves (24-86 GHz) for higher data rates. Cellular networks require complex infrastructure of towers and switching systems for seamless coverage."
            },
            {
              "process": "Fiber Optic Communication",
              "explanation": "Light waves (infrared) carry data through glass fibers using total internal reflection. Extremely high bandwidth enables internet backbone and long-distance telephony. Wavelength division multiplexing allows multiple signals simultaneously. Low attenuation (0.2 dB/km) enables transoceanic cables. Revolutionized global communication with higher speed and capacity than electrical systems."
            },
            {
              "process": "Wi-Fi and Bluetooth",
              "explanation": "Short-range wireless communication using 2.4 GHz and 5 GHz radio waves. Wi-Fi (IEEE 802.11) provides local network connectivity with ranges up to 100 meters. Bluetooth uses frequency-hopping spread spectrum for personal area networks. Both technologies enable cordless connectivity for computers, phones, and IoT devices. Modern versions support high-speed data transfer for video and audio streaming."
            }
          ]
        },
        {
          "type": "Medical and Sensing Applications",
          "value": "Wave-based technologies for diagnosis, treatment, and measurement",
          "characteristics": ["Non-invasive sensing", "Imaging capabilities", "Therapeutic applications", "Precision measurement"],
          "behavior": "Waves interact with tissues and materials in characteristic ways that enable visualization, measurement, and modification",
          "examples": [
            {
              "process": "Medical Ultrasound",
              "explanation": "High-frequency sound waves (2-18 MHz) create images of internal structures. Pulses reflect from tissue boundaries, with echo timing revealing depth. Different tissues have different acoustic impedances, creating contrast. Doppler ultrasound measures blood flow velocity. Safe, non-ionizing, real-time imaging makes it ideal for obstetrics, cardiology, and abdominal examination. Also used for therapeutic purposes like breaking kidney stones."
            },
            {
              "process": "Magnetic Resonance Imaging (MRI)",
              "explanation": "Radio waves manipulate nuclear spins in magnetic fields to create detailed soft tissue images. Protons align with strong magnetic field, then RF pulses excite them. As protons relax, they emit RF signals that encode spatial information. Excellent for brain, joint, and soft tissue imaging without ionizing radiation. Functional MRI (fMRI) measures brain activity through blood flow changes."
            },
            {
              "process": "X-ray Imaging and CT Scanning",
              "explanation": "X-rays penetrate tissues differentially based on density and atomic number, creating shadow images. Dense bone absorbs more X-rays than soft tissue. Computed Tomography (CT) uses rotating X-ray sources and detectors to create cross-sectional images. Digital processing constructs 3D representations. Essential for fracture detection, dental imaging, and cancer diagnosis. Radiation dose requires careful management."
            },
            {
              "process": "LIDAR and Radar",
              "explanation": "LIDAR uses laser pulses to measure distance through time-of-flight calculations, creating precise 3D maps. Applications include autonomous vehicles, topography, and archaeology. Radar uses radio waves to detect object position, speed, and direction through echo analysis. Weather radar tracks precipitation, aircraft radar enables navigation and collision avoidance. Police radar measures vehicle speeds using Doppler shift."
            }
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Wave",
    "Transverse wave",
    "Longitudinal wave",
    "Mechanical wave",
    "Electromagnetic wave",
    "Amplitude",
    "Wavelength",
    "Frequency",
    "Period",
    "Wave speed",
    "$v = f\\lambda$",
    "Crest",
    "Trough",
    "Compression",
    "Rarefaction",
    "Energy transfer",
    "Medium",
    "Oscillation",
    "Propagation"
  ],
  "summary": "Waves are fundamental physical phenomena characterized by the transfer of energy through oscillations without significant mass transport. They are classified by the relationship between oscillation and propagation directions (transverse vs. longitudinal) and by medium requirements (mechanical vs. electromagnetic). All waves share common properties including amplitude (related to energy), wavelength (spatial period), frequency (temporal period), and speed, connected through the fundamental wave equation $v = f\\lambda$. Wave principles underpin countless natural phenomena and essential technologies including communication systems, medical imaging, sensing devices, and energy transfer mechanisms. Understanding wave behavior enables both comprehension of the natural world and development of technologies that define modern civilization, from global communication networks to life-saving medical diagnostics."
}
