{
  "unit_title": "Wave Speed Equation: v = fλ Calculations and Applications",
  "unit_number": "Unit 6.8",
  "grade_level": "Grade 10",
  "subject": "Physics",
  "expanded_description": "Master the universal wave equation v = fλ to calculate wave speed, frequency, and wavelength. Understand medium dependence, solve practical problems, and apply the equation across mechanical and electromagnetic wave phenomena.",
  "core_concept": {
    "principle": "The wave equation v = fλ universally relates wave speed (v), frequency (f), and wavelength (λ), enabling calculation of any one parameter when the other two are known, with speed determined by medium properties.",
    "explanation": "This fundamental relationship connects the temporal (frequency) and spatial (wavelength) descriptions of waves through their propagation speed, providing a complete mathematical framework for wave analysis.",
    "image": {
      "url": "images/grade-10-wave-equation-core.png",
      "alt": "Wave equation triangle showing v = fλ and rearranged forms",
      "caption": "The wave equation v = fλ can be rearranged as f = v/λ or λ = v/f. Cover any variable to calculate it from the other two. Speed depends on the medium, frequency depends on the source, and wavelength adjusts accordingly."
    }
  },
  "sections": [
    {
      "section_title": "1. Fundamental Wave Equation Concepts",
      "introduction": "The wave equation v = fλ serves as the cornerstone of wave mathematics, connecting the three fundamental wave parameters through a simple yet powerful relationship. Understanding this equation enables prediction and analysis of wave behavior across diverse physical contexts from sound to light to water waves.",
      "key_concept": {
        "definition": "The universal wave equation v = fλ states that wave speed equals frequency multiplied by wavelength, with speed determined by medium properties, frequency determined by the source, and wavelength adjusting to satisfy the relationship.",
        "context": "This equation applies to all wave types and provides the mathematical basis for calculating unknown wave parameters from measured quantities."
      },
      "principles": [
        {
          "principle": "Universal Application Principle",
          "statement": "The equation v = fλ applies to all wave types including mechanical waves (sound, water, seismic) and electromagnetic waves (light, radio, X-rays), with the same mathematical form but different speed determinants",
          "application": "This enables unified wave analysis across physics and provides consistent problem-solving approaches for diverse wave phenomena",
          "example": "Sound in air: v ≈ 343 m/s, light in vacuum: v = 3×10⁸ m/s, but both obey v = fλ with their respective speeds",
          "analogy": "Like the equation distance = speed × time - it applies to all motion whether walking, driving, or flying, though speeds differ dramatically"
        },
        {
          "principle": "Parameter Interdependence Principle",
          "statement": "The three wave parameters are mathematically linked - changing any one parameter requires adjustment of at least one other to maintain the equation balance",
          "application": "This explains why waves change wavelength when entering different media while frequency remains constant, and why different frequencies have different wavelengths in the same medium",
          "example": "When light enters glass, speed decreases, so wavelength decreases while frequency stays the same, causing different colors to refract differently",
          "analogy": "Like a conveyor belt carrying boxes - if the belt slows down (speed decreases) but boxes keep arriving at the same rate (frequency constant), the boxes must get closer together (wavelength decreases)"
        },
        {
          "principle": "Medium Dependence Principle",
          "statement": "Wave speed is determined by properties of the medium, while frequency is determined by the source, and wavelength adjusts according to v = fλ",
          "application": "This enables prediction of wave behavior in different materials and explains why the same sound has different wavelengths in air versus water",
          "example": "A 440 Hz tuning fork produces sound with wavelength 0.78 m in air (v=343 m/s) but wavelength 3.36 m in water (v=1480 m/s), with frequency unchanged at 440 Hz",
          "analogy": "Like vehicles on different roads - the engine determines RPM (frequency), road conditions determine speed, and this determines the distance between vehicles (wavelength)"
        }
      ],
      "categories": [
        {
          "type": "Wave Equation Forms",
          "description": "Different mathematical arrangements of the fundamental wave equation",
          "examples": [
            {
              "process": "Speed Calculation",
              "explanation": "v = fλ - Calculate wave speed when frequency and wavelength are known"
            },
            {
              "process": "Frequency Calculation", 
              "explanation": "f = v/λ - Calculate frequency when speed and wavelength are known"
            },
            {
              "process": "Wavelength Calculation",
              "explanation": "λ = v/f - Calculate wavelength when speed and frequency are known"
            },
            {
              "process": "Angular Form",
              "explanation": "v = ω/k - Using angular frequency ω = 2πf and wave number k = 2π/λ"
            },
            {
              "process": "Period Form",
              "explanation": "v = λ/T - Using period T = 1/f instead of frequency"
            }
          ]
        }
      ]
    },
    {
      "section_title": "2. Wave Speed in Different Media",
      "introduction": "Wave speed varies dramatically across different media, determined by specific physical properties of each material. Understanding these speed determinants enables prediction of wave behavior in various environments and explains why waves propagate at characteristic speeds in different substances.",
      "key_concept": {
        "definition": "Wave speed depends on elastic properties and density of the medium: v = √(elastic property/density), with different elastic moduli relevant for different wave types and material states.",
        "context": "These relationships explain why sound travels faster in solids than liquids, faster in liquids than gases, and why light slows down in transparent materials."
      },
      "image": {
        "url": "images/grade-10-wave-speed-media.png",
        "alt": "Comparison of wave speeds in different media with formulas",
        "caption": "Wave speed formulas: Sound in gases v = √(γRT/M), in liquids v = √(K/ρ), in solids v = √(Y/ρ). Light in materials v = c/n. Speed increases with stiffness and decreases with density."
      },
      "classifications": [
        {
          "type": "Mechanical Wave Speed Formulas",
          "value": "Equations for calculating mechanical wave speeds in different media",
          "characteristics": ["Elastic modulus dependence", "Density inverse relationship", "Temperature effects", "Material-specific constants"],
          "behavior": "Different mechanical wave types and media states require specific speed formulas that all follow the general pattern v = √(elastic property/density)",
          "examples": [
            {
              "process": "Sound in Gases",
              "explanation": "v = √(γRT/M), where γ is adiabatic index (1.4 for air), R is gas constant (8.314 J/mol·K), T is temperature (K), M is molar mass (0.02896 kg/mol for air). For air: v ≈ 331 + 0.6T°C m/s. Example: At 20°C: v = 331 + 0.6(20) = 343 m/s. At 0°C: v = 331 m/s. This temperature dependence explains why sound travels faster on warm days. Different gases: Hydrogen (M=0.002) v ≈ 1270 m/s, Carbon dioxide (M=0.044) v ≈ 259 m/s. Speed independent of pressure for ideal gases."
            },
            {
              "process": "Sound in Liquids",
              "explanation": "v = √(K/ρ), where K is bulk modulus (resistance to compression), ρ is density. Water: K = 2.2×10⁹ Pa, ρ = 1000 kg/m³, v = √(2.2×10⁹/1000) = 1480 m/s. Sea water: v ≈ 1500 m/s (increases with salinity and pressure). Mercury: ρ = 13600 kg/m³, K = 2.85×10¹⁰ Pa, v = √(2.85×10¹⁰/13600) = 1450 m/s. Speed increases with temperature in water (unlike most liquids) due to complex molecular effects. These speeds enable underwater acoustic communication over long distances."
            },
            {
              "process": "Sound in Solids",
              "explanation": "Longitudinal waves: v = √(Y/ρ) where Y is Young's modulus. Steel: Y = 2×10¹¹ Pa, ρ = 7850 kg/m³, v = √(2×10¹¹/7850) = 5050 m/s. Aluminum: v ≈ 5100 m/s. Glass: v ≈ 5200 m/s. Transverse waves in solids: v = √(G/ρ) where G is shear modulus. Steel: G = 8×10¹⁰ Pa, v = √(8×10¹⁰/7850) = 3190 m/s. These high speeds enable early detection of trains by placing ear to rail, and explain why seismic waves travel rapidly through Earth's interior."
            },
            {
              "process": "Waves on Strings",
              "explanation": "v = √(T/μ), where T is tension (N), μ is linear mass density (kg/m). Example: Guitar string μ = 0.001 kg/m, T = 100 N: v = √(100/0.001) = 316 m/s. For length L = 0.65 m, fundamental frequency f = v/2L = 316/(2×0.65) = 243 Hz. Increasing tension increases speed and frequency. Bass strings have higher μ for lower frequencies. This relationship enables musical instrument design and tuning through controlled tension and mass distribution."
            }
          ]
        }
      ],
      "process_flow": [
        {
          "step": 1,
          "process": "Medium Identification",
          "description": "Determine the wave propagation medium and its state (gas, liquid, solid)",
          "mechanism": "Identify the material, its state, and relevant physical properties from tables or measurements",
          "result": "Clear understanding of wave propagation environment",
          "applications": ["Wave analysis", "Experimental design", "Application planning"]
        },
        {
          "step": 2,
          "process": "Speed Formula Selection",
          "description": "Choose appropriate speed formula based on wave type and medium",
          "mechanism": "Select from v = √(γRT/M) for gases, v = √(K/ρ) for liquids, v = √(Y/ρ) for solids, or v = √(T/μ) for strings",
          "result": "Correct mathematical approach for speed calculation",
          "applications": ["Speed prediction", "Material characterization", "System design"]
        },
        {
          "step": 3,
          "process": "Parameter Substitution",
          "description": "Insert known material properties into selected formula",
          "mechanism": "Use tabulated values for elastic moduli, densities, temperatures, or measure these parameters experimentally",
          "result": "Mathematical expression ready for calculation",
          "applications": ["Numerical calculation", "Performance prediction", "Design verification"]
        },
        {
          "step": 4,
          "process": "Speed Calculation",
          "description": "Compute wave speed using the formula with proper units",
          "mechanism": "Perform square root calculation with consistent units, verify dimensional consistency",
          "result": "Numerical wave speed value for the specific medium",
          "applications": ["Wave parameter calculations", "Application implementation", "System optimization"]
        }
      ]
    },
    {
      "section_title": "3. Wave Equation Problem Solving Methodology",
      "introduction": "Systematic problem-solving approaches for v = fλ calculations enable efficient solution of diverse wave problems across physics. Mastering these methods provides powerful tools for analyzing wave behavior in scientific, engineering, and everyday contexts.",
      "key_concept": {
        "definition": "Wave equation problems are solved through methodical approaches involving problem analysis, equation selection, unit management, and result verification, with specific strategies for different problem types and contexts.",
        "context": "This systematic methodology ensures accurate solutions and develops transferable problem-solving skills applicable across wave phenomena and physical sciences."
      },
      "categories": [
        {
          "type": "Problem-Solving Strategies",
          "description": "Systematic approaches for solving different types of wave equation problems",
          "detailed_mechanism": "Different problem types require specific solution strategies that all maintain mathematical rigor while adapting to particular contexts and constraints",
          "examples": [
            {
              "process": "Direct Calculation Problems",
              "explanation": "Straightforward applications of v = fλ where two parameters are given and the third is calculated. Example: Sound wave with f = 1000 Hz, λ = 0.343 m: v = fλ = 1000 × 0.343 = 343 m/s. Light with λ = 600 nm = 6×10⁻⁷ m, v = c = 3×10⁸ m/s: f = v/λ = 3×10⁸/6×10⁻⁷ = 5×10¹⁴ Hz. Radio wave with f = 100 MHz = 10⁸ Hz, v = c: λ = v/f = 3×10⁸/10⁸ = 3 m. These fundamental calculations form the building blocks for more complex wave analysis. Always verify units and reasonableness of results."
            },
            {
              "process": "Medium Transition Problems",
              "explanation": "Waves crossing between different media with frequency conservation. Example: Light with λ = 600 nm in air enters glass with n = 1.5. In air: v = c, f = c/λ = 5×10¹⁴ Hz (unchanged). In glass: v = c/n = 2×10⁸ m/s, λ = v/f = 2×10⁸/5×10¹⁴ = 4×10⁻⁷ m = 400 nm. Sound with f = 440 Hz in air (v=343 m/s, λ=0.78 m) enters water (v=1480 m/s): λ = v/f = 1480/440 = 3.36 m. These problems demonstrate frequency invariance and wavelength adjustment across media boundaries."
            },
            {
              "process": "Multi-Step Calculation Problems",
              "explanation": "Problems requiring multiple applications of wave equations or additional physical principles. Example: Find wavelength of second harmonic on guitar string. Given: L = 0.65 m, μ = 0.001 kg/m, T = 100 N. First: v = √(T/μ) = √(100/0.001) = 316 m/s. Second harmonic: λ₂ = L (for string fixed at both ends). Then f₂ = v/λ₂ = 316/0.65 = 486 Hz. Alternatively: f₁ = v/2L = 316/1.3 = 243 Hz, f₂ = 2f₁ = 486 Hz, λ₂ = v/f₂ = 316/486 = 0.65 m. These problems develop systematic thinking and multiple approach skills."
            },
            {
              "process": "Unit Conversion and Management",
              "explanation": "Problems requiring careful unit handling and conversions. Example: Microwave with f = 2.45 GHz, v = c = 3×10⁸ m/s. λ = v/f = 3×10⁸/2.45×10⁹ = 0.122 m = 12.2 cm. Ultrasound with f = 5 MHz = 5×10⁶ Hz, in tissue v ≈ 1540 m/s. λ = v/f = 1540/5×10⁶ = 3.08×10⁻⁴ m = 0.308 mm. Earthquake wave with T = 2 s, v = 5 km/s = 5000 m/s. f = 1/T = 0.5 Hz, λ = v/f = 5000/0.5 = 10000 m = 10 km. Proper unit conversion prevents errors by factors of 1000 and ensures physically meaningful results."
            }
          ]
        },
        {
          "type": "Common Calculation Scenarios",
          "description": "Frequently encountered wave equation applications in science and technology",
          "examples": [
            {
              "process": "Musical Instrument Calculations",
              "explanation": "String instruments: v = √(T/μ), fₙ = nv/2L, λₙ = 2L/n. Wind instruments: fₙ = nv/2L (open-open), fₙ = nv/4L (open-closed). Example: Clarinet (open-closed) L = 0.6 m, v = 343 m/s: f₁ = v/4L = 343/(4×0.6) = 143 Hz, λ₁ = 4L = 2.4 m. f₃ = 3f₁ = 429 Hz, λ₃ = 4L/3 = 0.8 m. These calculations enable instrument design, tuning, and understanding of harmonic structures in music."
            },
            {
              "process": "Communication System Design",
              "explanation": "Antenna design: optimal length ≈ λ/2 or λ/4. Example: FM radio f = 100 MHz, λ = c/f = 3×10⁸/10⁸ = 3 m, so λ/4 antenna = 0.75 m. Waveguide operation: cutoff when λ < 2a for width a. Fiber optics: single-mode when λ < 2.405×(2a)×NA/π. Radar: range resolution ΔR = cτ/2 where τ is pulse duration. These applications demonstrate how wave equation calculations drive practical communication system design and performance optimization."
            },
            {
              "process": "Medical Imaging Parameters",
              "explanation": "Ultrasound: wavelength determines resolution, f = 2-18 MHz, v ≈ 1540 m/s in tissue, so λ = 0.77-0.086 mm. Higher frequency = better resolution but less penetration. MRI: Larmor frequency f = γB₀/2π, where γ is gyromagnetic ratio, B₀ is field strength. At 1.5 T, f ≈ 64 MHz for protons, λ ≈ 4.7 m in tissue. X-ray: λ ≈ 0.01-10 nm, f ≈ 3×10¹⁶-3×10¹⁹ Hz. These calculations guide modality selection and equipment design for optimal medical diagnostics."
            },
            {
              "process": "Seismic Wave Analysis",
              "explanation": "P-waves: v ≈ 5-8 km/s in crust and mantle. S-waves: v ≈ 3-4.5 km/s. Surface waves: v ≈ 2-4 km/s. Example: Earthquake with P-wave arrival at 10:00:00, S-wave at 10:00:30 at station 100 km away. Time difference Δt = 30 s, using travel time curves or v_P ≈ 6 km/s, v_S ≈ 3.5 km/s. These calculations enable earthquake location, magnitude determination, and Earth structure analysis through seismic wave behavior."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Consistent Units Principle",
          "statement": "All parameters in wave equations must use consistent units, with particular attention to metric prefixes and unit conversions to avoid calculation errors",
          "application": "This ensures accurate results and prevents common errors by factors of 1000 when mixing units like meters and centimeters, or hertz and kilohertz",
          "example": "Light with λ = 550 nm must be converted to 5.5×10⁻⁷ m before using v = fλ with v = 3×10⁸ m/s, giving f = 5.45×10¹⁴ Hz rather than the incorrect 5.45×10¹⁷ Hz if nanometers were used directly",
          "analogy": "Like measuring a room - you must use the same units for all measurements, not mix feet and meters in the same calculation"
        },
        {
          "principle": "Frequency Invariance Principle",
          "statement": "Wave frequency remains constant during propagation, reflection, and transmission across media boundaries, serving as a fixed reference in multi-medium problems",
          "application": "This provides a conserved quantity that connects wave behavior in different media and simplifies analysis of complex propagation paths",
          "example": "When analyzing light passing through multiple lenses or sound reflecting between walls, the frequency provides a constant reference while speed and wavelength change with each medium",
          "analogy": "Like the rhythm of a song - it stays the same whether played on different instruments or in different rooms, while the sound quality and volume may change"
        },
        {
          "principle": "Reasonableness Checking",
          "statement": "Calculated results should be verified for physical reasonableness by comparing to known values and considering the context of the problem",
          "application": "This catches calculation errors and ensures solutions make physical sense in their applied contexts",
          "example": "A calculated sound wavelength of 1000 m for a musical note would be unreasonable (actual ~1 m), indicating a likely unit error or calculation mistake",
          "analogy": "Like estimating if a price makes sense - a $10,000 cup of coffee suggests a decimal point error, similar to physical calculations"
        }
      ]
    },
    {
      "section_title": "4. Practical Applications and Problem Examples",
      "introduction": "The wave equation v = fλ finds extensive practical application across science, engineering, and daily life. Solving real-world problems demonstrates the power of this fundamental relationship and develops skills for analyzing wave phenomena in diverse contexts.",
      "key_concept": {
        "definition": "Wave equation applications span communications, medicine, music, remote sensing, and fundamental research, with problem-solving approaches tailored to specific contexts while maintaining the universal v = fλ relationship.",
        "context": "These practical applications demonstrate the utility of wave equation calculations in designing technologies, solving engineering problems, and understanding natural phenomena."
      },
      "process_flow": [
        {
          "step": 1,
          "process": "Problem Analysis and Understanding",
          "description": "Comprehend the problem context, identify given parameters, and determine what needs to be calculated",
          "mechanism": "Read problem carefully, list known values with units, identify target variable, recognize the physical context",
          "result": "Clear problem understanding and parameter identification",
          "organization": "Systematic problem decomposition"
        },
        {
          "step": 2,
          "process": "Equation Selection and Rearrangement",
          "description": "Choose appropriate wave equation form and rearrange to solve for unknown variable",
          "mechanism": "Select v = fλ, f = v/λ, or λ = v/f based on knowns and unknown, include medium transitions if applicable",
          "result": "Correct mathematical formulation for solution",
          "organization": "Mathematical approach planning"
        },
        {
          "step": 3,
          "process": "Numerical Calculation with Unit Management",
          "description": "Perform calculations with careful attention to units, conversions, and significant figures",
          "mechanism": "Substitute values, perform arithmetic, maintain unit consistency, apply appropriate precision",
          "result": "Numerical solution with proper units",
          "organization": "Precise computational execution"
        },
        {
          "step": 4,
          "process": "Solution Verification and Interpretation",
          "description": "Verify result reasonableness and interpret physical meaning in context",
          "mechanism": "Check units through dimensional analysis, compare to known values, consider practical implications",
          "result": "Validated solution with contextual understanding",
          "organization": "Comprehensive solution evaluation"
        }
      ],
      "classifications": [
        {
          "type": "Communication System Applications",
          "value": "Wave equation calculations in telecommunications and broadcasting",
          "characteristics": ["Frequency band optimization", "Antenna design", "Propagation analysis", "Signal processing"],
          "behavior": "These applications use wave equation calculations to optimize system performance, design components, and analyze signal behavior in communication technologies",
          "examples": [
            {
              "process": "Antenna Design Calculations",
              "explanation": "Optimal antenna lengths are fractions of wavelength: half-wave dipole = λ/2, quarter-wave monopole = λ/4. Example: Design FM radio antenna for 98.5 MHz. λ = c/f = 3×10⁸/98.5×10⁶ = 3.045 m. Half-wave dipole length = λ/2 = 1.52 m. Quarter-wave monopole = λ/4 = 0.76 m. For Wi-Fi at 2.4 GHz: λ = 0.125 m, so patch antenna dimensions ≈ 6 cm. These calculations ensure efficient radiation and reception by matching antenna size to operating wavelength. Different frequency bands require dramatically different antenna sizes, from kilometers for VLF radio to millimeters for microwave communications."
            },
            {
              "process": "Fiber Optic Communication Design",
              "explanation": "Single-mode operation requires wavelength < cutoff: λ < 2.405×(2a)×NA/π, where a is core radius, NA is numerical aperture. Example: Fiber with 2a = 8 μm, NA = 0.12: cutoff λ = 2.405×8×10⁻⁶×0.12/π = 7.35×10⁻⁷ m = 735 nm. So wavelengths > 735 nm will be multi-mode. Standard telecom wavelengths: 1310 nm and 1550 nm for minimum attenuation. Channel spacing in DWDM: 0.8 nm (100 GHz) or 0.4 nm (50 GHz). These calculations enable design of high-capacity optical communication systems with optimal performance characteristics."
            },
            {
              "process": "Radio Propagation Analysis",
              "explanation": "Fresnel zone clearance requires obstacle distance > 0.6√(λd) for path length d. Example: 2.4 GHz Wi-Fi (λ=0.125 m) over d=100 m: clearance = 0.6√(0.125×100) = 2.12 m. For 100 MHz FM (λ=3 m) over same distance: clearance = 0.6√(3×100) = 10.4 m. Diffraction loss calculations depend on wavelength relative to obstacle size. These analyses ensure reliable communication links by accounting for wavelength-dependent propagation effects in environment planning and system deployment."
            },
            {
              "process": "Satellite Communication Parameters",
              "explanation": "Geostationary orbit: 35,786 km altitude, signal travel time 2×35,786×10³/3×10⁸ = 0.239 s. Ku-band: 12-18 GHz, λ = 2.5-1.67 cm. Antenna diameter D related to beamwidth θ ≈ 70λ/D. Example: 1 m antenna at 12 GHz (λ=2.5 cm): θ ≈ 70×0.025/1 = 1.75°. Doppler shift for LEO satellites: Δf/f = v/c, with v ≈ 7 km/s, Δf/f ≈ 2.3×10⁻⁵. These calculations ensure proper satellite system design accounting for propagation delays, antenna characteristics, and orbital mechanics effects."
            }
          ]
        },
        {
          "type": "Scientific and Medical Applications",
          "value": "Wave equation calculations in research, diagnostics, and treatment",
          "characteristics": ["Precision measurement", "Medical imaging", "Materials characterization", "Fundamental research"],
          "behavior": "These applications use precise wave equation calculations for scientific measurements, medical diagnostics, and therapeutic treatments across various frequency domains",
          "examples": [
            {
              "process": "Ultrasound Imaging Parameters",
              "explanation": "Resolution ≈ λ/2, penetration depth ≈ 500λ. Example: Abdominal imaging at 3.5 MHz, v = 1540 m/s in tissue: λ = v/f = 1540/3.5×10⁶ = 0.44 mm. Resolution ≈ 0.22 mm, penetration ≈ 220 mm. For vascular imaging at 7.5 MHz: λ = 0.21 mm, resolution ≈ 0.11 mm, penetration ≈ 105 mm. Doppler shift for blood flow: Δf = 2vf cosθ/c, where v is blood velocity, θ is beam-flow angle. These calculations guide transducer selection and system settings for optimal medical imaging based on clinical requirements."
            },
            {
              "process": "Spectroscopy and Material Analysis",
              "explanation": "Rotational spectroscopy: ΔE = h²/(8π²I) for moment of inertia I, f = ΔE/h. Vibrational spectroscopy: f = (1/2π)√(k/μ) for force constant k, reduced mass μ. Example: CO molecule rotational constant B = 1.93 cm⁻¹, so rotational transitions at f = Bc ≈ 57.8 GHz. XRD using Bragg's law: 2d sinθ = nλ. Example: Copper Kα X-rays λ = 0.154 nm, for d = 0.2 nm crystal: θ = arcsin(λ/2d) = arcsin(0.154/0.4) = 22.6°. These calculations enable molecular structure determination and material characterization through precise wavelength measurements."
            },
            {
              "process": "Astronomical Observations",
              "explanation": "Redshift z = Δλ/λ = v/c for cosmological distances. Example: Galaxy with Hα line shifted from 656.3 nm to 820.4 nm: z = (820.4-656.3)/656.3 = 0.25, v = zc = 0.25×3×10⁸ = 7.5×10⁷ m/s. 21 cm hydrogen line: f = 1420.405752 MHz, used for galactic structure mapping. Cosmic microwave background: blackbody spectrum at 2.725 K, peak λ = 2.898×10⁻³/2.725 = 1.063 mm, f = 282 GHz. These measurements enable determination of cosmic distances, expansion rates, and universe composition through precise wavelength and frequency analysis."
            },
            {
              "process": "Quantum Mechanical Applications",
              "explanation": "de Broglie wavelength: λ = h/p, where h is Planck's constant, p is momentum. Example: Electron with 100 eV energy: p = √(2mE) = √(2×9.11×10⁻³¹×100×1.6×10⁻¹⁹) = 5.40×10⁻²⁴ kg·m/s, λ = 6.63×10⁻³⁴/5.40×10⁻²⁴ = 1.23×10⁻¹⁰ m = 0.123 nm. This matches X-ray wavelengths, explaining electron microscopy resolution. Neutron with 0.025 eV thermal energy: λ = 0.18 nm, used for neutron diffraction. These wave calculations bridge classical and quantum descriptions of matter."
            }
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Wave equation",
    "v = fλ",
    "Wave speed",
    "Frequency",
    "Wavelength",
    "Medium dependence",
    "Elastic modulus",
    "Bulk modulus",
    "Young's modulus",
    "Linear mass density",
    "Refractive index",
    "Dispersion",
    "Harmonics",
    "Fundamental frequency",
    "Antenna design",
    "Doppler effect",
    "Refraction",
    "Acoustic impedance",
    "Cutoff frequency",
    "Phase velocity"
  ],
  "summary": "The universal wave equation v = fλ connects wave speed, frequency, and wavelength, providing the fundamental mathematical framework for wave analysis across all physics. Wave speed depends on medium properties: v = √(γRT/M) for sound in gases, v = √(K/ρ) for liquids, v = √(Y/ρ) for solids, and v = c/n for light in materials. Frequency is determined by the source and remains constant during propagation, while wavelength adjusts to maintain v = fλ when waves enter different media. Practical applications span communications (antenna design using λ/2 or λ/4 lengths), medicine (ultrasound imaging with resolution ≈ λ/2), music (instrument design using harmonic relationships), and scientific research (spectroscopy using precise wavelength measurements). Systematic problem-solving approaches involving unit management, frequency invariance, and reasonableness checking ensure accurate solutions. The wave equation enables prediction of wave behavior, design of wave-based technologies, and understanding of diverse phenomena from musical acoustics to cosmological redshifts, demonstrating its fundamental importance across science and engineering."
}
