{
  "topic": "6.8 Wave Speed Equation",
  "expanded_description": "This section covers the fundamental wave equation, v = fλ, which connects a wave's speed, frequency, and wavelength. Students will learn to use this universal relationship to solve a wide variety of wave problems and understand how these three core properties are interdependent.",
  "core_concept": {
    "principle": "The speed of a wave is the product of its frequency and its wavelength.",
    "explanation": "This equation, v = fλ, is a universal truth for all periodic waves. It states that the distance a wave travels in one second (speed, v) is equal to the number of waves sent out per second (frequency, f) multiplied by the length of each wave (wavelength, λ)."
  },
  "sections": [
    {
      "section_title": "Deriving the Wave Equation",
      "introduction": "Understanding the logical foundation of the v = fλ relationship from basic definitions.",
      "key_concept": {
        "definition": "**Logical Derivation:**\n\n1.  **Definition of Speed:** Speed = Distance / Time\n2.  **Wave Context:** In the time of one period (T), one full wave cycle passes a point.\n3.  **The Distance:** The length of one wave cycle is the wavelength (λ).\n4.  **The Time:** The time for one cycle is the period (T).\n\n**Therefore:** Wave Speed (v) = Distance / Time = λ / T\n\n**Since frequency is the reciprocal of period (f = 1/T):**\n$$v = \\frac{\\lambda}{T} = \\lambda \\cdot \\frac{1}{T} = f \\lambda$$\n\n$$v = f \\lambda$$",
        "context": "This derivation shows that v = fλ is not an independent law but a direct consequence of the definitions of speed, frequency, and wavelength."
      },
      "examples": [
        {
          "process": "**Conceptual Walk-Through:**\n\n**Imagine a wave train:**\n- Each wave is 2 meters long (λ = 2 m).\n- The source produces 3 waves every second (f = 3 Hz).\n\n**Question:** How far does the front of the wave train travel in one second?\n\n**Answer:** In one second, 3 waves are produced. If you line up these 3 waves, each 2 meters long, the total length is 3 × 2 m = 6 m.\n\n**Therefore, the wave train advances 6 meters in one second. Its speed is 6 m/s.**\nThis is exactly what v = fλ gives: v = (3 Hz)(2 m) = 6 m/s.",
          "explanation": "Uses a simple, visual analogy to make the abstract equation concrete and intuitively understandable."
        }
      ]
    },
    {
      "section_title": "The Problem-Solving Powerhouse",
      "key_concept": {
        "definition": "**The Three-Variable Relationship:**\n\nThe equation v = fλ contains three variables. If you know any two, you can always find the third.\n\n**The Three Forms:**\n1.  **For Speed:** $v = f \\lambda$\n2.  **For Frequency:** $f = \\frac{v}{\\lambda}$\n3.  **For Wavelength:** $\\lambda = \\frac{v}{f}$",
        "context": "This single equation is the most important tool for solving quantitative wave problems. Mastering its manipulation is essential."
      },
      "examples": [
        {
          "process": "**Solving for Different Variables:**\n\n**Problem 1: Find Speed**\nA sound wave has a frequency of 660 Hz and a wavelength of 0.5 m. What is its speed?\n$$v = f \\lambda = (660\\, \\text{Hz})(0.5\\, \\text{m}) = 330\\, \\text{m/s}$$\n\n**Problem 2: Find Wavelength**\nAn electromagnetic wave has a frequency of 94.1 MHz (94.1 × 10⁶ Hz) and travels at the speed of light (c = 3.00 × 10⁸ m/s). What is its wavelength?\n$$\\lambda = \\frac{v}{f} = \\frac{3.00 \\times 10^8\\, \\text{m/s}}{9.41 \\times 10^7\\, \\text{Hz}} \\approx 3.19\\, \\text{m}$$\n\n**Problem 3: Find Frequency**\nA water wave with a wavelength of 12 m travels at 4 m/s. What is its frequency?\n$$f = \\frac{v}{\\lambda} = \\frac{4\\, \\text{m/s}}{12\\, \\text{m}} = 0.33\\, \\text{Hz}$$",
          "explanation": "Demonstrates the practical application of the equation in its three forms, covering mechanical sound waves, EM waves, and water waves."
        }
      ]
    },
    {
      "section_title": "What Determines Wave Speed?",
      "classifications": [
        {
          "type": "Causal Analysis",
          "value": "Identifying the factors that control the 'v' in the equation v = fλ",
          "characteristics": ["Medium properties", "Wave type", "Temperature dependence", "Independence from f and λ"],
          "behavior": "The wave speed (v) is determined by the properties of the medium through which the wave travels. For a given medium under constant conditions, the wave speed is constant.",
          "examples": [
            {
              "process": "**Speed Dependence Examples:**\n\n**Mechanical Waves on a String:**\n$$v = \\sqrt{\\frac{T}{\\mu}}$$\n- **T** = Tension in the string (more tension → higher speed)\n- **μ** = Mass per unit length (heavier string → lower speed)\n\n**Sound Waves in Air:**\n$$v \\approx 331 + 0.6T_C\\, \\text{m/s}$$ (where T_C is Celsius temperature)\n- Warmer air → faster sound speed.\n\n**Electromagnetic Waves in a Vacuum:**\n$$c = 3.00 \\times 10^8\\, \\text{m/s}$$ (a universal constant)\n\n**The key insight: The source controls f, the medium controls v, and λ is the dependent variable that adjusts: λ = v/f.**",
              "explanation": "Clarifies that wave speed is not a free variable but is fixed by the medium, which is a foundational concept for understanding wave behavior."
            }
          ]
        }
      ]
    },
    {
      "section_title": "The Medium-Transition Rule",
      "classifications": [
        {
          "type": "Applied Principle",
          "value": "How v = fλ governs wave behavior at boundaries between media",
          "characteristics": ["Constant frequency", "Changing wavelength", "Speed change", "Bending refraction"],
          "behavior": "When a wave passes into a new medium, its frequency remains constant (set by the source), but its speed changes. Therefore, its wavelength must change to satisfy v = fλ.",
          "examples": [
            {
              "process": "**Sound Wave from Air to Water:**\n\n**Given:** f = 500 Hz (constant)\n**In Air:** v_air ≈ 343 m/s\n$$\\lambda_{air} = \\frac{v_{air}}{f} = \\frac{343}{500} = 0.686\\, \\text{m}$$\n\n**In Water:** v_water ≈ 1500 m/s\n$$\\lambda_{water} = \\frac{v_{water}}{f} = \\frac{1500}{500} = 3.0\\, \\text{m}$$\n\n**Conclusion:** The wavelength increases in water because the wave speed is faster. The wave 'stretches out' to maintain the same frequency.\n\n**The equation v = fλ perfectly describes this adjustment.**",
              "explanation": "Provides a definitive example of how the wave equation dictates the changes that occur when a wave crosses a boundary, reinforcing the concept of constant frequency."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Common Misconceptions and Errors",
      "classifications": [
        {
          "type": "Conceptual Pitfalls",
          "value": "Avoiding misunderstandings about the wave equation",
          "characteristics": ["Assuming v is variable", "Misapplying the equation", "Confusing cause and effect", "Unit errors"],
          "behavior": "The relationship between v, f, and λ is often misinterpreted, leading to fundamental errors in reasoning.",
          "examples": [
            {
              "process": "**Misconception: 'A wave with higher frequency travels faster'**\n\n**Incorrect:** \"Since v = fλ, if I increase f, v must increase.\"\n\n**Correct:** For a wave in a given medium, v is **constant**. If you increase the frequency (f), the wavelength (λ) **must decrease** proportionally to keep v the same. The equation shows a relationship, not necessarily causation. The medium dictates v.\n\n**In a single medium, f and λ are inversely proportional, with v as the constant of proportionality.**",
              "explanation": "Corrects a critical error in interpreting the equation, emphasizing that v is fixed by the medium, making f and λ dependent on each other."
            },
            {
              "process": "**Error: Misidentifying the constant in a scenario**\n\n**Problem:** When a wave changes media, assuming wavelength stays the same.\n\n**Incorrect:** \"Light goes from air to glass. Its speed decreases, so its frequency must also decrease (since v = fλ and λ is constant).\"\n\n**Correct:** When light goes from air to glass, its speed decreases. Its frequency is constant (set by the source). Therefore, its wavelength **must decrease**: λ_glass = v_glass / f.\n\n**The invariant quantity is the frequency (f), not the wavelength (λ).**",
              "explanation": "Reinforces the most important rule for waves crossing boundaries, which is a direct application of the v=fλ equation."
            },
            {
              "process": "**Error: Unit inconsistency**\n\n**Problem:** Using incorrect units that don't cancel to give meters per second (m/s).\n\n**Incorrect:** Using frequency in kHz or wavelength in cm without converting.\n\n**Example:** f = 2 kHz = 2000 Hz, λ = 15 cm = 0.15 m\n**Correct:** v = fλ = (2000 Hz)(0.15 m) = 300 m/s\n**Incorrect:** v = (2)(15) = 30 (meaningless number)\n\n**Always use base SI units: Hz for frequency, m for wavelength, m/s for speed.**",
              "explanation": "Highlights a common practical error in calculation and emphasizes the necessity of consistent units."
            },
            {
              "process": "**Misconception: 'The equation v=fλ is only for light'**\n\n**Incorrect:** Avoiding the equation for sound or water waves.\n\n**Correct:** The wave equation v = fλ is **universal**. It applies to all periodic waves: sound, light, water, seismic, waves on a string, etc. It is a fundamental kinematic relationship derived from the definitions of the quantities involved.\n\n**v = fλ is as fundamental to waves as F=ma is to motion.**",
              "explanation": "Broadens the understanding of the equation's applicability, ensuring students use it for all wave types."
            }
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Wave Speed Equation",
    "v = fλ",
    "Wave Speed (v)",
    "Frequency (f)",
    "Wavelength (λ)",
    "Universal Wave Equation",
    "Medium Dependence",
    "Constant Frequency",
    "Problem Solving"
  ],
  "summary": "The wave speed equation, v = fλ, is a universal relationship connecting a wave's speed, frequency, and wavelength. It is derived from the definitions of these quantities: the wave travels one wavelength (λ) in the time of one period (T=1/f). The equation is a powerful problem-solving tool, allowing calculation of any one variable if the other two are known. Crucially, the wave speed (v) is determined by the properties of the medium and is constant for a given medium under fixed conditions. This means that in a single medium, frequency and wavelength are inversely proportional. When a wave crosses into a different medium, the frequency remains constant (set by the source), the speed changes (determined by the new medium), and the wavelength adjusts accordingly (λ = v/f). Common errors include thinking frequency affects speed in a single medium, misidentifying frequency as the variable that changes at a boundary, and failing to use consistent SI units in calculations."
}
