{
  "course": "Chemistry Grade 12",
  "topic": "Analytical Techniques & Polymers",
  "problems": [
    {
      "number": 1,
      "problem": "Define chromatography and its basic principle.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Chromatography is a separation technique where components of a mixture are separated based on their differential affinities between a stationary phase and a mobile phase."
        },
        {
          "step": "Principle",
          "explanation": "Components with higher affinity for the stationary phase move slower, while those with higher affinity for the mobile phase move faster."
        }
      ],
      "final_answer": "Chromatography separates components based on differential partitioning between stationary and mobile phases."
    },
    {
      "number": 2,
      "problem": "Explain the difference between thin-layer chromatography (TLC) and paper chromatography.",
      "image": null,
      "step_by_step": [
        {
          "step": "TLC",
          "explanation": "Stationary phase is a thin layer of adsorbent like silica gel; faster and more precise."
        },
        {
          "step": "Paper",
          "explanation": "Stationary phase is cellulose paper; simpler but less precise."
        }
      ],
      "final_answer": "TLC uses silica/alumina layer; paper chromatography uses cellulose paper."
    },
    {
      "number": 3,
      "problem": "Define spectroscopy and give an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Spectroscopy is the study of interaction of electromagnetic radiation with matter to determine composition or structure."
        },
        {
          "step": "Example",
          "explanation": "Infrared (IR) spectroscopy to identify functional groups."
        }
      ],
      "final_answer": "Spectroscopy studies radiation-matter interactions; example: IR spectroscopy."
    },
    {
      "number": 4,
      "problem": "Explain the principle of mass spectrometry.",
      "image": null,
      "step_by_step": [
        {
          "step": "Principle",
          "explanation": "Compounds are ionized and fragmented; ions are separated based on mass-to-charge ratio (m/z) to determine molecular weight and structure."
        }
      ],
      "final_answer": "Mass spectrometry separates ions by m/z to determine molecular weight and structure."
    },
    {
      "number": 5,
      "problem": "Define polymers and classify them based on origin.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Polymers are large molecules made of repeating monomer units."
        },
        {
          "step": "Classification",
          "explanation": "Natural (e.g., cellulose, proteins) and synthetic (e.g., polyethylene, nylon)."
        }
      ],
      "final_answer": "Polymers: large molecules from monomers; natural and synthetic types."
    },
    {
      "number": 6,
      "problem": "Explain addition polymerization with an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Mechanism",
          "explanation": "Monomers with double bonds react to form long chains without eliminating small molecules."
        },
        {
          "step": "Example",
          "calculation": "n CH2=CH2 → -(CH2-CH2)-n (polyethylene)"
        }
      ],
      "final_answer": "Addition polymerization: double bond monomers form chains; example: polyethylene."
    },
    {
      "number": 7,
      "problem": "Explain condensation polymerization with an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Mechanism",
          "explanation": "Monomers with two functional groups react, eliminating small molecules like H2O or HCl."
        },
        {
          "step": "Example",
          "calculation": "n HO-CH2-CH2-OH + n HOOC-CH2-COOH → -(O-CH2-CH2-O-CO-CH2-CO)-n + 2n H2O (polyester)"
        }
      ],
      "final_answer": "Condensation polymerization: monomers react with elimination; example: polyester."
    },
    {
      "number": 8,
      "problem": "Explain the difference between thermoplastic and thermosetting polymers.",
      "image": null,
      "step_by_step": [
        {
          "step": "Thermoplastics",
          "explanation": "Can be softened and reshaped on heating; e.g., polyethylene, PVC."
        },
        {
          "step": "Thermosets",
          "explanation": "Cannot be reshaped once set; form cross-linked structures; e.g., bakelite, epoxy."
        }
      ],
      "final_answer": "Thermoplastics: reshaped on heating; Thermosets: permanent cross-linked structure."
    },
    {
      "number": 9,
      "problem": "Explain how gel permeation chromatography (GPC) can be used to analyze polymers.",
      "image": null,
      "step_by_step": [
        {
          "step": "Mechanism",
          "explanation": "Polymers separated based on molecular size; larger molecules elute first, smaller molecules later."
        }
      ],
      "final_answer": "GPC separates polymers by size to determine molecular weight distribution."
    },
    {
      "number": 10,
      "problem": "Explain how IR spectroscopy can identify functional groups in polymers.",
      "image": null,
      "step_by_step": [
        {
          "step": "Principle",
          "explanation": "Polymers absorb IR radiation at characteristic frequencies corresponding to specific bond vibrations (e.g., C=O, O-H, C-H)."
        }
      ],
      "final_answer": "IR spectroscopy identifies polymer functional groups based on bond vibration frequencies."
    }
  ]
}
