{
  "title": "2.7 Comparative Advantage",
  "expanded_description": "Understanding comparative advantage as the fundamental principle governing international trade patterns through opportunity cost comparisons, analyzing how countries benefit from specializing in goods where they have lower opportunity costs, and examining the conditions for mutually beneficial trade",
  "core_concept": {
    "principle": "Comparative advantage exists when a country can produce a good at a lower opportunity cost than another country, and trade based on comparative advantage allows all countries to benefit by specializing in goods where their opportunity costs are relatively lower, then trading to consume beyond their production possibilities",
    "explanation": "A country has comparative advantage in good X if its opportunity cost of producing X (in terms of good Y forgone) is lower than another country's opportunity cost: $OC_X^A < OC_X^B$. The gains from trade arise when countries specialize according to comparative advantage and trade at a price ratio between their autarky opportunity costs: $OC_X^A < \\frac{P_X}{P_Y} < OC_X^B$. This enables both countries to consume outside their individual production possibilities frontiers.",
    "image": {
      "url": "/images/economics/comparative-advantage-core.svg",
      "alt": "Comparative advantage and opportunity cost",
      "caption": "How opportunity cost differences create comparative advantage and trade benefits"
    }
  },
  "sections": [
    {
      "section_title": "The Principle of Comparative Advantage",
      "introduction": "Comparative advantage, first articulated by David Ricardo in 1817, represents one of the most powerful and counterintuitive insights in economics: countries can benefit from trade by specializing in goods where they have lower opportunity costs, even if they are less productive in absolute terms than their trading partners. This principle explains why trade creates mutual gains rather than being zero-sum.",
      "key_concept": {
        "definition": "Comparative advantage is the ability to produce a good at a lower opportunity cost than another producer, where opportunity cost is measured as the quantity of other goods that must be sacrificed to produce one more unit of the good in question",
        "context": "Unlike absolute advantage which compares productivity levels, comparative advantage compares opportunity costs, ensuring that every country has comparative advantage in some good and can benefit from trade regardless of absolute productivity differences",
        "image": {
          "url": "/images/economics/comparative-advantage-principle.svg",
          "alt": "Principle of comparative advantage",
          "caption": "The fundamental logic of specialization based on opportunity costs"
        }
      },
      "classifications": [
        {
          "type": "Ricardian Comparative Advantage",
          "value": "Labor productivity-based opportunity cost differences",
          "characteristics": ["Based on labor productivity differences", "Constant opportunity costs", "Linear production possibilities", "One factor of production (labor)", "Complete specialization with trade"],
          "behavior": "In the Ricardian model, comparative advantage stems from differences in labor productivity, with countries completely specializing in their comparative advantage goods and trading at prices between the autarky price ratios",
          "examples": [
            {
              "process": "Classical England-Portugal Example",
              "explanation": "England: 1 worker produces 10 cloth or 5 wine, so $OC_{cloth} = 0.5$ wine, $OC_{wine} = 2.0$ cloth. Portugal: 1 worker produces 8 cloth or 8 wine, so $OC_{cloth} = 1.0$ wine, $OC_{wine} = 1.0$ cloth. England has comparative advantage in cloth, Portugal in wine",
              "image": {
                "url": "/images/economics/ricardian-example.svg",
                "alt": "Ricardo's classical example",
                "caption": "The original demonstration of comparative advantage"
              }
            },
            {
              "process": "Modern Numerical Example",
              "explanation": "US: 1 worker produces 6 cars or 3 computers → $OC_{car} = 0.5$ computers. China: 1 worker produces 2 cars or 4 computers → $OC_{car} = 2.0$ computers. US has comparative advantage in cars, China in computers",
              "image": {
                "url": "/images/economics/modern-ricardian.svg",
                "alt": "Modern Ricardian example",
                "caption": "Contemporary application of Ricardo's principle"
              }
            },
            {
              "process": "Complete Specialization Result",
              "explanation": "With constant opportunity costs, countries completely specialize in comparative advantage goods, producing zero of other goods and obtaining them entirely through trade",
              "image": {
                "url": "/images/economics/complete-specialization.svg",
                "alt": "Complete specialization pattern",
                "caption": "Extreme specialization in Ricardian model"
              }
            }
          ]
        },
        {
          "type": "Opportunity Cost Calculations",
          "value": "Quantifying comparative advantage through trade-offs",
          "characteristics": ["$OC_X = |\\frac{\\Delta Y}{\\Delta X}|$ on PPF", "Marginal rate of transformation", "Autarky price ratios", "Relative productivity comparisons", "Multi-good extensions"],
          "behavior": "Comparative advantage is determined by comparing opportunity costs, which equal the slope of the PPF. Countries should export goods with lower opportunity costs than world prices and import goods with higher opportunity costs",
          "examples": [
            {
              "process": "Linear PPF Calculation",
              "explanation": "With linear PPF $Y = a - bX$, opportunity cost of X is constant at $b$ units of Y. Comparative advantage exists if $b^A \\neq b^B$",
              "image": {
                "url": "/images/economics/linear-oc-calculation.svg",
                "alt": "Linear opportunity cost calculation",
                "caption": "Constant opportunity costs in simple trade models"
              }
            },
            {
              "process": "Concave PPF Marginal Costs",
              "explanation": "With concave PPF, opportunity cost increases with production. Comparative advantage depends on marginal opportunity costs at production points: $MRT = |\\frac{dY}{dX}|$",
              "image": {
                "url": "/images/economics/concave-oc-calculation.svg",
                "alt": "Increasing opportunity costs",
                "caption": "Variable opportunity costs on bowed-out PPF"
              }
            },
            {
              "process": "Multiple Good Chain",
              "explanation": "With many goods, countries export goods where their relative productivity $\\frac{A_i}{A_j}$ is highest compared to trading partners, creating a chain of comparative advantage from highest to lowest relative productivity",
              "image": {
                "url": "/images/economics/multi-good-chain.svg",
                "alt": "Multiple good comparative advantage",
                "caption": "Comparative advantage with many goods"
              }
            }
          ]
        },
        {
          "type": "Comparative vs Absolute Advantage",
          "value": "Distinguishing opportunity cost from productivity advantages",
          "characteristics": ["Comparative: Lower opportunity costs", "Absolute: Higher productivity levels", "A country can have absolute advantage in all goods", "Every country has comparative advantage in some good", "Trade patterns determined by comparative advantage"],
          "behavior": "Absolute advantage reflects productivity differences but doesn't determine trade patterns—comparative advantage based on opportunity cost differences drives specialization and creates mutual gains from trade",
          "examples": [
            {
              "process": "Mathematical Distinction",
              "explanation": "Country A: productivity 10 cloth, 5 wine. Country B: productivity 8 cloth, 8 wine. A has absolute advantage in cloth (10>8), B in wine (8>5), but A has comparative advantage in cloth ($OC=0.5<1.0$), B in wine ($OC=1.0<2.0$)",
              "image": {
                "url": "/images/economics/math-distinction.svg",
                "alt": "Mathematical distinction",
                "caption": "Numerical comparison of both concepts"
              }
            },
            {
              "process": "Real-World Application",
              "explanation": "US has absolute advantage in both agriculture and manufacturing vs Mexico, but trades by specializing in technology-intensive goods where its comparative advantage is strongest",
              "image": {
                "url": "/images/economics/real-world-distinction.svg",
                "alt": "Real-world application",
                "caption": "How the distinction plays out in actual trade"
              }
            },
            {
              "process": "Policy Implications",
              "explanation": "Countries should focus on developing comparative advantage through education and infrastructure rather than protecting industries where they lack absolute advantage",
              "image": {
                "url": "/images/economics/policy-implications.svg",
                "alt": "Policy implications",
                "caption": "Development strategies based on comparative advantage"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Comparative Advantage and Trade Gains",
          "problem": "Country A: maximum production 100 wheat or 50 computers. Country B: maximum production 50 wheat or 100 computers. Both have linear PPFs. In autarky, A produces 60 wheat and 20 computers, B produces 20 wheat and 60 computers. With trade at price ratio 1 wheat = 1 computer, they specialize completely. Calculate the gains from trade for each country.",
          "step_by_step": [
            {
              "step": "Calculate Opportunity Costs",
              "explanation": "Determine comparative advantage from PPF endpoints",
              "calculation": "A: $OC_{wheat} = \\frac{50}{100} = 0.5$ computers, $OC_{computers} = \\frac{100}{50} = 2.0$ wheat | B: $OC_{wheat} = \\frac{100}{50} = 2.0$ computers, $OC_{computers} = \\frac{50}{100} = 0.5$ wheat"
            },
            {
              "step": "Identify Comparative Advantage",
              "explanation": "Find which country has lower opportunity cost for each good",
              "calculation": "Wheat: A has $OC = 0.5$, B has $OC = 2.0$ → A has comparative advantage in wheat | Computers: B has $OC = 0.5$, A has $OC = 2.0$ → B has comparative advantage in computers"
            },
            {
              "step": "Determine Specialization Pattern",
              "explanation": "Each country completely specializes in comparative advantage good",
              "calculation": "A produces 100 wheat, 0 computers | B produces 0 wheat, 100 computers"
            },
            {
              "step": "Calculate Post-Trade Consumption",
              "explanation": "Determine consumption after trade at 1:1 price ratio",
              "calculation": "Assume they trade 50 wheat for 50 computers: A consumes 50 wheat, 50 computers | B consumes 50 wheat, 50 computers"
            },
            {
              "step": "Compare Autarky and Trade Consumption",
              "explanation": "Calculate gains from trade for each country",
              "calculation": "A: autarky (60,20) → trade (50,50), gain 30 computers (same wheat) | B: autarky (20,60) → trade (50,50), gain 30 wheat (same computers)"
            }
          ],
          "final_answer": "Country A has comparative advantage in wheat (OC = 0.5 computers vs B's 2.0), while Country B has comparative advantage in computers (OC = 0.5 wheat vs A's 2.0). With complete specialization and trade at 1 wheat = 1 computer, both countries gain 30 units of their imported good while maintaining similar quantities of their exported good. This demonstrates how differences in opportunity costs create mutual gains from trade, allowing both countries to consume beyond their individual production possibilities.",
          "concept_applied": "Countries benefit from specializing in goods where they have comparative advantage (lower opportunity costs) and trading at intermediate price ratios, with gains measured by increased consumption possibilities beyond what could be achieved through domestic production alone",
          "image": {
            "url": "/images/economics/trade-gains-calculation.svg",
            "alt": "Trade gains calculation",
            "caption": "Quantifying the benefits of comparative advantage-based trade"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Law of Comparative Advantage",
          "statement": "Countries should specialize in producing and exporting goods where they have lower opportunity costs (comparative advantage) and import goods where they have higher opportunity costs, creating mutual gains from trade even if one country has absolute advantage in all goods",
          "application": "Explains why countries trade and the pattern of specialization in the global economy, demonstrating that trade benefits all participants through more efficient global resource allocation based on relative rather than absolute efficiency",
          "example": "A brilliant surgeon who is also an excellent secretary should still hire a secretary and focus on surgery, because the opportunity cost of the surgeon's time spent on secretarial work is the high-value surgical procedures forgone",
          "analogy": "Like a family where one parent is better at both cooking and cleaning than the other—they still benefit from dividing tasks based on comparative advantage rather than absolute ability",
          "image": {
            "url": "/images/economics/comparative-advantage-law.svg",
            "alt": "Law of comparative advantage",
            "caption": "The fundamental principle governing international trade patterns"
          }
        }
      ]
    },
    {
      "section_title": "Gains from Trade and Consumption Possibilities",
      "introduction": "The fundamental benefit of comparative advantage-based trade is that it enables countries to consume combinations of goods that lie outside their domestic production possibilities frontiers. By specializing according to comparative advantage and trading at world prices, countries can achieve higher living standards than would be possible through self-sufficiency.",
      "key_concept": {
        "definition": "The gains from trade represent the increase in consumption possibilities and economic welfare that countries achieve through international exchange based on comparative advantage, measured by the outward shift of the consumption possibilities frontier beyond the production possibilities frontier",
        "context": "Gains from trade arise when countries specialize according to comparative advantage and trade at price ratios between their autarky opportunity costs, enabling consumption bundles that would be unattainable through domestic production alone",
        "image": {
          "url": "/images/economics/consumption-possibilities-trade.svg",
          "alt": "Consumption possibilities beyond PPF",
          "caption": "How comparative advantage-based trade expands consumption possibilities"
        }
      },
      "classifications": [
        {
          "type": "Consumption Possibilities Frontier",
          "value": "The consumption combinations achievable through trade",
          "characteristics": ["Slope equals terms of trade $\\frac{P_X}{P_Y}$", "Lies outside domestic PPF when $P_{world} \\neq P_{autarky}$", "Represents budget constraint in open economy", "$C_X = Q_X + \\frac{P_Y}{P_X}(Q_Y - C_Y)$", "Tangent to PPF at production point"],
          "behavior": "With trade at world prices, a country's consumption possibilities exceed its production possibilities, creating the potential for higher welfare through international exchange based on comparative advantage",
          "examples": [
            {
              "process": "CPF Construction",
              "explanation": "If a country produces at point $(Q_X, Q_Y)$ on its PPF and faces world price ratio $\\frac{P_X}{P_Y}$, its consumption possibilities are $C_Y = Q_Y + \\frac{P_X}{P_Y}(Q_X - C_X)$, a straight line through the production point",
              "image": {
                "url": "/images/economics/cpf-construction.svg",
                "alt": "Consumption possibilities construction",
                "caption": "Deriving consumption possibilities from production and trade"
              }
            },
            {
              "process": "Small Country Case",
              "explanation": "A small country takes world prices as given, making its CPF a straight line tangent to its PPF, allowing complete separation of production and consumption decisions",
              "image": {
                "url": "/images/economics/small-country-cpf.svg",
                "alt": "Small country consumption possibilities",
                "caption": "Price-taking behavior in international markets"
              }
            },
            {
              "process": "Large Country Case",
              "explanation": "A large country's trade affects world prices, making its CPF curved as terms of trade change with trade volume, but it still lies outside the PPF for beneficial trade",
              "image": {
                "url": "/images/economics/large-country-cpf.svg",
                "alt": "Large country consumption possibilities",
                "caption": "Terms of trade effects for large economies"
              }
            }
          ]
        },
        {
          "type": "Sources of Trade Gains",
          "value": "Economic mechanisms creating benefits from comparative advantage",
          "characteristics": ["Production efficiency gains from specialization", "Consumption efficiency gains from expanded choice", "Economies of scale in larger markets", "Increased product variety", "Knowledge and technology spillovers"],
          "behavior": "Comparative advantage-based trade creates gains through multiple channels: static gains from better resource allocation, and dynamic gains from larger markets, competition, and knowledge diffusion",
          "examples": [
            {
              "process": "Static Efficiency Gains",
              "explanation": "The immediate improvement from reallocating resources to comparative advantage sectors, measured by movement to a higher indifference curve on the CPF",
              "image": {
                "url": "/images/economics/static-efficiency-gains.svg",
                "alt": "Static efficiency gains",
                "caption": "Immediate welfare improvement from trade"
              }
            },
            {
              "process": "Economies of Scale",
              "explanation": "Access to larger world markets allows firms to produce at more efficient scale, reducing average costs through learning and specialization based on comparative advantage",
              "image": {
                "url": "/images/economics/scale-economies-trade.svg",
                "alt": "Economies of scale in trade",
                "caption": "Cost reductions from larger market size"
              }
            },
            {
              "process": "Product Variety Benefits",
              "explanation": "Trade increases consumer choice and product diversity, creating gains that may exceed those from price reductions when countries specialize in different varieties",
              "image": {
                "url": "/images/economics/variety-gains-trade.svg",
                "alt": "Product variety gains",
                "caption": "Welfare benefits from expanded consumer choice"
              }
            }
          ]
        },
        {
          "type": "Measuring Trade Gains",
          "value": "Quantifying the benefits of comparative advantage-based exchange",
          "characteristics": ["Equivalent variation measures", "Consumer and producer surplus changes", "Real income increases", "Terms of trade improvements", "Welfare triangle calculations"],
          "behavior": "The gains from comparative advantage-based trade can be measured by increases in economic welfare, typically quantified using equivalent variation or changes in consumer and producer surplus",
          "examples": [
            {
              "process": "Equivalent Variation Calculation",
              "explanation": "The monetary compensation that would make consumers as well off without trade as they are with trade: $EV = e(p^0, U^1) - e(p^0, U^0)$ where $p^0$ are autarky prices",
              "image": {
                "url": "/images/economics/equivalent-variation.svg",
                "alt": "Equivalent variation measure",
                "caption": "Monetary measure of trade-induced welfare changes"
              }
            },
            {
              "process": "Surplus Analysis",
              "explanation": "For a small price-taking country, gains from trade equal sum of consumer and producer surplus changes: $\\Delta W = \\Delta CS + \\Delta PS$",
              "image": {
                "url": "/images/economics/surplus-analysis-trade.svg",
                "alt": "Surplus analysis of trade gains",
                "caption": "Measuring trade benefits through surplus changes"
              }
            },
            {
              "process": "Real Income Measures",
              "explanation": "The increase in real GDP or real consumption per capita attributable to comparative advantage-based trade, estimated through empirical studies",
              "image": {
                "url": "/images/economics/real-income-gains-trade.svg",
                "alt": "Real income gains from trade",
                "caption": "Measuring trade benefits through income increases"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Quantifying Gains from Comparative Advantage Trade",
          "problem": "Country has PPF: $Q_Y = 100 - Q_X$ (linear). In autarky, it produces and consumes at (40, 60) where $MRS = MRT = 1$. With trade, world price ratio $\\frac{P_X}{P_Y} = 2$. The country specializes to produce at (100, 0) on PPF. Calculate the gains from trade using equivalent variation, assuming utility function $U = X^{0.5}Y^{0.5}$.",
          "step_by_step": [
            {
              "step": "Find Autarky Utility",
              "explanation": "Calculate utility level before trade",
              "calculation": "$U_{autarky} = 40^{0.5} \\times 60^{0.5} = \\sqrt{2400} = 48.99$"
            },
            {
              "step": "Determine Consumption with Trade",
              "explanation": "Find optimal consumption given production and world prices",
              "calculation": "Production: (100, 0) valued at prices (2,1) gives income $I = 2\\times100 + 1\\times0 = 200$ | With Cobb-Douglas $U=X^{0.5}Y^{0.5}$ and prices (2,1), optimal consumption: $X = 0.5\\frac{200}{2} = 50$, $Y = 0.5\\frac{200}{1} = 100$"
            },
            {
              "step": "Calculate Trade Utility",
              "explanation": "Find utility level with trade",
              "calculation": "$U_{trade} = 50^{0.5} \\times 100^{0.5} = \\sqrt{5000} = 70.71$"
            },
            {
              "step": "Calculate Equivalent Variation",
              "explanation": "Find income needed at autarky prices to achieve trade utility",
              "calculation": "At autarky prices (1,1), to achieve $U=70.71$ with Cobb-Douglas: $X = Y = 70.71$ | Income needed = $70.71 + 70.71 = 141.42$ | Original income at autarky prices = $40 + 60 = 100$ | $EV = 141.42 - 100 = 41.42$"
            }
          ],
          "final_answer": "The country gains significantly from trade based on its comparative advantage in good X. Utility increases from 48.99 to 70.71, and the equivalent variation is 41.42, meaning the country would need 41.42 additional units of income at autarky prices to be as well off without trade as it is with trade. This demonstrates substantial gains from specializing according to comparative advantage and trading at favorable world prices.",
          "concept_applied": "Comparative advantage-based trade creates measurable welfare gains through specialization and exchange at world prices different from autarky prices, with gains quantified using equivalent variation to measure the income equivalent of utility improvements",
          "image": {
            "url": "/images/economics/trade-gains-quantification.svg",
            "alt": "Trade gains quantification",
            "caption": "Measuring the welfare benefits of comparative advantage trade"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Gains from Trade Theorem",
          "statement": "Any voluntary exchange between countries based on comparative advantage creates potential Pareto improvements—the winners could theoretically compensate the losers and still be better off—with the size of gains determined by the difference between autarky prices and world prices and the extent of comparative advantage differences",
          "application": "Provides the theoretical foundation for trade liberalization and explains why removing trade barriers typically increases aggregate welfare when countries specialize according to comparative advantage, though distributional effects may require compensation mechanisms",
          "example": "When a country removes textile tariffs, consumers benefit from lower prices while domestic textile workers may lose jobs, but the consumer gains exceed producer losses, creating potential for compensation while maintaining net benefits",
          "analogy": "Like a potluck dinner where everyone brings their best dish—the total variety and quality exceed what any individual could produce alone, and everyone can sample dishes they couldn't make themselves",
          "image": {
            "url": "/images/economics/gains-theorem.svg",
            "alt": "Gains from trade theorem",
            "caption": "Theoretical foundation for mutual benefits from exchange"
          }
        }
      ]
    },
    {
      "section_title": "Comparative Advantage in the Real World",
      "introduction": "While the theory of comparative advantage provides the fundamental logic for trade, real-world trade patterns are influenced by additional factors including economies of scale, product differentiation, transportation costs, and government policies. Understanding these complexities helps explain actual trade flows and the ongoing debate over trade policy.",
      "key_concept": {
        "definition": "Real-world comparative advantage is shaped by factor endowments (Heckscher-Ohlin model), technology differences (Ricardian model), economies of scale, product differentiation, and institutional factors, with modern trade characterized by both inter-industry trade based on comparative advantage and intra-industry trade based on scale and variety",
        "context": "Comparative advantage evolves over time through technological change, factor accumulation, and institutional development, with countries potentially developing new advantages or strengthening existing ones through targeted investments and policies",
        "image": {
          "url": "/images/economics/real-world-comparative.svg",
          "alt": "Comparative advantage in real world",
          "caption": "Complex factors shaping actual comparative advantage patterns"
        }
      },
      "classifications": [
        {
          "type": "Heckscher-Ohlin Model",
          "value": "Factor endowment-based comparative advantage",
          "characteristics": ["Comparative advantage from factor abundance", "Factor price equalization tendency", "Stolper-Samuelson distributional effects", "Rybczyński theorem on growth effects", "Two factors: labor and capital"],
          "behavior": "Countries have comparative advantage in goods that intensively use their abundant factors—labor-abundant countries in labor-intensive goods, capital-abundant countries in capital-intensive goods",
          "examples": [
            {
              "process": "Factor Abundance Theory",
              "explanation": "China exports labor-intensive manufactures because it's labor-abundant, while Germany exports capital-intensive machinery because it's capital-abundant",
              "image": {
                "url": "/images/economics/factor-abundance.svg",
                "alt": "Factor abundance theory",
                "caption": "Comparative advantage from factor endowments"
              }
            },
            {
              "process": "Stolper-Samuelson Theorem",
              "explanation": "Trade benefits the abundant factor and harms the scarce factor: in labor-abundant country, $\\frac{\\Delta w}{w} > \\frac{\\Delta P}{P} > \\frac{\\Delta r}{r}$",
              "image": {
                "url": "/images/economics/stolper-samuelson.svg",
                "alt": "Stolper-Samuelson effects",
                "caption": "Distributional effects of factor-based trade"
              }
            },
            {
              "process": "Leontief Paradox",
              "explanation": "Empirical finding that US exported labor-intensive goods despite being capital-abundant, challenging simple Heckscher-Ohlin predictions and suggesting role of human capital and technology",
              "image": {
                "url": "/images/economics/leontief-paradox.svg",
                "alt": "Leontief paradox",
                "caption": "Empirical challenge to factor proportions theory"
              }
            }
          ]
        },
        {
          "type": "Modern Trade Theories",
          "value": "Extensions beyond classical comparative advantage",
          "characteristics": ["Intra-industry trade models", "Monopolistic competition", "Economies of scale", "Product differentiation", "Firm heterogeneity"],
          "behavior": "Modern theories explain why similar countries trade similar goods (intra-industry trade) and how firm-level differences affect trade patterns, complementing rather than replacing comparative advantage explanations",
          "examples": [
            {
              "process": "Intra-Industry Trade",
              "explanation": "Germany and France both export and import automobiles, reflecting product differentiation and consumer preference for variety rather than comparative advantage differences",
              "image": {
                "url": "/images/economics/intra-industry-trade.svg",
                "alt": "Intra-industry trade",
                "caption": "Two-way trade in similar product categories"
              }
            },
            {
              "process": "Monopolistic Competition Model",
              "explanation": "Krugman model shows how trade between similar countries benefits consumers through increased product variety and firms through scale economies",
              "image": {
                "url": "/images/economics/monopolistic-competition.svg",
                "alt": "Monopolistic competition trade",
                "caption": "Trade driven by product differentiation"
              }
            },
            {
              "process": "Firm Heterogeneity",
              "explanation": "Melitz model explains why only most productive firms export, as trade exposes firms to competition and fixed export costs create selection effects",
              "image": {
                "url": "/images/economics/firm-heterogeneity.svg",
                "alt": "Firm heterogeneity in trade",
                "caption": "How firm-level differences affect trade"
              }
            }
          ]
        },
        {
          "type": "Dynamic Comparative Advantage",
          "value": "Evolution of comparative advantage over time",
          "characteristics": ["Technology and learning effects", "Human capital accumulation", "Industrial policy effects", "Path dependence", "Product cycle patterns"],
          "behavior": "Comparative advantage evolves through technological progress, factor accumulation, and deliberate policy interventions, with countries potentially developing new advantages in sophisticated products over time",
          "examples": [
            {
              "process": "Product Cycle Model",
              "explanation": "New products invented in advanced countries, then production shifts to developing countries as technology standardizes, changing comparative advantage patterns",
              "image": {
                "url": "/images/economics/product-cycle.svg",
                "alt": "Product cycle model",
                "caption": "Evolution of comparative advantage over product life"
              }
            },
            {
              "process": "East Asian Development",
              "explanation": "South Korea transformed comparative advantage from basic textiles to electronics through education, industrial policy, and technology acquisition",
              "image": {
                "url": "/images/economics/east-asian-development.svg",
                "alt": "East Asian development pattern",
                "caption": "Deliberate development of comparative advantage"
              }
            },
            {
              "process": "Learning by Doing",
              "explanation": "Temporary protection of infant industries can create comparative advantage through learning effects and scale economies that wouldn't occur with immediate trade liberalization",
              "image": {
                "url": "/images/economics/learning-by-doing.svg",
                "alt": "Learning by doing effects",
                "caption": "How experience creates comparative advantage"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Analyzing Heckscher-Ohlin Comparative Advantage",
          "problem": "Country A: 100 workers, 200 units capital. Country B: 200 workers, 100 units capital. Good X: production requires 2 labor + 1 capital per unit. Good Y: production requires 1 labor + 2 capital per unit. Identify comparative advantage pattern and predict trade flow direction.",
          "step_by_step": [
            {
              "step": "Calculate Factor Abundance",
              "explanation": "Determine which factors are relatively abundant",
              "calculation": "A: $\\frac{K}{L} = \\frac{200}{100} = 2.0$ | B: $\\frac{K}{L} = \\frac{100}{200} = 0.5$ | A is capital-abundant, B is labor-abundant"
            },
            {
              "step": "Identify Factor Intensity",
              "explanation": "Determine which goods are capital or labor intensive",
              "calculation": "X: $\\frac{K}{L} = \\frac{1}{2} = 0.5$ (labor-intensive) | Y: $\\frac{K}{L} = \\frac{2}{1} = 2.0$ (capital-intensive)"
            },
            {
              "step": "Predict Comparative Advantage",
              "explanation": "Apply Heckscher-Ohlin theorem",
              "calculation": "A (capital-abundant) has comparative advantage in Y (capital-intensive) | B (labor-abundant) has comparative advantage in X (labor-intensive)"
            },
            {
              "step": "Predict Trade Pattern",
              "explanation": "Determine direction of trade flows",
              "calculation": "A will export Y, import X | B will export X, import Y"
            }
          ],
          "final_answer": "Country A is capital-abundant (K/L=2.0) and has comparative advantage in good Y, which is capital-intensive (K/L=2.0). Country B is labor-abundant (K/L=0.5) and has comparative advantage in good X, which is labor-intensive (K/L=0.5). According to the Heckscher-Ohlin theorem, Country A will export good Y and import good X, while Country B will export good X and import good Y. This demonstrates how factor endowments determine comparative advantage patterns in the Heckscher-Ohlin model.",
          "concept_applied": "The Heckscher-Ohlin theorem states that countries have comparative advantage in goods that intensively use their abundant factors, with capital-abundant countries exporting capital-intensive goods and labor-abundant countries exporting labor-intensive goods",
          "image": {
            "url": "/images/economics/heckscher-ohlin-analysis.svg",
            "alt": "Heckscher-Ohlin analysis",
            "caption": "Factor endowment-based comparative advantage prediction"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Heckscher-Ohlin Theorem",
          "statement": "Countries have comparative advantage in goods that intensively use their relatively abundant factors of production, with trade patterns determined by differences in factor endowments rather than technology differences",
          "application": "Explains why labor-abundant countries tend to export labor-intensive goods while capital-abundant countries export capital-intensive goods, and predicts that trade will tend to equalize factor prices across countries",
          "example": "Bangladesh exports garments (labor-intensive) while Germany exports machinery (capital-intensive), reflecting their different factor endowments rather than technology differences",
          "analogy": "Like two chefs with different kitchen equipment—one with many assistants (labor) specializes in complex preparations, while one with advanced equipment (capital) specializes in technically demanding dishes",
          "image": {
            "url": "/images/economics/heckscher-ohlin-theorem.svg",
            "alt": "Heckscher-Ohlin theorem",
            "caption": "Factor proportions theory of comparative advantage"
          }
        }
      ]
    }
  ],
  "key_terms": [
    "Comparative Advantage",
    "Opportunity Cost",
    "Production Possibilities Frontier",
    "Autarky",
    "Terms of Trade",
    "Specialization",
    "Gains from Trade",
    "Consumption Possibilities Frontier",
    "Ricardian Model",
    "Heckscher-Ohlin Model",
    "Factor Endowments",
    "Factor Intensity",
    "Stolper-Samuelson Theorem",
    "Intra-Industry Trade",
    "Product Differentiation",
    "Economies of Scale",
    "Monopolistic Competition",
    "Firm Heterogeneity",
    "Dynamic Comparative Advantage",
    "Product Cycle",
    "Learning by Doing",
    "Infant Industry Argument",
    "Trade Liberalization",
    "Welfare Gains",
    "Equivalent Variation",
    "Marginal Rate of Transformation",
    "Marginal Rate of Substitution",
    "Absolute Advantage",
    "Relative Productivity",
    "Factor Price Equalization"
  ],
  "summary": "Comparative advantage, based on opportunity cost differences rather than absolute productivity differences, provides the fundamental explanation for why countries benefit from international trade. The principle states that countries should specialize in producing goods where they have lower opportunity costs and trade for other goods, enabling consumption beyond domestic production possibilities. While the Ricardian model emphasizes technology differences and the Heckscher-Ohlin model focuses on factor endowments, both demonstrate that trade based on comparative advantage creates mutual gains. Modern trade theory incorporates economies of scale, product differentiation, and firm heterogeneity, explaining intra-industry trade between similar countries. Comparative advantage evolves over time through technological progress, factor accumulation, and learning effects, with countries potentially developing new advantages through education, infrastructure, and industrial policies. Understanding comparative advantage provides the foundation for analyzing trade patterns, evaluating trade policies, and recognizing the potential for mutual gains from international exchange."
}
