{
  "expanded_description": "Opportunity cost on the Production Possibilities Frontier is the amount of one good that must be sacrificed to produce an additional unit of another good. The PPF makes opportunity cost visible and measurable through its slope, allowing precise calculation of trade-offs at different production levels.",
  "core_concept": {
    "principle": "On the PPF, opportunity cost is measured by the slope of the frontier—the rate at which one good must be given up to produce more of another. It equals the absolute value of the change in one good divided by the change in the other good (ΔY/ΔX). For bowed-outward PPFs, opportunity cost increases as production shifts toward one good because resources are increasingly less suited to that use. Calculating opportunity cost from the PPF reveals the true economic cost of production decisions.",
    "explanation": "Opportunity cost is perhaps the most fundamental concept in economics, and the PPF provides a powerful tool for understanding and calculating it. When an economy moves along its PPF—say, producing more computers and less wheat—the opportunity cost of additional computers is the wheat that must be sacrificed. This isn't just a theoretical concept; it's measurable from the PPF. If moving from point A to point B means gaining 50 computers while losing 100 tons of wheat, the opportunity cost is 100 wheat ÷ 50 computers = 2 tons of wheat per computer. The PPF's slope at any point represents the opportunity cost at that production level—how much of the y-axis good must be sacrificed to gain one more unit of the x-axis good. For linear PPFs, slope is constant, so opportunity cost doesn't change. For bowed-outward PPFs, slope gets steeper as you move right (or flatter as you move up), reflecting increasing opportunity costs. Understanding how to calculate opportunity cost from the PPF is essential because it reveals the true cost of economic decisions. The price tag on a computer might be \\$1,000, but the opportunity cost might be the 2 tons of wheat (worth \\$600) that could have been produced instead with those same resources. Monetary prices don't always reflect opportunity costs accurately, especially when markets are distorted or resources are not priced. The PPF cuts through price distortions to reveal real resource trade-offs. Opportunity cost calculation also varies depending on which direction you're moving. Moving from wheat to computers has a different opportunity cost than moving from computers to wheat (though they're reciprocals). It's crucial to identify correctly: What are we gaining? What are we sacrificing? This determines which quantity goes in the numerator and denominator. Finally, opportunity cost on a bowed PPF changes continuously along the frontier. The cost of the first computer might be 1 ton of wheat, the 50th computer might cost 2 tons, the 100th might cost 4 tons. Understanding this pattern of increasing costs explains why complete specialization (producing only one good) is often inefficient—marginal costs eventually exceed marginal benefits.",
    "image": {
      "src": "images/unit2/opportunity_cost_ppf.png",
      "alt": "PPF showing movement between two points with arrows indicating gains and losses, illustrating opportunity cost calculation",
      "caption": "Opportunity cost measured by PPF slope: amount of one good sacrificed (vertical change) per unit of other good gained (horizontal change)"
    }
  },
  "sections": [
    {
      "section_title": "Calculating Opportunity Cost from the PPF",
      "introduction": "Opportunity cost is quantified by measuring changes in production quantities when moving along the PPF. The calculation reveals the precise trade-off ratio between goods.",
      "key_concept": {
        "definition": "Opportunity cost on the PPF is calculated as: (Change in Good Sacrificed) ÷ (Change in Good Gained). This equals the absolute value of the slope between two points. It measures how many units of one good must be given up to produce one additional unit of the other good.",
        "context": "Opportunity cost is always expressed as a ratio: units of one good per unit of another good. The calculation requires identifying what's being gained (increase in production) and what's being sacrificed (decrease in production), then computing the ratio. The direction of movement along the PPF determines which good is being gained and which sacrificed."
      },
      "principles": [
        {
          "principle": "Opportunity Cost = Amount Sacrificed ÷ Amount Gained",
          "statement": "To find opportunity cost of producing more of good X, divide the decrease in good Y by the increase in good X. This gives units of Y per unit of X—the cost of X in terms of Y foregone.",
          "application": "Always identify clearly what's being gained and what's being sacrificed before calculating the ratio.",
          "example": "Moving from point A (100 computers, 500 wheat) to point B (150 computers, 400 wheat): Gain: 150 - 100 = 50 computers (what we're getting). Sacrifice: 500 - 400 = 100 wheat (what we're giving up). Opportunity cost of computers = 100 wheat ÷ 50 computers = 2 wheat per computer. Each additional computer costs 2 tons of wheat."
        },
        {
          "principle": "Opportunity Cost Depends on Direction of Movement",
          "statement": "The opportunity cost of good X in terms of good Y is different from the opportunity cost of good Y in terms of good X (though they're reciprocals). Always specify which good's cost you're calculating.",
          "application": "When asked for opportunity cost, identify the good being produced more and express cost in terms of the other good.",
          "example": "Same movement A to B above: Opportunity cost of computers = 2 wheat per computer. Opportunity cost of wheat (if moving from B to A) = 50 computers ÷ 100 wheat = 0.5 computers per wheat. These are reciprocals: 1/2 = 0.5. Same movement, different perspective."
        },
        {
          "principle": "PPF Slope Equals Opportunity Cost",
          "statement": "The absolute value of the slope between two points on the PPF equals the opportunity cost. Slope = ΔY/ΔX (rise over run), representing how much Y changes per unit change in X.",
          "application": "Can calculate opportunity cost using slope formula from algebra: |slope| = |ΔY/ΔX|.",
          "example": "Points A (100, 500) and B (150, 400): Slope = (400 - 500)/(150 - 100) = -100/50 = -2. Absolute value = 2. Interpretation: For every 1 computer gained (moving right), lose 2 wheat (moving down). Slope magnitude equals opportunity cost."
        },
        {
          "principle": "Increasing Opportunity Cost Means Changing Slope",
          "statement": "On bowed-outward PPF, slope becomes steeper (in absolute value) as you move right along the curve. This represents increasing opportunity cost of the x-axis good.",
          "application": "Calculate opportunity cost at different points to see how it changes. Early units have lower cost than later units.",
          "example": "First 50 computers: slope = -1 (cost = 1 wheat per computer). Next 50 computers: slope = -2 (cost = 2 wheat per computer). Next 50 computers: slope = -4 (cost = 4 wheat per computer). Slope steepens, opportunity cost rises—each additional computer costs progressively more wheat."
        }
      ],
      "worked_examples": [
        {
          "title": "Basic Opportunity Cost Calculation",
          "problem": "A country's PPF shows production of cars and trucks. Point A: 1,000 cars, 400 trucks. Point B: 1,200 cars, 300 trucks. Point C: 1,500 cars, 100 trucks. Calculate: (a) Opportunity cost of cars moving from A to B. (b) Opportunity cost of cars moving from B to C. (c) Opportunity cost of trucks moving from C to B. (d) Is this PPF bowed outward?",
          "step_by_step": [
            {
              "step": "Part (a): Opportunity cost A to B",
              "explanation": "Movement: A (1,000 cars, 400 trucks) → B (1,200 cars, 300 trucks). Gain: 1,200 - 1,000 = 200 cars. Sacrifice: 400 - 300 = 100 trucks. Opportunity cost of cars = 100 trucks ÷ 200 cars = 0.5 trucks per car. Each additional car costs half a truck (or 2 cars cost 1 truck)."
            },
            {
              "step": "Part (b): Opportunity cost B to C",
              "explanation": "Movement: B (1,200 cars, 300 trucks) → C (1,500 cars, 100 trucks). Gain: 1,500 - 1,200 = 300 cars. Sacrifice: 300 - 100 = 200 trucks. Opportunity cost of cars = 200 trucks ÷ 300 cars = 0.67 trucks per car (or about 2/3 truck per car)."
            },
            {
              "step": "Part (c): Opportunity cost of trucks C to B",
              "explanation": "Movement: C (1,500 cars, 100 trucks) → B (1,200 cars, 300 trucks). Gain: 300 - 100 = 200 trucks. Sacrifice: 1,500 - 1,200 = 300 cars. Opportunity cost of trucks = 300 cars ÷ 200 trucks = 1.5 cars per truck. Each additional truck costs 1.5 cars."
            },
            {
              "step": "Part (d): Check for increasing opportunity cost",
              "explanation": "Compare opportunity cost of cars at different levels: A to B: 0.5 trucks per car. B to C: 0.67 trucks per car. Cost increased from 0.5 to 0.67 as car production expanded. This is increasing opportunity cost. Yes, PPF is bowed outward—opportunity cost of cars rises as more cars are produced."
            },
            {
              "step": "Verify relationship",
              "explanation": "Check that costs are reciprocals: Car cost (B to C): 0.67 trucks per car. Truck cost (C to B): 1.5 cars per truck. Reciprocal: 1 ÷ 0.67 = 1.5 ✓. 1 ÷ 1.5 = 0.67 ✓. Reciprocal relationship confirmed."
            }
          ],
          "final_answer": "(a) Opportunity cost of cars (A to B) = 0.5 trucks per car. (b) Opportunity cost of cars (B to C) = 0.67 trucks per car. (c) Opportunity cost of trucks (C to B) = 1.5 cars per truck. (d) Yes, PPF is bowed outward—opportunity cost of cars increases from 0.5 to 0.67 as production expands, indicating specialized resources and increasing marginal costs.",
          "concept_applied": "Opportunity cost is calculated as sacrifice ÷ gain. It changes along a bowed PPF, increasing as production of one good expands. The reciprocal relationship between costs (car cost in trucks vs. truck cost in cars) reflects that the same movement can be viewed from different perspectives. Increasing costs indicate resource specialization."
        },
        {
          "title": "Detailed Opportunity Cost Analysis",
          "problem": "An economy produces wheat and cloth with the following PPF points: Point A: 0 wheat, 100 cloth. Point B: 100 wheat, 90 cloth. Point C: 200 wheat, 70 cloth. Point D: 300 wheat, 40 cloth. Point E: 400 wheat, 0 cloth. (a) Calculate opportunity cost of wheat for each segment. (b) Calculate opportunity cost of the first 100 units of wheat. (c) Calculate opportunity cost of the last 100 units of wheat. (d) Explain why costs differ.",
          "step_by_step": [
            {
              "step": "Part (a): Calculate costs for each segment",
              "explanation": "Segment A to B (first 100 wheat): Gain: 100 - 0 = 100 wheat. Sacrifice: 100 - 90 = 10 cloth. Cost: 10 cloth ÷ 100 wheat = 0.1 cloth per wheat. Segment B to C (second 100 wheat): Gain: 200 - 100 = 100 wheat. Sacrifice: 90 - 70 = 20 cloth. Cost: 20 ÷ 100 = 0.2 cloth per wheat. Segment C to D (third 100 wheat): Gain: 300 - 200 = 100 wheat. Sacrifice: 70 - 40 = 30 cloth. Cost: 30 ÷ 100 = 0.3 cloth per wheat. Segment D to E (fourth 100 wheat): Gain: 400 - 300 = 100 wheat. Sacrifice: 40 - 0 = 40 cloth. Cost: 40 ÷ 100 = 0.4 cloth per wheat."
            },
            {
              "step": "Part (b): First 100 wheat",
              "explanation": "Segment A to B: Opportunity cost = 0.1 cloth per wheat (from step 1). Or total: 10 cloth for 100 wheat. This is the lowest cost—initial wheat production uses resources best suited to wheat (probably land ideal for farming, workers skilled at agriculture)."
            },
            {
              "step": "Part (c): Last 100 wheat",
              "explanation": "Segment D to E: Opportunity cost = 0.4 cloth per wheat (from step 1). Or total: 40 cloth for 100 wheat. This is the highest cost—quadruple the initial cost. Final wheat production requires using resources best suited to cloth production (looms, textile workers) for farming instead—very inefficient."
            },
            {
              "step": "Part (d): Explain increasing costs",
              "explanation": "Pattern: Costs increase with each segment: 0.1 → 0.2 → 0.3 → 0.4 cloth per wheat. Why: Resources are specialized. Best wheat land used first (segment A-B): High wheat productivity, low cloth productivity → low cloth sacrifice. Progressively less-suitable land for wheat (segments B-C, C-D): Lower wheat productivity, higher cloth productivity if used for cloth → more cloth sacrificed. Worst wheat land (segment D-E): Very low wheat productivity, high cloth productivity → maximum cloth sacrifice. Law of increasing opportunity cost in action."
            },
            {
              "step": "Verify the pattern",
              "explanation": "Each 100 wheat produced costs progressively more: 1st hundred: 10 cloth. 2nd hundred: 20 cloth (double). 3rd hundred: 30 cloth (triple original). 4th hundred: 40 cloth (quadruple). Total cloth sacrificed for 400 wheat: 10 + 20 + 30 + 40 = 100 cloth. Pattern clearly demonstrates increasing opportunity costs from resource specialization."
            }
          ],
          "final_answer": "(a) Opportunity costs by segment: A-B: 0.1, B-C: 0.2, C-D: 0.3, D-E: 0.4 cloth per wheat. (b) First 100 wheat cost 10 cloth (0.1 per wheat)—lowest cost using best wheat resources. (c) Last 100 wheat cost 40 cloth (0.4 per wheat)—highest cost using resources poorly suited to wheat. (d) Costs increase because resources are specialized: best wheat resources used first (low cost), progressively less-suitable resources used as production expands (high cost). This is the law of increasing opportunity cost.",
          "concept_applied": "Opportunity cost calculation reveals the law of increasing opportunity costs on bowed PPF. Each successive unit of production costs more because resources are heterogeneous—better suited to some uses than others. Initial production uses best-suited resources (low cost); continued expansion requires less-suited resources (high cost). The magnitude of cost increase (quadrupling from 0.1 to 0.4) shows how dramatically efficiency declines with resource specialization."
        },
        {
          "title": "Marginal vs. Average Opportunity Cost",
          "problem": "Using the PPF from the previous problem (wheat and cloth), suppose the economy is initially at point A (0 wheat, 100 cloth) and moves to point D (300 wheat, 40 cloth). Calculate: (a) Average opportunity cost of wheat for this movement. (b) Marginal opportunity cost for each 100-wheat segment. (c) Why do they differ?",
          "step_by_step": [
            {
              "step": "Part (a): Average opportunity cost A to D",
              "explanation": "Movement: A (0, 100) → D (300, 40). Total gain: 300 wheat. Total sacrifice: 100 - 40 = 60 cloth. Average opportunity cost: 60 cloth ÷ 300 wheat = 0.2 cloth per wheat. This is the average across all 300 wheat produced."
            },
            {
              "step": "Part (b): Marginal costs for each segment",
              "explanation": "From previous problem: 1st 100 wheat (A to B): Marginal cost = 0.1 cloth per wheat. 2nd 100 wheat (B to C): Marginal cost = 0.2 cloth per wheat. 3rd 100 wheat (C to D): Marginal cost = 0.3 cloth per wheat. Marginal cost = cost of producing each additional 100-unit batch."
            },
            {
              "step": "Part (c): Compare average and marginal",
              "explanation": "Average cost (0.2) is between the three marginal costs (0.1, 0.2, 0.3). This makes sense: Average = (10 + 20 + 30) cloth ÷ 300 wheat = 60 ÷ 300 = 0.2. Marginal costs vary: Low initially (0.1), high later (0.3). Average is weighted mean. Key difference: Marginal cost shows cost of each additional unit. Average cost shows cost per unit across all units. On bowed PPF with increasing costs, marginal exceeds average for later units."
            },
            {
              "step": "Explain economic significance",
              "explanation": "Average cost tells us: Overall resource trade-off for producing 300 wheat. Marginal cost tells us: Whether to produce one more unit of wheat. Decision rule: Compare marginal cost to marginal benefit. If marginal benefit of wheat > 0.3 cloth per wheat (current marginal cost), produce more. If marginal benefit < 0.3, produce less. Marginal analysis guides efficient decisions; average cost is retrospective summary."
            }
          ],
          "final_answer": "(a) Average opportunity cost = 0.2 cloth per wheat (60 cloth for 300 wheat). (b) Marginal costs: 0.1, 0.2, 0.3 cloth per wheat for successive 100-unit segments. (c) They differ because marginal cost varies along the PPF (increasing from 0.1 to 0.3) while average cost is the mean (0.2). Marginal cost is what matters for decisions (should we produce one more unit?), showing the cost right now. Average cost is historical summary of all units produced so far.",
          "concept_applied": "Marginal opportunity cost (cost of one more unit) differs from average opportunity cost (cost per unit on average). On bowed PPF, marginal cost increases while average is the mean. Economic decisions should use marginal analysis—compare marginal cost to marginal benefit—not average cost. This distinction is crucial for efficient resource allocation."
        }
      ],
      "image": {
        "src": "images/unit2/oc_calculation.png",
        "alt": "PPF with labeled points showing gains and sacrifices, with calculation of opportunity cost displayed",
        "caption": "Opportunity cost calculation: identify change in each good, divide sacrifice by gain to find cost ratio"
      }
    },
    {
      "section_title": "Increasing Opportunity Cost Along the PPF",
      "introduction": "Most PPFs exhibit increasing opportunity cost—the cost of additional units rises as production expands. This pattern reflects resource specialization and creates the bowed-outward PPF shape.",
      "key_concept": {
        "definition": "Increasing opportunity cost means the cost of producing additional units of a good rises as more of that good is produced. On the PPF, this manifests as the curve becoming steeper (for x-axis good) as you move right. It occurs because resources are specialized—better suited to some uses than others—so continued expansion requires using progressively less-suitable resources.",
        "context": "The law of increasing opportunity cost is one of the most important principles in economics. It explains: Why PPFs are bowed outward (not straight), Why complete specialization is usually inefficient, Why economies produce diverse mixes of goods rather than just one thing, Why marginal analysis is essential for efficient decisions. Understanding this pattern is crucial for analyzing production decisions and trade."
      },
      "categories": [
        {
          "type": "Why Opportunity Costs Increase",
          "description": "The fundamental reason for increasing costs is resource heterogeneity—resources are not equally productive in all uses.",
          "examples": [
            {
              "process": "Resource specialization (land)",
              "explanation": "Different land parcels have different characteristics making them more suitable for some uses than others. Example: Producing wheat and wine. Some land: Fertile soil, flat terrain, good water → excellent for wheat, poor for grapes (grapes prefer rocky, sloped terrain). Other land: Rocky hillsides, good drainage → excellent for grapes, poor for wheat. Shifting from all-wine to some wheat: Use flat, fertile land first (well-suited to wheat, wasn't great for grapes anyway) → low opportunity cost (little wine sacrificed). Continuing to expand wheat: Must use hillside land (poorly suited to wheat, was great for grapes) → high opportunity cost (much wine sacrificed)."
            },
            {
              "process": "Resource specialization (labor)",
              "explanation": "Workers have different skills, training, and comparative advantages. Example: Producing manufactured goods and services. Some workers: Strong engineering skills, manufacturing experience → high productivity in manufacturing, low in services. Other workers: Strong social skills, service experience → high productivity in services, low in manufacturing. Expanding manufacturing: Hire engineers first (low service opportunity cost). Continuing: Must hire service workers to do manufacturing (high service opportunity cost)."
            },
            {
              "process": "Resource specialization (capital)",
              "explanation": "Equipment and facilities are designed for specific purposes. Example: Looms make cloth efficiently but can't make much food. Tractors grow food efficiently but can't make much cloth. Reallocating capital between uses is costly or impossible. Expansion requires using less-suitable capital → increasing costs."
            },
            {
              "process": "Diminishing marginal returns",
              "explanation": "As one factor increases while others are fixed, marginal productivity eventually declines. Example: Fixed amount of farmland, increasing agricultural labor. First workers: High marginal productivity (lots of land per worker). Additional workers: Lower marginal productivity (crowding on limited land). Each additional farm worker produces less extra output → higher opportunity cost per unit produced."
            }
          ]
        },
        {
          "type": "Manifestations of Increasing Costs",
          "description": "How increasing opportunity costs appear in data and graphs.",
          "examples": [
            {
              "process": "Steepening PPF slope",
              "explanation": "As you move right along PPF (producing more of x-axis good), slope becomes steeper in absolute value. Example: Initial slope: -1 (1 y per x). Later slope: -2 (2 y per x). Final slope: -4 (4 y per x). Steeper slope = higher opportunity cost. Geometric manifestation of increasing costs."
            },
            {
              "process": "Rising marginal cost",
              "explanation": "Each successive unit costs more than the previous unit. Example: 1st unit: costs 1. 10th unit: costs 2. 100th unit: costs 5. Marginal cost increases with quantity. Later units are progressively more expensive in terms of alternatives foregone."
            },
            {
              "process": "Accelerating sacrifice rate",
              "explanation": "Equal increases in one good require progressively larger decreases in the other. Example: Increase x by 10: First time, lose 5 y. Second time, lose 10 y. Third time, lose 20 y. Same gain in x, but accelerating loss in y. Non-linear trade-off."
            },
            {
              "process": "Bowed-outward curvature",
              "explanation": "PPF curves away from origin rather than being straight. Visual indicator of increasing costs. Degree of bow indicates how rapidly costs increase. Slight bow: Gradually increasing costs. Severe bow: Rapidly increasing costs. Straight line: Constant costs (no bow)."
            }
          ]
        },
        {
          "type": "Implications of Increasing Opportunity Costs",
          "description": "Why this pattern matters for economic decision-making.",
          "examples": [
            {
              "process": "Complete specialization is inefficient",
              "explanation": "Due to increasing costs, producing only one good wastes resources. Example: Producing only wheat: Last units of wheat cost enormous amounts of cloth (using land terrible for wheat). Should instead: Stop wheat production before costs become extreme, produce some cloth using resources well-suited to it. Diversification is efficient when costs are increasing."
            },
            {
              "process": "Marginal analysis is essential",
              "explanation": "Because costs change with quantity, must evaluate each additional unit separately. Example: First 100 units of wheat: Cost 50 cloth (0.5 per wheat). Worth producing if wheat value > 0.5 cloth. Next 100 units: Cost 200 cloth (2 per wheat). Only worth producing if wheat value > 2 cloth. Can't use average cost—must use marginal cost for each decision."
            },
            {
              "process": "Optimal production is interior (mix of goods)",
              "explanation": "Most efficient point is usually somewhere between extremes, producing both goods. Example: PPF from 0 to 400 wheat. Don't produce 0 wheat (sacrificing high-value, low-cost wheat). Don't produce 400 wheat (last units extremely costly). Optimal: Maybe 250 wheat, balancing costs and benefits. Interior solution from increasing costs."
            },
            {
              "process": "Trade gains from specialization limits",
              "explanation": "Increasing costs limit how much countries should specialize even when they have comparative advantage. Example: Country A has comparative advantage in wheat. But increasing costs mean: Initial wheat expansion beneficial. Eventually marginal cost exceeds benefit even with advantage. Should specialize partially, not completely. Increasing costs moderate specialization predictions."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Analyzing Increasing Opportunity Costs",
          "problem": "A farmer can grow corn or soybeans on 100 acres. Production possibilities: All corn: 10,000 bushels corn, 0 soybeans. 75% corn: 8,000 corn, 1,500 soybeans. 50-50: 5,000 corn, 2,500 soybeans. 25% corn: 2,000 corn, 3,000 soybeans. All soybeans: 0 corn, 3,200 soybeans. (a) Calculate marginal opportunity cost of soybeans for each 25-acre shift. (b) Show that costs are increasing. (c) Explain why using land characteristics.",
          "step_by_step": [
            {
              "step": "Part (a): Calculate marginal costs",
              "explanation": "Segment 1 (all corn → 75% corn): Gain: 1,500 - 0 = 1,500 soybeans. Sacrifice: 10,000 - 8,000 = 2,000 corn. Cost: 2,000 ÷ 1,500 = 1.33 corn per soybean. Segment 2 (75% corn → 50-50): Gain: 2,500 - 1,500 = 1,000 soybeans. Sacrifice: 8,000 - 5,000 = 3,000 corn. Cost: 3,000 ÷ 1,000 = 3 corn per soybean. Segment 3 (50-50 → 25% corn): Gain: 3,000 - 2,500 = 500 soybeans. Sacrifice: 5,000 - 2,000 = 3,000 corn. Cost: 3,000 ÷ 500 = 6 corn per soybean. Segment 4 (25% corn → all soybeans): Gain: 3,200 - 3,000 = 200 soybeans. Sacrifice: 2,000 - 0 = 2,000 corn. Cost: 2,000 ÷ 200 = 10 corn per soybean."
            },
            {
              "step": "Part (b): Show increasing costs",
              "explanation": "Marginal costs: 1st segment: 1.33 corn/soybean. 2nd segment: 3 corn/soybean (2.25× increase). 3rd segment: 6 corn/soybean (2× increase from previous). 4th segment: 10 corn/soybean (1.67× increase). Clear pattern: Each successive soybean batch costs more corn than previous. Total cost progression: 1.33 → 3 → 6 → 10 (roughly doubling each time initially). This is increasing opportunity cost—demonstrating law of increasing opportunity cost."
            },
            {
              "step": "Part (c): Explain with land characteristics",
              "explanation": "1st segment (1.33 cost): Farmer shifts 25 acres from corn to soybeans. Chooses 25 acres best suited for soybeans (maybe slightly acidic soil, good drainage). These acres weren't great for corn anyway. Little corn sacrificed, lots of soybeans gained → low cost. 2nd segment (3 cost): Next 25 acres less ideal for soybeans, better for corn than first 25. More corn lost per soybean gained → higher cost. 3rd segment (6 cost): Now using acres that are quite good for corn, mediocre for soybeans. High corn productivity sacrificed, lower soybean productivity gained → much higher cost. 4th segment (10 cost): Final 25 acres are best corn land, worst for soybeans. Huge corn loss, tiny soybean gain → very high cost. Land heterogeneity creates increasing costs."
            }
          ],
          "final_answer": "(a) Marginal opportunity costs: Segment 1: 1.33, Segment 2: 3, Segment 3: 6, Segment 4: 10 corn per soybean. (b) Costs clearly increasing—each segment costs more than previous, roughly doubling. Demonstrates law of increasing opportunity cost. (c) Costs increase because land parcels differ in suitability: best soybean land used first (low corn sacrifice), progressively worse soybean land used as expansion continues (high corn sacrifice). Resource specialization causes increasing costs.",
          "concept_applied": "Increasing opportunity cost results from resource heterogeneity. Different land parcels have different comparative advantages. Optimal allocation uses each resource for its best use. Expansion beyond optimal point requires using resources for uses where they're less productive, raising opportunity costs. This pattern is universal whenever resources are specialized."
        }
      ],
      "image": {
        "src": "images/unit2/increasing_oc.png",
        "alt": "Graph showing opportunity cost rising along PPF with bars of increasing height",
        "caption": "Increasing opportunity cost: each additional unit costs progressively more due to resource specialization"
      }
    },
    {
      "section_title": "Practical Applications of PPF Opportunity Cost",
      "introduction": "Understanding opportunity cost on the PPF has practical applications for individual decisions, business strategy, and national policy. It guides efficient resource allocation in real-world contexts.",
      "key_concept": {
        "definition": "PPF opportunity cost analysis applies to any situation involving resource allocation between competing uses: personal time management (work vs. leisure), business production decisions (product mix), agricultural choices (crop selection), national policy (military vs. civilian production), educational investment (study time across subjects). The principle is universal—resources devoted to one use cannot simultaneously serve another, creating measurable trade-offs.",
        "context": "While the PPF is a simplified model, its opportunity cost lessons apply broadly. Every allocation decision involves a production possibilities frontier—the set of feasible outcomes given constraints. Calculating opportunity costs helps identify efficient allocations and reveals when resources are being wasted."
      },
      "worked_examples": [
        {
          "title": "Personal Time Allocation PPF",
          "problem": "A student has 20 hours per week for studying. Can study economics or math. Study productivity: Economics: 1st hour → 10 points improvement, 2nd hour → 8 points, 3rd hour → 6 points, 4th hour → 4 points, 5th hour → 2 points (diminishing returns continue). Math: Similar pattern but starting at 8 points for 1st hour, declining by 2 each hour. Student needs to allocate 10 hours total study time. (a) What is opportunity cost of the 1st economics hour? (b) What is opportunity cost of the 5th economics hour? (c) How should the student allocate time efficiently?",
          "step_by_step": [
            {
              "step": "Part (a): Cost of 1st economics hour",
              "explanation": "1st economics hour: Produces 10 economics points. Alternative: 1st math hour would produce 8 math points. Opportunity cost of 1st economics hour = 8 math points. To gain 10 economics points (from 1st econ hour), sacrifice 8 math points (could have gotten from 1st math hour instead)."
            },
            {
              "step": "Part (b): Cost of 5th economics hour",
              "explanation": "5th economics hour: Produces 2 economics points (low productivity due to diminishing returns). Alternative: 5th math hour would produce 0 math points (8 - 2×4 = 0, assuming pattern continues). Actually, depends on what math hour we'd be giving up. If already studied some math: 5th economics hour means giving up perhaps 3rd or 4th math hour. 3rd math hour produces: 8 - 2×2 = 4 math points. Opportunity cost of 5th economics hour = 4 math points. Higher cost (4 points) for lower gain (2 points) than 1st hour."
            },
            {
              "step": "Part (c): Efficient allocation principle",
              "explanation": "Efficient allocation: Allocate time to maximize total points. Rule: Allocate each hour to subject with highest marginal product until marginal products equalize. Start: 1st econ hour = 10 points > 1st math hour = 8 points → study economics. 2nd econ hour = 8 points = 2nd math hour = 6 points → could study either; let's say economics. 3rd econ hour = 6 points vs. 1st math hour = 8 points → study math. 4th hour: 3rd econ = 6 points vs. 2nd math = 6 points → tie. Continue until 10 hours allocated, always choosing higher marginal product."
            },
            {
              "step": "Optimal allocation calculation",
              "explanation": "Efficient allocation (approximately): Hours 1-2: Economics (marginal products 10, 8). Hours 3-4: Math (marginal products 8, 6). Hours 5-6: Economics (marginal products 6, 4). Hours 7-8: Math (marginal products 4, 2). Hours 9-10: Economics (marginal products 2, 0) or Math (0, -2). Final allocation: About 6 hours economics, 4 hours math. Total points: Economics: 10+8+6+4+2+0 = 30. Math: 8+6+4+2 = 20. Total: 50 points. Better than 10 hours of either subject alone."
            }
          ],
          "final_answer": "(a) Opportunity cost of 1st economics hour = 8 math points (what the 1st math hour would produce). (b) Opportunity cost of 5th economics hour ≈ 4 math points (depending on math hours already studied). (c) Efficient allocation: ~6 hours economics, ~4 hours math, achieving ~50 total points. Allocate time where marginal product is highest, balancing between subjects as marginal products decline. Diversification is efficient due to diminishing returns (increasing opportunity costs).",
          "concept_applied": "PPF opportunity cost applies to time allocation. Diminishing marginal returns create increasing opportunity costs—later hours of studying one subject have higher opportunity cost in terms of other subject. Efficient allocation requires diversification, stopping each activity before marginal cost exceeds marginal benefit. Same principle applies to personal time management, business resource allocation, and national production decisions."
        }
      ],
      "image": {
        "src": "images/unit2/oc_applications.png",
        "alt": "Multiple small PPF diagrams showing applications: time allocation, crop choice, product mix, defense vs. civilian",
        "caption": "PPF opportunity cost applies broadly: time management, business decisions, agricultural choices, policy trade-offs"
      }
    }
  ],
  "key_terms": [
    "Opportunity cost",
    "Marginal opportunity cost",
    "Average opportunity cost",
    "Increasing opportunity cost",
    "Constant opportunity cost",
    "Law of increasing opportunity cost",
    "Resource specialization",
    "Slope of PPF",
    "Trade-off ratio",
    "Diminishing marginal returns",
    "Marginal analysis",
    "Resource heterogeneity"
  ],
  "summary": "Opportunity cost on the Production Possibilities Frontier is measured by the slope—the amount of one good sacrificed divided by the amount of the other good gained. It quantifies the trade-off between goods, revealing the true economic cost of production choices. Calculation formula: Opportunity Cost = (Change in Good Sacrificed) ÷ (Change in Good Gained). The absolute value of the PPF slope equals opportunity cost, showing how much of the y-axis good must be given up per unit of x-axis good gained. Opportunity cost depends on direction: cost of good X in terms of Y differs from cost of Y in terms of X (they're reciprocals). Most PPFs exhibit increasing opportunity cost—the cost of additional units rises as production expands. This creates the bowed-outward PPF shape: slope steepens (in absolute value) as you move right, reflecting higher costs. Increasing opportunity cost occurs because resources are specialized—not equally productive in all uses. When producing more of one good: initial production uses resources best-suited to that good (low opportunity cost), continued expansion requires resources better suited to the other good (high opportunity cost), final units use resources poorly suited to that good (very high opportunity cost). This pattern manifests through: land specialization (some land better for farming, some for factories), labor specialization (workers have different skills and comparative advantages), capital specialization (equipment designed for specific purposes), and diminishing marginal returns (additional units of one factor produce less when others are fixed). Increasing opportunity costs have important implications: complete specialization is inefficient (last units cost too much), marginal analysis is essential (costs change with quantity, must evaluate each additional unit separately), optimal production is typically interior (producing mix of both goods, not just one), and trade gains from specialization are limited (even with comparative advantage, shouldn't specialize completely). Marginal opportunity cost (cost of one more unit) differs from average opportunity cost (cost per unit on average). On bowed PPF, marginal cost increases while average is the mean across all units. Economic decisions should use marginal analysis—comparing marginal cost to marginal benefit—not average cost, because marginal cost shows what the next unit will actually cost. The law of increasing opportunity cost is fundamental, explaining: why PPFs bow outward, why economies produce diverse goods rather than specializing completely, why resource allocation requires careful balancing, and why marginal costs eventually exceed marginal benefits. PPF opportunity cost analysis applies practically to: personal time allocation (study, work, leisure trade-offs), business production decisions (product mix choices), agricultural planning (crop selection based on land suitability), national policy (military vs. civilian production, consumption vs. investment), and any resource allocation problem. Understanding opportunity cost on the PPF reveals the true cost of choices—not monetary prices but real resource trade-offs—guiding efficient decision-making and optimal resource allocation across all economic contexts."
}
