{
  "expanded_description": "Supply and demand are the fundamental forces determining prices and quantities in markets. The supply and demand model is the most important analytical tool in economics, explaining how markets coordinate buyers and sellers, how prices adjust to changes, and how equilibrium is reached. Understanding supply, demand, and their interaction is essential for analyzing virtually all economic phenomena.",
  "core_concept": {
    "principle": "Supply and demand are the two sides of every market. Demand represents buyers—how much of a good consumers want to purchase at different prices. Supply represents sellers—how much of a good producers want to sell at different prices. Market equilibrium occurs where quantity demanded equals quantity supplied—the price and quantity where buyers' and sellers' plans are mutually consistent. When markets are not in equilibrium, prices adjust: If quantity demanded exceeds quantity supplied (shortage), prices rise, reducing quantity demanded and increasing quantity supplied until equilibrium is restored. If quantity supplied exceeds quantity demanded (surplus), prices fall, increasing quantity demanded and reducing quantity supplied until equilibrium is restored. This self-correcting mechanism through price adjustment is fundamental to how markets work.",
    "explanation": "The supply and demand model explains the most basic question in economics: What determines prices and quantities in markets? Consider the market for coffee. Demand side—consumers: At \\$2 per cup, many people buy coffee (quantity demanded is high). At \\$8 per cup, fewer people buy coffee (quantity demanded is low). The law of demand: Higher prices → lower quantity demanded (inverse relationship). Why? Substitution effect (coffee expensive → buy tea instead), Income effect (less purchasing power → buy less), Diminishing marginal utility (each additional cup worth less → won't pay as much). Supply side—producers: At \\$2 per cup, few coffee shops willing to sell (quantity supplied is low—unprofitable). At \\$8 per cup, many coffee shops willing to sell (quantity supplied is high—very profitable). The law of supply: Higher prices → higher quantity supplied (positive relationship). Why? Higher prices increase profitability, Producers expand production when prices rise, New producers enter market when profits are attractive. Market equilibrium: Price adjusts until quantity demanded equals quantity supplied. If coffee price is \\$5 and at this price quantity demanded (100,000 cups) equals quantity supplied (100,000 cups), the market is in equilibrium. No tendency for price to change—buyers and sellers both satisfied. What happens if price is wrong? Suppose price is \\$3 (below equilibrium): Quantity demanded is 150,000 cups (cheap coffee → many buyers). Quantity supplied is 60,000 cups (low price → few sellers willing). Shortage: 150,000 - 60,000 = 90,000 cups. Not enough coffee for everyone who wants it. Shortage creates pressure for price to rise: Frustrated buyers offer more money, Coffee shops realize they can charge more. Price rises toward \\$5 equilibrium. Suppose price is \\$7 (above equilibrium): Quantity demanded is 70,000 cups (expensive → fewer buyers). Quantity supplied is 140,000 cups (profitable → many sellers). Surplus: 140,000 - 70,000 = 70,000 cups. Coffee shops can't sell all they produce. Surplus creates pressure for price to fall: Sellers lower prices to attract buyers, Competition drives prices down. Price falls toward \\$5 equilibrium. This self-correcting mechanism—shortages push prices up, surpluses push prices down, prices adjust to eliminate shortages and surpluses—is how markets reach equilibrium without central planning. The supply and demand model is powerful because it: Explains price determination in all markets (labor, capital, goods, services), Predicts how markets respond to changes (shifts in supply or demand), Shows how markets coordinate millions of independent decisions, Reveals efficiency properties of competitive markets (equilibrium maximizes total surplus), Provides framework for analyzing policies (taxes, subsidies, price controls). Understanding supply and demand is the foundation for all further economic analysis. Nearly every economic question involves supply and demand in some form.",
    "image": {
      "src": "images/unit2/supply_demand_equilibrium.png",
      "alt": "Graph showing downward-sloping demand curve and upward-sloping supply curve intersecting at equilibrium price and quantity",
      "caption": "Supply and demand: market equilibrium where quantity demanded equals quantity supplied; prices adjust to eliminate shortages and surpluses"
    }
  },
  "sections": [
    {
      "section_title": "Demand: The Buyer's Side of the Market",
      "introduction": "Demand represents how much of a good consumers want to buy at different prices. Understanding demand—the law of demand, demand curves, and factors affecting demand—is essential for analyzing market behavior.",
      "key_concept": {
        "definition": "Demand is the relationship between price and quantity demanded—how much buyers want to purchase at each possible price, holding other factors constant. Quantity demanded is the specific amount buyers want at a particular price. The law of demand states: As price increases, quantity demanded decreases (inverse relationship), holding other factors constant. This creates a downward-sloping demand curve. The demand curve shows all price-quantity combinations consumers would choose at different prices, ceteris paribus (all else equal).",
        "context": "Demand is not just 'how much people want'—it's the relationship between price and quantity wanted. Demand reflects willingness and ability to pay. Wanting a Ferrari but unable to afford it doesn't create demand. Demand embodies actual purchasing plans at different prices."
      },
      "principles": [
        {
          "principle": "Law of Demand: Inverse Relationship Between Price and Quantity Demanded",
          "statement": "As price rises, quantity demanded falls. As price falls, quantity demanded rises. This inverse relationship is so fundamental it's called a 'law.' The demand curve slopes downward.",
          "application": "Higher prices always reduce quantity demanded (movement along demand curve), all else equal.",
          "example": "Movie tickets: At \\$15 per ticket, consumer attends 2 movies per month (quantity demanded = 2). At \\$10 per ticket, consumer attends 4 movies per month (quantity demanded = 4). At \\$5 per ticket, consumer attends 8 movies per month (quantity demanded = 8). Lower prices → higher quantity demanded. Inverse relationship. Demand curve for this consumer slopes downward from left to right."
        },
        {
          "principle": "Why Demand Curves Slope Downward: Three Effects",
          "statement": "Quantity demanded decreases as price increases due to: (1) Substitution effect—higher priced good becomes less attractive relative to substitutes, (2) Income effect—higher prices reduce real purchasing power, (3) Diminishing marginal utility—additional units worth less, won't pay as much.",
          "application": "These three effects reinforce each other, ensuring downward-sloping demand curves.",
          "example": "Coffee price increases from \\$3 to \\$5: Substitution effect: Coffee now expensive relative to tea, soda. Consumers substitute alternatives. Reduces coffee quantity demanded. Income effect: At \\$5 vs. \\$3, purchasing power reduced. If buy same amount, have less money for other goods. Reduce coffee consumption. Diminishing marginal utility: First cup very valuable (\\$6 subjective value). Second cup less valuable (\\$4.50 subjective value). Third cup even less (\\$2 subjective value). At \\$3 price, buy 2 cups (1st and 2nd exceed \\$3 value). At \\$5 price, buy only 1 cup (only 1st exceeds \\$5 value). All three effects reduce quantity demanded when price rises."
        },
        {
          "principle": "Demand vs. Quantity Demanded: Movement vs. Shift",
          "statement": "Change in quantity demanded: Movement along demand curve caused by price change. Change in demand: Shift of entire demand curve caused by change in non-price factors (income, preferences, related good prices, expectations, etc.).",
          "application": "Price changes cause movements along the curve. Other factors cause shifts of the entire curve. Distinguishing is crucial.",
          "example": "Coffee market: Price falls from \\$5 to \\$3 → Quantity demanded increases from 100 to 150 cups (movement along demand curve). Income rises by 20% → Demand increases, curve shifts right. At every price, consumers want more coffee. At \\$5, now demand 120 cups (was 100). At \\$3, now demand 180 cups (was 150). Entire curve shifted right due to higher income."
        },
        {
          "principle": "Factors That Shift Demand (Non-Price Determinants)",
          "statement": "Demand shifts when non-price factors change: Income (normal goods: demand rises with income; inferior goods: demand falls with income), Preferences (tastes change → demand changes), Prices of related goods (substitutes: rise → demand increases; complements: rise → demand decreases), Expectations (expected future prices or income), Number of buyers (market size).",
          "application": "Identify which non-price factor changed to predict demand shift direction.",
          "example": "Coffee demand shifters: Income increases: Coffee is normal good → demand increases (rightward shift). Health study shows coffee benefits: Preferences change → demand increases. Tea price increases: Tea is substitute → coffee demand increases (switch to coffee). Cream price increases: Cream is complement → coffee demand decreases (less coffee drinking when cream expensive). Expected coffee shortage: Anticipate higher prices → demand increases now (buy before shortage). Population grows: More buyers → demand increases. Each factor shifts entire demand curve."
        }
      ],
      "worked_examples": [
        {
          "title": "Demand Schedule and Curve",
          "problem": "Market demand for pizza in a town: At \\$20 per pizza, quantity demanded is 100 pizzas per week. At \\$15, quantity demanded is 200. At \\$10, quantity demanded is 400. At \\$5, quantity demanded is 800. (a) Create a demand schedule. (b) Plot the demand curve. (c) What is quantity demanded at \\$12? (d) If price rises from \\$10 to \\$15, what happens?",
          "step_by_step": [
            {
              "step": "Part (a): Demand schedule",
              "explanation": "Organize price-quantity data in table (demand schedule): Price | Quantity Demanded, \\$20 | 100 pizzas/week, \\$15 | 200 pizzas/week, \\$10 | 400 pizzas/week, \\$5 | 800 pizzas/week. Each row shows quantity demanded at that price. Schedule shows inverse relationship (higher price → lower quantity)."
            },
            {
              "step": "Part (b): Demand curve",
              "explanation": "Plot points from schedule on graph: Vertical axis: Price (\\$5, \\$10, \\$15, \\$20). Horizontal axis: Quantity (100, 200, 400, 800 pizzas). Points: (100, \\$20), (200, \\$15), (400, \\$10), (800, \\$5). Connect points with smooth curve. Curve slopes downward from upper left to lower right. Downward slope reflects law of demand."
            },
            {
              "step": "Part (c): Quantity demanded at \\$12",
              "explanation": "Price \\$12 is between \\$10 (QD=400) and \\$15 (QD=200). Interpolate: At \\$10, QD=400. At \\$15, QD=200. At \\$12 (40% of way from \\$10 to \\$15): QD ≈ 400 - 0.4(400-200) = 400 - 80 = 320 pizzas. Or read from plotted demand curve: Find \\$12 on vertical axis, move right to curve, drop down to horizontal axis → approximately 320 pizzas."
            },
            {
              "step": "Part (d): Price rise from \\$10 to \\$15",
              "explanation": "Movement along demand curve (price change): At \\$10: Quantity demanded = 400 pizzas. At \\$15: Quantity demanded = 200 pizzas. Change: Quantity demanded decreases by 200 pizzas (from 400 to 200). This is change in quantity demanded (not change in demand). Movement up and left along existing demand curve. Higher price reduces quantity demanded (law of demand)."
            }
          ],
          "final_answer": "(a) Demand schedule: \\$20→100, \\$15→200, \\$10→400, \\$5→800 pizzas/week. (b) Demand curve: downward-sloping curve through these points. (c) At \\$12, quantity demanded ≈ 320 pizzas (interpolated). (d) Price rise \\$10→\\$15: quantity demanded falls 400→200 (movement along curve, not demand shift).",
          "concept_applied": "Demand schedule tabulates price-quantity relationship. Demand curve plots this relationship graphically as downward-sloping line. Changes in price cause movements along the curve (changes in quantity demanded). The inverse relationship (law of demand) is visible in both schedule and curve."
        },
        {
          "title": "Shifts in Demand",
          "problem": "Original coffee demand: At \\$4/cup, quantity demanded = 1,000 cups daily. Events occur: (a) Average income increases 10%, (b) Tea (substitute) price doubles, (c) Doctor recommends reducing coffee consumption. For each event, determine: Does demand increase (shift right), decrease (shift left), or stay same? Explain.",
          "step_by_step": [
            {
              "step": "Event (a): Income increases 10%",
              "explanation": "Coffee is a normal good (demand rises with income for most people). Income increases → consumers have more purchasing power. Want to consume more coffee at every price. Demand increases (curve shifts right). At \\$4, quantity demanded now perhaps 1,100 cups (was 1,000). At every price, higher quantity demanded. Entire demand curve shifted right due to higher income (non-price determinant)."
            },
            {
              "step": "Event (b): Tea price doubles",
              "explanation": "Tea is a substitute for coffee (alternative beverage). Tea price doubles → tea becomes very expensive. Consumers switch from tea to coffee. Coffee demand increases (curve shifts right). At \\$4, quantity demanded now perhaps 1,200 cups (was 1,000). More people buying coffee because tea is now expensive alternative. Demand curve shifted right due to substitute price increase."
            },
            {
              "step": "Event (c): Doctor recommends reducing coffee",
              "explanation": "Doctor's recommendation changes preferences (people believe coffee less healthy). Consumers want less coffee at every price. Demand decreases (curve shifts left). At \\$4, quantity demanded now perhaps 800 cups (was 1,000). People reducing consumption regardless of price. Demand curve shifted left due to changed preferences (non-price determinant)."
            },
            {
              "step": "Distinguish from price changes",
              "explanation": "None of these events are coffee price changes: Not movements along demand curve. All are shifts of entire demand curve. Non-price determinants (income, related goods prices, preferences) shifted demand. If coffee price changed, would move along curve (not shift curve). Shifts vs. movements distinction crucial."
            }
          ],
          "final_answer": "(a) Income increase: Demand increases (shifts right)—coffee is normal good, higher income increases quantity demanded at every price. (b) Tea price doubles: Demand increases (shifts right)—tea is substitute, expensive tea drives consumers to coffee. (c) Doctor recommends reducing coffee: Demand decreases (shifts left)—preferences changed, consumers want less coffee regardless of price. All three are demand shifts (non-price factors), not movements along curve.",
          "concept_applied": "Non-price factors shift entire demand curve. Income changes shift demand for normal goods in same direction, inferior goods in opposite direction. Substitute price increases shift demand for the good right (people switch to it). Complement price increases shift demand left (used together less). Preference changes shift demand in direction of preference. Distinguishing shifts from movements is essential for supply-demand analysis."
        }
      ],
      "image": {
        "src": "images/unit2/demand_curve.png",
        "alt": "Downward-sloping demand curve with price on vertical axis, quantity on horizontal axis, showing movement along curve and shift of curve",
        "caption": "Demand: downward-sloping curve showing inverse relationship between price and quantity demanded; shifts vs. movements"
      }
    },
    {
      "section_title": "Supply: The Seller's Side of the Market",
      "introduction": "Supply represents how much of a good producers want to sell at different prices. Understanding supply—the law of supply, supply curves, and factors affecting supply—completes the market picture.",
      "key_concept": {
        "definition": "Supply is the relationship between price and quantity supplied—how much sellers want to sell at each possible price, holding other factors constant. Quantity supplied is the specific amount sellers want to sell at a particular price. The law of supply states: As price increases, quantity supplied increases (positive relationship), holding other factors constant. This creates an upward-sloping supply curve. The supply curve shows all price-quantity combinations producers would choose at different prices, ceteris paribus.",
        "context": "Supply reflects producers' willingness and ability to sell. It depends on production costs, technology, and profitability. Supply is not fixed—it responds to prices and other factors. Higher prices make production more profitable, attracting more supply."
      },
      "principles": [
        {
          "principle": "Law of Supply: Positive Relationship Between Price and Quantity Supplied",
          "statement": "As price rises, quantity supplied rises. As price falls, quantity supplied falls. This positive relationship creates upward-sloping supply curve.",
          "application": "Higher prices always increase quantity supplied (movement along supply curve), all else equal.",
          "example": "Wheat farming: At \\$4 per bushel, farmers plant 1 million acres (quantity supplied = 100 million bushels). At \\$6 per bushel, farmers plant 1.3 million acres (quantity supplied = 130 million bushels). At \\$8 per bushel, farmers plant 1.6 million acres (quantity supplied = 160 million bushels). Higher prices → higher quantity supplied. Positive relationship. Supply curve slopes upward from left to right."
        },
        {
          "principle": "Why Supply Curves Slope Upward: Increasing Marginal Cost",
          "statement": "Quantity supplied increases as price increases because: (1) Higher prices make production more profitable, (2) Existing producers expand output despite rising marginal costs, (3) New producers enter when prices rise sufficiently, (4) Resources shift from other uses when opportunity cost is justified.",
          "application": "Rising marginal costs mean producers need higher prices to justify additional production.",
          "example": "T-shirt manufacturing: First 100 shirts: Low cost (\\$5 each—using best workers, machines). Next 100 shirts: Higher cost (\\$7 each—need overtime, less efficient machines). Next 100 shirts: Even higher cost (\\$10 each—hire temporary workers, rent extra equipment). Marginal cost rises with quantity. At \\$6 price: Supply 100-150 shirts (MC below price, profitable). At \\$11 price: Supply 300 shirts (higher price covers higher MC). Higher prices needed to elicit more supply because costs rise with output."
        },
        {
          "principle": "Supply vs. Quantity Supplied: Movement vs. Shift",
          "statement": "Change in quantity supplied: Movement along supply curve caused by price change. Change in supply: Shift of entire supply curve caused by change in non-price factors (input costs, technology, expectations, number of sellers, etc.).",
          "application": "Price changes cause movements along curve. Other factors cause shifts of entire curve.",
          "example": "Wheat market: Price rises from \\$5 to \\$7 → Quantity supplied increases from 100M to 140M bushels (movement along supply curve). New fertilizer technology reduces costs → Supply increases, curve shifts right. At every price, farmers supply more wheat. At \\$5, now supply 120M bushels (was 100M). At \\$7, now supply 160M bushels (was 140M). Entire curve shifted right due to technology improvement."
        },
        {
          "principle": "Factors That Shift Supply (Non-Price Determinants)",
          "statement": "Supply shifts when non-price factors change: Input prices (rise → supply decreases; fall → supply increases), Technology (improves → supply increases), Expectations (future prices expected higher → current supply may decrease), Number of sellers (more sellers → supply increases), Government policies (taxes → supply decreases; subsidies → supply increases), Related goods production (if good becomes more profitable, shift production away from other goods).",
          "application": "Identify which non-price factor changed to predict supply shift direction.",
          "example": "Coffee supply shifters: Fertilizer price increases: Input cost rises → supply decreases (leftward shift). Frost-resistant coffee plants developed: Technology improves → supply increases (rightward shift). Expecting higher prices next month: Hold back current supply → current supply decreases. More farmers start growing coffee: More sellers → supply increases. Government taxes coffee production: Tax increases costs → supply decreases. Government subsidizes coffee: Subsidy reduces effective costs → supply increases. Each factor shifts entire supply curve."
        }
      ],
      "worked_examples": [
        {
          "title": "Supply Changes",
          "problem": "Original smartphone supply: At \\$800, quantity supplied = 10 million phones/year. Events: (a) Microchip costs fall 30%, (b) Workers demand 20% wage increase, (c) Government imposes \\$50 tax per phone. For each event, determine if supply increases, decreases, or stays same. If price stays \\$800, what happens to quantity supplied?",
          "step_by_step": [
            {
              "step": "Event (a): Microchip costs fall 30%",
              "explanation": "Microchips are major input in smartphone production. Input cost falls → production cheaper → more profitable at every price. Supply increases (curve shifts right). At \\$800 price (unchanged): Original quantity supplied: 10 million phones. New quantity supplied: Perhaps 12 million phones (production cheaper, more profitable). Supply curve shifted right—more phones supplied at every price including \\$800."
            },
            {
              "step": "Event (b): Wages increase 20%",
              "explanation": "Labor is input in smartphone production. Wage increase → production costs rise → less profitable at every price. Supply decreases (curve shifts left). At \\$800 price (unchanged): Original quantity supplied: 10 million phones. New quantity supplied: Perhaps 8 million phones (higher costs, less profitable). Supply curve shifted left—fewer phones supplied at every price including \\$800."
            },
            {
              "step": "Event (c): Government imposes \\$50 tax per phone",
              "explanation": "Tax is effectively an additional cost to producers. \\$50 tax per phone → effective price received by producers is \\$50 less. Supply decreases (curve shifts left). At \\$800 market price: Producers effectively receive \\$750 after tax. Original: At \\$750, would supply maybe 9 million phones. New: At \\$800 market price (\\$750 after tax), supply 9 million phones (less than original 10 million at \\$800 before tax). Tax shifts supply curve left."
            }
          ],
          "final_answer": "(a) Chip costs fall 30%: Supply increases (shifts right)—production cheaper, quantity supplied at \\$800 rises from 10M to ~12M phones. (b) Wages increase 20%: Supply decreases (shifts left)—production more expensive, quantity supplied at \\$800 falls from 10M to ~8M phones. (c) Tax of \\$50/phone: Supply decreases (shifts left)—effective price to producers reduced, quantity supplied at \\$800 falls from 10M to ~9M phones.",
          "concept_applied": "Non-price factors shift supply curve. Input cost decreases shift supply right (cheaper production). Input cost increases shift supply left (expensive production). Taxes shift supply left (reduce effective price to producers). Subsidies shift supply right (increase effective price to producers). Technology improvements shift supply right. Supply shifts change quantity supplied even when market price unchanged."
        }
      ],
      "image": {
        "src": "images/unit2/supply_curve.png",
        "alt": "Upward-sloping supply curve with price on vertical axis, quantity on horizontal axis, showing movement along curve and shift of curve",
        "caption": "Supply: upward-sloping curve showing positive relationship between price and quantity supplied; shifts vs. movements"
      }
    },
    {
      "section_title": "Market Equilibrium: Where Supply Meets Demand",
      "introduction": "Market equilibrium occurs where quantity demanded equals quantity supplied. At equilibrium price, there are no shortages or surpluses—the market clears. Understanding equilibrium and how markets move toward it is central to economics.",
      "key_concept": {
        "definition": "Market equilibrium is the price and quantity where quantity demanded equals quantity supplied. At equilibrium: No shortage (everyone who wants to buy at this price can), No surplus (everyone who wants to sell at this price can), No pressure for price to change (market clears). Equilibrium price (Pe) is the price that equates quantity demanded and quantity supplied. Equilibrium quantity (Qe) is the quantity bought and sold at equilibrium price. Graphically, equilibrium is the intersection of supply and demand curves.",
        "context": "Equilibrium is a balance—a state where opposing forces (demand pushing down on price when too high, supply pushing up on price when too low) offset each other. Markets tend toward equilibrium through automatic price adjustments responding to shortages and surpluses."
      },
      "principles": [
        {
          "principle": "At Equilibrium, Quantity Demanded Equals Quantity Supplied",
          "statement": "Equilibrium occurs where QD = QS. At this price, buyers' plans (quantity demanded) match sellers' plans (quantity supplied). Market clears with no excess demand or supply.",
          "application": "Find equilibrium by setting quantity demanded equal to quantity supplied and solving for price.",
          "example": "Market for bicycles: Demand: QD = 1,000 - 50P (quantity demanded depends on price). Supply: QS = 200 + 30P (quantity supplied depends on price). Equilibrium: QD = QS. 1,000 - 50P = 200 + 30P. 800 = 80P. P = \\$10 (equilibrium price). QD = 1,000 - 50(10) = 500 bicycles. QS = 200 + 30(10) = 500 bicycles. Equilibrium: P = \\$10, Q = 500 bicycles. At \\$10, quantity demanded (500) equals quantity supplied (500)—market clears."
        },
        {
          "principle": "Shortages Push Prices Up Toward Equilibrium",
          "statement": "When price is below equilibrium, quantity demanded exceeds quantity supplied (shortage). Frustrated buyers bid prices up, and eager sellers raise prices, moving toward equilibrium.",
          "application": "Shortage → upward pressure on price → price rises → shortage eliminated.",
          "example": "Bicycle market (equilibrium P=\\$10, Q=500): Suppose price is \\$6 (below equilibrium). QD = 1,000 - 50(6) = 700 bicycles (many want to buy at low price). QS = 200 + 30(6) = 380 bicycles (few want to sell at low price). Shortage: 700 - 380 = 320 bicycles. Not enough bicycles for everyone who wants one. Shortage creates upward pressure: Buyers willing to pay more to get scarce bicycles. Sellers realize they can charge higher prices. Price rises from \\$6 toward \\$10 equilibrium. As price rises: QD falls (700 → 500), QS rises (380 → 500), Shortage shrinks (320 → 0). At \\$10, shortage eliminated, equilibrium restored."
        },
        {
          "principle": "Surpluses Push Prices Down Toward Equilibrium",
          "statement": "When price is above equilibrium, quantity supplied exceeds quantity demanded (surplus). Frustrated sellers lower prices to attract buyers, moving toward equilibrium.",
          "application": "Surplus → downward pressure on price → price falls → surplus eliminated.",
          "example": "Bicycle market (equilibrium P=\\$10, Q=500): Suppose price is \\$14 (above equilibrium). QD = 1,000 - 50(14) = 300 bicycles (few want to buy at high price). QS = 200 + 30(14) = 620 bicycles (many want to sell at high price). Surplus: 620 - 300 = 320 bicycles. Producers can't sell all bicycles they want to at \\$14. Surplus creates downward pressure: Unsold inventory accumulates. Sellers lower prices to attract buyers. Price falls from \\$14 toward \\$10 equilibrium. As price falls: QD rises (300 → 500), QS falls (620 → 500), Surplus shrinks (320 → 0). At \\$10, surplus eliminated, equilibrium restored."
        },
        {
          "principle": "Markets Self-Correct Toward Equilibrium",
          "statement": "Shortages and surpluses are temporary—automatic price adjustments eliminate them, moving markets toward equilibrium without central coordination. This is the invisible hand at work.",
          "application": "Markets reach equilibrium through decentralized price adjustments responding to excess demand or supply.",
          "example": "No government agency sets bicycle prices or allocates bicycles. Market self-regulates: Price too low → shortage → frustrated buyers bid up → price rises → equilibrium. Price too high → surplus → frustrated sellers lower prices → price falls → equilibrium. Invisible hand (market forces) coordinates millions of decisions, clearing market without central planning."
        }
      ],
      "worked_examples": [
        {
          "title": "Finding Market Equilibrium",
          "problem": "Market for oranges: Demand: At \\$2/lb, QD=500 lbs; at \\$3/lb, QD=400 lbs; at \\$4/lb, QD=300 lbs; at \\$5/lb, QD=200 lbs. Supply: At \\$2/lb, QS=100 lbs; at \\$3/lb, QS=200 lbs; at \\$4/lb, QS=300 lbs; at \\$5/lb, QS=400 lbs. (a) Find equilibrium price and quantity. (b) What happens at \\$2? (c) What happens at \\$5?",
          "step_by_step": [
            {
              "step": "Part (a): Find equilibrium",
              "explanation": "Equilibrium where QD = QS. Check each price: At \\$2: QD=500, QS=100 (QD ≠ QS). At \\$3: QD=400, QS=200 (QD ≠ QS). At \\$4: QD=300, QS=300 (QD = QS ✓). At \\$5: QD=200, QS=400 (QD ≠ QS). Equilibrium: P = \\$4/lb, Q = 300 lbs. At \\$4, quantity demanded (300 lbs) equals quantity supplied (300 lbs). Market clears—no shortage or surplus."
            },
            {
              "step": "Part (b): Price at \\$2 (below equilibrium)",
              "explanation": "At \\$2: QD = 500 lbs (many buyers at low price), QS = 100 lbs (few sellers at low price). Shortage: 500 - 100 = 400 lbs. Not enough oranges for everyone who wants them at \\$2. Results: Long lines, stockouts, frustrated buyers. Upward pressure on price: Buyers willing to pay more. Sellers realize they can charge more. Price rises toward \\$4 equilibrium. As price rises, shortage shrinks until eliminated at equilibrium."
            },
            {
              "step": "Part (c): Price at \\$5 (above equilibrium)",
              "explanation": "At \\$5: QD = 200 lbs (few buyers at high price), QS = 400 lbs (many sellers at high price). Surplus: 400 - 200 = 200 lbs. Sellers can't sell all oranges they want to at \\$5. Results: Unsold inventory, waste (oranges spoil), frustrated sellers. Downward pressure on price: Sellers lower prices to attract buyers. Competition drives prices down. Price falls toward \\$4 equilibrium. As price falls, surplus shrinks until eliminated at equilibrium."
            }
          ],
          "final_answer": "(a) Equilibrium: P=\\$4/lb, Q=300 lbs (where QD=QS). (b) At \\$2: Shortage of 400 lbs (QD=500, QS=100); upward pressure on price → rises toward equilibrium. (c) At \\$5: Surplus of 200 lbs (QD=200, QS=400); downward pressure on price → falls toward equilibrium. Market self-corrects through price adjustments.",
          "concept_applied": "Market equilibrium occurs where supply and demand curves intersect (QD=QS). Prices below equilibrium create shortages (excess demand) → upward pressure. Prices above equilibrium create surpluses (excess supply) → downward pressure. Markets automatically move toward equilibrium through price adjustments eliminating shortages and surpluses."
        },
        {
          "title": "How Changes Affect Equilibrium",
          "problem": "Coffee market initially in equilibrium at P=\\$5, Q=1,000 cups/day. Events: (a) Income rises (coffee is normal good), (b) Coffee bean harvest fails (supply shock), (c) Both (a) and (b) occur simultaneously. For each, predict new equilibrium direction (price and quantity).",
          "step_by_step": [
            {
              "step": "Event (a): Income rises",
              "explanation": "Coffee is normal good → income rise increases demand. Demand curve shifts right (more coffee demanded at every price). Market adjustment: Original equilibrium: P=\\$5, Q=1,000. Demand increases: At \\$5, quantity demanded now exceeds 1,000 (supply unchanged). Shortage develops at old price. Shortage pushes price up. New equilibrium: Higher price (perhaps \\$5.50), higher quantity (perhaps 1,100). Demand increase → both price and quantity rise."
            },
            {
              "step": "Event (b): Harvest fails",
              "explanation": "Failed harvest reduces coffee bean supply. Supply curve shifts left (less coffee supplied at every price). Market adjustment: Original equilibrium: P=\\$5, Q=1,000. Supply decreases: At \\$5, quantity supplied now less than 1,000 (demand unchanged). Shortage develops at old price. Shortage pushes price up, but higher price reduces quantity demanded. New equilibrium: Higher price (perhaps \\$6), lower quantity (perhaps 800). Supply decrease → price rises, quantity falls."
            },
            {
              "step": "Event (c): Both occur simultaneously",
              "explanation": "Demand increases (income) AND supply decreases (harvest fail). Both shift curves simultaneously. Price effect: Demand increase → upward pressure on price. Supply decrease → upward pressure on price. Both reinforce → price definitely rises (perhaps to \\$7). Quantity effect: Demand increase → upward pressure on quantity. Supply decrease → downward pressure on quantity. Effects oppose → quantity change ambiguous. If demand shift > supply shift: Quantity rises. If supply shift > demand shift: Quantity falls. If shifts equal: Quantity unchanged. New equilibrium: Higher price (certain), quantity uncertain (depends on relative shift sizes)."
            }
          ],
          "final_answer": "(a) Income rises: Demand increases → equilibrium price rises, quantity rises. (b) Harvest fails: Supply decreases → equilibrium price rises, quantity falls. (c) Both occur: Demand increases and supply decreases → equilibrium price definitely rises (both effects reinforce); quantity change ambiguous (effects oppose—depends on which shift is larger).",
          "concept_applied": "Supply and demand shifts change equilibrium. Demand increase: price↑, quantity↑. Demand decrease: price↓, quantity↓. Supply increase: price↓, quantity↑. Supply decrease: price↑, quantity↓. When both shift simultaneously: If effects on price reinforce, price change is certain. If effects oppose, price change depends on relative magnitudes. Same logic for quantity. Analyzing shifts predicts new equilibrium direction."
        }
      ],
      "image": {
        "src": "images/unit2/equilibrium_adjustments.png",
        "alt": "Three diagrams showing: equilibrium, shortage pushing price up, surplus pushing price down",
        "caption": "Market equilibrium: QD=QS; shortage (price too low) → upward pressure; surplus (price too high) → downward pressure"
      }
    }
  ],
  "key_terms": [
    "Supply",
    "Demand",
    "Quantity demanded",
    "Quantity supplied",
    "Law of demand",
    "Law of supply",
    "Demand curve",
    "Supply curve",
    "Market equilibrium",
    "Equilibrium price",
    "Equilibrium quantity",
    "Shortage",
    "Surplus",
    "Demand shift",
    "Supply shift",
    "Substitution effect",
    "Income effect",
    "Marginal cost",
    "Ceteris paribus"
  ],
  "summary": "Supply and demand are the fundamental forces determining prices and quantities in markets, providing the most important analytical tool in economics. Demand represents buyers—the relationship between price and quantity demanded (how much consumers want to purchase at each price). The law of demand states that as price rises, quantity demanded falls (inverse relationship), creating a downward-sloping demand curve. This occurs due to: substitution effect (higher-priced goods become less attractive relative to substitutes), income effect (higher prices reduce purchasing power), and diminishing marginal utility (additional units worth less). Quantity demanded is a specific amount at a particular price (point on curve). Change in quantity demanded is movement along the curve caused by price changes. Demand (the entire curve) shifts when non-price factors change: income changes shift demand for normal goods in the same direction and inferior goods in opposite direction, preferences changes shift demand in direction of preference, substitute price increases shift demand right, complement price increases shift demand left, expectations of future prices or income changes shift current demand, and number of buyers changes shift demand. Supply represents sellers—the relationship between price and quantity supplied (how much producers want to sell at each price). The law of supply states that as price rises, quantity supplied rises (positive relationship), creating an upward-sloping supply curve. This occurs because higher prices make production more profitable, producers expand output despite rising marginal costs, new producers enter when prices rise sufficiently, and resources shift from other uses when opportunity cost is justified by higher prices. Quantity supplied is a specific amount at a particular price. Change in quantity supplied is movement along curve caused by price changes. Supply (entire curve) shifts when non-price factors change: input price increases shift supply left (production more expensive), technology improvements shift supply right (production more efficient), expectations of future prices affect current supply, number of sellers changes shift supply, government policies like taxes shift supply left and subsidies shift supply right, and related goods' profitability changes affect production allocation. Market equilibrium occurs where quantity demanded equals quantity supplied (QD = QS)—the intersection of supply and demand curves. At equilibrium price, there are no shortages (everyone wanting to buy at this price can), no surpluses (everyone wanting to sell at this price can), and no pressure for price to change (market clears). When price is below equilibrium, quantity demanded exceeds quantity supplied creating shortage—frustrated buyers bid prices up and sellers raise prices, moving toward equilibrium until shortage is eliminated. When price is above equilibrium, quantity supplied exceeds quantity demanded creating surplus—frustrated sellers lower prices to attract buyers, moving toward equilibrium until surplus is eliminated. Markets self-correct toward equilibrium through automatic price adjustments responding to shortages and surpluses—this is the invisible hand coordinating millions of independent decisions without central planning. Changes in equilibrium occur when supply or demand shifts: demand increase causes price↑ and quantity↑, demand decrease causes price↓ and quantity↓, supply increase causes price↓ and quantity↑, supply decrease causes price↑ and quantity↓. When both shift simultaneously, effects may reinforce (both push price or quantity same direction—change is certain and large) or oppose (push price or quantity opposite directions—net change depends on which shift is larger). The supply-demand model explains: price determination in all markets, how markets respond to changes, how millions of decisions are coordinated, efficiency properties of competitive markets (equilibrium maximizes total surplus), and effects of policies like taxes, subsidies, and price controls. Understanding supply, demand, and equilibrium is foundational—nearly every economic question involves supply and demand analysis. The model demonstrates markets' power to coordinate decentralized decisions through price signals, automatically allocating resources to highest-valued uses and responding flexibly to changing conditions without central planning or complete information. This fundamental framework underlies all further economic analysis of markets, policy, and resource allocation."
}
