{
  "expanded_description": "Terms of trade refer to the rate at which goods are exchanged in trade—the price of one good in terms of another. The terms of trade determine how the gains from specialization are distributed between trading partners. Understanding terms of trade is essential for analyzing who benefits more from trade and whether proposed trade agreements are advantageous.",
  "core_concept": {
    "principle": "Terms of trade are the exchange ratio between goods in trade—how much of one good must be given up to obtain one unit of another good. Expressed as a ratio (e.g., 2 computers per car) or price (e.g., 1 car costs 2 computers). For trade to be mutually beneficial, terms of trade must fall between the trading partners' opportunity costs. If terms fall outside this range, one party would be worse off trading than producing the good themselves. Within the range, both parties gain—the exact terms determine how gains are distributed. Terms closer to one party's opportunity cost give that party smaller gains; terms closer to the other's opportunity cost give that party larger gains.",
    "explanation": "Terms of trade answer the crucial question: At what rate should we exchange goods? This determines whether trade is worthwhile and how benefits are shared. Consider two countries trading cars for computers. Country A's opportunity cost: 1 car costs 2 computers to produce. Country B's opportunity cost: 1 car costs 3 computers to produce. If trade terms are 1 car for 2.5 computers: Country A gives up 1 car, receives 2.5 computers. Better than producing computers themselves (would only get 2 computers for 1 car sacrificed). A gains 0.5 extra computers per car traded. Country B gives up 2.5 computers, receives 1 car. Better than producing car themselves (would cost 3 computers to produce 1 car). B saves 0.5 computers per car obtained. Both gain because trade terms (2.5) fall between opportunity costs (2 and 3). But what if trade terms were 1 car for 1.5 computers? Country A gives 1 car, gets only 1.5 computers. Worse than producing computers themselves (could make 2 computers for 1 car). A loses from trade. Country B gives 1.5 computers, gets 1 car. Much better than producing (would cost 3 computers). B gains enormously. Trade terms outside the range (below 2) hurt Country A. They wouldn't agree to such terms. Similarly, if terms were 1 car for 3.5 computers: Country A gains enormously (gives 1 car, gets 3.5 vs. making only 2 themselves). Country B loses (pays 3.5 computers for car that costs only 3 to produce). B wouldn't agree. Trade terms outside the range (above 3) hurt Country B. The acceptable range is between opportunity costs: 2 to 3 computers per car. Any terms in this range benefit both parties. Where terms fall within range determines distribution of gains: Terms closer to 2 (A's opportunity cost): A gains little, B gains much. Terms closer to 3 (B's opportunity cost): A gains much, B gains little. Terms at midpoint (2.5): Gains distributed more equally. Understanding terms of trade is crucial for: Evaluating trade agreements (are terms favorable?), Understanding trade negotiations (both parties want favorable terms), Explaining trade patterns (goods exported where terms are favorable), Distributing gains from trade fairly or strategically. In international trade, terms of trade are influenced by: Relative demand for goods (high demand → favorable terms), Bargaining power (larger economy may dictate terms), Competition (many suppliers → worse terms for suppliers), Trade policies (tariffs, subsidies alter terms). Terms of trade aren't fixed—they fluctuate based on market conditions, affecting which countries benefit more from trade at different times.",
    "image": {
      "src": "images/unit2/terms_of_trade.png",
      "alt": "Number line showing opportunity costs of two countries with acceptable terms of trade range between them",
      "caption": "Terms of trade must fall between opportunity costs for mutual benefit; position within range determines gain distribution"
    }
  },
  "sections": [
    {
      "section_title": "Defining and Calculating Terms of Trade",
      "introduction": "Terms of trade specify the exchange ratio between goods. Calculating acceptable terms of trade requires comparing opportunity costs to determine the range within which both parties benefit.",
      "key_concept": {
        "definition": "Terms of trade are the rate at which one good exchanges for another in trade. Expressed as: Price ratio (e.g., 1 car = 2.5 computers, or 1 computer = 0.4 cars), or Exchange rate (how many units of one good per unit of another). For mutually beneficial trade, terms must satisfy: Terms > Lower opportunity cost (otherwise low-cost producer loses), Terms < Higher opportunity cost (otherwise high-cost producer loses). Acceptable range: Between the two parties' opportunity costs. Any terms within this range benefit both parties.",
        "context": "Terms of trade are like prices in barter—they determine exchange rates. Just as you wouldn't buy something for more than it's worth to you, countries won't trade at terms worse than their opportunity costs (producing themselves). Terms must be attractive to both parties to occur voluntarily."
      },
      "principles": [
        {
          "principle": "Acceptable Terms of Trade Fall Between Opportunity Costs",
          "statement": "For trade to benefit both parties, terms must fall strictly between their opportunity costs. If terms equal one party's opportunity cost, that party is indifferent (no gain). If terms fall outside the range, one party loses and won't agree to trade.",
          "application": "Calculate both parties' opportunity costs, then identify any terms falling between them as mutually beneficial.",
          "example": "Country A: 1 car costs 2 computers (opportunity cost). Country B: 1 car costs 3 computers (opportunity cost). Acceptable terms range: Between 2 and 3 computers per car. Examples: 1 car for 2.2 computers ✓ (both benefit). 1 car for 2.8 computers ✓ (both benefit). 1 car for 2 computers ✗ (A indifferent, B gains). 1 car for 3 computers ✗ (B indifferent, A gains). 1 car for 1.5 computers ✗ (A loses, won't agree). 1 car for 3.5 computers ✗ (B loses, won't agree)."
        },
        {
          "principle": "Terms Closer to Your Opportunity Cost Give You Smaller Gains",
          "statement": "Within the acceptable range, terms closer to your own opportunity cost give you smaller gains from trade, while terms closer to the other party's opportunity cost give you larger gains. Both parties prefer terms closer to the other's opportunity cost.",
          "application": "In trade negotiations, each party tries to push terms toward the other's opportunity cost to maximize their own gains.",
          "example": "Country A's opportunity cost: 2 computers per car. Country B's opportunity cost: 3 computers per car. Terms at 2.1 computers per car: A gains little (0.1 computers per car traded). B gains much (0.9 computers saved per car obtained). B prefers these terms. Terms at 2.9 computers per car: A gains much (0.9 computers per car traded). B gains little (0.1 computers saved per car obtained). A prefers these terms. Both want terms favorable to themselves, creating negotiation over distribution of gains."
        },
        {
          "principle": "Terms of Trade Can Be Expressed from Either Good's Perspective",
          "statement": "Terms can be stated as units of good X per unit of good Y, or vice versa. The two expressions are reciprocals. Choose the expression that's clearest for the context.",
          "application": "Convert between expressions by taking reciprocals to match context or make comparisons easier.",
          "example": "Terms: 1 car exchanges for 2.5 computers. Equivalently: 1 computer exchanges for 0.4 cars (reciprocal: 1/2.5 = 0.4). Same terms, different expression. Use whichever is clearer: If discussing car exports, say '1 car for 2.5 computers.' If discussing computer exports, say '1 computer for 0.4 cars.' Both describe identical terms of trade."
        }
      ],
      "worked_examples": [
        {
          "title": "Determining Acceptable Terms of Trade",
          "problem": "Country X can produce 80 wheat or 40 cloth. Country Y can produce 60 wheat or 60 cloth. (a) Calculate each country's opportunity cost for wheat. (b) What is the acceptable range for terms of trade (wheat per cloth)? (c) Would terms of 1 wheat for 0.6 cloth be mutually beneficial? (d) Would terms of 1 wheat for 1.5 cloth benefit both?",
          "step_by_step": [
            {
              "step": "Part (a): Calculate opportunity costs for wheat",
              "explanation": "Country X: Produces 80 wheat or 40 cloth. 1 wheat costs 40/80 = 0.5 cloth. 1 cloth costs 80/40 = 2 wheat. Country Y: Produces 60 wheat or 60 cloth. 1 wheat costs 60/60 = 1 cloth. 1 cloth costs 60/60 = 1 wheat. Summary: X's opportunity cost of wheat: 0.5 cloth per wheat. Y's opportunity cost of wheat: 1 cloth per wheat."
            },
            {
              "step": "Part (b): Acceptable range for terms (wheat per cloth)",
              "explanation": "First express in terms of wheat per cloth: X: 1 cloth costs 2 wheat (reciprocal of 0.5). Y: 1 cloth costs 1 wheat. For trade in wheat per cloth to be mutually beneficial: Terms must be between 1 and 2 wheat per cloth. Below 1 wheat per cloth: Y would lose (costs them 1 wheat to produce cloth, getting less than 1 wheat in trade). Above 2 wheat per cloth: X would lose (costs them 2 wheat to produce cloth, getting more than 2 wheat means trade is worse). Acceptable range: 1 to 2 wheat per cloth. Any terms in this range benefit both."
            },
            {
              "step": "Part (c): Terms of 1 wheat for 0.6 cloth",
              "explanation": "Express in wheat per cloth: 1 wheat for 0.6 cloth means 1/0.6 = 1.67 cloth per wheat. Equivalently: 1 cloth for 0.6 wheat (reciprocal). Compare to opportunity costs: X's opportunity cost: 1 cloth costs 2 wheat. Trade offers: 1 cloth for 0.6 wheat. X trades cloth, gets only 0.6 wheat (worse than producing wheat themselves at cost of 0.5 cloth → gets 2 wheat). X loses! Y's opportunity cost: 1 cloth costs 1 wheat. Trade offers: 1 cloth for 0.6 wheat. Y trades wheat for cloth, pays 0.6 wheat (better than producing cloth themselves at cost of 1 wheat). Y gains! Terms (0.6 wheat per cloth) fall BELOW acceptable range (1 to 2). X loses, won't agree. Not mutually beneficial."
            },
            {
              "step": "Part (d): Terms of 1 wheat for 1.5 cloth",
              "explanation": "Express in wheat per cloth: 1 wheat for 1.5 cloth means 1.5 cloth per wheat. Equivalently: 1 cloth for 1/1.5 = 0.67 wheat. Wait, this doesn't match the format. Let me recalculate: Terms: 1 wheat trades for 1.5 cloth. In wheat per cloth: 1 cloth costs 1/1.5 = 0.67 wheat. Hmm, this is confusing. Let me be clearer: Terms stated as: 1 wheat = 1.5 cloth. In cloth per wheat: 1.5 cloth per wheat. In wheat per cloth: 1/1.5 = 0.67 wheat per cloth. Compare to opportunity costs (in wheat per cloth): X: 2 wheat per cloth. Y: 1 wheat per cloth. Range: 1 to 2 wheat per cloth. Terms: 0.67 wheat per cloth. This is BELOW range (< 1). Falls outside acceptable range. Not mutually beneficial. Actually, let me reconsider the question. It says '1 wheat for 1.5 cloth.' This might mean different things. If it means 1 unit of wheat exchanges for 1.5 units of cloth: Then in terms of cloth per wheat: 1.5 cloth per wheat. X produces wheat (comparative advantage). X trades 1 wheat, gets 1.5 cloth. X's opportunity cost: 1 wheat produces 0.5 cloth. Trade gives 1.5 cloth (much better!). X gains. Y trades cloth for wheat. Y gives 1.5 cloth, gets 1 wheat. Y's opportunity cost: 1.5 cloth costs them 1.5 wheat to produce. Trade gives only 1 wheat for 1.5 cloth. Y loses! Terms not mutually beneficial if stated this way. I need to clarify the acceptable range in cloth per wheat instead: X: 1 wheat costs 0.5 cloth. Y: 1 wheat costs 1 cloth. Range in cloth per wheat: 0.5 to 1 cloth per wheat. Terms: 1 wheat for 1.5 cloth = 1.5 cloth per wheat. This is ABOVE range (> 1). Not mutually beneficial. Y loses."
            }
          ],
          "final_answer": "(a) Country X's opportunity cost of wheat: 0.5 cloth per wheat. Country Y's opportunity cost of wheat: 1 cloth per wheat. (b) Acceptable range: 0.5 to 1 cloth per wheat (equivalently, 1 to 2 wheat per cloth). (c) Terms of 1 wheat for 0.6 cloth (0.6 cloth per wheat) fall within range (0.5 to 1)—YES, mutually beneficial. (d) Terms of 1 wheat for 1.5 cloth (1.5 cloth per wheat) fall outside range (above 1)—NO, not mutually beneficial (Y would lose).",
          "concept_applied": "Acceptable terms of trade fall between the two parties' opportunity costs. Express terms and opportunity costs in same units (e.g., cloth per wheat) to compare. Terms within range benefit both; terms outside range hurt one party who won't agree to trade. Always check that proposed terms fall within the acceptable range determined by opportunity costs."
        },
        {
          "title": "Distributing Gains Through Terms of Trade",
          "problem": "Country A's opportunity cost: 1 shirt costs 2 hats. Country B's opportunity cost: 1 shirt costs 4 hats. They agree to trade terms of 1 shirt for 3 hats. (a) Verify terms are mutually beneficial. (b) How much does each country gain per shirt traded? (c) Who benefits more from these terms?",
          "step_by_step": [
            {
              "step": "Part (a): Verify mutual benefit",
              "explanation": "Opportunity costs in hats per shirt: Country A: 2 hats per shirt. Country B: 4 hats per shirt. Acceptable range: 2 to 4 hats per shirt. Trade terms: 3 hats per shirt. 3 is between 2 and 4 ✓ Terms fall within acceptable range. Mutually beneficial. Check from each country's perspective: Country A (exports shirts, imports hats): Produces 1 shirt, trades for 3 hats. Alternative: Produce hats themselves—1 shirt costs 2 hats. Trade gives 3 hats vs. producing only 2 → Gain 1 hat per shirt traded ✓ Country B (imports shirts, exports hats): Pays 3 hats for 1 shirt. Alternative: Produce shirt themselves—1 shirt costs 4 hats. Trade costs 3 hats vs. producing costs 4 → Save 1 hat per shirt obtained ✓ Both benefit—terms are mutually beneficial."
            },
            {
              "step": "Part (b): Calculate gains for each country",
              "explanation": "Country A's gain per shirt traded: Receives: 3 hats per shirt (trade terms). Could produce: 2 hats per shirt (opportunity cost). Gain: 3 - 2 = 1 hat per shirt traded. Country B's gain per shirt obtained: Pays: 3 hats per shirt (trade terms). Would cost to produce: 4 hats per shirt (opportunity cost). Saving: 4 - 3 = 1 hat per shirt obtained. Both gain exactly 1 hat per shirt traded. Equal absolute gains in this case."
            },
            {
              "step": "Part (c): Who benefits more?",
              "explanation": "Absolute gains are equal (both gain 1 hat per shirt). But we can measure relative gains: Country A: Gain is 1 hat, compared to base of 2 hats opportunity cost. Percentage gain: 1/2 = 50% more hats than producing themselves. Country B: Saving is 1 hat, compared to base of 4 hats opportunity cost. Percentage gain: 1/4 = 25% saving vs. producing themselves. Country A benefits more in percentage terms (50% vs. 25%). Why: Terms (3) are at exact midpoint between opportunity costs (2 and 4). Distance from each country's opportunity cost equals 1 for both. But A's base is smaller (2), so gain is larger proportionally. Alternative interpretation: Terms closer to B's cost (3 vs. 4) than A's cost (3 vs. 2). A negotiated better terms (farther from own cost). A benefits more."
            }
          ],
          "final_answer": "(a) Yes, terms (3 hats per shirt) fall within acceptable range (2 to 4), so mutually beneficial. (b) Country A gains 1 extra hat per shirt traded (gets 3 vs. producing 2). Country B saves 1 hat per shirt obtained (pays 3 vs. producing 4). (c) Country A benefits more—50% gain over their opportunity cost vs. B's 25% saving. Terms at midpoint give equal absolute gains but different relative gains based on opportunity cost magnitudes.",
          "concept_applied": "Terms of trade determine how gains are distributed. Terms at midpoint of acceptable range (halfway between opportunity costs) give equal absolute gains but may differ in relative (percentage) terms. Country that negotiates terms farther from its own opportunity cost benefits more. Distribution of gains depends on where terms fall within the acceptable range."
        }
      ],
      "image": {
        "src": "images/unit2/terms_of_trade_range.png",
        "alt": "Number line showing two opportunity costs with acceptable terms range between them, and specific terms marked within range",
        "caption": "Acceptable terms of trade range: between opportunity costs; both parties benefit at any terms within this range"
      }
    },
    {
      "section_title": "Factors Influencing Terms of Trade",
      "introduction": "Terms of trade are not arbitrary—they're determined by market forces and bargaining power. Understanding what influences terms helps predict trade patterns and outcomes.",
      "key_concept": {
        "definition": "Terms of trade are influenced by: Supply and demand (relative scarcity and desirability of goods), Bargaining power (larger economies, fewer alternatives → more favorable terms), Competition (many suppliers → worse terms for suppliers, better for buyers), Trade policies (tariffs raise import prices, subsidies lower export prices), Transportation costs (reduce gains from trade, affecting terms), Market size (larger markets support better specialization, affecting production costs). These factors determine where within the acceptable range actual terms settle.",
        "context": "While opportunity costs determine the acceptable range of terms, market forces and bargaining dynamics determine where actual terms fall within that range. Strong demand for your exports or weak competition gives favorable terms. Weak demand or strong competition gives unfavorable terms."
      },
      "categories": [
        {
          "type": "Supply and Demand Factors",
          "description": "How relative scarcity and desirability affect terms of trade.",
          "examples": [
            {
              "process": "High demand for exports improves terms",
              "explanation": "If your exports are in high demand, you can command better prices (more imports per unit exported). Example: Country exports oil during energy crisis. High global demand for oil. Can trade each barrel of oil for more manufactured goods than usual. Terms of trade improve (favorable shift)—gets more imports per export unit."
            },
            {
              "process": "Low supply of exports improves terms",
              "explanation": "Scarcity of what you export increases its value, improving terms. Example: Crop failure reduces global wheat supply. Wheat-exporting country can demand more computers per ton of wheat. Scarcity improves terms for wheat exporters, worsens for wheat importers."
            },
            {
              "process": "High demand for imports worsens terms",
              "explanation": "If you desperately need imports, must accept worse terms. Example: Country needs critical medical supplies during pandemic. High demand, limited alternatives. Must accept unfavorable terms—paying more exports per unit of imports. Desperate need for imports worsens terms of trade."
            },
            {
              "process": "Market size and specialization",
              "explanation": "Larger markets support economies of scale, reducing production costs and affecting trade terms. Example: Large country can produce at low cost due to economies of scale. Can offer favorable terms still making profit. Small country produces at high cost. Needs favorable terms to compete. Market size affects cost structures, influencing sustainable terms."
            }
          ]
        },
        {
          "type": "Bargaining Power",
          "description": "How relative economic power and alternatives affect negotiated terms.",
          "examples": [
            {
              "process": "Economic size and leverage",
              "explanation": "Larger economies have more bargaining power, can demand favorable terms. Example: U.S. (large economy) negotiating with small country. U.S. has many alternative trading partners. Small country has few alternatives. U.S. can demand terms closer to small country's opportunity cost. Small country must accept or lose trade entirely. Size creates bargaining leverage."
            },
            {
              "process": "Alternative trading partners",
              "explanation": "Many alternatives strengthen bargaining position; few alternatives weaken it. Example: Country X can buy wheat from USA, Canada, Australia, Argentina (many suppliers). Strong bargaining position—can demand favorable terms (low wheat prices). If one supplier demands high price, buy from another. Country Y has only one supplier for critical resource. Weak bargaining position—must accept supplier's terms. Alternatives create bargaining power."
            },
            {
              "process": "Necessity vs. luxury goods",
              "explanation": "Exporting necessities gives strong bargaining position; exporting luxuries gives weak position. Example: Country exporting food (necessity) to country experiencing famine. Strong position—can demand favorable terms. Country importing caviar (luxury). Weak position—can simply stop importing if terms unfavorable. Necessity exports command better terms."
            },
            {
              "process": "First-mover advantage in specialization",
              "explanation": "Countries that specialize early in high-value goods establish market position, influencing terms. Example: South Korea specialized in electronics early, built expertise and brands. Can command premium prices (favorable terms). Later entrants face established competition, must accept worse terms. Timing of specialization affects long-run terms of trade."
            }
          ]
        },
        {
          "type": "Trade Policies and Barriers",
          "description": "How government interventions affect terms of trade.",
          "examples": [
            {
              "process": "Tariffs alter terms",
              "explanation": "Import tariffs raise effective price of imports, worsening importer's terms of trade. Example: Country A imports computers, pays \\$1,000 per computer (world price). Country A imposes 20% tariff. Importers now pay \\$1,200 per computer (including tariff). Worsens A's terms of trade—pays more per import. Exporters in other countries receive same \\$1,000, but A's consumers pay more."
            },
            {
              "process": "Export subsidies affect terms",
              "explanation": "Subsidizing exports can worsen exporter's terms of trade (paradoxically). Example: Country subsidizes wheat exports to make them competitive. Foreign buyers pay lower prices. Country's terms worsen—receives fewer imports per wheat unit exported. But may increase export volume, affecting total gains."
            },
            {
              "process": "Quotas and restrictions",
              "explanation": "Limiting imports or exports affects scarcity and prices. Example: OPEC limits oil exports (quota). Reduces supply, increases oil price. Improves terms of trade for oil exporters. Import quotas create domestic scarcity, raising prices for consumers while protecting domestic producers."
            },
            {
              "process": "Trade agreements",
              "explanation": "Bilateral or multilateral agreements set terms explicitly or remove barriers affecting terms. Example: Free trade agreement eliminates tariffs. Reduces trade costs, potentially improving terms for both parties. Preferential access agreements give favorable terms to certain partners. Trade agreements institutionalize terms or remove distortions."
            }
          ]
        },
        {
          "type": "Long-Run Trends in Terms of Trade",
          "description": "How terms of trade change over time due to structural factors.",
          "examples": [
            {
              "process": "Prebisch-Singer hypothesis",
              "explanation": "Theory that terms of trade for primary commodities (agricultural, raw materials) deteriorate over time relative to manufactured goods. Example: Historical trend: Commodity exporters (developing countries) receive relatively less manufactured goods per unit of commodity exported over decades. If true: Commodity dependence creates long-run worsening terms. Countries should industrialize to avoid deterioration. Controversial—evidence mixed, but highlights terms of trade dynamics."
            },
            {
              "process": "Technological progress and terms",
              "explanation": "Technology advances in one sector can worsen that sector's terms of trade by increasing supply. Example: Green Revolution dramatically increased agricultural yields. More food production → lower food prices globally. Worsened terms of trade for food exporters (receive fewer manufactured goods per ton of food). Technology improved productivity but worsened relative prices."
            },
            {
              "process": "Income elasticity of demand",
              "explanation": "As incomes rise, demand for some goods (luxuries, high-tech) increases more than others (basic commodities). Example: Rising global incomes increase demand for electronics, services faster than demand for basic foods. Terms of trade improve for electronics exporters, worsen for food exporters. Income growth patterns affect long-run terms of trade."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "How Market Conditions Affect Terms of Trade",
          "problem": "Country A exports coffee, imports machinery. Initially trades at terms of 100 pounds coffee for 1 machine. (a) Global coffee harvest doubles due to good weather. How does this affect A's terms? (b) Meanwhile, machines become scarce due to computer chip shortage. Combined effect on A's terms? (c) Who benefits from these changes?",
          "step_by_step": [
            {
              "step": "Part (a): Effect of doubled coffee supply",
              "explanation": "Coffee supply doubles globally (bumper harvest). More coffee available → lower coffee price. Country A exports coffee. Must trade more coffee per machine to maintain trade. Terms worsen for A: Previously: 100 pounds coffee for 1 machine. Now: Perhaps 150-200 pounds coffee for 1 machine. A must give up more exports per unit of import. Terms of trade deteriorated (unfavorable shift). Supply increase of exports worsens exporter's terms."
            },
            {
              "step": "Part (b): Combined effect—scarce machines",
              "explanation": "Machines become scarce (chip shortage). Fewer machines available → higher machine prices. Country A imports machines. Must trade even more coffee per scarce machine. Terms worsen further for A: Previous deterioration: 100 → 175 pounds per machine (coffee supply increase). Further deterioration: 175 → 250 pounds per machine (machine scarcity). Combined effect: A must trade 250 pounds coffee for 1 machine (vs. original 100). Terms severely worsened. Country A hurt by both: Export good (coffee) abundant → low price. Import good (machines) scarce → high price. Double whammy worsening terms."
            },
            {
              "step": "Part (c): Who benefits?",
              "explanation": "Country A (coffee exporter) loses: Terms worsened dramatically (100 → 250 pounds per machine). Gets fewer imports per export unit. Standard of living decreases if dependent on trade. Machinery exporters benefit: Receive more coffee per machine (250 vs. 100). Terms improved. Can consume more imports per export unit. Coffee importers benefit: Pay less for coffee (abundant supply). Can buy more coffee with same resources. Terms improved. Trade partners gain at Country A's expense when A's export prices fall and import prices rise."
            }
          ],
          "final_answer": "(a) Doubled coffee harvest increases supply, lowers coffee prices, worsens Country A's terms of trade (must trade more coffee per machine). (b) Combined with machine scarcity, A's terms worsen severely—potentially 100 → 250 pounds coffee per machine. (c) Country A loses from worsened terms. Machinery exporters and coffee importers benefit from favorable terms shifts. Market conditions strongly influence terms of trade and determine who gains from trade.",
          "concept_applied": "Terms of trade are not fixed—they respond to supply and demand. Increased supply of exports worsens exporter's terms (lower prices). Increased demand for imports worsens importer's terms (higher prices). Countries benefit when their export prices rise or import prices fall. Market conditions create winners and losers in trade by shifting terms of trade."
        }
      ],
      "image": {
        "src": "images/unit2/terms_influencers.png",
        "alt": "Diagram showing various factors (supply, demand, bargaining power, policies) affecting terms of trade",
        "caption": "Terms of trade influenced by: supply and demand, bargaining power, competition, policies, and long-run trends"
      }
    },
    {
      "section_title": "Terms of Trade and National Welfare",
      "introduction": "Changes in terms of trade affect a country's standard of living and economic welfare. Improving terms increase purchasing power; deteriorating terms reduce it. Understanding this relationship is crucial for trade policy.",
      "key_concept": {
        "definition": "Terms of trade affect national welfare through purchasing power: Improving terms (getting more imports per export unit) increase real income and living standards—same exports buy more imports, expanding consumption possibilities. Deteriorating terms (getting fewer imports per export unit) reduce real income and living standards—same exports buy fewer imports, contracting consumption possibilities. Terms of trade changes can dominate productivity changes in determining welfare—even with rising productivity, worsening terms can reduce real income.",
        "context": "A country's welfare depends not just on how much it produces (productivity) but also on what it can buy with that production (terms of trade). Favorable terms amplify productivity gains. Unfavorable terms can negate productivity improvements."
      },
      "principles": [
        {
          "principle": "Improving Terms of Trade Increase Real Income",
          "statement": "When terms of trade improve (more imports per export), a country can consume more without producing more. Real income and purchasing power increase, raising living standards.",
          "application": "Favorable terms of trade shifts increase welfare independently of productivity changes.",
          "example": "Country exports oil, imports manufactured goods. Initially: 100 barrels oil trade for 50 machines (1 barrel = 0.5 machines). Terms improve due to oil scarcity: 100 barrels now trade for 75 machines (1 barrel = 0.75 machines). Welfare increase: Same oil production (100 barrels) now buys 50% more machines (75 vs. 50). Real income increased by 50% without producing more. Living standards rise from improved terms."
        },
        {
          "principle": "Deteriorating Terms of Trade Reduce Real Income",
          "statement": "When terms worsen (fewer imports per export), a country must produce more exports to maintain same imports. Real income and purchasing power decrease, reducing living standards.",
          "application": "Unfavorable terms shifts reduce welfare even if productivity remains constant.",
          "example": "Country exports agricultural products, imports technology. Initially: 1,000 tons food trade for 100 computers (10 tons = 1 computer). Terms deteriorate due to abundant food supply: 1,000 tons now trade for only 50 computers (20 tons = 1 computer). Welfare decrease: Same food production buys 50% fewer computers. Real income decreased by 50% without productivity decline. Must double food exports to maintain previous computer imports. Living standards fall from worsened terms."
        },
        {
          "principle": "Terms of Trade Can Offset Productivity Changes",
          "statement": "Productivity gains can be negated by worsening terms, or productivity stagnation can be offset by improving terms. Terms of trade determine real income impact of productivity.",
          "application": "Evaluate welfare changes by considering both productivity and terms of trade together.",
          "example": "Scenario 1: Productivity rises 20% but terms worsen 20%. Produce 20% more exports but each unit buys 20% fewer imports. Net effect: Real income unchanged—productivity gain offset by terms deterioration. Scenario 2: Productivity stagnates but terms improve 30%. Produce same exports but each unit buys 30% more imports. Net effect: Real income rises 30%—terms improvement despite no productivity gain. Terms can dominate productivity in determining welfare."
        }
      ],
      "image": {
        "src": "images/unit2/terms_welfare.png",
        "alt": "Graph showing consumption possibilities expanding with improved terms, contracting with worsened terms",
        "caption": "Terms of trade and welfare: improving terms expand consumption possibilities; worsening terms contract them"
      }
    }
  ],
  "key_terms": [
    "Terms of trade",
    "Exchange ratio",
    "Acceptable range",
    "Distribution of gains",
    "Bargaining power",
    "Trade terms",
    "Price ratio",
    "Favorable terms",
    "Unfavorable terms",
    "Terms deterioration",
    "Terms improvement",
    "Real income",
    "Purchasing power"
  ],
  "summary": "Terms of trade are the rate at which goods are exchanged in trade—the price of one good in terms of another, expressed as a ratio (e.g., 2 computers per car) or exchange rate (how many units of one good per unit of another). For trade to be mutually beneficial, terms must fall strictly between the trading partners' opportunity costs. If terms equal one party's opportunity cost, that party is indifferent (no gain); if terms fall outside the range, one party loses and won't agree to trade. The acceptable range is determined by opportunity costs—any terms between the two parties' opportunity costs benefit both. Within the acceptable range, exact terms determine how gains from specialization are distributed between parties. Terms closer to one party's opportunity cost give that party smaller gains, while terms closer to the other's opportunity cost give that party larger gains. Both parties prefer terms closer to the other's opportunity cost, creating basis for trade negotiations. Terms can be expressed from either good's perspective (units of X per Y, or Y per X)—the two expressions are reciprocals. Choose the expression clearest for the context. Terms of trade are influenced by multiple factors: Supply and demand (high demand for exports or low supply improves terms; high demand for imports or low supply of exports worsens terms), Bargaining power (larger economies, fewer alternatives, exporting necessities give stronger negotiating positions and more favorable terms), Competition (many suppliers worsen suppliers' terms but improve buyers' terms), Trade policies (tariffs raise import prices worsening importer's terms; export subsidies can paradoxically worsen exporter's terms; quotas affect scarcity and prices), Transportation costs (reduce gains from trade affecting sustainable terms), Market size (larger markets support economies of scale affecting production costs and terms). These factors determine where within the acceptable range actual terms settle in practice. Long-run trends in terms of trade include: Prebisch-Singer hypothesis (commodity terms may deteriorate over time relative to manufactures—controversial but highlights dynamics), Technological progress in one sector increasing supply can worsen that sector's terms of trade through lower relative prices, Income elasticity patterns (rising incomes increase demand for high-tech goods faster than basic commodities, affecting relative terms). Terms of trade significantly affect national welfare through purchasing power: Improving terms (more imports per export unit) increase real income and living standards—same production buys more imports, expanding consumption possibilities without productivity increases. Deteriorating terms (fewer imports per export unit) reduce real income and living standards—same production buys fewer imports, contracting consumption possibilities even with constant productivity. Terms changes can dominate productivity changes in determining welfare—productivity gains can be negated by worsening terms (produce more but each unit buys less), or productivity stagnation offset by improving terms (produce same amount but each unit buys more). Real income depends on both how much you produce (productivity) and what you can buy with production (terms of trade). Countries benefit from trade when: They specialize according to comparative advantage (increasing total production), AND obtain favorable terms of trade (distributing gains advantageously). Trade negotiations center on terms because distribution of gains depends on where terms fall within acceptable range. Strategic trade policy aims to improve national terms of trade through: Building bargaining power (developing alternatives, achieving economies of scale), Timing specialization (entering high-value sectors early), Managing supply (export restrictions to maintain scarcity and prices), Preferential agreements (securing favorable terms with specific partners). Understanding terms of trade is essential for: Evaluating whether proposed trade agreements are advantageous, Predicting how market changes affect national welfare, Explaining why some trade relationships are more beneficial than others, Assessing impact of trade policy on real incomes, Understanding how gains from trade are distributed among trading partners. Terms of trade translate the technical efficiency gains from comparative advantage into actual consumption and welfare outcomes for trading nations."
}
