{
  "expanded_description": "How big is the U.S. economy? How fast is China growing? Has the pandemic caused a recession? To answer these questions, economists need a way to measure the total output of an entire economy. That measure is Gross Domestic Product, or GDP. GDP is the market value of all final goods and services produced within a country in a given period. It's the most important number in macroeconomics—the headline indicator of economic performance. When GDP grows, jobs are created, incomes rise, and living standards improve. When GDP falls, recessions bring unemployment and hardship. But GDP is more than just a number; it's a concept that embodies how we think about economic activity. What counts? What doesn't? Why do we measure it this way? Understanding GDP—how it's defined, how it's calculated, and what it includes and excludes—is essential for interpreting economic news, evaluating policy, and understanding the economy. In this section, we'll explore the components of GDP, the different ways to measure it, and the difference between nominal and real GDP. You'll learn to calculate GDP, adjust for inflation, and understand what this powerful statistic tells us—and what it doesn't.",
  
  "core_concept": {
    "principle": "Gross Domestic Product (GDP) is the market value of all final goods and services produced within a country in a given period. This definition has five key parts: (1) Market value—GDP uses market prices to value different goods and services, allowing us to add apples and oranges; (2) All—it includes everything produced in the economy, from cars to haircuts to government services; (3) Final—it counts only final goods, not intermediate goods, to avoid double-counting; (4) Goods and services—it includes tangible goods and intangible services; (5) Produced within a country—GDP measures domestic production, regardless of who owns the factors of production; (6) In a given period—GDP is a flow variable measured over a specific time (quarterly or annually). GDP can be calculated in three equivalent ways: the expenditure approach (sum of spending on final goods), the income approach (sum of incomes earned from production), and the value-added approach (sum of value added at each stage of production). These three approaches yield the same total because every dollar spent on final goods becomes income for someone. Nominal GDP measures output at current prices; real GDP adjusts for inflation to measure actual physical output. GDP per capita (GDP divided by population) is a rough measure of average living standards.",
    
    "explanation": "Imagine you own a bakery. You buy flour, sugar, and eggs from suppliers. You bake bread and sell it to customers. How much do you contribute to GDP? Not the full price of the bread minus what? Actually, the full price of the bread counts—but only if it's a final sale to a consumer. The flour, sugar, and eggs are intermediate goods; their value is already included in the bread, so counting them separately would double-count. Now imagine the whole economy—millions of such transactions. GDP adds them all up: every car sold, every haircut, every government service, every new house built. But not everything counts: sales of used goods don't count (they weren't produced this period), financial transactions like stock purchases don't count (they're just transfers of assets), and unpaid work (like caring for your own children) doesn't count (it's hard to value). The result is a number—in 2023, U.S. GDP was about $27 trillion. That's the total value of everything produced. If it goes up, the economy is growing; if it goes down, we're in recession. But GDP isn't perfect—it doesn't measure environmental quality, leisure, or inequality. Still, it's the best single measure of economic activity we have.",
    
    "image": {
      "src": "images/unit2/gdp_definition.png",
      "alt": "Visual breakdown of the GDP definition showing market value, final goods, produced within a country, in a given period",
      "caption": "Figure 2.2.1: GDP is the market value of all final goods and services produced within a country in a given period."
    }
  },

  "sections": [
    {
      "section_title": "2.2 Gross Domestic Product",
      "introduction": "Gross Domestic Product (GDP) is the scoreboard of the economy. It tells us whether the economy is growing or shrinking, whether times are good or bad, and how one country compares to another. But GDP is more than just a number—it's a carefully constructed statistic that embodies how economists think about economic activity. In this section, we'll learn what GDP includes and excludes, how it's calculated using different approaches, and how to adjust for inflation to compare economic output over time. You'll also learn about the limitations of GDP—what it misses and why it's not a perfect measure of well-being. By the end, you'll be able to interpret GDP reports, understand economic news, and use GDP to analyze economic performance.",
      
      "introduction_image": {
        "src": "images/unit2/gdp_overview.png",
        "alt": "Infographic showing U.S. GDP over time with recessions shaded",
        "caption": "Figure 2.2.2: U.S. GDP has grown over time, with recessions visible as temporary declines. Real GDP adjusts for inflation."
      },
      
      "key_concept": {
        "definition": "GDP is the market value of all final goods and services produced within a country in a given period. The expenditure approach calculates GDP as $GDP = C + I + G + NX$, where C is consumption spending by households, I is investment spending by businesses (plus residential construction and inventory changes), G is government spending on goods and services, and NX is net exports (exports minus imports). The income approach calculates GDP as the sum of all incomes earned: wages, rent, interest, profit, plus indirect taxes and depreciation. The value-added approach sums the value added at each stage of production—the difference between what a firm sells its output for and what it pays for intermediate goods. All three approaches yield the same total because spending on final goods becomes income for someone, and value added at each stage sums to the final value. Nominal GDP uses current prices; real GDP uses constant base-year prices to isolate changes in physical output. The GDP deflator (Nominal GDP / Real GDP × 100) measures the overall price level.",
        
        "context": "GDP measurement was developed during the Great Depression of the 1930s, when policymakers realized they needed better information about the economy's condition. Simon Kuznets led the effort at the National Bureau of Economic Research, producing the first comprehensive national income accounts. During World War II, GDP became essential for planning production and allocating resources. Today, GDP is calculated quarterly by the Bureau of Economic Analysis in the U.S. and by similar agencies worldwide. It's the most widely used indicator of economic performance, guiding monetary and fiscal policy, business decisions, and international comparisons. However, Kuznets himself warned against treating GDP as a measure of welfare—it measures production, not well-being. This warning remains relevant as economists debate GDP's limitations and consider alternative measures. In AP Macroeconomics, understanding GDP is essential for analyzing economic growth, business cycles, and policy effectiveness.",
        
        "image": {
          "src": "images/unit2/gdp_approaches.png",
          "alt": "Diagram showing the three approaches to GDP: expenditure, income, and value-added, all converging to the same total",
          "caption": "Figure 2.2.3: GDP can be calculated three ways—expenditure, income, and value-added—all yielding the same total."
        }
      },

      "classifications": [
        {
          "type": "Expenditure Approach",
          "value": "$GDP = C + I + G + NX$",
          "characteristics": ["Measures spending on final goods", "Four main components", "Most common approach", "Matches national income identity", "Used for policy analysis"],
          "behavior": "GDP is calculated by adding up all spending on domestically produced final goods and services. This approach emphasizes that output must be purchased by someone—households, businesses, government, or foreigners. Each component responds differently to economic conditions: consumption is stable, investment is volatile, government spending is policy-driven, and net exports depend on international conditions.",
          
          "image": {
            "src": "images/unit2/expenditure_approach.png",
            "alt": "Pie chart showing components of GDP by expenditure: C, I, G, NX with typical percentages",
            "caption": "Figure 2.2.4: Expenditure approach components. Consumption is largest, followed by government, investment, and net exports."
          },
          
          "examples": [
            {
              "process": "Consumption (C)",
              "explanation": "Household spending on goods and services. Includes durable goods (cars, appliances), nondurable goods (food, clothing), and services (healthcare, education). About 68% of U.S. GDP. The largest and most stable component."
            },
            {
              "process": "Investment (I)",
              "explanation": "Business spending on capital goods (machinery, factories), residential construction (new houses), and changes in inventories. About 17% of GDP. The most volatile component, driving business cycles."
            },
            {
              "process": "Government Spending (G)",
              "explanation": "Government purchases of goods and services at federal, state, and local levels. Includes defense, roads, schools, salaries of public employees. About 18% of GDP. Does NOT include transfer payments (Social Security, welfare)."
            },
            {
              "process": "Net Exports (NX)",
              "explanation": "Exports minus imports. Exports add to GDP (domestic production sold abroad); imports subtract (spending on foreign production). Usually negative for U.S. (trade deficit), about -3% of GDP."
            }
          ]
        },
        {
          "type": "Income Approach",
          "value": "$GDP = W + R + I + P + (Indirect Taxes) + Depreciation$",
          "characteristics": ["Measures incomes earned from production", "Includes wages, rent, interest, profit", "Adds indirect taxes and depreciation", "Equals expenditure approach", "Shows distribution of income"],
          "behavior": "Every dollar spent on final goods becomes income for someone. The income approach adds up all these incomes: wages paid to workers, rent paid to landlords, interest paid to lenders, and profit paid to business owners. To reconcile with expenditure approach, we add indirect taxes (like sales taxes) and depreciation (capital consumed in production).",
          
          "image": {
            "src": "images/unit2/income_approach.png",
            "alt": "Pie chart showing income components: wages, rent, interest, profit, indirect taxes, depreciation",
            "caption": "Figure 2.2.5: Income approach components. Wages are largest, followed by profit, depreciation, and other incomes."
          },
          
          "examples": [
            {
              "process": "Wages (W)",
              "explanation": "Compensation of employees, including salaries, benefits, and payroll taxes. About 55% of GDP. The largest component of national income."
            },
            {
              "process": "Rent (R)",
              "explanation": "Income from renting land and other natural resources. Includes imputed rent for owner-occupied housing. About 3% of GDP."
            },
            {
              "process": "Interest (I)",
              "explanation": "Net interest paid by businesses to households and other lenders. About 5% of GDP."
            },
            {
              "process": "Profit (P)",
              "explanation": "Corporate profits and proprietor's income (income of unincorporated businesses). About 20% of GDP."
            },
            {
              "process": "Adjustments",
              "explanation": "Indirect business taxes (sales taxes, property taxes) and depreciation (consumption of fixed capital) are added to reconcile with expenditure approach. Together about 17% of GDP."
            }
          ]
        },
        {
          "type": "Value-Added Approach",
          "value": "$GDP = \\sum Value\\ Added = \\sum (Sales - Intermediate\\ Goods)$",
          "characteristics": ["Avoids double-counting", "Shows production stages", "Useful for industry analysis", "Foundation of input-output tables", "Matches other approaches"],
          "behavior": "At each stage of production, firms add value by transforming inputs into outputs. Value added is the difference between what a firm sells its output for and what it pays for intermediate goods. Summing value added across all firms in the economy gives GDP, which equals the total value of final goods and services.",
          
          "image": {
            "src": "images/unit2/value_added.png",
            "alt": "Diagram showing stages of bread production: farmer, miller, baker, retailer with value added at each stage",
            "caption": "Figure 2.2.6: Value-added approach avoids double-counting by summing value added at each production stage."
          },
          
          "examples": [
            {
              "process": "Farmer",
              "explanation": "Grows wheat, sells to miller for $\\$0.50$. Value added: $\\$0.50$ (no intermediate goods)."
            },
            {
              "process": "Miller",
              "explanation": "Grinds wheat into flour, sells to baker for $\\$1.20$. Value added: $\\$1.20 - \\$0.50 = \\$0.70$."
            },
            {
              "process": "Baker",
              "explanation": "Bakes bread, sells to retailer for $\\$2.00$. Value added: $\\$2.00 - \\$1.20 = \\$0.80$."
            },
            {
              "process": "Retailer",
              "explanation": "Sells bread to consumer for $\\$3.00$. Value added: $\\$3.00 - \\$2.00 = \\$1.00$."
            },
            {
              "process": "Total",
              "explanation": "Sum of value added: $0.50 + 0.70 + 0.80 + 1.00 = \\$3.00$, which equals the final price of the bread. This avoids double-counting the intermediate goods."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "GDP Counts Only Final Goods to Avoid Double-Counting",
          "statement": "Intermediate goods—goods used up in producing other goods—are not counted separately in GDP. Their value is already included in the final goods they become. Counting them separately would overstate GDP. This is why we use the value-added approach or only count final sales. For example, the flour in a loaf of bread is an intermediate good; only the bread counts in GDP. However, capital goods (like machinery) are counted even though they're used to produce other goods because they're not used up in the current period.",
          "application": "When analyzing GDP, always ask: Is this a final good or an intermediate good? A new car for a household is final; the steel that went into it is intermediate. But a new car bought by a car rental company is investment (a capital good) and counts in GDP. Goods added to inventory count as investment when produced, then subtract from consumption when sold later—this ensures GDP measures production, not just sales.",
          "example": "Consider a shirt. The farmer grows cotton, sells to textile mill for $\\$5$. Textile mill weaves fabric, sells to shirt factory for $\\$12$. Shirt factory makes shirt, sells to retailer for $\\$20$. Retailer sells to consumer for $\\$35$. GDP contribution is $\\$35$ (final sale). The intermediate transactions ($\\$5$, $\\$12$, $\\$20$) are not counted separately—their value is embedded in the final $\\$35$. Value added sums to $5 + 7 + 8 + 15 = 35$.",
          
          "image": {
            "src": "images/unit2/final_vs_intermediate.png",
            "alt": "Diagram showing final goods counted, intermediate goods not counted in GDP",
            "caption": "Figure 2.2.7: Only final goods count in GDP. Intermediate goods are excluded to avoid double-counting."
          }
        },
        {
          "principle": "Nominal GDP vs. Real GDP: Adjusting for Inflation",
          "statement": "Nominal GDP measures output using current prices. If prices rise, nominal GDP can increase even if physical output doesn't. Real GDP measures output using constant base-year prices, isolating changes in physical production. The difference is crucial for comparing economic performance over time. The GDP deflator—$\\frac{Nominal\\ GDP}{Real\\ GDP} \\times 100$—measures the overall price level. Real GDP growth is the true measure of economic growth; nominal GDP growth mixes growth and inflation.",
          "application": "When you hear 'GDP grew 5% last year,' ask: Is that nominal or real? If it's nominal, part of that growth could be inflation. Real growth is what matters for living standards. To calculate real GDP, multiply quantities produced in the current year by prices from a base year. This shows how much output has changed, holding prices constant. The choice of base year affects the numbers but not the growth trend.",
          "example": "Suppose an economy produces only apples and bananas. In 2020: 10 apples at $\\$1$ = $\\$10$, 10 bananas at $\\$2$ = $\\$20$, nominal GDP = $\\$30$. In 2021: 12 apples at $\\$2$ = $\\$24$, 12 bananas at $\\$3$ = $\\$36$, nominal GDP = $\\$60$. Nominal growth = 100%. But using 2020 prices, real GDP in 2021 = 12 apples × $\\$1$ + 12 bananas × $\\$2$ = $\\$12 + \\$24 = \\$36$. Real growth = ($36-30)/30 = 20%. The rest (80%) was inflation. The GDP deflator in 2021 = (60/36) × 100 = 167, prices up 67%.",
          
          "image": {
            "src": "images/unit2/nominal_vs_real.png",
            "alt": "Graph showing nominal and real GDP over time, with the gap representing inflation",
            "caption": "Figure 2.2.8: Nominal GDP grows faster than real GDP when inflation is positive. The gap measures price increases."
          }
        },
        {
          "principle": "GDP Measures Production, Not Well-Being",
          "statement": "GDP is a measure of market economic activity, not a comprehensive measure of well-being. It excludes many things that affect quality of life: leisure time, unpaid household work, environmental quality, health outcomes, income distribution, and social connections. A country could have high GDP but low well-being if growth comes at the expense of the environment or if gains go only to the rich. Simon Kuznets, who developed GDP, warned against treating it as a measure of welfare. Yet GDP per capita is strongly correlated with many measures of well-being—health, education, life satisfaction—so it remains a useful, if imperfect, indicator.",
          "application": "When evaluating an economy, look beyond GDP. Consider unemployment, inflation, inequality, environmental indicators, and measures of health and education. The UN's Human Development Index combines GDP per capita with life expectancy and education. Bhutan's Gross National Happiness index takes a different approach. GDP is essential but not sufficient for understanding economic performance and social progress.",
          "example": "Consider two countries with same GDP per capita. Country A has clean air, low crime, strong social safety nets, and equal income distribution. Country B has polluted cities, high crime, no safety nets, and extreme inequality. GDP alone doesn't distinguish them. This is why economists supplement GDP with other measures. Also, unpaid work—like childcare or eldercare provided by family members—doesn't count in GDP, even though it's valuable. If that care is moved to a paid daycare center, GDP rises, even though total care may not have changed.",
          
          "image": {
            "src": "images/unit2/gdp_vs_wellbeing.png",
            "alt": "Venn diagram showing GDP overlaps with but is not equal to well-being",
            "caption": "Figure 2.2.9: GDP measures market production, which is related to but not the same as overall well-being."
          }
        },
        {
          "principle": "The Expenditure Identity: $C + I + G + NX = GDP$",
          "statement": "The expenditure approach yields the fundamental identity: $GDP = C + I + G + NX$. This identity always holds because it's definitional—every dollar of output is purchased by someone. But it's more than an identity; it's a framework for analyzing the economy. Changes in any component change GDP. This is why policymakers关注 consumption, investment, government spending, and net exports. The identity also shows that trade deficits (negative NX) reduce GDP relative to domestic spending—a country can spend more than it produces by importing more than it exports, but this must be financed by borrowing.",
          "application": "Use this identity to analyze economic fluctuations. If consumption falls, GDP falls unless another component rises. This is why governments sometimes increase spending during recessions—to offset falling private demand. The identity also helps forecast GDP: economists forecast each component and sum them. For policy analysis, knowing which component is changing helps identify the cause of economic fluctuations—a drop in investment might signal business pessimism; a drop in exports might signal global conditions.",
          "example": "In 2020, during the pandemic, consumption of services (restaurants, travel) collapsed. But consumption of goods surged, and government spending increased through stimulus and relief programs. Investment fell initially but recovered. Net exports improved as imports fell more than exports. The net effect was a sharp recession followed by rapid recovery. The $C + I + G + NX$ framework helps understand these dynamics.",
          
          "image": {
            "src": "images/unit2/expenditure_identity.png",
            "alt": "Bar chart showing components of GDP over time, with changes highlighted",
            "caption": "Figure 2.2.10: GDP = C + I + G + NX. Changes in any component affect total GDP."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating GDP by Expenditure Approach",
          
          "image": {
            "src": "images/unit2/gdp_expenditure_example.png",
            "alt": "Table of economic data for GDP expenditure calculation",
            "caption": "Figure 2.2.11: Use this data to calculate GDP using the expenditure approach."
          },
          
          "problem": "Given the following data for a country in 2023 (in billions of dollars): Consumption = $\\$4,500$, Investment = $\\$1,200$, Government spending = $\\$1,800$, Exports = $\\$600$, Imports = $\\$700$, Transfer payments = $\\$400$, Purchases of used goods = $\\$300$, Financial transactions = $\\$500$. a) Calculate GDP using the expenditure approach. b) What is the value of net exports? c) Why are transfer payments, used goods, and financial transactions excluded? d) If depreciation is $\\$400$ billion, what is Net Domestic Product (NDP)? e) If the population is 150 million, what is GDP per capita?",
          
          "step_by_step": [
            {
              "step": "Identify components for GDP",
              "explanation": "GDP = C + I + G + NX. C = $\\$4,500$, I = $\\$1,200$, G = $\\$1,800$, Exports = $\\$600$, Imports = $\\$700$. Transfer payments, used goods, and financial transactions are not counted in GDP."
            },
            {
              "step": "Calculate net exports",
              "explanation": "NX = Exports - Imports = $\\$600 - \\$700 = -\\$100$ billion. The country has a trade deficit."
            },
            {
              "step": "Calculate GDP",
              "explanation": "GDP = $4,500 + 1,200 + 1,800 + (-100) = \\$7,400$ billion."
            },
            {
              "step": "Explain exclusions",
              "explanation": "Transfer payments (like Social Security) are not payments for goods or services—they're just transfers of income. Used goods were counted when produced, so counting them again would double-count. Financial transactions (stocks, bonds) are just exchanges of assets, not production of new goods and services."
            },
            {
              "step": "Calculate NDP",
              "explanation": "Net Domestic Product = GDP - Depreciation = $7,400 - 400 = \\$7,000$ billion. NDP measures output net of capital consumed in production."
            },
            {
              "step": "Calculate GDP per capita",
              "explanation": "GDP per capita = GDP / Population = $7,400,000$ million / 150 million = $\\$49,333$ per person. This is a rough measure of average living standards."
            }
          ],
          
          "final_answer": "a) GDP = \\$7,400 billion. b) NX = -\\$100 billion. c) Transfer payments, used goods, financial transactions are not current production. d) NDP = \\$7,000 billion. e) GDP per capita = \\$49,333.",
          "concept_applied": "GDP includes only spending on currently produced final goods and services. The expenditure approach sums C + I + G + NX."
        },
        {
          "title": "Calculating GDP by Income Approach",
          
          "image": {
            "src": "images/unit2/gdp_income_example.png",
            "alt": "Table of income data for GDP income approach calculation",
            "caption": "Figure 2.2.12: Use this income data to verify GDP equals the expenditure approach total."
          },
          
          "problem": "Using the same economy from Example 1, the following income data are available (in billions): Wages = $\\$4,000$, Rent = $\\$500$, Interest = $\\$400$, Corporate profits = $\\$1,200$, Proprietor's income = $\\$800$, Indirect business taxes = $\\$300$, Depreciation = $\\$400$. a) Calculate GDP using the income approach. b) Does it match the expenditure approach total of $\\$7,400$ billion? c) What is National Income? d) What is the difference between National Income and GDP? e) Why might the income and expenditure approaches yield slightly different numbers in real-world data?",
          
          "step_by_step": [
            {
              "step": "Sum factor incomes",
              "explanation": "Factor incomes = Wages + Rent + Interest + Corporate profits + Proprietor's income = $4,000 + 500 + 400 + 1,200 + 800 = \\$6,900$ billion."
            },
            {
              "step": "Add adjustments",
              "explanation": "To get GDP, add indirect business taxes ($\\$300$) and depreciation ($\\$400$). GDP = $6,900 + 300 + 400 = \\$7,600$ billion? That's $\\$200$ billion higher than expenditure approach. Something's off—let's check."
            },
            {
              "step": "Reconcile difference",
              "explanation": "The expenditure approach gave $\\$7,400$. The income approach initially gives $\\$7,600$. There may be a statistical discrepancy, or some income category might be misstated. In practice, the two approaches rarely match exactly due to measurement errors. The difference here suggests we might have double-counted something or missed a component. Let's verify: National Income (NI) = factor incomes + indirect taxes = $6,900 + 300 = \\$7,200$. Then GDP = NI + depreciation = $7,200 + 400 = \\$7,600$. So the income approach suggests GDP is $\\$7,600$, while expenditure approach says $\\$7,400$. The $\\$200$ difference could be due to errors or omissions."
            },
            {
              "step": "Identify National Income",
              "explanation": "National Income = Wages + Rent + Interest + Profit + Proprietor's income + Indirect taxes = $6,900 + 300 = \\$7,200$ billion. This is total income earned by factors of production, before depreciation."
            },
            {
              "step": "Explain difference",
              "explanation": "GDP = National Income + Depreciation. Depreciation is the consumption of fixed capital—the value of capital worn out in production. National Income measures net income; GDP measures total output including replacement of worn-out capital."
            },
            {
              "step": "Real-world discrepancy",
              "explanation": "In real-world data, expenditure and income approaches rarely match perfectly because data come from different sources (surveys of households, firms, tax records). The statistical discrepancy is the adjustment made to force them to equal."
            }
          ],
          
          "final_answer": "a) Income approach GDP = \\$7,600 billion (assuming data correct). b) No—differs by \\$200 billion. c) National Income = \\$7,200 billion. d) GDP = NI + depreciation. e) Measurement errors cause discrepancies; statisticians reconcile them.",
          "concept_applied": "Income approach sums all incomes earned in production, then adds indirect taxes and depreciation to get GDP. It should equal expenditure approach in theory."
        },
        {
          "title": "Calculating Real GDP and GDP Deflator",
          
          "image": {
            "src": "images/unit2/real_gdp_example.png",
            "alt": "Table showing quantities and prices for two goods over two years",
            "caption": "Figure 2.2.13: Use this data to calculate nominal GDP, real GDP, and the GDP deflator."
          },
          
          "problem": "An economy produces only two goods: pizzas and sodas. Data for 2022 and 2023: 2022: Pizzas sold = 100, Price = $\\$10$; Sodas sold = 200, Price = $\\$2$. 2023: Pizzas sold = 120, Price = $\\$12$; Sodas sold = 250, Price = $\\$2.50$. a) Calculate nominal GDP for each year. b) Calculate real GDP for each year using 2022 as base year. c) Calculate the GDP deflator for each year. d) What was the growth rate of nominal GDP? Real GDP? e) How much of the nominal growth was due to inflation?",
          
          "step_by_step": [
            {
              "step": "Calculate nominal GDP 2022",
              "explanation": "Nominal GDP uses current prices and quantities. 2022: Pizzas: $100 \\times \\$10 = \\$1,000$; Sodas: $200 \\times \\$2 = \\$400$. Total = $\\$1,400$."
            },
            {
              "step": "Calculate nominal GDP 2023",
              "explanation": "2023: Pizzas: $120 \\times \\$12 = \\$1,440$; Sodas: $250 \\times \\$2.50 = \\$625$. Total = $\\$2,065$."
            },
            {
              "step": "Calculate real GDP 2022",
              "explanation": "Real GDP uses base-year (2022) prices. 2022 is base year, so real GDP 2022 = nominal GDP 2022 = $\\$1,400$."
            },
            {
              "step": "Calculate real GDP 2023",
              "explanation": "Use 2022 prices with 2023 quantities: Pizzas: $120 \\times \\$10 = \\$1,200$; Sodas: $250 \\times \\$2 = \\$500$. Total = $\\$1,700$."
            },
            {
              "step": "Calculate GDP deflator",
              "explanation": "GDP deflator = (Nominal GDP / Real GDP) × 100. 2022: $(1,400 / 1,400) × 100 = 100$. 2023: $(2,065 / 1,700) × 100 = 121.5$."
            },
            {
              "step": "Calculate growth rates",
              "explanation": "Nominal GDP growth = $(2,065 - 1,400) / 1,400 = 665/1,400 = 0.475 = 47.5%$. Real GDP growth = $(1,700 - 1,400) / 1,400 = 300/1,400 = 0.214 = 21.4%$."
            },
            {
              "step": "Identify inflation component",
              "explanation": "The difference between nominal and real growth is inflation: 47.5% - 21.4% = 26.1%. This matches the GDP deflator increase: (121.5 - 100)/100 = 21.5%? Wait, that's not matching exactly—let's recalculate inflation from deflator: (121.5 - 100)/100 = 21.5%. The difference in growth rates is 26.1%, not 21.5%. The relationship is approximate because of the way growth rates compound. More precisely, (1 + nominal growth) = (1 + real growth) × (1 + inflation). So 1.475 = 1.214 × (1 + inflation) → 1 + inflation = 1.475/1.214 = 1.215 → inflation = 21.5%. Yes, that matches the deflator."
            }
          ],
          
          "final_answer": "a) Nominal GDP: 2022 = \\$1,400, 2023 = \\$2,065. b) Real GDP: 2022 = \\$1,400, 2023 = \\$1,700. c) GDP deflator: 2022 = 100, 2023 = 121.5. d) Nominal growth = 47.5%, Real growth = 21.4%. e) Inflation = 21.5%.",
          "concept_applied": "Nominal GDP uses current prices; real GDP uses constant prices. The GDP deflator measures the price level. Real growth measures actual output increase."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify All Final Goods and Services Produced",
          "description": "Economists survey businesses, government agencies, and other sources to identify everything produced within the country during the period—from cars and computers to haircuts and government services.",
          "mechanism": "Data come from business surveys, tax records, retail sales reports, construction permits, and many other sources. Statisticians classify goods as final or intermediate.",
          "result": "A comprehensive list of final goods and services with quantities produced and prices.",
          
          "image": {
            "src": "images/unit2/gdp_step1.png",
            "alt": "Flowchart showing data collection from various economic sectors",
            "caption": "Figure 2.2.14: Step 1 - Collect data on all final goods and services produced."
          }
        },
        {
          "step": 2,
          "process": "Calculate Expenditure Components",
          "description": "Sort all spending into the four categories: Consumption (C), Investment (I), Government spending (G), and Net exports (NX).",
          "mechanism": "C: household surveys of spending. I: business surveys of investment, construction data, inventory changes. G: government budget data. NX: customs data on exports and imports.",
          "result": "Estimates of C, I, G, and NX, which sum to GDP.",
          
          "image": {
            "src": "images/unit2/gdp_step2.png",
            "alt": "Flowchart showing sorting of spending into C, I, G, NX categories",
            "caption": "Figure 2.2.15: Step 2 - Sort spending into expenditure components."
          }
        },
        {
          "step": 3,
          "process": "Calculate Income Components",
          "description": "Sum all incomes earned in production: wages, rent, interest, profit, plus indirect taxes and depreciation.",
          "mechanism": "Data from payroll records, corporate financial statements, tax returns, and surveys. National income accounts are constructed to match expenditure totals.",
          "result": "Income-side estimate of GDP, which should equal expenditure-side estimate.",
          
          "image": {
            "src": "images/unit2/gdp_step3.png",
            "alt": "Flowchart showing summation of wages, rent, interest, profit, etc.",
            "caption": "Figure 2.2.16: Step 3 - Sum all incomes earned in production."
          }
        },
        {
          "step": 4,
          "process": "Calculate Value Added by Sector",
          "description": "For each industry, calculate value added = value of output minus cost of intermediate goods. Sum across all industries.",
          "mechanism": "Data from industry surveys and input-output tables. Value added by industry shows which sectors contribute most to GDP.",
          "result": "Industry-level GDP estimates, useful for structural analysis.",
          
          "image": {
            "src": "images/unit2/gdp_step4.png",
            "alt": "Flowchart showing value added calculation for different industries",
            "caption": "Figure 2.2.17: Step 4 - Calculate value added by industry."
          }
        },
        {
          "step": 5,
          "process": "Reconcile Approaches and Adjust for Errors",
          "description": "Compare expenditure, income, and value-added estimates. Adjust for statistical discrepancies to produce final GDP figure.",
          "mechanism": "Statistical discrepancy line item absorbs differences. Revisions occur as more complete data become available.",
          "result": "Official GDP estimate, released quarterly with revisions.",
          
          "image": {
            "src": "images/unit2/gdp_step5.png",
            "alt": "Flowchart showing reconciliation of three approaches to GDP",
            "caption": "Figure 2.2.18: Step 5 - Reconcile the three approaches to produce final GDP."
          }
        }
      ],

      "image": {
        "src": "images/unit2/gdp_summary.png",
        "alt": "Comprehensive summary diagram showing all GDP concepts: definition, approaches, nominal vs real, limitations",
        "caption": "Figure 2.2.19: GDP summary - definition, measurement approaches, price adjustment, and limitations."
      }
    }
  ],

  "key_terms": [
    "Gross Domestic Product (GDP)",
    "Final goods",
    "Intermediate goods",
    "Market value",
    "Current production",
    "Expenditure approach",
    "Income approach",
    "Value-added approach",
    "Consumption (C)",
    "Investment (I)",
    "Government spending (G)",
    "Net exports (NX)",
    "Durable goods",
    "Nondurable goods",
    "Services",
    "Residential investment",
    "Inventory investment",
    "Capital goods",
    "Transfer payments",
    "Depreciation",
    "Consumption of fixed capital",
    "Net Domestic Product (NDP)",
    "National Income (NI)",
    "Personal Income",
    "Disposable Income",
    "Nominal GDP",
    "Real GDP",
    "Base year",
    "GDP deflator",
    "Chain-weighted index",
    "GDP per capita",
    "Double-counting",
    "Statistical discrepancy",
    "Gross National Product (GNP)",
    "Net National Product (NNP)",
    "Simon Kuznets",
    "Bureau of Economic Analysis (BEA)",
    "National income accounts"
  ],

  "summary": "Gross Domestic Product (GDP) is the market value of all final goods and services produced within a country in a given period. It is the primary measure of a country's economic output and a key indicator of economic performance. GDP has five key components in its definition: market value (using prices to aggregate different goods), all (including everything produced in the economy), final (excluding intermediate goods to avoid double-counting), goods and services (both tangible and intangible), produced within a country (domestic production regardless of ownership), and in a given period (a flow variable measured quarterly or annually). GDP can be calculated using three equivalent approaches. The expenditure approach sums spending on final goods: $GDP = C + I + G + NX$, where C is household consumption, I is business investment (including residential construction and inventory changes), G is government purchases of goods and services, and NX is net exports (exports minus imports). The income approach sums all incomes earned in production: wages, rent, interest, profit, plus indirect business taxes and depreciation. The value-added approach sums the value added at each stage of production, avoiding double-counting of intermediate goods. All three approaches yield the same total in theory, though statistical discrepancies arise in practice. Nominal GDP measures output at current prices; real GDP adjusts for inflation using constant base-year prices to measure changes in physical output. The GDP deflator (Nominal GDP / Real GDP × 100) measures the overall price level. Real GDP growth is the true measure of economic growth. GDP is an essential measure but has limitations: it excludes non-market activities (like unpaid household work), ignores environmental degradation, says nothing about income distribution, and does not measure leisure or overall well-being. Despite these limitations, GDP per capita is strongly correlated with many measures of living standards and remains the most widely used indicator of economic performance. Understanding GDP—what it includes, how it's calculated, and its strengths and weaknesses—is fundamental to macroeconomics."
}
