{
  "expanded_description": "Why does a dollar buy less today than it did ten years ago? Why do workers demand raises every year? Why do central banks worry about prices rising too fast? The answer is inflation—the sustained increase in the general price level of goods and services. Inflation erodes purchasing power, redistributes income, and creates uncertainty. But moderate inflation is normal in a growing economy, and deflation (falling prices) can be even more dangerous. Understanding inflation—how we measure it, what causes it, and who it hurts—is essential for interpreting economic news, making financial decisions, and evaluating policy. The most widely used measure of inflation is the Consumer Price Index (CPI), which tracks the cost of a typical basket of goods and services. Other measures include the Producer Price Index (PPI) and the GDP deflator. In this section, we'll learn how price indices are constructed, how to calculate inflation rates, and how to adjust nominal values for inflation to compare purchasing power over time. We'll also explore the costs of inflation—anticipated and unanticipated—and the distinction between nominal and real interest rates. Understanding these concepts is essential for anyone who earns, saves, or spends money.",
  
  "core_concept": {
    "principle": "Inflation is a sustained increase in the general price level of goods and services in an economy over a period of time. When the price level rises, each unit of currency buys fewer goods and services—purchasing power falls. The inflation rate is the percentage change in the price level from one period to another. The most common measure of inflation is the Consumer Price Index (CPI), which measures the cost of a fixed basket of goods and services purchased by a typical urban consumer. The CPI is calculated as: $\\text{CPI} = \\frac{\\text{Cost of Basket in Current Year}}{\\text{Cost of Basket in Base Year}} \\times 100$. The inflation rate is then: $\\text{Inflation Rate} = \\frac{\\text{CPI}_\\text{current} - \\text{CPI}_\\text{previous}}{\\text{CPI}_\\text{previous}} \\times 100\\%$. Other price indices include the Producer Price Index (PPI), which measures prices at the wholesale level, and the GDP deflator, which measures prices of all goods and services included in GDP. Inflation can be caused by demand-pull factors (too much spending chasing too few goods) or cost-push factors (increases in production costs). Inflation redistributes income, creates uncertainty, and imposes costs—shoe-leather costs, menu costs, and tax distortions. Unanticipated inflation hurts creditors and helps debtors. The real interest rate adjusts the nominal interest rate for inflation: $\\text{Real Interest Rate} = \\text{Nominal Interest Rate} - \\text{Inflation Rate}$.",
    
    "explanation": "Imagine you have $\\$100$ today. A typical basket of groceries costs $\\$100$. You can buy exactly one basket. Next year, the same basket costs $\\$103$. Your $\\$100$ now buys only about 97% of a basket. Your purchasing power has fallen by 3%—that's inflation. The CPI measures this by tracking the prices of hundreds of goods: bread, milk, gasoline, housing, medical care, etc. The Bureau of Labor Statistics surveys thousands of households to determine what a typical family buys, then checks prices monthly in thousands of stores. The result is the CPI, reported each month. If the CPI rises from 100 to 103 over a year, the inflation rate is 3%. Now consider borrowing and lending. You lend $\\$100$ at 5% interest. After a year, you get back $\\$105$. But if inflation was 3%, your $\\$105$ buys only what $\\$102$ would have bought before—your real return is only 2%. The nominal interest rate (5%) minus inflation (3%) equals the real interest rate (2%). Inflation transfers purchasing power from lenders to borrowers if it's unanticipated. That's why inflation matters—it affects everyone who earns, saves, borrows, or spends money.",
    
    "image": {
      "src": "images/unit2/inflation_overview.png",
      "alt": "Diagram showing purchasing power erosion over time with rising prices",
      "caption": "Figure 2.4.1: Inflation reduces purchasing power. The same amount of money buys fewer goods over time as prices rise."
    }
  },

  "sections": [
    {
      "section_title": "2.4 Inflation and Price Indices",
      "introduction": "Inflation affects everyone. It determines how far your paycheck goes, what you'll pay for a college education, and how much your savings will be worth when you retire. It influences interest rates, exchange rates, and economic policy. But inflation isn't just about prices going up—it's about measuring those changes, understanding their causes, and coping with their consequences. In this section, we'll learn how economists measure inflation using price indices like the CPI, how to calculate inflation rates, and how to adjust dollar figures for inflation to compare values over time. We'll also explore the different types of inflation, who wins and loses, and why even moderate inflation matters for economic decisions.",
      
      "introduction_image": {
        "src": "images/unit2/cpi_basket.png",
        "alt": "Illustration of a shopping basket containing typical consumer goods: food, clothing, housing, transportation, medical care",
        "caption": "Figure 2.4.2: The CPI measures the cost of a fixed basket of goods and services purchased by a typical urban consumer."
      },
      
      "key_concept": {
        "definition": "The Consumer Price Index (CPI) is the most widely used measure of inflation. It measures the cost of a fixed basket of goods and services relative to the cost of the same basket in a base year. The Bureau of Labor Statistics (BLS) determines the basket by surveying households about their spending patterns. The basket includes eight major categories: food and beverages, housing, apparel, transportation, medical care, recreation, education and communication, and other goods and services. Each category is weighted by its share of typical spending. The CPI is calculated monthly by collecting prices from thousands of retail stores, service establishments, and rental units. The formula is: $\\text{CPI} = \\frac{\\text{Cost of Basket in Current Year}}{\\text{Cost of Basket in Base Year}} \\times 100$. The inflation rate is the percentage change in the CPI: $\\frac{\\text{CPI}_2 - \\text{CPI}_1}{\\text{CPI}_1} \\times 100\\%$. Other price indices include: the Producer Price Index (PPI), measuring prices at the wholesale level; the GDP deflator, measuring prices of all goods and services in GDP; and the Personal Consumption Expenditures (PCE) price index, used by the Federal Reserve. Each index has strengths and weaknesses. The CPI tends to overstate inflation due to substitution bias, quality bias, and new product bias. The PCE index addresses some of these issues and is preferred by the Fed.",
        
        "context": "Price measurement has a long history. During World War I, rapid inflation led to the development of cost-of-living indices. The U.S. began publishing the CPI in 1919. Today, the CPI affects millions of people directly—Social Security benefits, tax brackets, and many contracts are indexed to the CPI. The accuracy of inflation measurement matters enormously. The Boskin Commission in 1996 estimated that the CPI overstates inflation by about 1.1 percentage points annually, leading to overpayments of trillions in indexed benefits. Subsequent improvements have reduced but not eliminated this bias. In AP Macroeconomics, understanding price indices is essential for comparing economic values over time, analyzing the costs of inflation, and understanding monetary policy. The distinction between nominal and real variables—adjusted for inflation—is one of the most important concepts in economics.",
        
        "image": {
          "src": "images/unit2/cpi_weights.png",
          "alt": "Pie chart showing CPI expenditure weights by category: housing largest, then transportation, food, medical care, etc.",
          "caption": "Figure 2.4.3: CPI components and their weights. Housing is the largest category, followed by transportation and food."
        }
      },

      "classifications": [
        {
          "type": "Consumer Price Index (CPI)",
          "value": "Measures cost of fixed basket of consumer goods",
          "characteristics": ["Fixed basket", "Urban consumers", "Monthly", "Most widely used", "Affects policy", "Has biases"],
          "behavior": "CPI measures the cost of living for a typical urban household. It's calculated by pricing the same basket of goods each month, using the same weights as the base year. When prices rise, the CPI increases; when they fall, it decreases. The CPI is used to adjust Social Security benefits, tax brackets, and many contracts. It's also used to calculate real wages and real incomes by dividing nominal values by the CPI and multiplying by 100.",
          
          "image": {
            "src": "images/unit2/cpi_formula.png",
            "alt": "CPI formula with example calculation",
            "caption": "Figure 2.4.4: CPI = (Cost of basket current year / Cost of basket base year) × 100."
          },
          
          "examples": [
            {
              "process": "Basket determination",
              "explanation": "BLS surveys 24,000 households to determine what typical consumers buy. The basket is updated periodically to reflect changing consumption patterns. For example, smartphones are now in the basket; typewriters are not."
            },
            {
              "process": "Price collection",
              "explanation": "BLS employees collect prices monthly for about 80,000 items in 23,000 retail stores and rental units. They also collect prices online and by phone."
            },
            {
              "process": "Calculation",
              "explanation": "If the base year basket cost $\\$100$ and the same basket now costs $\\$120$, the CPI is 120. The inflation rate since the base year is 20%."
            }
          ]
        },
        {
          "type": "Producer Price Index (PPI)",
          "value": "Measures prices at wholesale/producer level",
          "characteristics": ["Wholesale prices", "Leading indicator", "Industry-specific", "Includes raw materials", "B2B transactions"],
          "behavior": "PPI measures the average change in selling prices received by domestic producers for their output. Unlike CPI, which measures what consumers pay, PPI measures what producers receive. It includes prices at various stages of production: crude materials, intermediate goods, and finished goods. PPI often leads CPI—when producers pay more, they eventually pass costs to consumers. PPI is used by businesses for contract adjustment and by economists as an early warning of consumer inflation.",
          
          "image": {
            "src": "images/unit2/ppi.png",
            "alt": "Diagram showing stages: raw materials, intermediate goods, finished goods, with PPI measured at each stage",
            "caption": "Figure 2.4.5: PPI measures prices at various production stages—raw materials, intermediate goods, finished goods."
          },
          
          "examples": [
            {
              "process": "Crude materials",
              "explanation": "Raw commodities like oil, lumber, wheat. Price increases here may eventually work through to consumer prices."
            },
            {
              "process": "Intermediate goods",
              "explanation": "Partly finished goods like steel, fabric, chemicals. Used in further production."
            },
            {
              "process": "Finished goods",
              "explanation": "Goods ready for sale to consumers or businesses. This stage is closest to CPI."
            }
          ]
        },
        {
          "type": "GDP Deflator",
          "value": "Measures prices of all goods and services in GDP",
          "characteristics": ["Broadest measure", "Includes all domestically produced", "Changes with composition", "Implicit price index", "Used for real GDP"],
          "behavior": "The GDP deflator is the ratio of nominal GDP to real GDP, multiplied by 100: $\\text{GDP Deflator} = \\frac{\\text{Nominal GDP}}{\\text{Real GDP}} \\times 100$. Unlike CPI, which uses a fixed basket, the GDP deflator allows the basket to change as the composition of GDP changes. It includes all goods and services produced domestically—including capital goods and government services—not just consumer goods. It excludes imports. The GDP deflator is a broader measure of price change than CPI but is available only quarterly.",
          
          "image": {
            "src": "images/unit2/gdp_deflator.png",
            "alt": "Formula showing GDP deflator = (Nominal GDP / Real GDP) × 100",
            "caption": "Figure 2.4.6: GDP deflator measures prices of all domestically produced goods and services."
          },
          
          "examples": [
            {
              "process": "Comparison with CPI",
              "explanation": "If the price of imported oil rises, CPI increases (consumers pay more), but GDP deflator may not (imports aren't part of domestic production). If the price of domestically produced machinery rises, GDP deflator increases, but CPI may not (machinery isn't a consumer good)."
            },
            {
              "process": "Calculation",
              "explanation": "If nominal GDP is $20$ trillion and real GDP is $18$ trillion, the GDP deflator is $(20/18) × 100 = 111.1$, indicating prices are 11.1% above the base year."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "CPI Tends to Overstate Inflation Due to Biases",
          "statement": "The fixed-basket approach of the CPI creates several biases that cause it to overstate true inflation. Substitution bias occurs when consumers switch away from goods whose prices rise fastest, but the fixed basket doesn't reflect this substitution. Quality bias occurs when quality improvements are partially counted as price increases. New product bias occurs because new products (like smartphones) are added to the basket only with a lag, missing the initial price declines after introduction. Outlet bias occurs as consumers shift to discount stores, but the CPI may not fully capture lower prices. The Boskin Commission estimated these biases total about 1.1 percentage points annually, meaning true inflation is lower than reported CPI.",
          "application": "When interpreting CPI data, recognize that it may overstate inflation. This matters for policy—if the CPI overstates inflation, cost-of-living adjustments (like Social Security COLAs) overpay beneficiaries, and the government over-spends. The BLS has made adjustments to reduce bias, including updating the basket more frequently and using geometric weighting to account for substitution. The Chained CPI (C-CPI-U) addresses substitution bias more fully and is sometimes used for policy.",
          "example": "Suppose the price of beef rises 10% and chicken prices are unchanged. Consumers buy less beef and more chicken. The fixed CPI basket still assumes the same beef-chicken mix, so it overstates the increase in the cost of living. The true cost of living increase is less because consumers substituted away from the more expensive good. This substitution bias causes CPI to overstate inflation.",
          
          "image": {
            "src": "images/unit2/cpi_bias.png",
            "alt": "Diagram showing substitution bias: consumer shifts from expensive beef to cheaper chicken, but fixed basket misses this",
            "caption": "Figure 2.4.7: Substitution bias occurs when consumers change buying patterns in response to relative price changes, but the fixed CPI basket doesn't reflect this."
          }
        },
        {
          "principle": "Inflation Redistributes Income and Wealth",
          "statement": "Inflation does not affect everyone equally. It redistributes purchasing power from some groups to others. Unanticipated inflation hurts creditors (lenders) and helps debtors (borrowers) because loans are repaid with money that's worth less than expected. It hurts people with fixed incomes (like retirees with fixed pensions) because their purchasing power erodes. It helps people whose incomes rise faster than inflation, like workers with strong bargaining power or businesses with pricing power. Inflation also redistributes wealth between holders of different assets. Real assets (real estate, commodities) may hold value; nominal assets (cash, bonds) lose value. This redistribution can be arbitrary and unfair, which is why stable, predictable inflation is a policy goal.",
          "application": "When making financial decisions, consider inflation. Borrowing at a fixed rate during periods of high inflation benefits the borrower (repaying with cheaper dollars). Lending during high inflation hurts the lender unless the interest rate adequately compensates for expected inflation. This is why nominal interest rates incorporate inflation expectations (the Fisher effect). Workers should negotiate wages that keep up with inflation. Investors should consider real returns, not just nominal returns.",
          "example": "Suppose you lend $\\$1,000$ at 5% interest for one year, expecting 2% inflation. You expect a real return of 3%. If inflation turns out to be 5%, your real return is 0%—the $\\$1,050$ repaid buys what $\\$1,000$ bought a year ago. The borrower gains at your expense. If inflation turns out to be 0%, your real return is 5%—you gain at the borrower's expense. Unanticipated inflation creates winners and losers arbitrarily.",
          
          "image": {
            "src": "images/unit2/inflation_redistribution.png",
            "alt": "Diagram showing winners and losers from inflation: debtors gain, creditors lose; flexible income gain, fixed income lose",
            "caption": "Figure 2.4.8: Inflation redistributes income. Debtors gain, creditors lose; those with flexible incomes gain, fixed incomes lose."
          }
        },
        {
          "principle": "The Real Interest Rate Adjusts for Inflation",
          "statement": "The nominal interest rate is the stated rate—what you see on a loan or savings account. The real interest rate adjusts for inflation and measures the true cost of borrowing and the true return to lending. The Fisher equation expresses this relationship: $\\text{Real Interest Rate} = \\text{Nominal Interest Rate} - \\text{Inflation Rate}$. For example, if a bank pays 5% on savings and inflation is 3%, the real return is 2%. If inflation is 5%, the real return is 0%. The expected real interest rate uses expected inflation; the ex post real rate uses actual inflation. Decisions to save, invest, and borrow depend on real interest rates, not nominal rates.",
          "application": "When evaluating investment returns or loan costs, always consider the real interest rate. A high nominal rate may be low or negative in real terms if inflation is high. A low nominal rate may be attractive if inflation is very low. Central banks focus on real rates when setting monetary policy—they care about the real cost of borrowing. The Fisher effect suggests that nominal rates adjust one-for-one with expected inflation in the long run, leaving real rates unchanged.",
          "example": "In the 1970s, U.S. nominal interest rates were high—mortgage rates reached 15% or more. But inflation was also high, often 10% or more. The real interest rate was sometimes negative—borrowers gained, lenders lost. In contrast, in the 2000s, nominal rates were low (5-6%), but inflation was also low (2-3%), so real rates were positive. The real cost of borrowing was actually higher in the 2000s despite lower nominal rates.",
          
          "image": {
            "src": "images/unit2/real_interest_rate.png",
            "alt": "Graph showing nominal and real interest rates over time, with gap representing inflation",
            "caption": "Figure 2.4.9: Real interest rate = Nominal rate - Inflation rate. Real rates matter for saving and investment decisions."
          }
        },
        {
          "principle": "Hyperinflation Can Destroy an Economy",
          "statement": "While moderate inflation is normal, extremely high inflation—hyperinflation—is devastating. Hyperinflation is typically defined as inflation exceeding 50% per month. When hyperinflation strikes, money loses value so rapidly that people stop using it. They resort to barter, foreign currency, or commodity money. Savings are wiped out. Economic activity collapses as prices change by the hour. Hyperinflation is caused by massive increases in the money supply, usually to finance government spending when tax systems collapse. Famous hyperinflations occurred in Germany (1923), Zimbabwe (2008), and Venezuela (2010s). These episodes illustrate the dangers of losing control over the money supply and the importance of central bank independence.",
          "application": "Hyperinflation shows why central banks must be independent and committed to price stability. It also shows why governments cannot rely on printing money to finance spending without catastrophic consequences. For investors, hyperinflation demonstrates the importance of real assets—during hyperinflation, stocks, real estate, and foreign currency preserve value while cash becomes worthless. Understanding hyperinflation helps explain why price stability is a primary goal of monetary policy.",
          "example": "In Zimbabwe in 2008, inflation reached an estimated 79.6 billion percent month-on-month. Prices doubled every 24 hours. The government printed $\\$100$ trillion notes. People carried wheelbarrows of cash to buy bread. Savings were wiped out. The economy collapsed, and eventually Zimbabwe abandoned its currency and adopted foreign currencies. This extreme case shows the ultimate consequence of unchecked inflation.",
          
          "image": {
            "src": "images/unit2/hyperinflation.png",
            "alt": "Photo of Zimbabwe $100 trillion note or German children playing with bundles of cash",
            "caption": "Figure 2.4.10: Hyperinflation destroys currency value. Pictured: Zimbabwe $100 trillion note—worth less than the paper it's printed on."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating CPI and Inflation Rate",
          
          "image": {
            "src": "images/unit2/cpi_calculation.png",
            "alt": "Table showing basket quantities and prices for three goods over three years",
            "caption": "Figure 2.4.11: Use this data to calculate CPI and inflation rates."
          },
          
          "problem": "A simple economy produces only three goods: books, pizzas, and jeans. The typical consumer buys 5 books, 10 pizzas, and 2 jeans per year. Prices are: 2022: Books $\\$20$, Pizzas $\\$10$, Jeans $\\$40$. 2023: Books $\\$22$, Pizzas $\\$11$, Jeans $\\$42$. 2024: Books $\\$25$, Pizzas $\\$12$, Jeans $\\$45$. a) Calculate the cost of the basket in each year. b) Using 2022 as the base year, calculate the CPI for each year. c) Calculate the inflation rate for 2023 and 2024. d) If a worker earned $\\$50,000$ in 2022, what salary would be equivalent in 2024 purchasing power? e) What was the cumulative inflation over the two-year period?",
          
          "step_by_step": [
            {
              "step": "Calculate basket cost 2022",
              "explanation": "Basket = (5 books × $\\$20$) + (10 pizzas × $\\$10$) + (2 jeans × $\\$40$) = $\\$100 + \\$100 + \\$80 = \\$280$."
            },
            {
              "step": "Calculate basket cost 2023",
              "explanation": "2023 prices: Books $\\$22$, Pizzas $\\$11$, Jeans $\\$42$. Cost = (5 × $\\$22$) + (10 × $\\$11$) + (2 × $\\$42$) = $\\$110 + \\$110 + \\$84 = \\$304$."
            },
            {
              "step": "Calculate basket cost 2024",
              "explanation": "2024 prices: Books $\\$25$, Pizzas $\\$12$, Jeans $\\$45$. Cost = (5 × $\\$25$) + (10 × $\\$12$) + (2 × $\\$45$) = $\\$125 + \\$120 + \\$90 = \\$335$."
            },
            {
              "step": "Calculate CPI (2022 base year)",
              "explanation": "CPI = (Current basket cost / Base year basket cost) × 100. 2022: $(280/280) × 100 = 100$. 2023: $(304/280) × 100 = 108.6$. 2024: $(335/280) × 100 = 119.6$."
            },
            {
              "step": "Calculate inflation rates",
              "explanation": "Inflation 2023 = $(108.6 - 100)/100 × 100 = 8.6%$. Inflation 2024 = $(119.6 - 108.6)/108.6 × 100 = 10.1%$."
            },
            {
              "step": "Calculate equivalent salary",
              "explanation": "Real value = (Nominal in base year) × (CPI current / CPI base). $\\$50,000 × (119.6/100) = \\$59,800$. So $\\$50,000$ in 2022 had the same purchasing power as $\\$59,800$ in 2024."
            },
            {
              "step": "Calculate cumulative inflation",
              "explanation": "Cumulative inflation = $(119.6 - 100)/100 × 100 = 19.6%$. Over two years, prices rose 19.6%."
            }
          ],
          
          "final_answer": "a) 2022: $\\$280$, 2023: $\\$304$, 2024: $\\$335$. b) CPI: 2022=100, 2023=108.6, 2024=119.6. c) Inflation: 2023=8.6%, 2024=10.1%. d) Equivalent salary = $\\$59,800$. e) Cumulative inflation = 19.6%.",
          "concept_applied": "CPI measures the cost of a fixed basket. Inflation is the percentage change in CPI. Adjust nominal values by multiplying by the CPI ratio to compare purchasing power."
        },
        {
          "title": "Adjusting for Inflation: Real vs. Nominal Values",
          
          "image": {
            "src": "images/unit2/real_vs_nominal.png",
            "alt": "Table showing nominal wages and CPI over several years",
            "caption": "Figure 2.4.12: Use this wage and CPI data to calculate real wages."
          },
          
          "problem": "The table shows average hourly wages and the CPI for selected years (1980-2020, with 1982-84 as base year = 100): 1980: Wage $\\$3.10$, CPI 82.4; 1990: Wage $\\$5.00$, CPI 130.7; 2000: Wage $\\$8.00$, CPI 172.2; 2010: Wage $\\$10.00$, CPI 218.1; 2020: Wage $\\$12.50$, CPI 260.5. a) Calculate the real wage for each year in 1982-84 dollars. b) In which year was the real wage highest? c) What was the percentage increase in nominal wages from 1980 to 2020? In real wages? d) Why do real wages matter more than nominal wages? e) If wages had kept up with inflation, what would the nominal wage be in 2020 based on 1980 purchasing power?",
          
          "step_by_step": [
            {
              "step": "Calculate real wage formula",
              "explanation": "Real wage = (Nominal wage / CPI) × 100. This expresses the wage in base-year dollars (1982-84 purchasing power)."
            },
            {
              "step": "Calculate 1980 real wage",
              "explanation": "$\\$3.10 / 82.4 × 100 = \\$3.76$ in 1982-84 dollars."
            },
            {
              "step": "Calculate 1990 real wage",
              "explanation": "$\\$5.00 / 130.7 × 100 = \\$3.83$."
            },
            {
              "step": "Calculate 2000 real wage",
              "explanation": "$\\$8.00 / 172.2 × 100 = \\$4.65$."
            },
            {
              "step": "Calculate 2010 real wage",
              "explanation": "$\\$10.00 / 218.1 × 100 = \\$4.59$."
            },
            {
              "step": "Calculate 2020 real wage",
              "explanation": "$\\$12.50 / 260.5 × 100 = \\$4.80$."
            },
            {
              "step": "Identify highest real wage",
              "explanation": "Comparing: 1980: $\\$3.76$, 1990: $\\$3.83$, 2000: $\\$4.65$, 2010: $\\$4.59$, 2020: $\\$4.80$. The highest is 2020 at $\\$4.80$ (though 2000 was close at $\\$4.65$)."
            },
            {
              "step": "Calculate wage increases",
              "explanation": "Nominal increase: $(12.50 - 3.10)/3.10 × 100 = 303%$. Real increase: $(4.80 - 3.76)/3.76 × 100 = 27.7%$. Most of the nominal increase was inflation."
            },
            {
              "step": "Calculate inflation-adjusted wage",
              "explanation": "If wages kept up with inflation, the 2020 wage would maintain 1980 purchasing power: $\\$3.10 × (260.5/82.4) = \\$3.10 × 3.16 = \\$9.80$. Actual wage ($\\$12.50$) is higher, so real wages rose."
            }
          ],
          
          "final_answer": "a) Real wages: 1980=$\\$3.76$, 1990=$\\$3.83$, 2000=$\\$4.65$, 2010=$\\$4.59$, 2020=$\\$4.80$. b) 2020 highest. c) Nominal +303%, real +27.7%. d) Real wages measure actual purchasing power. e) Inflation-adjusted = $\\$9.80$.",
          "concept_applied": "Real values adjust for inflation to show true purchasing power. Nominal values can be misleading when prices change."
        },
        {
          "title": "Real vs. Nominal Interest Rates",
          
          "image": {
            "src": "images/unit2/interest_rates.png",
            "alt": "Table showing nominal interest rates and inflation rates over several years",
            "caption": "Figure 2.4.13: Use this interest rate data to calculate real interest rates."
          },
          
          "problem": "A saver deposits $\\$10,000$ in a one-year CD at various times. The nominal interest rate and actual inflation for each year are: 1975: Nominal rate 8%, Inflation 9%; 1985: Nominal rate 10%, Inflation 4%; 1995: Nominal rate 6%, Inflation 3%; 2005: Nominal rate 4%, Inflation 3.5%; 2015: Nominal rate 1.5%, Inflation 0.5%. a) Calculate the ex post real interest rate for each year. b) In which year did the saver have the highest real return? c) In which year did the saver have a negative real return? d) If the saver expected 5% inflation in 1975, what was the expected real rate? The actual real rate? e) What does this illustrate about unanticipated inflation?",
          
          "step_by_step": [
            {
              "step": "Calculate real interest rate formula",
              "explanation": "Real interest rate = Nominal rate - Actual inflation rate (ex post)."
            },
            {
              "step": "Calculate 1975 real rate",
              "explanation": "8% - 9% = -1%. Negative real return—saver lost purchasing power despite positive nominal return."
            },
            {
              "step": "Calculate 1985 real rate",
              "explanation": "10% - 4% = 6%. Excellent real return."
            },
            {
              "step": "Calculate 1995 real rate",
              "explanation": "6% - 3% = 3%. Solid positive real return."
            },
            {
              "step": "Calculate 2005 real rate",
              "explanation": "4% - 3.5% = 0.5%. Modest positive return."
            },
            {
              "step": "Calculate 2015 real rate",
              "explanation": "1.5% - 0.5% = 1%. Positive but low."
            },
            {
              "step": "Identify highest and negative",
              "explanation": "Highest real return: 1985 at 6%. Negative real return: 1975 at -1%."
            },
            {
              "step": "Calculate expected vs actual in 1975",
              "explanation": "Expected real rate with 5% expected inflation = 8% - 5% = 3%. Actual real rate = -1%. Unanticipated inflation of 4% (9% actual vs 5% expected) turned a positive expected return into a negative actual return."
            }
          ],
          
          "final_answer": "a) 1975: -1%, 1985: 6%, 1995: 3%, 2005: 0.5%, 2015: 1%. b) 1985 highest. c) 1975 negative. d) Expected 3%, actual -1%. e) Unanticipated inflation hurts lenders/savers.",
          "concept_applied": "Real interest rate = Nominal - Inflation. Unanticipated inflation redistributes from lenders to borrowers."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Determine Consumer Expenditure Basket",
          "description": "BLS surveys thousands of households to determine what typical consumers buy and how much they spend on each category.",
          "mechanism": "Consumer Expenditure Survey collects detailed spending diaries. Results determine the basket composition and weights for the CPI. The basket is updated periodically (every 2 years now) to reflect changing consumption patterns.",
          "result": "A fixed basket of goods and services with expenditure weights for each item.",
          
          "image": {
            "src": "images/unit2/cpi_step1.png",
            "alt": "Survey forms and shopping carts representing consumer expenditure survey",
            "caption": "Figure 2.4.14: Step 1 - Survey households to determine what consumers buy and how much they spend."
          }
        },
        {
          "step": 2,
          "process": "Collect Prices Monthly",
          "description": "BLS economists collect prices for each item in the basket from thousands of retail stores, service establishments, and rental units across the country.",
          "mechanism": "Data collectors visit or call stores; some data are collected online. Prices are collected for the same items each month to track changes. Housing costs are measured through rental equivalence—what homeowners would pay to rent their homes.",
          "result": "Monthly price data for thousands of items.",
          
          "image": {
            "src": "images/unit2/cpi_step2.png",
            "alt": "Data collector in store with clipboard, online price checking",
            "caption": "Figure 2.4.15: Step 2 - Collect prices monthly for thousands of items in stores across the country."
          }
        },
        {
          "step": 3,
          "process": "Calculate Item Price Indices",
          "description": "For each item category, calculate average price change using statistical methods that account for quality changes and new products.",
          "mechanism": "Hedonic regression adjusts for quality changes. Geometric means account for substitution within categories. Prices are aggregated using expenditure weights.",
          "result": "Price relatives for each category—how much prices have changed since the base period.",
          
          "image": {
            "src": "images/unit2/cpi_step3.png",
            "alt": "Calculator and formulas representing price index calculations",
            "caption": "Figure 2.4.16: Step 3 - Calculate average price changes for each category, adjusting for quality."
          }
        },
        {
          "step": 4,
          "process": "Aggregate to Overall CPI",
          "description": "Combine category price changes using expenditure weights to compute the overall CPI.",
          "mechanism": "Weighted average of category price changes. The formula: $\\text{CPI} = \\sum (\\text{Price Relative}_i \\times \\text{Weight}_i)$. Results are published for all urban consumers (CPI-U) and urban wage earners (CPI-W).",
          "result": "Headline CPI number for the month.",
          
          "image": {
            "src": "images/unit2/cpi_step4.png",
            "alt": "Pie chart with weights and formula for weighted average",
            "caption": "Figure 2.4.17: Step 4 - Aggregate category price changes using expenditure weights to get overall CPI."
          }
        },
        {
          "step": 5,
          "process": "Publish and Revise",
          "description": "BLS releases CPI data monthly, usually in the second or third week of the following month. Data are revised only for seasonally adjusted figures.",
          "mechanism": "Press releases, detailed tables, and databases. Data are used for policy, inflation adjustments (COLAs), and economic analysis.",
          "result": "Monthly inflation report, affecting markets, policy, and indexed payments.",
          
          "image": {
            "src": "images/unit2/cpi_step5.png",
            "alt": "BLS website, news report showing CPI release",
            "caption": "Figure 2.4.18: Step 5 - BLS publishes CPI monthly. The data affect Social Security, tax brackets, and policy decisions."
          }
        }
      ],

      "image": {
        "src": "images/unit2/inflation_summary.png",
        "alt": "Comprehensive summary diagram showing CPI, inflation calculation, real vs nominal, and costs of inflation",
        "caption": "Figure 2.4.19: Inflation summary - measurement, adjustment, and economic effects."
      }
    }
  ],

  "key_terms": [
    "Inflation",
    "Inflation rate",
    "Price level",
    "Purchasing power",
    "Consumer Price Index (CPI)",
    "CPI-U",
    "CPI-W",
    "Chained CPI (C-CPI-U)",
    "Producer Price Index (PPI)",
    "GDP deflator",
    "Personal Consumption Expenditures (PCE) price index",
    "Basket of goods",
    "Base year",
    "Expenditure weights",
    "Market basket",
    "Substitution bias",
    "Quality bias",
    "New product bias",
    "Outlet bias",
    "Boskin Commission",
    "Cost-of-living adjustment (COLA)",
    "Indexation",
    "Nominal value",
    "Real value",
    "Real income",
    "Real wage",
    "Nominal interest rate",
    "Real interest rate",
    "Fisher effect",
    "Expected inflation",
    "Unanticipated inflation",
    "Demand-pull inflation",
    "Cost-push inflation",
    "Wage-price spiral",
    "Hyperinflation",
    "Deflation",
    "Disinflation",
    "Shoe-leather costs",
    "Menu costs",
    "Unit-of-account costs",
    "Inflation tax",
    "Seigniorage",
    "Quantity theory of money"
  ],

  "summary": "Inflation is a sustained increase in the general price level, reducing the purchasing power of money. The inflation rate is the percentage change in the price level from one period to another. The most common measure of inflation is the Consumer Price Index (CPI), which measures the cost of a fixed basket of goods and services purchased by a typical urban consumer. The CPI is calculated as the cost of the basket in the current year divided by the cost in the base year, multiplied by 100. The inflation rate is the percentage change in the CPI. Other price indices include the Producer Price Index (PPI), measuring wholesale prices, and the GDP deflator, measuring prices of all domestically produced goods and services. Each index has different coverage and uses. The CPI has several biases that cause it to overstate true inflation: substitution bias (consumers change buying patterns), quality bias (quality improvements are partly counted as price increases), and new product bias (new products are added with a lag). The Boskin Commission estimated these biases at about 1.1 percentage points annually. Inflation redistributes income and wealth. Unanticipated inflation hurts creditors and helps debtors, hurts those with fixed incomes and helps those with flexible incomes. The real interest rate adjusts the nominal interest rate for inflation: $\\text{Real Rate} = \\text{Nominal Rate} - \\text{Inflation Rate}$. This is the Fisher equation. Real variables (real wages, real income, real interest rates) measure purchasing power after adjusting for inflation. They are what matter for economic decisions. Hyperinflation is extremely high inflation (over 50% per month) that destroys the value of money and can collapse an economy. Moderate inflation is normal, but high and variable inflation imposes costs: shoe-leather costs (time spent avoiding holding cash), menu costs (costs of changing prices), and unit-of-account costs (money becomes a less reliable measure of value). Understanding inflation is essential for interpreting economic data, making financial decisions, and evaluating monetary policy."
}
