{
  "flashcards": [
    {
      "category": "Cell Membrane, Transport & Mitosis Basics",
      "cards": [
        {
          "front": "What is the primary function of the **cell membrane**?",
          "back": "It acts as a semi-permeable barrier that regulates what enters and leaves the cell to maintain homeostasis."
        },
        {
          "front": "What does the **Fluid Mosaic Model** describe?",
          "back": "The cell membrane structure: a flexible layer of lipid molecules (fluid) with large protein molecules embedded in it (mosaic)."
        },
        {
          "front": "What is **passive transport**?",
          "back": "The movement of substances across the cell membrane without the use of energy (ATP), moving from high to low concentration."
        },
        {
          "front": "Define **diffusion**.",
          "back": "The net movement of particles from an area of higher concentration to an area of lower concentration."
        },
        {
          "front": "What is **osmosis**?",
          "back": "The diffusion of water molecules across a selectively permeable membrane."
        },
        {
          "front": "What happens to a cell in a **hypotonic solution**?",
          "back": "Water enters the cell (because the outside has a lower solute concentration), causing the cell to swell or burst."
        },
        {
          "front": "What is **active transport**?",
          "back": "The movement of materials through a cell membrane using energy (ATP), usually against the concentration gradient (low to high)."
        },
        {
          "front": "What are **endocytosis** and **exocytosis**?",
          "back": "Bulk transport processes: Endocytosis brings materials into the cell via vesicles; Exocytosis releases materials out of the cell."
        },
        {
          "front": "What is the **cell cycle**?",
          "back": "The series of events that cells go through as they grow and divide, consisting of Interphase and M-phase (Mitosis/Cytokinesis)."
        },
        {
          "front": "What occurs during **Interphase**?",
          "back": "The cell grows, performs normal functions, and replicates its DNA (S-phase) in preparation for division."
        },
        {
          "front": "Name the four stages of **Mitosis** in order.",
          "back": "Prophase, Metaphase, Anaphase, and Telophase (PMAT)."
        },
        {
          "front": "What happens during **Metaphase**?",
          "back": "Chromosomes line up in the middle (equator) of the cell and attach to spindle fibers."
        },
        {
          "front": "What happens during **Anaphase**?",
          "back": "Sister chromatids are pulled apart by spindle fibers toward opposite poles of the cell."
        },
        {
          "front": "What is **Cytokinesis**?",
          "back": "The division of the cytoplasm that results in two separate, identical daughter cells."
        },
        {
          "front": "Why is **Mitosis** important for multicellular organisms?",
          "back": "It allows for growth, tissue repair, and asexual reproduction while ensuring each new cell has the same genetic information."
        }
      ]
    }
  ]
}
