{
  "flashcards": [
    {
      "category": "Ecology, Ecosystems & Energy Flow",
      "cards": [
        {
          "front": "What is an **Ecosystem**?",
          "back": "A community of living organisms (biotic) interacting with their non-living (abiotic) environment."
        },
        {
          "front": "What is the difference between **Biotic** and **Abiotic** factors?",
          "back": "Biotic factors are living things (plants, animals, bacteria); Abiotic factors are non-living things (sunlight, water, temperature)."
        },
        {
          "front": "What is a **Producer** (Autotroph)?",
          "back": "An organism that makes its own food, usually through photosynthesis (e.g., plants, algae)."
        },
        {
          "front": "What is a **Consumer** (Heterotroph)?",
          "back": "An organism that must eat other organisms to get energy."
        },
        {
          "front": "What do the **arrows** in a food chain represent?",
          "back": "The direction of energy flow (it points from the 'eaten' to the 'eater')."
        },
        {
          "front": "Define **Herbivore**, **Carnivore**, and **Omnivore**.",
          "back": "Herbivores eat only plants; Carnivores eat only animals; Omnivores eat both."
        },
        {
          "front": "What is the role of a **Decomposer**?",
          "back": "Organisms like fungi and bacteria that break down dead matter and return nutrients to the soil."
        },
        {
          "front": "What is a **Food Web**?",
          "back": "A complex network of many interconnected food chains in an ecosystem."
        },
        {
          "front": "What is a **Trophic Level**?",
          "back": "The position an organism occupies in a food chain (e.g., primary consumer, secondary consumer)."
        },
        {
          "front": "What is the **10% Rule** in energy pyramids?",
          "back": "Only about 10% of the energy at one trophic level is passed on to the next level; the rest is lost as heat."
        },
        {
          "front": "What is a **Limiting Factor**?",
          "back": "An environmental factor (like food, water, or space) that prevents a population from increasing."
        },
        {
          "front": "What is **Carrying Capacity**?",
          "back": "The maximum number of individuals of a species that an ecosystem can support sustainably."
        },
        {
          "front": "What is the difference between a **Population** and a **Community**?",
          "back": "A population is a group of the same species; a community is all the different populations living together in one area."
        },
        {
          "front": "What is **Sustainability** in an ecosystem?",
          "back": "The ability of an ecosystem to maintain its structure and function over time, even with changes."
        }
      ]
    }
  ]
}
