{
  "flashcards": [
    {
      "category": "Human Body Systems: Digestion, Respiration & Circulation",
      "cards": [
        {
          "front": "What is the main purpose of the **Digestive System**?",
          "back": "To break down food into small nutrient molecules that can be absorbed into the bloodstream."
        },
        {
          "front": "What is the difference between **Mechanical** and **Chemical** digestion?",
          "back": "Mechanical is physical (chewing, churning); Chemical uses enzymes and acid to break molecular bonds."
        },
        {
          "front": "What are **Villi** and why are they important?",
          "back": "Finger-like projections in the small intestine that increase surface area for maximum nutrient absorption."
        },
        {
          "front": "What is the function of the **Small Intestine** vs. the **Large Intestine**?",
          "back": "Small: Nutrient absorption; Large: Water absorption and waste elimination."
        },
        {
          "front": "What is the main function of the **Respiratory System**?",
          "back": "To bring oxygen into the body and remove carbon dioxide waste."
        },
        {
          "front": "What are the **Alveoli**?",
          "back": "Tiny air sacs in the lungs where gas exchange (O2 in, CO2 out) occurs with the blood."
        },
        {
          "front": "How does the **Diaphragm** control breathing?",
          "back": "It is a muscle that contracts (moves down) to pull air into the lungs and relaxes (moves up) to push air out."
        },
        {
          "front": "What are the three main components of the **Circulatory System**?",
          "back": "The heart (pump), blood vessels (pipes), and blood (transport fluid)."
        },
        {
          "front": "Compare **Arteries**, **Veins**, and **Capillaries**.",
          "back": "Arteries carry blood away from the heart; Veins carry blood to the heart; Capillaries are tiny vessels where exchange happens."
        },
        {
          "front": "What are the four chambers of the **Heart**?",
          "back": "Right Atrium, Right Ventricle, Left Atrium, Left Ventricle."
        },
        {
          "front": "What is the role of **Red Blood Cells**?",
          "back": "They contain hemoglobin to carry oxygen to all the cells in the body."
        },
        {
          "front": "How do the **Digestive and Circulatory** systems work together?",
          "back": "The digestive system breaks down food into nutrients, and the circulatory system transports those nutrients to all cells."
        },
        {
          "front": "How do the **Respiratory and Circulatory** systems work together?",
          "back": "The respiratory system takes in oxygen, and the circulatory system delivers that oxygen to cells while picking up CO2 to be exhaled."
        },
        {
          "front": "What is the function of **Valves** in the heart and veins?",
          "back": "To prevent the backflow of blood, ensuring it only flows in one direction."
        }
      ]
    }
  ]
}
