{
  "flashcards": [
    {
      "category": "Introduction to Genetics & Mendelian Inheritance",
      "cards": [
        {
          "front": "Who is known as the 'Father of Genetics'?",
          "back": "Gregor Mendel, who discovered the basic principles of heredity through experiments with pea plants."
        },
        {
          "front": "What is a **Gene**?",
          "back": "A segment of DNA on a chromosome that contains the instructions for a specific trait."
        },
        {
          "front": "What is an **Allele**?",
          "back": "Different versions or forms of a gene. For example, a gene for plant height may have a 'tall' allele and a 'short' allele."
        },
        {
          "front": "What is the difference between a **Dominant** and **Recessive** allele?",
          "back": "A dominant allele (capital letter) always shows up when present; a recessive allele (lowercase) only shows up if the dominant one is absent."
        },
        {
          "front": "Define **Genotype**.",
          "back": "The genetic makeup or combination of alleles an organism has (e.g., BB, Bb, or bb)."
        },
        {
          "front": "Define **Phenotype**.",
          "back": "The physical appearance or visible trait of an organism (e.g., blue eyes, tall stems)."
        },
        {
          "front": "What does **Homozygous** mean?",
          "back": "An organism that has two identical alleles for a trait (e.g., TT or tt). Also called 'purebred'."
        },
        {
          "front": "What does **Heterozygous** mean?",
          "back": "An organism that has two different alleles for a trait (e.g., Tt). Also called 'hybrid'."
        },
        {
          "front": "What is a **Punnett Square**?",
          "back": "A grid used to predict the possible genotypes and phenotypes of offspring from a genetic cross."
        },
        {
          "front": "In a cross between two **Heterozygous** (Bb) parents, what is the probability of the recessive phenotype showing up?",
          "back": "25% (or 1 out of 4)."
        },
        {
          "front": "What is the relationship between **DNA**, **Genes**, and **Chromosomes**?",
          "back": "Chromosomes are made of DNA, and genes are specific sections of that DNA."
        },
        {
          "front": "If a homozygous dominant (RR) plant is crossed with a homozygous recessive (rr) plant, what will the offspring look like?",
          "back": "100% will show the dominant trait (all will be Rr)."
        },
        {
          "front": "What is a **Mutation**?",
          "back": "A change in the DNA sequence that can lead to a new trait or variation in a species."
        }
      ]
    }
  ]
}
