{
  "expanded_description": "Every society faces the same fundamental problem of scarcity, but different societies answer the three economic questions—What to produce? How to produce? For whom to produce?—in different ways. The system a society uses to answer these questions shapes everything: what goods are available, who gets them, how much inequality exists, how fast the economy grows, and even what kind of political system develops. At one end of the spectrum are pure market economies, where decisions are made by millions of individuals and businesses through prices and voluntary exchange. At the other end are pure command economies, where a central authority makes all decisions. In reality, every economy is a mixed economy, combining elements of both. The United States leans toward markets; China, despite its communist party, now incorporates substantial market elements; Nordic countries blend markets with extensive government provision of social services. Understanding these different systems helps explain why some countries grow faster, why some have more inequality, and why economic policies that work in one place may fail in another. This section introduces the spectrum of economic systems, their key characteristics, and the goals by which we evaluate economic performance.",
  
  "core_concept": {
    "principle": "An economic system is the institutional framework through which a society answers the three fundamental economic questions: What to produce? How to produce? For whom to produce? The main types are: (1) Market economies, where decisions are made by individuals and firms through prices and voluntary exchange, with minimal government intervention; (2) Command economies, where a central authority (usually the government) makes all production and distribution decisions; (3) Mixed economies, which combine elements of both market and command systems, with the balance varying by country. Societies also pursue different economic goals: efficiency (getting the most from scarce resources), equity (fair distribution of income), growth (increasing output over time), stability (minimizing fluctuations in employment and prices), and freedom (ability to make economic choices). Different systems prioritize these goals differently. Market economies excel at efficiency and growth but may generate inequality and instability. Command economies promise equity and stability but often sacrifice efficiency and growth. Mixed economies attempt to capture the strengths of both while mitigating their weaknesses. Understanding these tradeoffs is essential for evaluating economic policies and outcomes.",
    
    "explanation": "Imagine three different societies deciding how to produce and distribute food. In a market economy, farmers decide what to plant based on what consumers are willing to buy. Prices signal what's wanted. If people want more organic vegetables, prices rise, and farmers shift production. Distribution is determined by who can afford to pay. In a command economy, a central planning board decides how much wheat, corn, and vegetables to grow. They set production targets for farms and decide how to distribute the food—perhaps equally to all citizens, or based on need, or with priority for certain groups. In a mixed economy, farmers mostly respond to market prices, but the government may provide food stamps to low-income families, subsidize certain crops, or maintain emergency food reserves. Each system has tradeoffs. Market economies are flexible and innovative but can leave some people without enough food. Command economies can guarantee everyone a minimum but often suffer from shortages, surpluses, and inefficiency because planners can't process all the information needed. Mixed economies try to balance these tradeoffs, but the right mix is debated. This is what economic systems are about: different institutional arrangements for managing scarcity, each with its own strengths and weaknesses.",
    
    "image": {
      "src": "images/unit1/economic_systems_spectrum.png",
      "alt": "Spectrum diagram showing pure market economy on left, pure command on right, and mixed economies in between with examples",
      "caption": "Figure 1.5.1: Economic systems exist on a spectrum. Pure market and pure command are theoretical extremes; all real-world economies are mixed."
    }
  },

  "sections": [
    {
      "section_title": "1.5 Economic Systems and Goals",
      "introduction": "Scarcity forces every society to make choices, but different societies make those choices in different ways. The rules, customs, and institutions that govern economic decisions form an economic system. Understanding these systems helps explain why some countries are rich and others poor, why some have high inequality and others low, and why economic policies that work in one place may fail in another. In this section, we'll explore the spectrum from market to command economies, examine the characteristics of each, and consider the goals by which we evaluate economic performance. You'll learn to identify different systems, understand their tradeoffs, and analyze how they answer the three fundamental economic questions.",
      
      "introduction_image": {
        "src": "images/unit1/three_questions.png",
        "alt": "Diagram showing the three fundamental economic questions: What? How? For Whom?",
        "caption": "Figure 1.5.2: Every economic system must answer these three questions. How they answer them defines the system."
      },
      
      "key_concept": {
        "definition": "Economic systems are the institutional arrangements societies use to allocate scarce resources and answer the three fundamental questions. The key dimensions along which systems differ include: (1) Ownership of resources - private vs. public; (2) Decision-making mechanism - decentralized (prices and markets) vs. centralized (government planning); (3) Incentive structure - material rewards vs. moral suasion vs. coercion; (4) Information flows - prices vs. directives vs. tradition. The spectrum includes: pure market capitalism (private ownership, decentralized decisions, prices as signals), pure command socialism (public ownership, central planning, directives), and mixed economies (combinations of both). Most modern economies are mixed, but they lean differently: the US leans market, China leans command despite market elements, Sweden mixes markets with extensive social welfare. Understanding these systems helps explain differences in efficiency, equity, growth, and stability across countries.",
        
        "context": "The debate over economic systems intensified during the Cold War, when capitalist market economies competed with communist command economies. The collapse of the Soviet Union in 1991 was widely interpreted as a victory for market systems, though China's remarkable growth under a hybrid system complicated this narrative. Today, the debate continues: How much government intervention is optimal? Should governments provide healthcare, education, and retirement security? How should we regulate markets to prevent instability and exploitation? These questions are at the heart of economic policy debates in every country. In AP Macroeconomics, understanding economic systems helps you analyze why policies differ across countries and why some economies grow faster than others. It also provides context for evaluating policy proposals—whether they move an economy toward more market orientation or more government control.",
        
        "image": {
          "src": "images/unit1/system_comparison.png",
          "alt": "Comparison table of market, command, and mixed economies showing ownership, decision-making, incentives, and examples",
          "caption": "Figure 1.5.3: Key characteristics of different economic systems. No pure systems exist in reality—all are mixed."
        }
      },

      "classifications": [
        {
          "type": "Market Economy",
          "value": "Decentralized decision-making through prices and voluntary exchange",
          "characteristics": ["Private property rights", "Freedom of enterprise", "Consumer sovereignty", "Prices as signals", "Competition", "Limited government"],
          "behavior": "Resources are allocated through the buying and selling decisions of millions of households and firms. Prices adjust to signal shortages and surpluses, coordinating economic activity without central direction. Firms produce what consumers are willing to buy. Income distribution reflects productivity and resource ownership.",
          
          "image": {
            "src": "images/unit1/circular_flow_market.png",
            "alt": "Circular flow diagram for a market economy showing households, firms, and factor/product markets",
            "caption": "Figure 1.5.4: In a market economy, households and firms interact through product and factor markets, with prices coordinating decisions."
          },
          
          "examples": [
            {
              "process": "What to produce?",
              "explanation": "Consumer preferences determine what's produced. Firms respond to prices and profit signals. If consumers want more smartphones, prices rise, profits increase, and firms shift resources to smartphone production."
            },
            {
              "process": "How to produce?",
              "explanation": "Firms choose the most efficient production methods to maximize profits. Competition forces them to minimize costs or be driven out of business. This leads to innovation and productivity growth."
            },
            {
              "process": "For whom to produce?",
              "explanation": "Goods go to those who can afford them. Income depends on what resources people own (labor, capital, land) and the prices those resources command in markets. This can lead to inequality."
            }
          ],
          
          "note": "No purely market economy exists—all governments intervene to some extent. The US is often cited as a market-oriented economy, but it has substantial government involvement in areas like defense, education, and social security."
        },
        {
          "type": "Command Economy",
          "value": "Centralized decision-making by government planners",
          "characteristics": ["Public/state ownership", "Central planning", "Production quotas", "Price controls", "Limited consumer choice", "Government allocation"],
          "behavior": "A central planning board decides what to produce, how to produce it, and who gets it. Plans are translated into production targets for enterprises. Prices are set by planners, not markets. Distribution may be based on need, equality, or political priorities. Innovation and efficiency often suffer due to lack of competition and incentives.",
          
          "image": {
            "src": "images/unit1/command_economy.png",
            "alt": "Diagram showing central planning board directing enterprises with production targets",
            "caption": "Figure 1.5.5: In a command economy, central planners set production targets and allocate resources, with directives flowing downward."
          },
          
          "examples": [
            {
              "process": "What to produce?",
              "explanation": "Planners decide based on national priorities—often emphasizing heavy industry and military goods over consumer goods. The former Soviet Union produced大量 of steel and tanks while consumers faced shortages of basic goods."
            },
            {
              "process": "How to produce?",
              "explanation": "Planners specify production methods and allocate inputs to enterprises. Managers have little discretion. Without competition, there's weak incentive to innovate or control costs. Factories may hoard resources to meet quotas."
            },
            {
              "process": "For whom to produce?",
              "explanation": "Planners decide distribution. In theory, goods could be distributed equally or based on need. In practice, political connections often matter, and queues (waiting lines) become the rationing mechanism when prices are kept below market-clearing levels."
            }
          ],
          
          "note": "Pure command economies existed in the Soviet Union, Mao's China, and North Korea. Most have either collapsed or incorporated market elements due to inefficiency and stagnation."
        },
        {
          "type": "Mixed Economy",
          "value": "Combination of market and command elements",
          "characteristics": ["Mixed ownership", "Markets for most goods", "Government regulation", "Public provision of some services", "Redistribution", "Stabilization policy"],
          "behavior": "Most decisions are made through markets, but government intervenes to correct market failures, provide public goods, redistribute income, and stabilize the economy. The mix varies by country and over time. Modern mixed economies attempt to capture the efficiency of markets while addressing inequality and instability.",
          
          "image": {
            "src": "images/unit1/mixed_economy.png",
            "alt": "Diagram showing market sector and government sector interacting with households and firms",
            "caption": "Figure 1.5.6: Mixed economies combine market allocation with government intervention—taxes, transfers, regulation, and public provision."
          },
          
          "examples": [
            {
              "process": "What to produce?",
              "explanation": "Mostly determined by consumer preferences in markets, but government also produces public goods (defense, roads) and may influence production through subsidies, taxes, and regulation."
            },
            {
              "process": "How to produce?",
              "explanation": "Primarily firms' decisions based on efficiency, but government regulates for safety, environmental protection, and labor standards. Some industries may be publicly owned or heavily regulated."
            },
            {
              "process": "For whom to produce?",
              "explanation": "Markets determine initial distribution based on income, but government redistributes through taxes and transfers (welfare, social security, unemployment insurance). Public services like education and healthcare affect who gets what."
            }
          ],
          
          "note": "All real-world economies are mixed. The debate is about the right mix—how much government intervention is optimal. The US, Japan, Germany, Sweden, and China are all mixed economies, but with very different balances."
        }
      ],

      "principles": [
        {
          "principle": "Market Economies Excel at Efficiency and Growth",
          "statement": "Markets, when competitive and well-functioning, tend to allocate resources efficiently. Prices signal relative scarcity, providing information and incentives for producers and consumers. Competition drives innovation and cost reduction. This dynamism promotes economic growth. However, markets can fail—producing too little of public goods, too much of negative externalities, and generating inequality and instability.",
          "application": "When evaluating policies, consider whether they enhance or impede market efficiency. Policies that strengthen property rights, enforce contracts, and correct market failures (like pollution taxes) can improve outcomes. Policies that create unnecessary barriers to competition or distort prices may reduce efficiency. But recognize that efficiency isn't the only goal—equity and stability matter too.",
          "example": "The remarkable growth of market-oriented economies like the US, Western Europe, and Japan in the post-WWII era demonstrates the power of markets. More recently, China's shift toward markets after 1978 unleashed decades of rapid growth. However, the 2008 financial crisis showed that unregulated markets can also generate severe instability.",
          
          "image": {
            "src": "images/unit1/market_growth.png",
            "alt": "Graph showing GDP growth in market-oriented vs command economies over time",
            "caption": "Figure 1.5.7: Market-oriented economies have generally grown faster than command economies, though with more volatility."
          }
        },
        {
          "principle": "Command Economies Prioritize Equity and Stability at the Cost of Efficiency",
          "statement": "Command economies can guarantee employment, reduce inequality, and avoid the boom-bust cycles of market capitalism. In theory, they can direct resources to socially important uses that markets might neglect. In practice, they suffer from severe information problems—planners cannot know all the preferences, costs, and possibilities that markets process through prices. Without competition and profit incentives, innovation stagnates, and inefficiency becomes endemic. Shortages and surpluses are common because prices don't adjust.",
          "application": "When studying historical command economies, observe how they solved (or failed to solve) the information and incentive problems. Why did the Soviet Union collapse? Why did China abandon pure central planning? These questions illuminate the practical limits of command systems. They also show why most countries choose mixed systems—trying to capture some of the equity and stability benefits of government intervention without sacrificing too much efficiency.",
          "example": "The Soviet Union achieved rapid industrialization in the 1930s and 1940s, but by the 1970s and 1980s, growth had stalled. Consumers faced chronic shortages; innovation lagged far behind the West. When the system collapsed in 1991, it was clear that command economies could not match the dynamism of market systems. North Korea remains a tragic example of command economy failure.",
          
          "image": {
            "src": "images/unit1/soviet_growth.png",
            "alt": "Graph showing Soviet GDP growth slowing over time",
            "caption": "Figure 1.5.8: Soviet growth slowed dramatically after the 1960s, illustrating the long-run inefficiency of command systems."
          }
        },
        {
          "principle": "Mixed Economies Attempt to Balance Multiple Goals",
          "statement": "All real-world economies are mixed, combining market allocation with government intervention. The challenge is finding the right balance. Too little government may lead to inequality, instability, and underprovision of public goods. Too much government may stifle initiative, create inefficiency, and reduce growth. Different countries strike different balances based on their history, culture, and values. The Nordic model combines markets with extensive social welfare; the US model has less redistribution but more dynamic markets; China's model combines state ownership in key sectors with market forces elsewhere.",
          "application": "When comparing economies, look at how they balance efficiency, equity, and stability. What role does government play in healthcare, education, infrastructure, and social insurance? How much redistribution occurs through taxes and transfers? How are markets regulated? These choices reflect societal values and have important consequences for economic outcomes. There's no single 'right' mix—different societies may reasonably choose different tradeoffs.",
          "example": "Sweden has high taxes and extensive public services, yet its economy remains dynamic and innovative. The US has lower taxes and less public provision but higher inequality and less economic security. Both are successful mixed economies, but they embody different tradeoffs. Which is 'better' depends on what you value—efficiency versus equity, freedom versus security.",
          
          "image": {
            "src": "images/unit1/mixed_comparison.png",
            "alt": "Chart comparing government spending as percentage of GDP across different mixed economies",
            "caption": "Figure 1.5.9: Mixed economies vary widely in government size and role. The chart shows government spending as % of GDP for selected countries."
          }
        },
        {
          "principle": "Economic Goals Often Conflict, Requiring Tradeoffs",
          "statement": "Societies pursue multiple economic goals: efficiency, equity, growth, stability, and freedom. Unfortunately, these goals often conflict. Policies that promote efficiency may increase inequality. Policies that stabilize the economy may reduce growth. Policies that enhance freedom may lead to instability. There is no magic solution that maximizes all goals simultaneously. Economic policy inevitably involves tradeoffs, and different societies may choose different tradeoffs based on their values and circumstances.",
          "application": "When evaluating economic policies, identify which goals are being pursued and what tradeoffs are involved. A policy that reduces inequality through high taxes may reduce incentives to work and invest, slowing growth. A policy that promotes growth through deregulation may increase instability and inequality. Good policy analysis requires recognizing these tradeoffs and making reasoned judgments about which goals should take priority.",
          "example": "Consider the tradeoff between efficiency and equity. Market economies are efficient but generate inequality. Redistributive policies can reduce inequality but may dull incentives, reducing efficiency and growth. Where to draw the line? This is one of the most debated questions in economics. Similarly, the short-run tradeoff between inflation and unemployment (the Phillips Curve) forces policymakers to choose between competing goals.",
          
          "image": {
            "src": "images/unit1/goals_tradeoff.png",
            "alt": "Diagram showing tradeoffs between efficiency, equity, growth, stability, and freedom",
            "caption": "Figure 1.5.10: Economic goals often conflict. Policies that advance one goal may come at the expense of others."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Classifying Economic Systems",
          
          "image": {
            "src": "images/unit1/classification_example.png",
            "alt": "Table with characteristics of different countries for classification exercise",
            "caption": "Figure 1.5.11: Use this data to classify each country's economic system."
          },
          
          "problem": "Classify each of the following as primarily market, command, or mixed economy. Explain your reasoning. a) Country A: Most farms and factories are privately owned. Prices are determined by supply and demand. The government provides national defense, enforces contracts, and maintains a social safety net. b) Country B: All major industries are state-owned. A central planning board sets production targets and prices. Consumer goods are often rationed. c) Country C: Most businesses are private, but the government owns the railroad, the postal service, and some utilities. Government regulates working conditions and environmental standards. d) Country D: Private property is limited. Most economic decisions are made by traditional customs and community consensus. Markets play a minor role.",
          
          "step_by_step": [
            {
              "step": "Analyze Country A",
              "explanation": "Country A has private ownership, market-determined prices, and limited government functions (defense, contracts, safety net). This describes a market-oriented mixed economy. It's not pure market because government provides some services and a safety net, but the core allocation is through markets. Classification: Mixed economy leaning market."
            },
            {
              "step": "Analyze Country B",
              "explanation": "Country B has state ownership, central planning, and rationing. These are the defining characteristics of a command economy. Production and distribution decisions are made by planners, not markets. Classification: Command economy."
            },
            {
              "step": "Analyze Country C",
              "explanation": "Country C has mostly private business but government ownership in key sectors and regulation of private activity. This is a classic mixed economy—markets for most goods, but government plays significant ownership and regulatory roles. Classification: Mixed economy."
            },
            {
              "step": "Analyze Country D",
              "explanation": "Country D has limited private property and decisions based on tradition. This describes a traditional economy, which is a fourth type not covered in detail but worth noting. Traditional economies exist in some indigenous communities and developing regions. Classification: Traditional economy."
            }
          ],
          
          "final_answer": "a) Mixed (market-oriented). b) Command. c) Mixed. d) Traditional.",
          "concept_applied": "Economic systems are classified by ownership, decision-making mechanism, and government role. Most economies are mixed, with the balance varying."
        },
        {
          "title": "Analyzing Policy Tradeoffs",
          
          "image": {
            "src": "images/unit1/policy_tradeoff.png",
            "alt": "Graph showing hypothetical tradeoff between efficiency and equity",
            "caption": "Figure 1.5.12: Policy A favors efficiency; Policy B favors equity. Society must choose where to be on this tradeoff."
          },
          
          "problem": "A country is considering two tax policies: Policy X would lower taxes on high incomes, which supporters say will encourage investment and entrepreneurship, increasing economic growth. Policy Y would raise taxes on high incomes and use the revenue to fund education and healthcare for low-income families, reducing inequality. a) Which economic goals does Policy X prioritize? b) Which economic goals does Policy Y prioritize? c) What tradeoff is illustrated by this choice? d) How might a country's values affect which policy is chosen? e) Can you think of a compromise policy that might balance both goals?",
          
          "step_by_step": [
            {
              "step": "Identify goals in Policy X",
              "explanation": "Policy X (lower taxes on high incomes) prioritizes efficiency and growth. The logic is that lower taxes increase incentives to work, save, invest, and innovate, which expands the economic pie. Supporters believe this benefits everyone eventually through growth."
            },
            {
              "step": "Identify goals in Policy Y",
              "explanation": "Policy Y (higher taxes on high incomes, more spending on low-income families) prioritizes equity and perhaps stability (by reducing poverty and social tension). The logic is that the market distribution is too unequal and government should redistribute to ensure everyone has access to basic necessities and opportunities."
            },
            {
              "step": "Explain the tradeoff",
              "explanation": "The tradeoff is between efficiency/growth and equity. Policies that promote growth may increase inequality. Policies that reduce inequality may dull incentives and reduce growth. This is one of the most fundamental tradeoffs in economics. The optimal balance is debated."
            },
            {
              "step": "Role of values",
              "explanation": "Different societies have different values and tolerance for inequality. A society that values individual achievement and believes inequality is necessary for incentives might choose Policy X. A society that values solidarity and believes everyone deserves a basic standard of living might choose Policy Y. There's no purely economic answer—it involves value judgments."
            },
            {
              "step": "Possible compromise",
              "explanation": "A compromise might include: moderate tax rates (not as low as X, not as high as Y), targeted incentives for investment, and spending on education and infrastructure that promotes both equity and growth. For example, funding early childhood education helps low-income children while also building human capital that boosts future growth."
            }
          ],
          
          "final_answer": "a) Efficiency and growth. b) Equity. c) Tradeoff between growth and equity. d) Values determine which goal takes priority. e) Targeted policies that promote both equity and growth, like education investment.",
          "concept_applied": "Economic goals often conflict, forcing societies to make tradeoffs based on their values. Good policy seeks to balance multiple goals."
        },
        {
          "title": "Evaluating Economic Performance",
          
          "image": {
            "src": "images/unit1/performance_metrics.png",
            "alt": "Table showing economic data for three countries: GDP growth, Gini coefficient (inequality), unemployment rate, inflation rate",
            "caption": "Figure 1.5.13: Economic data for Countries X, Y, and Z. Use this to evaluate performance across different goals."
          },
          
          "problem": "Consider the following data for three countries over the past decade: Country X: GDP growth 3.5% annually, Gini coefficient 0.45 (high inequality), unemployment 4%, inflation 2%. Country Y: GDP growth 2.0% annually, Gini coefficient 0.25 (low inequality), unemployment 6%, inflation 1.5%. Country Z: GDP growth 2.8% annually, Gini coefficient 0.35 (moderate inequality), unemployment 5%, inflation 3%. a) Which country performs best on growth? b) Which performs best on equity? c) Which performs best on stability (low unemployment and inflation)? d) Which country would you rank as having the best overall economic performance? Why? e) What does this illustrate about evaluating economic systems?",
          
          "step_by_step": [
            {
              "step": "Rank growth",
              "explanation": "Country X has the highest growth (3.5%), followed by Z (2.8%), then Y (2.0%). So X performs best on growth."
            },
            {
              "step": "Rank equity",
              "explanation": "Lower Gini coefficient means less inequality. Country Y has lowest inequality (0.25), followed by Z (0.35), then X (0.45). So Y performs best on equity."
            },
            {
              "step": "Rank stability",
              "explanation": "Stability means low unemployment and low, stable inflation. Country X has lowest unemployment (4%) and moderate inflation (2%). Country Y has higher unemployment (6%) but lowest inflation (1.5%). Country Z has moderate unemployment (5%) but highest inflation (3%). There's no clear winner—X has best unemployment, Y has best inflation. Possibly X edges out on stability given much lower unemployment with only slightly higher inflation than Y."
            },
            {
              "step": "Overall evaluation",
              "explanation": "This depends on what you value. If you prioritize growth, X is best. If you prioritize equity, Y is best. If you want a balance, Z might be best—moderate growth, moderate inequality, moderate stability. There's no single 'best' because different societies weight goals differently."
            },
            {
              "step": "Illustration",
              "explanation": "This shows that evaluating economic systems and policies requires multiple criteria. A country might excel in one dimension but lag in another. Policy debates often reflect different weights on these competing goals. Understanding these tradeoffs is essential for informed citizenship."
            }
          ],
          
          "final_answer": "a) X. b) Y. c) X (lowest unemployment, moderate inflation). d) Depends on values—X for growth, Y for equity, Z for balance. e) Economic performance is multidimensional; different systems prioritize different goals.",
          "concept_applied": "No single metric captures overall economic performance. Growth, equity, and stability are all important, and societies may reasonably prioritize them differently."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Resource Allocation in a Market Economy",
          "description": "Households own resources and sell them in factor markets to firms. Firms use resources to produce goods and sell them in product markets to households.",
          "mechanism": "Prices adjust to balance supply and demand. Profits signal where resources are most valued. Competition drives efficiency and innovation.",
          "result": "Resources flow to their highest-valued uses. Consumers get what they're willing to pay for. Income reflects resource ownership and market prices.",
          
          "image": {
            "src": "images/unit1/market_flow.png",
            "alt": "Detailed circular flow diagram showing household-firm interactions through factor and product markets",
            "caption": "Figure 1.5.14: The circular flow in a market economy. Money flows clockwise; resources and goods flow counterclockwise."
          }
        },
        {
          "step": 2,
          "process": "Resource Allocation in a Command Economy",
          "description": "Central planners gather information, set production targets, and allocate resources to state enterprises. Enterprises produce according to plan. Distribution is determined by planners.",
          "mechanism": "Directives flow from planners to enterprises. Quotas and targets motivate production. Prices are set administratively, not by markets.",
          "result": "Resources are allocated according to plan priorities, but information problems and weak incentives often cause inefficiency, shortages, and surpluses.",
          
          "image": {
            "src": "images/unit1/command_flow.png",
            "alt": "Diagram showing central planning board directing enterprises with information and directives flowing",
            "caption": "Figure 1.5.15: In a command economy, central planners make decisions and issue directives to enterprises."
          }
        },
        {
          "step": 3,
          "process": "Resource Allocation in a Mixed Economy",
          "description": "Most allocation occurs through markets, but government intervenes through taxes, transfers, regulation, and public provision of certain goods and services.",
          "mechanism": "Markets operate as in a market economy, but government modifies outcomes—redistributing income, correcting market failures, stabilizing fluctuations, and providing public goods.",
          "result": "Efficiency from markets is combined with equity and stability from government intervention. The balance varies across countries and over time.",
          
          "image": {
            "src": "images/unit1/mixed_flow.png",
            "alt": "Circular flow diagram with government sector added, showing taxes, transfers, and public services",
            "caption": "Figure 1.5.16: In a mixed economy, government collects taxes, provides public services, and makes transfers, modifying market outcomes."
          }
        }
      ],

      "image": {
        "src": "images/unit1/systems_summary.png",
        "alt": "Summary table comparing market, command, and mixed economies across multiple dimensions",
        "caption": "Table 1.5.17: Summary comparison of economic systems."
      }
    }
  ],

  "key_terms": [
    "Economic system",
    "Market economy",
    "Command economy",
    "Mixed economy",
    "Traditional economy",
    "Capitalism",
    "Socialism",
    "Communism",
    "Private property",
    "Public ownership",
    "Central planning",
    "Price mechanism",
    "Market failure",
    "Government intervention",
    "Regulation",
    "Redistribution",
    "Public goods",
    "Externalities",
    "Efficiency",
    "Equity",
    "Economic growth",
    "Stability",
    "Economic freedom",
    "Tradeoffs",
    "Circular flow",
    "Consumer sovereignty",
    "Profit motive",
    "Competition",
    "Incentives",
    "Information problem"
  ],

  "summary": "Economic systems are the institutional arrangements through which societies answer the three fundamental questions: What to produce? How to produce? For whom to produce? The main types are market economies (decentralized decisions through prices), command economies (centralized decisions by planners), and mixed economies (combining elements of both). No pure market or pure command economy exists in reality—all are mixed, but the balance varies widely across countries. Market economies excel at efficiency and growth through competition, prices, and profit incentives, but they can generate inequality, instability, and underprovision of public goods. Command economies can achieve equity and stability in principle, but in practice they suffer from information problems, weak incentives, and inefficiency. Mixed economies attempt to capture the strengths of both while mitigating their weaknesses—using markets for most allocation but government to correct market failures, redistribute income, and stabilize fluctuations. Societies also pursue multiple economic goals: efficiency, equity, growth, stability, and freedom. These goals often conflict, requiring tradeoffs. Policies that promote growth may increase inequality; policies that promote equity may reduce incentives. Different societies may reasonably choose different tradeoffs based on their values and circumstances. Understanding economic systems and goals provides a framework for evaluating economic performance and policy debates. It helps explain why countries differ in their institutions and outcomes, and why there is no single 'right' answer to many economic questions. The ongoing debate over the proper role of government in the economy reflects these enduring tradeoffs and value judgments."
}
