{
  "course": "Grade 9 Biology",
  "topic": "Cell Division and Reproduction",
  "problems": [
    {
      "number": 1,
      "problem": "Explain the purpose of cell division.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define cell division",
          "explanation": "Process by which a parent cell divides into two or more daughter cells."
        },
        {
          "step": "Purpose",
          "explanation": "For growth, repair, and reproduction of organisms."
        }
      ],
      "final_answer": "Cell division allows growth, repair, and reproduction by producing new cells."
    },
    {
      "number": 2,
      "problem": "Describe the phases of the cell cycle.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify main phases",
          "explanation": "Interphase (G1, S, G2) and M phase (mitosis and cytokinesis)."
        },
        {
          "step": "Function of each phase",
          "explanation": "G1: cell growth; S: DNA replication; G2: preparation for mitosis; M: division of nucleus and cytoplasm."
        }
      ],
      "final_answer": "Cell cycle phases: Interphase (G1, S, G2) for growth and DNA replication; M phase for mitosis and cytokinesis."
    },
    {
      "number": 3,
      "problem": "Explain mitosis and its stages.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define mitosis",
          "explanation": "Division of the nucleus producing two identical daughter nuclei."
        },
        {
          "step": "Stages",
          "explanation": "Prophase, Metaphase, Anaphase, Telophase (PMAT)."
        },
        {
          "step": "Outcome",
          "explanation": "Two genetically identical daughter cells."
        }
      ],
      "final_answer": "Mitosis divides the nucleus into two identical cells through prophase, metaphase, anaphase, and telophase."
    },
    {
      "number": 4,
      "problem": "Explain the difference between mitosis and meiosis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Mitosis",
          "explanation": "Produces 2 identical diploid cells for growth and repair."
        },
        {
          "step": "Meiosis",
          "explanation": "Produces 4 genetically different haploid cells for sexual reproduction."
        }
      ],
      "final_answer": "Mitosis: 2 identical diploid cells; Meiosis: 4 different haploid cells for reproduction."
    },
    {
      "number": 5,
      "problem": "Explain the importance of crossing over in meiosis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define crossing over",
          "explanation": "Exchange of genetic material between homologous chromosomes during prophase I."
        },
        {
          "step": "Significance",
          "explanation": "Increases genetic variation in offspring."
        }
      ],
      "final_answer": "Crossing over during meiosis creates genetic variation by exchanging chromosome segments."
    },
    {
      "number": 6,
      "problem": "Explain the role of spindle fibers in cell division.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define spindle fibers",
          "explanation": "Microtubules that form during mitosis or meiosis."
        },
        {
          "step": "Function",
          "explanation": "Attach to chromosomes and help separate them to opposite poles."
        }
      ],
      "final_answer": "Spindle fibers separate chromosomes during cell division to ensure proper distribution."
    },
    {
      "number": 7,
      "problem": "Explain the difference between sexual and asexual reproduction.",
      "image": null,
      "step_by_step": [
        {
          "step": "Asexual reproduction",
          "explanation": "Single parent produces genetically identical offspring."
        },
        {
          "step": "Sexual reproduction",
          "explanation": "Two parents contribute genetic material to produce genetically diverse offspring."
        }
      ],
      "final_answer": "Asexual reproduction produces identical offspring from one parent; sexual reproduction produces genetically diverse offspring from two parents."
    },
    {
      "number": 8,
      "problem": "Define cytokinesis and its significance.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define cytokinesis",
          "explanation": "Division of the cytoplasm following nuclear division."
        },
        {
          "step": "Significance",
          "explanation": "Completes cell division and ensures each daughter cell receives cytoplasm and organelles."
        }
      ],
      "final_answer": "Cytokinesis divides the cytoplasm, completing cell division and supplying each daughter cell with organelles."
    },
    {
      "number": 9,
      "problem": "Explain why meiosis produces haploid cells.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define haploid",
          "explanation": "Cells with half the number of chromosomes (n) compared to diploid (2n)."
        },
        {
          "step": "Reason",
          "explanation": "Meiosis reduces chromosome number to maintain species’ chromosome number after fertilization."
        }
      ],
      "final_answer": "Meiosis produces haploid cells to maintain chromosome number in sexual reproduction."
    },
    {
      "number": 10,
      "problem": "Explain the significance of meiosis in genetic diversity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Mechanisms",
          "explanation": "Crossing over and independent assortment mix genetic material."
        },
        {
          "step": "Outcome",
          "explanation": "Produces genetically unique gametes, increasing variation in offspring."
        }
      ],
      "final_answer": "Meiosis increases genetic diversity through crossing over and independent assortment, producing unique gametes."
    }
  ]
}
