{
  "course": "Grade 9 Biology",
  "topic": "Human Biology and Health",
  "problems": [
    {
      "number": 1,
      "problem": "Define homeostasis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define homeostasis",
          "explanation": "Homeostasis is the maintenance of a stable internal environment in the body despite external changes."
        }
      ],
      "final_answer": "Homeostasis is the body's ability to maintain a stable internal environment."
    },
    {
      "number": 2,
      "problem": "List the main human body systems and one major function of each.",
      "image": null,
      "step_by_step": [
        {
          "step": "Circulatory system",
          "explanation": "Transports blood, nutrients, and oxygen throughout the body."
        },
        {
          "step": "Respiratory system",
          "explanation": "Provides oxygen to the blood and removes carbon dioxide."
        },
        {
          "step": "Digestive system",
          "explanation": "Breaks down food into nutrients for absorption."
        },
        {
          "step": "Nervous system",
          "explanation": "Coordinates body responses and transmits signals."
        },
        {
          "step": "Skeletal system",
          "explanation": "Supports and protects the body."
        },
        {
          "step": "Muscular system",
          "explanation": "Allows movement."
        }
      ],
      "final_answer": "Major systems: Circulatory (blood transport), Respiratory (gas exchange), Digestive (nutrient absorption), Nervous (coordination), Skeletal (support), Muscular (movement)."
    },
    {
      "number": 3,
      "problem": "Explain the difference between arteries, veins, and capillaries.",
      "image": null,
      "step_by_step": [
        {
          "step": "Arteries",
          "explanation": "Carry blood away from the heart; thick, elastic walls."
        },
        {
          "step": "Veins",
          "explanation": "Carry blood toward the heart; have valves to prevent backflow."
        },
        {
          "step": "Capillaries",
          "explanation": "Tiny vessels where exchange of gases, nutrients, and waste occurs."
        }
      ],
      "final_answer": "Arteries: from heart; Veins: to heart; Capillaries: exchange of substances."
    },
    {
      "number": 4,
      "problem": "Explain the role of the human digestive system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Breaks down food mechanically and chemically to absorb nutrients and eliminate waste."
        }
      ],
      "final_answer": "Digestive system breaks down food, absorbs nutrients, and eliminates waste."
    },
    {
      "number": 5,
      "problem": "Explain the importance of the respiratory system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Supplies oxygen for cellular respiration and removes carbon dioxide from the body."
        }
      ],
      "final_answer": "Respiratory system provides oxygen for energy production and removes carbon dioxide."
    },
    {
      "number": 6,
      "problem": "Explain the role of the excretory system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Removes metabolic waste products from the body and maintains water and salt balance."
        }
      ],
      "final_answer": "Excretory system removes waste and maintains water-salt balance."
    },
    {
      "number": 7,
      "problem": "Explain the difference between infectious and non-infectious diseases.",
      "image": null,
      "step_by_step": [
        {
          "step": "Infectious diseases",
          "explanation": "Caused by pathogens (bacteria, viruses, fungi, parasites) and can spread between individuals."
        },
        {
          "step": "Non-infectious diseases",
          "explanation": "Not caused by pathogens and cannot spread; often due to genetics or lifestyle."
        }
      ],
      "final_answer": "Infectious: caused by pathogens and spreadable; Non-infectious: not caused by pathogens and non-spreadable."
    },
    {
      "number": 8,
      "problem": "Explain the importance of vaccination.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define vaccination",
          "explanation": "Introduction of a harmless form of a pathogen to stimulate immune response."
        },
        {
          "step": "Importance",
          "explanation": "Protects individuals from disease and reduces disease spread in the population."
        }
      ],
      "final_answer": "Vaccination stimulates immunity, protecting individuals and populations from disease."
    },
    {
      "number": 9,
      "problem": "Explain the role of the nervous system in human health.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Detects stimuli, coordinates body responses, and helps maintain homeostasis."
        }
      ],
      "final_answer": "Nervous system detects stimuli, coordinates responses, and maintains homeostasis."
    },
    {
      "number": 10,
      "problem": "Explain the role of healthy lifestyle in human health.",
      "image": null,
      "step_by_step": [
        {
          "step": "Factors",
          "explanation": "Balanced diet, exercise, adequate sleep, hygiene, and avoiding harmful substances."
        },
        {
          "step": "Outcome",
          "explanation": "Maintains proper body function, prevents disease, and supports longevity."
        }
      ],
      "final_answer": "Healthy lifestyle supports proper body function, disease prevention, and longevity."
    }
  ]
}
