{
  "course": "Grade 9 Biology",
  "topic": "Membrane Transport",
  "problems": [
    {
      "number": 1,
      "problem": "Define diffusion and give an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define diffusion",
          "explanation": "Movement of molecules from an area of high concentration to low concentration."
        },
        {
          "step": "Example",
          "explanation": "Oxygen moving from alveoli in lungs into blood."
        }
      ],
      "final_answer": "Diffusion is the movement of molecules from high to low concentration, e.g., oxygen entering blood from lungs."
    },
    {
      "number": 2,
      "problem": "Explain osmosis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define osmosis",
          "explanation": "Diffusion of water across a selectively permeable membrane from low solute concentration to high solute concentration."
        },
        {
          "step": "Significance",
          "explanation": "Maintains cell turgor pressure and balance of fluids."
        }
      ],
      "final_answer": "Osmosis is water movement across a membrane toward higher solute concentration, maintaining cell balance."
    },
    {
      "number": 3,
      "problem": "Differentiate between passive and active transport.",
      "image": null,
      "step_by_step": [
        {
          "step": "Passive transport",
          "explanation": "Movement of substances across the membrane without energy, down the concentration gradient."
        },
        {
          "step": "Active transport",
          "explanation": "Movement of substances against the concentration gradient using energy (ATP)."
        }
      ],
      "final_answer": "Passive transport requires no energy; active transport requires energy to move substances against a gradient."
    },
    {
      "number": 4,
      "problem": "Explain facilitated diffusion.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define facilitated diffusion",
          "explanation": "Passive transport of molecules across a membrane via protein channels or carriers."
        },
        {
          "step": "Example",
          "explanation": "Glucose entering cells through a glucose transporter."
        }
      ],
      "final_answer": "Facilitated diffusion is passive transport through membrane proteins, e.g., glucose entering cells."
    },
    {
      "number": 5,
      "problem": "Explain endocytosis and exocytosis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Endocytosis",
          "explanation": "Process by which cells engulf substances into vesicles."
        },
        {
          "step": "Exocytosis",
          "explanation": "Process by which cells expel substances in vesicles to the outside."
        }
      ],
      "final_answer": "Endocytosis brings substances into the cell; exocytosis expels substances out of the cell."
    },
    {
      "number": 6,
      "problem": "Explain the difference between hypertonic, hypotonic, and isotonic solutions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Hypertonic",
          "explanation": "Higher solute concentration outside the cell; water leaves cell."
        },
        {
          "step": "Hypotonic",
          "explanation": "Lower solute concentration outside the cell; water enters cell."
        },
        {
          "step": "Isotonic",
          "explanation": "Equal solute concentration; no net water movement."
        }
      ],
      "final_answer": "Hypertonic: water leaves; Hypotonic: water enters; Isotonic: no net movement."
    },
    {
      "number": 7,
      "problem": "Explain the role of protein pumps in active transport.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define protein pump",
          "explanation": "Membrane proteins that use ATP to move ions or molecules against their gradient."
        },
        {
          "step": "Example",
          "explanation": "Sodium-potassium pump moves Na⁺ out and K⁺ into the cell."
        }
      ],
      "final_answer": "Protein pumps use energy to move molecules against gradients, e.g., sodium-potassium pump."
    },
    {
      "number": 8,
      "problem": "Explain the concept of concentration gradient.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define concentration gradient",
          "explanation": "Difference in concentration of a substance between two regions."
        },
        {
          "step": "Significance",
          "explanation": "Drives passive transport like diffusion and osmosis."
        }
      ],
      "final_answer": "A concentration gradient is a difference in substance concentration that drives diffusion and osmosis."
    },
    {
      "number": 9,
      "problem": "Explain why water moves from hypotonic to hypertonic solutions.",
      "image": null,
      "step_by_step": [
        {
          "step": "Identify water movement",
          "explanation": "Water moves to balance solute concentrations across the membrane."
        },
        {
          "step": "Result",
          "explanation": "Water leaves hypotonic area (low solute) toward hypertonic area (high solute)."
        }
      ],
      "final_answer": "Water moves from hypotonic to hypertonic solutions to equalize solute concentrations."
    },
    {
      "number": 10,
      "problem": "Explain why cells cannot rely solely on diffusion for all transport needs.",
      "image": null,
      "step_by_step": [
        {
          "step": "Limitations of diffusion",
          "explanation": "Diffusion is slow over long distances and cannot move substances against gradients."
        },
        {
          "step": "Necessity of other mechanisms",
          "explanation": "Active transport and vesicle transport allow cells to control internal environment efficiently."
        }
      ],
      "final_answer": "Diffusion alone is insufficient; active transport and vesicles help cells regulate substances effectively."
    }
  ]
}
