{
  "course": "Grade 9 Biology",
  "topic": "Variation and Natural Selection",
  "problems": [
    {
      "number": 1,
      "problem": "Define variation in biology.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define variation",
          "explanation": "Differences in traits among individuals of the same species."
        },
        {
          "step": "Example",
          "explanation": "Different fur colors in rabbits or height differences in humans."
        }
      ],
      "final_answer": "Variation is the differences in traits among individuals of the same species."
    },
    {
      "number": 2,
      "problem": "Explain the difference between continuous and discontinuous variation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Continuous variation",
          "explanation": "Traits that show a range of small differences (e.g., height, weight)."
        },
        {
          "step": "Discontinuous variation",
          "explanation": "Traits that have distinct categories with no intermediates (e.g., blood group, tongue rolling)."
        }
      ],
      "final_answer": "Continuous variation shows a range of differences; discontinuous variation has distinct categories."
    },
    {
      "number": 3,
      "problem": "Explain what is meant by natural selection.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define natural selection",
          "explanation": "Process where individuals with advantageous traits are more likely to survive and reproduce."
        },
        {
          "step": "Significance",
          "explanation": "Leads to adaptation and evolution of populations."
        }
      ],
      "final_answer": "Natural selection is the survival and reproduction of individuals with advantageous traits, leading to adaptation."
    },
    {
      "number": 4,
      "problem": "List four factors that contribute to natural selection.",
      "image": null,
      "step_by_step": [
        {
          "step": "Factors",
          "explanation": "Variation, competition, overproduction of offspring, and differential survival."
        }
      ],
      "final_answer": "Factors of natural selection: variation, competition, overproduction, differential survival."
    },
    {
      "number": 5,
      "problem": "Explain the role of mutation in variation.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define mutation",
          "explanation": "A change in the DNA sequence of an organism."
        },
        {
          "step": "Effect on variation",
          "explanation": "Mutations can introduce new traits, increasing genetic variation in a population."
        }
      ],
      "final_answer": "Mutations create new traits, contributing to genetic variation in a population."
    },
    {
      "number": 6,
      "problem": "Explain adaptation and give an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define adaptation",
          "explanation": "A trait that increases an organism’s chance of survival and reproduction."
        },
        {
          "step": "Example",
          "explanation": "Thick fur in polar bears helps them survive in cold climates."
        }
      ],
      "final_answer": "Adaptation is a trait that improves survival, e.g., thick fur in polar bears."
    },
    {
      "number": 7,
      "problem": "Explain why overproduction of offspring is important in natural selection.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define overproduction",
          "explanation": "Organisms produce more offspring than can survive."
        },
        {
          "step": "Importance",
          "explanation": "Creates competition, allowing individuals with advantageous traits to survive and reproduce."
        }
      ],
      "final_answer": "Overproduction creates competition, allowing natural selection to favor advantageous traits."
    },
    {
      "number": 8,
      "problem": "Explain the difference between artificial and natural selection.",
      "image": null,
      "step_by_step": [
        {
          "step": "Artificial selection",
          "explanation": "Humans selectively breed organisms for desired traits."
        },
        {
          "step": "Natural selection",
          "explanation": "Nature favors individuals with traits that increase survival and reproduction."
        }
      ],
      "final_answer": "Artificial selection is human-directed; natural selection is nature-directed survival of advantageous traits."
    },
    {
      "number": 9,
      "problem": "Explain the role of competition in natural selection.",
      "image": null,
      "step_by_step": [
        {
          "step": "Define competition",
          "explanation": "Organisms compete for limited resources like food, space, or mates."
        },
        {
          "step": "Effect on selection",
          "explanation": "Only the best-adapted individuals survive and reproduce, passing on favorable traits."
        }
      ],
      "final_answer": "Competition for resources ensures that only well-adapted individuals survive and reproduce."
    },
    {
      "number": 10,
      "problem": "Explain how natural selection leads to evolution.",
      "image": null,
      "step_by_step": [
        {
          "step": "Selection of traits",
          "explanation": "Favorable traits increase in frequency over generations."
        },
        {
          "step": "Cumulative change",
          "explanation": "Gradual accumulation of changes in a population over time leads to evolution."
        }
      ],
      "final_answer": "Natural selection leads to evolution by increasing favorable traits in a population over generations."
    }
  ]
}
