{
  "course": "Grade 11 Biology",
  "topic": "Advanced Cell Structure",
  "problems": [
    {
      "number": 1,
      "problem": "Describe the structure and function of the nucleus.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "The nucleus is surrounded by a double membrane called the nuclear envelope, containing nuclear pores for transport. It contains chromatin and the nucleolus."
        },
        {
          "step": "Function",
          "explanation": "Controls cell activities, stores genetic material (DNA), and synthesizes ribosomal RNA in the nucleolus."
        }
      ],
      "final_answer": "The nucleus stores DNA, controls cell activities, and synthesizes rRNA in the nucleolus."
    },
    {
      "number": 2,
      "problem": "Describe the structure and function of the endoplasmic reticulum (ER).",
      "image": null,
      "step_by_step": [
        {
          "step": "Rough ER",
          "explanation": "Studded with ribosomes; synthesizes and processes proteins."
        },
        {
          "step": "Smooth ER",
          "explanation": "Lacks ribosomes; synthesizes lipids and detoxifies substances."
        }
      ],
      "final_answer": "Rough ER: protein synthesis; Smooth ER: lipid synthesis and detoxification."
    },
    {
      "number": 3,
      "problem": "Describe the structure and function of mitochondria.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "Double-membrane organelle with inner folds called cristae and a matrix."
        },
        {
          "step": "Function",
          "explanation": "Site of cellular respiration; produces ATP from glucose and oxygen."
        }
      ],
      "final_answer": "Mitochondria produce ATP through cellular respiration and have cristae for surface area."
    },
    {
      "number": 4,
      "problem": "Describe the structure and function of chloroplasts.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "Double-membrane organelle containing thylakoids stacked into grana and stroma."
        },
        {
          "step": "Function",
          "explanation": "Site of photosynthesis; converts light energy into chemical energy (glucose)."
        }
      ],
      "final_answer": "Chloroplasts conduct photosynthesis using thylakoids and stroma to produce glucose."
    },
    {
      "number": 5,
      "problem": "Describe the structure and function of the Golgi apparatus.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "Stack of flattened membrane-bound sacs called cisternae."
        },
        {
          "step": "Function",
          "explanation": "Modifies, packages, and transports proteins and lipids."
        }
      ],
      "final_answer": "The Golgi apparatus modifies, packages, and transports proteins and lipids."
    },
    {
      "number": 6,
      "problem": "Describe the structure and function of lysosomes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "Membrane-bound organelles containing hydrolytic enzymes."
        },
        {
          "step": "Function",
          "explanation": "Break down macromolecules, old organelles, and foreign substances."
        }
      ],
      "final_answer": "Lysosomes digest macromolecules, old organelles, and foreign materials."
    },
    {
      "number": 7,
      "problem": "Describe the structure and function of peroxisomes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "Small membrane-bound organelles containing oxidative enzymes."
        },
        {
          "step": "Function",
          "explanation": "Break down fatty acids and detoxify harmful substances like hydrogen peroxide."
        }
      ],
      "final_answer": "Peroxisomes break down fatty acids and detoxify harmful substances."
    },
    {
      "number": 8,
      "problem": "Explain the structure and function of the cytoskeleton.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "Network of protein filaments: microtubules, microfilaments, and intermediate filaments."
        },
        {
          "step": "Function",
          "explanation": "Maintains cell shape, supports organelle movement, and enables cell division and motility."
        }
      ],
      "final_answer": "The cytoskeleton maintains shape, supports organelle movement, and assists in division and motility."
    },
    {
      "number": 9,
      "problem": "Describe the structure and function of the plasma membrane.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "Phospholipid bilayer with embedded proteins, cholesterol, and carbohydrates."
        },
        {
          "step": "Function",
          "explanation": "Controls movement of substances in and out of the cell, facilitates communication, and protects the cell."
        }
      ],
      "final_answer": "The plasma membrane regulates transport, communication, and protection of the cell."
    },
    {
      "number": 10,
      "problem": "Describe the structure and function of ribosomes.",
      "image": null,
      "step_by_step": [
        {
          "step": "Structure",
          "explanation": "Composed of rRNA and proteins; can be free in cytoplasm or bound to rough ER."
        },
        {
          "step": "Function",
          "explanation": "Site of protein synthesis."
        }
      ],
      "final_answer": "Ribosomes synthesize proteins and can be free or attached to the rough ER."
    }
  ]
}
