{
  "course": "Grade 11 Biology",
  "topic": "Cellular Communication and Signaling",
  "problems": [
    {
      "number": 1,
      "problem": "Define cell signaling.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Cell signaling is the process by which cells communicate with each other to coordinate activities."
        }
      ],
      "final_answer": "Cell signaling is the communication between cells to coordinate functions."
    },
    {
      "number": 2,
      "problem": "Explain the difference between autocrine, paracrine, and endocrine signaling.",
      "image": null,
      "step_by_step": [
        {
          "step": "Autocrine",
          "explanation": "Signal affects the same cell that secretes it."
        },
        {
          "step": "Paracrine",
          "explanation": "Signal affects nearby cells."
        },
        {
          "step": "Endocrine",
          "explanation": "Signal is released into the bloodstream and affects distant cells."
        }
      ],
      "final_answer": "Autocrine: self; Paracrine: nearby cells; Endocrine: distant cells via bloodstream."
    },
    {
      "number": 3,
      "problem": "Define ligand and receptor.",
      "image": null,
      "step_by_step": [
        {
          "step": "Ligand",
          "explanation": "A molecule that binds to a specific receptor to trigger a cellular response."
        },
        {
          "step": "Receptor",
          "explanation": "A protein on the cell surface or inside the cell that recognizes and binds a ligand."
        }
      ],
      "final_answer": "Ligand: signaling molecule; Receptor: protein that binds ligand to trigger response."
    },
    {
      "number": 4,
      "problem": "Explain the role of G-protein coupled receptors (GPCRs).",
      "image": null,
      "step_by_step": [
        {
          "step": "Mechanism",
          "explanation": "GPCRs bind ligands, activate G-proteins, which then trigger downstream signaling pathways inside the cell."
        }
      ],
      "final_answer": "GPCRs transmit signals from ligands through G-proteins to activate cellular responses."
    },
    {
      "number": 5,
      "problem": "Explain the role of receptor tyrosine kinases (RTKs).",
      "image": null,
      "step_by_step": [
        {
          "step": "Mechanism",
          "explanation": "RTKs bind ligands, dimerize, and autophosphorylate, activating intracellular signaling pathways."
        }
      ],
      "final_answer": "RTKs activate signaling pathways via ligand binding, dimerization, and phosphorylation."
    },
    {
      "number": 6,
      "problem": "Explain the difference between ion channel receptors and intracellular receptors.",
      "image": null,
      "step_by_step": [
        {
          "step": "Ion channel receptors",
          "explanation": "Membrane-bound receptors that open or close ion channels in response to ligands."
        },
        {
          "step": "Intracellular receptors",
          "explanation": "Receptors inside the cell that bind ligands able to cross the membrane, such as steroid hormones."
        }
      ],
      "final_answer": "Ion channels respond to ligands at the membrane; intracellular receptors bind ligands inside the cell."
    },
    {
      "number": 7,
      "problem": "Explain the concept of signal transduction.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Signal transduction is the process of converting an extracellular signal into a cellular response through a series of molecular events."
        }
      ],
      "final_answer": "Signal transduction converts external signals into cellular responses via molecular pathways."
    },
    {
      "number": 8,
      "problem": "Explain the role of second messengers.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Second messengers are small molecules or ions that transmit signals from receptors to target molecules inside the cell."
        },
        {
          "step": "Examples",
          "explanation": "cAMP, Ca²⁺, IP3."
        }
      ],
      "final_answer": "Second messengers like cAMP and Ca²⁺ relay signals from receptors to intracellular targets."
    },
    {
      "number": 9,
      "problem": "Explain how a signal can be amplified in a signaling pathway.",
      "image": null,
      "step_by_step": [
        {
          "step": "Amplification",
          "explanation": "One ligand-receptor binding event can activate multiple molecules of a second messenger or enzyme cascade, amplifying the signal."
        }
      ],
      "final_answer": "Signal amplification occurs via cascades where one receptor activates many molecules downstream."
    },
    {
      "number": 10,
      "problem": "Explain the role of apoptosis in cellular signaling.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Apoptosis is programmed cell death triggered by intracellular or extracellular signals."
        },
        {
          "step": "Role",
          "explanation": "Removes damaged or unnecessary cells to maintain tissue homeostasis."
        }
      ],
      "final_answer": "Apoptosis is signaling-induced cell death that maintains tissue health and homeostasis."
    }
  ]
}
