{
  "course": "Grade 11 Biology",
  "topic": "Ecology: Ecosystem Dynamics",
  "problems": [
    {
      "number": 1,
      "problem": "Define ecosystem.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "An ecosystem is a community of living organisms interacting with each other and with their physical environment."
        }
      ],
      "final_answer": "An ecosystem is the interaction of living organisms with each other and their environment."
    },
    {
      "number": 2,
      "problem": "Differentiate between biotic and abiotic factors.",
      "image": null,
      "step_by_step": [
        {
          "step": "Biotic factors",
          "explanation": "Living components of an ecosystem, e.g., plants, animals, bacteria."
        },
        {
          "step": "Abiotic factors",
          "explanation": "Non-living components, e.g., sunlight, temperature, water, soil."
        }
      ],
      "final_answer": "Biotic: living components; Abiotic: non-living components of an ecosystem."
    },
    {
      "number": 3,
      "problem": "Explain energy flow in an ecosystem.",
      "image": null,
      "step_by_step": [
        {
          "step": "Concept",
          "explanation": "Energy flows from producers to consumers to decomposers in a unidirectional manner."
        }
      ],
      "final_answer": "Energy flows one-way from producers → consumers → decomposers."
    },
    {
      "number": 4,
      "problem": "Define trophic levels.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Trophic levels are the hierarchical positions organisms occupy in a food chain, e.g., producers, primary consumers, secondary consumers, tertiary consumers."
        }
      ],
      "final_answer": "Trophic levels are positions in a food chain: producers, primary, secondary, tertiary consumers."
    },
    {
      "number": 5,
      "problem": "Explain the concept of food chain and food web.",
      "image": null,
      "step_by_step": [
        {
          "step": "Food chain",
          "explanation": "A linear sequence of organisms where each is eaten by the next."
        },
        {
          "step": "Food web",
          "explanation": "A network of interconnected food chains showing all feeding relationships in an ecosystem."
        }
      ],
      "final_answer": "Food chain: linear feeding sequence; Food web: network of multiple food chains."
    },
    {
      "number": 6,
      "problem": "Explain the 10% rule in energy transfer.",
      "image": null,
      "step_by_step": [
        {
          "step": "Rule",
          "explanation": "Only about 10% of energy is transferred from one trophic level to the next; the rest is lost as heat or used in metabolism."
        }
      ],
      "final_answer": "Approximately 10% of energy passes to the next trophic level; 90% is lost as heat or used by organisms."
    },
    {
      "number": 7,
      "problem": "Explain ecological succession.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Ecological succession is the gradual change in species composition and ecosystem structure over time."
        },
        {
          "step": "Types",
          "explanation": "Primary succession starts on bare land; secondary succession occurs after disturbance of an existing ecosystem."
        }
      ],
      "final_answer": "Succession: gradual ecosystem change; Primary: bare land; Secondary: after disturbance."
    },
    {
      "number": 8,
      "problem": "Define keystone species and give an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "A keystone species has a disproportionately large effect on its ecosystem relative to its abundance."
        },
        {
          "step": "Example",
          "explanation": "Sea otters control sea urchin populations, maintaining kelp forest ecosystems."
        }
      ],
      "final_answer": "Keystone species: critical species for ecosystem balance; e.g., sea otters in kelp forests."
    },
    {
      "number": 9,
      "problem": "Explain the role of decomposers in ecosystems.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Decomposers break down dead organic matter, recycling nutrients back into the soil for producers."
        }
      ],
      "final_answer": "Decomposers recycle nutrients by breaking down dead organisms."
    },
    {
      "number": 10,
      "problem": "Explain the difference between biomes and ecosystems.",
      "image": null,
      "step_by_step": [
        {
          "step": "Ecosystem",
          "explanation": "An ecosystem is a community of organisms and their environment in a specific area."
        },
        {
          "step": "Biome",
          "explanation": "A biome is a large region with similar climate, vegetation, and animal life, containing many ecosystems."
        }
      ],
      "final_answer": "Ecosystem: specific community and environment; Biome: large region with similar climate and multiple ecosystems."
    }
  ]
}
