{
  "course": "Grade 11 Biology",
  "topic": "Enzyme Kinetics and Catalysis",
  "problems": [
    {
      "number": 1,
      "problem": "Define enzyme.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "An enzyme is a biological catalyst that speeds up chemical reactions without being consumed."
        }
      ],
      "final_answer": "An enzyme is a protein that catalyzes chemical reactions without being used up."
    },
    {
      "number": 2,
      "problem": "Explain the role of enzymes in metabolism.",
      "image": null,
      "step_by_step": [
        {
          "step": "Role",
          "explanation": "Enzymes lower activation energy, allowing metabolic reactions to occur efficiently at physiological conditions."
        }
      ],
      "final_answer": "Enzymes accelerate metabolic reactions by lowering activation energy."
    },
    {
      "number": 3,
      "problem": "Define active site and substrate.",
      "image": null,
      "step_by_step": [
        {
          "step": "Active site",
          "explanation": "Region on the enzyme where the substrate binds and the reaction occurs."
        },
        {
          "step": "Substrate",
          "explanation": "The molecule upon which the enzyme acts."
        }
      ],
      "final_answer": "Active site: enzyme binding region; substrate: molecule the enzyme acts on."
    },
    {
      "number": 4,
      "problem": "Explain the lock and key model of enzyme action.",
      "image": null,
      "step_by_step": [
        {
          "step": "Model",
          "explanation": "The substrate fits exactly into the enzyme's active site like a key into a lock, forming the enzyme-substrate complex."
        }
      ],
      "final_answer": "Substrate fits precisely into the enzyme's active site, forming a complex for catalysis."
    },
    {
      "number": 5,
      "problem": "Explain the induced fit model of enzyme action.",
      "image": null,
      "step_by_step": [
        {
          "step": "Model",
          "explanation": "The enzyme changes shape slightly to fit the substrate more snugly, enhancing catalysis."
        }
      ],
      "final_answer": "The enzyme adjusts shape to better fit the substrate, facilitating the reaction."
    },
    {
      "number": 6,
      "problem": "Explain the effect of temperature on enzyme activity.",
      "image": null,
      "step_by_step": [
        {
          "step": "Temperature effect",
          "explanation": "Increasing temperature initially increases activity, but excessive heat denatures the enzyme, reducing activity."
        }
      ],
      "final_answer": "Enzyme activity rises with temperature until denaturation occurs at high heat."
    },
    {
      "number": 7,
      "problem": "Explain the effect of pH on enzyme activity.",
      "image": null,
      "step_by_step": [
        {
          "step": "pH effect",
          "explanation": "Each enzyme has an optimal pH; deviation can alter the enzyme's shape and reduce activity."
        }
      ],
      "final_answer": "Enzymes work best at optimal pH; extreme pH reduces activity by denaturing the enzyme."
    },
    {
      "number": 8,
      "problem": "Define cofactors and coenzymes and give examples.",
      "image": null,
      "step_by_step": [
        {
          "step": "Cofactors",
          "explanation": "Non-protein ions or molecules that assist enzyme activity; e.g., Mg²⁺, Fe²⁺."
        },
        {
          "step": "Coenzymes",
          "explanation": "Organic molecules that assist enzymes; e.g., NAD⁺, FAD."
        }
      ],
      "final_answer": "Cofactors: inorganic helpers (Mg²⁺); Coenzymes: organic helpers (NAD⁺)."
    },
    {
      "number": 9,
      "problem": "Explain competitive and non-competitive inhibition.",
      "image": null,
      "step_by_step": [
        {
          "step": "Competitive inhibition",
          "explanation": "Inhibitor binds to the active site, competing with the substrate."
        },
        {
          "step": "Non-competitive inhibition",
          "explanation": "Inhibitor binds elsewhere, changing enzyme shape and reducing activity."
        }
      ],
      "final_answer": "Competitive: inhibitor blocks active site; Non-competitive: inhibitor alters enzyme shape."
    },
    {
      "number": 10,
      "problem": "Explain the concept of Vmax and Km in enzyme kinetics.",
      "image": null,
      "step_by_step": [
        {
          "step": "Vmax",
          "explanation": "Maximum rate of reaction when the enzyme is saturated with substrate."
        },
        {
          "step": "Km",
          "explanation": "Substrate concentration at which the reaction rate is half of Vmax; indicates enzyme affinity for substrate."
        }
      ],
      "final_answer": "Vmax: maximum reaction rate; Km: substrate concentration for half Vmax, indicating enzyme affinity."
    }
  ]
}
