{
  "course": "Grade 11 Biology",
  "topic": "Human Physiology: Major Systems",
  "problems": [
    {
      "number": 1,
      "problem": "List the major human body systems.",
      "image": null,
      "step_by_step": [
        {
          "step": "Major systems",
          "explanation": "The major human body systems include: circulatory, respiratory, digestive, nervous, muscular, skeletal, endocrine, urinary, reproductive, and immune systems."
        }
      ],
      "final_answer": "Circulatory, respiratory, digestive, nervous, muscular, skeletal, endocrine, urinary, reproductive, and immune systems."
    },
    {
      "number": 2,
      "problem": "Explain the main function of the circulatory system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The circulatory system transports blood, nutrients, gases, and wastes throughout the body."
        }
      ],
      "final_answer": "Transports blood, nutrients, oxygen, and waste products around the body."
    },
    {
      "number": 3,
      "problem": "Explain the role of the respiratory system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The respiratory system exchanges gases between the body and the environment, supplying oxygen and removing carbon dioxide."
        }
      ],
      "final_answer": "Provides oxygen to the blood and removes carbon dioxide from the body."
    },
    {
      "number": 4,
      "problem": "Explain the function of the digestive system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The digestive system breaks down food into nutrients that can be absorbed and used for energy, growth, and repair."
        }
      ],
      "final_answer": "Breaks down food and absorbs nutrients for energy and growth."
    },
    {
      "number": 5,
      "problem": "Explain the role of the nervous system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The nervous system coordinates body activities by transmitting signals between the brain, spinal cord, and other body parts."
        }
      ],
      "final_answer": "Coordinates body functions via electrical and chemical signals."
    },
    {
      "number": 6,
      "problem": "Explain the function of the muscular system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The muscular system enables movement, maintains posture, and generates heat."
        }
      ],
      "final_answer": "Enables movement, maintains posture, and produces heat."
    },
    {
      "number": 7,
      "problem": "Explain the function of the skeletal system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The skeletal system supports the body, protects organs, and works with muscles to facilitate movement."
        }
      ],
      "final_answer": "Supports and protects the body and enables movement with muscles."
    },
    {
      "number": 8,
      "problem": "Explain the function of the endocrine system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The endocrine system produces hormones that regulate growth, metabolism, reproduction, and homeostasis."
        }
      ],
      "final_answer": "Secretes hormones to regulate body functions and maintain homeostasis."
    },
    {
      "number": 9,
      "problem": "Explain the function of the urinary system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The urinary system removes waste products from the blood, regulates water and electrolyte balance, and maintains pH."
        }
      ],
      "final_answer": "Removes wastes, balances water and electrolytes, and regulates pH."
    },
    {
      "number": 10,
      "problem": "Explain the role of the immune system.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "The immune system defends the body against pathogens and foreign substances."
        }
      ],
      "final_answer": "Protects the body from infections and harmful foreign substances."
    }
  ]
}
