{
  "course": "Grade 11 Biology",
  "topic": "Membrane Transport and Dynamics",
  "problems": [
    {
      "number": 1,
      "problem": "Define selective permeability of the plasma membrane.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Selective permeability is the property of the plasma membrane that allows certain substances to pass while blocking others."
        }
      ],
      "final_answer": "Selective permeability allows some substances to cross the membrane while restricting others."
    },
    {
      "number": 2,
      "problem": "Explain the difference between passive and active transport.",
      "image": null,
      "step_by_step": [
        {
          "step": "Passive transport",
          "explanation": "Movement of molecules down their concentration gradient without energy input."
        },
        {
          "step": "Active transport",
          "explanation": "Movement of molecules against their concentration gradient using energy (ATP)."
        }
      ],
      "final_answer": "Passive transport uses no energy; active transport requires energy to move substances against gradients."
    },
    {
      "number": 3,
      "problem": "Describe diffusion and give an example.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Diffusion is the movement of molecules from a region of high concentration to low concentration."
        },
        {
          "step": "Example",
          "explanation": "Oxygen diffusing from alveoli into blood."
        }
      ],
      "final_answer": "Diffusion is the movement from high to low concentration; e.g., oxygen moves from lungs into blood."
    },
    {
      "number": 4,
      "problem": "Describe osmosis and its importance.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Osmosis is the diffusion of water across a selectively permeable membrane from low solute concentration to high solute concentration."
        },
        {
          "step": "Importance",
          "explanation": "Maintains cell turgor, regulates water balance in cells and tissues."
        }
      ],
      "final_answer": "Osmosis moves water to balance solutes, maintaining turgor and water balance in cells."
    },
    {
      "number": 5,
      "problem": "Explain facilitated diffusion.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Facilitated diffusion is the passive movement of molecules across membranes via transport proteins."
        },
        {
          "step": "Example",
          "explanation": "Glucose transport through GLUT proteins."
        }
      ],
      "final_answer": "Facilitated diffusion moves molecules passively through proteins; e.g., glucose transport."
    },
    {
      "number": 6,
      "problem": "Explain endocytosis and exocytosis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Endocytosis",
          "explanation": "Process by which cells engulf substances into vesicles to bring them inside."
        },
        {
          "step": "Exocytosis",
          "explanation": "Process by which cells release substances from vesicles to the outside."
        }
      ],
      "final_answer": "Endocytosis brings materials in; exocytosis releases materials out of the cell."
    },
    {
      "number": 7,
      "problem": "Define phagocytosis and pinocytosis.",
      "image": null,
      "step_by_step": [
        {
          "step": "Phagocytosis",
          "explanation": "Cell engulfs large particles or cells (cell eating)."
        },
        {
          "step": "Pinocytosis",
          "explanation": "Cell engulfs fluids and dissolved substances (cell drinking)."
        }
      ],
      "final_answer": "Phagocytosis engulfs solids; pinocytosis engulfs liquids."
    },
    {
      "number": 8,
      "problem": "Explain the role of membrane proteins in transport.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Membrane proteins act as channels, carriers, or pumps to facilitate the movement of substances across the membrane."
        }
      ],
      "final_answer": "Membrane proteins help move substances via channels, carriers, or pumps."
    },
    {
      "number": 9,
      "problem": "Explain the effect of tonicity on cells.",
      "image": null,
      "step_by_step": [
        {
          "step": "Isotonic",
          "explanation": "No net water movement; cell maintains shape."
        },
        {
          "step": "Hypertonic",
          "explanation": "Water leaves the cell; cell shrinks (crenation in animal cells)."
        },
        {
          "step": "Hypotonic",
          "explanation": "Water enters the cell; cell swells (may burst in animal cells, turgid in plant cells)."
        }
      ],
      "final_answer": "Tonicity affects water movement: isotonic (stable), hypertonic (shrinks), hypotonic (swells)."
    },
    {
      "number": 10,
      "problem": "Explain the sodium-potassium pump and its importance.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "The sodium-potassium pump actively transports 3 Na⁺ out and 2 K⁺ into the cell using ATP."
        },
        {
          "step": "Importance",
          "explanation": "Maintains resting membrane potential, cell volume, and ion gradients for nerve and muscle function."
        }
      ],
      "final_answer": "The sodium-potassium pump maintains ion gradients, resting potential, and cell volume using ATP."
    }
  ]
}
