{
  "course": "Grade 11 Biology",
  "topic": "Molecular Genetics: DNA Replication",
  "problems": [
    {
      "number": 1,
      "problem": "Define DNA replication.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "DNA replication is the process by which a cell copies its DNA before cell division."
        }
      ],
      "final_answer": "DNA replication is the process of copying DNA to ensure each daughter cell receives an identical genome."
    },
    {
      "number": 2,
      "problem": "Explain the role of helicase in DNA replication.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Helicase unwinds the double-stranded DNA by breaking hydrogen bonds between complementary bases."
        }
      ],
      "final_answer": "Helicase unwinds DNA by breaking hydrogen bonds between base pairs."
    },
    {
      "number": 3,
      "problem": "Explain the role of DNA polymerase.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "DNA polymerase synthesizes new DNA strands by adding nucleotides complementary to the template strand."
        }
      ],
      "final_answer": "DNA polymerase builds new DNA strands by matching nucleotides to the template."
    },
    {
      "number": 4,
      "problem": "Explain the role of primase.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Primase synthesizes a short RNA primer to provide a starting point for DNA polymerase."
        }
      ],
      "final_answer": "Primase makes RNA primers so DNA polymerase can start DNA synthesis."
    },
    {
      "number": 5,
      "problem": "Explain the role of ligase.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "DNA ligase joins Okazaki fragments on the lagging strand to create a continuous DNA strand."
        }
      ],
      "final_answer": "Ligase seals gaps between DNA fragments to form a complete strand."
    },
    {
      "number": 6,
      "problem": "Differentiate between leading and lagging strands.",
      "image": null,
      "step_by_step": [
        {
          "step": "Leading strand",
          "explanation": "Synthesized continuously in the 5' → 3' direction toward the replication fork."
        },
        {
          "step": "Lagging strand",
          "explanation": "Synthesized discontinuously in Okazaki fragments away from the replication fork."
        }
      ],
      "final_answer": "Leading strand: continuous synthesis; Lagging strand: discontinuous synthesis via Okazaki fragments."
    },
    {
      "number": 7,
      "problem": "Explain the semi-conservative nature of DNA replication.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Each new DNA molecule consists of one original (parental) strand and one newly synthesized strand."
        }
      ],
      "final_answer": "DNA replication is semi-conservative: one parental strand and one new strand per DNA molecule."
    },
    {
      "number": 8,
      "problem": "Explain the role of single-strand binding proteins (SSBs).",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "SSBs bind to single-stranded DNA to prevent it from re-annealing or forming secondary structures."
        }
      ],
      "final_answer": "SSBs stabilize single-stranded DNA during replication."
    },
    {
      "number": 9,
      "problem": "Explain the importance of the replication origin.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Replication begins at a specific DNA sequence called the origin, where the replication machinery assembles."
        }
      ],
      "final_answer": "Replication origin is where DNA replication starts and the machinery assembles."
    },
    {
      "number": 10,
      "problem": "Explain the role of topoisomerase.",
      "image": null,
      "step_by_step": [
        {
          "step": "Function",
          "explanation": "Topoisomerase relieves supercoiling and tension ahead of the replication fork by cutting and rejoining DNA strands."
        }
      ],
      "final_answer": "Topoisomerase prevents DNA tangling by relieving supercoils during replication."
    }
  ]
}
