{
  "expanded_description": "This section focuses on adding vectors that are perpendicular to each other. When two vectors are at right angles, their resultant can be found using the Pythagorean theorem for magnitude and simple trigonometry for direction. This special case is common in physics, especially when dealing with horizontal and vertical components of motion.",
  "core_concept": {
    "principle": "When two vectors are perpendicular, the magnitude of their resultant is found using the Pythagorean theorem: $R = \\sqrt{A^2 + B^2}$, and the direction is given by $\\theta = \\tan^{-1}(B/A)$ (or $A/B$) relative to one of the vectors.",
    "explanation": "Perpendicular vectors are independent; their effects do not interfere. The resultant is the diagonal of the rectangle (or square) formed by the two vectors. This simplicity makes perpendicular vector addition a cornerstone of two‑dimensional kinematics, especially for resolving motion into horizontal and vertical components.",
    "image": {
      "src": "images/unit3/perpendicular_addition.png",
      "alt": "Two perpendicular vectors A and B with their resultant R forming the diagonal of a rectangle",
      "caption": "The resultant of two perpendicular vectors is the diagonal of the rectangle they form"
    }
  },
  "sections": [
    {
      "section_title": "Adding Perpendicular Vectors",
      "introduction": "When two vectors are at right angles (90°) to each other, their addition is particularly straightforward. This situation appears frequently in physics, for example when combining horizontal and vertical velocity components or when adding force vectors that are perpendicular.",
      "key_concept": {
        "definition": "Perpendicular vector addition is the process of finding the resultant of two vectors that are oriented at 90° to each other. The resultant's magnitude is given by the Pythagorean theorem, and its direction is found using an inverse tangent.",
        "context": "Understanding this special case is essential because any vector can be broken into perpendicular components; adding those components back together is exactly the reverse of resolution."
      },
      "principles": [
        {
          "principle": "Magnitude from Pythagorean Theorem",
          "statement": "If $\\vec{A}$ and $\\vec{B}$ are perpendicular, the magnitude of their resultant $\\vec{R} = \\vec{A} + \\vec{B}$ is $R = \\sqrt{A^2 + B^2}$.",
          "application": "Treat the two vectors as the legs of a right triangle; the resultant is the hypotenuse.",
          "example": "A displacement of 3 km east and 4 km north gives $R = \\sqrt{3^2 + 4^2} = 5$ km."
        },
        {
          "principle": "Direction from Tangent",
          "statement": "The direction of the resultant relative to $\\vec{A}$ is given by $\\theta = \\tan^{-1}(B/A)$, where $B$ is the magnitude of the vector perpendicular to $A$.",
          "application": "Choose a reference vector and use the appropriate ratio. The angle tells how far the resultant is rotated from that reference.",
          "example": "For the 3 km east and 4 km north vectors, the angle north of east is $\\theta = \\tan^{-1}(4/3) = 53.1°$."
        },
        {
          "principle": "Graphical Interpretation",
          "statement": "Graphically, the two perpendicular vectors form a rectangle (or square if equal). The resultant is the diagonal from the origin to the opposite corner.",
          "application": "This visual helps verify calculations and understand that the resultant is always longer than either individual vector (unless one is zero).",
          "example": "Drawing a 3 cm arrow east and a 4 cm arrow north tip‑to‑tail shows the 5 cm diagonal."
        }
      ],
      "worked_examples": [
        {
          "title": "Basic Perpendicular Addition",
          "problem": "A car travels 6.0 km east, then 8.0 km north. Find the displacement (magnitude and direction) from the starting point.",
          "step_by_step": [
            {
              "step": "Identify the vectors",
              "explanation": "$\\vec{A} = 6.0$ km east, $\\vec{B} = 8.0$ km north. They are perpendicular."
            },
            {
              "step": "Find magnitude",
              "explanation": "$R = \\sqrt{(6.0)^2 + (8.0)^2} = \\sqrt{36 + 64} = \\sqrt{100} = 10$ km"
            },
            {
              "step": "Find direction",
              "explanation": "Angle north of east: $\\theta = \\tan^{-1}(8.0/6.0) = \\tan^{-1}(1.333) = 53.1°$"
            }
          ],
          "final_answer": "$10$ km at $53.1°$ north of east",
          "concept_applied": "For perpendicular vectors, magnitude uses Pythagorean theorem, direction uses arctan of the ratio."
        },
        {
          "title": "Perpendicular Vectors with Different Units",
          "problem": "A force of 12 N acts horizontally to the right, and a force of 5 N acts vertically upward. Find the resultant force.",
          "step_by_step": [
            {
              "step": "Set up",
              "explanation": "$F_x = 12$ N, $F_y = 5$ N. They are perpendicular."
            },
            {
              "step": "Magnitude",
              "explanation": "$F_R = \\sqrt{12^2 + 5^2} = \\sqrt{144 + 25} = \\sqrt{169} = 13$ N"
            },
            {
              "step": "Direction",
              "explanation": "Angle above horizontal: $\\theta = \\tan^{-1}(5/12) = \\tan^{-1}(0.4167) = 22.6°$"
            }
          ],
          "final_answer": "$13$ N at $22.6°$ above horizontal",
          "concept_applied": "Same method applies to any vector quantities (force, velocity, displacement)."
        },
        {
          "title": "Resultant When One Vector is Zero",
          "problem": "A boat travels 10 m/s east, and there is no current (0 m/s north). Find the resultant velocity.",
          "step_by_step": [
            {
              "step": "Recognize zero vector",
              "explanation": "$v_x = 10$ m/s, $v_y = 0$ m/s. They are still perpendicular (zero vector is perpendicular to any vector)."
            },
            {
              "step": "Magnitude",
              "explanation": "$v = \\sqrt{10^2 + 0^2} = 10$ m/s"
            },
            {
              "step": "Direction",
              "explanation": "$\\theta = \\tan^{-1}(0/10) = 0°$, so directly east."
            }
          ],
          "final_answer": "$10$ m/s east",
          "concept_applied": "Adding a zero vector leaves the other unchanged."
        }
      ],
      "image": {
        "src": "images/unit3/perpendicular_example.png",
        "alt": "Diagram of the 6 km east and 8 km north example with resultant",
        "caption": "The resultant of perpendicular vectors forms the hypotenuse of a right triangle"
      }
    },
    {
      "section_title": "Adding Multiple Perpendicular Vectors",
      "introduction": "When several vectors are all mutually perpendicular (e.g., along x, y, and possibly z axes), the resultant can be found by first summing components in each direction, then applying the Pythagorean theorem (in 2D) or its extension (in 3D).",
      "key_concept": {
        "definition": "For multiple perpendicular vectors, combine all vectors along the same direction into a single component, then treat the resulting perpendicular components as a new pair.",
        "context": "This approach is essentially the component method simplified because the vectors are already aligned with the axes."
      },
      "principles": [
        {
          "principle": "Sum Like Directions First",
          "statement": "Add all vectors pointing in the same direction to get a net component along that axis.",
          "application": "If you have several east vectors and several west vectors, find the net east component (taking signs into account). Do the same for north/south.",
          "example": "5 N east + 3 N east + 2 N west = (5+3-2) = 6 N east."
        },
        {
          "principle": "Then Combine Perpendicular Components",
          "statement": "Once you have one net horizontal component and one net vertical component (they are perpendicular), use the Pythagorean theorem and arctan to find the resultant.",
          "application": "Treat the net components as the legs of a right triangle.",
          "example": "If net east = 6 N and net north = 8 N, then $R = 10$ N at $\\theta = \\tan^{-1}(8/6)$."
        }
      ],
      "worked_examples": [
        {
          "title": "Multiple Perpendicular Vectors",
          "problem": "An object experiences forces: 10 N east, 7 N east, 4 N west, 5 N north, and 2 N south. Find the net force.",
          "step_by_step": [
            {
              "step": "Sum east-west forces",
              "explanation": "East positive: $F_x = 10 + 7 - 4 = 13$ N east"
            },
            {
              "step": "Sum north-south forces",
              "explanation": "North positive: $F_y = 5 - 2 = 3$ N north"
            },
            {
              "step": "Find magnitude",
              "explanation": "$F = \\sqrt{13^2 + 3^2} = \\sqrt{169 + 9} = \\sqrt{178} = 13.34$ N"
            },
            {
              "step": "Find direction",
              "explanation": "$\\theta = \\tan^{-1}(3/13) = \\tan^{-1}(0.2308) = 13.0°$ north of east"
            }
          ],
          "final_answer": "$13.3$ N at $13.0°$ north of east",
          "concept_applied": "Combine like directions first, then treat the two perpendicular components as a single pair."
        }
      ]
    },
    {
      "section_title": "Relation to Vector Components",
      "introduction": "Adding perpendicular vectors is exactly the reverse process of resolving a vector into components. Understanding this connection solidifies the concept.",
      "key_concept": {
        "definition": "If a vector $\\vec{R}$ has components $R_x$ and $R_y$, then $\\vec{R}$ is the resultant of the perpendicular vectors $R_x\\hat{i}$ and $R_y\\hat{j}$.",
        "context": "This relationship shows that component resolution and perpendicular addition are two sides of the same coin."
      },
      "principles": [
        {
          "principle": "Components as Perpendicular Vectors",
          "statement": "Any vector can be thought of as the sum of two perpendicular vectors (its components).",
          "application": "When you have the components, you already have the perpendicular vectors; adding them gives back the original vector.",
          "example": "A vector with components 3 and 4 is the sum of a 3‑unit horizontal vector and a 4‑unit vertical vector."
        }
      ]
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoiding common errors ensures correct results when adding perpendicular vectors.",
      "classifications": [
        {
          "type": "Arithmetic Errors in Pythagorean Theorem",
          "value": "Miscalculating squares or square roots",
          "characteristics": [
            "Adding squares without squaring",
            "Forgetting to take square root",
            "Using $A + B$ instead of $\\sqrt{A^2 + B^2}$"
          ],
          "behavior": "This leads to an overestimate of the magnitude. Always remember that the resultant is the hypotenuse, not the sum of legs.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "$R = 3 + 4 = 7$ (wrong)."
            },
            {
              "process": "Correct",
              "explanation": "$R = \\sqrt{3^2 + 4^2} = 5$."
            }
          ]
        },
        {
          "type": "Angle Reference Confusion",
          "value": "Using the wrong ratio for direction",
          "characteristics": [
            "Using $\\tan^{-1}(A/B)$ when it should be $B/A$",
            "Not specifying which vector is the reference"
          ],
          "behavior": "This gives the complementary angle. Always decide whether you want the angle from vector A or from vector B.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "For 3 east, 4 north, student says angle = $\\tan^{-1}(3/4) = 36.9°$ north of east (should be 53.1°)."
            },
            {
              "process": "Correct",
              "explanation": "Angle from east is $\\tan^{-1}(\\text{north}/\\text{east}) = \\tan^{-1}(4/3)$."
            }
          ]
        },
        {
          "type": "Sign Neglect",
          "value": "Forgetting that components can be negative",
          "characteristics": [
            "Using magnitudes only in Pythagorean theorem when components have signs",
            "Not accounting for direction in quadrant"
          ],
          "behavior": "If one component is negative, the resultant lies in a different quadrant. The magnitude calculation uses squares, so signs don't affect magnitude, but direction must be adjusted.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "$R_x = -3$, $R_y = 4$, student finds $R = 5$ (correct) but angle = $\\tan^{-1}(4/3) = 53°$ (should be $180-53 = 127°$)."
            },
            {
              "process": "Correct",
              "explanation": "Angle measured from +x axis is $180° - 53° = 127°$."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit3/perpendicular_mistakes.png",
        "alt": "Common mistakes in perpendicular vector addition: adding magnitudes, wrong angle ratio",
        "caption": "Common errors include using $A+B$ for magnitude and mixing up the ratio for direction"
      }
    }
  ],
  "key_terms": [
    "Perpendicular Vectors",
    "Right Angle",
    "Pythagorean Theorem",
    "Resultant",
    "Magnitude",
    "Direction",
    "Tangent",
    "Inverse Tangent",
    "Component",
    "Hypotenuse",
    "Legs",
    "Quadrant"
  ],
  "summary": "Adding perpendicular vectors is a fundamental skill in 2D kinematics. When two vectors are at right angles, the magnitude of their resultant is given by the Pythagorean theorem: $R = \\sqrt{A^2 + B^2}$, where $A$ and $B$ are the magnitudes of the perpendicular vectors. The direction of the resultant relative to one of the vectors is found using the inverse tangent: $\\theta = \\tan^{-1}(\\text{opposite}/\\text{adjacent})$. This method extends to multiple perpendicular vectors by first combining all vectors along the same axis to obtain net components, then treating those net components as a perpendicular pair. The process is the reverse of resolving a vector into components: if a vector has components $R_x$ and $R_y$, it is the resultant of perpendicular vectors of those magnitudes. Common mistakes include incorrectly adding magnitudes (using $A+B$ instead of the Pythagorean sum), mixing up the ratio for the angle, and neglecting the signs of components when determining the quadrant for the direction. Mastery of perpendicular vector addition prepares students for more general vector addition and for analyzing projectile motion, where horizontal and vertical motions are perpendicular and independent."
}
