{
  "expanded_description": "This section introduces projectile motion, the curved path an object follows when launched into the air and influenced only by gravity (neglecting air resistance). The key insight is that horizontal and vertical motions are independent and can be analyzed separately using one‑dimensional kinematics.",
  "core_concept": {
    "principle": "Projectile motion is the superposition of two independent motions: constant velocity in the horizontal direction and constant acceleration (gravity) in the vertical direction.",
    "explanation": "Because gravity acts only vertically, it does not affect horizontal motion. This independence allows us to break any projectile problem into two simpler 1D problems: one for the horizontal motion (no acceleration) and one for the vertical motion (constant acceleration $g$).",
    "image": {
      "src": "images/unit3/projectile_intro.png",
      "alt": "Diagram of a projectile path showing horizontal motion (constant speed) and vertical motion (accelerated) separately",
      "caption": "A projectile's motion is the combination of constant horizontal velocity and accelerated vertical motion"
    }
  },
  "sections": [
    {
      "section_title": "What is a Projectile?",
      "introduction": "A projectile is any object that is launched into the air and allowed to move freely under the influence of gravity alone. Examples include a thrown ball, a fired cannonball, or water from a fountain.",
      "key_concept": {
        "definition": "A projectile is an object upon which the only force acting is gravity (air resistance is neglected). It follows a parabolic trajectory.",
        "context": "Understanding projectile motion is essential in sports, ballistics, and many engineering applications. The independence of horizontal and vertical motions is the key principle."
      },
      "principles": [
        {
          "principle": "Gravity Only Vertically",
          "statement": "The only acceleration a projectile experiences is the downward acceleration due to gravity, $g = 9.8\\,\\text{m/s}^2$. There is no horizontal acceleration (ignoring air resistance).",
          "application": "This means the horizontal velocity remains constant throughout the flight, while the vertical velocity changes at a constant rate.",
          "example": "A ball thrown horizontally has constant horizontal speed and vertically accelerates downward exactly like an object dropped from rest."
        },
        {
          "principle": "Parabolic Path",
          "statement": "The combination of constant horizontal motion and uniformly accelerated vertical motion produces a parabolic trajectory.",
          "application": "The shape of the path is always a parabola (symmetric if launch and landing heights are equal).",
          "example": "Water from a hose, if aimed upward, forms a parabolic arc."
        }
      ]
    },
    {
      "section_title": "Independence of Horizontal and Vertical Motion",
      "introduction": "The most important idea in projectile motion is that horizontal and vertical motions are independent. What happens in the vertical direction does not affect the horizontal, and vice versa.",
      "key_concept": {
        "definition": "The independence principle states that the horizontal and vertical components of a projectile's motion can be treated separately. The time of flight is determined solely by the vertical motion; the horizontal distance depends on both the time of flight and the constant horizontal velocity.",
        "context": "This principle was first clearly stated by Galileo and is the foundation for solving all projectile problems."
      },
      "classifications": [
        {
          "type": "Horizontal Motion",
          "value": "Constant velocity motion",
          "characteristics": [
            "$a_x = 0$",
            "$v_x = \\text{constant}$",
            "$\\Delta x = v_x t$"
          ],
          "behavior": "Since no horizontal force acts, the horizontal velocity never changes. The horizontal distance covered is simply horizontal speed multiplied by time of flight.",
          "examples": [
            {
              "process": "Horizontal velocity constant",
              "explanation": "A projectile launched with $v_x = 10$ m/s will still have $v_x = 10$ m/s at the top of its path and just before landing."
            }
          ]
        },
        {
          "type": "Vertical Motion",
          "value": "Constant acceleration motion",
          "characteristics": [
            "$a_y = -g = -9.8\\,\\text{m/s}^2$ (if up is positive)",
            "$v_y$ changes linearly with time",
            "Vertical displacement follows $\\Delta y = v_{iy}t - \\frac{1}{2}gt^2$"
          ],
          "behavior": "Vertically, the projectile behaves exactly like an object thrown straight up or down with the same initial vertical velocity. Gravity affects only this component.",
          "examples": [
            {
              "process": "Vertical velocity at top",
              "explanation": "At the highest point, $v_y = 0$, but $v_x$ remains unchanged."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Independence Demonstration",
          "problem": "A ball is thrown horizontally from a cliff at 15 m/s. Another ball is dropped straight down from the same cliff at the same instant. Which hits the ground first?",
          "step_by_step": [
            {
              "step": "Analyze vertical motion",
              "explanation": "Both balls start with zero vertical velocity ($v_{iy}=0$) and fall the same height under gravity. Vertical motion depends only on initial vertical velocity and height, not on horizontal motion."
            },
            {
              "step": "Conclusion",
              "explanation": "Both balls hit the ground at the same time because their vertical motions are identical."
            }
          ],
          "final_answer": "Both hit the ground at the same time.",
          "concept_applied": "Horizontal motion does not affect the time to fall vertically."
        }
      ],
      "image": {
        "src": "images/unit3/independence.png",
        "alt": "Side-by-side comparison: ball dropped and ball thrown horizontally, showing same vertical motion",
        "caption": "A ball dropped and a ball thrown horizontally fall at the same rate vertically"
      }
    },
    {
      "section_title": "Key Equations for Projectile Motion",
      "introduction": "Using the independence principle, we can write separate sets of equations for horizontal and vertical motion. These are the 1D kinematics equations applied to each direction.",
      "key_concept": {
        "definition": "For any projectile (neglecting air resistance), the motion is described by:\nHorizontal: $v_x = v_{ix}$ (constant), $x = x_0 + v_{ix}t$\nVertical: $v_y = v_{iy} - gt$, $y = y_0 + v_{iy}t - \\frac{1}{2}gt^2$",
        "context": "These equations are the starting point for all projectile problems. The initial velocity components come from the launch speed and angle: $v_{ix} = v_i \\cos \\theta$, $v_{iy} = v_i \\sin \\theta$."
      },
      "principles": [
        {
          "principle": "Initial Velocity Components",
          "statement": "If launched with speed $v_i$ at angle $\\theta$ above horizontal: $v_{ix} = v_i \\cos \\theta$, $v_{iy} = v_i \\sin \\theta$.",
          "application": "These components remain valid throughout (horizontal constant, vertical changes).",
          "example": "For $v_i = 20$ m/s, $\\theta = 30°$: $v_{ix} = 20\\cos30° = 17.3$ m/s, $v_{iy} = 20\\sin30° = 10$ m/s."
        },
        {
          "principle": "Time of Flight",
          "statement": "The total time the projectile is in the air is determined by the vertical motion. For a symmetric launch and landing at same height, $t_{flight} = \\frac{2v_{iy}}{g}$.",
          "application": "For launches from and to different heights, solve the vertical displacement equation for time.",
          "example": "If $v_{iy} = 10$ m/s, time to top is $10/9.8 \\approx 1.02$ s; total flight time $\\approx 2.04$ s."
        },
        {
          "principle": "Range",
          "statement": "The horizontal distance traveled (range) is $R = v_{ix} \\times t_{flight}$.",
          "application": "Once time of flight is known from vertical motion, multiply by constant horizontal speed.",
          "example": "With $v_{ix} = 17.3$ m/s and $t_{flight} = 2.04$ s, $R \\approx 35.3$ m."
        },
        {
          "principle": "Maximum Height",
          "statement": "The maximum height reached is determined solely by vertical motion: $H = \\frac{v_{iy}^2}{2g}$ (when launched from ground level).",
          "application": "At maximum height, $v_y = 0$, so use $v_y^2 = v_{iy}^2 - 2g\\Delta y$.",
          "example": "$v_{iy} = 10$ m/s gives $H = 100/(2\\times9.8) \\approx 5.1$ m."
        }
      ],
      "image": {
        "src": "images/unit3/projectile_equations.png",
        "alt": "Projectile diagram with labeled components, velocity vectors, and key parameters",
        "caption": "The initial velocity is resolved into components; each direction is analyzed separately"
      }
    },
    {
      "section_title": "Common Misconceptions",
      "introduction": "Several common misconceptions can lead to errors in projectile problems. Understanding them helps avoid mistakes.",
      "classifications": [
        {
          "type": "Horizontal Force",
          "value": "Believing a horizontal force acts on a projectile",
          "characteristics": [
            "Thinking that something must push it forward",
            "Assuming horizontal speed decreases",
            "Not realizing only gravity acts"
          ],
          "behavior": "Once launched, the only force is gravity (vertically). No horizontal force means constant horizontal velocity.",
          "examples": [
            {
              "process": "Misconception",
              "explanation": "Student thinks a ball thrown horizontally slows down horizontally because it's moving."
            },
            {
              "process": "Correct",
              "explanation": "Horizontal velocity remains constant; it only changes vertically due to gravity."
            }
          ]
        },
        {
          "type": "Effect of Mass",
          "value": "Thinking heavier objects fall faster or have different ranges",
          "characteristics": [
            "Assuming mass affects acceleration",
            "Neglecting that $g$ is independent of mass",
            "Applying everyday experience with air resistance"
          ],
          "behavior": "In vacuum (neglecting air resistance), all objects fall with same acceleration $g$, regardless of mass. Horizontal motion also independent of mass.",
          "examples": [
            {
              "process": "Misconception",
              "explanation": "Student says a heavier cannonball will go farther."
            },
            {
              "process": "Correct",
              "explanation": "If launched with same speed and angle, range and height are identical (ignoring air resistance)."
            }
          ]
        },
        {
          "type": "Velocity at Top",
          "value": "Believing velocity is zero at the highest point",
          "characteristics": [
            "Forgetting horizontal component",
            "Thinking object stops momentarily",
            "Confusing with vertical velocity"
          ],
          "behavior": "At the top, vertical velocity is zero, but horizontal velocity remains unchanged. The object is still moving horizontally.",
          "examples": [
            {
              "process": "Misconception",
              "explanation": "Student says a projectile at the top has zero velocity."
            },
            {
              "process": "Correct",
              "explanation": "At the top, $v_y = 0$, but $v_x$ is still present, so total velocity is $v_x$ horizontally."
            }
          ]
        },
        {
          "type": "Independence Misunderstanding",
          "value": "Thinking horizontal motion affects vertical time",
          "characteristics": [
            "Believing faster horizontal speed means longer flight time",
            "Assuming range depends on both components equally"
          ],
          "behavior": "Time of flight is determined solely by vertical motion (initial vertical velocity and height). Horizontal speed affects range but not duration.",
          "examples": [
            {
              "process": "Misconception",
              "explanation": "Student thinks a bullet fired horizontally takes longer to hit ground than one dropped."
            },
            {
              "process": "Correct",
              "explanation": "Both hit ground at same time if fired horizontally from same height."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit3/projectile_misconceptions.png",
        "alt": "Illustrations of common misconceptions: horizontal force, velocity at top, mass effect",
        "caption": "Common misconceptions can lead to incorrect predictions about projectile motion"
      }
    }
  ],
  "key_terms": [
    "Projectile",
    "Trajectory",
    "Parabola",
    "Independence of Motion",
    "Horizontal Motion",
    "Vertical Motion",
    "Constant Velocity",
    "Constant Acceleration",
    "Gravity",
    "$g = 9.8\\,\\text{m/s}^2$",
    "Initial Velocity Components",
    "Time of Flight",
    "Range",
    "Maximum Height",
    "Apex"
  ],
  "summary": "Projectile motion is the curved path of an object under the influence of gravity alone (air resistance neglected). The key principle is the independence of horizontal and vertical motions: horizontally, the velocity is constant ($a_x = 0$); vertically, the acceleration is constant downward ($a_y = -g$). This allows us to analyze each direction separately using one‑dimensional kinematics. The initial velocity is resolved into components: $v_{ix} = v_i \\cos \\theta$, $v_{iy} = v_i \\sin \\theta$. Important derived quantities: time of flight (from vertical motion), range $R = v_{ix} \\times t_{flight}$, and maximum height $H = v_{iy}^2/(2g)$. Common misconceptions include thinking a horizontal force acts, that mass affects the motion, that velocity is zero at the top, and that horizontal speed affects time of flight. Understanding these foundations is essential for solving both horizontally launched and angled projectile problems."
}
