{
  "expanded_description": "This section introduces the concept of relative motion, which describes how the motion of an object appears differently to observers in different frames of reference. Understanding relative motion is essential for analyzing situations where multiple objects move relative to each other, such as boats crossing rivers, airplanes flying in wind, or passengers walking on moving vehicles.",
  "core_concept": {
    "principle": "All motion is relative; there is no absolute frame of reference. The velocity of an object depends on the observer's frame of reference. Relative velocity is the velocity of one object as observed from another moving object.",
    "explanation": "A person sitting on a train sees the platform moving backward, while a person on the platform sees the train moving forward. Both observations are correct within their own frames. Relative motion lets us translate between different frames, which is crucial for navigation, collision avoidance, and understanding complex motions.",
    "image": {
      "src": "images/unit3/relative_motion_intro.png",
      "alt": "Diagram showing a person on a moving train and a person on the ground, with velocity vectors",
      "caption": "Motion appears differently to observers in different frames of reference."
    }
  },
  "sections": [
    {
      "section_title": "Frames of Reference",
      "introduction": "A frame of reference is a coordinate system used to measure positions and velocities. Different frames can be moving relative to each other, leading to different descriptions of the same physical event.",
      "key_concept": {
        "definition": "A frame of reference is a set of axes (and a clock) relative to which motion is measured. An inertial frame is one that is not accelerating; in such frames, Newton's laws hold simply.",
        "context": "In kinematics, we often switch between frames to simplify problems. For example, analyzing a boat crossing a river is easier in the river's frame or the ground's frame."
      },
      "principles": [
        {
          "principle": "Observers in Different Frames See Different Velocities",
          "statement": "The velocity of an object depends on the observer's frame. If two frames move relative to each other, the velocities measured in each frame differ by the relative velocity of the frames.",
          "application": "To find the velocity of an object in a different frame, add (vectorially) the object's velocity in one frame to the velocity of the second frame relative to the first.",
          "example": "A person walks forward at 2 m/s on a train moving at 10 m/s. To an observer on the ground, the person's velocity is 12 m/s forward."
        },
        {
          "principle": "Relative Velocity Notation",
          "statement": "We use subscripts to denote velocities relative to different frames: $\\vec{v}_{AB}$ means velocity of A relative to B. Then $\\vec{v}_{AB} = -\\vec{v}_{BA}$, and $\\vec{v}_{AC} = \\vec{v}_{AB} + \\vec{v}_{BC}$.",
          "application": "This notation helps keep track of which velocity is relative to what, and ensures correct vector addition.",
          "example": "If a car (C) moves at 20 m/s relative to the ground (G), and a truck (T) moves at 15 m/s relative to the ground in the same direction, then the velocity of the car relative to the truck is $\\vec{v}_{CG} - \\vec{v}_{TG} = 5$ m/s."
        }
      ],
      "classifications": [
        {
          "type": "Types of Frames",
          "value": "Inertial vs. non‑inertial frames",
          "characteristics": [
            "Inertial frame: constant velocity (no acceleration)",
            "Non‑inertial frame: accelerating (e.g., rotating, braking)",
            "In introductory physics, we usually work with inertial frames"
          ],
          "behavior": "In inertial frames, Newton's laws are simplest. Non‑inertial frames require fictitious forces (like centrifugal force) to explain motion, which are not covered in basic kinematics.",
          "examples": [
            {
              "process": "Inertial frame",
              "explanation": "A train moving at constant speed is approximately inertial."
            },
            {
              "process": "Non‑inertial frame",
              "explanation": "A car turning a corner is accelerating, so a passenger experiences an apparent outward force."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Relative Velocity in One Dimension",
          "problem": "A train travels east at 25 m/s. A passenger walks toward the front of the train at 2 m/s relative to the train. What is the passenger's velocity relative to the ground?",
          "step_by_step": [
            {
              "step": "Define frames",
              "explanation": "Let ground be frame G, train be frame T. The passenger is P."
            },
            {
              "step": "Write known velocities",
              "explanation": "$\\vec{v}_{TG} = +25$ m/s (train relative to ground, east positive). $\\vec{v}_{PT} = +2$ m/s (passenger relative to train, also east)."
            },
            {
              "step": "Apply relative velocity relation",
              "explanation": "$\\vec{v}_{PG} = \\vec{v}_{PT} + \\vec{v}_{TG}$ (since $\\vec{v}_{PG} = \\vec{v}_{PT} + \\vec{v}_{TG}$ because $P$'s velocity relative to ground equals its velocity relative to train plus train's velocity relative to ground)."
            },
            {
              "step": "Compute",
              "explanation": "$\\vec{v}_{PG} = 2 + 25 = 27$ m/s east."
            }
          ],
          "final_answer": "$27$ m/s east.",
          "concept_applied": "Velocities add when the object moves in the same direction as the moving frame."
        },
        {
          "title": "Relative Velocity Opposite Directions",
          "problem": "On the same train, another passenger walks toward the back at 1.5 m/s relative to the train. What is that passenger's velocity relative to the ground?",
          "step_by_step": [
            {
              "step": "Define",
              "explanation": "$\\vec{v}_{TG} = +25$ m/s, $\\vec{v}_{PT} = -1.5$ m/s (since walking west, opposite to east positive)."
            },
            {
              "step": "Add",
              "explanation": "$\\vec{v}_{PG} = (-1.5) + 25 = 23.5$ m/s east."
            }
          ],
          "final_answer": "$23.5$ m/s east.",
          "concept_applied": "When the object moves opposite to the frame's motion, the magnitudes subtract."
        }
      ],
      "image": {
        "src": "images/unit3/frames_of_reference.png",
        "alt": "Diagram of a train with two passengers, one walking forward, one walking backward, with velocity vectors",
        "caption": "Velocities add vectorially when transforming between frames."
      }
    },
    {
      "section_title": "Relative Velocity in One Dimension",
      "introduction": "For motion along a straight line, relative velocity is simply the algebraic difference of velocities. This forms the foundation for more complex two‑dimensional relative motion.",
      "key_concept": {
        "definition": "If two objects A and B move with velocities $v_A$ and $v_B$ relative to a common frame (e.g., ground), then the velocity of A relative to B is $v_{AB} = v_A - v_B$ (with signs according to a chosen positive direction).",
        "context": "This simple subtraction works because motion is along a line; direction is captured by sign. It is essential for solving problems involving chasing, approaching, or separating objects."
      },
      "principles": [
        {
          "principle": "Relative Velocity as Difference",
          "statement": "$v_{AB} = v_A - v_B$ where both velocities are measured in the same frame (usually ground). The result's sign indicates direction: positive means A is moving in the positive direction relative to B.",
          "application": "Use this to find how fast two objects approach each other or to determine when one catches up to another.",
          "example": "Car A moves at 20 m/s east, car B at 15 m/s east. Then $v_{AB} = 20-15 = 5$ m/s east (A is gaining on B at 5 m/s)."
        },
        {
          "principle": "Approach Speed",
          "statement": "If two objects move toward each other, their relative speed is the sum of their speeds (since velocities have opposite signs).",
          "application": "For collision or meeting problems, the relative speed is $|v_A| + |v_B|$ if they are moving directly toward each other.",
          "example": "Car A at +20 m/s, car B at -15 m/s (west), then $v_{AB} = 20 - (-15) = 35$ m/s. They approach at 35 m/s."
        }
      ],
      "worked_examples": [
        {
          "title": "Catching Up",
          "problem": "A police car starts from rest and accelerates at 3 m/s² to chase a speeding car moving at constant 30 m/s. How long does it take the police to catch the speeder?",
          "step_by_step": [
            {
              "step": "Set up frames",
              "explanation": "Both measured relative to ground. Speeder: $v_s = 30$ m/s constant. Police: $v_p(t) = 3t$."
            },
            {
              "step": "Relative velocity approach",
              "explanation": "Alternatively, use relative position: let $x_s = 30t$, $x_p = \\frac{1}{2}(3)t^2 = 1.5t^2$. Set equal: $1.5t^2 = 30t$ → $1.5t^2 - 30t = 0$ → $t(1.5t - 30)=0$ → $t=0$ or $t=20$ s."
            },
            {
              "step": "Interpret",
              "explanation": "The police catch the speeder at $t=20$ s (ignoring t=0)."
            }
          ],
          "final_answer": "$20$ s.",
          "concept_applied": "Relative motion can simplify by considering the motion of one object relative to the other."
        }
      ]
    }
  ],
  "key_terms": [
    "Frame of Reference",
    "Inertial Frame",
    "Non‑inertial Frame",
    "Relative Velocity",
    "Relative Motion",
    "Observer",
    "Vector Addition",
    "Subscript Notation"
  ],
  "summary": "Relative motion describes how velocities depend on the observer's frame of reference. A frame of reference is a coordinate system from which motion is measured. In inertial frames (constant velocity), Newton's laws hold simply. The velocity of an object A relative to object B is $\\vec{v}_{AB} = \\vec{v}_A - \\vec{v}_B$ when both velocities are measured in the same frame (e.g., ground). This vector subtraction accounts for direction. In one dimension, it becomes simple algebraic subtraction with signs. For objects moving toward each other, relative speed is the sum of speeds. Relative motion is fundamental for analyzing problems involving moving observers, such as passengers on vehicles, boats in currents, and aircraft in wind. It forms the basis for more complex two‑dimensional relative velocity problems."
}
