{
  "expanded_description": "This section focuses on relative velocity in one dimension, where motion occurs along a straight line. The relative velocity between two objects is simply the difference of their velocities (taking direction into account). This concept is essential for analyzing situations where objects move toward or away from each other, such as chasing, approaching, or separating along a straight path.",
  "core_concept": {
    "principle": "In one dimension, the velocity of object A relative to object B is $v_{AB} = v_A - v_B$, where both velocities are measured in the same frame (usually the ground). The sign of the result indicates the direction of A as seen from B.",
    "explanation": "This simple subtraction captures all relative motion effects. If A and B move in the same direction, their relative speed is the difference of speeds; if they move toward each other, their relative speed is the sum of speeds. This allows us to solve problems involving catching up, collision times, and apparent velocities from moving observers.",
    "image": {
      "src": "images/unit3/relative_velocity_1d.png",
      "alt": "Number line showing two objects moving with velocities v_A and v_B, with relative velocity v_A - v_B indicated",
      "caption": "In one dimension, relative velocity is the algebraic difference of velocities."
    }
  },
  "sections": [
    {
      "section_title": "Relative Velocity in One Dimension",
      "introduction": "When all motion is along a straight line, relative velocity calculations become straightforward algebraic operations. The key is to establish a consistent sign convention and apply the subtraction formula correctly.",
      "key_concept": {
        "definition": "For two objects A and B moving along the same straight line with velocities $v_A$ and $v_B$ relative to a common frame (usually the ground), the velocity of A relative to B is $v_{AB} = v_A - v_B$. This represents how fast and in what direction A appears to move from B's perspective.",
        "context": "This concept is used in everyday situations: a car's speed relative to another car on the highway, a person's walking speed relative to a moving sidewalk, or the approach speed of two trains heading toward each other."
      },
      "principles": [
        {
          "principle": "Sign Convention is Essential",
          "statement": "Before applying $v_{AB} = v_A - v_B$, you must establish a positive direction. All velocities must be given signs consistent with this convention.",
          "application": "Choose a direction (e.g., east, right, or forward) as positive. Then any velocity in that direction is positive; opposite directions are negative.",
          "example": "If east is positive, a car going west at 20 m/s has velocity $v = -20$ m/s."
        },
        {
          "principle": "Interpretation of Relative Velocity",
          "statement": "If $v_{AB} > 0$, then A appears to move in the positive direction as seen from B. If $v_{AB} < 0$, A appears to move in the negative direction. If $v_{AB} = 0$, A and B have the same velocity and appear stationary relative to each other.",
          "application": "The magnitude $|v_{AB}|$ tells how fast they are separating or approaching.",
          "example": "If $v_A = 30$ m/s east, $v_B = 20$ m/s east, then $v_{AB} = 10$ m/s east → A is moving away from B eastward at 10 m/s."
        },
        {
          "principle": "Approach and Separation Speeds",
          "statement": "When two objects move toward each other, their relative speed is the sum of their speeds (since velocities have opposite signs). When they move in the same direction, relative speed is the difference of speeds.",
          "application": "For collision problems, the time to meet is initial separation divided by approach speed.",
          "example": "Two cars approaching each other at 20 m/s east and 15 m/s west have relative speed $20 - (-15) = 35$ m/s."
        }
      ],
      "classifications": [
        {
          "type": "Same Direction",
          "value": "Objects moving in the same direction",
          "characteristics": [
            "Velocities have same sign",
            "Relative speed = $|v_A - v_B|$",
            "Relative velocity direction = direction of faster object"
          ],
          "behavior": "The faster object appears to move away from the slower one (or the slower appears to fall behind). If velocities are equal, they appear stationary relative to each other.",
          "examples": [
            {
              "process": "Car A at 25 m/s east, Car B at 15 m/s east",
              "explanation": "$v_{AB} = 25 - 15 = 10$ m/s east. A moves away from B at 10 m/s east."
            },
            {
              "process": "Train A at 30 m/s west, Train B at 40 m/s west",
              "explanation": "Let west be positive: $v_A = 30$, $v_B = 40$, so $v_{AB} = 30-40 = -10$ m/s. A moves at 10 m/s east relative to B (i.e., B is pulling away from A)."
            }
          ]
        },
        {
          "type": "Opposite Direction",
          "value": "Objects moving toward each other",
          "characteristics": [
            "Velocities have opposite signs",
            "Relative speed = $|v_A| + |v_B|$",
            "Relative velocity direction = direction of A if using $v_{AB}$ formula"
          ],
          "behavior": "They approach each other with speed equal to the sum of their speeds. The time to meet is initial separation divided by this approach speed.",
          "examples": [
            {
              "process": "Car A at 20 m/s east, Car B at 15 m/s west (east positive)",
              "explanation": "$v_A = +20$, $v_B = -15$, so $v_{AB} = 20 - (-15) = 35$ m/s east. A sees B approaching at 35 m/s from the west."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Relative Velocity Same Direction",
          "problem": "A truck travels at 22 m/s north. A car behind it travels at 30 m/s north. What is the velocity of the car relative to the truck?",
          "step_by_step": [
            {
              "step": "Establish sign convention",
              "explanation": "Let north be positive."
            },
            {
              "step": "Assign velocities",
              "explanation": "$v_{car} = +30$ m/s, $v_{truck} = +22$ m/s."
            },
            {
              "step": "Apply relative velocity formula",
              "explanation": "$v_{car/truck} = v_{car} - v_{truck} = 30 - 22 = +8$ m/s."
            },
            {
              "step": "Interpret",
              "explanation": "The car appears to move north relative to the truck at 8 m/s (gaining on it)."
            }
          ],
          "final_answer": "$8$ m/s north.",
          "concept_applied": "Same direction: relative speed is the difference, direction of faster."
        },
        {
          "title": "Relative Velocity Opposite Direction",
          "problem": "Two trains approach each other on parallel tracks. Train A moves east at 25 m/s, Train B moves west at 20 m/s. What is the velocity of Train A relative to Train B? (Take east as positive.)",
          "step_by_step": [
            {
              "step": "Assign velocities with signs",
              "explanation": "$v_A = +25$ m/s, $v_B = -20$ m/s (since west is opposite positive east)."
            },
            {
              "step": "Apply formula",
              "explanation": "$v_{A/B} = v_A - v_B = 25 - (-20) = 45$ m/s."
            },
            {
              "step": "Interpret sign",
              "explanation": "Positive means A appears to move east relative to B. Since they are approaching, A sees B coming from the east at 45 m/s."
            }
          ],
          "final_answer": "$45$ m/s east.",
          "concept_applied": "Opposite directions: relative speed is sum of speeds, direction of first object."
        },
        {
          "title": "Finding Time to Meet Using Relative Velocity",
          "problem": "Two cars are 500 m apart on a straight road. Car A travels east at 15 m/s, Car B travels west at 12 m/s. How long will it take them to meet?",
          "step_by_step": [
            {
              "step": "Find relative velocity",
              "explanation": "Take east positive. $v_A = +15$, $v_B = -12$. $v_{A/B} = 15 - (-12) = 27$ m/s east. This is the speed at which A approaches B (or B approaches A)."
            },
            {
              "step": "Use relative motion",
              "explanation": "In A's frame, B is approaching at 27 m/s from the east. The initial separation is 500 m. Time to meet = separation / relative speed."
            },
            {
              "step": "Calculate",
              "explanation": "$t = 500 / 27 = 18.5$ s."
            }
          ],
          "final_answer": "$18.5$ s.",
          "concept_applied": "Time to meet = initial separation / relative speed when moving toward each other."
        },
        {
          "title": "Catching Up Problem",
          "problem": "A police car starts from rest and accelerates at 2 m/s² to catch a speeder moving at constant 25 m/s. How long does it take to catch the speeder?",
          "step_by_step": [
            {
              "step": "Method 1: Using relative velocity (but acceleration complicates)",
              "explanation": "Relative velocity is not constant because police accelerates. Better to use position equations."
            },
            {
              "step": "Set up position equations",
              "explanation": "Let t=0 when police starts. Speeder position: $x_s = 25t$ (assume police starts at x=0, speeder ahead by 0? Actually problem implies police starts from same point? Usually police starts behind, but here not stated. Assume they start together? That would mean instant catch. Problem likely means police starts from rest at the instant speeder passes. Then speeder is ahead by 0 at t=0? That gives immediate catch. Need initial separation. Let's assume police starts from rest at the instant speeder passes a point, and we want time to catch from that point. Then both start at x=0 at t=0? Then speeder is at x=0 at t=0? That would mean they are together at t=0, so they are already together. That's not a chase. So there must be an initial separation. Let's assume the speeder is 100 m ahead when police starts. But problem didn't give that. Let's restructure: A common problem: police starts from rest when speeder passes him. Then at t=0, they are at same position. Then police catches speeder when $\\frac{1}{2}at^2 = 25t$ → $t(0.5at - 25)=0$ → $t=0$ or $t=50/a$. For a=2, t=25 s. So that works if they start together. Let's use that."
            },
            {
              "step": "Set up equations (assuming same start point at t=0)",
              "explanation": "$x_p = \\frac{1}{2}(2)t^2 = t^2$, $x_s = 25t$."
            },
            {
              "step": "Set equal for catch",
              "explanation": "$t^2 = 25t$ → $t^2 - 25t = 0$ → $t(t-25)=0$ → $t=0$ or $t=25$ s."
            }
          ],
          "final_answer": "$25$ s.",
          "concept_applied": "When acceleration is involved, relative velocity changes with time; use position equations rather than constant relative velocity."
        }
      ],
      "image": {
        "src": "images/unit3/relative_1d_examples.png",
        "alt": "Diagrams showing same direction and opposite direction relative motion cases",
        "caption": "Relative velocity depends on whether objects move in the same or opposite directions."
      }
    },
    {
      "section_title": "Relative Velocity and Moving Observers",
      "introduction": "Sometimes we need to find the velocity of an object as seen from another moving object, or find the velocity of an object given observations from a moving frame.",
      "key_concept": {
        "definition": "If we know the velocity of object A relative to ground ($v_{AG}$) and the velocity of observer B relative to ground ($v_{BG}$), then the velocity of A relative to B is $v_{AB} = v_{AG} - v_{BG}$.",
        "context": "This is the same formula, just with different labels. It works for any two objects, including observers."
      },
      "worked_examples": [
        {
          "title": "Moving Observer",
          "problem": "A cyclist rides east at 8 m/s. A car passes her going east at 20 m/s. What is the velocity of the car relative to the cyclist?",
          "step_by_step": [
            {
              "step": "Define",
              "explanation": "Let east be positive. $v_{car/gnd} = +20$, $v_{cycle/gnd} = +8$."
            },
            {
              "step": "Apply formula",
              "explanation": "$v_{car/cycle} = v_{car/gnd} - v_{cycle/gnd} = 20 - 8 = +12$ m/s."
            },
            {
              "step": "Interpret",
              "explanation": "The car moves east at 12 m/s relative to the cyclist (pulling away)."
            }
          ],
          "final_answer": "$12$ m/s east.",
          "concept_applied": "The observer's velocity is subtracted from the object's velocity."
        },
        {
          "title": "Finding Ground Velocity from Relative Data",
          "problem": "A person walks toward the front of a train at 1.5 m/s relative to the train. The train moves at 22 m/s relative to the ground. A second passenger sees the first passenger moving at 0.5 m/s toward the front. What is the velocity of the second passenger relative to the ground?",
          "step_by_step": [
            {
              "step": "Define variables",
              "explanation": "Let forward be positive. $v_{P1/T} = +1.5$, $v_{T/G} = +22$. $v_{P1/P2} = +0.5$ (first passenger relative to second). Want $v_{P2/G}$."
            },
            {
              "step": "Find $v_{P1/G}$ first",
              "explanation": "$v_{P1/G} = v_{P1/T} + v_{T/G} = 1.5 + 22 = 23.5$ m/s forward."
            },
            {
              "step": "Use relative velocity formula between the two passengers",
              "explanation": "$v_{P1/P2} = v_{P1/G} - v_{P2/G}$ → $0.5 = 23.5 - v_{P2/G}$ → $v_{P2/G} = 23.5 - 0.5 = 23$ m/s forward."
            }
          ],
          "final_answer": "$23$ m/s forward.",
          "concept_applied": "Relative velocity between two moving objects can be used to find an unknown ground velocity."
        }
      ]
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Avoid these frequent errors when working with relative velocity in one dimension.",
      "classifications": [
        {
          "type": "Sign Convention Errors",
          "value": "Not establishing or inconsistently applying a sign convention",
          "characteristics": [
            "Using positive values for all velocities regardless of direction",
            "Changing sign convention mid-problem",
            "Forgetting that velocities are vectors"
          ],
          "behavior": "This leads to wrong relative velocities and incorrect approach speeds. Always declare a positive direction at the start and stick to it.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Two cars approach each other at 20 m/s and 15 m/s. Student says relative speed = 20-15 = 5 m/s (forgetting they are opposite directions)."
            },
            {
              "process": "Correct",
              "explanation": "With east positive: $v_A = +20$, $v_B = -15$, so $v_{A/B} = 20 - (-15) = 35$ m/s."
            }
          ]
        },
        {
          "type": "Confusing Subscripts",
          "value": "Misapplying the relative velocity formula $v_{AB} = v_A - v_B$",
          "characteristics": [
            "Using $v_A + v_B$ when subtraction is needed",
            "Getting the order reversed ($v_B - v_A$)"
          ],
          "behavior": "The formula is $v_{AB} = v_A - v_B$, where $v_A$ and $v_B$ are velocities relative to the same frame. $v_{AB}$ is the velocity of A as seen from B.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "For A at 10 m/s east, B at 6 m/s east, student computes $v_{AB} = 10 + 6 = 16$ m/s."
            },
            {
              "process": "Correct",
              "explanation": "$v_{AB} = 10 - 6 = 4$ m/s east."
            }
          ]
        },
        {
          "type": "Using Relative Velocity When Acceleration is Present",
          "value": "Applying constant-relative-velocity formulas to situations with acceleration",
          "characteristics": [
            "Treating $v_{AB}$ as constant when A or B accelerates",
            "Using $t = \\text{separation}/v_{rel}$ for accelerating objects"
          ],
          "behavior": "Relative velocity is constant only if both objects have constant velocity. If either accelerates, relative velocity changes with time, and you must use position equations or calculus.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Police car accelerates at 2 m/s² chasing a constant-speed speeder. Student computes relative speed as $2t - 30$ and sets $\\int v_{rel} dt = 0$ incorrectly, or uses constant relative speed."
            },
            {
              "process": "Correct",
              "explanation": "Set position equations equal: $\\frac{1}{2}at^2 = v_{speeder}t + \\text{initial separation}$ and solve quadratic."
            }
          ]
        },
        {
          "type": "Forgetting That Relative Velocity is a Vector",
          "value": "Treating relative velocity as a scalar and losing directional information",
          "characteristics": [
            "Reporting only magnitude",
            "Not specifying direction in final answer"
          ],
          "behavior": "Relative velocity has direction; a complete answer includes both magnitude and direction (or sign indicating direction).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Answer: \"The relative velocity is 5 m/s.\""
            },
            {
              "process": "Correct",
              "explanation": "Answer: \"5 m/s east\" or \"+5 m/s.\""
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit3/relative_1d_mistakes.png",
        "alt": "Common mistakes: sign errors, subscript confusion, forgetting direction",
        "caption": "Avoid these common errors when working with relative velocity in one dimension."
      }
    }
  ],
  "key_terms": [
    "Relative Velocity",
    "One-Dimensional Motion",
    "Sign Convention",
    "Approach Speed",
    "Separation Speed",
    "Frame of Reference",
    "Observer",
    "$v_{AB} = v_A - v_B$"
  ],
  "summary": "In one dimension, relative velocity is the algebraic difference of velocities measured in the same frame: $v_{AB} = v_A - v_B$. A consistent sign convention must be established first. When objects move in the same direction, relative speed is the difference of speeds; when they move toward each other, relative speed is the sum. This allows quick calculation of approach times: $t = \\text{separation} / v_{rel}$ if velocities are constant. For problems involving acceleration, position equations must be used instead of constant-relative-velocity formulas. Common mistakes include sign errors, confusing the order of subtraction, applying constant-velocity formulas to accelerating situations, and reporting only magnitude without direction. Mastering one-dimensional relative velocity is essential for understanding more complex two-dimensional relative motion, such as boats crossing rivers or airplanes in crosswinds."
}
