{
  "expanded_description": "Who provides financial and technical assistance to developing countries? What institutions help manage global economic crises and promote development? International financial institutions play a crucial role in the global economy, providing loans, grants, policy advice, and technical assistance to countries around the world. The most prominent are the International Monetary Fund (IMF), the World Bank Group, and regional development banks. These institutions were created after World War II to promote international monetary cooperation, finance reconstruction and development, and prevent economic crises. They have evolved over time to address new challenges, from poverty reduction to climate change. Understanding their roles, functions, and controversies is essential for analyzing global economic governance and development policy.",
  
  "core_concept": {
    "principle": "Global institutions play a key role in international economic cooperation and development. The main institutions are: (1) International Monetary Fund (IMF): Created in 1944 at Bretton Woods, the IMF's original purpose was to maintain international monetary stability by providing temporary balance of payments support to countries with currency crises. Today, it monitors global economic conditions, provides policy advice, and lends to countries facing balance of payments problems, often with conditions (structural adjustment programs). The IMF has 190 member countries and is funded by quotas (subscriptions) from members. Its lending helps countries stabilize their economies, but its conditions have been controversial. (2) World Bank Group: Also created at Bretton Woods, the World Bank initially focused on financing reconstruction after WWII. Today, it provides loans, grants, and technical assistance to developing countries for projects and programs that reduce poverty and promote development. The World Bank Group includes: International Bank for Reconstruction and Development (IBRD) lending to middle-income countries at market rates; International Development Association (IDA) providing interest-free loans and grants to the poorest countries; International Finance Corporation (IFC) promoting private sector investment; Multilateral Investment Guarantee Agency (MIGA) providing political risk insurance; and International Centre for Settlement of Investment Disputes (ICSID) arbitrating investment disputes. (3) Regional development banks: The African Development Bank (AfDB), Asian Development Bank (ADB), Inter-American Development Bank (IDB), and others provide financing and technical assistance tailored to their regions. (4) World Trade Organization (WTO): Sets rules for international trade and resolves disputes (covered in Unit 10). (5) United Nations agencies: UNDP, UNICEF, WHO, FAO, and others provide technical assistance, humanitarian aid, and development programs. (6) OECD: Provides policy advice and coordinates development assistance among rich countries. (7) Paris Club: Coordinates debt restructuring among official creditors. These institutions have been criticized for various reasons: IMF conditions are seen as too harsh or ideologically driven; World Bank projects have sometimes failed or caused environmental harm; governance structures give disproportionate power to rich countries; and some argue they perpetuate dependency rather than promote self-sustaining development. Despite criticisms, they remain central to global economic governance and development finance.",
    
    "explanation": "Think of global institutions like a set of specialized doctors for the world economy. The IMF is like an emergency room doctor—it helps countries in financial crisis, providing short-term loans and treatment plans. The World Bank is like a long-term care doctor—it helps countries build health over time through investments in infrastructure, education, and health. Regional development banks are like local clinics—they understand regional conditions and provide tailored care. They all work together, but they're not perfect—sometimes their prescriptions have side effects, and they've been criticized for not listening enough to patients.",
    
    "image": {
      "src": "images/unit13/global_institutions.png",
      "alt": "Diagram showing IMF, World Bank, regional development banks, and UN agencies",
      "caption": "Figure 13.3.1: Global institutions play key roles in international finance, development, and economic cooperation."
    }
  },

  "sections": [
    {
      "section_title": "13.3 Global Institutions",
      "introduction": "The global economy is governed by a complex web of institutions that provide financial support, policy advice, technical assistance, and dispute resolution. The most prominent are the International Monetary Fund (IMF) and the World Bank, created at the Bretton Woods Conference in 1944. Regional development banks and UN agencies also play important roles. In this section, we'll explore the history, functions, and controversies surrounding these institutions, and their role in promoting global economic stability and development.",
      
      "introduction_image": {
        "src": "images/unit13/institutions_intro.png",
        "alt": "Headquarters of IMF, World Bank, and UN in Washington and New York",
        "caption": "Figure 13.3.2: The IMF and World Bank are headquartered in Washington, D.C. The UN is in New York."
      },
      
      "key_concept": {
        "definition": "Global institutions are international organizations that facilitate cooperation, provide financial support, and set rules for the global economy. The key institutions are: (1) International Monetary Fund (IMF): Created in 1944 to maintain international monetary stability. Its main functions are: surveillance (monitoring global and national economic developments), lending (providing temporary financial support to countries with balance of payments problems), and capacity development (technical assistance and training). IMF loans come with conditions (structural adjustment programs) requiring policy reforms such as fiscal austerity, privatization, and market liberalization. The IMF is funded by quotas from member countries, which determine voting power. (2) World Bank Group: Also created in 1944, focused on long-term development. Its components include: IBRD (lending to middle-income countries), IDA (concessional lending to poorest countries), IFC (private sector investment), MIGA (political risk insurance), and ICSID (dispute settlement). The World Bank finances projects in infrastructure, education, health, agriculture, and other sectors, and provides policy advice and technical assistance. (3) Regional development banks: African Development Bank (AfDB), Asian Development Bank (ADB), Inter-American Development Bank (IDB), European Bank for Reconstruction and Development (EBRD). They provide financing and technical assistance tailored to regional priorities. (4) World Trade Organization (WTO): Sets rules for international trade and resolves disputes (covered in Unit 10). (5) United Nations Development Programme (UNDP): Coordinates UN development efforts and provides technical assistance. Other UN agencies (UNICEF, WHO, FAO, ILO) address specific issues. (6) Organisation for Economic Co-operation and Development (OECD): Provides policy advice and coordinates development assistance among rich countries. (7) Paris Club: Informal group of official creditors that coordinates debt restructuring. These institutions have been criticized for: imposing harsh conditions, promoting neoliberal policies, being dominated by rich countries, and sometimes funding harmful projects. Despite criticisms, they play a central role in global economic governance and development finance.",
        
        "context": "The Bretton Woods institutions were created at the end of World War II to prevent a repeat of the Great Depression's economic chaos. They have evolved over time: the IMF shifted from fixed exchange rate monitoring to crisis management; the World Bank shifted from reconstruction to poverty reduction. The rise of new powers (China, India) and new challenges (climate change, pandemics) are forcing further evolution. In AP Macroeconomics, understanding these institutions is essential for analyzing global economic governance and development policy.",
        
        "image": {
          "src": "images/unit13/imf_worldbank.png",
          "alt": "Logos of IMF and World Bank with their main functions",
          "caption": "Figure 13.3.3: The IMF focuses on short-term stabilization and crisis lending; the World Bank focuses on long-term development projects."
        }
      },

      "classifications": [
        {
          "type": "International Monetary Fund (IMF)",
          "value": "Global lender of last resort and economic monitor",
          "characteristics": ["190 member countries", "Quota-based funding", "Surveillance role", "Crisis lending", "Policy conditionality"],
          "behavior": "The IMF's primary mission is to ensure the stability of the international monetary system. It does this through three main activities: (1) Surveillance: The IMF monitors global and national economic developments, providing policy advice to member countries. This includes regular Article IV consultations with each member. (2) Lending: The IMF provides loans to countries facing balance of payments problems—when a country cannot meet its international payment obligations. Loans are typically provided under programs like Stand-By Arrangements (SBA), Extended Fund Facility (EFF), and Poverty Reduction and Growth Trust (PRGT). Lending is conditional on policy reforms (conditionality) designed to address the underlying problems. Conditions often include fiscal austerity, monetary tightening, structural reforms (privatization, deregulation), and improved governance. (3) Capacity development: The IMF provides technical assistance and training to help countries strengthen their economic institutions. The IMF is funded by quotas, which are based on a country's economic size. Quotas determine voting power, giving larger economies more influence. The IMF has been criticized for imposing harsh conditions that exacerbate recessions, for being dominated by rich countries, and for promoting one-size-fits-all policies. However, it has also been essential in managing financial crises, from Mexico (1994) to Asia (1997) to Greece (2010) to the COVID-19 pandemic.",
          
          "image": {
            "src": "images/unit13/imf_functions.png",
            "alt": "Diagram showing IMF functions: surveillance, lending, capacity development",
            "caption": "Figure 13.3.4: The IMF performs surveillance, lending, and capacity development to promote global financial stability."
          },
          
          "examples": [
            {
              "process": "Asian Financial Crisis 1997",
              "explanation": "The IMF provided emergency loans to Thailand, Indonesia, and South Korea, conditional on fiscal austerity, banking reform, and structural adjustments. The programs were controversial, with critics arguing they worsened recessions."
            },
            {
              "process": "Greek debt crisis 2010",
              "explanation": "The IMF, along with the EU and ECB (the Troika), provided loans to Greece conditional on severe austerity measures. The programs helped avoid default but caused deep recession and social hardship."
            }
          ]
        },
        {
          "type": "World Bank Group",
          "value": "Development finance and technical assistance",
          "characteristics": ["189 member countries", "IBRD and IDA lending", "Project focus", "Policy advice", "Private sector arm (IFC)"],
          "behavior": "The World Bank Group's mission is to reduce poverty and promote shared prosperity. It provides financing, policy advice, and technical assistance to developing countries. The main components are: (1) International Bank for Reconstruction and Development (IBRD): Lends to middle-income and creditworthy low-income countries at market-based rates. Funds come from issuing bonds in global capital markets. (2) International Development Association (IDA): Provides interest-free loans (credits) and grants to the poorest countries. IDA is replenished every three years by donor countries. (3) International Finance Corporation (IFC): Promotes private sector development by investing in businesses and financial institutions in developing countries. (4) Multilateral Investment Guarantee Agency (MIGA): Provides political risk insurance to encourage foreign direct investment. (5) International Centre for Settlement of Investment Disputes (ICSID): Arbitrates investment disputes. The World Bank finances projects in infrastructure (roads, power, water), education, health, agriculture, and other sectors. It also provides policy advice and supports institutional reform. Projects are designed to have high economic returns and poverty reduction impact. The World Bank has been criticized for funding environmentally damaging projects, for imposing conditions similar to the IMF, and for being influenced by donor countries. It has also been a leader in areas like debt relief (HIPC Initiative) and global public goods (climate, pandemics).",
          
          "image": {
            "src": "images/unit13/worldbank_functions.png",
            "alt": "Diagram showing World Bank Group components: IBRD, IDA, IFC, MIGA, ICSID",
            "caption": "Figure 13.3.5: The World Bank Group provides loans, grants, and investment to promote development."
          },
          
          "examples": [
            {
              "process": "IDA replenishment",
              "explanation": "Every three years, donor countries pledge funds to IDA, which provides grants and interest-free loans to the poorest countries. IDA-20 (2022-2025) raised $\\$93$ billion."
            },
            {
              "process": "Infrastructure projects",
              "explanation": "The World Bank has financed thousands of infrastructure projects, from dams in Brazil to roads in India to power plants in Africa. Some have been successful; others have been criticized for environmental and social impacts."
            }
          ]
        },
        {
          "type": "Regional Development Banks",
          "value": "Region-focused development finance",
          "characteristics": ["Regional membership", "Local knowledge", "Complement global institutions", "Focus on regional priorities", "Often have concessional windows"],
          "behavior": "Regional development banks provide financing and technical assistance tailored to their regions. The main ones are: (1) African Development Bank (AfDB): Based in Abidjan, Côte d'Ivoire, it promotes economic and social development in Africa. It has both African and non-African members. (2) Asian Development Bank (ADB): Based in Manila, Philippines, it focuses on Asia-Pacific, with a strong emphasis on infrastructure and poverty reduction. (3) Inter-American Development Bank (IDB): Based in Washington, D.C., it serves Latin America and the Caribbean. (4) European Bank for Reconstruction and Development (EBRD): Based in London, it focuses on transition economies in Europe, Central Asia, and the southern and eastern Mediterranean. (5) Others: Islamic Development Bank, Caribbean Development Bank, etc. Regional banks often have deeper knowledge of local conditions and can tailor projects accordingly. They also provide policy advice and technical assistance. They complement the global institutions by focusing on regional priorities and often have more flexible approaches. They are funded by member subscriptions and borrow in capital markets. Like the World Bank, they have faced criticisms over project impacts and governance.",
          
          "image": {
            "src": "images/unit13/regional_banks.png",
            "alt": "Map showing regions served by AfDB, ADB, IDB, EBRD",
            "caption": "Figure 13.3.6: Regional development banks focus on specific regions, complementing the global institutions."
          },
          
          "examples": [
            {
              "process": "ADB's infrastructure focus",
              "explanation": "The ADB has financed major infrastructure projects across Asia, including roads, railways, and power plants, supporting the region's rapid growth."
            },
            {
              "process": "AfDB's role in Africa",
              "explanation": "The AfDB supports African development through infrastructure, agriculture, and private sector development, with a focus on regional integration."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The IMF Provides Emergency Financing but with Conditions",
          "statement": "The IMF's primary role is to provide temporary financial support to countries facing balance of payments crises. This can prevent defaults, stabilize currencies, and restore confidence. However, IMF loans come with conditions (structural adjustment programs) requiring policy reforms. These conditions are intended to address the underlying causes of the crisis and ensure the country can repay. Typical conditions include fiscal austerity (reducing budget deficits), monetary tightening (raising interest rates), structural reforms (privatization, deregulation), and improved governance. The rationale is that without such reforms, the crisis will recur. However, conditions have been criticized for being too harsh, pro-cyclical (worsening recessions), and ideologically driven (promoting neoliberalism). The debate over conditionality reflects broader disagreements about the role of the state and the causes of economic crises. The IMF has reformed its conditionality over time, with more focus on social protection and growth, but controversies persist.",
          "application": "When evaluating an IMF program, consider both the immediate financing need and the conditions attached. Are the conditions likely to solve the underlying problems or exacerbate them? Do they include adequate social protection? The answers affect the program's success and its impact on ordinary people.",
          "example": "During the Asian Financial Crisis, IMF conditions requiring fiscal austerity in Thailand and Indonesia deepened recessions, leading to criticism. In contrast, Malaysia rejected IMF help and imposed capital controls, recovering quickly, though its circumstances were different.",
          
          "image": {
            "src": "images/unit13/imf_conditionality.png",
            "alt": "Diagram showing IMF loan with conditions attached",
            "caption": "Figure 13.3.7: IMF loans come with conditions—policy reforms intended to address crisis causes but often controversial."
          }
        },
        {
          "principle": "The World Bank Finances Long-Term Development Projects",
          "statement": "Unlike the IMF's focus on short-term stabilization, the World Bank focuses on long-term development through project and program financing. It provides loans and grants for specific investments—roads, schools, health clinics, power plants—that are expected to generate economic returns and reduce poverty. It also provides budget support and policy advice. The World Bank's approach is based on the idea that capital, technical assistance, and knowledge can help countries overcome development barriers. Projects are designed with cost-benefit analysis and monitored for results. The World Bank also plays a key role in coordinating aid and setting development agendas, such as the Sustainable Development Goals. However, its projects have been criticized for environmental damage, displacement of communities, and sometimes poor results. The World Bank has evolved to incorporate environmental and social safeguards and to emphasize results and learning.",
          "application": "When assessing World Bank projects, look at their expected returns, their environmental and social impacts, and their sustainability. A good project should have high economic returns, minimal negative impacts, and contribute to long-term development.",
          "example": "The World Bank's support for India's National Rural Health Mission helped improve health outcomes. Its funding for large dams has been more controversial, with displacement and environmental concerns.",
          
          "image": {
            "src": "images/unit13/worldbank_projects.png",
            "alt": "Images of World Bank-financed projects: roads, schools, health clinics",
            "caption": "Figure 13.3.8: The World Bank finances long-term development projects in infrastructure, education, health, and other sectors."
          }
        },
        {
          "principle": "Institutions Face Criticisms of Governance and Effectiveness",
          "statement": "Global institutions have been subject to extensive criticism. Governance concerns: Voting power in the IMF and World Bank is based on economic size, giving rich countries (especially the U.S. and Europe) disproportionate influence. Developing countries have limited voice, even when they are the primary borrowers. This has led to calls for reform of quotas and voting shares. Effectiveness concerns: IMF programs have sometimes failed to restore growth and have been associated with increased poverty. World Bank projects have had mixed results, with some failing to achieve their objectives. Ideological concerns: Institutions are accused of promoting neoliberal policies (privatization, deregulation, austerity) that benefit rich countries and corporations at the expense of the poor. Environmental and social concerns: Projects have caused environmental damage and displaced communities. Accountability concerns: Affected communities have limited recourse when things go wrong. These criticisms have led to reforms, including the creation of independent evaluation offices, inspection panels, and greater attention to social and environmental safeguards. The debate continues over how to make global institutions more effective, accountable, and legitimate.",
          "application": "When studying global institutions, consider both their intended functions and their actual impacts. Be aware of criticisms and reforms. Understanding these debates is essential for evaluating proposals for institutional reform.",
          "example": "The World Bank's Inspection Panel was created in 1993 in response to criticism over the Narmada Dam project in India, allowing affected communities to seek accountability for harm caused by Bank-funded projects.",
          
          "image": {
            "src": "images/unit13/institution_criticisms.png",
            "alt": "Balance scale showing criticisms (governance, effectiveness, ideology) and reforms",
            "caption": "Figure 13.3.9: Global institutions face criticisms over governance, effectiveness, and ideology, leading to reforms."
          }
        },
        {
          "principle": "Institutions Evolve to Address New Challenges",
          "statement": "Global institutions are not static; they have evolved significantly since their creation. The IMF shifted from overseeing fixed exchange rates to crisis management after the Bretton Woods system collapsed in 1971. The World Bank shifted from reconstruction to poverty reduction. Both have taken on new issues: debt relief (HIPC Initiative), financial sector reform, governance and anti-corruption, and most recently, climate change and pandemics. The IMF created new lending facilities (Flexible Credit Line, Rapid Financing Instrument) to respond to crises more flexibly. The World Bank established trust funds and partnerships to address global challenges. Regional development banks have grown in importance. New institutions have emerged, such as the Asian Infrastructure Investment Bank (AIIB) and the New Development Bank (BRICS bank), reflecting the rise of new powers. The future will likely bring further evolution as the global economy changes. Understanding this evolution is essential for analyzing the role of institutions in a changing world.",
          "application": "When analyzing global institutions, consider how they are adapting to new challenges. Are they reforming governance to reflect new economic realities? Are they developing new tools to address climate, pandemics, and other global issues? Their relevance depends on their ability to evolve.",
          "example": "During the COVID-19 pandemic, the IMF provided emergency financing to over 80 countries through its Rapid Financing Instrument and Rapid Credit Facility, and the World Bank launched a $\\$14$ billion fast-track facility for health responses.",
          
          "image": {
            "src": "images/unit13/institution_evolution.png",
            "alt": "Timeline showing evolution of IMF and World Bank from 1944 to present",
            "caption": "Figure 13.3.10: Global institutions have evolved to address new challenges, from reconstruction to poverty reduction to climate change."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Comparing IMF and World Bank Roles",
          
          "image": {
            "src": "images/unit13/imf_wb_compare.png",
            "alt": "Table comparing IMF and World Bank",
            "caption": "Figure 13.3.11: Compare the IMF and World Bank on various dimensions."
          },
          
          "problem": "Compare the IMF and World Bank on the following dimensions: a) Primary mission. b) Type of financing. c) Typical duration of engagement. d) Conditionality. e) Governance and voting. f) Criticisms. Provide a brief explanation for each.",
          
          "step_by_step": [
            {
              "step": "Primary mission",
              "explanation": "IMF: Maintain international monetary stability, provide balance of payments support. World Bank: Reduce poverty, promote long-term development."
            },
            {
              "step": "Type of financing",
              "explanation": "IMF: Short-term loans to countries with balance of payments problems. World Bank: Long-term loans and grants for specific projects and programs."
            },
            {
              "step": "Typical duration",
              "explanation": "IMF: 1-3 years (stand-by arrangements) to 3-4 years (extended arrangements). World Bank: Project cycles of 5-10 years or more."
            },
            {
              "step": "Conditionality",
              "explanation": "IMF: Macroeconomic conditions (fiscal austerity, monetary tightening, exchange rate policy). World Bank: Policy and institutional reforms related to projects and sectors."
            },
            {
              "step": "Governance",
              "explanation": "Both based on quotas/subscriptions, with voting power proportional to economic size. Rich countries dominate."
            },
            {
              "step": "Criticisms",
              "explanation": "IMF: Harsh conditions, pro-cyclical policies, one-size-fits-all approach. World Bank: Environmental and social harm from projects, mixed effectiveness, influence of donors."
            }
          ],
          
          "final_answer": "a) IMF: stability; WB: poverty reduction. b) IMF: short-term loans; WB: long-term projects. c) IMF: short; WB: long. d) IMF: macroeconomic; WB: sectoral. e) Both quota-based, rich dominant. f) IMF: harsh conditions; WB: project impacts.",
          "concept_applied": "The IMF and World Bank have distinct but complementary roles in the global economy."
        },
        {
          "title": "Analyzing IMF Conditionality",
          
          "image": {
            "src": "images/unit13/imf_conditionality_example.png",
            "alt": "Graph showing economic indicators before and after IMF program",
            "caption": "Figure 13.3.12: Analyze the effects of IMF conditionality."
          },
          
          "problem": "A country facing a balance of payments crisis receives an IMF loan with conditions requiring fiscal austerity (reducing government spending), monetary tightening (raising interest rates), and structural reforms (privatizing state enterprises). a) What is the rationale for each condition? b) What are the potential short-run costs? c) What are the potential long-run benefits? d) How might these conditions affect different groups in society? e) What alternatives might exist?",
          
          "step_by_step": [
            {
              "step": "Rationale for fiscal austerity",
              "explanation": "Reducing government spending reduces the budget deficit and demand for imports, helping to stabilize the balance of payments and restore confidence. It also frees resources for private investment."
            },
            {
              "step": "Rationale for monetary tightening",
              "explanation": "Higher interest rates attract capital inflows, support the currency, and reduce inflation. They also discourage excessive borrowing."
            },
            {
              "step": "Rationale for privatization",
              "explanation": "Privatization can improve efficiency, reduce fiscal burden, and attract foreign investment. It also reduces the scope for corruption."
            },
            {
              "step": "Short-run costs",
              "explanation": "Austerity can deepen recession, increase unemployment, and reduce public services. Higher rates can choke off investment. Privatization can lead to job losses and higher prices."
            },
            {
              "step": "Long-run benefits",
              "explanation": "If successful, reforms can restore confidence, attract investment, and lay foundation for sustainable growth. Fiscal discipline can prevent future crises."
            },
            {
              "step": "Distributional effects",
              "explanation": "Austerity often falls hardest on the poor and vulnerable who rely on public services. Higher rates hurt borrowers. Privatization may benefit investors but hurt workers. Conditions often have regressive effects."
            },
            {
              "step": "Alternatives",
              "explanation": "Capital controls, debt restructuring, and more gradual adjustment might be alternatives. Some countries have rejected IMF help and pursued heterodox policies (e.g., Malaysia 1998)."
            }
          ],
          
          "final_answer": "a) Stabilize economy, restore confidence. b) Recession, unemployment, service cuts. c) Stability, investment, growth. d) Regressive effects. e) Capital controls, debt restructuring, gradual adjustment.",
          "concept_applied": "IMF conditionality involves trade-offs between short-run pain and long-run stability, with distributional consequences."
        },
        {
          "title": "Evaluating a World Bank Project",
          
          "image": {
            "src": "images/unit13/wb_project_eval.png",
            "alt": "Cost-benefit analysis table",
            "caption": "Figure 13.3.13: Evaluate a proposed World Bank infrastructure project."
          },
          
          "problem": "The World Bank is considering a $\\$500$ million loan to build a large dam in a developing country. The dam will provide electricity and irrigation, benefiting farmers and urban consumers. However, it will displace 20,000 people and flood valuable forest land. a) What are the potential benefits of the project? b) What are the potential costs? c) How would you do a cost-benefit analysis? d) What safeguards should the World Bank require? e) How might the project be redesigned to reduce negative impacts?",
          
          "step_by_step": [
            {
              "step": "Potential benefits",
              "explanation": "Electricity generation (reliable power, reduced emissions if replacing fossil fuels), irrigation (increased agricultural output, food security), flood control, and economic development."
            },
            {
              "step": "Potential costs",
              "explanation": "Displacement of communities (loss of homes, livelihoods, cultural sites), environmental damage (forest loss, biodiversity, river ecosystem changes), construction costs, and risk of cost overruns."
            },
            {
              "step": "Cost-benefit analysis",
              "explanation": "Estimate monetary value of benefits (electricity, irrigation) and costs (construction, resettlement, environmental damage) over project life, discount to present value. Compare NPV. Include distributional effects."
            },
            {
              "step": "Safeguards",
              "explanation": "Environmental and social impact assessment, free prior and informed consent from affected communities, resettlement plans with compensation and livelihood restoration, environmental mitigation measures."
            },
            {
              "step": "Redesign options",
              "explanation": "Consider smaller dams, alternative sites with less displacement, run-of-river designs, or alternative energy sources (solar, wind). Ensure affected communities share benefits."
            }
          ],
          
          "final_answer": "a) Power, irrigation, development. b) Displacement, environmental damage. c) Estimate and compare benefits and costs. d) Impact assessment, consent, resettlement plans. e) Alternative designs, benefit-sharing.",
          "concept_applied": "World Bank projects require careful cost-benefit analysis and safeguards to ensure they do more good than harm."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Country Requests Assistance",
          "description": "A country facing economic problems requests support from an international institution.",
          "mechanism": "Country may approach IMF for balance of payments support, World Bank for development financing, or regional bank for project funding.",
          "result": "Request received.",
          
          "image": {
            "src": "images/unit13/inst_step1.png",
            "alt": "Country representative requesting assistance",
            "caption": "Figure 13.3.14: Step 1 - Country requests financial or technical assistance."
          }
        },
        {
          "step": 2,
          "process": "Institution Assesses Situation",
          "description": "The institution conducts analysis and negotiates with the country.",
          "mechanism": "IMF conducts Article IV consultation and program negotiations. World Bank assesses project feasibility and development impact. Conditions are discussed.",
          "result": "Agreement reached.",
          
          "image": {
            "src": "images/unit13/inst_step2.png",
            "alt": "IMF and World Bank officials meeting with country representatives",
            "caption": "Figure 13.3.15: Step 2 - Institution assesses situation and negotiates terms."
          }
        },
        {
          "step": 3,
          "process": "Financing Approved",
          "description": "The institution's board approves the financing.",
          "mechanism": "IMF Executive Board approves loan program. World Bank Board approves project. Funds are disbursed in tranches based on performance.",
          "result": "Financing approved.",
          
          "image": {
            "src": "images/unit13/inst_step3.png",
            "alt": "Board meeting approving financing",
            "caption": "Figure 13.3.16: Step 3 - Institution's board approves financing."
          }
        },
        {
          "step": 4,
          "process": "Implementation and Monitoring",
          "description": "Country implements reforms or project; institution monitors progress.",
          "mechanism": "IMF reviews program performance (quarterly reviews). World Bank supervises project implementation, disburses funds based on milestones. Conditions must be met.",
          "result": "Ongoing implementation.",
          
          "image": {
            "src": "images/unit13/inst_step4.png",
            "alt": "Project implementation and monitoring",
            "caption": "Figure 13.3.17: Step 4 - Country implements program or project; institution monitors."
          }
        },
        {
          "step": 5,
          "process": "Evaluation and Learning",
          "description": "Institution evaluates outcomes and learns for future programs.",
          "mechanism": "Independent evaluation offices assess program/project impact. Lessons incorporated into future design. Results published.",
          "result": "Learning and accountability.",
          
          "image": {
            "src": "images/unit13/inst_step5.png",
            "alt": "Evaluation report and learning cycle",
            "caption": "Figure 13.3.18: Step 5 - Evaluation and learning for future programs."
          }
        }
      ],

      "image": {
        "src": "images/unit13/global_institutions_summary.png",
        "alt": "Comprehensive summary diagram of global institutions: IMF, World Bank, regional banks, their functions, governance, and criticisms",
        "caption": "Figure 13.3.19: Global institutions summary - roles, functions, governance, and debates."
      }
    }
  ],

  "key_terms": [
    "International Monetary Fund (IMF)",
    "World Bank Group",
    "International Bank for Reconstruction and Development (IBRD)",
    "International Development Association (IDA)",
    "International Finance Corporation (IFC)",
    "Multilateral Investment Guarantee Agency (MIGA)",
    "International Centre for Settlement of Investment Disputes (ICSID)",
    "Regional development banks",
    "African Development Bank (AfDB)",
    "Asian Development Bank (ADB)",
    "Inter-American Development Bank (IDB)",
    "European Bank for Reconstruction and Development (EBRD)",
    "Islamic Development Bank",
    "New Development Bank (NDB)",
    "Asian Infrastructure Investment Bank (AIIB)",
    "World Trade Organization (WTO)",
    "United Nations Development Programme (UNDP)",
    "United Nations Conference on Trade and Development (UNCTAD)",
    "Organisation for Economic Co-operation and Development (OECD)",
    "Paris Club",
    "London Club",
    "Bretton Woods system",
    "Bretton Woods institutions",
    "Quota",
    "Subscription",
    "Voting power",
    "Special Drawing Rights (SDR)",
    "Conditionality",
    "Structural adjustment",
    "Structural adjustment programs (SAPs)",
    "Poverty Reduction Strategy Papers (PRSPs)",
    "Heavily Indebted Poor Countries (HIPC) Initiative",
    "Multilateral Debt Relief Initiative (MDRI)",
    "Debt sustainability",
    "Debt relief",
    "Debt restructuring",
    "Program lending",
    "Project lending",
    "Sector-wide approaches (SWAps)",
    "Budget support",
    "Technical assistance",
    "Capacity development",
    "Surveillance",
    "Article IV consultation",
    "Early warning systems",
    "Crisis prevention",
    "Crisis lending",
    "Stand-By Arrangement (SBA)",
    "Extended Fund Facility (EFF)",
    "Flexible Credit Line (FCL)",
    "Rapid Financing Instrument (RFI)",
    "Poverty Reduction and Growth Trust (PRGT)",
    "Governance",
    "Accountability",
    "Transparency",
    "Inspection panel",
    "Independent evaluation",
    "Civil society",
    "Non-governmental organizations",
    "Millennium Development Goals (MDGs)",
    "Sustainable Development Goals (SDGs)",
    "Global public goods",
    "Climate finance",
    "Pandemic preparedness"
  ],

  "summary": "Global institutions play a central role in international economic cooperation and development. The International Monetary Fund (IMF), created in 1944, focuses on maintaining international monetary stability through surveillance (monitoring economies), lending (providing balance of payments support), and capacity development. IMF loans come with conditions (structural adjustment programs) requiring policy reforms, which have been controversial. The World Bank Group, also created in 1944, focuses on long-term development through IBRD (lending to middle-income countries), IDA (concessional lending to poorest countries), IFC (private sector investment), MIGA (political risk insurance), and ICSID (dispute settlement). The World Bank finances projects in infrastructure, education, health, and other sectors. Regional development banks—African Development Bank, Asian Development Bank, Inter-American Development Bank, European Bank for Reconstruction and Development—provide region-focused financing and technical assistance. Other institutions include the WTO (trade rules), UNDP (UN development), OECD (policy coordination), and Paris Club (debt restructuring). These institutions have been criticized for: governance structures that give disproportionate power to rich countries; effectiveness concerns, with some programs failing to achieve objectives; ideological bias toward neoliberal policies; and environmental and social harm from projects. Reforms have included independent evaluation offices, inspection panels, and greater attention to social and environmental safeguards. Institutions have evolved to address new challenges: debt relief (HIPC Initiative), financial sector reform, governance, climate change, and pandemics. New institutions like the AIIB and NDB reflect the rise of new powers. Understanding global institutions is essential for analyzing international economic governance, development policy, and the debates surrounding them."
}
