{
  "expanded_description": "Can economic development continue indefinitely without destroying the planet? How can countries grow while protecting the environment and ensuring resources for future generations? These questions are at the heart of sustainable development—development that meets the needs of the present without compromising the ability of future generations to meet their own needs. Sustainable development integrates economic, social, and environmental objectives. It recognizes that growth that degrades the environment, depletes resources, or increases inequality is not sustainable in the long run. Achieving sustainable development requires balancing competing goals and making difficult trade-offs. In this section, we'll explore the concept of sustainable development, its environmental, social, and economic dimensions, the challenges of achieving it, and the policies that can promote it.",
  
  "core_concept": {
    "principle": "Sustainable development is development that meets the needs of the present without compromising the ability of future generations to meet their own needs. It has three pillars: economic sustainability, social sustainability, and environmental sustainability. (1) Economic sustainability: Maintaining and improving living standards over time, which requires investment in physical and human capital, technological progress, and sound macroeconomic management. (2) Social sustainability: Ensuring that development benefits all members of society, reducing inequality, and promoting social inclusion, justice, and cohesion. (3) Environmental sustainability: Protecting natural resources, limiting pollution and environmental degradation, and mitigating climate change to ensure that future generations inherit a healthy planet. These three pillars are interconnected and often involve trade-offs. For example, rapid economic growth may come at the expense of environmental degradation; environmental protection may slow growth in the short run; inequality can undermine social cohesion and political stability, which are necessary for long-term growth. Achieving sustainable development requires balancing these goals. Key challenges include: climate change, resource depletion, biodiversity loss, pollution, inequality, and poverty. Policies to promote sustainable development include: (1) Environmental policies: carbon pricing (carbon tax or cap-and-trade), regulation of pollution, protection of natural areas, investment in renewable energy, and promotion of energy efficiency. (2) Social policies: investment in education and health, social safety nets, progressive taxation, and policies to reduce inequality and discrimination. (3) Economic policies: promoting sustainable consumption and production, green innovation, circular economy, and sustainable infrastructure. (4) International cooperation: global agreements on climate change (Paris Agreement), biodiversity (Convention on Biological Diversity), and sustainable development (Sustainable Development Goals). Achieving sustainable development is one of the most pressing challenges of our time, requiring action at all levels—individual, community, national, and global.",
    
    "explanation": "Think of sustainable development like managing a household budget. You need to earn enough to live now (economic), treat everyone in the family fairly (social), and maintain the house so it doesn't fall apart (environmental). If you spend all your money on fun today, you won't have anything for tomorrow. If you ignore the leaky roof, the house will collapse. If you treat some family members unfairly, there will be conflict. Sustainable development is about balancing these three dimensions so the household can thrive both now and in the future.",
    
    "image": {
      "src": "images/unit13/sustainability_overview.png",
      "alt": "Venn diagram showing three pillars of sustainable development: economic, social, environmental, with sustainable development at intersection",
      "caption": "Figure 13.5.1: Sustainable development integrates economic, social, and environmental objectives."
    }
  },

  "sections": [
    {
      "section_title": "13.5 Sustainability",
      "introduction": "Economic growth has brought unprecedented prosperity, but it has also created unprecedented challenges—climate change, resource depletion, pollution, and inequality. Can we continue to grow without destroying the planet and leaving future generations worse off? This is the question of sustainable development. In this section, we'll explore the concept of sustainability, its three pillars, the challenges we face, and the policies that can help achieve a more sustainable future.",
      
      "introduction_image": {
        "src": "images/unit13/sustainability_intro.png",
        "alt": "Image of renewable energy, green city, and protected nature",
        "caption": "Figure 13.5.2: Sustainable development aims to balance economic growth, social inclusion, and environmental protection."
      },
      
      "key_concept": {
        "definition": "Sustainable development is development that meets the needs of the present without compromising the ability of future generations to meet their own needs. It has three interconnected pillars. (1) Economic sustainability: Maintaining and improving living standards over time. This requires investment in physical capital (machinery, infrastructure), human capital (education, health), and technological progress. It also requires sound macroeconomic management to avoid crises that can set back development. Economic sustainability is about ensuring that the economy can continue to generate prosperity for future generations. (2) Social sustainability: Ensuring that development benefits all members of society, reducing inequality, and promoting social inclusion, justice, and cohesion. This includes access to education, health care, and other services; protection of human rights; reduction of poverty and inequality; and social safety nets. Socially sustainable societies are more stable, cohesive, and resilient. (3) Environmental sustainability: Protecting natural resources, limiting pollution and environmental degradation, and mitigating climate change. This includes preserving biodiversity, managing renewable resources sustainably, reducing emissions of greenhouse gases, and minimizing waste. Environmental sustainability ensures that future generations inherit a healthy planet. These three pillars are interconnected. Economic growth can fund environmental protection and social programs; environmental degradation can undermine growth (e.g., through resource depletion, climate impacts); inequality can lead to social unrest, undermining stability. Achieving sustainable development requires balancing these goals, which often involves trade-offs. Key challenges include: climate change, biodiversity loss, pollution, resource depletion, poverty, inequality, and population growth. Policies to promote sustainable development include: carbon pricing, regulation, green investment, social programs, and international cooperation. The Sustainable Development Goals (SDGs), adopted by the UN in 2015, provide a framework for action, with 17 goals and 169 targets covering economic, social, and environmental dimensions.",
        
        "context": "The concept of sustainable development was popularized by the Brundtland Commission's 1987 report 'Our Common Future.' It gained global prominence at the 1992 Rio Earth Summit and has been central to international policy ever since. The Millennium Development Goals (2000-2015) focused on poverty and social indicators; the Sustainable Development Goals (2015-2030) are broader, integrating environmental sustainability. Climate change, biodiversity loss, and rising inequality have made sustainability more urgent than ever. In AP Macroeconomics, understanding sustainability is essential for analyzing long-run development challenges.",
        
        "image": {
          "src": "images/unit13/sdg_wheel.png",
          "alt": "Wheel diagram of the 17 Sustainable Development Goals",
          "caption": "Figure 13.5.3: The UN Sustainable Development Goals provide a comprehensive framework for sustainable development."
        }
      },

      "classifications": [
        {
          "type": "Environmental Sustainability",
          "value": "Protecting natural resources and ecosystems",
          "characteristics": ["Climate change mitigation", "Biodiversity conservation", "Pollution control", "Resource management", "Circular economy"],
          "behavior": "Environmental sustainability focuses on maintaining the health of the planet's ecosystems and natural resources. Key issues include: (1) Climate change: caused by greenhouse gas emissions from burning fossil fuels, deforestation, and agriculture. Impacts include rising temperatures, sea level rise, extreme weather, and disruption of ecosystems. Mitigation requires reducing emissions through clean energy, energy efficiency, and carbon pricing. Adaptation involves adjusting to unavoidable impacts. (2) Biodiversity loss: extinction of species and degradation of ecosystems due to habitat destruction, pollution, overexploitation, and climate change. Biodiversity is essential for ecosystem services (pollination, water purification, etc.). Conservation requires protected areas, sustainable use, and restoration. (3) Pollution: contamination of air, water, and soil by chemicals, plastics, and waste. Pollution harms human health and ecosystems. Control requires regulation, clean technologies, and waste management. (4) Resource depletion: overuse of renewable resources (fish, forests, water) and depletion of non-renewable resources (fossil fuels, minerals). Sustainable management requires renewable resources to be used at rates below regeneration; for non-renewables, requires investment in substitutes and recycling. The concept of planetary boundaries identifies limits within which humanity can safely operate. Exceeding these boundaries risks irreversible environmental change.",
          
          "image": {
            "src": "images/unit13/environmental_sustainability.png",
            "alt": "Diagram showing climate change, biodiversity loss, pollution, and resource depletion",
            "caption": "Figure 13.5.4: Environmental sustainability addresses climate change, biodiversity loss, pollution, and resource depletion."
          },
          
          "examples": [
            {
              "process": "Paris Agreement",
              "explanation": "International treaty to limit global warming to well below 2°C above pre-industrial levels, with efforts to limit it to 1.5°C. Countries submit nationally determined contributions (NDCs) to reduce emissions."
            },
            {
              "process": "Costa Rica's environmental policies",
              "explanation": "Costa Rica has reversed deforestation, protected vast areas, and aims to be carbon neutral. It has used payments for ecosystem services to incentivize conservation."
            }
          ]
        },
        {
          "type": "Social Sustainability",
          "value": "Ensuring equity, inclusion, and well-being",
          "characteristics": ["Poverty reduction", "Inequality reduction", "Access to education and health", "Social protection", "Human rights"],
          "behavior": "Social sustainability focuses on ensuring that development benefits all members of society and that societies are cohesive, just, and resilient. Key issues include: (1) Poverty reduction: ensuring that all people have access to basic needs—food, shelter, clean water, sanitation. Extreme poverty has fallen dramatically, but over 700 million people still live below the international poverty line ($\\$2.15$ per day). (2) Inequality: disparities in income, wealth, and opportunities within and between countries. High inequality can undermine social cohesion, reduce growth, and lead to conflict. Reducing inequality requires progressive taxation, investment in education and health, and social protection. (3) Access to education and health: essential for human development and for enabling people to participate fully in society. The SDGs aim for universal access to quality education and health care. (4) Social protection: safety nets (unemployment benefits, pensions, food assistance) that protect people from shocks and prevent destitution. (5) Human rights and inclusion: ensuring that all groups, including women, minorities, and marginalized populations, have equal rights and opportunities. Gender equality is a key dimension. Social sustainability also involves building social capital—trust, norms, and networks that enable cooperation.",
          
          "image": {
            "src": "images/unit13/social_sustainability.png",
            "alt": "Diagram showing poverty reduction, education, health, equality, social protection",
            "caption": "Figure 13.5.5: Social sustainability focuses on poverty reduction, equity, access to services, and social cohesion."
          },
          
          "examples": [
            {
              "process": "Bolsa Família in Brazil",
              "explanation": "Conditional cash transfer program that provided payments to poor families conditional on children attending school and getting vaccinated. It reduced poverty and inequality and improved health and education."
            },
            {
              "process": "Nordic welfare states",
              "explanation": "Countries like Denmark, Sweden, and Norway combine high levels of social spending, progressive taxation, and strong social safety nets with high levels of economic competitiveness and social trust."
            }
          ]
        },
        {
          "type": "Economic Sustainability",
          "value": "Maintaining prosperity over time",
          "characteristics": ["Sustainable growth", "Investment in capital", "Technological progress", "Macroeconomic stability", "Efficient resource use"],
          "behavior": "Economic sustainability focuses on ensuring that the economy can continue to generate prosperity for future generations. This requires: (1) Sustainable growth: growth that does not deplete the resource base or create unsustainable debt. It requires investment in physical capital, human capital, and technology. (2) Investment in capital: maintaining and expanding the capital stock (machinery, infrastructure, knowledge) to support future production. This includes natural capital (resources, ecosystems) as well as produced capital. (3) Technological progress: innovation that increases productivity and enables more efficient use of resources. Green technologies can reduce environmental impact while maintaining growth. (4) Macroeconomic stability: avoiding crises (financial, debt, inflation) that can set back development. This requires sound fiscal and monetary policies, regulation of financial systems, and management of external shocks. (5) Efficient resource use: minimizing waste and using resources efficiently (including energy, materials, water). The concept of a circular economy—where waste is minimized and materials are reused—is key to economic sustainability. Economic sustainability is not about maximizing growth at any cost, but about ensuring that the economy can continue to improve well-being over time.",
          
          "image": {
            "src": "images/unit13/economic_sustainability.png",
            "alt": "Diagram showing investment, technology, stability, efficiency",
            "caption": "Figure 13.5.6: Economic sustainability requires investment, technological progress, stability, and efficient resource use."
          },
          
          "examples": [
            {
              "process": "Green growth in South Korea",
              "explanation": "South Korea has invested heavily in green technologies and set ambitious emission reduction targets, aiming to decouple growth from emissions."
            },
            {
              "process": "Circular economy in Netherlands",
              "explanation": "The Netherlands aims to be fully circular by 2050, with policies to reduce waste, promote recycling, and redesign products for reuse."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Sustainable Development Requires Balancing Three Pillars",
          "statement": "Sustainable development is not just about environmental protection, nor just about economic growth, nor just about social equity. It requires balancing all three. Focusing on one pillar at the expense of others can lead to unsustainable outcomes. For example, pursuing growth without regard to the environment can deplete resources and cause climate change that ultimately undermines growth. Pursuing environmental protection without regard to social impacts can harm poor communities that depend on resource extraction. Pursuing social equity without economic growth can lead to unsustainable fiscal burdens. The three pillars are interconnected, and progress on one can support progress on others. For instance, investment in clean energy (environmental) can create jobs (economic) and reduce energy poverty (social). The challenge is to find policies that advance multiple goals simultaneously and to manage trade-offs when they arise.",
          "application": "When evaluating development strategies, consider all three pillars. Does a policy promote economic growth? Does it reduce inequality and improve social outcomes? Does it protect the environment? Policies that score well on all three are most sustainable.",
          "example": "Germany's Energiewende (energy transition) aims to shift to renewable energy. It addresses environmental goals (reducing emissions), economic goals (creating jobs in green industries), and social goals (decentralizing energy production, involving communities).",
          
          "image": {
            "src": "images/unit13/three_pillars.png",
            "alt": "Balance scale showing three pillars needing equilibrium",
            "caption": "Figure 13.5.7: Sustainable development requires balancing economic, social, and environmental objectives."
          }
        },
        {
          "principle": "Climate Change Is the Defining Challenge of Sustainable Development",
          "statement": "Climate change, caused by greenhouse gas emissions from human activity, is arguably the greatest threat to sustainable development. It affects all three pillars: (1) Economic: damages from extreme weather, reduced agricultural productivity, lost labor hours, damage to infrastructure, and disruption of supply chains. The costs of inaction are enormous. (2) Social: disproportionate impacts on poor and vulnerable populations, who are least able to adapt; increased migration and conflict; health impacts from heat, disease, and pollution. (3) Environmental: rising temperatures, sea level rise, ocean acidification, biodiversity loss, and ecosystem collapse. Addressing climate change requires both mitigation (reducing emissions) and adaptation (adjusting to unavoidable impacts). Mitigation requires a rapid transition away from fossil fuels to clean energy, improvements in energy efficiency, and changes in land use and agriculture. Adaptation requires investment in resilient infrastructure, disaster preparedness, and social safety nets. Climate action also requires international cooperation, as emissions are a global problem. The Paris Agreement provides a framework, but current pledges are insufficient to meet the temperature goal. Climate change is a test of whether we can achieve sustainable development.",
          "application": "When analyzing sustainability, climate change must be central. Policies should be evaluated for their impact on emissions and resilience. Investments in fossil fuels may be economically attractive in the short run but undermine long-term sustainability.",
          "example": "Small island states like Maldives and Tuvalu are on the front lines of climate change, facing existential threats from sea level rise. Their advocacy has been crucial in climate negotiations.",
          
          "image": {
            "src": "images/unit13/climate_change.png",
            "alt": "Graph showing rising global temperatures and CO2 concentrations",
            "caption": "Figure 13.5.8: Climate change is the defining challenge of sustainable development, affecting all three pillars."
          }
        },
        {
          "principle": "Inequality Undermines Sustainability",
          "statement": "High levels of inequality—in income, wealth, and opportunity—undermine sustainable development in multiple ways. (1) Social: inequality breeds resentment, erodes social cohesion, and can lead to conflict and instability. It also means that the benefits of growth are not shared, leaving many behind. (2) Economic: inequality can reduce growth by limiting opportunities for the poor to invest in education and health, by fueling populist policies that harm growth, and by creating instability. (3) Environmental: inequality can exacerbate environmental degradation, as the poor may be forced to overexploit resources for survival, while the rich consume disproportionately and have more political power to resist environmental regulations. Reducing inequality is thus essential for sustainability. This requires progressive taxation, investment in education and health, social protection, and policies to ensure equal opportunities. The SDGs include a specific goal (SDG 10) to reduce inequality within and among countries.",
          "application": "When assessing sustainability, look at inequality. High and rising inequality is a warning sign. Policies that reduce inequality—progressive taxes, social spending, anti-discrimination laws—can also promote sustainability.",
          "example": "South Africa has extremely high inequality, a legacy of apartheid. This inequality undermines social cohesion and makes it difficult to address other challenges like climate change.",
          
          "image": {
            "src": "images/unit13/inequality_sustainability.png",
            "alt": "Graph showing Gini coefficient and its correlation with social and environmental outcomes",
            "caption": "Figure 13.5.9: High inequality undermines social cohesion, economic stability, and environmental sustainability."
          }
        },
        {
          "principle": "International Cooperation Is Essential",
          "statement": "Many sustainability challenges are global and cannot be solved by any one country alone. Climate change, biodiversity loss, ocean pollution, and pandemics require collective action. International cooperation is essential for: (1) Setting goals and standards: agreements like the Paris Agreement and the Convention on Biological Diversity provide frameworks. (2) Mobilizing finance: developing countries need support for mitigation and adaptation; this requires climate finance from rich countries. (3) Technology transfer: sharing clean technologies can accelerate the transition. (4) Monitoring and accountability: tracking progress and holding countries accountable. (5) Addressing spillovers: policies in one country can affect others (e.g., carbon leakage). International cooperation is difficult because of free-rider problems and conflicting interests, but it is essential. The SDGs provide a shared agenda, and multilateral institutions (UN, World Bank, etc.) play key roles. Strengthening international cooperation is a major challenge for sustainable development.",
          "application": "When analyzing sustainability, consider the international dimension. National policies are necessary but not sufficient. Progress depends on global cooperation. Evaluate countries' participation in international agreements and their contributions to global public goods.",
          "example": "The Montreal Protocol, which phased out ozone-depleting substances, is often cited as a successful example of international cooperation. It shows that collective action on environmental challenges is possible.",
          
          "image": {
            "src": "images/unit13/international_cooperation.png",
            "alt": "World map with hands clasped, representing international cooperation",
            "caption": "Figure 13.5.10: International cooperation is essential for addressing global sustainability challenges like climate change."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Carbon Footprint",
          
          "image": {
            "src": "images/unit13/carbon_footprint.png",
            "alt": "Table with emission factors",
            "caption": "Figure 13.5.11: Calculate the carbon footprint of different activities."
          },
          
          "problem": "A person drives a car that gets 25 miles per gallon and drives 12,000 miles per year. Gasoline emits about 8.9 kg of CO2 per gallon. a) How many gallons of gas are used per year? b) What is the annual CO2 emissions from driving? c) If this person flies 5,000 miles per year, and flying emits about 0.2 kg CO2 per passenger mile, what are emissions from flying? d) What is total carbon footprint from these activities? e) How many tons of CO2 is this? (1 metric ton = 1,000 kg)",
          
          "step_by_step": [
            {
              "step": "Gallons per year",
              "explanation": "12,000 miles / 25 mpg = 480 gallons."
            },
            {
              "step": "Driving emissions",
              "explanation": "480 gallons × 8.9 kg/gallon = 4,272 kg CO2."
            },
            {
              "step": "Flying emissions",
              "explanation": "5,000 miles × 0.2 kg/mile = 1,000 kg CO2."
            },
            {
              "step": "Total emissions",
              "explanation": "4,272 + 1,000 = 5,272 kg CO2."
            },
            {
              "step": "Tons",
              "explanation": "5,272 / 1,000 = 5.27 metric tons CO2."
            }
          ],
          
          "final_answer": "a) 480 gallons. b) 4,272 kg. c) 1,000 kg. d) 5,272 kg. e) 5.27 tons.",
          "concept_applied": "Carbon footprints quantify individual contributions to climate change, highlighting areas for reduction."
        },
        {
          "title": "Analyzing Trade-offs: Growth vs Environment",
          
          "image": {
            "src": "images/unit13/growth_vs_environment.png",
            "alt": "Graph showing Environmental Kuznets Curve",
            "caption": "Figure 13.5.12: Analyze the relationship between growth and environmental quality."
          },
          
          "problem": "The Environmental Kuznets Curve hypothesis suggests that environmental degradation first increases with income, then decreases after a certain income level. a) Explain the logic behind this hypothesis. b) What are the policy implications? c) Is this hypothesis supported by evidence? d) What are the dangers of relying on this hypothesis? e) How does this relate to sustainable development?",
          
          "step_by_step": [
            {
              "step": "Logic of EKC",
              "explanation": "At low incomes, people prioritize growth over environment; pollution increases with industrialization. As incomes rise, demand for environmental quality increases, and countries can afford cleaner technologies and regulation. So pollution eventually declines."
            },
            {
              "step": "Policy implications",
              "explanation": "If EKC holds, growth itself will solve environmental problems eventually. Countries should focus on growth first, environment later."
            },
            {
              "step": "Evidence",
              "explanation": "Mixed. Some pollutants (sulfur dioxide) show EKC pattern; others (CO2) do not—emissions continue rising with income. Also, the turning point may be very high, and environmental damage may be irreversible."
            },
            {
              "step": "Dangers",
              "explanation": "Relying on EKC could lead to irreversible damage (biodiversity loss, climate tipping points) before turning point reached. Also, rich countries may have outsourced pollution to poor countries (pollution haven effect)."
            },
            {
              "step": "Relation to sustainability",
              "explanation": "EKC suggests growth and environment can be compatible in long run, but proactive policies are needed to avoid irreversible damage and ensure turning point is reached before it's too late."
            }
          ],
          
          "final_answer": "a) Demand for environment rises with income. b) Grow first, clean up later. c) Mixed evidence. d) Irreversible damage, outsourcing. e) Proactive policies needed for sustainability.",
          "concept_applied": "The relationship between growth and environment is complex. Sustainable development requires proactive policies, not just waiting for growth to solve problems."
        },
        {
          "title": "Evaluating a Sustainability Policy",
          
          "image": {
            "src": "images/unit13/sustainability_policy.png",
            "alt": "Table with policy options",
            "caption": "Figure 13.5.13: Evaluate a proposed carbon tax."
          },
          
          "problem": "A government proposes a carbon tax of $\\$50$ per ton of CO2. a) How would this affect the price of gasoline if each gallon emits 8.9 kg CO2? b) How would it affect emissions? c) What would be the impact on different income groups? d) How could the revenue be used to address equity concerns? e) What are the potential economic impacts?",
          
          "step_by_step": [
            {
              "step": "Impact on gasoline price",
              "explanation": "8.9 kg = 0.0089 tons per gallon. Tax per gallon = $50 × 0.0089 = $\\$0.445$ per gallon (about 45 cents)."
            },
            {
              "step": "Impact on emissions",
              "explanation": "Higher price reduces demand (elasticity ~0.2-0.6 in short run). Could reduce gasoline consumption by 10-30% over time, depending on elasticity and availability of alternatives."
            },
            {
              "step": "Distributional impact",
              "explanation": "Carbon taxes are regressive—they take a larger share of income from poor households, who spend more on energy. But poor households also use less energy in absolute terms, so impact varies."
            },
            {
              "step": "Using revenue",
              "explanation": "Revenue could be used to rebate to households (especially poor), reduce other taxes (e.g., payroll tax), or invest in green infrastructure. This can offset regressive effects."
            },
            {
              "step": "Economic impacts",
              "explanation": "Could reduce GDP slightly in short run, but also stimulate investment in clean energy and innovation. Long-run effects depend on how revenue is used and the availability of alternatives."
            }
          ],
          
          "final_answer": "a) +$\\$0.45$ per gallon. b) Reduces emissions. c) Regressive. d) Rebates, tax cuts, green investment. e) Short-run costs, long-run benefits.",
          "concept_applied": "Carbon taxes can reduce emissions but have distributional effects; revenue recycling can address equity."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Sustainability Challenges",
          "description": "Countries and communities identify key sustainability challenges they face.",
          "mechanism": "Assessment of environmental, social, and economic conditions. Use of indicators (carbon emissions, inequality, poverty, resource depletion).",
          "result": "Priority challenges identified.",
          
          "image": {
            "src": "images/unit13/sustain_step1.png",
            "alt": "Assessment of sustainability challenges",
            "caption": "Figure 13.5.14: Step 1 - Identify key sustainability challenges (climate, inequality, poverty, resource depletion)."
          }
        },
        {
          "step": 2,
          "process": "Set Goals and Targets",
          "description": "Goals are set at local, national, and global levels.",
          "mechanism": "SDGs provide framework. Countries set nationally determined contributions (NDCs) for climate. National development plans incorporate sustainability.",
          "result": "Goals and targets established.",
          
          "image": {
            "src": "images/unit13/sustain_step2.png",
            "alt": "Setting SDG targets and NDCs",
            "caption": "Figure 13.5.15: Step 2 - Set goals and targets (SDGs, NDCs, national plans)."
          }
        },
        {
          "step": 3,
          "process": "Design and Implement Policies",
          "description": "Policies are designed to achieve goals.",
          "mechanism": "Carbon pricing, regulation, investment in green infrastructure, social programs, education, etc. Policy mix tailored to context.",
          "result": "Policies implemented.",
          
          "image": {
            "src": "images/unit13/sustain_step3.png",
            "alt": "Policy instruments: carbon tax, regulation, green investment, social programs",
            "caption": "Figure 13.5.16: Step 3 - Design and implement policies to achieve sustainability goals."
          }
        },
        {
          "step": 4,
          "process": "Monitor and Evaluate Progress",
          "description": "Progress is monitored using indicators.",
          "mechanism": "Track emissions, poverty rates, inequality, etc. Evaluate policy effectiveness. Adjust as needed.",
          "result": "Learning and accountability.",
          
          "image": {
            "src": "images/unit13/sustain_step4.png",
            "alt": "Monitoring dashboard with sustainability indicators",
            "caption": "Figure 13.5.17: Step 4 - Monitor and evaluate progress using indicators."
          }
        },
        {
          "step": 5,
          "process": "Adapt and Strengthen",
          "description": "Policies are adapted based on experience and new challenges.",
          "mechanism": "Iterative process of learning, adjusting, and strengthening. International cooperation and knowledge sharing.",
          "result": "Continuous improvement.",
          
          "image": {
            "src": "images/unit13/sustain_step5.png",
            "alt": "Adaptation and learning cycle",
            "caption": "Figure 13.5.18: Step 5 - Adapt and strengthen policies based on experience."
          }
        }
      ],

      "image": {
        "src": "images/unit13/sustainability_summary.png",
        "alt": "Comprehensive summary diagram of sustainable development: three pillars, challenges, policies, and SDGs",
        "caption": "Figure 13.5.19: Sustainable development summary - pillars, challenges, policies, and global framework."
      }
    }
  ],

  "key_terms": [
    "Sustainable development",
    "Brundtland Commission",
    "Our Common Future",
    "Three pillars",
    "Economic sustainability",
    "Social sustainability",
    "Environmental sustainability",
    "Planetary boundaries",
    "Climate change",
    "Global warming",
    "Greenhouse gas emissions",
    "Carbon dioxide",
    "Methane",
    "Fossil fuels",
    "Renewable energy",
    "Solar power",
    "Wind power",
    "Hydropower",
    "Geothermal",
    "Nuclear power",
    "Energy efficiency",
    "Mitigation",
    "Adaptation",
    "Paris Agreement",
    "Nationally determined contributions (NDCs)",
    "Carbon pricing",
    "Carbon tax",
    "Cap-and-trade",
    "Emissions trading",
    "Carbon footprint",
    "Carbon neutrality",
    "Net zero",
    "Biodiversity",
    "Ecosystem services",
    "Deforestation",
    "Habitat loss",
    "Extinction",
    "Convention on Biological Diversity",
    "Pollution",
    "Air pollution",
    "Water pollution",
    "Plastic pollution",
    "Circular economy",
    "Reduce, reuse, recycle",
    "Resource depletion",
    "Peak oil",
    "Peak water",
    "Sustainable yield",
    "Natural capital",
    "Green economy",
    "Green growth",
    "Decoupling",
    "Environmental Kuznets curve",
    "Poverty",
    "Inequality",
    "Gini coefficient",
    "Social inclusion",
    "Gender equality",
    "Education",
    "Health",
    "Social protection",
    "Safety nets",
    "Human rights",
    "Sustainable Development Goals (SDGs)",
    "Millennium Development Goals (MDGs)",
    "Agenda 2030",
    "Rio Earth Summit",
    "Johannesburg Summit",
    "Future generations",
    "Intergenerational equity",
    "Precautionary principle",
    "Polluter pays principle",
    "Common but differentiated responsibilities"
  ],

  "summary": "Sustainable development is development that meets the needs of the present without compromising the ability of future generations to meet their own needs. It has three interconnected pillars: economic sustainability (maintaining prosperity through investment, technology, and stability); social sustainability (ensuring equity, inclusion, and well-being); and environmental sustainability (protecting natural resources and ecosystems). Achieving sustainable development requires balancing these goals, which often involves trade-offs. Key challenges include climate change (the defining challenge), biodiversity loss, pollution, resource depletion, poverty, and inequality. Climate change, caused by greenhouse gas emissions, threatens all three pillars and requires both mitigation (reducing emissions) and adaptation. Biodiversity loss and pollution also pose serious threats. Social sustainability requires reducing poverty and inequality, ensuring access to education and health, and building social cohesion. Economic sustainability requires investment in capital, technological progress, and macroeconomic stability, as well as efficient resource use and a transition to a circular economy. Policies to promote sustainable development include: carbon pricing (carbon tax or cap-and-trade), regulation of pollution, investment in renewable energy and energy efficiency, protection of natural areas, social programs (cash transfers, universal health coverage, education), progressive taxation, and international cooperation. The Sustainable Development Goals (SDGs), adopted by the UN in 2015, provide a comprehensive framework with 17 goals and 169 targets covering economic, social, and environmental dimensions. International cooperation is essential for addressing global challenges like climate change. The Paris Agreement provides a framework for climate action, but current pledges are insufficient. Achieving sustainable development is one of the most pressing challenges of our time, requiring action at all levels—individual, community, national, and global."
}
