{
  "course": "AP Microeconomics",
  "topic": "Fundamentals of Economics",
  "problems": [
    {
      "number": 1,
      "problem": "Nirali has 5 hours to study for Microeconomics and History. Based on the provided tables showing her expected scores: \n(a) Calculate her gain from the second hour spent studying history. \n(b) Calculate the opportunity cost of the second hour spent studying history. \n(c) Assume Nirali increases the time she allocates to studying history. What happens to the opportunity cost of studying history? Explain. \n(d) Assume Nirali has a goal of maximizing the sum of her test scores. How many hours should she study for each exam? \n(e) If Nirali's tennis practice is canceled, freeing up an additional hour (6 total), will she allocate it to Microeconomics or History to maximize her total scores? Explain using marginal analysis.",
      "image": "images/fundecon1.png",
      "step_by_step": [
        {
          "step": "Part (a): Marginal Benefit of History",
          "explanation": "The gain from the second hour is the marginal score increase. Studying History for 1 hour gives a score of 40; 2 hours gives 60. Gain = 60 - 40 = 20 points."
        },
        {
          "step": "Part (b): Opportunity Cost calculation",
          "explanation": "With 5 hours total, to spend a 2nd hour on History, Nirali must reduce Microeconomics study from 4 hours to 3 hours. Her Micro score drops from 96 to 90. Opportunity cost = 96 - 90 = 6 points."
        },
        {
          "step": "Part (c): Law of Increasing Opportunity Cost",
          "explanation": "As she studies more History, she studies less Micro. The marginal loss of Micro scores increases (from 4 to 6 to 8 to 22 to 60) for each additional hour of History. Therefore, the opportunity cost increases."
        },
        {
          "step": "Part (d): Total Score Maximization",
          "explanation": "Calculate the sum for all combinations: (5M,0H)=100; (4M,1H)=136; (3M,2H)=150; (2M,3H)=154; (1M,4H)=137; (0M,5H)=80. The maximum sum is 154."
        },
        {
          "step": "Part (e): Marginal Analysis for 6th Hour",
          "explanation": "Starting from 2M/3H, the 6th hour could be the 3rd hour of Micro (MB = 90 - 82 = 8 points) or the 4th hour of History (MB = 77 - 72 = 5 points). Since 8 > 5, she chooses Microeconomics."
        }
      ],
      "final_answer": "(a) 20 points; (b) 6 points; (c) Increases; (d) 2 hours Micro, 3 hours History; (e) Microeconomics (MB 8 > MB 5)."
    },
    {
  "number": 2,
  "problem": "A country can produce only two goods: laptops and textbooks. The table below shows the maximum output combinations that can be produced with full employment of resources.\n\n(a) Calculate the opportunity cost of producing the 2nd laptop.\n(b) Identify whether the opportunity cost of laptops is increasing, constant, or decreasing, and explain.\n(c) If the economy is currently producing 3 laptops and 9 textbooks, determine whether this point is efficient, inefficient, or unattainable.\n(d) Suppose a technological improvement occurs in laptop production only. Illustrate and explain how the PPF changes.\n(e) Explain how this scenario demonstrates the concept of scarcity.",
  "image": "images/fundecon2.png",
  "step_by_step": [
    {
      "step": "Part (a): Opportunity Cost Calculation",
      "explanation": "To find the opportunity cost of the 2nd laptop, compare textbook production at 1 laptop (14) vs 2 laptops (12). The difference is $14 - 12 = 2$ textbooks."
    },
    {
      "step": "Part (b): Identifying the Pattern",
      "explanation": "The opportunity cost is increasing. The cost of each additional laptop rises sequentially (1, 2, 3, 4, then 5 textbooks). This is due to the Law of Increasing Opportunity Costs, where resources are specialized and not perfectly adaptable to both goods."
    },
    {
      "step": "Part (c): Efficiency Analysis",
      "explanation": "The point (3, 9) is efficient. According to the table, 9 textbooks is the maximum possible output when 3 laptops are produced. Since the economy is producing on its maximum frontier, it is efficient."
    },
    {
      "step": "Part (d): Technological Shift",
      "explanation": "A technological improvement in laptops causes an outward pivot of the PPF along the laptop axis. The maximum textbooks (y-intercept) stays at 15, while the maximum laptops (x-intercept) moves to the right."
    },
    {
      "step": "Part (e): Demonstrating Scarcity",
      "explanation": "Scarcity is shown by the existence of the frontier itself and the necessary trade-offs. Because resources are finite, the country cannot produce beyond the curve, and obtaining more of one good requires sacrificing some of the other."
    }
  ],
  "final_answer": "(a) 2 textbooks; (b) Increasing opportunity cost due to resource specialization; (c) Efficient (it lies on the PPF); (d) Outward pivot on the laptop axis; (e) Shown by the limit of the frontier and the need for trade-offs."
},
    {
      "number": 3,
      "problem": "Differentiate microeconomics and macroeconomics.",
      "image": null,
      "step_by_step": [
        {
          "step": "Microeconomics",
          "explanation": "Focuses on individual markets, consumers, firms, and pricing decisions."
        },
        {
          "step": "Macroeconomics",
          "explanation": "Focuses on the overall economy, including GDP, inflation, unemployment, and fiscal/monetary policy."
        }
      ],
      "final_answer": "Micro: individual markets & decisions; Macro: economy-wide aggregates & policies."
    }
  ]
}

