{
  "course": "AP Microeconomics",
  "topic": "International Microeconomics",
  "problems": [
    {
      "number": 1,
      "problem": "Define international trade.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "International trade is the exchange of goods and services across countries."
        }
      ],
      "final_answer": "International trade: exchange of goods and services between countries."
    },
    {
      "number": 2,
      "problem": "Define absolute advantage.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "A country has an absolute advantage if it can produce more of a good with the same resources than another country."
        }
      ],
      "final_answer": "Absolute advantage: produce more with same resources."
    },
    {
      "number": 3,
      "problem": "Define comparative advantage.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "A country has a comparative advantage if it can produce a good at a lower opportunity cost than another country."
        }
      ],
      "final_answer": "Comparative advantage: lower opportunity cost of production."
    },
    {
      "number": 4,
      "problem": "Explain why countries specialize according to comparative advantage.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "Specialization allows countries to produce efficiently and trade to consume beyond their production possibilities frontier (PPF)."
        }
      ],
      "final_answer": "Specialization increases efficiency and allows consumption beyond PPF."
    },
    {
      "number": 5,
      "problem": "Explain the effect of tariffs on domestic consumers and producers.",
      "image": null,
      "step_by_step": [
        {
          "step": "Consumers",
          "explanation": "Tariffs increase import prices, reducing consumer surplus."
        },
        {
          "step": "Producers",
          "explanation": "Domestic producers benefit from reduced foreign competition, increasing producer surplus."
        }
      ],
      "final_answer": "Tariffs: consumers lose, domestic producers gain."
    },
    {
      "number": 6,
      "problem": "Explain the effect of quotas on trade.",
      "image": null,
      "step_by_step": [
        {
          "step": "Effect",
          "explanation": "Quotas limit the quantity of imports, raising domestic prices, reducing consumer surplus, and increasing producer surplus."
        }
      ],
      "final_answer": "Quotas: limit imports, raise prices, consumers lose, producers gain."
    },
    {
      "number": 7,
      "problem": "Define trade protectionism.",
      "image": null,
      "step_by_step": [
        {
          "step": "Definition",
          "explanation": "Trade protectionism involves government policies such as tariffs, quotas, and subsidies to protect domestic industries from foreign competition."
        }
      ],
      "final_answer": "Trade protectionism: policies to shield domestic firms from foreign competition."
    },
    {
      "number": 8,
      "problem": "Explain how a country benefits from free trade.",
      "image": null,
      "step_by_step": [
        {
          "step": "Explanation",
          "explanation": "Free trade allows countries to specialize according to comparative advantage, lowering costs, increasing efficiency, and improving total welfare."
        }
      ],
      "final_answer": "Free trade: specialization, lower costs, higher total welfare."
    },
    {
      "number": 9,
      "problem": "Explain how exchange rates affect international trade.",
      "image": null,
      "step_by_step": [
        {
          "step": "Effect",
          "explanation": "A stronger domestic currency makes imports cheaper and exports more expensive, reducing export demand. A weaker domestic currency does the opposite."
        }
      ],
      "final_answer": "Exchange rates: stronger currency → cheaper imports, fewer exports; weaker currency → cheaper exports, costlier imports."
    },
    {
      "number": 10,
      "problem": "A country can produce either 10 cars or 50 computers per day. Another country can produce 6 cars or 30 computers per day. Which country has comparative advantage in cars and computers?",
      "image": null,
      "step_by_step": [
        {
          "step": "Calculate Opportunity Costs",
          "explanation": "Country A: 1 car = 5 computers (50/10), 1 computer = 0.2 cars (10/50)"
        },
        {
          "step": "Country B",
          "explanation": "Country B: 1 car = 5 computers (30/6), 1 computer = 0.2 cars (6/30)"
        },
        {
          "step": "Compare Opportunity Costs",
          "explanation": "Both countries have the same opportunity costs; no comparative advantage exists in this simplified example."
        }
      ],
      "final_answer": "No comparative advantage; opportunity costs identical."
    }
  ]
}
