{
  "expanded_description": "To move from a qualitative understanding of elasticity to quantitative analysis, we need robust calculation methods. This section introduces the formulas used to compute Price Elasticity of Demand, focusing on the superior midpoint (arc elasticity) method. It also covers how to correctly interpret the resulting coefficient, avoiding common pitfalls. Mastering calculation and interpretation is essential for applying elasticity to real data and making informed business and policy decisions.",
  "core_concept": {
    "principle": "Price Elasticity of Demand is calculated as the ratio of the percentage change in quantity demanded to the percentage change in price. The choice of which price and quantity to use as the base for calculating percentages matters. The <strong>midpoint formula</strong> (or arc elasticity formula) solves this ambiguity by using the average of the initial and final values as the base. The formula is: $\\text{PED} = \\left|\\frac{\\frac{Q_2 - Q_1}{\\frac{Q_1 + Q_2}{2}}}{\\frac{P_2 - P_1}{\\frac{P_1 + P_2}{2}}}\\right|$. This yields a single, consistent elasticity value for the segment between two points, regardless of whether you consider the change from point 1 to point 2 or vice versa.",
    "explanation": "Why not use the simple percentage change formula ($\\%\\Delta = \\frac{\\text{New} - \\text{Old}}{\\text{Old}}$)? Because it gives different answers depending on direction. A price rise from \\$10 to \\$20 is a 100% increase using the old price (\\$10) as base, but a price fall from \\$20 to \\$10 is a 50% decrease using the old price (\\$20) as base. The midpoint formula uses the average as the base, providing symmetry: the elasticity from A to B equals the elasticity from B to A. <strong>Interpretation</strong>: The calculated PED coefficient (e.g., 0.5, 2.0) tells us the proportional responsiveness. A PED of 2.0 means that for every 1% change in price, quantity demanded changes by 2% in the opposite direction. It is a unit-free measure of sensitivity. <strong>Point Elasticity</strong>, calculated using calculus ($\\text{PED} = \\left|\\frac{dQ}{dP} \\times \\frac{P}{Q}\\right|$), gives the elasticity at a specific point on the demand curve. It's crucial for non-linear demand curves.",
    "image": {
      "src": "images/unit4/midpoint_formula_diagram.png",
      "alt": "A demand curve with two points labeled A (P1, Q1) and B (P2, Q2). Arrows show ΔP and ΔQ. The midpoint between A and B is highlighted. The midpoint formula is displayed prominently.",
      "caption": "The Midpoint Formula for Arc Elasticity: Uses the average of initial and final values as the base, providing a consistent measure for the segment between two points."
    }
  },
  "sections": [
    {
      "section_title": "The Midpoint Formula: Calculation and Application",
      "introduction": "The midpoint formula is the standard method for calculating elasticity from observed price and quantity data at two points. It ensures consistency and avoids the 'starting point' problem inherent in simple percentage calculations.",
      "key_concept": {
        "definition": "Midpoint (Arc) Elasticity Formula: $\\text{PED} = \\left|\\frac{\\text{Change in } Q}{\\text{Average } Q} \\div \\frac{\\text{Change in } P}{\\text{Average } P}\\right| = \\left|\\frac{\\frac{Q_2 - Q_1}{\\frac{Q_1+Q_2}{2}}}{\\frac{P_2 - P_1}{\\frac{P_1+P_2}{2}}}\\right|$.",
        "context": "Use this when you have data for two distinct points (e.g., sales before and after a price change) and want the elasticity over that range. It's an 'arc' elasticity because it measures elasticity over an arc (segment) of the demand curve."
      },
      "principles": [
        {
          "principle": "Symmetry and Consistency",
          "statement": "The midpoint formula yields the same elasticity coefficient whether you calculate from point A to point B or from point B to point A. This property makes it the preferred method for empirical work.",
          "application": "Always use the midpoint formula when given two price-quantity pairs, unless specifically instructed to use the initial point as the base.",
          "example": "Point A: $P=\\$10$, $Q=100$. Point B: $P=\\$20$, $Q=50$. Simple % from A to B: $\\%\\Delta P = \\frac{20-10}{10}=100\\%$, $\\%\\Delta Q=\\frac{50-100}{100}=-50\\%$, PED=0.5. Simple % from B to A: $\\%\\Delta P=\\frac{10-20}{20}=-50\\%$, $\\%\\Delta Q=\\frac{100-50}{50}=100\\%$, PED=2.0. Two different answers! Midpoint formula: Avg $P=\\$15$, Avg $Q=75$. $\\%\\Delta P = \\frac{10}{15}=66.67\\%$, $\\%\\Delta Q=\\frac{-50}{75}=-66.67\\%$. PED = 1.0. Same answer regardless of direction."
        },
        {
          "principle": "Step-by-Step Calculation",
          "statement": "1. Calculate the change in quantity ($\\Delta Q$) and change in price ($\\Delta P$). 2. Calculate the average quantity ($Q_{\\text{avg}}$) and average price ($P_{\\text{avg}}$). 3. Calculate the percentage change in quantity: $\\%\\Delta Q = \\frac{\\Delta Q}{Q_{\\text{avg}}}$. 4. Calculate the percentage change in price: $\\%\\Delta P = \\frac{\\Delta P}{P_{\\text{avg}}}$. 5. Take the absolute value of the ratio: $\\text{PED} = \\left|\\frac{\\%\\Delta Q}{\\%\\Delta P}\\right|$.",
          "application": "Organize data in a table to avoid errors. Remember to use the averages as denominators.",
          "example": "Price falls from \\$8 to \\$6. Quantity rises from 20 to 30. $\\Delta Q = 10$, $\\Delta P = -2$. $Q_{\\text{avg}} = \\frac{20+30}{2} = 25$. $P_{\\text{avg}} = \\frac{8+6}{2} = 7$. $\\%\\Delta Q = \\frac{10}{25} = 0.4$ (40%). $\\%\\Delta P = \\frac{-2}{7} \\approx -0.2857$ (28.57%). $\\text{PED} = \\left|\\frac{0.4}{0.2857}\\right| \\approx 1.4$. Demand is elastic over this range."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating PED with the Midpoint Formula",
          "problem": "A coffee shop observes that when it lowered the price of a latte from \\$5.00 to \\$4.50, the number sold per day increased from 200 to 230. (a) Calculate the Price Elasticity of Demand using the midpoint formula. (b) Interpret the numerical value. (c) Over this price range, is demand for their lattes elastic, inelastic, or unit elastic?",
          "step_by_step": [
            {
              "step": "Part (a): Apply the Midpoint Formula",
              "explanation": "Identify the values: $P_1 = \\$5.00$, $Q_1 = 200$; $P_2 = \\$4.50$, $Q_2 = 230$. $\\Delta Q = 230 - 200 = 30$. $\\Delta P = 4.50 - 5.00 = -0.50$. Average $Q = \\frac{200 + 230}{2} = 215$. Average $P = \\frac{5.00 + 4.50}{2} = \\$4.75$. Percentage change in quantity: $\\%\\Delta Q = \\frac{\\Delta Q}{\\text{Avg } Q} = \\frac{30}{215} \\approx 0.1395$ (13.95%). Percentage change in price: $\\%\\Delta P = \\frac{\\Delta P}{\\text{Avg } P} = \\frac{-0.50}{4.75} \\approx -0.1053$ (10.53%). $\\text{PED} = \\left|\\frac{\\%\\Delta Q}{\\%\\Delta P}\\right| = \\left|\\frac{0.1395}{0.1053}\\right| \\approx 1.325$."
            },
            {
              "step": "Part (b): Interpret the Coefficient",
              "explanation": "A PED of approximately 1.325 means that for a 1% change in price, the quantity demanded changes by about 1.325% in the opposite direction. More concretely, over this price range, a 10% decrease in price would lead to roughly a 13.25% increase in quantity demanded."
            },
            {
              "step": "Part (c): Categorize Demand",
              "explanation": "Since the calculated PED (1.325) is greater than 1, demand for these lattes is <strong>elastic</strong> over the price range from \\$5.00 to \\$4.50. Consumers are relatively responsive to price changes."
            }
          ],
          "final_answer": "(a) PED ≈ 1.325. (b) Interpretation: A 1% price change leads to approximately a 1.325% change in quantity demanded in the opposite direction. (c) Demand is elastic (PED > 1).",
          "concept_applied": "Use the midpoint formula for consistent calculation. Interpret the coefficient as the proportional responsiveness. Compare to 1 to categorize elasticity."
        }
      ],
      "image": {
        "src": "images/unit4/midpoint_calculation_table.png",
        "alt": "A table showing the step-by-step calculation from the worked example, with columns for Variable, Value, and Calculation.",
        "caption": "Step-by-step calculation using the midpoint formula ensures accuracy and consistency."
      }
    },
    {
      "section_title": "Point Elasticity and Interpretation Nuances",
      "introduction": "While the midpoint formula is ideal for discrete changes, point elasticity measures responsiveness at an exact point on the demand curve. Understanding both methods, and the subtleties of interpreting elasticity, is key to advanced analysis.",
      "key_concept": {
        "definition": "Point Elasticity of Demand is the elasticity at a specific point on the demand curve. It is calculated using the derivative: $\\text{PED} = \\left|\\frac{dQ}{dP} \\times \\frac{P}{Q}\\right|$, where $\\frac{dQ}{dP}$ is the slope of the demand curve at that point. This is essential for non-linear demand curves where elasticity changes at every point.",
        "context": "Point elasticity is used in theoretical models and when the demand function is known. It provides precise elasticity at a given price, rather than an average over a range."
      },
      "principles": [
        {
          "principle": "Calculating Point Elasticity from a Demand Function",
          "statement": "Given a demand function $Q = f(P)$, the point elasticity at a specific price P is: $\\text{PED} = \\left|\\frac{dQ}{dP} \\times \\frac{P}{Q}\\right|$. First, find the derivative $\\frac{dQ}{dP}$ (the slope of the demand curve with respect to price). Then plug in the specific P and the corresponding Q from the demand function.",
          "application": "Used in calculus-based economics and for precise policy analysis where small changes around a point are considered.",
          "example": "Demand: $Q = 100 - 2P$. Derivative: $\\frac{dQ}{dP} = -2$. At $P = \\$20$, $Q = 100 - 2(20) = 60$. Point Elasticity = $\\left|(-2) \\times \\frac{20}{60}\\right| = \\left|-2 \\times 0.333\\right| = 0.667$. Demand is inelastic at $P=\\$20$. Note: This matches the idea that on a linear curve, elasticity increases with price."
        },
        {
          "principle": "Interpreting Extreme and Zero Elasticities",
          "statement": "PED = 0 (Perfectly Inelastic): Quantity is completely unresponsive. The demand curve is vertical. PED = ∞ (Perfectly Elastic): Quantity is infinitely responsive. The demand curve is horizontal. PED = 1 (Unit Elastic): The percentage changes are equal. Total revenue is maximized at the point where demand is unit elastic (for a linear demand curve, this is the midpoint).",
          "application": "These extremes bound real-world possibilities and are useful for understanding competitive markets (perfectly elastic demand for a firm) and markets for absolute necessities.",
          "example": "Perfectly Inelastic: A life-saving medicine. At any price, the patient buys one dose. The burden of a tax falls entirely on the buyer. Perfectly Elastic: A farmer selling wheat at the global market price. She can sell any quantity at \\$5/bushel, but nothing at \\$5.01. The burden of a tax would fall entirely on her (she would have to absorb it and still sell at \\$5)."
        },
        {
          "principle": "Elasticity is Not the Same as Slope",
          "statement": "While a steeper demand curve often suggests more inelastic demand, this is not always true. Elasticity depends on both the slope ($\\frac{dQ}{dP}$) AND the ratio ($\\frac{P}{Q}$). Two curves with the same slope can have different elasticities at the same price if their quantities differ.",
          "application": "Avoid saying 'a steep curve is inelastic.' Instead, calculate or consider the proportional changes.",
          "example": "Curve A: $Q = 100 - P$. Slope = -1. At $P=50$, $Q=50$, Elasticity = $\\left|(-1) \\times \\frac{50}{50}\\right| = 1$. Curve B: $Q = 200 - P$. Slope = -1 (same slope). At $P=50$, $Q=150$, Elasticity = $\\left|(-1) \\times \\frac{50}{150}\\right| = \\frac{1}{3} \\approx 0.33$. Same slope, different elasticity because the $\\frac{P}{Q}$ ratio differs."
        }
      ],
      "worked_examples": [
        {
          "title": "Comparing Arc and Point Elasticity",
          "problem": "Given the demand function $Q = 240 - 20P$. (a) Calculate the point elasticity of demand at $P = \\$5$. (b) Calculate the arc elasticity (using the midpoint formula) for a price decrease from $P = \\$6$ to $P = \\$4$. (c) Compare the two results. Why are they different?",
          "step_by_step": [
            {
              "step": "Part (a): Point Elasticity at P = \\$5",
              "explanation": "First, find Q at $P=5$: $Q = 240 - 20(5) = 240 - 100 = 140$. Next, find the derivative: $\\frac{dQ}{dP} = -20$. Apply the point elasticity formula: $\\text{PED} = \\left|\\frac{dQ}{dP} \\times \\frac{P}{Q}\\right| = \\left|(-20) \\times \\frac{5}{140}\\right| = \\left|(-20) \\times 0.035714\\right| \\approx \\left|-0.7143\\right| = 0.7143$."
            },
            {
              "step": "Part (b): Arc Elasticity from P=\\$6 to P=\\$4",
              "explanation": "Find quantities: At $P=6$, $Q = 240 - 20(6) = 120$. At $P=4$, $Q = 240 - 20(4) = 160$. Now use midpoint formula: $\\Delta Q = 160-120=40$. $\\Delta P = 4-6 = -2$. Avg $Q = \\frac{120+160}{2} = 140$. Avg $P = \\frac{6+4}{2} = 5$. $\\%\\Delta Q = \\frac{40}{140} \\approx 0.2857$ (28.57%). $\\%\\Delta P = \\frac{-2}{5} = -0.4$ (40%). $\\text{PED} = \\left|\\frac{0.2857}{0.4}\\right| = 0.71425$."
            },
            {
              "step": "Part (c): Comparison and Explanation",
              "explanation": "The point elasticity at $P=\\$5$ is approximately 0.7143. The arc elasticity for the range $P=\\$6$ to $P=\\$4$ is approximately 0.71425. They are essentially identical. This is because the demand curve is linear. For a linear demand curve, the arc elasticity over a symmetric interval around a point equals the point elasticity at the midpoint $(P_{\\text{avg}}, Q_{\\text{avg}})$. Here, the midpoint of the arc is $P=\\$5$, $Q=140$, exactly the point where we calculated point elasticity."
            }
          ],
          "final_answer": "(a) Point elasticity at $P=\\$5$ ≈ 0.714. (b) Arc elasticity from $P=\\$6$ to $P=\\$4$ ≈ 0.714. (c) The results are virtually the same because for a linear demand function, the arc elasticity between two points symmetric around a midpoint equals the point elasticity at that midpoint. The average P and Q in the arc formula were exactly the point used in part (a).",
          "concept_applied": "Point elasticity gives a precise measure at a point. Arc elasticity gives an average measure over a segment. For linear demand, they coincide when the arc is centered on the point of interest."
        }
      ],
      "image": {
        "src": "images/unit4/point_vs_arc_elasticity.png",
        "alt": "Graph showing a linear demand curve. Point elasticity is shown as a tangent calculation at a specific point (P*, Q*). Arc elasticity is shown as a calculation between two points on the curve, with the midpoint highlighted.",
        "caption": "Point vs. Arc Elasticity: Point elasticity is at a specific spot; arc elasticity is the average elasticity over a segment. They align for linear curves when the point is the segment's midpoint."
      }
    }
  ],
  "key_terms": [
    "Midpoint formula",
    "Arc elasticity",
    "Point elasticity",
    "Percentage change",
    "Average price",
    "Average quantity",
    "Derivative",
    "dQ/dP",
    "Elasticity coefficient",
    "Interpretation"
  ],
  "summary": "Calculating and interpreting Price Elasticity of Demand requires precise methods to ensure accurate and consistent results. The <strong>midpoint formula (arc elasticity)</strong> is the standard method for calculating elasticity from two observed price-quantity pairs: $\\text{PED} = \\left|\\frac{\\frac{Q_2 - Q_1}{\\frac{Q_1+Q_2}{2}}}{\\frac{P_2 - P_1}{\\frac{P_1+P_2}{2}}}\\right|$. Its key advantage is <strong>symmetry</strong>—it yields the same result whether calculating from point A to B or B to A—because it uses the average of the initial and final values as the base for percentage changes. This avoids the inconsistency of the simple percentage change formula, which depends on the choice of starting point. <strong>Point elasticity</strong> measures elasticity at a specific point on the demand curve and is calculated using calculus: $\\text{PED} = \\left|\\frac{dQ}{dP} \\times \\frac{P}{Q}\\right|$. This is essential when the demand function is known and for analyzing responsiveness to infinitesimally small price changes. For a <strong>linear demand curve</strong>, the point elasticity at the midpoint of any segment equals the arc elasticity calculated over that segment. <strong>Interpretation</strong> of the PED coefficient is straightforward: The coefficient indicates the proportional responsiveness of quantity demanded to price. A PED of 0.5 means a 1% price change leads to a 0.5% quantity change; a PED of 2.0 means a 1% price change leads to a 2% quantity change. The value categorizes demand: <1 is inelastic, >1 is elastic, =1 is unit elastic, 0 is perfectly inelastic, and ∞ is perfectly elastic. Critical nuances to remember: 1. <strong>Elasticity is not slope</strong>, though related. Elasticity depends on both the slope of the demand curve AND the price-quantity ratio ($\\frac{P}{Q}$). 2. For a linear demand curve, <strong>elasticity varies</strong> along the curve—it is elastic at high prices, unit elastic at the midpoint, and inelastic at low prices. 3. The <strong>midpoint formula should be your default</strong> for calculation problems unless specifically asked for point elasticity or simple percentages. Mastering these calculation techniques and interpretations provides the foundation for applying elasticity to real-world problems, such as predicting revenue changes (4.4), understanding tax incidence (4.9), and making pricing decisions."
}
