{
  "expanded_description": "Cross Price Elasticity of Demand (XED) measures the responsiveness of the quantity demanded for one good to a change in the price of another good. It quantifies the relationship between two different products, revealing whether they are substitutes, complements, or unrelated. This measure is vital for businesses analyzing competitive markets, planning pricing strategies, and anticipating the impact of competitors' price changes or supply chain shocks.",
  "core_concept": {
    "principle": "Cross Price Elasticity of Demand (XED) is the ratio of the percentage change in quantity demanded of Good A to the percentage change in price of Good B. The formula is: $XED = \\frac{\\% \\Delta Q_d^A}{\\% \\Delta P^B}$. The sign of XED is critically important: Positive XED ($XED > 0$) indicates the goods are substitutes. Negative XED ($XED < 0$) indicates the goods are complements. Zero or near-zero XED ($XED \\approx 0$) indicates the goods are unrelated or independent. The magnitude of XED indicates the strength of the substitute or complement relationship.",
    "explanation": "XED helps answer questions like: 'If the price of Coca-Cola rises, how much will demand for Pepsi increase?' (substitutes) or 'If the price of gaming consoles falls, how much will demand for video games increase?' (complements).<br><br>The calculation typically uses the midpoint formula for accuracy: $XED = \\frac{(Q_{A2} - Q_{A1}) / ((Q_{A1}+Q_{A2})/2)}{(P_{B2} - P_{B1}) / ((P_{B1}+P_{B2})/2)}$.<br><br>Interpreting XED requires careful labeling: XED of Good A with respect to the price of Good B. This is not symmetric; $XED_{AB}$ is not necessarily equal to $XED_{BA}$, though they usually have the same sign."
  },
  "sections": [
    {
      "section_title": "Calculating and Interpreting XED: Sign and Relationship",
      "introduction": "The sign of XED is the primary indicator of the economic relationship between two goods. Calculating XED follows the same midpoint approach as other elasticities, but interpretation focuses on whether the value is positive, negative, or zero.",
      "key_concept": {
        "definition": "$XED = \\frac{\\%\\Delta Q_d^A}{\\%\\Delta P^B}$. Key interpretation: $XED > 0$ → Substitutes. $XED < 0$ → Complements. $XED \\approx 0$ → Independent goods.",
        "context": "This measure is essential for market definition in antitrust analysis, assessing competitive threats, and product portfolio management."
      },
      "principles": [
        {
          "principle": "Positive XED: Substitute Goods",
          "statement": "When $XED > 0$, an increase in the price of Good B leads to an increase in demand for Good A. Consumers substitute away from the now more expensive Good B toward Good A. The larger the positive XED, the closer the substitutes.",
          "application": "Used to identify competitive products. A firm monitoring competitors' prices needs to know the XED between its product and rivals' products.",
          "example": "Butter and margarine are substitutes. If the price of butter increases by 10%, the quantity demanded for margarine might increase by 8%. $XED = 0.8$ (positive, indicating substitutes). Coca-Cola and Pepsi are very close substitutes; their XED would be a large positive number (e.g., 2.0 or higher)."
        },
        {
          "principle": "Negative XED: Complementary Goods",
          "statement": "When $XED < 0$, an increase in the price of Good B leads to a decrease in demand for Good A. The goods are consumed together, so when one becomes more expensive, demand for both falls. The more negative the XED, the stronger the complementarity.",
          "application": "Important for pricing complementary goods (e.g., printers and ink, smartphones and apps). A price cut on one can boost demand for the other.",
          "example": "Hot dogs and hot dog buns are complements. If the price of hot dogs increases by 20%, the quantity demanded for buns might decrease by 15%. $XED = -0.75$ (negative, indicating complements). Gaming consoles and video games have a strongly negative XED."
        },
        {
          "principle": "Zero XED: Independent Goods",
          "statement": "When $XED \\approx 0$, changes in the price of Good B have no discernible effect on the demand for Good A. The goods are unrelated in consumption.",
          "application": "Indicates markets are separate; a price change in one industry won't affect the other.",
          "example": "The price of carrots and the demand for shoes likely have an XED near zero. They are independent goods with no consumption relationship."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating XED and Determining Product Relationship",
          "problem": "When the price of coffee increased from \\$4 to \\$5 per cup, the quantity demanded for tea increased from 100 to 120 cups per day at a cafe. (a) Calculate the Cross Price Elasticity of Demand for tea with respect to the price of coffee. (b) Interpret the sign and magnitude. (c) What is the relationship between coffee and tea?",
          "step_by_step": [
            {
              "step": "Part (a): Calculate XED using midpoint formula",
              "explanation": "Good A = Tea, Good B = Coffee. $\\%\\Delta Q_{Tea} = \\frac{120 - 100}{(100+120)/2} = \\frac{20}{110} \\approx 0.1818$ (18.18%). $\\%\\Delta P_{Coffee} = \\frac{5 - 4}{(4+5)/2} = \\frac{1}{4.5} \\approx 0.2222$ (22.22%). $XED = \\frac{0.1818}{0.2222} \\approx 0.818$."
            },
            {
              "step": "Part (b): Interpret sign and magnitude",
              "explanation": "The XED is positive (0.818). This means that when the price of coffee rises, the quantity demanded for tea increases. The magnitude of 0.818 indicates that for every 1% increase in coffee price, tea demand increases by about 0.818%."
            },
            {
              "step": "Part (c): Determine the relationship",
              "explanation": "Since $XED > 0$, coffee and tea are substitute goods. They are moderately strong substitutes (XED is not negligible but also not extremely high)."
            }
          ],
          "final_answer": "(a) $XED \\approx 0.818$. (b) Positive XED: Tea demand increases when coffee price rises. A 1% coffee price hike leads to a ~0.82% increase in tea demand. (c) Coffee and tea are substitutes.",
          "concept_applied": "Use midpoint formula. Positive XED indicates substitutes; negative indicates complements. The magnitude indicates strength of relationship."
        }
      ]
    },
    {
      "section_title": "Applications and Strategic Implications of XED",
      "introduction": "Beyond classification, XED has powerful applications in business strategy, market analysis, and antitrust policy. Understanding the cross-price relationships in a market helps firms make informed decisions about pricing, product positioning, and competitive response.",
      "key_concept": {
        "definition": "XED is used for: 1. Market definition in antitrust/merger review (high positive XED indicates products are in the same market). 2. Pricing strategy for complements and substitutes. 3. Forecasting demand impacts of competitors' actions or input price shocks. 4. Product portfolio management to avoid cannibalization.",
        "context": "In practice, firms often estimate XED through market experiments, historical data analysis, or consumer surveys."
      },
      "principles": [
        {
          "principle": "Market Definition and Merger Analysis",
          "statement": "Antitrust authorities use XED to define the relevant market. If two products have a high positive XED, they are considered close substitutes and belong to the same product market. A proposed merger between their producers would raise monopoly concerns.",
          "application": "The Department of Justice or Federal Trade Commission may block mergers if evidence shows high XED between the merging firms' products.",
          "example": "If Company A (makes a branded drug) wants to acquire Company B (makes a generic version), regulators will examine XED. If $XED$ is high (e.g., 3.0), they are very close substitutes, and the merger could significantly reduce competition, leading to higher prices. The merger might be blocked or require divestitures."
        },
        {
          "principle": "Pricing Strategies for Complements and Substitutes",
          "statement": "For complements: Firms may use a razor-and-blades model—price the primary good low (razor) to boost demand for the high-margin complementary good (blades). For substitutes: Firms must consider competitor reactions; a price cut might trigger a price war if XED is high.",
          "application": "Setting prices in product ecosystems (e.g., printers/ink, consoles/games) or in competitive markets (airlines, gasoline).",
          "example": "A video game console maker sells consoles at a loss (or low margin) because the XED between consoles and games is strongly negative. Lower console prices increase console sales, which dramatically increases demand for their high-margin games. Conversely, an airline knows demand for its flights has high positive XED with a competitor's flights on the same route. A fare sale will likely be matched, benefiting consumers but potentially hurting profits for both."
        },
        {
          "principle": "Forecasting and Competitive Intelligence",
          "statement": "Firms can predict how changes in the price of a related good (input, competitor's product, complement) will affect their own sales using estimated XED.",
          "application": "Business planning, revenue forecasting, and risk assessment.",
          "example": "A car manufacturer knows that demand for its large SUVs has a negative XED with the price of gasoline. If the firm forecasts rising gas prices, it can use the XED to predict the potential drop in SUV demand and adjust production plans accordingly. A smartphone case manufacturer knows its demand has a strong negative XED with the price of smartphones. A successful new phone launch at a competitive price will boost case sales."
        }
      ],
      "worked_examples": [
        {
          "title": "Strategic Pricing Decision Using XED",
          "problem": "A company sells two products: a high-end wireless speaker (Product S) and a streaming music subscription service (Product M). Market research estimates the XED of the service with respect to the speaker price is -1.5. Currently, they sell 10,000 speakers at \\$300 each and 15,000 subscriptions at \\$10/month. They are considering a 10% price cut on the speaker to \\$270. (a) Predict the effect on the quantity demanded of the music subscription. (b) If the goal is to increase total revenue from the subscription service, is this speaker price cut a good idea based solely on this XED? (Assume no change in subscription price.)",
          "step_by_step": [
            {
              "step": "Part (a): Predict change in subscription demand",
              "explanation": "$XED = \\frac{\\%\\Delta Q_M}{\\%\\Delta P_S} = -1.5$. $\\%\\Delta P_S = -10\\%$ (price cut). So, $-1.5 = \\frac{\\%\\Delta Q_M}{-10\\%}$. Therefore, $\\%\\Delta Q_M = (-1.5) \\times (-10\\%) = +15\\%$. The quantity of music subscriptions demanded is predicted to increase by 15%."
            },
            {
              "step": "Part (b): Analyze subscription revenue impact",
              "explanation": "Old subscription revenue: $10 \\times 15,000 = \\$150,000$ per month. New subscription quantity: $15,000 \\times 1.15 = 17,250$. New subscription revenue: $10 \\times 17,250 = \\$172,500$ per month. Subscription revenue increases by $\\$22,500$ (15%). Based solely on the subscription revenue, the speaker price cut appears beneficial as it drives higher subscription sales. However, a full analysis must also consider the lost revenue from selling speakers at a lower price."
            }
          ],
          "final_answer": "(a) The quantity demanded for the music subscription is predicted to increase by 15%. (b) Yes, based solely on the goal of increasing subscription revenue, the speaker price cut is a good idea, as it would raise subscription revenue by 15% (from $\\$150,000$ to $\\$172,500$ monthly). However, a complete business decision requires analyzing the combined profitability of both products.",
          "concept_applied": "$XED = \\frac{\\%\\Delta Q_A}{\\%\\Delta P_B}$. Rearrange to find $\\%\\Delta Q_A$. Apply to revenue calculation. For complementary goods (negative XED), a price cut on one increases demand for the other."
        }
      ]
    }
  ],
  "key_terms": [
    "Cross Price Elasticity of Demand (XED)",
    "Substitute goods",
    "Complementary goods",
    "Independent goods",
    "Midpoint formula",
    "Market definition",
    "Antitrust",
    "Merger analysis",
    "Pricing strategy",
    "Product portfolio"
  ],
  "summary": "Cross Price Elasticity of Demand (XED) measures how the quantity demanded of one good responds to a price change in another good. Calculated as $XED = \\frac{\\%\\Delta Q_d^A}{\\%\\Delta P^B}$, its sign reveals the fundamental relationship between the goods.<br><br>Positive XED ($XED > 0$) indicates the goods are substitutes. An increase in the price of Good B leads to an increase in demand for Good A as consumers switch. The magnitude indicates the closeness of substitution; a higher positive value means closer substitutes (e.g., different brands of cola).<br><br>Negative XED ($XED < 0$) indicates the goods are complements. An increase in the price of Good B leads to a decrease in demand for Good A because the goods are used together. The more negative the value, the stronger the complementarity (e.g., printers and ink).<br><br>Zero or near-zero XED ($XED \\approx 0$) indicates independent goods with no consumption relationship (e.g., butter and shoes).<br><br>Applications of XED are extensive: 1. Market Definition: Antitrust authorities use high positive XED to define relevant product markets for merger review. 2. Business Strategy: Firms use XED to set prices for complementary products (e.g., razors and blades) or to anticipate competitive responses from substitutes. 3. Forecasting: Companies predict demand changes for their products based on price movements of related goods (inputs, competitors' products).<br><br>XED, together with Price Elasticity of Demand ($PED$) and Income Elasticity of Demand ($YED$), forms a complete toolkit for analyzing demand-side responsiveness. While $PED$ measures sensitivity to own-price, and $YED$ measures sensitivity to income, $XED$ measures sensitivity to the price of another good, completing our understanding of the factors that shift and move along demand curves."
}


