{
  "expanded_description": "Price Elasticity of Supply (PES) measures how responsive the quantity supplied is to price changes. While the calculation is mathematical, the underlying determinants explain why some products have elastic supply (responsive) while others have inelastic supply (unresponsive). These determinants are rooted in production realities, time constraints, and market structures.",
  "core_concept": {
    "principle": "The elasticity of supply depends on producers' ability to adjust production when prices change. This adjustment capability is constrained by: (1) the time available to respond, (2) availability of spare capacity, (3) mobility of production factors, (4) complexity of production, (5) ability to store inventory, and (6) market entry barriers.",
    "explanation": "When prices rise, producers want to supply more to earn higher profits. However, practical constraints limit their ability to actually increase quantity supplied. A farmer cannot instantly grow more wheat—it takes a growing season. A factory cannot immediately double production without building new facilities. These real-world constraints determine whether supply is elastic (responsive) or inelastic (unresponsive). Understanding these determinants helps predict market responses, analyze price volatility, and explain industry differences.",
    "image": {
      "src": "images/unit4/determinants_pes.png",
      "alt": "Diagram showing six determinants of supply elasticity radiating from central 'PES' concept",
      "caption": "Primary factors determining price elasticity of supply"
    }
  },
  "sections": [
    {
      "section_title": "Determinant 1: Time Horizon",
      "introduction": "The time available for adjustment is the most important determinant of supply elasticity. Supply becomes more elastic as producers have more time to respond.",
      "key_concept": {
        "definition": "Time horizon refers to how long producers have to adjust production. Economists analyze three periods: immediate run (market period), short run, and long run.",
        "context": "Production adjustments require time. Building factories, growing crops, training workers, or developing new technologies cannot happen instantly. The longer the time period, the more adjustments become possible."
      },
      "categories": [
        {
          "type": "Immediate Run (Market Period)",
          "description": "Time period so short that production cannot be adjusted at all.",
          "examples": [
            {
              "process": "Fixed supply situations",
              "explanation": "Quantity supplied cannot change regardless of price. Example: Concert tonight—venue capacity fixed. Fisherman's daily catch—already caught. Agricultural harvest—already harvested for the season."
            },
            {
              "process": "Perfectly inelastic supply",
              "explanation": "PES = 0. Vertical supply curve. Price changes do not affect quantity supplied in immediate period. Example: Once a theater show starts, no more tickets can be created even if people offer \\$1000 per ticket."
            },
            {
              "process": "Market consequences",
              "explanation": "Demand changes cause large price swings since quantity cannot adjust. Example: Sudden cold snap increases heating oil demand, but supply fixed in short term → prices spike dramatically."
            }
          ]
        },
        {
          "type": "Short Run",
          "description": "Period where some factors are variable (labor, materials) but others are fixed (factories, land).",
          "examples": [
            {
              "process": "Partial adjustment possible",
              "explanation": "Firms can adjust variable inputs but constrained by fixed capacity. Example: Factory can add overtime shifts but cannot build new factory. Restaurant can extend hours but cannot add dining space quickly."
            },
            {
              "process": "Somewhat elastic supply",
              "explanation": "0 < PES < 1 typically. Upward-sloping but relatively steep supply curve. Example: Car manufacturer can increase production by 10% with overtime when prices rise 20% (PES = 0.5)."
            },
            {
              "process": "Capacity constraints bind",
              "explanation": "Maximum output limited by existing plant and equipment. Example: Microchip factory operating at 95% capacity can increase to 100% but cannot exceed physical limits without expansion."
            }
          ]
        },
        {
          "type": "Long Run",
          "description": "Period long enough for all factors to become variable—new factories, technology adoption, market entry/exit.",
          "examples": [
            {
              "process": "Full adjustment possible",
              "explanation": "Firms can build new capacity, adopt new technologies, enter or exit industry. Example: High solar panel prices for several years lead to new factories, technological improvements, more firms entering market."
            },
            {
              "process": "Highly elastic supply",
              "explanation": "PES > 1, often much greater. Relatively flat supply curve. Example: Housing supply inelastic in short run (can't instantly build), but elastic in long run (5 years to build new subdivisions)."
            },
            {
              "process": "Market equilibrium restoration",
              "explanation": "Long-run supply often very elastic, meaning prices tend toward production costs. Example: Fracking technology made US oil supply more elastic long-term, reducing price volatility."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Supply Elasticity Increases Over Time",
          "statement": "For nearly all goods, supply becomes more elastic as the adjustment period lengthens. Immediate run: perfectly inelastic. Short run: somewhat elastic. Long run: highly elastic.",
          "application": "When analyzing price changes, always specify time horizon. Policy impacts differ dramatically between short and long run.",
          "example": "Oil market: Immediate—supply fixed (PES = 0). Short run (months)—some increased drilling (PES = 0.1). Long run (years)—new technologies, alternative energy (PES = 0.5+)."
        }
      ],
      "worked_examples": [
        {
          "title": "Time Horizon and Agricultural Supply",
          "problem": "Why is the supply of oranges perfectly inelastic immediately after harvest but becomes more elastic over time?",
          "step_by_step": [
            {
              "step": "Immediate run analysis",
              "explanation": "Once oranges are harvested, this year's crop is fixed. No amount of price increase can create more oranges from this harvest. Supply perfectly inelastic (PES = 0)."
            },
            {
              "step": "Short run analysis (next growing season)",
              "explanation": "Farmers can adjust next season's planting. If orange prices remain high, they might plant more orange trees. But oranges take years to mature, so supply response limited in first year."
            },
            {
              "step": "Long run analysis (5+ years)",
              "explanation": "With sustained high prices, new orchards mature, more land converted to oranges, better varieties developed. Supply becomes more elastic as full adjustment occurs."
            },
            {
              "step": "Market implication",
              "explanation": "Orange prices very volatile season-to-season (supply fixed after harvest) but more stable over decade (supply adjusts to demand trends)."
            }
          ],
          "final_answer": "Orange supply is perfectly inelastic immediately after harvest because the crop is fixed. It becomes somewhat elastic in the short run as farmers adjust next season's planting. It becomes more elastic in the long run as new orchards mature and production methods improve. The time horizon fundamentally changes supply elasticity.",
          "concept_applied": "Time horizon is critical determinant of supply elasticity. Biological production processes (like agriculture) particularly demonstrate how elasticity increases with time for adjustment."
        }
      ]
    },
    {
      "section_title": "Determinant 2: Spare Production Capacity",
      "introduction": "The amount of unused production capacity determines how quickly output can increase when prices rise.",
      "key_concept": {
        "definition": "Spare capacity refers to unused production capability. High spare capacity means firms can increase output quickly without major investment.",
        "context": "Firms rarely operate at 100% capacity. Maintaining spare capacity provides flexibility to respond to demand increases, making supply more elastic."
      },
      "categories": [
        {
          "type": "High Spare Capacity",
          "description": "Substantial unused production capability exists.",
          "examples": [
            {
              "process": "Quick output expansion",
              "explanation": "Can increase production rapidly with minimal cost increases. Example: Hotel with many empty rooms can fill them immediately when demand increases. Factory operating at 60% capacity can ramp up to 90% quickly."
            },
            {
              "process": "Elastic supply result",
              "explanation": "High spare capacity creates elastic supply (PES > 1 often). Small price increases elicit large quantity increases. Example: Airline with half-empty plane can sell many more tickets without cost increase."
            },
            {
              "process": "Recession conditions",
              "explanation": "During economic downturns, many industries have high spare capacity, making supply elastic. Example: 2009 auto plants at 50% capacity could increase production easily if demand returned."
            }
          ]
        },
        {
          "type": "Low Spare Capacity",
          "description": "Firms operating near maximum capacity limits.",
          "examples": [
            {
              "process": "Constrained output expansion",
              "explanation": "Increasing output requires expensive expansion. Example: Semiconductor fabs at 98% capacity need new $10 billion factories to increase supply. Restaurant at full capacity needs physical expansion to serve more customers."
            },
            {
              "process": "Inelastic supply result",
              "explanation": "Low spare capacity creates inelastic supply (PES < 1). Price increases yield small quantity increases. Example: Electricity grid during heat wave—all plants at maximum, cannot produce more regardless of price."
            },
            {
              "process": "Boom conditions",
              "explanation": "During economic expansions, many industries reach capacity limits, making supply inelastic. Example: 2021 microchip shortage—factories at full capacity, supply couldn't meet surging demand despite high prices."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Capacity Utilization Determines Short-Run Elasticity",
          "statement": "The same industry has different supply elasticity at different capacity utilization levels. High utilization → inelastic supply. Low utilization → elastic supply.",
          "application": "Business cycles affect supply elasticity. Recessions create elastic supply conditions; booms create inelastic supply conditions.",
          "example": "Steel industry: 2009 recession—operating at 50% capacity, supply elastic (PES ≈ 1.2). 2021 recovery—operating at 90% capacity, supply inelastic (PES ≈ 0.3)."
        }
      ]
    },
    {
      "section_title": "Determinant 3: Factor Mobility and Production Complexity",
      "introduction": "How easily resources can move between uses and how complex production is affect supply adjustment capability.",
      "key_concept": {
        "definition": "Factor mobility refers to how easily resources (labor, capital) can shift between different productions. Production complexity includes time requirements, technical difficulty, and coordination needs.",
        "context": "If wheat prices rise, farmers need suitable land, equipment, and knowledge to grow more wheat. If these resources are specialized or production is complex, supply response is limited."
      },
      "categories": [
        {
          "type": "High Factor Mobility",
          "description": "Resources easily switch between producing different goods.",
          "examples": [
            {
              "process": "Quick resource reallocation",
              "explanation": "Labor and capital can move to higher-priced production. Example: Unskilled workers shift from retail to restaurants if wages rise. General machinery switches from making appliances to auto parts."
            },
            {
              "process": "Elastic supply effect",
              "explanation": "High mobility creates elastic supply. Resources flow to where returns are highest. Example: Multipurpose farmland—farmers switch crops based on price signals each season."
            }
          ]
        },
        {
          "type": "Low Factor Mobility/High Complexity",
          "description": "Resources specialized or production process lengthy/complex.",
          "examples": [
            {
              "process": "Specialized resources",
              "explanation": "Resources trapped in current use. Example: Brain surgeon cannot become software engineer quickly. Oil refinery cannot produce smartphones. Vineyard land only suitable for grapes."
            },
            {
              "process": "Complex production processes",
              "explanation": "Lengthy lead times, many stages. Example: Commercial aircraft take 2-3 years to build. Fine wine requires years of aging. Skyscrapers need years of construction."
            },
            {
              "process": "Inelastic supply effect",
              "explanation": "Specialization and complexity create inelastic supply. Example: Diamond mining—limited deposits, specialized equipment → supply inelastic despite high prices."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Comparing Software vs. Aircraft Supply",
          "problem": "Why is software supply highly elastic while commercial aircraft supply is highly inelastic?",
          "step_by_step": [
            {
              "step": "Analyze software production",
              "explanation": "Digital goods: Once developed, marginal cost near zero. Can be reproduced instantly. No physical constraints. Factors: Programmers relatively mobile, general skills. Result: Supply perfectly elastic (horizontal curve) beyond development cost."
            },
            {
              "step": "Analyze aircraft production",
              "explanation": "Physical goods: Each plane takes 2-3 years, millions of parts, global supply chain. Factors: Specialized factories, trained engineers, huge capital. Result: Supply highly inelastic—cannot quickly increase output."
            },
            {
              "step": "Compare determinants",
              "explanation": "Time: Software—instant reproduction. Aircraft—years per unit. Complexity: Software—code writing. Aircraft—extreme engineering. Factor mobility: Software—general computers. Aircraft—specialized factories."
            },
            {
              "step": "Market consequences",
              "explanation": "Software: Small price changes cause large quantity adjustments. Aircraft: Large price changes cause small quantity adjustments. Airlines must order planes years in advance."
            }
          ],
          "final_answer": "Software supply is elastic because: digital reproduction is instant and costless, production factors are mobile, and there are no physical constraints. Aircraft supply is inelastic because: each unit takes years to build, production is extremely complex, resources are highly specialized, and capacity is limited. These differences explain why software prices tend toward marginal cost (near zero) while aircraft prices are high and quantities adjust slowly.",
          "concept_applied": "Production complexity and factor specialization dramatically affect supply elasticity. Digital vs. physical goods represent extremes of the elasticity spectrum due to fundamentally different production processes."
        }
      ]
    },
    {
      "section_title": "Determinant 4: Storability and Inventory",
      "introduction": "Ability to store products affects supply elasticity by allowing temporal separation of production and sales.",
      "key_concept": {
        "definition": "Storability refers to how easily goods can be kept in inventory. Storable goods have more elastic supply because producers can adjust sales timing relative to production.",
        "context": "If you can store your product, you can produce at constant rates but sell more when prices are high (drawing down inventory) and less when prices are low (building inventory)."
      },
      "categories": [
        {
          "type": "Highly Storable Goods",
          "description": "Goods that can be stored long-term with minimal cost or quality loss.",
          "examples": [
            {
              "process": "Inventory buffering",
              "explanation": "Producers can build inventory during low-demand periods, sell from inventory during high-demand periods. Example: Grain in silos, metals in warehouses, canned goods in distribution centers."
            },
            {
              "process": "Elastic supply effect",
              "explanation": "Storage creates supply elasticity. Measured supply (quantity sold) responds to price even if production constant. Example: Oil companies draw down strategic reserves when prices spike, increasing quantity supplied without increasing production."
            },
            {
              "process": "Price stabilization",
              "explanation": "Inventories buffer price fluctuations. Example: Copper traders buy when prices low (add to inventory), sell when prices high (draw from inventory), smoothing prices."
            }
          ]
        },
        {
          "type": "Perishable/Non-storable Goods",
          "description": "Goods that cannot be stored or only at high cost.",
          "examples": [
            {
              "process": "Must sell when produced",
              "explanation": "No inventory buffer possible. Example: Fresh fish spoils quickly. Electricity cannot be stored economically at scale. Services (haircuts) cannot be inventoried."
            },
            {
              "process": "Inelastic supply effect",
              "explanation": "No storage option forces immediate sale regardless of price. Example: Fisherman must sell daily catch even if prices low tomorrow might be better. Supply inelastic."
            },
            {
              "process": "Price volatility",
              "explanation": "Lack of storage increases price swings. Example: Fresh produce prices fluctuate daily based on immediate supply and demand. Flowers after Valentine's Day—prices crash as must sell immediately."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Storage Creates Supply Flexibility",
          "statement": "The ability to inventory goods effectively makes supply more elastic by allowing producers to separate production decisions from sales timing.",
          "application": "Industries with large inventory capacity show more price-responsive supply. Inventory-to-sales ratios indicate potential elasticity.",
          "example": "Automobile dealers hold 60-day inventory. When demand surges, they sell from inventory while factories ramp up. Makes auto supply more elastic than if cars were made-to-order only."
        }
      ]
    }
  ],
  "key_terms": [
    "Time horizon",
    "Immediate run",
    "Short run",
    "Long run",
    "Spare capacity",
    "Capacity utilization",
    "Factor mobility",
    "Specialized resources",
    "Production complexity",
    "Storability",
    "Inventory buffer",
    "Perishable goods",
    "Barriers to entry"
  ],
  "summary": "Price Elasticity of Supply depends on producers' ability to adjust quantity when prices change. Key determinants include: (1) Time Horizon—supply becomes more elastic with more adjustment time (immediate: perfectly inelastic; short run: somewhat elastic; long run: highly elastic). (2) Spare Capacity—when firms operate below maximum capacity, supply is elastic; at full capacity, supply becomes inelastic. (3) Factor Mobility—resources that easily shift between uses create elastic supply; specialized, immobile resources create inelastic supply. (4) Production Complexity—simple, quick processes yield elastic supply; complex, lengthy processes yield inelastic supply. (5) Storability—goods that can be inventoried have more elastic supply because inventories buffer production from sales timing; perishable goods have inelastic supply. These determinants interact to explain why different industries have different supply elasticities: software (highly elastic) vs. commercial aircraft (highly inelastic); fresh flowers (inelastic) vs. canned soup (elastic). Understanding these factors enables prediction of market responses, analysis of price volatility, and evaluation of how industries will respond to demand changes or policy interventions over different time horizons."
}
