{
  "expanded_description": "The relationship between Price Elasticity of Demand (PED) and Total Revenue (TR) is fundamental to business strategy and economic policy. Total Revenue, calculated as $TR = P \\times Q$, changes when price changes, but the direction of that change depends on how responsive quantity demanded is—that is, on the elasticity of demand. Understanding this relationship allows firms to set profit-maximizing prices, helps governments predict tax revenue, and explains paradoxical market outcomes where price and revenue move in opposite directions.",
  "core_concept": {
    "principle": "The effect of a price change on total revenue is determined by the price elasticity of demand at the current price point. The rule is: 1. If demand is **elastic** ($PED > 1$): Price and total revenue move in **opposite** directions. A price increase decreases total revenue; a price decrease increases total revenue. 2. If demand is **inelastic** ($PED < 1$): Price and total revenue move in the **same** direction. A price increase increases total revenue; a price decrease decreases total revenue. 3. If demand is **unit elastic** ($PED = 1$): Total revenue remains **unchanged** when price changes. Revenue is maximized at the point where demand is unit elastic (for a linear demand curve, this is the midpoint).",
    "explanation": "This relationship exists because total revenue is the product of price and quantity. When you change price, you cause a movement along the demand curve, changing quantity in the opposite direction. The net effect on their product ($P \\times Q$) depends on which change is proportionally larger.<br><br>**Elastic Demand**: The percentage change in quantity ($|\\%\\Delta Q$) exceeds the percentage change in price ($|\\%\\Delta P|$). Therefore, the quantity effect dominates. Lowering price causes such a large increase in sales that revenue rises despite the lower price per unit.<br><br>**Inelastic Demand**: The percentage change in quantity ($|\\%\\Delta Q$) is less than the percentage change in price ($|\\%\\Delta P|$). Therefore, the price effect dominates. Raising price causes such a small drop in sales that revenue increases.<br><br>This principle explains why farmers might have a bad year when they have a bumper crop (price falls sharply due to high supply, but demand is inelastic, so revenue falls), and why luxury brands don't simply keep raising prices indefinitely (eventually demand becomes elastic, and further price hikes would reduce revenue)."
  },
  "sections": [
    {
      "section_title": "The Revenue-Elasticity Rule and Its Logic",
      "introduction": "The mathematical relationship between elasticity and revenue can be derived and understood intuitively. Mastering this rule is essential for applying elasticity to real-world decision-making.",
      "key_concept": {
        "definition": "The link between a price change ($\\Delta P$), the resulting quantity change ($\\Delta Q$), and the change in total revenue ($\\Delta TR$) is given by: $\\Delta TR \\approx Q \\times \\Delta P + P \\times \\Delta Q$. The first term ($Q \\times \\Delta P$) is the **price effect** (revenue gain from selling the original quantity at a higher price). The second term ($P \\times \\Delta Q$) is the **quantity effect** (revenue loss from selling fewer units at the original price). Elasticity determines which effect is larger.",
        "context": "This decomposition shows the trade-off at the heart of any pricing decision: charging more per unit vs. selling fewer units."
      },
      "principles": [
        {
          "principle": "Elastic Demand: Quantity Effect Dominates",
          "statement": "When $PED > 1$, $|\\%\\Delta Q| > |\\%\\Delta P|$. In the revenue change formula, the quantity effect ($P \\times \\Delta Q$) is larger in magnitude than the price effect ($Q \\times \\Delta P$). Therefore, if price increases (positive $\\Delta P$), the large negative $\\Delta Q$ causes $\\Delta TR$ to be negative.",
          "application": "For goods with elastic demand, firms should generally avoid price increases if their goal is revenue maximization. Promotions and discounts are effective at boosting revenue.",
          "example": "Streaming Service: Suppose demand is elastic (PED = 2.0). At a monthly price of $P = \\$10$, $Q = 1$ million subscribers. $TR = \\$10$ million. If they raise price by 10% to $\\$11$, quantity falls by 20% to 0.8 million. New $TR = \\$11 \\times 0.8M = \\$8.8$ million. Revenue fell because the 20% drop in customers outweighed the 10% higher price. Conversely, a 10% price cut to $\\$9$ would increase quantity by 20% to 1.2M, raising $TR$ to $\\$10.8$ million."
        },
        {
          "principle": "Inelastic Demand: Price Effect Dominates",
          "statement": "When $PED < 1$, $|\\%\\Delta Q| < |\\%\\Delta P|$. In the revenue change formula, the price effect ($Q \\times \\Delta P$) is larger in magnitude than the quantity effect ($P \\times \\Delta Q$). Therefore, a price increase leads to a positive $\\Delta TR$.",
          "application": "For goods with inelastic demand, firms (or governments via taxes) can increase price to raise revenue, with only a modest loss in sales volume.",
          "example": "Cigarettes (inelastic demand, PED ≈ 0.4). At $P = \\$8/pack$, $Q = 100$ million packs. $TR = \\$800$M. A $\\$1$ tax increases price to $\\$9$ (12.5% increase). Quantity falls by 5% (0.4 × 12.5%) to 95M packs. New $TR = \\$9 \\times 95M = \\$855$M. Revenue increased by $\\$55$M because the price increase more than offset the modest sales decline."
        },
        {
          "principle": "Unit Elastic Demand: Effects Exactly Offset",
          "statement": "When $PED = 1$, $|\\%\\Delta Q| = |\\%\\Delta P|$. The positive price effect and negative quantity effect are equal in magnitude, so $\\Delta TR = 0$. Total revenue is maximized at the point where demand is unit elastic.",
          "application": "If a firm's current price is at the unit-elastic point, any price change (up or down) will decrease total revenue. This is the revenue-maximizing price.",
          "example": "Linear Demand Curve: $Q = 100 - 2P$. Total Revenue $TR = P \\times (100 - 2P) = 100P - 2P^2$. This is a parabola. Taking derivative $dTR/dP = 100 - 4P$. Set = 0 to maximize: $P = 25$. At $P=25$, $Q=50$, $PED = 1$ (you can verify). At this point, $TR = \\$1250$ is maximum. If price increases to $\\$30$, $Q=40$, $TR=\\$1200$. If price decreases to $\\$20$, $Q=60$, $TR=\\$1200$. Both moves away from $P=25$ reduce revenue."
        }
      ],
      "worked_examples": [
        {
          "title": "Applying the Revenue-Elasticity Rule",
          "problem": "A university estimates the price elasticity of demand for student parking permits to be 0.8 at the current price of $\\$200$ per semester. Currently, 10,000 permits are sold. (a) Is demand elastic or inelastic? (b) If the university raises the permit price by 10%, what will be the approximate percentage change in quantity demanded? (c) Calculate the new total revenue and the change in revenue. Does the result confirm the rule?",
          "step_by_step": [
            {
              "step": "Part (a): Categorize Elasticity",
              "explanation": "Given $PED = 0.8$. Since $0.8 < 1$, demand is **inelastic**."
            },
            {
              "step": "Part (b): Predict Quantity Change",
              "explanation": "Using the formula $PED = |\\%\\Delta Q / \\%\\Delta P|$. Here, $\\%\\Delta P = +10\\%$, $PED = 0.8$. So, $0.8 = |\\%\\Delta Q| / 10$. Therefore, $|\\%\\Delta Q| = 0.8 \\times 10 = 8\\%$. Since price increased, quantity demanded will decrease. So, $\\%\\Delta Q = -8\\%$."
            },
            {
              "step": "Part (c): Calculate New Revenue and Change",
              "explanation": "Old Revenue: $TR_{old} = P \\times Q = 200 \\times 10,000 = \\$2,000,000$.\nNew Price: $P_{new} = 200 \\times 1.10 = \\$220$.\nNew Quantity: $Q_{new} = 10,000 \\times (1 - 0.08) = 10,000 \\times 0.92 = 9,200$ permits.\nNew Revenue: $TR_{new} = 220 \\times 9,200 = \\$2,024,000$.\nChange in Revenue: $\\Delta TR = 2,024,000 - 2,000,000 = \\$24,000$ (an increase)."
            },
            {
              "step": "Part (c): Confirm the Rule",
              "explanation": "The rule states: For inelastic demand, a price increase should lead to a revenue increase. Our calculation shows exactly that: a 10% price increase led to an 8% quantity decrease, and total revenue rose by $\\$24,000$. This confirms the rule."
            }
          ],
          "final_answer": "(a) Demand is inelastic (PED = 0.8 < 1). (b) Quantity demanded will decrease by approximately 8%. (c) New total revenue is $\\$2,024,000$, an increase of $\\$24,000$. This confirms the rule that with inelastic demand, price and total revenue move in the same direction.",
          "concept_applied": "Use the PED definition to find the quantity response. Calculate new TR = New P × New Q. The revenue-elasticity rule predicts the direction of the TR change: for inelastic demand, TR increases when P increases."
        }
      ]
    },
    {
      "section_title": "Total Revenue Curve and Maximization",
      "introduction": "The relationship between price and total revenue can be visualized graphically. For a linear demand curve, the total revenue curve is an inverted parabola, clearly showing the revenue-maximizing point where elasticity equals 1.",
      "key_concept": {
        "definition": "When demand is linear ($Q = a - bP$), total revenue ($TR = P \\times Q$) is a quadratic function: $TR = aP - bP^2$. This plots as a parabola that opens downward. Total revenue is maximized at the price and quantity corresponding to the vertex of this parabola, which is also the midpoint of the linear demand curve where $PED = 1$.",
        "context": "This graphical analysis powerfully illustrates why a firm would never want to set a price in the inelastic region of its demand curve—it could always raise price and increase revenue (and reduce costs by selling less). Profit maximization, however, considers costs and may occur at a different point."
      },
      "principles": [
        {
          "principle": "The Total Revenue Test",
          "statement": "Observing how total revenue changes when price changes reveals the elasticity of demand without direct calculation: If price increase leads to higher total revenue → demand is inelastic at that point. If price increase leads to lower total revenue → demand is elastic at that point. If price increase leaves total revenue unchanged → demand is unit elastic at that point.",
          "application": "A simple empirical test for businesses: run a small price test and track what happens to total sales revenue.",
          "example": "A coffee shop raises the price of its latte from $\\$4$ to $\\$4.50$. It observes that weekly latte revenue increases from $\\$2,000$ to $\\$2,100$. This indicates demand is **inelastic** at the original price (price up, revenue up). If revenue had fallen to $\\$1,800$, it would indicate elastic demand."
        },
        {
          "principle": "Revenue Maximization vs. Profit Maximization",
          "statement": "A firm maximizes **total revenue** at the price where $PED = 1$. However, a firm maximizes **profit** where marginal revenue ($MR$) equals marginal cost ($MC$). Since $MC$ is typically positive, the profit-maximizing price is higher than the revenue-maximizing price, placing the firm in the **elastic region** of demand (where $PED > 1$). A firm would never knowingly operate in the inelastic region ($PED < 1$) because raising price would both increase revenue and decrease costs (from producing less), unambiguously increasing profit.",
          "application": "This is a key insight in microeconomics: a profit-maximizing monopolist always sets a price on the elastic portion of its demand curve.",
          "example": "Consider a demand curve. If at the current price $PED = 0.7$ (inelastic), the firm can raise price. This increases revenue (inelastic rule) and reduces the quantity it needs to produce, lowering total cost. Therefore, profit must increase. The firm will keep raising price until it enters the elastic region ($PED > 1$), where further price increases would start to reduce revenue."
        },
        {
          "principle": "Graphical Relationship: Demand, TR, and Elasticity",
          "statement": "On a graph with a linear demand curve, plot the corresponding total revenue curve below it. The TR curve peaks at the quantity where a vertical line intersects the demand curve at its **midpoint** (where $PED=1$). To the left of the peak (higher prices, lower quantities), demand is elastic and TR is rising as price falls. To the right of the peak (lower prices, higher quantities), demand is inelastic and TR is falling as price falls.",
          "application": "Visualizing this helps understand the entire range of pricing possibilities.",
          "example": "Demand: $Q = 10 - P$. $TR = 10P - P^2$. Graph Demand: line from $(Q=0, P=10)$ to $(Q=10, P=0)$. Graph TR: parabola with vertex at $P=5, Q=5, TR=25$. At $P=7, Q=3, TR=21$ (elastic region, TR increasing as P moves toward 5). At $P=3, Q=7, TR=21$ (inelastic region, TR increasing as P moves away from 3 toward 5)."
        }
      ],
      "worked_examples": [
        {
          "title": "Finding the Revenue-Maximizing Price and Quantity",
          "problem": "A firm faces the demand curve $Q = 24 - 2P$, where $Q$ is in thousands of units. (a) Derive the total revenue function. (b) Find the price and quantity that maximize total revenue. (c) Calculate the maximum total revenue. (d) Verify that at this point, demand is unit elastic.",
          "step_by_step": [
            {
              "step": "Part (a): Derive TR function",
              "explanation": "Total Revenue is $TR = P \\times Q$. Substitute the demand equation $Q = 24 - 2P$ into this: $TR(P) = P \\times (24 - 2P) = 24P - 2P^2$."
            },
            {
              "step": "Part (b): Find P and Q that maximize TR",
              "explanation": "The TR function is a quadratic in $P$ that opens downward (coefficient of $P^2$ is negative). Maximum occurs at the vertex. For a parabola $ax^2 + bx + c$, vertex at $x = -b/(2a)$. Here, treating $P$ as the variable: $a = -2$, $b = 24$. So, revenue-maximizing price $P^* = -b/(2a) = -24 / (2 \\times -2) = -24 / -4 = 6$. So $P^* = \\$6$.\nNow find $Q^*$: $Q^* = 24 - 2(6) = 24 - 12 = 12$ (thousand units)."
            },
            {
              "step": "Part (c): Calculate maximum TR",
              "explanation": "$TR_{max} = P^* \\times Q^* = 6 \\times 12,000 = \\$72,000$. Or using the function: $TR(6) = 24(6) - 2(6)^2 = 144 - 72 = 72$ (in thousands of dollars)."
            },
            {
              "step": "Part (d): Verify Unit Elasticity",
              "explanation": "For a linear demand curve $Q = a - bP$, the point elasticity formula is $PED = |(dQ/dP) \\times (P/Q)|$. Here, $dQ/dP = -2$. At $P=6, Q=12$. So, $PED = |(-2) \\times (6/12)| = |(-2) \\times 0.5| = | -1 | = 1$. Therefore, demand is unit elastic at the revenue-maximizing point, as expected."
            }
          ],
          "final_answer": "(a) $TR(P) = 24P - 2P^2$. (b) Revenue is maximized at $P^* = \\$6$ and $Q^* = 12,000$ units. (c) Maximum total revenue is $\\$72,000$. (d) At this point, $PED = 1$, confirming demand is unit elastic.",
          "concept_applied": "For a linear demand curve, TR is a quadratic function. Maximize it by finding the vertex. The revenue-maximizing point is always the midpoint of the demand curve, where elasticity equals 1."
        }
      ]
    }
  ],
  "key_terms": [
    "Total revenue (TR)",
    "Price effect",
    "Quantity effect",
    "Revenue-elasticity rule",
    "Elastic demand and revenue",
    "Inelastic demand and revenue",
    "Unit elastic demand",
    "Total revenue test",
    "Revenue maximization",
    "Profit maximization",
    "Total revenue curve",
    "Linear demand curve"
  ],
  "summary": "The relationship between Price Elasticity of Demand (PED) and Total Revenue (TR) is one of the most practical applications of elasticity theory, summarized by the **revenue-elasticity rule**:<br><br>• **If demand is elastic ($PED > 1$)**: Price and total revenue move in **opposite directions**. A price decrease increases total revenue because the percentage increase in quantity sold outweighs the percentage decrease in price (quantity effect dominates). A price increase decreases total revenue.<br>• **If demand is inelastic ($PED < 1$)**: Price and total revenue move in the **same direction**. A price increase increases total revenue because the percentage decrease in quantity sold is smaller than the percentage increase in price (price effect dominates). A price decrease decreases total revenue.<br>• **If demand is unit elastic ($PED = 1$)**: Total revenue remains **constant** when price changes. The percentage change in price and quantity are equal, perfectly offsetting each other. Total revenue is maximized at this point.<br><br>This rule can be understood through the components of revenue change: $\\Delta TR = (Q \\times \\Delta P) + (P \\times \\Delta Q)$. The first term is the **price effect** (positive if price increases); the second is the **quantity effect** (negative if price increases). Elasticity determines which effect is larger.<br><br>Graphically, for a **linear demand curve**, the total revenue curve is an inverted-U shaped parabola ($TR = aP - bP^2$). Total revenue peaks at the **midpoint** of the demand curve, which is precisely where demand is unit elastic ($PED = 1$). To the left of the midpoint (higher prices, lower quantities), demand is elastic and lowering price increases TR. To the right of the midpoint (lower prices, higher quantities), demand is inelastic and lowering price decreases TR.<br><br>A critical business insight is that a profit-maximizing firm (with positive marginal costs) will **never operate in the inelastic region of its demand curve**. If it were in the inelastic region ($PED < 1$), it could raise price, increase revenue, and simultaneously reduce costs by producing less—a sure way to increase profit. Therefore, a profit-maximizing firm always sets a price in the **elastic region** ($PED > 1$).<br><br>The **total revenue test** provides a simple way to estimate elasticity: observe if revenue moves with or against a price change. This rule is fundamental for pricing strategy, tax policy (predicting tax revenue), and understanding market behavior in agriculture, luxury goods, utilities, and many other sectors."
}

