{
  "unit": 4,
  "unit_title": "Elasticity",
  "section": "4.7",
  "section_title": "Price Elasticity of Supply",
  "expanded_description": "Just as demand responds to price changes, supply also reacts to changing prices. Price Elasticity of Supply (PES) measures how responsive the quantity supplied is to price changes. Understanding supply elasticity helps predict market adjustments, production responses, and price volatility.",
  "core_concept": {
    "principle": "Price Elasticity of Supply (PES) measures the percentage change in quantity supplied resulting from a one percent change in price. It quantifies producers' ability and willingness to adjust production when prices change.",
    "explanation": "PES indicates how easily producers can increase or decrease output in response to price signals. Elastic supply means quantity supplied responds substantially to price changes. Inelastic supply means quantity supplied responds minimally. Unlike demand elasticity (which is usually negative due to law of demand), supply elasticity is typically positive—higher prices generally lead to greater quantity supplied. PES depends critically on production timeframes and constraints. In the immediate market period, supply may be perfectly inelastic (fixed quantity). In the short run, some adjustment is possible. In the long run, supply becomes more elastic as producers can fully adjust production capacity. Understanding PES helps explain why some markets adjust quickly to shocks while others experience prolonged price volatility.",
    "image": {
      "src": "images/unit4/supply_elasticity_spectrum.png",
      "alt": "A spectrum from perfectly inelastic to perfectly elastic supply curves, with examples of products at different elasticities",
      "caption": "The elasticity of supply ranges from perfectly inelastic (vertical) to perfectly elastic (horizontal), with most products falling somewhere in between"
    }
  },
  "sections": [
    {
      "section_title": "Understanding PES: Definition and Formula",
      "introduction": "Price Elasticity of Supply follows a similar calculation framework to PED but focuses on producer responses rather than consumer responses.",
      "key_concept": {
        "definition": "Price Elasticity of Supply (PES) = Percentage change in quantity supplied ÷ Percentage change in price",
        "context": "Mathematically: PES = (%ΔQs) ÷ (%ΔP) where %ΔQs = (ΔQs ÷ Qs₀) × 100 and %ΔP = (ΔP ÷ P₀) × 100. Since both price and quantity typically move in the same direction for supply (higher price → more quantity supplied), PES is usually positive."
      },
      "categories": [
        {
          "type": "Midpoint Formula (Arc Elasticity)",
          "description": "The most accurate calculation method uses average values to avoid endpoint bias.",
          "examples": [
            {
              "process": "Formula",
              "explanation": "PES = [(Q₂ - Q₁) ÷ ((Q₁ + Q₂) ÷ 2)] ÷ [(P₂ - P₁) ÷ ((P₁ + P₂) ÷ 2)]"
            },
            {
              "process": "Example calculation",
              "explanation": "Price increases from \\$10 to \\$12 (20% increase using midpoint). Quantity supplied increases from 100 to 130 units (27.3% increase). PES = 0.273 ÷ 0.20 = 1.365 (elastic supply)."
            }
          ]
        },
        {
          "type": "Point Elasticity",
          "description": "Elasticity at a specific point on the supply curve.",
          "examples": [
            {
              "process": "Formula",
              "explanation": "PES = (dQs ÷ dP) × (P ÷ Qs) where dQs/dP is the slope of the supply function."
            },
            {
              "process": "Application",
              "explanation": "For linear supply curve Qs = 50 + 10P, at P = \\$5, Qs = 100. Slope = 10. PES = 10 × (5 ÷ 100) = 0.5 (inelastic)."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Positive Relationship Distinguishes PES from PED",
          "statement": "While PED is usually negative (inverse price-quantity relationship), PES is typically positive (direct relationship). Higher prices incentivize greater production.",
          "application": "When calculating PES, the sign indicates direction: positive values confirm the law of supply is operating.",
          "example": "Coffee price rises 10%, farmers plant more coffee trees → quantity supplied increases 15% → PES = +1.5. This positive value shows supply response follows expected direction."
        },
        {
          "principle": "Time Horizon is Critical for PES",
          "statement": "Supply elasticity increases with time. Immediate period: perfectly inelastic. Short run: somewhat elastic. Long run: most elastic.",
          "application": "Always specify time period when discussing PES. 'The elasticity of oil supply is 0.1 in the short run but 0.8 in the long run.'",
          "example": "Agricultural products: Immediately after planting, supply is fixed (inelastic). Next season, farmers can adjust planting (more elastic). Over years, new land can be cultivated (most elastic)."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating PES: Coffee Market Response",
          "problem": "When coffee prices rise from \\$4 to \\$5 per pound, coffee producers increase quantity supplied from 10 million to 13 million pounds. Calculate PES using the midpoint formula. Interpret the result.",
          "step_by_step": [
            {
              "step": "Identify values",
              "explanation": "P₁ = \\$4, P₂ = \\$5, Q₁ = 10 million, Q₂ = 13 million"
            },
            {
              "step": "Calculate percentage change in quantity",
              "explanation": "%ΔQs = [(13 - 10) ÷ ((10 + 13) ÷ 2)] × 100 = [3 ÷ 11.5] × 100 = 26.09%"
            },
            {
              "step": "Calculate percentage change in price",
              "explanation": "%ΔP = [(5 - 4) ÷ ((4 + 5) ÷ 2)] × 100 = [1 ÷ 4.5] × 100 = 22.22%"
            },
            {
              "step": "Calculate PES",
              "explanation": "PES = 26.09% ÷ 22.22% = 1.17"
            },
            {
              "step": "Interpret",
              "explanation": "PES > 1 indicates elastic supply. A 1% price increase leads to a 1.17% quantity increase. Coffee producers respond strongly to price signals."
            }
          ],
          "final_answer": "PES = 1.17 (elastic supply). Coffee producers increase quantity supplied proportionally more than the price increase.",
          "concept_applied": "PES calculation using midpoint formula and interpretation of elasticity values."
        }
      ]
    },
    {
      "section_title": "Types of Supply Elasticity",
      "introduction": "Supply elasticity exists on a continuum from perfectly inelastic to perfectly elastic, with most products falling somewhere between these extremes.",
      "key_concept": {
        "definition": "Five key classifications: Perfectly inelastic (PES = 0), Inelastic (0 < PES < 1), Unit elastic (PES = 1), Elastic (PES > 1), Perfectly elastic (PES = ∞).",
        "context": "These classifications help predict market behavior. Perfectly inelastic supply curves are vertical—quantity supplied doesn't change regardless of price. Perfectly elastic supply curves are horizontal—any quantity supplied at a fixed price."
      },
      "categories": [
        {
          "type": "Perfectly Inelastic Supply (PES = 0)",
          "description": "Quantity supplied cannot change regardless of price changes. Supply curve is vertical.",
          "examples": [
            {
              "process": "Characteristics",
              "explanation": "Fixed quantity available. Price changes don't affect quantity. Producers cannot adjust production in relevant time period."
            },
            {
              "process": "Real-world examples",
              "explanation": "Original Picasso paintings (fixed number), beachfront property in Miami (fixed amount), tickets for a specific concert (fixed seats). In immediate period: perishable goods at market close, agricultural harvest once planted."
            },
            {
              "process": "Graph representation",
              "explanation": "Vertical line at fixed quantity. Price can be any value along vertical axis, quantity constant."
            }
          ]
        },
        {
          "type": "Inelastic Supply (0 < PES < 1)",
          "description": "Quantity supplied changes proportionally less than price change.",
          "examples": [
            {
              "process": "Characteristics",
              "explanation": "Producers can adjust somewhat but face constraints. Percentage change in quantity < percentage change in price."
            },
            {
              "process": "Real-world examples",
              "explanation": "Oil in short run (6-12 months), mining products, electricity generation capacity, specialized manufacturing (aircraft, ships), agricultural products within one growing season."
            },
            {
              "process": "Market implications",
              "explanation": "Price spikes create windfall profits but little additional output. Small demand increases cause large price increases."
            }
          ]
        },
        {
          "type": "Unit Elastic Supply (PES = 1)",
          "description": "Quantity supplied changes exactly in proportion to price change.",
          "examples": [
            {
              "process": "Characteristics",
              "explanation": "Percentage change in quantity = percentage change in price. Rare in practice but theoretical benchmark."
            },
            {
              "process": "Example",
              "explanation": "Some craft goods where production can be easily scaled proportionally with price incentives. Supply curve is a straight line through origin."
            }
          ]
        },
        {
          "type": "Elastic Supply (PES > 1)",
          "description": "Quantity supplied changes proportionally more than price change.",
          "examples": [
            {
              "process": "Characteristics",
              "explanation": "Producers respond strongly to price signals. Percentage change in quantity > percentage change in price."
            },
            {
              "process": "Real-world examples",
              "explanation": "Manufactured consumer goods (clothing, electronics), services (haircuts, restaurant meals), standardized agricultural products in long run, products with idle capacity."
            },
            {
              "process": "Market implications",
              "explanation": "Small price increases bring forth large quantity increases. Markets adjust quickly to demand changes without huge price swings."
            }
          ]
        },
        {
          "type": "Perfectly Elastic Supply (PES = ∞)",
          "description": "Producers will supply any quantity at a specific price, none above or below. Supply curve is horizontal.",
          "examples": [
            {
              "process": "Characteristics",
              "explanation": "Constant cost production. Unlimited quantity available at given price. Perfectly competitive markets in long run."
            },
            {
              "process": "Real-world approximations",
              "explanation": "Digital goods (software copies), agricultural products at support price, small price-taker firms in competitive markets, currency exchange in deep markets."
            },
            {
              "process": "Graph representation",
              "explanation": "Horizontal line at constant price. Quantity can be any value along horizontal axis at that price."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Elasticity Varies Along Linear Supply Curves",
          "statement": "For straight-line supply curves that don't pass through origin, elasticity changes at different price points.",
          "application": "Calculate PES at specific points rather than assuming constant elasticity along linear supply curves.",
          "example": "Supply curve: Qs = 100 + 20P. At P = \\$10, Q = 300, PES = (20) × (10 ÷ 300) = 0.67 (inelastic). At P = \\$50, Q = 1100, PES = (20) × (50 ÷ 1100) = 0.91 (still inelastic but closer to unit elastic)."
        }
      ],
      "image": {
        "src": "images/unit4/supply_elasticity_types.png",
        "alt": "Five graphs showing perfectly inelastic, inelastic, unit elastic, elastic, and perfectly elastic supply curves",
        "caption": "The five classifications of supply elasticity, from perfectly inelastic (vertical) to perfectly elastic (horizontal)"
      }
    },
    {
      "section_title": "Time Periods and Supply Elasticity",
      "introduction": "The most important determinant of supply elasticity is time. Supply becomes more elastic as producers have more time to adjust production.",
      "key_concept": {
        "definition": "Three time periods: Market period (immediate), Short run, Long run. Elasticity increases with time as producers overcome constraints.",
        "context": "In immediate period, many factors are fixed. In short run, some factors variable. In long run, all factors variable. This progression explains why supply responses differ dramatically based on timeframe."
      },
      "categories": [
        {
          "type": "Market Period (Immediate)",
          "description": "Time too short to change production. Supply is perfectly inelastic or nearly so.",
          "examples": [
            {
              "process": "Characteristics",
              "explanation": "Fixed quantity available. Cannot adjust production processes. Existing inventory only."
            },
            {
              "process": "Examples",
              "explanation": "Agricultural products at harvest, concert tickets after sale begins, perishable goods at market, gasoline in station tanks today."
            },
            {
              "process": "Elasticity value",
              "explanation": "PES ≈ 0. Price changes don't affect quantity supplied. Price acts purely as rationing mechanism."
            }
          ]
        },
        {
          "type": "Short Run",
          "description": "Some factors variable, others fixed. Limited ability to adjust production.",
          "examples": [
            {
              "process": "Characteristics",
              "explanation": "Can adjust labor, materials, some inputs. Cannot adjust capital, factory size, technology."
            },
            {
              "process": "Examples",
              "explanation": "Manufacturing with existing factories (can add shifts but not build new plants), agriculture within growing season, restaurants with fixed location."
            },
            {
              "process": "Elasticity value",
              "explanation": "0 < PES < 1 typically. Some response possible but constrained."
            }
          ]
        },
        {
          "type": "Long Run",
          "description": "All factors variable. Full adjustment possible.",
          "examples": [
            {
              "process": "Characteristics",
              "explanation": "Can build new factories, enter/exit industry, develop new technology, train workers, access new resources."
            },
            {
              "process": "Examples",
              "explanation": "Manufacturing with new plants, agriculture with new land cultivation, new housing development, new mining operations."
            },
            {
              "process": "Elasticity value",
              "explanation": "PES > 1 typically. Substantial response to price signals."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Oil Supply Elasticity Across Time Periods",
          "problem": "Explain how the elasticity of oil supply differs across market period, short run, and long run. Why does this matter for oil price volatility?",
          "step_by_step": [
            {
              "step": "Market period (days/weeks)",
              "explanation": "Oil already pumped and in storage/tankers. Cannot change production. PES ≈ 0 (perfectly inelastic). Any demand change causes immediate price spike/crash."
            },
            {
              "step": "Short run (3-12 months)",
              "explanation": "Can adjust pumping rates from existing wells, but cannot drill new wells. Limited response. PES ≈ 0.1-0.3 (highly inelastic). Small demand changes cause large price movements."
            },
            {
              "step": "Long run (2-5 years)",
              "explanation": "Can drill new wells, develop new fields, use new technologies (fracking). Substantial response possible. PES ≈ 0.8-1.2 (approaching unit elastic). Markets adjust with smaller price changes."
            },
            {
              "step": "Price volatility implications",
              "explanation": "Because short-run supply is inelastic, temporary demand changes (economic growth, geopolitical events) cause extreme price swings. Only long-run adjustments stabilize prices."
            },
            {
              "step": "Real-world evidence",
              "explanation": "2008 oil price spike ($147/barrel) followed by crash ($30/barrel). Short-run inelasticity amplified both movements. Shale revolution (long-run adjustment) increased elasticity, moderating recent volatility."
            }
          ],
          "final_answer": "Oil supply is perfectly inelastic immediately, highly inelastic in short run (PES 0.1-0.3), and moderately elastic in long run (PES 0.8-1.2). This explains extreme oil price volatility—short-run demand changes hit nearly fixed supply, causing large price swings. Only long-run supply responses can stabilize prices.",
          "concept_applied": "Time period dramatically affects supply elasticity. Inelastic short-run supply + elastic long-run supply explains commodity price volatility patterns."
        }
      ],
      "image": {
        "src": "images/unit4/time_and_elasticity.png",
        "alt": "Three graphs showing supply curves becoming flatter (more elastic) as time period extends from immediate to short run to long run",
        "caption": "Supply becomes more elastic over time: immediate period (vertical), short run (steep), long run (flat)"
      }
    },
    {
      "section_title": "Factors Determining Supply Elasticity",
      "introduction": "Beyond time, several specific factors influence how easily producers can adjust quantity supplied when prices change.",
      "key_concept": {
        "definition": "Key determinants: 1) Production time, 2) Availability of inputs, 3) Excess capacity, 4) Storage possibilities, 5) Mobility of factors, 6) Complexity of production.",
        "context": "These factors explain why some products have elastic supply (easy to adjust production) while others have inelastic supply (difficult to adjust). Understanding determinants helps predict which markets will respond quickly to price changes."
      },
      "categories": [
        {
          "type": "Production Time and Speed",
          "description": "How quickly output can be increased when prices rise.",
          "examples": [
            {
              "process": "Short production cycle",
              "explanation": "Products made quickly have elastic supply. Example: Textiles, simple manufacturing, services. Can ramp up quickly."
            },
            {
              "process": "Long production cycle",
              "explanation": "Products requiring long lead times have inelastic supply. Example: Agriculture (growing seasons), forestry (decades), wine (aging), aircraft (years to build)."
            },
            {
              "process": "Just-in-time production",
              "explanation": "Modern manufacturing with minimal inventory has less elastic immediate supply but can adjust quickly in short run."
            }
          ]
        },
        {
          "type": "Availability of Spare Capacity",
          "description": "Excess production capacity allows quick response to price increases.",
          "examples": [
            {
              "process": "High excess capacity",
              "explanation": "Elastic supply. Can increase output without new investment. Example: Manufacturing during recession (idle factories), restaurants with empty tables, hotels with vacancies."
            },
            {
              "process": "Full capacity utilization",
              "explanation": "Inelastic supply. Must build new capacity. Example: Mining at full extraction rates, utilities at peak demand, popular tourist destinations in season."
            }
          ]
        },
        {
          "type": "Mobility of Factors of Production",
          "description": "How easily resources can move between industries.",
          "examples": [
            {
              "process": "Mobile factors",
              "explanation": "Elastic supply. Labor, capital can shift quickly. Example: General manufacturing, services, construction."
            },
            {
              "process": "Immobile/specialized factors",
              "explanation": "Inelastic supply. Resources tied to specific uses. Example: Oil rigs, vineyard land, specialized machinery, trained nuclear engineers."
            }
          ]
        },
        {
          "type": "Storage Possibilities",
          "description": "Ability to inventory products affects immediate supply elasticity.",
          "examples": [
            {
              "process": "Storable goods",
              "explanation": "More elastic immediate supply. Can draw down/increase inventories. Example: Grain, metals, manufactured goods."
            },
            {
              "process": "Perishable/non-storable goods",
              "explanation": "Inelastic immediate supply. Must sell immediately. Example: Fresh produce, electricity, services (haircut cannot be stored)."
            }
          ]
        },
        {
          "type": "Complexity of Production",
          "description": "Simple vs. complex production processes.",
          "examples": [
            {
              "process": "Simple processes",
              "explanation": "Elastic supply. Easy to replicate/expand. Example: Handicrafts, basic assembly, digital products."
            },
            {
              "process": "Complex processes",
              "explanation": "Inelastic supply. Difficult to scale quickly. Example: Semiconductor fabrication, pharmaceutical manufacturing, aerospace."
            }
          ]
        },
        {
          "type": "Availability of Raw Materials",
          "description": "Access to necessary inputs constrains supply response.",
          "examples": [
            {
              "process": "Abundant inputs",
              "explanation": "Elastic supply. Example: Solar energy (sunlight abundant), software (code replicable)."
            },
            {
              "process": "Scarce/constrained inputs",
              "explanation": "Inelastic supply. Example: Champagne (specific region), truffles (specific conditions), rare earth minerals."
            }
          ]
        }
      ],
      "principles": [
        {
          "principle": "Natural Resources Tend Toward Inelastic Supply",
          "statement": "Resource-based products (minerals, agricultural land, fisheries) often have inelastic supply due to fixed natural constraints.",
          "application": "Expect price volatility in resource markets because both supply and demand are often inelastic in short run.",
          "example": "Urban land: Fixed amount → perfectly inelastic supply → rising demand causes dramatic price increases (housing bubbles). Agricultural land: Limited fertile land → inelastic supply → food price spikes during shortages."
        },
        {
          "principle": "Manufactured Goods Tend Toward Elastic Supply",
          "statement": "Most manufactured products have relatively elastic supply because production can be scaled with sufficient time and capital.",
          "application": "Manufactured goods prices are more stable than commodity prices because supply adjusts to demand changes.",
          "example": "Smartphones: Initially inelastic (production constraints), quickly becomes elastic as factories built. Clothing: Highly elastic supply—fast fashion responds to trends within weeks."
        }
      ],
      "image": {
        "src": "images/unit4/supply_determinants.png",
        "alt": "Flowchart showing how different factors lead to elastic or inelastic supply",
        "caption": "Factors determining supply elasticity: time, capacity, mobility, storage, complexity, and resource availability"
      }
    }
  ],
  "key_terms": [
    "Price Elasticity of Supply (PES)",
    "Perfectly inelastic supply",
    "Perfectly elastic supply",
    "Unit elastic supply",
    "Market period",
    "Short run",
    "Long run",
    "Excess capacity",
    "Factor mobility",
    "Production lag",
    "Storage capacity",
    "Supply constraints"
  ],
  "summary": "Price Elasticity of Supply (PES) measures how responsive quantity supplied is to price changes, calculated as percentage change in quantity supplied divided by percentage change in price. Unlike PED, PES is typically positive since higher prices incentivize greater production. Supply elasticity exists on a continuum: perfectly inelastic (PES = 0, vertical supply curve), inelastic (0 < PES < 1), unit elastic (PES = 1), elastic (PES > 1), and perfectly elastic (PES = ∞, horizontal supply curve). The most critical determinant of PES is time: in the immediate market period, supply is often perfectly inelastic (fixed quantity); in the short run, somewhat elastic as some inputs can be adjusted; in the long run, most elastic as all factors become variable. Other determinants include production time (short cycles enable elastic supply), spare capacity (excess capacity allows quick response), factor mobility (mobile resources enable elastic supply), storage possibilities (storable goods have more elastic immediate supply), production complexity (simple processes scale easily), and input availability (abundant inputs support elastic supply). Natural resources typically have inelastic supply due to fixed constraints, while manufactured goods tend toward elastic supply as production can be scaled. Understanding PES helps explain price volatility patterns (inelastic supply + demand shocks cause extreme price swings), market adjustment speeds, and production responses to changing market conditions."
}
