{
  "expanded_description": "Price Elasticity of Demand (PED) measures how responsive the quantity demanded of a good is to a change in its own price. It quantifies the sensitivity of consumers to price changes. While the Law of Demand tells us that quantity demanded moves in the opposite direction of price, PED tells us by how much—is the response large, small, or somewhere in between? Understanding PED is fundamental for predicting how changes in prices (due to taxes, cost changes, or monopolistic pricing) will affect sales volumes, consumer spending, and market outcomes.",
  "core_concept": {
    "principle": "Price Elasticity of Demand (PED) is the ratio of the percentage change in quantity demanded to the percentage change in price that caused it. Since price and quantity demanded move in opposite directions (due to the Law of Demand), this ratio is inherently negative. However, economists typically take the absolute value (ignore the negative sign) for ease of discussion and comparison. The formula is: $\\text{PED} = \\left|\\frac{\\%\\Delta Q_d}{\\%\\Delta P}\\right|$. The resulting value categorizes demand: Elastic (PED > 1): Quantity is highly responsive to price. A 1% price cut leads to a >1% increase in $Q_d$. Inelastic (PED < 1): Quantity is unresponsive to price. A 1% price cut leads to a <1% increase in $Q_d$. Unit Elastic (PED = 1): Quantity responds proportionally. A 1% price cut leads to exactly a 1% increase in $Q_d$.",
    "explanation": "Elasticity is a unit-free measure—it uses percentages, not absolute amounts. This allows comparison across different goods (e.g., cars vs. coffee) measured in different units. The focus is on the proportional (percentage) change. Think of it as a measure of the 'flatness' or 'steepness' of the demand curve at a point, though slope and elasticity are related but distinct concepts. A flatter curve generally indicates more elastic demand, but not always, as slope depends on the units used. Why does magnitude matter? If demand is elastic, a price increase will cause such a large drop in sales that total revenue (Price × Quantity) will fall. If demand is inelastic, a price increase will cause such a small drop in sales that total revenue will rise. This link between elasticity and revenue is a central application (covered in 4.4). Examples: Insulin for a diabetic is a classic inelastic good—price changes have little effect on quantity demanded because it's essential. Restaurant meals are often elastic—if prices rise, people can easily cook at home or choose a different restaurant.",
    "image": {
      "src": "images/unit4/price_elasticity_demand.png",
      "alt": "Three demand curves: 1. A relatively flat curve labeled 'Elastic Demand (PED > 1)'. 2. A relatively steep curve labeled 'Inelastic Demand (PED < 1)'. 3. A rectangular hyperbola labeled 'Unit Elastic Demand (PED = 1)'.",
      "caption": "Visualizing Elasticity: Flatter demand curves tend to be more elastic; steeper curves more inelastic. Unit elastic demand has a specific curved shape."
    }
  },
  "sections": [
    {
      "section_title": "Understanding the Concept: Responsiveness vs. Slope",
      "introduction": "It's crucial to distinguish between the slope of a demand curve and its elasticity. While related, they are different concepts, and confusing them is a common error.",
      "key_concept": {
        "definition": "Slope = $\\frac{\\Delta P}{\\Delta Q}$ (rise over run). It is measured in absolute units (e.g., dollars per unit). Elasticity = $\\frac{\\%\\Delta Q}{\\%\\Delta P}$. It is a unit-free ratio of percentages. Elasticity can change along a straight-line demand curve, while the slope is constant.",
        "context": "A linear demand curve has constant slope but varying elasticity. It is elastic at high prices (top left), unit elastic at the midpoint, and inelastic at low prices (bottom right)."
      },
      "principles": [
        {
          "principle": "Elasticity Varies Along a Linear Demand Curve",
          "statement": "For a straight-line (linear) demand curve, the slope ($\\frac{\\Delta P}{\\Delta Q}$) is constant. However, the percentages used in elasticity change because the base (initial P and Q) changes. Elasticity is higher (more elastic) where price is high and quantity is low, and lower (more inelastic) where price is low and quantity is high.",
          "application": "When analyzing a linear demand curve, you cannot say it is 'elastic' or 'inelastic'—you must specify a point or range.",
          "example": "Demand: $Q_d = 100 - 2P$. At $P = \\$40$, $Q = 20$. A \\$10 price cut to \\$30 increases Q to 40. $\\%\\Delta P = \\frac{10}{40} \\times 100 = 25\\%$. $\\%\\Delta Q = \\frac{20}{20} \\times 100 = 100\\%$. $\\text{PED} = \\frac{100\\%}{25\\%} = 4$ (Elastic). At $P = \\$10$, $Q = 80$. A \\$10 price cut to \\$0 increases Q to 100. $\\%\\Delta P = \\frac{10}{10} \\times 100 = 100\\%$. $\\%\\Delta Q = \\frac{20}{80} \\times 100 = 25\\%$. $\\text{PED} = \\frac{25\\%}{100\\%} = 0.25$ (Inelastic). Same slope, different elasticity."
        },
        {
          "principle": "Perfectly Elastic vs. Perfectly Inelastic Demand",
          "statement": "These are extreme, theoretical cases. Perfectly Elastic (PED = ∞): Demand curve is horizontal. At any price above a certain level, $Q_d = 0$. At that price, consumers will buy any quantity. Perfectly Inelastic (PED = 0): Demand curve is vertical. Quantity demanded does not change at all when price changes.",
          "application": "Useful for modeling markets with perfect substitutes (elastic) or absolute necessities with no substitutes (inelastic).",
          "example": "Perfectly Inelastic: Demand for a life-saving drug for an individual. If the price doubles from \\$100 to \\$200, the patient still buys one dose. Quantity is fixed regardless of price. Perfectly Elastic: Demand for wheat from a single farmer in a perfectly competitive market. If she raises her price by one cent above the market price, she sells zero bushels because buyers can get identical wheat elsewhere."
        }
      ],
      "worked_examples": [
        {
          "title": "Comparing Slope and Elasticity on a Linear Curve",
          "problem": "A linear demand curve passes through points: $(Q=100, P=\\$0)$ and $(Q=0, P=\\$20)$. (a) Calculate the slope. (b) Calculate the PED for a price increase from \\$5 to \\$10. (c) Calculate the PED for a price increase from \\$15 to \\$20. (d) Compare and explain.",
          "step_by_step": [
            {
              "step": "Part (a): Calculate the slope",
              "explanation": "Slope = $\\frac{\\Delta P}{\\Delta Q} = \\frac{20 - 0}{0 - 100} = \\frac{20}{-100} = -0.2$. In absolute terms, the slope is 0.2 \\$ per unit. The demand equation is $P = 20 - 0.2Q$, or $Q = 100 - 5P$."
            },
            {
              "step": "Part (b): PED for P = \\$5 to P = \\$10",
              "explanation": "First, find quantities. At $P=\\$5$: $Q = 100 - 5(5) = 75$. At $P=\\$10$: $Q = 100 - 5(10) = 50$. Price increases from \\$5 to \\$10. $\\%\\Delta P = \\frac{10-5}{5} \\times 100 = \\frac{5}{5} \\times 100 = 100\\%$. Quantity decreases from 75 to 50. $\\%\\Delta Q = \\frac{50-75}{75} \\times 100 = \\frac{-25}{75} \\times 100 = -33.33\\%$. $\\text{PED} = \\left|\\frac{-33.33\\%}{100\\%}\\right| = 0.333$. Since 0.333 < 1, demand is INELASTIC over this range."
            },
            {
              "step": "Part (c): PED for P = \\$15 to P = \\$20",
              "explanation": "At $P=\\$15$: $Q = 100 - 5(15) = 25$. At $P=\\$20$: $Q = 100 - 5(20) = 0$. Price increases from \\$15 to \\$20. $\\%\\Delta P = \\frac{20-15}{15} \\times 100 = \\frac{5}{15} \\times 100 = 33.33\\%$. Quantity decreases from 25 to 0. $\\%\\Delta Q = \\frac{0-25}{25} \\times 100 = \\frac{-25}{25} \\times 100 = -100\\%$. $\\text{PED} = \\left|\\frac{-100\\%}{33.33\\%}\\right| = 3.0$. Since 3.0 > 1, demand is ELASTIC over this range."
            },
            {
              "step": "Part (d): Compare and Explain",
              "explanation": "The slope is constant (-0.2), but elasticity is not. At low prices/high quantities (\\$5 to \\$10), demand is inelastic (PED=0.33). At high prices/low quantities (\\$15 to \\$20), demand is elastic (PED=3.0). Explanation: At low prices, a price change is a large percentage change (e.g., \\$5 to \\$10 is a 100% increase), but the quantity change, while large in absolute terms (25 units), is a smaller percentage of the large initial quantity (75). Hence, $(\\%\\Delta Q) < (\\%\\Delta P) \\rightarrow$ inelastic. At high prices, a price change is a smaller percentage (\\$15 to \\$20 is 33% increase), but the quantity change is a huge percentage of the small initial quantity (25 to 0 is 100% decrease). Hence, $(\\%\\Delta Q) > (\\%\\Delta P) \\rightarrow$ elastic."
            }
          ],
          "final_answer": "(a) Slope = -0.2 (or 0.2 in absolute value). (b) PED for \\$5→\\$10 = 0.333 (Inelastic). (c) PED for \\$15→\\$20 = 3.0 (Elastic). (d) Elasticity varies along a linear demand curve, increasing as price rises and quantity falls, even though the slope is constant.",
          "concept_applied": "Slope ($\\frac{\\Delta P}{\\Delta Q}$) is constant for a linear demand curve. Elasticity ($\\frac{\\%\\Delta Q}{\\%\\Delta P}$) is not constant; it depends on the starting point. Demand becomes more elastic as we move up and left along the curve."
        }
      ],
      "image": {
        "src": "images/unit4/elasticity_along_curve.png",
        "alt": "A straight-line demand curve with three labeled sections: Elastic region at the top, Unit Elastic point at the middle, Inelastic region at the bottom.",
        "caption": "Elasticity along a Linear Demand Curve: Elasticity decreases (demand becomes less elastic) as we move down the curve. The midpoint is unit elastic."
      }
    },
    {
      "section_title": "Categories of Price Elasticity of Demand",
      "introduction": "Interpreting the numerical value of PED is essential. We classify demand into distinct categories based on the elasticity coefficient, each with important economic implications.",
      "key_concept": {
        "definition": "The absolute value of PED places demand into one of five categories: 1. Perfectly Inelastic (PED = 0), 2. Inelastic (0 < PED < 1), 3. Unit Elastic (PED = 1), 4. Elastic (1 < PED < ∞), 5. Perfectly Elastic (PED = ∞). The boundaries (0, 1, and ∞) are critical thresholds.",
        "context": "These categories predict consumer behavior and are vital for business pricing strategy and tax policy. For instance, governments often tax goods with inelastic demand (like cigarettes) because consumption doesn't fall much, ensuring steady tax revenue."
      },
      "principles": [
        {
          "principle": "Inelastic Demand (0 < |PED| < 1)",
          "statement": "The percentage change in quantity demanded is smaller than the percentage change in price. Consumers are relatively insensitive to price changes. Necessities, goods with few substitutes, and goods that are a small portion of the budget tend to have inelastic demand.",
          "application": "Producers can raise prices to increase revenue (since Q doesn't fall much). Taxes on these goods are less distorting to consumption but are often regressive.",
          "example": "Gasoline (short-run): If price rises 10%, quantity demanded might fall only 2% (PED = 0.2). People still need to drive to work. They may cut back on some trips, but their consumption is fairly rigid in the short term."
        },
        {
          "principle": "Unit Elastic Demand (|PED| = 1)",
          "statement": "The percentage change in quantity demanded is exactly equal to the percentage change in price. Total revenue $(P \\times Q)$ remains constant when price changes.",
          "application": "A theoretical benchmark. Rare in reality for an entire curve, but a useful midpoint on a linear demand curve.",
          "example": "If demand is unit elastic, a 5% price cut leads to a 5% increase in quantity sold. The price drop and quantity increase exactly offset each other: Revenue = $(0.95P) \\times (1.05Q) \\approx 0.9975PQ$, essentially unchanged."
        },
        {
          "principle": "Elastic Demand (1 < |PED| < ∞)",
          "statement": "The percentage change in quantity demanded is larger than the percentage change in price. Consumers are highly sensitive to price. Luxuries, goods with many close substitutes, and goods that are a large portion of the budget tend to have elastic demand.",
          "application": "Producers can increase revenue by lowering price (because the quantity increase more than compensates for the lower price). Taxes on these goods significantly reduce consumption.",
          "example": "Restaurant meals: If a restaurant raises its prices 10%, and many competing restaurants don't, its quantity demanded might fall 20% (PED = 2.0). Consumers can easily eat at home or go elsewhere."
        }
      ],
      "worked_examples": [
        {
          "title": "Categorizing Demand from a Scenario",
          "problem": "When the price of a particular brand of blue jeans was reduced from \\$50 to \\$45, the quantity sold per week increased from 500 to 550. (a) Calculate the Price Elasticity of Demand. (b) Categorize the demand for this brand of jeans (elastic, unit elastic, inelastic). (c) Based on your answer, what would you advise the store to do if it wants to increase total revenue from these jeans?",
          "step_by_step": [
            {
              "step": "Part (a): Calculate PED using the midpoint formula (introduced in 4.2)",
              "explanation": "While the simple percentage formula uses initial values, the midpoint formula is more accurate for changes: $\\text{PED} = \\left|\\frac{Q_2 - Q_1}{\\frac{Q_1+Q_2}{2}}\\right| \\div \\left|\\frac{P_2 - P_1}{\\frac{P_1+P_2}{2}}\\right|$. Here: $Q_1=500$, $Q_2=550$. Avg Q = $\\frac{500+550}{2} = 525$. $\\Delta Q = 50$. $\\%\\Delta Q = \\frac{50}{525} \\times 100 \\approx 9.52\\%$. $P_1=50$, $P_2=45$. Avg P = $\\frac{50+45}{2} = 47.5$. $\\Delta P = -5$. $|\\%\\Delta P| = \\frac{5}{47.5} \\times 100 \\approx 10.53\\%$. $\\text{PED} = \\frac{9.52\\%}{10.53\\%} \\approx 0.904$."
            },
            {
              "step": "Part (b): Categorize Demand",
              "explanation": "Since $|\\text{PED}| \\approx 0.904$, which is less than 1, demand is INELASTIC over this price range."
            },
            {
              "step": "Part (c): Advice for Increasing Total Revenue",
              "explanation": "When demand is inelastic, total revenue moves in the same direction as price. A price decrease (from \\$50 to \\$45) led to an inelastic response. Let's check revenue: Old Revenue: $\\$50 \\times 500 = \\$25,000$. New Revenue: $\\$45 \\times 550 = \\$24,750$. Revenue decreased slightly, consistent with inelastic demand. To increase total revenue, the store should RAISE the price. For example, if they raised price from \\$50 to \\$55 (assuming the same elasticity), the percentage drop in quantity would be smaller than the percentage increase in price, leading to higher revenue."
            }
          ],
          "final_answer": "(a) PED ≈ 0.904 (using the midpoint formula). (b) Demand is inelastic (PED < 1). (c) Because demand is inelastic, total revenue increases when price increases. The store should consider raising the price to increase revenue from this brand of jeans.",
          "concept_applied": "Calculate PED. Interpret the value: <1 = inelastic, >1 = elastic, =1 = unit elastic. Apply the PED-Total Revenue relationship: Inelastic demand → Price and Revenue move together."
        }
      ],
      "image": {
        "src": "images/unit4/categories_of_ped.png",
        "alt": "A continuum line labeled 'Price Elasticity of Demand' with markers: 0 (Perfectly Inelastic), 0 to 1 (Inelastic), 1 (Unit Elastic), >1 to infinity (Elastic), infinity (Perfectly Elastic). Examples of goods placed along the continuum.",
        "caption": "The Elasticity Spectrum: Goods fall along a continuum from perfectly inelastic to perfectly elastic based on consumer responsiveness to price."
      }
    }
  ],
  "key_terms": [
    "Price Elasticity of Demand (PED)",
    "Elastic demand",
    "Inelastic demand",
    "Unit elastic demand",
    "Perfectly elastic demand",
    "Perfectly inelastic demand",
    "Responsiveness",
    "Percentage change",
    "Elasticity coefficient",
    "Linear demand curve"
  ],
  "summary": "Price Elasticity of Demand (PED) measures the responsiveness, or sensitivity, of quantity demanded to a change in a good's own price. It is calculated as the absolute value of the percentage change in quantity demanded divided by the percentage change in price: $\\text{PED} = \\left|\\frac{\\%\\Delta Q_d}{\\%\\Delta P}\\right|$. PED is a unit-free measure that allows comparison across different goods. Its value determines how we categorize demand: <strong>Inelastic Demand (0 ≤ PED < 1)</strong>: Quantity demanded is relatively unresponsive to price changes. The percentage change in quantity is smaller than the percentage change in price. Examples include necessities (insulin, salt), goods with few substitutes (electricity in the short run), and goods that represent a small portion of the consumer's budget (toothpicks). <strong>Unit Elastic Demand (PED = 1)</strong>: Quantity demanded changes by exactly the same percentage as price. This is a theoretical benchmark where total revenue remains constant when price changes. <strong>Elastic Demand (1 < PED ≤ ∞)</strong>: Quantity demanded is highly responsive to price changes. The percentage change in quantity is larger than the percentage change in price. Examples include luxuries (vacations, designer clothes), goods with many close substitutes (different brands of cereal), and goods that are a large portion of the budget (cars). Two extreme cases are: <strong>Perfectly Inelastic Demand (PED = 0)</strong>: Quantity demanded does not change at all when price changes. The demand curve is vertical. Example: a life-saving drug for an individual. <strong>Perfectly Elastic Demand (PED = ∞)</strong>: Consumers will buy any quantity at a specific price, but zero at any price above it. The demand curve is horizontal. Example: the demand for wheat facing an individual farmer in a perfectly competitive market. A critical insight is that for a <strong>linear (straight-line) demand curve</strong>, the <strong>slope is constant but elasticity is not</strong>. Elasticity is higher (more elastic) at high prices and low quantities, and lower (more inelastic) at low prices and high quantities. The midpoint of a linear demand curve is unit elastic. Understanding PED is the first step toward powerful applications, such as predicting how a price change will affect a firm's total revenue (covered in 4.4) and analyzing the burden of taxes (covered in 4.9/4.10). It transforms the qualitative Law of Demand into a quantitative tool for decision-making."
}
