
{
  "topic": "4.10 Review and Assessment",
  "unit_title": "Electric Charge and Electric Field - Comprehensive Review",
  "unit_number": "Unit 4.10",
  "grade_level": "Grade 12",
  "subject": "Physics",
  "duration": "3-4 hours",
  "difficulty_level": "advanced",
  "expanded_description": "Comprehensive review and assessment of Unit 4: Electric Charge and Electric Field, covering Coulomb's Law, electric fields, electric potential, capacitance, and their interrelationships. Features integrated problem-solving, concept mapping, and application-based assessment tasks.",

  "learning_objectives": [
    "Integrate concepts from Coulomb's Law through capacitance in complex problems",
    "Apply vector mathematics to electrostatic systems in multiple configurations",
    "Solve multi-step problems involving field-potential relationships",
    "Analyze energy transformations in electrostatic systems",
    "Demonstrate mastery through application to novel situations",
    "Synthesize concepts across the entire electrostatics unit"
  ],

  "prerequisites": [
    "Coulomb's Law and vector electrostatics",
    "Electric field calculations and field lines",
    "Electric potential and potential difference",
    "Capacitance and energy storage",
    "Vector calculus operations",
    "Work and energy principles"
  ],

  "core_concept": {
    "principle": "Integrated electrostatics: $\\vec{F} = q\\vec{E}$, $\\vec{E} = -\\nabla V$, $\\Delta V = -\\int \\vec{E} \\cdot d\\vec{l}$, $C = Q/\\Delta V$, $U = \\frac{1}{2}C(\\Delta V)^2 = \\frac{1}{2}Q\\Delta V = \\frac{Q^2}{2C}$, $\\vec{E} = \\frac{1}{4\\pi\\epsilon_0}\\frac{q}{r^2}\\hat{r}$, $V = \\frac{1}{4\\pi\\epsilon_0}\\frac{q}{r}$, with superposition applying to all vector and scalar fields.",
    "explanation": "Electrostatics forms a complete mathematical framework where forces, fields, potentials, and energy are interconnected through differential and integral relationships, all derivable from Coulomb's Law and superposition principles.",
    "image": {
      "url": "images/electrostatics-framework.png",
      "alt": "Electrostatics conceptual framework",
      "caption": "Interrelationships between electrostatic quantities"
    }
  },

  "sections": [
    {
      "section_title": "1. Integrated Problem Solving and Concept Synthesis",
      "introduction": "Complex problems requiring synthesis of multiple electrostatic concepts, with emphasis on recognizing which principles apply in different situations and transitioning between field and potential approaches.",

      "key_concept": {
        "definition": "Concept integration: Force-Field-Potential chain $\\vec{F} = q\\vec{E}$, $\\vec{E} = -\\nabla V$, Field-source relationships $\\nabla \\cdot \\vec{E} = \\rho/\\epsilon_0$, $\\nabla \\times \\vec{E} = 0$, Energy pathways $W = \\int \\vec{F} \\cdot d\\vec{l} = q\\Delta V = \\Delta U$, Capacitance as system property $C = Q/\\Delta V$, Boundary conditions at conductors, Superposition applications.",
        "context": "Advanced problem-solving requires fluid movement between different electrostatic representations and recognition of the most efficient approach for each situation.",
        "image": {
          "url": "images/concept-integration.png",
          "alt": "Concept integration framework",
          "caption": "Interconnected electrostatic concepts and relationships"
        }
      },

      "classifications": [
        {
          "type": "Problem Synthesis Strategies",
          "value": "Classification based on solution approach and concept integration",
          "characteristics": [
            "Field-potential transition problems",
            "Energy conservation applications",
            "Multi-step derivation problems",
            "Symmetry exploitation techniques",
            "Boundary value problems",
            "Numerical estimation methods"
          ],
          "behavior": "Different synthesis strategies: field-potential transitions use E = -∇V or ΔV = -∫E·dl; energy methods apply work-energy theorem; multi-step problems chain results; symmetry simplifies calculations; boundary problems use conductor properties; estimation applies scaling and limiting cases",
          "examples": [
            {
              "process": "Field to Potential Transition",
              "explanation": "Given electric field distribution, calculate potential differences and stored energy by integrating along appropriate paths, using the conservative nature of electrostatic fields",
              "image": {
                "url": "images/field-potential-transition.png",
                "alt": "Field to potential transition",
                "caption": "Integration path from field to potential"
              }
            },
            {
              "process": "Multi-Concept Energy Analysis",
              "explanation": "Calculate work done assembling charge configurations, then relate to capacitance and stored energy, verifying results through multiple calculation methods",
              "image": {
                "url": "images/energy-analysis.png",
                "alt": "Multi-concept energy analysis",
                "caption": "Energy calculations through different approaches"
              }
            }
          ],
          "note": "Effective problem-solving requires recognizing the most efficient approach: field calculations for force problems, potential methods for energy and work, capacitance for storage systems. Symmetry often provides powerful simplifications. Conservation laws and boundary conditions provide important checks. Multiple solution paths should yield consistent results."
        }
      ],

      "principles": [
        {
          "principle": "Unified Electrostatic Framework",
          "statement": "All electrostatic phenomena can be understood through a unified mathematical framework originating from Coulomb's Law and the superposition principle. This framework connects: (1) Forces between charges via $\\vec{F} = \\frac{1}{4\\pi\\epsilon_0}\\frac{q_1q_2}{r^2}\\hat{r}$, (2) Electric fields as force per unit charge $\\vec{E} = \\vec{F}/q$, (3) Potential as work per unit charge $V = -\\int \\vec{E} \\cdot d\\vec{l}$, (4) Field-potential relationship $\\vec{E} = -\\nabla V$, (5) Energy storage $U = \\frac{1}{2}\\int \\epsilon_0 E^2 dV$, (6) Capacitance as charge storage efficiency $C = Q/\\Delta V$. The superposition principle applies throughout, enabling analysis of complex systems by summing contributions from individual elements. This unified perspective allows flexible problem-solving by choosing the most appropriate representation - vector fields for forces and directions, scalar potentials for energy and work, or capacitance for storage systems. The mathematical consistency ensures that results from different approaches must agree.",
          "application": "Solve complex multi-step electrostatic problems. Verify solutions using multiple methods. Design electrostatic systems using integrated principles. Analyze energy transformations in charge configurations. Apply appropriate mathematical tools for different problem types. Synthesize concepts across the electrostatic curriculum.",
          "example": "Point charge system: Calculate forces directly from Coulomb's Law, verify with F = qE from field calculation, check energy with U = Σ½qᵢVᵢ, confirm field with E = -∇V from potential",
          "analogy": "Like viewing a landscape from different perspectives - topographic map (potential), flow lines (field), and force directions - all describing the same physical reality",
          "image": {
            "url": "images/unified-framework.png",
            "alt": "Unified electrostatic framework",
            "caption": "Mathematical relationships connecting electrostatic concepts"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Complex Charge Configuration Analysis",
          "problem": "Four charges are arranged at corners of a square with side 0.1 m: q₁=+2μC at (0,0), q₂=+3μC at (0.1,0), q₃=-4μC at (0.1,0.1), q₄=-1μC at (0,0.1). Calculate: (a) Net force on q₁, (b) Electric field at center, (c) Potential at center, (d) Work to assemble this configuration.",
          "step_by_step": [
            {
              "step": "Net force on q₁",
              "explanation": "Calculate individual forces using Coulomb's Law: F₁₂, F₁₃, F₁₄, then vector sum. Distances: 0.1 m to q₂ and q₄, 0.141 m to q₃"
            },
            {
              "step": "Field at center",
              "explanation": "Calculate E from each charge at (0.05,0.05), using superposition. All distances 0.0707 m from center"
            },
            {
              "step": "Potential at center", 
              "explanation": "Scalar sum V = Σkqᵢ/rᵢ, much simpler than field calculation"
            },
            {
              "step": "Assembly work",
              "explanation": "U = ½ΣqᵢVᵢ, where Vᵢ is potential at each charge due to others"
            },
            {
              "step": "Verification",
              "explanation": "Check that field magnitude relates to potential gradient, and energy consistent with field integration"
            }
          ],
          "final_answer": "Complete numerical solution demonstrating: (a) Vector force ~0.5 N magnitude, (b) Field ~10⁶ V/m magnitude, (c) Potential ~-180 kV, (d) Assembly energy ~-0.15 J (bound system)",
          "concept_applied": "Integrated multi-concept analysis",
          "image": {
            "url": "images/complex-charge-config.png",
            "alt": "Complex charge configuration",
            "caption": "Square charge configuration for integrated analysis"
          }
        },
        {
          "title": "Field-Potential-Energy Synthesis",
          "problem": "A non-uniform electric field is given by E = (2x)î + (3y²)ĵ V/m. For a 1 μC charge moved from (0,0) to (2,1) m: (a) Calculate work done by field, (b) Find potential difference, (c) Verify conservative nature, (d) If this field exists between capacitor plates, estimate capacitance per unit area.",
          "step_by_step": [
            {
              "step": "Work calculation",
              "explanation": "W = q∫E·dl. Choose path: (0,0)→(2,0)→(2,1). First segment: E·dl = 2x dx, second: E·dl = 3y² dy"
            },
            {
              "step": "Potential difference",
              "explanation": "ΔV = -W/q = -∫E·dl"
            },
            {
              "step": "Conservative check",
              "explanation": "∇×E = (∂E_y/∂x - ∂E_x/∂y)k = (0-0)k = 0, so field is conservative"
            },
            {
              "step": "Capacitance estimate",
              "explanation": "Using average field and potential difference, C/A ≈ ε₀/(ΔV/Δx) for approximate parallel plate analogy"
            }
          ],
          "final_answer": "(a) W = -7 μJ (field does work), (b) ΔV = 7 V, (c) Conservative confirmed (curl=0), (d) C/A ≈ 1.3 nF/m² estimated",
          "concept_applied": "Field-potential-energy relationships",
          "image": {
            "url": "images/field-potential-synthesis.png",
            "alt": "Field-potential-energy synthesis",
            "caption": "Integration path for work calculation"
          }
        }
      ]
    },
    {
      "section_title": "2. Advanced Applications and Modeling",
      "introduction": "Application of electrostatic principles to complex real-world systems, numerical modeling approaches, and problems requiring creative application of fundamental concepts.",

      "key_concept": {
        "definition": "Advanced applications: Numerical field mapping, Conductor shaping for specific fields, Dielectric interface problems, Multi-scale electrostatic systems, Energy optimization in capacitor design, Electrostatic precipitation modeling, Semiconductor device electrostatics, Biological membrane potentials, Atmospheric electrostatics, Nanoscale electrostatic forces.",
        "context": "Real-world electrostatic problems often involve complex geometries, multiple materials, and scale-dependent phenomena requiring sophisticated modeling approaches and approximation methods.",
        "image": {
          "url": "images/advanced-applications.png",
          "alt": "Advanced electrostatic applications",
          "caption": "Complex applications requiring integrated understanding"
        }
      },

      "classifications": [
        {
          "type": "Application Domains and Methods",
          "value": "Classification based on application context and solution methodology",
          "characteristics": [
            "Engineering design applications",
            "Scientific research problems",
            "Numerical simulation methods",
            "Approximation techniques",
            "Multi-physics integrations",
            "Scale-dependent phenomena"
          ],
          "behavior": "Different application domains: engineering design uses electrostatic principles for device optimization; research problems explore fundamental relationships; numerical methods handle complex geometries; approximations provide insight; multi-physics combines electrostatic with other phenomena; scale effects become important at microscopic levels",
          "examples": [
            {
              "process": "Capacitor Design Optimization",
              "explanation": "Balancing capacitance, voltage rating, size, and cost by selecting appropriate dielectric materials, plate geometry, and manufacturing techniques based on electrostatic principles",
              "image": {
                "url": "images/capacitor-optimization.png",
                "alt": "Capacitor design optimization",
                "caption": "Tradeoffs in capacitor design parameters"
              }
            },
            {
              "process": "Numerical Field Modeling",
              "explanation": "Using computational methods to solve Laplace's equation with complex boundary conditions, enabling analysis of electrostatic systems without analytical solutions",
              "image": {
                "url": "images/numerical-modeling.png",
                "alt": "Numerical field modeling",
                "caption": "Computational solution of complex field problems"
              }
            }
          ],
          "note": "Real applications often require compromises between ideal electrostatic behavior and practical constraints. Numerical methods extend analytical solutions to complex geometries. Scaling laws determine which effects dominate at different size scales. Multi-physics problems require understanding how electrostatics interacts with other physical phenomena. Engineering design involves optimization across multiple competing objectives."
        }
      ],

      "principles": [
        {
          "principle": "Electrostatic Scaling and Limits",
          "statement": "Electrostatic phenomena scale differently with size, leading to dominant effects at different scales: (1) Forces scale as F ∝ q²/r², making them dominant at small distances, (2) Field strengths scale as E ∝ q/r², leading to breakdown limitations, (3) Capacitance scales as C ∝ A/d ∝ L for similar geometries, (4) Energy density scales as u ∝ E², limited by material properties, (5) At nanoscale, quantum effects and atomic discreteness become important, (6) At macroscopic scales, atmospheric breakdown and practical construction limits dominate. These scaling relationships explain why: electrostatic forces dominate over gravity for small charged particles; high-voltage systems require large spacing; miniaturized capacitors have limited energy storage; nanoscale electrostatic devices behave differently than macroscopic ones. Understanding these scaling laws enables appropriate design for different applications and recognition of fundamental limits in electrostatic systems.",
          "application": "Design electrostatic systems for specific scales. Understand limitations of miniaturization. Predict dominant effects in different regimes. Optimize systems within physical constraints. Apply appropriate models for different size scales. Recognize quantum limits in nanoscale electrostatics.",
          "example": "MEMs capacitor: at μm scale, fields can reach 10⁸ V/m before breakdown, allowing high energy density but limited absolute energy due to small size",
          "analogy": "Like building construction - different design principles apply for small houses versus skyscrapers due to scaling of various physical effects",
          "image": {
            "url": "images/scaling-laws.png",
            "alt": "Electrostatic scaling laws",
            "caption": "Scale-dependent behavior of electrostatic systems"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Electrostatic Precipitator Design",
          "problem": "An electrostatic precipitator uses parallel plates 0.2 m apart at 50 kV to remove dust particles (diameter 10 μm, charge 1000 electrons). Calculate: (a) Electric field, (b) Force on particle, (c) Terminal velocity if drag force F_drag = 6πηrv, η=1.8×10⁻⁵ Pa·s, (d) Time to cross 2 m chamber.",
          "step_by_step": [
            {
              "step": "Electric field",
              "explanation": "E = ΔV/d = 50,000/0.2 = 2.5×10⁵ V/m"
            },
            {
              "step": "Electrostatic force",
              "explanation": "F_e = qE = (1000×1.6×10⁻¹⁹)(2.5×10⁵) = 4×10⁻¹¹ N"
            },
            {
              "step": "Terminal velocity",
              "explanation": "Set F_e = F_drag: 4×10⁻¹¹ = 6π(1.8×10⁻⁵)(5×10⁻⁶)v ⇒ v = 0.0235 m/s"
            },
            {
              "step": "Transit time",
              "explanation": "t = distance/velocity = 2/0.0235 = 85 s"
            },
            {
              "step": "Design implications",
              "explanation": "Slow velocity allows multiple passes for high efficiency, but requires long chambers or multiple stages"
            }
          ],
          "final_answer": "(a) E = 250 kV/m, (b) F_e = 4×10⁻¹¹ N, (c) v_terminal = 2.35 cm/s, (d) t = 85 s. Demonstrates integration of electrostatics with fluid mechanics.",
          "concept_applied": "Multi-physics electrostatic application",
          "image": {
            "url": "images/precipitator-design.png",
            "alt": "Electrostatic precipitator design",
            "caption": "Particle motion in electric field with drag"
          }
        },
        {
          "title": "Capacitor Energy Storage Optimization",
          "problem": "Compare energy storage in: (a) Parallel plates: area 0.1 m², separation 1 mm, dielectric κ=5, E_max=50 MV/m, (b) Spherical: radii 1 cm and 2 cm, same dielectric, (c) Cylindrical: length 10 cm, radii 0.5 cm and 1 cm, same dielectric. Find maximum stored energy for each.",
          "step_by_step": [
            {
              "step": "Parallel plate",
              "explanation": "C = κε₀A/d = 4.43 nF, V_max = E_max d = 50 kV, U_max = ½CV_max² = 5.53 J"
            },
            {
              "step": "Spherical capacitor",
              "explanation": "C = 4πκε₀(ab)/(b-a) = 55.6 pF, E_max at inner sphere, V_max = E_max a(b-a)/b = 25 kV, U_max = 17.4 μJ"
            },
            {
              "step": "Cylindrical capacitor",
              "explanation": "C = 2πκε₀L/ln(b/a) = 179 pF, E_max at inner cylinder, V_max = E_max a ln(b/a) = 17.3 kV, U_max = 26.8 μJ"
            },
            {
              "step": "Comparison analysis",
              "explanation": "Parallel plate stores ~300,000× more energy due to larger volume and more efficient field usage"
            }
          ],
          "final_answer": "Maximum energy: (a) Parallel plate: 5.53 J, (b) Spherical: 17.4 μJ, (c) Cylindrical: 26.8 μJ. Parallel plate geometry is vastly superior for energy storage.",
          "concept_applied": "Geometry optimization for energy storage",
          "image": {
            "url": "images/geometry-comparison.png",
            "alt": "Capacitor geometry comparison",
            "caption": "Energy storage across different geometries"
          }
        }
      ]
    },
    {
      "section_title": "3. Comprehensive Assessment and Synthesis",
      "introduction": "Final assessment of electrostatic mastery through novel problems, concept mapping, and tasks requiring creative application of principles to unfamiliar situations.",

      "key_concept": {
        "definition": "Assessment methods: Novel problem solving, Concept mapping and relationships, Experimental design tasks, Error analysis and estimation, Limit case analysis, Multiple representation tasks, Real-world scenario applications, Research extension questions, Cross-topic integration, Self-assessment and reflection.",
        "context": "Comprehensive assessment evaluates not just computational skill but conceptual understanding, problem-solving flexibility, and ability to apply principles to new situations.",
        "image": {
          "url": "images/comprehensive-assessment.png",
          "alt": "Comprehensive assessment methods",
          "caption": "Diverse assessment approaches for complete evaluation"
        }
      },

      "classifications": [
        {
          "type": "Assessment Task Types",
          "value": "Classification based on cognitive demand and skills demonstrated",
          "characteristics": [
            "Concept explanation and justification",
            "Multi-step quantitative problems",
            "Experimental design and analysis",
            "Concept mapping and relationships",
            "Real-world application tasks",
            "Critical thinking and evaluation"
          ],
          "behavior": "Different assessment types: concept questions test fundamental understanding; quantitative problems assess computational skill; experimental tasks evaluate practical application; concept maps reveal structural knowledge; application problems test transfer ability; critical thinking assesses depth of understanding",
          "examples": [
            {
              "process": "Concept Mapping Assessment",
              "explanation": "Creating visual representations showing relationships between electrostatic concepts, forces, fields, potentials, energy, and capacitance, with mathematical connections and physical interpretations",
              "image": {
                "url": "images/concept-mapping.png",
                "alt": "Concept mapping assessment",
                "caption": "Visual representation of conceptual relationships"
              }
            },
            {
              "process": "Experimental Design Task",
              "explanation": "Designing measurements to determine unknown charge distribution or verify theoretical relationships, considering practical constraints and measurement uncertainties",
              "image": {
                "url": "images/experimental-design.png",
                "alt": "Experimental design assessment",
                "caption": "Design of electrostatic measurements"
              }
            }
          ],
          "note": "Effective assessment should evaluate both procedural skill and conceptual understanding. Novel problems test ability to apply principles in new contexts. Multiple representation tasks assess flexibility in moving between different electrostatic descriptions. Real-world applications demonstrate practical relevance. Self-assessment promotes metacognitive awareness of understanding."
        }
      ],

      "principles": [
        {
          "principle": "Metacognitive Electrostatic Understanding",
          "statement": "True mastery of electrostatics involves not just computational skill but metacognitive awareness of: (1) Which principles apply in different situations, (2) The most efficient solution approach for each problem type, (3) How to verify results through multiple methods, (4) The physical meaning and limitations of mathematical results, (5) Connections between different electrostatic representations, (6) Appropriate approximation methods for different contexts. This metacognitive understanding enables effective problem-solving by: recognizing when to use field vs potential approaches; selecting coordinate systems matching symmetry; identifying when superposition applies; understanding scaling and limiting behaviors; connecting mathematical results to physical reality; estimating reasonable answers before detailed calculation. Developing this awareness transforms electrostatic knowledge from a collection of formulas to a flexible toolkit for analyzing diverse physical situations.",
          "application": "Select optimal solution strategies. Verify results through multiple approaches. Connect mathematical results to physical meaning. Estimate answers before detailed calculation. Recognize appropriate approximations. Transfer understanding to novel situations.",
          "example": "Given complex charge distribution: recognize symmetry to simplify, choose potential approach for energy calculations, use field approach for forces, verify with limiting cases, connect to capacitance if relevant",
          "analogy": "Like an expert carpenter knowing which tool to use for each task, how to verify the work, and when different approaches are appropriate",
          "image": {
            "url": "images/metacognitive-understanding.png",
            "alt": "Metacognitive electrostatic understanding",
            "caption": "Awareness of solution strategies and verification methods"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Novel Configuration Analysis",
          "problem": "A hollow conducting sphere of radius R has a point charge Q at its center. The sphere is grounded. Then an additional charge q is placed on the sphere. Analyze the new equilibrium: (a) Charge distribution, (b) Electric field everywhere, (c) Potential everywhere, (d) Work done in adding charge q.",
          "step_by_step": [
            {
              "step": "Initial condition",
              "explanation": "With only Q at center and sphere grounded: induced charge -Q on inner surface, field zero inside conductor, potential zero on sphere"
            },
            {
              "step": "Adding charge q",
              "explanation": "Charge q distributes uniformly on outer surface (no field inside conductor), total outer charge = q"
            },
            {
              "step": "Field analysis",
              "explanation": "Inside sphere (r<R): only from central charge Q, E = kQ/r² radially. In conductor: E=0. Outside: E = k(q+Q)/r²"
            },
            {
              "step": "Potential analysis",
              "explanation": "Must satisfy Laplace's equation with boundary conditions. Sphere potential becomes k(q+Q)/R"
            },
            {
              "step": "Work calculation",
              "explanation": "Work to bring charge q from infinity to sphere against field of central charge and existing charges"
            }
          ],
          "final_answer": "Complete analysis showing: (a) Inner surface: -Q, outer surface: q+Q, (b) Field: inside kQ/r², outside k(q+Q)/r², (c) Potential: sphere at k(q+Q)/R, (d) Work = kQq/R + kq²/(2R)",
          "concept_applied": "Novel configuration with multiple concepts",
          "image": {
            "url": "images/novel-configuration.png",
            "alt": "Novel charge configuration",
            "caption": "Grounded sphere with central and surface charges"
          }
        },
        {
          "title": "Experimental Design Task",
          "problem": "Design an experiment to measure the dielectric constant of an unknown liquid using only basic lab equipment (power supply, capacitors, meters, rulers). Include: (a) Experimental setup, (b) Measurements needed, (c) Data analysis method, (d) Error sources and minimization.",
          "step_by_step": [
            {
              "step": "Experimental concept",
              "explanation": "Use parallel plate capacitor, measure capacitance with and without dielectric, C = κC₀"
            },
            {
              "step": "Setup design",
              "explanation": "Construct parallel plates with variable separation, immerse in liquid, measure capacitance"
            },
            {
              "step": "Measurements",
              "explanation": "Plate area A, separation d, capacitance C with liquid, capacitance C₀ with air (or calculated)"
            },
            {
              "step": "Analysis method",
              "explanation": "κ = C/C₀, with C₀ = ε₀A/d. Plot C vs 1/d for verification"
            },
            {
              "step": "Error analysis",
              "explanation": "Fringing field corrections, edge effects, temperature dependence, conductivity of liquid, measurement precision"
            }
          ],
          "final_answer": "Complete experimental design: Parallel plate capacitor immersed in liquid, measure C and geometry, calculate κ = Cd/(ε₀A). Address fringing fields using guard rings or calibration, control temperature, use AC measurement to avoid conduction effects.",
          "concept_applied": "Experimental design and error analysis",
          "image": {
            "url": "images/experimental-design-task.png",
            "alt": "Dielectric constant measurement",
            "caption": "Experimental setup for dielectric measurement"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Concept integration",
    "Field-potential relationships",
    "Energy conservation",
    "Superposition principle",
    "Boundary conditions",
    "Scaling laws",
    "Metacognition",
    "Multi-physics applications",
    "Numerical modeling",
    "Experimental design"
  ],

  "common_misconceptions": [
    "Thinking electric field and potential are independent concepts",
    "Believing conductors can have internal fields in equilibrium",
    "Confusing stored energy with power delivery capability",
    "Thinking capacitance depends on voltage or charge",
    "Believing electrostatic forces can form stable equilibria without constraints",
    "Confusing field lines with particle trajectories"
  ],

  "real_world_applications": [
    "Semiconductor device design and modeling",
    "Electrostatic precipitation systems",
    "Capacitor design and optimization",
    "Medical equipment (defibrillators, EEG)",
    "Particle accelerator beam control",
    "Nanoscale electrostatic devices",
    "Atmospheric electricity studies",
    "Materials processing applications",
    "Energy storage system design",
    "Sensor and actuator design"
  ],

  "summary": "Unit 4 review integrates Coulomb's Law, electric fields, potential, capacitance, and energy storage into a unified electrostatic framework. Mastery involves: fluid movement between different representations (forces, fields, potentials, energy); recognizing optimal solution strategies for different problems; applying principles to novel situations; understanding scaling laws and physical limits; connecting mathematical results to physical reality. Comprehensive assessment evaluates conceptual understanding, problem-solving flexibility, experimental design capability, and ability to apply principles to real-world applications. This integrated perspective transforms electrostatic knowledge from isolated formulas to a powerful toolkit for analyzing diverse physical systems across multiple scales and applications."
}