{
  "flashcards": [
    {
      "category": "Balancing Equations & Types of Reactions",
      "cards": [
        {
          "front": "What is a **chemical reaction**?",
          "back": "A process in which one or more substances are converted into new substances with different physical and chemical properties."
        },
        {
          "front": "What are **reactants** and **products**?",
          "back": "Reactants are the starting substances in a reaction (left side); products are the substances formed (right side)."
        },
        {
          "front": "What is a **chemical equation**?",
          "back": "A representation of a chemical reaction using symbols and formulas."
        },
        {
          "front": "What is a **balanced chemical equation**?",
          "back": "An equation with the same number of atoms of each element on both sides, satisfying the Law of Conservation of Mass."
        },
        {
          "front": "What are **coefficients** in a chemical equation?",
          "back": "Small whole numbers placed in front of formulas to balance the equation; they represent the number of moles or molecules."
        },
        {
          "front": "What is a **synthesis (combination) reaction**?",
          "back": "A reaction where two or more substances combine to form a single new compound ($A + B \\rightarrow AB$)."
        },
        {
          "front": "What is a **decomposition reaction**?",
          "back": "A reaction where a single compound breaks down into two or more simpler substances ($AB \\rightarrow A + B$)."
        },
        {
          "front": "What is a **single-replacement reaction**?",
          "back": "A reaction where one element replaces another element in a compound ($A + BC \\rightarrow AC + B$)."
        },
        {
          "front": "What is a **double-replacement reaction**?",
          "back": "A reaction where ions of two compounds exchange places in an aqueous solution to form two new compounds ($AB + CD \\rightarrow AD + CB$)."
        },
        {
          "front": "What is a **combustion reaction**?",
          "back": "A reaction where a substance (usually a hydrocarbon) reacts with oxygen, releasing energy in the form of light and heat, and producing $CO_2$ and $H_2O$."
        },
        {
          "front": "What is an **exothermic reaction**?",
          "back": "A reaction that releases energy to its surroundings (temperature of surroundings increases)."
        },
        {
          "front": "What is an **endothermic reaction**?",
          "back": "A reaction that absorbs energy from its surroundings (temperature of surroundings decreases)."
        },
        {
          "front": "What is **activation energy**?",
          "back": "The minimum amount of energy required to initiate a chemical reaction."
        },
        {
          "front": "What is a **catalyst**?",
          "back": "A substance that speeds up a chemical reaction by lowering the activation energy without being consumed itself."
        },
        {
          "front": "What is an **inhibitor**?",
          "back": "A substance used to slow down or prevent a chemical reaction."
        },
        {
          "front": "What does the symbol **(s), (l), (g), and (aq)** stand for?",
          "back": "Solid, Liquid, Gas, and Aqueous (dissolved in water)."
        },
        {
          "front": "What is a **precipitate**?",
          "back": "An insoluble solid that emerges from a liquid solution during a chemical reaction."
        },
        {
          "front": "What is the **activity series**?",
          "back": "A list of elements organized according to the ease with which they undergo certain chemical reactions, used to predict single-replacement outcomes."
        },
        {
          "front": "What is a **neutralization reaction**?",
          "back": "A specific type of double-replacement reaction between an acid and a base to produce water and a salt."
        },
        {
          "front": "What is a **reversible reaction**?",
          "back": "A reaction in which the conversion of reactants to products and the conversion of products to reactants occur simultaneously."
        }
      ]
    }
  ]
}
