{
  "flashcards": [
    {
      "category": "Environmental Chemistry",
      "cards": [
        {
          "front": "What is the **composition of clean, dry air**?",
          "back": "Approximately 78% Nitrogen ($N_2$), 21% Oxygen ($O_2$), and 1% Argon and other noble gases, with small amounts of Carbon Dioxide ($CO_2$)."
        },
        {
          "front": "What are **greenhouse gases**?",
          "back": "Gases like carbon dioxide ($CO_2$), methane ($CH_4$), and water vapor that trap heat in the atmosphere, contributing to the greenhouse effect."
        },
        {
          "front": "What is the **greenhouse effect**?",
          "back": "The process by which radiation from a planet's atmosphere warms the planet's surface to a temperature above what it would be without its atmosphere."
        },
        {
          "front": "What is **global warming**?",
          "back": "The long-term heating of Earth's climate system observed since the pre-industrial period due to human activities, primarily fossil fuel burning."
        },
        {
          "front": "What causes **acid rain**?",
          "back": "Sulfur dioxide ($SO_2$) and nitrogen oxides ($NO_x$) reacting with water, oxygen, and other chemicals in the atmosphere to form sulfuric and nitric acids."
        },
        {
          "front": "What is the **ozone layer** and why is it important?",
          "back": "A region of Earth's stratosphere that absorbs most of the Sun's harmful ultraviolet (UV) radiation."
        },
        {
          "front": "What are **CFCs (Chlorofluorocarbons)**?",
          "back": "Chemicals formerly used in aerosols and refrigerants that destroy the ozone layer by releasing chlorine atoms when exposed to UV light."
        },
        {
          "front": "What is **photochemical smog**?",
          "back": "A type of air pollution formed when sunlight reacts with nitrogen oxides and at least one volatile organic compound (VOC) in the atmosphere."
        },
        {
          "front": "What is **eutrophication**?",
          "back": "The process by which a body of water becomes overly enriched with minerals and nutrients (like phosphates and nitrates), leading to excessive growth of algae and depletion of oxygen."
        },
        {
          "front": "What is the **carbon cycle**?",
          "back": "The process by which carbon compounds are interchanged among the biosphere, geosphere, hydrosphere, and atmosphere of the Earth."
        },
        {
          "front": "What is **carbon footprint**?",
          "back": "The total amount of greenhouse gases (including carbon dioxide and methane) that are generated by our actions."
        },
        {
          "front": "What is **particulate matter (PM)**?",
          "back": "Microscopic solid or liquid matter suspended in the atmosphere of Earth, which can cause respiratory health issues."
        },
        {
          "front": "How do **catalytic converters** reduce air pollution?",
          "back": "They convert harmful exhaust gases like carbon monoxide ($CO$) and nitrogen oxides into less harmful substances like $CO_2$ and $N_2$."
        },
        {
          "front": "What is **desalination**?",
          "back": "The process of removing salt and other minerals from saline water (usually seawater) to make it fit for human consumption or irrigation."
        },
        {
          "front": "What is **biomagnification**?",
          "back": "The concentration of toxins in an organism as a result of its ingesting other plants or animals in which the toxins are more widely disbursed."
        },
        {
          "front": "What is **biodegradability**?",
          "back": "The ability of a substance to be broken down naturally by microorganisms, such as bacteria or fungi."
        },
        {
          "front": "What are **renewable resources**?",
          "back": "Resources that can be replenished naturally over time, such as solar, wind, and geothermal energy."
        },
        {
          "front": "What are **non-renewable resources**?",
          "back": "Resources that exist in finite amounts and cannot be replaced once they are consumed, such as fossil fuels (coal, oil, natural gas)."
        },
        {
          "front": "What is **Green Chemistry**?",
          "back": "The design of chemical products and processes that reduce or eliminate the use and generation of hazardous substances."
        },
        {
          "front": "What is the role of **carbon capture and storage (CCS)**?",
          "back": "A technology that can capture up to 90% of the $CO_2$ emissions produced from the use of fossil fuels in electricity generation and industrial processes, preventing it from entering the atmosphere."
        }
      ]
    }
  ]
}
