{
  "flashcards": [
    {
      "category": "Chemistry & Lab Safety",
      "cards": [
        {
          "front": "What is **chemistry**?",
          "back": "The study of matter, its properties, how and why substances combine or separate to form other substances, and how substances interact with energy."
        },
        {
          "front": "What are the **WHMIS** symbols?",
          "back": "Workplace Hazardous Materials Information System symbols that warn of potential dangers associated with chemicals."
        },
        {
          "front": "What is **MSDS**?",
          "back": "Material Safety Data Sheet - a document that provides detailed information about a chemical's properties, hazards, and safety procedures."
        },
        {
          "front": "What should you always wear in the chemistry lab?",
          "back": "Safety goggles, lab coat/apron, and closed-toe shoes."
        },
        {
          "front": "What should you do if a chemical gets in your eyes?",
          "back": "Immediately flush eyes with water for at least 15 minutes and notify the instructor."
        },
        {
          "front": "How should you smell a chemical in the lab?",
          "back": "Use the 'wafting' technique - gently wave the air above the container toward your nose."
        },
        {
          "front": "What is the proper way to dispose of chemicals in the lab?",
          "back": "Follow specific disposal instructions for each chemical - never pour down the drain unless instructed."
        },
        {
          "front": "What should you do with long hair in the lab?",
          "back": "Tie it back to prevent contact with chemicals, flames, or equipment."
        },
        {
          "front": "What is **never** allowed in a chemistry lab?",
          "back": "Eating, drinking, chewing gum, or applying cosmetics."
        },
        {
          "front": "How should you handle broken glass?",
          "back": "Use a dustpan and brush - never with bare hands. Place in designated broken glass container."
        },
        {
          "front": "What should you do before leaving the lab?",
          "back": "Clean your work area, wash your hands, and return all equipment to its proper place."
        },
        {
          "front": "What does the **flame symbol** indicate?",
          "back": "Flammable material - keep away from heat, sparks, and open flames."
        },
        {
          "front": "What does the **skull and crossbones symbol** indicate?",
          "back": "Poisonous/Toxic material - can cause serious health effects or death."
        },
        {
          "front": "What does the **corrosion symbol** indicate?",
          "back": "Corrosive material - can cause severe skin burns and eye damage."
        },
        {
          "front": "What does the **exploding bomb symbol** indicate?",
          "back": "Explosive material - may explode if heated, shocked, or under pressure."
        },
        {
          "front": "What is the **fire blanket** used for?",
          "back": "To smother clothing fires or wrap around a person whose clothes are on fire."
        },
        {
          "front": "Where is the **emergency shower** located and when should it be used?",
          "back": "Typically in a central location; used for chemical spills on the body - remove contaminated clothing and rinse for at least 15 minutes."
        },
        {
          "front": "What is the difference between **accuracy** and **precision**?",
          "back": "Accuracy is how close a measurement is to the true value; precision is how close repeated measurements are to each other."
        },
        {
          "front": "What are **significant figures**?",
          "back": "The digits in a measurement that are known with certainty plus one estimated digit."
        },
        {
          "front": "What is the **scientific method**?",
          "back": "A systematic approach to problem-solving: observation, hypothesis, experiment, data analysis, conclusion."
        },
        {
          "front": "What is a **hypothesis**?",
          "back": "A testable prediction or explanation for an observation."
        },
        {
          "front": "What is the **control** in an experiment?",
          "back": "The standard for comparison that does not receive the experimental treatment."
        },
        {
          "front": "What are **independent** and **dependent variables**?",
          "back": "Independent variable is what you change; dependent variable is what you measure as a result."
        },
        {
          "front": "What are **constants** in an experiment?",
          "back": "Factors that remain the same throughout the experiment."
        },
        {
          "front": "What is **qualitative data**?",
          "back": "Descriptive data (color, odor, texture) rather than numerical measurements."
        },
        {
          "front": "What is **quantitative data**?",
          "back": "Numerical data (mass, volume, temperature) that can be measured."
        },
        {
          "front": "What should you do if you spill a chemical?",
          "back": "Notify the instructor immediately and follow specific cleanup procedures for that chemical."
        },
        {
          "front": "How should you heat test tubes?",
          "back": "Point them away from yourself and others, move the tube through the flame, never heat a closed container."
        },
        {
          "front": "What is the proper way to read a meniscus?",
          "back": "Read at eye level at the bottom of the concave curve for water and most liquids."
        },
        {
          "front": "What is **matter**?",
          "back": "Anything that has mass and takes up space (volume)."
        },
        {
          "front": "What are the **states of matter**?",
          "back": "Solid, liquid, gas, and plasma."
        },
        {
          "front": "What is a **physical property**?",
          "back": "A characteristic that can be observed or measured without changing the substance's identity."
        },
        {
          "front": "What is a **chemical property**?",
          "back": "A characteristic that describes how a substance reacts with other substances to form new substances."
        },
        {
          "front": "What is a **physical change**?",
          "back": "A change in the form or state of matter without changing its chemical composition."
        },
        {
          "front": "What is a **chemical change**?",
          "back": "A change that produces one or more new substances with different properties."
        },
        {
          "front": "What are examples of **lab safety equipment**?",
          "back": "Fire extinguisher, fire blanket, eyewash station, safety shower, fume hood, first aid kit."
        },
        {
          "front": "Why should you never return unused chemicals to their original containers?",
          "back": "To prevent contamination of the entire stock."
        },
        {
          "front": "How should you transport chemicals in the lab?",
          "back": "Use appropriate containers, hold them securely with both hands, and keep them away from your body."
        },
        {
          "front": "What is the purpose of a **fume hood**?",
          "back": "To ventilate harmful fumes, vapors, or dust away from the user."
        },
        {
          "front": "What is **Good Laboratory Practice (GLP)**?",
          "back": "A set of principles that ensure the quality and integrity of laboratory data and procedures."
        }
      ]
    }
  ]
}
