{
  "flashcards": [
    {
      "category": "Water & Solution Chemistry",
      "cards": [
        {
          "front": "Why is water called the **universal solvent**?",
          "back": "Because its polar nature allows it to dissolve a wide variety of ionic and polar substances."
        },
        {
          "front": "What is **hydrogen bonding** in water?",
          "back": "The strong intermolecular attraction between the partially positive hydrogen of one water molecule and the partially negative oxygen of another."
        },
        {
          "front": "What is the difference between a **solute** and a **solvent**?",
          "back": "The solute is the substance being dissolved; the solvent is the substance doing the dissolving (usually present in larger amount)."
        },
        {
          "front": "What is a **solution**?",
          "back": "A homogeneous mixture of two or more substances in a single phase."
        },
        {
          "front": "What is an **aqueous solution**?",
          "back": "A solution in which water is the solvent."
        },
        {
          "front": "What is **solubility**?",
          "back": "The maximum amount of solute that can dissolve in a specific amount of solvent at a given temperature and pressure."
        },
        {
          "front": "What is a **saturated solution**?",
          "back": "A solution containing the maximum amount of dissolved solute for a given amount of solvent at a specific temperature."
        },
        {
          "front": "What is an **unsaturated solution**?",
          "back": "A solution that contains less solute than a saturated solution under the same conditions."
        },
        {
          "front": "What is a **supersaturated solution**?",
          "back": "A solution that contains more dissolved solute than a saturated solution at the same temperature; it is highly unstable."
        },
        {
          "front": "How does **temperature** affect the solubility of solids in liquids?",
          "back": "Generally, as temperature increases, the solubility of solid solutes increases."
        },
        {
          "front": "How does **temperature** affect the solubility of gases in liquids?",
          "back": "As temperature increases, the solubility of gases decreases (e.g., warm soda goes flat faster)."
        },
        {
          "front": "What is **Henry's Law**?",
          "back": "The solubility of a gas in a liquid is directly proportional to the partial pressure of that gas above the liquid."
        },
        {
          "front": "What are **colligative properties**?",
          "back": "Properties that depend on the number of solute particles in a solution, but not their identity (e.g., boiling point elevation, freezing point depression)."
        },
        {
          "front": "What is **freezing point depression**?",
          "back": "The decrease in the freezing point of a solvent caused by the addition of a non-volatile solute (e.g., salting icy roads)."
        },
        {
          "front": "What is **boiling point elevation**?",
          "back": "The increase in the boiling point of a solvent caused by the addition of a non-volatile solute."
        },
        {
          "front": "What is an **electrolyte**?",
          "back": "A substance that dissolves in water to give a solution that conducts electricity (usually ionic compounds or strong acids)."
        },
        {
          "front": "What is a **non-electrolyte**?",
          "back": "A substance that dissolves in water to give a solution that does not conduct electricity (e.g., sugar, ethanol)."
        },
        {
          "front": "What is **molarity (M)**?",
          "back": "The concentration of a solution expressed as moles of solute per liter of solution ($M = \text{mol/L}$)."
        },
        {
          "front": "What is the **dilution equation**?",
          "back": "$M_1V_1 = M_2V_2$, where $M$ is molarity and $V$ is volume."
        },
        {
          "front": "What is **surface tension**?",
          "back": "An inward force that tends to minimize the surface area of a liquid, caused by hydrogen bonding in water."
        }
      ]
    }
  ]
}
