{
  "expanded_description": "If matrix multiplication is the engine of linear algebra, then inverse matrices are the steering wheel. Just as the number 1 is the multiplicative identity for real numbers (3 · 1 = 3), and the reciprocal (or multiplicative inverse) of 3 is 1/3 because 3 · (1/3) = 1, matrices have their own identity and inverses. The identity matrix leaves any matrix unchanged when multiplied. The inverse of a matrix A, denoted A⁻¹, is a special matrix that undoes A's transformation: when multiplied together, they produce the identity matrix. This concept is the gateway to solving systems of equations, decoding messages, and reversing geometric transformations.",
  "core_concept": {
    "principle": "The identity matrix I is a square matrix with 1s on the main diagonal and 0s elsewhere. For any square matrix A of the same dimensions, AI = IA = A. The inverse of a square matrix A, denoted A⁻¹, is a matrix of the same dimensions such that AA⁻¹ = A⁻¹A = I. Not all matrices have inverses; those that do are called invertible or non-singular.",
    "explanation": "Think of the identity matrix as the 'do nothing' transformation — it maps every vector to itself. The inverse matrix is the 'undo' button. If A rotates a shape 90 degrees clockwise, then A⁻¹ rotates it 90 degrees counterclockwise, returning it to its original orientation. For a 2x2 matrix, finding the inverse follows a specific formula involving its determinant. The existence of an inverse is tied directly to the determinant: if the determinant is zero, the matrix has no inverse (it is singular) and flattens space into a lower dimension, a process that cannot be undone."
  },
  "sections": [
    {
      "section_title": "The Identity Matrix — The Matrix Equivalent of 1",
      "introduction": "Before we can understand inverses, we must first understand the identity matrix. It serves as the benchmark: the matrix that changes nothing. It appears in every equation involving inverses and is essential for verifying your work.",
      "key_concept": {
        "definition": "The identity matrix of size n, written Iₙ, is an n × n square matrix with 1s on the main diagonal (top-left to bottom-right) and 0s everywhere else. For any matrix A where the multiplication is defined, AI = A and IA = A.",
        "context": "The identity matrix is to matrix multiplication what the number 1 is to regular multiplication. Just as 5 · 1 = 5 and 1 · 5 = 5, multiplying any compatible matrix by the identity leaves it unchanged. The subscript n indicates the size, but when the dimensions are clear from context, it is often written simply as I. The identity matrix is always square, but it can multiply non-square matrices as long as the dimensions align: if A is m × n, then IₘA = A and AIₙ = A."
      },
      "classifications": [
        {
          "type": "Structure of the Identity Matrix",
          "value": "Memorize this pattern — it appears constantly in inverse calculations and matrix equations.",
          "characteristics": [
            "Square matrix: dimensions n × n",
            "Main diagonal entries (where row = column) are all 1: a₁₁ = 1, a₂₂ = 1, ..., aₙₙ = 1",
            "All off-diagonal entries (where row ≠ column) are 0",
            "I₂ = [[1, 0], [0, 1]]",
            "I₃ = [[1, 0, 0], [0, 1, 0], [0, 0, 1]]",
            "I₄ extends the pattern: ones on diagonal, zeros elsewhere"
          ],
          "behavior": "When multiplying by the identity, the original matrix remains unchanged. This property is used to verify that a candidate matrix is indeed the inverse: if you multiply a matrix by its claimed inverse and the result is I, you have found the correct inverse.",
          "examples": [
            {
              "process": "Multiplying by I₂",
              "explanation": "Let A = [[3, -2, 5], [1, 0, 4]] (2 × 3). I₂ is 2 × 2. I₂A = [[1,0],[0,1]] · [[3,-2,5],[1,0,4]] = [[1·3+0·1, 1·(-2)+0·0, 1·5+0·4], [0·3+1·1, 0·(-2)+1·0, 0·5+1·4]] = [[3, -2, 5], [1, 0, 4]] = A. The identity on the left leaves A unchanged."
            },
            {
              "process": "Multiplying by I₃",
              "explanation": "Let B = [[2, 1], [7, -3], [0, 5]] (3 × 2). I₃ is 3 × 3. I₃B = [[1,0,0],[0,1,0],[0,0,1]] · [[2,1],[7,-3],[0,5]] = [[1·2+0·7+0·0, 1·1+0·(-3)+0·5], [0·2+1·7+0·0, 0·1+1·(-3)+0·5], [0·2+0·7+1·0, 0·1+0·(-3)+1·5]] = [[2,1],[7,-3],[0,5]] = B. The identity on the left leaves B unchanged."
            }
          ]
        }
      ]
    },
    {
      "section_title": "The Inverse of a 2×2 Matrix — The Formula",
      "introduction": "For 2×2 matrices, the inverse follows a clean, memorable pattern: swap the positions of a and d, change the signs of b and c, and divide everything by the determinant. This formula is a lifeline on exams — memorize it cold.",
      "key_concept": {
        "definition": "For a 2×2 matrix A = [[a, b], [c, d]], the inverse A⁻¹ exists if and only if the determinant ad − bc ≠ 0. When it exists, A⁻¹ = (1/(ad − bc)) · [[d, −b], [−c, a]].",
        "context": "The formula has two parts. The scalar factor 1/(ad − bc) is the reciprocal of the determinant. The matrix [[d, −b], [−c, a]] is the adjugate (or classical adjoint) of A. Notice the pattern: a and d swap places on the main diagonal, while b and c change sign and move to the off-diagonal positions. This pattern is specific to 2×2 matrices and does not generalize to larger sizes, which require more complex methods."
      },
      "classifications": [
        {
          "type": "The Determinant — The Gatekeeper",
          "value": "Always compute the determinant first — it tells you if an inverse exists.",
          "characteristics": [
            "For A = [[a, b], [c, d]], det(A) = ad − bc",
            "If det(A) = 0, the matrix is singular and has no inverse",
            "If det(A) ≠ 0, the matrix is invertible (non-singular)",
            "The determinant can be positive, negative, or fractional — any non-zero value means an inverse exists",
            "The determinant appears in the denominator of the scalar factor, hence it cannot be zero"
          ],
          "behavior": "Step 1: Identify a, b, c, d from the matrix. Step 2: Compute ad − bc. Step 3: If the result is 0, write 'no inverse' or 'singular' and stop. If non-zero, proceed to the next step. This check prevents wasted time applying the formula to a matrix that has no inverse.",
          "examples": [
            {
              "process": "Determinant Non-Zero — Inverse Exists",
              "explanation": "A = [[4, 3], [2, 5]]. a=4, b=3, c=2, d=5. det = (4·5) − (3·2) = 20 − 6 = 14 ≠ 0. Inverse exists."
            },
            {
              "process": "Determinant Zero — No Inverse",
              "explanation": "B = [[2, 4], [1, 2]]. a=2, b=4, c=1, d=2. det = (2·2) − (4·1) = 4 − 4 = 0. No inverse exists. Matrix B is singular. Notice that the second row is half the first row — the rows are linearly dependent, which always leads to a zero determinant."
            }
          ]
        },
        {
          "type": "Applying the 2×2 Inverse Formula",
          "value": "Once the determinant is confirmed non-zero, apply the formula systematically.",
          "characteristics": [
            "Swap a and d: put d in the top-left, a in the bottom-right",
            "Negate b and c: put −b in the top-right, −c in the bottom-left",
            "Multiply the entire resulting matrix by 1/(det)",
            "The scalar multiplication applies to every entry of the adjugate matrix"
          ],
          "behavior": "Work step by step. First, write the adjugate matrix [[d, −b], [−c, a]] without the scalar factor. Then, multiply every entry of that matrix by 1/(ad − bc). Simplify fractions if possible. Double-check that the signs are correct — the most common error is forgetting to negate b and c, or negating the wrong ones.",
          "examples": [
            {
              "process": "Finding a 2×2 Inverse",
              "explanation": "A = [[2, 5], [1, 3]]. a=2, b=5, c=1, d=3. det = (2·3) − (5·1) = 6 − 5 = 1. Adjugate: [[d, −b], [−c, a]] = [[3, −5], [−1, 2]]. Multiply by 1/det = 1/1 = 1, so A⁻¹ = [[3, −5], [−1, 2]]. Verification: [[2,5],[1,3]]·[[3,-5],[-1,2]] = [[2·3+5·(-1), 2·(-5)+5·2], [1·3+3·(-1), 1·(-5)+3·2]] = [[6-5, -10+10], [3-3, -5+6]] = [[1,0],[0,1]] = I₂ ✓."
            },
            {
              "process": "Inverse with a Fractional Scalar",
              "explanation": "A = [[4, 7], [2, 6]]. a=4, b=7, c=2, d=6. det = (4·6) − (7·2) = 24 − 14 = 10. Adjugate: [[6, −7], [−2, 4]]. A⁻¹ = (1/10)·[[6, −7], [−2, 4]] = [[6/10, -7/10], [-2/10, 4/10]] = [[3/5, -7/10], [-1/5, 2/5]]. Leave as fractions in simplified form or decimals if preferred, but fractions are typically more exact."
            },
            {
              "process": "Inverse with Negative Entries",
              "explanation": "A = [[-3, 2], [4, -1]]. a=-3, b=2, c=4, d=-1. det = (-3·-1) − (2·4) = 3 − 8 = -5. Adjugate: [[d, −b], [−c, a]] = [[-1, -2], [-4, -3]]. Multiply by 1/det = 1/(-5) = -1/5. A⁻¹ = (-1/5)·[[-1, -2], [-4, -3]] = [[1/5, 2/5], [4/5, 3/5]]. Watch the signs carefully — the negative scalar flips all signs in the adjugate."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Verifying Inverses",
      "introduction": "The definition of an inverse is AA⁻¹ = I and A⁻¹A = I. This property is not just a definition — it is a powerful verification tool. If you compute a candidate inverse, you can always check your work by multiplying it with the original matrix.",
      "key_concept": {
        "definition": "A matrix B is the inverse of A if and only if AB = I and BA = I. Both products must equal the identity matrix of the appropriate size.",
        "context": "For square matrices, if AB = I, then it automatically follows that BA = I, but it is good practice to verify both, especially when first learning. This verification catches sign errors, arithmetic mistakes, and incorrect application of the formula. It also reinforces the non-commutative nature of matrix multiplication — you must multiply in both orders to be thorough."
      },
      "categories": [
        {
          "type": "Checking Your Work",
          "description": "After computing A⁻¹, multiply it by A (in both orders) to confirm the result is I.",
          "detailed_mechanism": "Step 1: Multiply A by your candidate inverse. Perform the full matrix multiplication row-by-column. Step 2: Check that every entry matches the identity matrix: 1s on the diagonal, 0s elsewhere. Step 3: Multiply in the opposite order (candidate inverse by A). Step 4: Verify this product also equals I. If either product is not I, your candidate inverse is incorrect.",
          "examples": [
            {
              "process": "Verifying an Inverse",
              "explanation": "A = [[2,5],[1,3]]. Candidate A⁻¹ = [[3,-5],[-1,2]]. Check AB: [[2,5],[1,3]]·[[3,-5],[-1,2]] = [[2·3+5·(-1), 2·(-5)+5·2], [1·3+3·(-1), 1·(-5)+3·2]] = [[6-5, -10+10], [3-3, -5+6]] = [[1,0],[0,1]] = I ✓. Check BA: [[3,-5],[-1,2]]·[[2,5],[1,3]] = [[3·2+(-5)·1, 3·5+(-5)·3], [(-1)·2+2·1, (-1)·5+2·3]] = [[6-5, 15-15], [-2+2, -5+6]] = [[1,0],[0,1]] = I ✓. Verified."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Singular Matrices — When Inverses Fail",
      "introduction": "Not every matrix has an inverse. Matrices without inverses are called singular or non-invertible. Recognizing them is just as important as computing inverses for matrices that have them.",
      "key_concept": {
        "definition": "A square matrix is singular if its determinant is zero. Singular matrices have no multiplicative inverse. Geometrically, a singular matrix maps the plane onto a line or a point, squashing all area to zero — a transformation that cannot be reversed.",
        "context": "Singular matrices are not just a mathematical curiosity — they signal that a system of equations has either no solution or infinitely many solutions. In applications, a singular matrix might indicate redundant information or a situation where unique answers are impossible. The determinant being zero is the algebraic signal that the rows or columns are linearly dependent (one row is a multiple of another, or a combination of others)."
      },
      "classifications": [
        {
          "type": "Identifying Singular Matrices",
          "value": "If det = 0, stop — no inverse exists.",
          "characteristics": [
            "Determinant equals zero",
            "Rows are linearly dependent (one row can be expressed as a combination of others)",
            "Columns are linearly dependent",
            "The matrix reduces the dimension of space when applied as a transformation",
            "The matrix cannot be reversed uniquely"
          ],
          "behavior": "When asked to find the inverse, always compute the determinant first. If it is zero, the answer is simply 'no inverse' or 'singular'. Do not attempt to apply the inverse formula — it involves division by zero, which is undefined.",
          "examples": [
            {
              "process": "A Singular Matrix",
              "explanation": "A = [[2, 4], [1, 2]]. det = (2·2) − (4·1) = 4 − 4 = 0. A is singular. Notice that the second row is exactly half the first row: [1,2] = (1/2)·[2,4]. The rows are multiples, so they are dependent. No inverse exists."
            },
            {
              "process": "Another Singular Matrix",
              "explanation": "B = [[3, -6], [-2, 4]]. det = (3·4) − (-6·-2) = 12 − 12 = 0. Singular. The second column is −2 times the first column: [-6,4] = -2·[3,-2]. Column dependence also yields a zero determinant."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Real-World Context — Why Inverses Matter",
      "introduction": "Inverses are the mathematical embodiment of 'undoing' an action. Whenever a process is represented by a matrix, its inverse represents the reverse process. This has profound applications across science and engineering.",
      "key_concept": {
        "definition": "If a matrix A represents a transformation, an encoding scheme, or a system of relationships, then A⁻¹ represents the inverse transformation, the decoding scheme, or the solution to the system.",
        "context": "In computer graphics, the inverse of a rotation matrix rotates objects back to their original orientation. In cryptography, the inverse of an encoding matrix decodes an encrypted message. In economics, the inverse of an input-output matrix reveals the production levels needed to meet a given demand. The concept of an inverse is universal: it is the matrix that answers the question, 'What do I need to start with to get this result?'"
      },
      "categories": [
        {
          "type": "Solving Systems of Equations (Preview)",
          "description": "A system of linear equations can be written as a single matrix equation: Ax = b. If A is invertible, the solution is x = A⁻¹b.",
          "detailed_mechanism": "Given the system 2x + 5y = 11 and x + 3y = 6, we can write A = [[2,5],[1,3]], x = [x,y]ᵀ, and b = [11,6]ᵀ. Then Ax = b. Multiplying both sides on the left by A⁻¹ gives A⁻¹Ax = A⁻¹b → Ix = A⁻¹b → x = A⁻¹b. This is the foundation of Section 14.4.",
          "examples": [
            {
              "process": "System Solution Preview",
              "explanation": "From earlier, A = [[2,5],[1,3]] has inverse A⁻¹ = [[3,-5],[-1,2]]. For b = [11,6]ᵀ, x = A⁻¹b = [[3,-5],[-1,2]]·[11,6]ᵀ = [3·11 + (-5)·6, (-1)·11 + 2·6] = [33-30, -11+12] = [3, 1]. So x=3, y=1 solves the system."
            }
          ]
        },
        {
          "type": "Cryptography (Preview)",
          "description": "Messages can be encoded by multiplying a message matrix by an invertible encoding matrix. The inverse matrix decodes the message.",
          "detailed_mechanism": "If a message is converted to numbers and arranged in a matrix M, the encoded message is E = AM. The recipient, knowing A⁻¹, computes A⁻¹E = A⁻¹(AM) = (A⁻¹A)M = IM = M, recovering the original message. Without the inverse, decoding is practically impossible.",
          "examples": [
            {
              "process": "Encoding/Decoding Concept",
              "explanation": "This is the core idea behind Section 14.9. The security of such a system relies on the fact that only those with the inverse matrix can easily recover the original message."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Worked Examples — Full Multi-Step Problems",
      "introduction": "These examples combine determinant calculation, the inverse formula, verification, and applications. They represent the depth of understanding expected on assessments.",
      "key_concept": {
        "definition": "Multi-step inverse problems require: (1) computing the determinant to check invertibility, (2) applying the inverse formula correctly, (3) simplifying fractions, and (4) optionally verifying the result by multiplication.",
        "context": "The most important habit: never skip the determinant check. It is the gatekeeper. After applying the formula, verification is the safety net that catches sign errors and arithmetic mistakes."
      },
      "worked_examples": [
        {
          "title": "Finding and Verifying a 2×2 Inverse",
          "problem": "Find A⁻¹ for A = [[5, 3], [2, 1]]. Verify your answer.",
          "step_by_step": [
            {
              "step": "Compute the Determinant",
              "explanation": "Identify a, b, c, d and compute ad − bc.",
              "calculation": "a=5, b=3, c=2, d=1. det = (5·1) − (3·2) = 5 − 6 = -1 ≠ 0. Inverse exists."
            },
            {
              "step": "Write the Adjugate Matrix",
              "explanation": "Swap a and d; negate b and c.",
              "calculation": "Adjugate = [[d, -b], [-c, a]] = [[1, -3], [-2, 5]]"
            },
            {
              "step": "Multiply by 1/det",
              "explanation": "Multiply every entry of the adjugate by 1/(-1) = -1.",
              "calculation": "A⁻¹ = -1 · [[1, -3], [-2, 5]] = [[-1, 3], [2, -5]]"
            },
            {
              "step": "Verify AA⁻¹ = I",
              "explanation": "Multiply A by the candidate inverse.",
              "calculation": "[[5,3],[2,1]]·[[-1,3],[2,-5]] = [[5·(-1)+3·2, 5·3+3·(-5)], [2·(-1)+1·2, 2·3+1·(-5)]] = [[-5+6, 15-15], [-2+2, 6-5]] = [[1,0],[0,1]] = I ✓."
            },
            {
              "step": "Verify A⁻¹A = I (Optional but Recommended)",
              "explanation": "Multiply the candidate inverse by A.",
              "calculation": "[[-1,3],[2,-5]]·[[5,3],[2,1]] = [[-1·5+3·2, -1·3+3·1], [2·5+(-5)·2, 2·3+(-5)·1]] = [[-5+6, -3+3], [10-10, 6-5]] = [[1,0],[0,1]] = I ✓."
            }
          ],
          "final_answer": "A⁻¹ = [[-1, 3], [2, -5]]",
          "concept_applied": "The full workflow: determinant → adjugate → scalar multiplication → verification. Both orders of multiplication confirm correctness."
        },
        {
          "title": "Handling a Fractional Inverse",
          "problem": "Find A⁻¹ for A = [[7, 3], [4, 2]].",
          "step_by_step": [
            {
              "step": "Compute the Determinant",
              "explanation": "a=7, b=3, c=4, d=2.",
              "calculation": "det = (7·2) − (3·4) = 14 − 12 = 2 ≠ 0. Inverse exists."
            },
            {
              "step": "Write the Adjugate",
              "explanation": "Swap a and d; negate b and c.",
              "calculation": "Adjugate = [[2, -3], [-4, 7]]"
            },
            {
              "step": "Multiply by 1/det = 1/2",
              "explanation": "Multiply every entry by 1/2.",
              "calculation": "A⁻¹ = (1/2)·[[2, -3], [-4, 7]] = [[1, -3/2], [-2, 7/2]]"
            },
            {
              "step": "Simplify Fractions",
              "explanation": "Express in simplest fractional form.",
              "calculation": "A⁻¹ = [[1, -1.5], [-2, 3.5]] in decimal, but fractions are preferred: [[1, -3/2], [-2, 7/2]]"
            },
            {
              "step": "Quick Verification (Spot Check)",
              "explanation": "Multiply A by A⁻¹ for one entry to build confidence.",
              "calculation": "First row of A times first column of A⁻¹: (7·1) + (3·-2) = 7 − 6 = 1 ✓. First row times second column: (7·-3/2) + (3·7/2) = -21/2 + 21/2 = 0 ✓."
            }
          ],
          "final_answer": "A⁻¹ = [[1, -3/2], [-2, 7/2]]",
          "concept_applied": "When the determinant is not 1 or -1, the inverse will contain fractions. This is normal and acceptable. Leaving answers in fractional form is standard."
        },
        {
          "title": "Recognizing a Singular Matrix",
          "problem": "Find A⁻¹ for A = [[2, -4], [-3, 6]].",
          "step_by_step": [
            {
              "step": "Compute the Determinant",
              "explanation": "a=2, b=-4, c=-3, d=6.",
              "calculation": "det = (2·6) − (-4·-3) = 12 − 12 = 0."
            },
            {
              "step": "Interpret the Result",
              "explanation": "Determinant is zero, so the matrix is singular.",
              "calculation": "No inverse exists. Notice that the second row is -1.5 times the first row: [-3,6] = -1.5·[2,-4]. Linear dependence confirms singularity."
            }
          ],
          "final_answer": "A is singular; no inverse exists.",
          "concept_applied": "Not every matrix has an inverse. The determinant check prevents wasted effort and alerts you to the special nature of the matrix."
        }
      ]
    },
    {
      "section_title": "Common Mistakes and How to Avoid Them",
      "introduction": "The inverse formula is simple but unforgiving. Small sign errors or misplaced numbers lead to completely wrong answers. Knowing the common pitfalls is the best defense.",
      "key_concept": {
        "definition": "The five most common errors in computing 2×2 inverses are: (1) forgetting to check the determinant, (2) incorrectly swapping or negating entries, (3) arithmetic errors in the determinant, (4) forgetting to multiply the adjugate by 1/det, and (5) not verifying the answer.",
        "context": "Each of these errors is preventable with a systematic approach. The formula is mechanical — follow it exactly every time, and verify your result, and you will avoid the vast majority of mistakes."
      },
      "categories": [
        {
          "type": "Mistake 1: Skipping the Determinant Check",
          "description": "Applying the formula without first checking if det = 0.",
          "detailed_mechanism": "If det = 0, the formula involves division by zero. Students who skip the check and plug into the formula will attempt to divide by zero or, worse, write an 'inverse' that does not actually satisfy AA⁻¹ = I. The fix: always compute the determinant first. It takes seconds and is the required first step.",
          "examples": [
            {
              "process": "Prevention",
              "explanation": "For A = [[2,4],[1,2]], compute det = (2·2)−(4·1)=4−4=0. Stop. Write 'no inverse'. Do not proceed."
            }
          ]
        },
        {
          "type": "Mistake 2: Swapping the Wrong Entries or Forgetting Signs",
          "description": "Misapplying the 'swap a and d, negate b and c' rule.",
          "detailed_mechanism": "Common errors include swapping b and c instead of a and d, negating a and d instead of b and c, or only negating one of b or c. The fix: memorize the pattern visually. Draw the original matrix and literally write the adjugate next to it: d goes to top-left, -b to top-right, -c to bottom-left, a to bottom-right.",
          "examples": [
            {
              "process": "Correct Pattern",
              "explanation": "Original: [[a, b], [c, d]]. Adjugate: [[d, -b], [-c, a]]. Practice with numbers: [[2,5],[1,3]] → adj [[3,-5],[-1,2]]. The pattern must become automatic."
            }
          ]
        },
        {
          "type": "Mistake 3: Arithmetic Errors in the Determinant",
          "description": "Miscalculating ad − bc, especially with negative numbers.",
          "detailed_mechanism": "Sign errors are common: subtracting a negative incorrectly, or misplacing parentheses. The fix: write the determinant expression explicitly with parentheses before computing. For a=2, b=-3, c=-4, d=5, write (2·5) − ((-3)·(-4)) = 10 − (12) = -2, not 10 − (-12) = 22.",
          "examples": [
            {
              "process": "Careful Determinant Calculation",
              "explanation": "A = [[-2, 5], [3, -4]]. Write: ad = (-2)·(-4) = 8. bc = 5·3 = 15. det = ad − bc = 8 − 15 = -7. Double-check signs before proceeding."
            }
          ]
        },
        {
          "type": "Mistake 4: Forgetting the Scalar Multiplication",
          "description": "Writing the adjugate matrix and stopping, or multiplying only one entry by 1/det.",
          "detailed_mechanism": "The inverse is (1/det) times the adjugate, not just the adjugate. Students sometimes write the adjugate and call it the inverse, or multiply only the first row by the scalar. The fix: after writing the adjugate, explicitly write the scalar factor in front and then multiply every entry. Count the entries — if the matrix is 2×2, you should have performed four multiplications.",
          "examples": [
            {
              "process": "Complete the Multiplication",
              "explanation": "For A = [[4,7],[2,6]], det=10, adj=[[6,-7],[-2,4]]. CORRECT: A⁻¹ = (1/10)·[[6,-7],[-2,4]] = [[0.6,-0.7],[-0.2,0.4]]. INCORRECT: A⁻¹ = [[6,-7],[-2,4]] (missing the division)."
            }
          ]
        },
        {
          "type": "Mistake 5: Not Verifying the Result",
          "description": "Trusting the computed inverse without checking that AA⁻¹ = I.",
          "detailed_mechanism": "Even with the correct procedure, sign errors or arithmetic mistakes can slip through. Verification catches them. The fix: always multiply A by your candidate inverse. If the result is not I, go back and check each step. This habit alone will save countless points on exams.",
          "examples": [
            {
              "process": "Verification as a Safety Net",
              "explanation": "If you compute A⁻¹ = [[3,-5],[-1,2]] for A = [[2,5],[1,3]], multiply to confirm: first row first column: 2·3 + 5·(-1) = 6 − 5 = 1. If you had accidentally written [[3,5],[-1,2]], the product would give 2·3+5·(-1)=1 still? Wait, check: 2·3+5·(-1)=1, but the off-diagonal would be wrong: 2·5+5·2=10+10=20, not 0. Verification catches the error."
            }
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Identity Matrix (I)",
    "Main Diagonal",
    "Inverse Matrix (A⁻¹)",
    "Invertible / Non-Singular",
    "Singular Matrix",
    "Determinant (det)",
    "Adjugate (Classical Adjoint)",
    "2×2 Inverse Formula",
    "Multiplicative Identity",
    "Multiplicative Inverse",
    "Linear Dependence",
    "AA⁻¹ = A⁻¹A = I"
  ],
  "summary": "The identity matrix I is a square matrix with 1s on the main diagonal and 0s elsewhere. For any compatible matrix A, AI = A and IA = A. The inverse of a square matrix A, denoted A⁻¹, satisfies AA⁻¹ = A⁻¹A = I. For a 2×2 matrix A = [[a, b], [c, d]], the inverse exists only if the determinant det(A) = ad − bc ≠ 0. When it exists, A⁻¹ = (1/(ad − bc)) · [[d, −b], [−c, a]]. If det(A) = 0, the matrix is singular and has no inverse. Always compute the determinant first. After finding a candidate inverse, verify by multiplying it with the original matrix to confirm the product is I. Common errors include skipping the determinant check, misapplying the swap/negate pattern, miscalculating the determinant, forgetting the scalar multiplication, and failing to verify. Inverses are fundamental to solving matrix equations, undoing transformations, and applications in cryptography and computer graphics."
}
