{
  "expanded_description": "The normal distribution is one of the most important probability distributions in statistics. Often called the bell curve, it describes many natural phenomena and is the foundation for much of statistical inference. The empirical rule (68-95-99.7 rule) provides a quick way to understand how data is distributed around the mean in a normal distribution. Understanding normal distributions and the empirical rule is essential for interpreting data, understanding probability, and preparing for more advanced topics like z-scores and confidence intervals.",
  "core_concept": {
    "principle": "A normal distribution is symmetric and bell-shaped, with mean $\\mu$ and standard deviation $\\sigma$. The empirical rule states that approximately 68% of data falls within 1 standard deviation of the mean, 95% within 2 standard deviations, and 99.7% within 3 standard deviations.",
    "explanation": "Think of the normal curve as a smooth, symmetric hill centered at the mean. The standard deviation determines how wide the hill is. The empirical rule tells us that no matter what the mean and standard deviation are, the proportions of data within 1, 2, and 3 standard deviations are always the same. This makes it easy to quickly estimate probabilities and identify unusual values.",
    "image": {
      "src": "images/unit10/normal_distribution_empirical_rule.png",
      "alt": "Bell-shaped normal curve with mean at center, shaded regions showing 68%, 95%, and 99.7% within 1, 2, and 3 standard deviations.",
      "caption": "Normal Distribution and Empirical Rule: 68-95-99.7."
    }
  },
  "sections": [
    {
      "section_title": "Properties of the Normal Distribution",
      "introduction": "The normal distribution has several key properties that make it useful for statistical analysis. Understanding these properties helps in recognizing when the normal distribution applies.",
      "key_concept": {
        "definition": "A normal distribution is a continuous probability distribution that is symmetric about its mean, bell-shaped, and completely described by its mean $\\mu$ and standard deviation $\\sigma$. The total area under the curve equals 1.",
        "context": "Many real-world variables approximately follow a normal distribution: heights, test scores, measurement errors, and biological characteristics. The Central Limit Theorem explains why averages of many independent variables tend to be normally distributed, even if the original variables are not."
      },
      "classifications": [
        {
          "type": "Symmetric",
          "value": "Perfectly balanced around the mean",
          "characteristics": [
            "Mean = Median = Mode",
            "Left and right sides are mirror images",
            "50% of data lies on each side of the mean"
          ],
          "image": {
            "src": "images/unit10/normal_symmetric.png",
            "alt": "Normal curve with vertical line through mean showing symmetry.",
            "caption": "Symmetric: Mean = Median = Mode."
          },
          "examples": [
            {
              "process": "Heights of adult women",
              "explanation": "Heights are approximately symmetric around the mean, with about as many women above average as below."
            }
          ]
        },
        {
          "type": "Bell-Shaped",
          "value": "Highest at the mean, decreasing toward tails",
          "characteristics": [
            "Peak at the mean",
            "Curve approaches but never touches horizontal axis",
            "Inflection points at $\\mu \\pm \\sigma$"
          ],
          "image": {
            "src": "images/unit10/normal_bell_shape.png",
            "alt": "Bell-shaped curve with peak at mean and tails approaching axis.",
            "caption": "Bell-Shaped: Most data near the mean, less in the tails."
          },
          "examples": [
            {
              "process": "IQ scores",
              "explanation": "Most people score near the average of 100, with fewer people at very high or very low scores."
            }
          ]
        },
        {
          "type": "Defined by Mean and Standard Deviation",
          "value": "$\\mu$ and $\\sigma$ completely determine the distribution",
          "characteristics": [
            "$\\mu$ determines the center",
            "$\\sigma$ determines the spread",
            "Different $\\mu$ and $\\sigma$ give different normal curves"
          ],
          "image": {
            "src": "images/unit10/normal_mu_sigma.png",
            "alt": "Two normal curves: one with larger mean shifted right, one with larger standard deviation wider.",
            "caption": "Mean shifts the curve; standard deviation changes the spread."
          },
          "examples": [
            {
              "process": "Comparing test scores",
              "explanation": "Class A with mean 75, SD 5; Class B with mean 80, SD 10. Class B has higher average but more variability."
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Identifying Normal Distributions",
          "problem": "Which of the following variables would you expect to be approximately normally distributed? Explain your reasoning. a) Heights of adult men b) Number of siblings per person c) Household income in a large city d) Scores on a well-designed standardized test",
          "step_by_step": [
            {
              "step": "Part a: Heights of adult men",
              "explanation": "Yes, heights tend to be normally distributed. They are determined by many genetic and environmental factors that combine additively, leading to a symmetric bell-shaped distribution."
            },
            {
              "step": "Part b: Number of siblings per person",
              "explanation": "No, this is discrete and likely skewed right. Most people have 0-3 siblings, with fewer having many siblings, creating a right-skewed distribution, not symmetric."
            },
            {
              "step": "Part c: Household income",
              "explanation": "No, income is typically skewed right. A small number of very high incomes pull the mean to the right, creating a long tail, not symmetric."
            },
            {
              "step": "Part d: Standardized test scores",
              "explanation": "Yes, well-designed tests are often constructed to produce approximately normal distributions. The scores result from many independent questions, and the test may be scaled to achieve a normal distribution."
            }
          ],
          "image": {
            "src": "images/unit10/identify_normal.png",
            "alt": "Four histograms: symmetric heights, skewed siblings, skewed income, symmetric test scores.",
            "caption": "Identifying normal distributions: look for symmetry and bell shape."
          },
          "final_answer": "a) Yes, b) No, c) No, d) Yes",
          "concept_applied": "Normal distributions arise from additive combinations of many independent factors and are symmetric and bell-shaped."
        }
      ],
      "image": {
        "src": "images/unit10/normal_properties.png",
        "alt": "Summary of normal distribution properties: symmetric, bell-shaped, defined by μ and σ.",
        "caption": "Properties of the Normal Distribution."
      }
    },
    {
      "section_title": "The Empirical Rule (68-95-99.7 Rule)",
      "introduction": "The empirical rule provides a quick way to estimate proportions of data within certain distances from the mean in a normal distribution. It is one of the most practical tools in statistics.",
      "key_concept": {
        "definition": "For any normal distribution: <br> • Approximately 68% of data falls within 1 standard deviation of the mean ($\\mu \\pm \\sigma$) <br> • Approximately 95% of data falls within 2 standard deviations of the mean ($\\mu \\pm 2\\sigma$) <br> • Approximately 99.7% of data falls within 3 standard deviations of the mean ($\\mu \\pm 3\\sigma$)",
        "context": "These percentages are approximations that hold for all normal distributions, regardless of the specific values of $\\mu$ and $\\sigma$. The rule is useful for quickly estimating probabilities, identifying unusual observations, and understanding the spread of data."
      },
      "process_flow": [
        {
          "step": "1",
          "process": "Identify the mean $\\mu$ and standard deviation $\\sigma$",
          "description": "Determine the center and spread of the normal distribution.",
          "mechanism": "From problem context or given values.",
          "result": "$\\mu$ and $\\sigma$.",
          "applications": [
            "Heights: $\\mu = 170$ cm, $\\sigma = 6$ cm",
            "Test scores: $\\mu = 75$, $\\sigma = 8$"
          ]
        },
        {
          "step": "2",
          "process": "Apply the empirical rule percentages",
          "description": "Use the 68-95-99.7 percentages to estimate data ranges.",
          "mechanism": "$\\mu \\pm \\sigma$ contains 68% of data <br> $\\mu \\pm 2\\sigma$ contains 95% of data <br> $\\mu \\pm 3\\sigma$ contains 99.7% of data",
          "result": "Ranges and percentages.",
          "applications": [
            "Heights: 68% between 164 and 176 cm; 95% between 158 and 182 cm; 99.7% between 152 and 188 cm",
            "Test scores: 68% between 67 and 83; 95% between 59 and 91; 99.7% between 51 and 99"
          ]
        },
        {
          "step": "3",
          "process": "Use symmetry for tail probabilities",
          "description": "Since the distribution is symmetric, half of the remaining data lies in each tail.",
          "mechanism": "For example, data above $\\mu + \\sigma$ is about 16% (half of 32%).",
          "result": "Probabilities for specific ranges.",
          "applications": [
            "Proportion above 176 cm: about 16%",
            "Proportion below 158 cm: about 2.5%"
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Applying the Empirical Rule",
          "problem": "Scores on a standardized test are normally distributed with mean 500 and standard deviation 100. Use the empirical rule to answer: a) What percentage of scores are between 400 and 600? b) What percentage are between 300 and 700? c) What percentage are above 700? d) What percentage are below 300?",
          "step_by_step": [
            {
              "step": "Part a: Scores between 400 and 600",
              "explanation": "400 is one standard deviation below the mean (500 - 100). 600 is one standard deviation above the mean (500 + 100). The empirical rule states that approximately 68% of data falls within one standard deviation of the mean. Therefore, about 68% of scores are between 400 and 600."
            },
            {
              "step": "Part b: Scores between 300 and 700",
              "explanation": "300 is two standard deviations below the mean (500 - 2×100). 700 is two standard deviations above the mean. The empirical rule states that approximately 95% of data falls within two standard deviations of the mean. Therefore, about 95% of scores are between 300 and 700."
            },
            {
              "step": "Part c: Scores above 700",
              "explanation": "700 is two standard deviations above the mean. Since 95% of scores are between 300 and 700, the remaining 5% are outside this range. By symmetry, half of this 5% (2.5%) are above 700 and half (2.5%) are below 300. Therefore, about 2.5% of scores are above 700."
            },
            {
              "step": "Part d: Scores below 300",
              "explanation": "By symmetry, the percentage below 300 is the same as the percentage above 700, which is 2.5%."
            }
          ],
          "image": {
            "src": "images/unit10/empirical_rule_test_scores.png",
            "alt": "Normal curve with mean 500, SD 100, showing 68% between 400-600, 95% between 300-700, and tails of 2.5% each.",
            "caption": "Test scores: 68% within 400-600, 95% within 300-700."
          },
          "final_answer": "a) 68%, b) 95%, c) 2.5%, d) 2.5%",
          "concept_applied": "The empirical rule gives quick estimates for normal distributions."
        },
        {
          "title": "Finding Values Given Percentages",
          "problem": "Adult male heights are normally distributed with mean 70 inches and standard deviation 3 inches. a) Between what two heights do the middle 68% of men fall? b) Between what two heights do the middle 95% of men fall? c) How tall must a man be to be in the tallest 2.5%? d) How tall must a man be to be in the shortest 16%?",
          "step_by_step": [
            {
              "step": "Part a: Middle 68%",
              "explanation": "The middle 68% falls within one standard deviation of the mean. Lower bound = 70 - 3 = 67 inches. Upper bound = 70 + 3 = 73 inches. So the middle 68% of men are between 67 and 73 inches tall."
            },
            {
              "step": "Part b: Middle 95%",
              "explanation": "The middle 95% falls within two standard deviations of the mean. Lower bound = 70 - 2×3 = 70 - 6 = 64 inches. Upper bound = 70 + 2×3 = 70 + 6 = 76 inches. So the middle 95% of men are between 64 and 76 inches tall."
            },
            {
              "step": "Part c: Tallest 2.5%",
              "explanation": "The tallest 2.5% are above two standard deviations above the mean. This is the upper tail beyond 76 inches. So a man must be taller than 76 inches to be in the tallest 2.5%."
            },
            {
              "step": "Part d: Shortest 16%",
              "explanation": "The shortest 16% are below one standard deviation below the mean. This is below 67 inches. So a man must be shorter than 67 inches to be in the shortest 16%."
            }
          ],
          "image": {
            "src": "images/unit10/empirical_rule_heights.png",
            "alt": "Height distribution with mean 70, SD 3, showing middle 68% (67-73), middle 95% (64-76), and tails.",
            "caption": "Heights: 68% between 67-73 inches, 95% between 64-76 inches."
          },
          "final_answer": "a) 67 to 73 inches, b) 64 to 76 inches, c) taller than 76 inches, d) shorter than 67 inches",
          "concept_applied": "The empirical rule works in both directions: from percentages to values and from values to percentages."
        },
        {
          "title": "Checking for Unusual Values",
          "problem": "A light bulb manufacturer claims their bulbs last an average of 1000 hours with a standard deviation of 50 hours, and the lifetimes are normally distributed. A customer finds a bulb that lasts only 850 hours. Is this unusual? Explain.",
          "step_by_step": [
            {
              "step": "Determine how many standard deviations from the mean",
              "explanation": "850 is 150 hours below the mean of 1000. Since the standard deviation is 50, this is 150/50 = 3 standard deviations below the mean."
            },
            {
              "step": "Apply the empirical rule",
              "explanation": "99.7% of bulbs last within 3 standard deviations of the mean, which is between 850 and 1150 hours. A bulb lasting 850 hours is exactly at the lower bound of this range. This means only about 0.15% of bulbs (half of 0.3%) last less than 850 hours."
            },
            {
              "step": "Conclusion",
              "explanation": "Yes, this is unusual. Only about 0.15% of bulbs are expected to last less than 850 hours. This could indicate a defective bulb or that the manufacturer's claims might be overstated."
            }
          ],
          "image": {
            "src": "images/unit10/unusual_value.png",
            "alt": "Normal curve with mean 1000, SD 50, showing 850 at -3σ in the tail.",
            "caption": "A bulb lasting 850 hours is 3 SD below the mean, very unusual."
          },
          "final_answer": "Yes, it is unusual (only 0.15% of bulbs last less than 850 hours).",
          "concept_applied": "Values more than 2 standard deviations from the mean are considered unusual; more than 3 is extremely unusual."
        }
      ],
      "image": {
        "src": "images/unit10/empirical_rule_diagram.png",
        "alt": "Normal curve with 68%, 95%, and 99.7% regions labeled.",
        "caption": "Empirical Rule: 68-95-99.7 for normal distributions."
      }
    },
    {
      "section_title": "Using the Empirical Rule with Different Standard Deviations",
      "introduction": "The empirical rule applies to any normal distribution, regardless of the specific values of mean and standard deviation. This makes it a versatile tool for quick estimation.",
      "key_concept": {
        "definition": "For any normal distribution with mean $\\mu$ and standard deviation $\\sigma$, approximately 68% of data lies between $\\mu - \\sigma$ and $\\mu + \\sigma$, 95% between $\\mu - 2\\sigma$ and $\\mu + 2\\sigma$, and 99.7% between $\\mu - 3\\sigma$ and $\\mu + 3\\sigma$.",
        "context": "The key is to convert the problem into standard deviation units. Once you know how many standard deviations away a value is, you can use the empirical rule percentages regardless of the original units."
      },
      "process_flow": [
        {
          "step": "1",
          "process": "Identify $\\mu$ and $\\sigma$",
          "description": "Determine the mean and standard deviation of the distribution.",
          "mechanism": "Given in the problem or calculated from data.",
          "result": "$\\mu$ and $\\sigma$.",
          "applications": [
            "IQ scores: $\\mu = 100$, $\\sigma = 15$",
            "Package weights: $\\mu = 500$ g, $\\sigma = 10$ g"
          ]
        },
        {
          "step": "2",
          "process": "Convert values to standard deviation units",
          "description": "Determine how many standard deviations a value is from the mean.",
          "mechanism": "$k = \\frac{|x - \\mu|}{\\sigma}$",
          "result": "Number of standard deviations away.",
          "applications": [
            "IQ of 130: $k = (130-100)/15 = 2$ SD above mean",
            "Weight of 480 g: $k = (500-480)/10 = 2$ SD below mean"
          ]
        },
        {
          "step": "3",
          "process": "Apply the empirical rule",
          "description": "Use the 68-95-99.7 percentages based on the number of standard deviations.",
          "mechanism": "If $k \\approx 1$, about 68% within range; if $k \\approx 2$, about 95% within range; if $k \\approx 3$, about 99.7% within range.",
          "result": "Estimated percentage or conclusion about unusualness.",
          "applications": []
        }
      ],
      "worked_examples": [
        {
          "title": "Applying to Different Distributions",
          "problem": "IQ scores are normally distributed with mean 100 and standard deviation 15. a) What percentage of people have IQ between 85 and 115? b) What percentage have IQ above 130? c) What IQ score is at the 97.5th percentile?",
          "step_by_step": [
            {
              "step": "Part a: IQ between 85 and 115",
              "explanation": "85 is one standard deviation below the mean (100 - 15). 115 is one standard deviation above the mean. By the empirical rule, approximately 68% of people have IQ between 85 and 115."
            },
            {
              "step": "Part b: IQ above 130",
              "explanation": "130 is two standard deviations above the mean (100 + 2×15). Since 95% of people have IQ between 70 and 130, the remaining 5% are outside this range. By symmetry, half of this 5% (2.5%) are above 130 and half below 70. Therefore, about 2.5% of people have IQ above 130."
            },
            {
              "step": "Part c: IQ at 97.5th percentile",
              "explanation": "The 97.5th percentile means only 2.5% of people score higher. This corresponds to two standard deviations above the mean. So the IQ score is 100 + 2×15 = 130."
            }
          ],
          "image": {
            "src": "images/unit10/iq_distribution.png",
            "alt": "IQ distribution with mean 100, SD 15, showing 68% between 85-115, 2.5% above 130.",
            "caption": "IQ scores: 68% between 85-115, 2.5% above 130."
          },
          "final_answer": "a) 68%, b) 2.5%, c) 130",
          "concept_applied": "The empirical rule works for any normal distribution by converting to standard deviation units."
        },
        {
          "title": "Quality Control Application",
          "problem": "A machine fills bags of potato chips with weights normally distributed about a mean of 16 ounces and a standard deviation of 0.2 ounces. a) What percentage of bags weigh between 15.8 and 16.2 ounces? b) What percentage weigh less than 15.6 ounces? c) The company wants to reject bags that are unusually light. If they reject bags weighing less than 15.4 ounces, what percentage of bags will be rejected?",
          "step_by_step": [
            {
              "step": "Part a: Between 15.8 and 16.2 ounces",
              "explanation": "15.8 is one standard deviation below the mean (16 - 0.2). 16.2 is one standard deviation above the mean. By the empirical rule, about 68% of bags weigh between 15.8 and 16.2 ounces."
            },
            {
              "step": "Part b: Less than 15.6 ounces",
              "explanation": "15.6 is two standard deviations below the mean (16 - 2×0.2). Since 95% of bags weigh between 15.6 and 16.4, the remaining 5% are outside this range. Half of these (2.5%) are below 15.6. Therefore, about 2.5% of bags weigh less than 15.6 ounces."
            },
            {
              "step": "Part c: Less than 15.4 ounces",
              "explanation": "15.4 is three standard deviations below the mean (16 - 3×0.2). The empirical rule says 99.7% of bags weigh between 15.4 and 16.6. The remaining 0.3% are outside this range, with half (0.15%) below 15.4. Therefore, about 0.15% of bags will be rejected."
            }
          ],
          "image": {
            "src": "images/unit10/quality_control.png",
            "alt": "Bag weights distribution with mean 16, SD 0.2, showing rejection region below 15.4.",
            "caption": "Quality control: 0.15% of bags weigh less than 15.4 ounces."
          },
          "final_answer": "a) 68%, b) 2.5%, c) 0.15%",
          "concept_applied": "The empirical rule helps set quality control limits based on acceptable percentages of defects."
        }
      ],
      "image": {
        "src": "images/unit10/empirical_rule_general.png",
        "alt": "Normal curve with generic μ and σ, showing 68%, 95%, 99.7% regions.",
        "caption": "The empirical rule applies to any normal distribution."
      }
    },
    {
      "section_title": "Limitations of the Empirical Rule",
      "introduction": "The empirical rule applies only to approximately normal distributions. It is important to verify normality before applying the rule and to recognize when it might not be appropriate.",
      "key_concept": {
        "definition": "The empirical rule is accurate only for data that follows a normal distribution. For non-normal distributions, the percentages within 1, 2, and 3 standard deviations can be quite different. Chebyshev's theorem provides bounds that work for any distribution, but they are less precise.",
        "context": "Before applying the empirical rule, check for symmetry and bell shape. For skewed data or data with outliers, the empirical rule may give misleading results."
      },
      "process_flow": [
        {
          "step": "1",
          "process": "Check for approximate normality",
          "description": "Examine the data distribution for symmetry and bell shape.",
          "mechanism": "Create a histogram or dot plot, or use normal probability plots.",
          "result": "Conclusion about whether normal approximation is reasonable.",
          "applications": []
        },
        {
          "step": "2",
          "process": "If approximately normal, apply empirical rule",
          "description": "Use 68-95-99.7 for estimates.",
          "mechanism": "Proceed with empirical rule calculations.",
          "result": "Estimated percentages.",
          "applications": []
        },
        {
          "step": "3",
          "process": "If not normal, use Chebyshev's theorem",
          "description": "For any distribution, at least $1 - 1/k^2$ of data falls within $k$ standard deviations of the mean.",
          "mechanism": "$P(|X-\\mu| \\ge k\\sigma) \\le 1/k^2$",
          "result": "Conservative bounds on percentages.",
          "applications": []
        }
      ],
      "worked_examples": [
        {
          "title": "When Not to Use the Empirical Rule",
          "problem": "A dataset of household incomes in a city is strongly right-skewed with mean \\$60,000 and standard deviation \\$30,000. a) Would it be appropriate to use the empirical rule to estimate the percentage of households with income between \\$30,000 and \\$90,000? Why or why not? b) What does Chebyshev's theorem tell us about the percentage of households within 2 standard deviations of the mean?",
          "step_by_step": [
            {
              "step": "Part a: Appropriateness of empirical rule",
              "explanation": "No, the empirical rule should not be used because the distribution is strongly right-skewed, not normal. The empirical rule would give inaccurate estimates for skewed data."
            },
            {
              "step": "Part b: Chebyshev's theorem",
              "explanation": "Chebyshev's theorem states that for any distribution, at least $1 - 1/k^2$ of data falls within $k$ standard deviations of the mean. For $k=2$, at least $1 - 1/4 = 0.75$ or 75% of households have incomes within 2 standard deviations of the mean (between $0 and $120,000). This is a conservative lower bound."
            }
          ],
          "image": {
            "src": "images/unit10/skewed_income.png",
            "alt": "Right-skewed histogram of incomes with mean and median marked.",
            "caption": "Skewed data: empirical rule not appropriate; use Chebyshev instead."
          },
          "final_answer": "a) No, data is skewed; b) At least 75% within 2 SD.",
          "concept_applied": "The empirical rule requires normality; for non-normal data, use Chebyshev's theorem for conservative bounds."
        }
      ],
      "image": {
        "src": "images/unit10/chebyshev.png",
        "alt": "Formula for Chebyshev's theorem: P(|X-μ| ≥ kσ) ≤ 1/k².",
        "caption": "Chebyshev's Theorem: Works for any distribution."
      }
    },
    {
      "section_title": "Common Mistakes and How to Avoid Them",
      "introduction": "Working with the empirical rule has several common pitfalls. Here is what to watch for.",
      "classifications": [
        {
          "type": "Applying Empirical Rule to Non-Normal Data",
          "value": "Using 68-95-99.7 when data is not normally distributed",
          "characteristics": [
            "Assuming normality without checking",
            "Applying to skewed distributions"
          ],
          "behavior": "Percentages are inaccurate; conclusions may be wrong.",
          "image": {
            "src": "images/unit10/mistake_non_normal.png",
            "alt": "Skewed distribution with normal curve overlaid showing mismatch.",
            "caption": "The empirical rule only applies to normal distributions."
          },
          "examples": [
            {
              "process": "Income data (right-skewed)",
              "explanation": "Mistake: Claiming 68% of incomes are within 1 SD of mean. Correct: Check normality first; if skewed, use median/IQR or Chebyshev."
            }
          ],
          "note": "Solution: Always check for approximate normality before applying the empirical rule. Look at a histogram or consider the context."
        },
        {
          "type": "Misinterpreting Tail Percentages",
          "value": "Confusing the percentage in one tail with the percentage in both tails",
          "characteristics": [
            "Saying 5% is above $\\mu + 2\\sigma$ when actually 2.5% is above and 2.5% below",
            "Forgetting symmetry"
          ],
          "behavior": "Tail probabilities are off by a factor of 2.",
          "image": {
            "src": "images/unit10/mistake_tails.png",
            "alt": "Normal curve showing 2.5% in each tail, not 5% in one tail.",
            "caption": "Remember: 5% total outside ±2σ means 2.5% in each tail."
          },
          "examples": [
            {
              "process": "Percentage above $\\mu + 2\\sigma$",
              "explanation": "Mistake: Saying 5%. Correct: 2.5% (half of the 5% outside ±2σ)."
            }
          ],
          "note": "Solution: When finding the percentage in one tail, remember to take half of the percentage outside the symmetric interval."
        },
        {
          "type": "Rounding Percentages Incorrectly",
          "value": "Treating the empirical rule percentages as exact rather than approximations",
          "characteristics": [
            "Using 68% as exact when it is approximately 68.27%",
            "Reporting 95% when more precision is needed"
          ],
          "behavior": "Slight inaccuracies, usually acceptable for estimation but not for precise work.",
          "image": {
            "src": "images/unit10/mistake_exact_percentages.png",
            "alt": "Normal curve with exact percentages: 68.27%, 95.45%, 99.73%.",
            "caption": "The empirical rule gives approximations; exact values are slightly different."
          },
          "examples": [
            {
              "process": "Exactly 95% within 2 SD",
              "explanation": "Mistake: Treating as exact. Correct: Approximately 95%, actually about 95.45%."
            }
          ],
          "note": "Solution: Remember that 68%, 95%, and 99.7% are convenient approximations. For precise work, use z-tables or calculators."
        },
        {
          "type": "Forgetting That Data Is Continuous",
          "value": "Applying the empirical rule to discrete data without considering continuity",
          "characteristics": [
            "Using empirical rule for counts or integers without adjustment",
            "Not recognizing that normal approximation for discrete data requires continuity correction"
          ],
          "behavior": "Approximations may be off, especially for small samples or at boundaries.",
          "image": {
            "src": "images/unit10/mistake_discrete.png",
            "alt": "Histogram of discrete data with normal curve overlaid.",
            "caption": "For discrete data, normal approximation requires care."
          },
          "examples": [
            {
              "process": "Number of heads in 100 coin flips",
              "explanation": "The distribution is binomial, approximately normal but discrete. The empirical rule gives rough estimates, but exact binomial probabilities would be more accurate."
            }
          ],
          "note": "Solution: For discrete data that is approximately normal, the empirical rule can still provide useful estimates, but be aware that exact probabilities may differ."
        }
      ],
      "image": {
        "src": "images/unit10/empirical_rule_mistakes.png",
        "alt": "Infographic showing four common empirical rule mistakes with corrections.",
        "caption": "Common Errors: Watch for these when using the empirical rule."
      }
    },
    {
      "section_title": "Why It Matters: Real-World Connections",
      "introduction": "The normal distribution and empirical rule are used throughout science, business, and everyday life to understand variability and make predictions.",
      "categories": [
        {
          "type": "Education and Testing",
          "description": "Standardized tests like the SAT, ACT, and IQ tests are designed to produce normal distributions. The empirical rule helps interpret scores: a score 2 standard deviations above the mean is at the 97.5th percentile.",
          "image": {
            "src": "images/unit10/realworld_testing.png",
            "alt": "SAT score distribution bell curve with percentile markings.",
            "caption": "Testing: Scores are often normally distributed."
          },
          "examples": [
            {
              "process": "Interpreting SAT scores",
              "explanation": "If the SAT has mean 1000 and SD 200, a score of 1400 is 2 SD above the mean, placing the student in the top 2.5% of test-takers."
            }
          ]
        },
        {
          "type": "Manufacturing and Quality Control",
          "description": "Manufacturers use the normal distribution to set specifications and monitor quality. Products outside 3 standard deviations are often considered defective.",
          "image": {
            "src": "images/unit10/realworld_manufacturing_normal.png",
            "alt": "Factory production line with quality control charts.",
            "caption": "Quality control: Products beyond 3σ are rare and may be rejected."
          },
          "examples": [
            {
              "process": "Six Sigma quality",
              "explanation": "Six Sigma aims for processes where specifications are 6 standard deviations from the mean, producing only 3.4 defects per million opportunities."
            }
          ]
        },
        {
          "type": "Finance and Risk Management",
          "description": "Financial returns are often assumed to be normally distributed for risk modeling, though this assumption has limitations. The empirical rule helps estimate probabilities of extreme gains or losses.",
          "image": {
            "src": "images/unit10/realworld_finance_normal.png",
            "alt": "Stock market graph with normal curve overlay.",
            "caption": "Finance: Normal distribution models returns and risk."
          },
          "examples": [
            {
              "process": "Value at Risk",
              "explanation": "If a portfolio has mean return 8% and standard deviation 15%, the empirical rule suggests that returns below -22% (mean - 2σ) occur only about 2.5% of the time."
            }
          ]
        },
        {
          "type": "Medicine and Health",
          "description": "Medical measurements like blood pressure, cholesterol, and height are often normally distributed. Doctors use this to identify patients with unusual values that may indicate health issues.",
          "image": {
            "src": "images/unit10/realworld_medical_normal.png",
            "alt": "Blood pressure readings with normal range highlighted.",
            "caption": "Medicine: Normal ranges are often based on mean ± 2 SD."
          },
          "examples": [
            {
              "process": "Blood pressure screening",
              "explanation": "If systolic blood pressure has mean 120 and SD 15, values above 150 (mean + 2σ) are considered high and may warrant further investigation."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Practice: Putting It All Together",
      "introduction": "Let us combine identifying normal distributions, applying the empirical rule, and interpreting results in comprehensive problems.",
      "worked_examples": [
        {
          "title": "Comprehensive Normal Distribution Problem",
          "problem": "The weights of adult males in a certain population are approximately normally distributed with mean 180 pounds and standard deviation 25 pounds. <br><br> a) What percentage of adult males weigh between 155 and 205 pounds? <br> b) What percentage weigh more than 230 pounds? <br> c) What weight separates the heaviest 2.5% from the rest? <br> d) If a man weighs 130 pounds, is this unusual? Explain. <br> e) Between what two weights do the middle 95% of men fall? <br> f) Would the empirical rule be appropriate if the distribution were strongly skewed? Explain.",
          "step_by_step": [
            {
              "step": "Part a: Between 155 and 205 pounds",
              "explanation": "155 is one standard deviation below the mean (180 - 25). 205 is one standard deviation above the mean. By the empirical rule, approximately 68% of men weigh between 155 and 205 pounds."
            },
            {
              "step": "Part b: More than 230 pounds",
              "explanation": "230 is two standard deviations above the mean (180 + 2×25). Since 95% of men weigh between 130 and 230, the remaining 5% are outside this range. Half of these (2.5%) weigh more than 230 pounds. Therefore, about 2.5% of men weigh more than 230 pounds."
            },
            {
              "step": "Part c: Heaviest 2.5%",
              "explanation": "The heaviest 2.5% are above two standard deviations above the mean. So the weight is 180 + 2×25 = 230 pounds."
            },
            {
              "step": "Part d: 130 pounds unusual?",
              "explanation": "130 is two standard deviations below the mean (180 - 2×25). This places him at the boundary of the middle 95%. Only 2.5% of men weigh less than 130 pounds, so this is somewhat unusual but not extremely rare. Values more than 2 SD from the mean are typically considered unusual."
            },
            {
              "step": "Part e: Middle 95%",
              "explanation": "The middle 95% falls within two standard deviations of the mean. Lower bound = 180 - 2×25 = 130 pounds. Upper bound = 180 + 2×25 = 230 pounds. So the middle 95% of men weigh between 130 and 230 pounds."
            },
            {
              "step": "Part f: Appropriateness for skewed data",
              "explanation": "No, the empirical rule would not be appropriate if the distribution were strongly skewed. The rule relies on symmetry and the specific properties of the normal distribution. For skewed data, the percentages within 1, 2, and 3 standard deviations could be quite different from 68%, 95%, and 99.7%."
            }
          ],
          "image": {
            "src": "images/unit10/practice_normal.png",
            "alt": "Normal curve for weights with mean 180, SD 25, showing 68%, 95%, and 99.7% regions.",
            "caption": "Comprehensive Practice: Normal distribution of weights."
          },
          "final_answer": "a) 68%, b) 2.5%, c) 230 pounds, d) Yes, somewhat unusual (2.5% below), e) 130 to 230 pounds, f) No, empirical rule requires normality.",
          "concept_applied": "This problem demonstrates all aspects of working with normal distributions and the empirical rule."
        }
      ]
    }
  ],
  "key_terms": [
    "Normal Distribution",
    "Bell Curve",
    "Empirical Rule",
    "68-95-99.7 Rule",
    "Mean $\\mu$",
    "Standard Deviation $\\sigma$",
    "Symmetric",
    "Tails",
    "Percentile",
    "Unusual Value",
    "Chebyshev's Theorem",
    "Central Limit Theorem"
  ],
  "summary": "The normal distribution is a symmetric, bell-shaped distribution completely described by its mean $\\mu$ and standard deviation $\\sigma$. The empirical rule (68-95-99.7) states that approximately 68% of data falls within 1 standard deviation of the mean, 95% within 2 standard deviations, and 99.7% within 3 standard deviations. This rule applies only to approximately normal distributions and provides quick estimates for probabilities and unusual values. Values more than 2 standard deviations from the mean are considered unusual. For non-normal distributions, Chebyshev's theorem provides conservative bounds. Common mistakes include applying the empirical rule to non-normal data, misinterpreting tail percentages, treating the percentages as exact, and forgetting that data may be discrete. The normal distribution and empirical rule are essential in education, manufacturing, finance, and medicine for understanding variability and making predictions.",
  "review_questions_image": {
    "src": "images/unit10/review_normal_empirical.png",
    "alt": "Visual summary: Normal distribution properties, empirical rule diagram, examples of application, and common mistakes.",
    "caption": "Unit 10.2 Review: Normal distributions and the empirical rule."
  }
}
