{
  "expanded_description": "The normal distribution is the single most important probability model in all of statistics. It describes an enormous range of real-world data — test scores, heights, measurement errors, even the sizes of snowflakes. In this section, we learn what makes a distribution 'normal,' how to read and sketch the bell curve, and how to use the Empirical Rule to answer probability questions without a calculator.",

  "core_concept": {
    "principle": "The normal distribution is a perfectly symmetric, bell-shaped curve completely described by just two numbers: the mean $\\mu$ and the standard deviation $\\sigma$.",
    "explanation": "In Section 10.1, we learned how to calculate $\\bar{x}$ and $s$ for a sample. Now we zoom out and ask: what if we could describe an entire population's distribution? The normal distribution does exactly that. Its shape tells us that most values cluster near the mean, and values become increasingly rare as you move further away in either direction. The Empirical Rule (also called the 68-95-99.7 Rule) gives us a powerful shortcut: without any table or calculator, we can immediately say what percentage of data falls within 1, 2, or 3 standard deviations of the mean. This rule is the foundation for z-scores, confidence intervals, and hypothesis testing in the sections ahead."
  },

  "sections": [
    {
      "section_title": "What Is a Normal Distribution?",
      "introduction": "You've probably heard the phrase 'on a bell curve' — but what does that actually mean mathematically? A normal distribution is a specific, precise shape that data can follow. Not all data is normal, but when it is, we gain powerful tools for making predictions and probability calculations.",

      "key_concept": {
        "definition": "A normal distribution is a continuous, symmetric, bell-shaped probability distribution. It is completely defined by two parameters: the mean $\\mu$ (which locates the center) and the standard deviation $\\sigma$ (which controls the width/spread). We write this as $X \\sim N(\\mu, \\sigma)$, read as 'X is normally distributed with mean $\\mu$ and standard deviation $\\sigma$.'",
        "context": "The word 'continuous' means the variable can take any value in a range — not just whole numbers. Height is continuous (you can be 5'7.3''), whereas the number of siblings you have is discrete (you can't have 2.7 siblings). Normal distributions are used for continuous data. The notation $X \\sim N(\\mu, \\sigma)$ will appear constantly in statistics — learn to read it fluently."
      },

      "classifications": [
        {
          "type": "Properties of Every Normal Distribution",
          "value": "These properties are always true — memorize them, they will be tested",
          "characteristics": [
            "Symmetric about the mean: the left half is a mirror image of the right half",
            "The mean, median, and mode are all equal and located at the exact center of the curve",
            "The curve is bell-shaped: highest in the middle, tapering off in both directions",
            "The tails extend infinitely in both directions but never touch the x-axis (asymptotic)",
            "The total area under the entire curve equals exactly 1 (or 100%) — this represents all possible outcomes",
            "About half the data (50%) falls below the mean, and half above",
            "The curve has two inflection points (where it changes from concave to convex) located at $\\mu - \\sigma$ and $\\mu + \\sigma$"
          ],
          "behavior": "When you look at a normal distribution curve, you should immediately see: one peak directly above the mean, perfect left-right symmetry, and tails that gradually flatten and approach (but never reach) the x-axis. The mean $\\mu$ controls where the curve is centered on the number line. The standard deviation $\\sigma$ controls how wide or narrow the bell is — a small $\\sigma$ creates a tall, skinny bell (data tightly clustered), while a large $\\sigma$ creates a short, wide bell (data spread out). The area under the curve represents probability.",
          "examples": [
            {
              "process": "Reading the Notation $X \\sim N(100, 15)$",
              "explanation": "This means: variable $X$ is normally distributed with mean $\\mu = 100$ and standard deviation $\\sigma = 15$. IQ scores follow this distribution. The peak of the bell curve sits at 100. Most IQ scores fall between $100 - 15 = 85$ and $100 + 15 = 115$. Scores become increasingly rare as you move further from 100."
            },
            {
              "process": "Reading the Notation $X \\sim N(70, 3)$",
              "explanation": "Mean $\\mu = 70$, standard deviation $\\sigma = 3$. Imagine adult male heights in inches for a specific population. The bell is centered at 70 inches (5'10''). Most men are between $70 - 3 = 67$ and $70 + 3 = 73$ inches (5'7'' to 6'1''). The curve is narrow because $\\sigma = 3$ is small relative to the mean."
            },
            {
              "process": "Same Mean, Different Standard Deviations",
              "explanation": "Compare $N(50, 5)$ vs. $N(50, 15)$. Both are centered at 50. But $N(50, 5)$ has a tall, narrow bell — most values fall between 35 and 65. $N(50, 15)$ has a short, wide bell — values spread from about 5 to 95. Same center, completely different shape. $\\sigma$ is the 'width dial' of the bell curve."
            },
            {
              "process": "What 'Area = Probability' Means",
              "explanation": "The total area under any normal curve is exactly 1 (100%). If someone asks 'what fraction of IQ scores fall below 100?', we're asking for the area under the $N(100, 15)$ curve to the LEFT of $x = 100$. By symmetry, that's exactly 0.5 (50%). The area under the curve in any region equals the probability that a randomly selected value falls in that region."
            }
          ]
        },
        {
          "type": "Is My Data Normally Distributed? (Checking for Normality)",
          "value": "Before applying normal distribution tools, you should check whether your data is approximately normal",
          "characteristics": [
            "Mean, median, and mode should be close to each other",
            "Data should look roughly symmetric in a histogram — not heavily skewed left or right",
            "About 68% of data should fall within 1 standard deviation of the mean",
            "No extreme outliers (outliers distort the shape and pull it away from normal)",
            "In practice, we say data is 'approximately normal' — perfect normality is rare"
          ],
          "behavior": "In this course, you will usually be told whether data is normally distributed. But it's important to know that not everything is normal. Incomes are right-skewed (not normal). The number of cars in a household is discrete (not normal). Reaction times are often right-skewed (not normal). Test scores, heights, weights of a specific species, and measurement errors often ARE approximately normal.",
          "examples": [
            {
              "process": "Likely Normal",
              "explanation": "Heights of all 17-year-old females in the United States. Symmetric, one peak, no natural skew. Mean $\\approx$ Median $\\approx$ Mode. $X \\sim N(64, 2.5)$ inches is a reasonable model."
            },
            {
              "process": "Likely NOT Normal",
              "explanation": "Number of text messages sent per day by students. Probably right-skewed: most send 50–200, but some outliers send 1,000+. Mean > Median. Do not use normal distribution tools here without verification."
            }
          ]
        }
      ]
    },

    {
      "section_title": "The Empirical Rule (68-95-99.7 Rule)",
      "introduction": "This is the big payoff of understanding the normal distribution. The Empirical Rule is a precise, memorizable statement about what percentage of data falls within 1, 2, and 3 standard deviations of the mean in ANY normal distribution. Learn these three numbers — they will appear in every statistics topic from here through AP Stats and college statistics.",

      "key_concept": {
        "definition": "For any normal distribution $N(\\mu, \\sigma)$: approximately 68% of data falls within 1 standard deviation of the mean ($\\mu \\pm \\sigma$); approximately 95% falls within 2 standard deviations ($\\mu \\pm 2\\sigma$); and approximately 99.7% falls within 3 standard deviations ($\\mu \\pm 3\\sigma$). This is called the Empirical Rule or the 68-95-99.7 Rule.",
        "context": "The word 'empirical' means 'based on observation.' Statisticians observed that normally distributed data consistently follows this pattern. The rule is an approximation, but a very precise one. The exact values are 68.27%, 95.45%, and 99.73% — we round to 68%, 95%, and 99.7% for practical use."
      },

      "classifications": [
        {
          "type": "The Three Tiers of the Empirical Rule",
          "value": "Use to find percentages and probabilities for any normal distribution without a z-table",
          "characteristics": [
            "Within $\\mu \\pm 1\\sigma$: approximately 68% of all data values",
            "Within $\\mu \\pm 2\\sigma$: approximately 95% of all data values",
            "Within $\\mu \\pm 3\\sigma$: approximately 99.7% of all data values",
            "By symmetry: exactly 50% of data is below $\\mu$, and 50% above $\\mu$",
            "34% of data falls between $\\mu$ and $\\mu + \\sigma$ (half of the 68% in the first tier)",
            "34% of data falls between $\\mu - \\sigma$ and $\\mu$ (the other half of the first tier)",
            "13.5% of data falls between $\\mu + \\sigma$ and $\\mu + 2\\sigma$",
            "13.5% of data falls between $\\mu - 2\\sigma$ and $\\mu - \\sigma$",
            "2.35% of data falls between $\\mu + 2\\sigma$ and $\\mu + 3\\sigma$",
            "2.35% of data falls between $\\mu - 3\\sigma$ and $\\mu - 2\\sigma$",
            "0.15% of data falls beyond $\\mu + 3\\sigma$ (the far right tail)",
            "0.15% of data falls beyond $\\mu - 3\\sigma$ (the far left tail)"
          ],
          "behavior": "The key to mastering the Empirical Rule is learning to DRAW and LABEL the curve every single time. Sketch a bell curve, mark the center as $\\mu$, then mark six tick marks: $\\mu - 3\\sigma$, $\\mu - 2\\sigma$, $\\mu - \\sigma$, $\\mu$, $\\mu + \\sigma$, $\\mu + 2\\sigma$, $\\mu + 3\\sigma$. Label the percentage in each region: 0.15% | 2.35% | 13.5% | 34% | 34% | 13.5% | 2.35% | 0.15%. These always sum to 100%. Now any question becomes a matter of identifying the right region(s) and adding up percentages.",
          "examples": [
            {
              "process": "Learning the Percentages — The Breakdown",
              "explanation": "Start from the 68-95-99.7 numbers and derive the smaller pieces. 68% is in the middle tier ($\\pm 1\\sigma$). By symmetry, 34% is between $\\mu$ and $\\mu + \\sigma$, and 34% between $\\mu - \\sigma$ and $\\mu$. The second tier is 95%, so the region from $1\\sigma$ to $2\\sigma$ on each side contains $(95\\% - 68\\%) \\div 2 = 13.5\\%$. The third tier is 99.7%, so the region from $2\\sigma$ to $3\\sigma$ on each side contains $(99.7\\% - 95\\%) \\div 2 = 2.35\\%$. The tails beyond $3\\sigma$ each contain $(100\\% - 99.7\\%) \\div 2 = 0.15\\%$."
            },
            {
              "process": "Applying with SAT Scores: $N(1060, 195)$",
              "explanation": "SAT Math scores are approximately $N(1060, 195)$. Mark the bell: $\\mu - 3\\sigma = 1060 - 585 = 475$; $\\mu - 2\\sigma = 670$; $\\mu - \\sigma = 865$; $\\mu = 1060$; $\\mu + \\sigma = 1255$; $\\mu + 2\\sigma = 1450$; $\\mu + 3\\sigma = 1645$. Now we can answer questions like: What percent score between 865 and 1255? That's $\\mu \\pm 1\\sigma$, so 68%. What percent score above 1450? That's beyond $\\mu + 2\\sigma$: only $2.35\\% + 0.15\\% = 2.5\\%$ — very few students score that high."
            }
          ]
        }
      ],

      "worked_examples": [
        {
          "title": "Setting Up the Empirical Rule — Drawing the Curve",
          "problem": "Adult female heights in the U.S. are approximately normally distributed with $\\mu = 64$ inches and $\\sigma = 2.5$ inches. Label the complete bell curve with all seven boundary values and all eight region percentages.",
          "step_by_step": [
            {
              "step": "Identify $\\mu$ and $\\sigma$",
              "explanation": "Read the problem carefully and extract the two parameters.",
              "calculation": "$\\mu = 64$ inches, $\\sigma = 2.5$ inches"
            },
            {
              "step": "Calculate the Seven Boundary Values",
              "explanation": "Work outward from the mean in both directions, one standard deviation at a time.",
              "calculation": "$\\mu - 3\\sigma = 64 - 7.5 = 56.5$ in$\\quad$ $\\mu - 2\\sigma = 64 - 5 = 59$ in$\\quad$ $\\mu - \\sigma = 64 - 2.5 = 61.5$ in$\\quad$ $\\mu = 64$ in$\\quad$ $\\mu + \\sigma = 64 + 2.5 = 66.5$ in$\\quad$ $\\mu + 2\\sigma = 64 + 5 = 69$ in$\\quad$ $\\mu + 3\\sigma = 64 + 7.5 = 71.5$ in"
            },
            {
              "step": "Label Each Region with Its Percentage",
              "explanation": "From left to right, the eight regions always contain: 0.15% | 2.35% | 13.5% | 34% | 34% | 13.5% | 2.35% | 0.15%.",
              "calculation": "Below 56.5 in: 0.15% | 56.5–59 in: 2.35% | 59–61.5 in: 13.5% | 61.5–64 in: 34% | 64–66.5 in: 34% | 66.5–69 in: 13.5% | 69–71.5 in: 2.35% | Above 71.5 in: 0.15%"
            },
            {
              "step": "Verify: Percentages Sum to 100%",
              "explanation": "Always double-check your labeled curve.",
              "calculation": "$0.15 + 2.35 + 13.5 + 34 + 34 + 13.5 + 2.35 + 0.15 = 100\\%$ ✓"
            }
          ],
          "final_answer": "The seven boundary values are 56.5, 59, 61.5, 64, 66.5, 69, and 71.5 inches. From left to right, the eight regions contain 0.15%, 2.35%, 13.5%, 34%, 34%, 13.5%, 2.35%, and 0.15% of the data.",
          "concept_applied": "Always draw and label the curve first — before answering any question. A fully labeled curve turns Empirical Rule problems into simple addition."
        }
      ]
    },

    {
      "section_title": "Applying the Empirical Rule — Percentage and Probability Questions",
      "introduction": "Once you've labeled a bell curve, you can answer a wide variety of questions by identifying regions and adding percentages. The key skill is translating word problems into regions on the curve. There are four question types you need to master: finding the percentage between two values, finding the percentage above or below a value, finding a value given a percentage, and interpreting rare events.",

      "key_concept": {
        "definition": "Area under the normal curve = probability = percentage of data. When we say '34% of data falls between $\\mu$ and $\\mu + \\sigma$,' we equally mean 'the probability that a randomly selected value falls in that range is 0.34' or 'if we pick a random value, there is a 34% chance it falls in that range.' These are all the same statement.",
        "context": "Statistics problems often switch between 'percentage of data,' 'probability,' and 'proportion' — they mean the same thing in this context. 34% = 0.34 = 34 out of 100. Practice translating between these forms fluently."
      },

      "categories": [
        {
          "type": "Question Type 1: Percentage Between Two Values",
          "description": "The most common type. Shade the region between two values on your labeled curve and add up the percentages of each shaded region.",
          "detailed_mechanism": "Identify which boundary values your two numbers correspond to on the labeled curve. Shade the area between them. Add up the percentages of every region that is completely shaded. If the region doesn't start or end at an exact boundary value from the Empirical Rule, you cannot use this method alone — you'd need a z-table (Section 10.3). For now, all values will land on one of the seven boundaries.",
          "examples": [
            {
              "process": "Between $\\mu - \\sigma$ and $\\mu + \\sigma$",
              "explanation": "Using heights $N(64, 2.5)$: What percent of women are between 61.5 and 66.5 inches tall? These are exactly $\\mu - \\sigma$ and $\\mu + \\sigma$. The shaded region covers: 34% (from 61.5 to 64) + 34% (from 64 to 66.5) = 68%. This is just the first tier of the Empirical Rule — 68% are within 1 standard deviation of the mean."
            },
            {
              "process": "Between $\\mu$ and $\\mu + 2\\sigma$",
              "explanation": "What percent of women are between 64 and 69 inches? 64 is $\\mu$, 69 is $\\mu + 2\\sigma$. Shade right half of first tier (34%) + second tier on right (13.5%) = 34% + 13.5% = 47.5%. Note: the 34% here covers the region 64–66.5, and 13.5% covers 66.5–69."
            },
            {
              "process": "Non-Symmetric Region: $\\mu - 2\\sigma$ to $\\mu + \\sigma$",
              "explanation": "What percent of women are between 59 and 66.5 inches? 59 is $\\mu - 2\\sigma$, 66.5 is $\\mu + \\sigma$. Shade: 13.5% (59 to 61.5) + 34% (61.5 to 64) + 34% (64 to 66.5) = 81.5%. The region doesn't have to be symmetric — just identify and add."
            }
          ]
        },
        {
          "type": "Question Type 2: Percentage Above or Below a Single Value",
          "description": "You're given one boundary value and asked for the percentage above it or below it. Use your labeled curve and remember the total is 100%.",
          "detailed_mechanism": "For 'below': shade everything to the left and add those region percentages. For 'above': shade everything to the right. Alternatively, use the complement: P(above x) = 100% − P(below x). Remember that P(below $\\mu$) = 50% and P(above $\\mu$) = 50% by symmetry — that's your anchor point.",
          "examples": [
            {
              "process": "Percentage Below a Value",
              "explanation": "Heights $N(64, 2.5)$. What percent of women are shorter than 61.5 inches? 61.5 in is $\\mu - \\sigma$. Everything to the LEFT of 61.5: 13.5% + 2.35% + 0.15% = 16%. Or: the area to the left of $\\mu - \\sigma$ = $(100\\% - 68\\%) \\div 2 = 16\\%$. Same answer."
            },
            {
              "process": "Percentage Above a Value",
              "explanation": "What percent of women are taller than 69 inches? 69 in is $\\mu + 2\\sigma$. Everything to the RIGHT of 69: 2.35% + 0.15% = 2.5%. Or: area to the right of $\\mu + 2\\sigma$ = $(100\\% - 95\\%) \\div 2 = 2.5\\%$. This means being taller than 69 inches (5'9'') is fairly unusual — only 2.5% of women are that tall."
            },
            {
              "process": "Using the Complement",
              "explanation": "What percent of women are NOT between 59 and 69 inches? That's outside $\\mu \\pm 2\\sigma$. Percent inside = 95%. Percent outside = $100\\% - 95\\% = 5\\%$. Half in each tail: 2.5% above 69 and 2.5% below 59."
            }
          ]
        },
        {
          "type": "Question Type 3: Finding a Value Given a Percentage (Working Backwards)",
          "description": "Instead of 'what percent falls in this range?', the question gives you a percentage and asks you to find the corresponding boundary value. You work backwards from the labeled curve.",
          "detailed_mechanism": "Set up your labeled curve with all seven values. Find the region (or cumulative area) that matches the given percentage. Read off the boundary value. This requires recognizing which cumulative percentage corresponds to which boundary. Key cumulative percentages from the left: 0.15%, 2.5%, 16%, 50%, 84%, 97.5%, 99.85%.",
          "examples": [
            {
              "process": "Finding a Cutoff Value",
              "explanation": "Heights $N(64, 2.5)$. The top 16% of women by height are considered 'tall' for a modeling agency. What is the minimum height to qualify? 'Top 16%' means 84% are shorter. Cumulative 84% from the left corresponds to $\\mu + \\sigma = 66.5$ inches. A woman needs to be at least 66.5 inches (5'6.5'') tall."
            },
            {
              "process": "Finding the Middle Range",
              "explanation": "What heights contain the middle 95% of women? Middle 95% = within $\\mu \\pm 2\\sigma$ = from $\\mu - 2\\sigma$ to $\\mu + 2\\sigma$ = from 59 to 69 inches. The middle 95% of adult women are between 59 and 69 inches tall (4'11'' to 5'9'')."
            }
          ]
        },
        {
          "type": "Question Type 4: Expressing Results as Counts",
          "description": "If you know the percentage and the total number of people or items, you can find how many fall in a region. Multiply the percentage (as a decimal) by the total count.",
          "detailed_mechanism": "Convert the percentage to a decimal, then multiply by $n$ (total number). If 68% of 200 students fall within 1 standard deviation, that's $0.68 \\times 200 = 136$ students. This is applying probability to a specific group size.",
          "examples": [
            {
              "process": "From Percentage to Count",
              "explanation": "SAT scores $N(1060, 195)$. A school has 400 students who took the SAT. How many scored between 670 and 1450? 670 is $\\mu - 2\\sigma$ and 1450 is $\\mu + 2\\sigma$, so 95% scored in that range. Count = $0.95 \\times 400 = 380$ students."
            },
            {
              "process": "Unusually High or Low Values",
              "explanation": "Same school of 400 students. How many scored above 1645? 1645 is $\\mu + 3\\sigma$. The area above $\\mu + 3\\sigma$ is 0.15%. Count = $0.0015 \\times 400 = 0.6$ students. This rounds to approximately 0 or 1 student — scoring above 1645 is exceptionally rare."
            }
          ]
        }
      ]
    },

    {
      "section_title": "Worked Examples — Full Problem Walkthrough",
      "introduction": "These problems cover the full range of Empirical Rule question types. For each one, start by drawing and labeling your bell curve — that step alone is worth partial credit on tests and makes the rest of the problem straightforward.",

      "key_concept": {
        "definition": "The strategy for every Empirical Rule problem is the same: (1) Identify $\\mu$ and $\\sigma$. (2) Draw the bell curve. (3) Calculate and label all seven boundary values. (4) Label all eight region percentages. (5) Shade the region of interest. (6) Add the shaded percentages.",
        "context": "Students who skip drawing the curve consistently make errors — they miscalculate which regions to include or get confused about left vs. right tails. The drawing takes 30 seconds and eliminates the most common mistakes."
      },

      "worked_examples": [
        {
          "title": "Manufacturing Quality Control",
          "problem": "A machine fills juice bottles with approximately $N(16, 0.2)$ ounces. Quality control rejects bottles with less than 15.6 oz (too little) or more than 16.6 oz (too much). (a) What percent of bottles are rejected? (b) In a production run of 5,000 bottles, how many are rejected? (c) What fill amounts contain the middle 99.7% of bottles?",
          "step_by_step": [
            {
              "step": "Identify Parameters and Draw the Curve",
              "explanation": "Extract $\\mu$ and $\\sigma$ from the problem, then label all seven boundary values.",
              "calculation": "$\\mu = 16$ oz, $\\sigma = 0.2$ oz. Boundaries: $\\mu - 3\\sigma = 15.4$, $\\mu - 2\\sigma = 15.6$, $\\mu - \\sigma = 15.8$, $\\mu = 16$, $\\mu + \\sigma = 16.2$, $\\mu + 2\\sigma = 16.4$, $\\mu + 3\\sigma = 16.6$ oz."
            },
            {
              "step": "Identify the Rejection Regions",
              "explanation": "Bottles below 15.6 oz or above 16.6 oz are rejected. Locate these on the labeled curve.",
              "calculation": "15.6 oz = $\\mu - 2\\sigma$ and 16.6 oz = $\\mu + 3\\sigma$. Below 15.6: left of $\\mu - 2\\sigma$. Above 16.6: right of $\\mu + 3\\sigma$."
            },
            {
              "step": "Calculate Percent Below 15.6 oz",
              "explanation": "Add region percentages to the left of $\\mu - 2\\sigma$.",
              "calculation": "$2.35\\% + 0.15\\% = 2.5\\%$ of bottles are underfilled."
            },
            {
              "step": "Calculate Percent Above 16.6 oz",
              "explanation": "Add region percentage to the right of $\\mu + 3\\sigma$.",
              "calculation": "$0.15\\%$ of bottles are overfilled."
            },
            {
              "step": "Total Rejection Rate",
              "explanation": "Add both rejection regions — they don't overlap, so we add directly.",
              "calculation": "$2.5\\% + 0.15\\% = 2.65\\%$ of bottles are rejected."
            },
            {
              "step": "Number of Rejected Bottles",
              "explanation": "Multiply rejection rate (as decimal) by total production run.",
              "calculation": "$0.0265 \\times 5000 = 132.5 \\approx 133$ bottles rejected per run."
            },
            {
              "step": "Answer Part (c): Middle 99.7%",
              "explanation": "The middle 99.7% is within $\\mu \\pm 3\\sigma$ — that's the third tier of the Empirical Rule.",
              "calculation": "From $\\mu - 3\\sigma$ to $\\mu + 3\\sigma$ = from 15.4 to 16.6 oz."
            }
          ],
          "final_answer": "(a) 2.65% of bottles are rejected. (b) Approximately 133 bottles per run. (c) The middle 99.7% of bottles contain between 15.4 and 16.6 oz.",
          "concept_applied": "The rejection regions don't have to be symmetric. Identify each region separately on the labeled curve, find its percentage, then add them together."
        },
        {
          "title": "Test Score Analysis — Multiple Percentage Questions",
          "problem": "Scores on the state math exam are approximately normally distributed with $\\mu = 72$ and $\\sigma = 8$. Answer each question using the Empirical Rule: (a) What percent of students scored between 64 and 80? (b) What percent scored above 88? (c) What percent scored between 56 and 72? (d) If 2,500 students took the exam, how many scored below 56?",
          "step_by_step": [
            {
              "step": "Draw and Label the Curve",
              "explanation": "Calculate all seven boundary values.",
              "calculation": "$\\mu - 3\\sigma = 72 - 24 = 48$; $\\mu - 2\\sigma = 72 - 16 = 56$; $\\mu - \\sigma = 72 - 8 = 64$; $\\mu = 72$; $\\mu + \\sigma = 72 + 8 = 80$; $\\mu + 2\\sigma = 72 + 16 = 88$; $\\mu + 3\\sigma = 72 + 24 = 96$. Region percentages left to right: 0.15% | 2.35% | 13.5% | 34% | 34% | 13.5% | 2.35% | 0.15%."
            },
            {
              "step": "Part (a): Between 64 and 80",
              "explanation": "64 = $\\mu - \\sigma$ and 80 = $\\mu + \\sigma$. This is the first tier — within 1 standard deviation of the mean.",
              "calculation": "$34\\% + 34\\% = 68\\%$ of students scored between 64 and 80."
            },
            {
              "step": "Part (b): Above 88",
              "explanation": "88 = $\\mu + 2\\sigma$. Add all region percentages to the RIGHT of 88.",
              "calculation": "$2.35\\% + 0.15\\% = 2.5\\%$ scored above 88. Alternatively: area above $\\mu + 2\\sigma$ = $(100\\% - 95\\%) \\div 2 = 2.5\\%$."
            },
            {
              "step": "Part (c): Between 56 and 72",
              "explanation": "56 = $\\mu - 2\\sigma$ and 72 = $\\mu$ (the mean). Shade from $\\mu - 2\\sigma$ to $\\mu$ — left half of the first two tiers.",
              "calculation": "$13.5\\% + 34\\% = 47.5\\%$ scored between 56 and 72."
            },
            {
              "step": "Part (d): Below 56 (as a Count)",
              "explanation": "56 = $\\mu - 2\\sigma$. Percentage below 56 = 2.35% + 0.15% = 2.5%. Apply to 2,500 students.",
              "calculation": "$0.025 \\times 2500 = 62.5 \\approx 63$ students scored below 56."
            }
          ],
          "final_answer": "(a) 68% scored between 64 and 80. (b) 2.5% scored above 88. (c) 47.5% scored between 56 and 72. (d) Approximately 63 students scored below 56.",
          "concept_applied": "Every Empirical Rule answer comes from the same labeled curve. Draw it once, then use it to answer all parts of the problem. Non-symmetric regions (like part c) are handled by simply identifying and adding the correct sub-regions."
        },
        {
          "title": "Working Backwards — Finding a Value from a Percentage",
          "problem": "A coffee shop's wait times are approximately $N(4.5, 0.75)$ minutes. (a) The shop promises customers they'll be served within a time that captures 97.5% of all customers. What is that time? (b) The fastest 16% of service times are under how many minutes? (c) A 'normal' wait is defined as falling within the middle 68%. What is the range of normal wait times?",
          "step_by_step": [
            {
              "step": "Draw and Label the Curve",
              "explanation": "Calculate all seven boundaries.",
              "calculation": "$\\mu - 3\\sigma = 4.5 - 2.25 = 2.25$ min; $\\mu - 2\\sigma = 4.5 - 1.5 = 3.0$ min; $\\mu - \\sigma = 4.5 - 0.75 = 3.75$ min; $\\mu = 4.5$ min; $\\mu + \\sigma = 4.5 + 0.75 = 5.25$ min; $\\mu + 2\\sigma = 4.5 + 1.5 = 6.0$ min; $\\mu + 3\\sigma = 4.5 + 2.25 = 6.75$ min."
            },
            {
              "step": "Part (a): 97.5% Cutoff",
              "explanation": "'Served within X minutes' captures 97.5% — meaning 97.5% of wait times are BELOW X. Find the boundary where cumulative area from the left equals 97.5%.",
              "calculation": "Cumulative from left: below $\\mu + 2\\sigma$: $0.15 + 2.35 + 13.5 + 34 + 34 + 13.5 = 97.5\\%$. So $X = \\mu + 2\\sigma = 6.0$ minutes. The shop can promise: '97.5% of customers are served within 6 minutes.'"
            },
            {
              "step": "Part (b): Fastest 16%",
              "explanation": "'Fastest 16%' means the lowest 16% of wait times — the 16th percentile. Find the boundary where cumulative area from the left equals 16%.",
              "calculation": "Cumulative from left: below $\\mu - \\sigma$: $0.15 + 2.35 + 13.5 = 16\\%$. So $X = \\mu - \\sigma = 3.75$ minutes. The fastest 16% of service times are under 3.75 minutes."
            },
            {
              "step": "Part (c): Middle 68% Range",
              "explanation": "Middle 68% = within $\\mu \\pm 1\\sigma$. Find lower and upper boundaries.",
              "calculation": "Lower = $\\mu - \\sigma = 3.75$ min. Upper = $\\mu + \\sigma = 5.25$ min. A 'normal' wait is between 3.75 and 5.25 minutes."
            }
          ],
          "final_answer": "(a) The shop can promise service within 6.0 minutes for 97.5% of customers. (b) The fastest 16% of service times are under 3.75 minutes. (c) A 'normal' wait is between 3.75 and 5.25 minutes.",
          "concept_applied": "Working backwards uses the same labeled curve — instead of shading a region to find a percentage, you identify the cumulative percentage and read off the corresponding boundary value. Knowing the cumulative percentages (0.15%, 2.5%, 16%, 50%, 84%, 97.5%, 99.85%) at each boundary is essential."
        },
        {
          "title": "Salary Analysis — Real World Context",
          "problem": "Entry-level software developer salaries at a large tech company are approximately normally distributed with $\\mu = \\$85{,}000$ and $\\sigma = \\$9{,}000$. (a) What percent of developers earn between \\$76,000 and \\$94,000? (b) What percent earn more than \\$103,000? (c) The company defines 'high performers' as those earning above the 84th percentile. What is the minimum salary for a high performer? (d) The company employs 350 entry-level developers. How many earn less than \\$67,000?",
          "step_by_step": [
            {
              "step": "Draw and Label the Curve",
              "explanation": "Calculate all seven boundary salaries.",
              "calculation": "$\\mu - 3\\sigma = \\$85{,}000 - \\$27{,}000 = \\$58{,}000$; $\\mu - 2\\sigma = \\$67{,}000$; $\\mu - \\sigma = \\$76{,}000$; $\\mu = \\$85{,}000$; $\\mu + \\sigma = \\$94{,}000$; $\\mu + 2\\sigma = \\$103{,}000$; $\\mu + 3\\sigma = \\$112{,}000$."
            },
            {
              "step": "Part (a): Between \\$76,000 and \\$94,000",
              "explanation": "\\$76,000 = $\\mu - \\sigma$ and \\$94,000 = $\\mu + \\sigma$. This is the first tier.",
              "calculation": "$34\\% + 34\\% = 68\\%$ of developers earn between \\$76,000 and \\$94,000."
            },
            {
              "step": "Part (b): Above \\$103,000",
              "explanation": "\\$103,000 = $\\mu + 2\\sigma$. Add percentages to the right.",
              "calculation": "$2.35\\% + 0.15\\% = 2.5\\%$ earn above \\$103,000."
            },
            {
              "step": "Part (c): 84th Percentile",
              "explanation": "The 84th percentile means 84% of salaries fall below this value. Find which boundary has 84% cumulative area from the left.",
              "calculation": "Cumulative below $\\mu + \\sigma$: $0.15 + 2.35 + 13.5 + 34 + 34 = 84\\%$. So the 84th percentile = $\\mu + \\sigma = \\$94{,}000$. High performers earn above \\$94,000."
            },
            {
              "step": "Part (d): Below \\$67,000 — Count",
              "explanation": "\\$67,000 = $\\mu - 2\\sigma$. Percent below = $2.35\\% + 0.15\\% = 2.5\\%$. Multiply by 350 developers.",
              "calculation": "$0.025 \\times 350 = 8.75 \\approx 9$ developers earn less than \\$67,000."
            }
          ],
          "final_answer": "(a) 68% earn between \\$76,000 and \\$94,000. (b) 2.5% earn more than \\$103,000. (c) The minimum salary for a high performer is \\$94,000 (84th percentile). (d) Approximately 9 developers earn less than \\$67,000.",
          "concept_applied": "Currency problems work exactly like any other normal distribution — just treat the dollar amounts as the values on your number line. The Empirical Rule is completely unit-agnostic: it works for dollars, inches, test scores, ounces, or any continuous measurement."
        }
      ]
    },

    {
      "section_title": "Common Mistakes and How to Avoid Them",
      "introduction": "The Empirical Rule is conceptually clean, but there are several consistent errors students make. Knowing these in advance will save you points on assessments.",

      "key_concept": {
        "definition": "The most common Empirical Rule mistakes involve: adding wrong region percentages, confusing 'within $2\\sigma$' with 'above $2\\sigma$', forgetting that the rule applies symmetrically, and rounding the boundary values incorrectly.",
        "context": "Every mistake below can be prevented by drawing a fully labeled curve BEFORE answering. A labeled curve acts as a reference guide — if you can see all eight percentages, you're much less likely to add the wrong ones."
      },

      "categories": [
        {
          "type": "Mistake 1: Confusing 'Within $n$ Standard Deviations' vs. 'Beyond $n$ Standard Deviations'",
          "description": "'Within $2\\sigma$' means BETWEEN $\\mu - 2\\sigma$ and $\\mu + 2\\sigma$ — that's 95%. 'Beyond $2\\sigma$' means OUTSIDE that range — that's 5%. Students mix these up constantly.",
          "detailed_mechanism": "If a problem says '95% of data,' it means within $\\pm 2\\sigma$. If it says 'only 5% of data,' it means outside $\\pm 2\\sigma$ (2.5% in each tail). The Empirical Rule percentages (68%, 95%, 99.7%) always refer to the INSIDE region.",
          "examples": [
            {
              "process": "Common Confusion",
              "explanation": "Question: 'What percent of values fall MORE THAN 2 standard deviations from the mean?' Wrong answer: 95%. Correct: $100\\% - 95\\% = 5\\%$ (the complement). '95%' is the percent that falls WITHIN 2 standard deviations. The percent OUTSIDE is $5\\%$."
            }
          ]
        },
        {
          "type": "Mistake 2: Adding the Wrong Sub-Regions",
          "description": "When finding a non-symmetric region, students sometimes add the wrong tier percentages. The fix: label every region, then shade the specific sub-regions you need.",
          "detailed_mechanism": "For example, the region between $\\mu - 2\\sigma$ and $\\mu + \\sigma$ is NOT a standard tier. You must add three sub-regions: 13.5% + 34% + 34% = 81.5%. Students who skip labeling often grab 95% (the $\\pm 2\\sigma$ tier) or 68% (the $\\pm 1\\sigma$ tier) by habit — both are wrong here.",
          "examples": [
            {
              "process": "Non-Symmetric Region Error",
              "explanation": "Find the percent between $\\mu - 2\\sigma$ and $\\mu + \\sigma$. Common wrong answer: 95% or 68% (students grab the nearest familiar number). Correct: draw the curve, shade from $\\mu - 2\\sigma$ to $\\mu + \\sigma$, add sub-regions: $13.5\\% + 34\\% + 34\\% = 81.5\\%$."
            }
          ]
        },
        {
          "type": "Mistake 3: Forgetting to Convert Percentage to Decimal Before Multiplying",
          "description": "When finding a count from a percentage, you must convert to decimal (divide by 100) before multiplying by $n$.",
          "detailed_mechanism": "If 2.5% of 400 students scored above a threshold: WRONG: $2.5 \\times 400 = 1000$. CORRECT: $0.025 \\times 400 = 10$ students. Always convert percent to decimal first.",
          "examples": [
            {
              "process": "Count Calculation",
              "explanation": "13.5% of 200 data values fall in a certain region. Count = $0.135 \\times 200 = 27$ values. Not $13.5 \\times 200 = 2700$."
            }
          ]
        },
        {
          "type": "Mistake 4: Misidentifying Which Standard Deviation Tier a Value Falls On",
          "description": "Students sometimes calculate boundary values incorrectly, especially when $\\sigma$ is a decimal or an unusual number. Always compute each boundary as $\\mu \\pm n\\sigma$ explicitly.",
          "detailed_mechanism": "Do not try to eyeball which boundary a value falls on. Calculate all seven boundary values explicitly, write them on your curve, then check where the given value lands. If $\\mu = 45$ and $\\sigma = 6.5$: $\\mu + 2\\sigma = 45 + 13 = 58$, not 57 or 59.",
          "examples": [
            {
              "process": "Decimal Standard Deviation",
              "explanation": "$N(100, 12.5)$. Boundary values: 62.5, 75, 87.5, 100, 112.5, 125, 137.5. Students commonly write 110 or 115 for $\\mu + \\sigma$ when $\\sigma = 12.5$. Calculate explicitly: $100 + 12.5 = 112.5$. Don't round $\\sigma$ before calculating — that shifts all seven boundaries and cascades into wrong answers."
            }
          ]
        },
        {
          "type": "Mistake 5: Applying the Empirical Rule to Non-Normal Data",
          "description": "The Empirical Rule ONLY applies to approximately normal (bell-shaped) distributions. Do not use it for skewed data.",
          "detailed_mechanism": "If a problem describes heavily skewed data — like household incomes, number of absences, or social media followers — the Empirical Rule cannot be applied. The 68-95-99.7 percentages are derived specifically from the bell-curve shape. Skewed distributions have very different percentages within each standard deviation. Always check: is the distribution described as normal (or approximately normal)?",
          "examples": [
            {
              "process": "Non-Normal Data",
              "explanation": "Household incomes are right-skewed. Using the Empirical Rule to say '68% of households earn within 1 standard deviation of the mean income' would be wrong. The Empirical Rule doesn't apply here. Always look for the word 'normal' or 'approximately normal' before using this tool."
            }
          ]
        }
      ]
    },

    {
      "section_title": "Connecting to the Big Picture — Why Normal Distributions Matter",
      "introduction": "You might be wondering: why do so many things follow a normal distribution? And why does this matter beyond just computing percentages? This section gives you the conceptual foundation for everything that follows in Units 10 and beyond.",

      "key_concept": {
        "definition": "The Central Limit Theorem (previewed here, formalized later) states that when you take large enough random samples from ANY population, the distribution of sample means will be approximately normal — regardless of the original population's shape. This is why normal distributions are everywhere in statistics.",
        "context": "You don't need to master the Central Limit Theorem right now, but you should understand its implication: the tools we're building here (normal distribution, Empirical Rule, z-scores) are universally applicable because of this theorem. Even non-normal populations produce normal-looking sample mean distributions when sampled properly."
      },

      "categories": [
        {
          "type": "Why So Many Real Datasets Are Normal",
          "description": "Many natural measurements are the result of many small, independent random factors adding together. When this happens, the result tends to be normally distributed — a mathematical fact proven by the Central Limit Theorem.",
          "detailed_mechanism": "Height is influenced by hundreds of genes and environmental factors, each adding a small amount. Test scores are affected by preparation, sleep, prior knowledge, and test-day conditions. Measurement errors in manufacturing are caused by countless tiny vibrations and imprecisions. Each of these is a sum of many small random effects — and sums of many small random effects follow a normal distribution.",
          "examples": [
            {
              "process": "Human Heights",
              "explanation": "Your height is the sum of contributions from hundreds of genetic and environmental factors. No single factor dominates — they all add up. Result: heights are normally distributed within a population of the same biological sex."
            },
            {
              "process": "Standardized Test Scores",
              "explanation": "A student's score reflects knowledge across hundreds of topics, test-taking skill, sleep, stress, and more. These many small factors average out into a roughly normal distribution across a large population of test-takers."
            }
          ]
        },
        {
          "type": "Connection to Future Topics",
          "description": "The Empirical Rule is the intuitive foundation for z-scores (Section 10.3), confidence intervals (Section 10.6), and margin of error (Section 10.7). Understanding it deeply now pays dividends for the rest of the unit.",
          "detailed_mechanism": "In Section 10.3, we'll extend the Empirical Rule to ANY boundary value (not just exact standard deviation multiples) using z-scores and a table. In Section 10.6, we'll use the fact that '95% of data falls within $\\pm 2\\sigma$' to construct confidence intervals. In Section 10.7, we'll use 1.96 standard deviations (the precise version of 'approximately 2') to calculate margins of error. Everything connects.",
          "examples": [
            {
              "process": "Preview of z-Scores",
              "explanation": "The Empirical Rule only works when values fall exactly on $\\mu \\pm \\sigma$, $\\mu \\pm 2\\sigma$, or $\\mu \\pm 3\\sigma$. What if a test score is 78 in a $N(72, 8)$ distribution? It doesn't fall on a boundary. In Section 10.3, we'll convert 78 to a z-score: $z = (78 - 72)/8 = 0.75$, and use a table to find the exact percentage. The Empirical Rule is the special case; z-scores are the general tool."
            }
          ]
        }
      ]
    }
  ],

  "key_terms": [
    "Normal Distribution",
    "$X \\sim N(\\mu, \\sigma)$",
    "Parameters $\\mu$ and $\\sigma$",
    "Bell Curve",
    "Symmetric Distribution",
    "Empirical Rule",
    "68-95-99.7 Rule",
    "$\\mu \\pm 1\\sigma$ (68%)",
    "$\\mu \\pm 2\\sigma$ (95%)",
    "$\\mu \\pm 3\\sigma$ (99.7%)",
    "Inflection Points",
    "Asymptotic Tails",
    "Area Under the Curve",
    "Probability as Area",
    "Continuous Random Variable",
    "Cumulative Percentage",
    "Percentile",
    "Complement Rule",
    "Approximately Normal",
    "Central Limit Theorem (preview)",
    "Population vs. Sample Distribution"
  ],

  "summary": "A normal distribution is a symmetric, bell-shaped curve completely described by its mean $\\mu$ (center) and standard deviation $\\sigma$ (spread), written $X \\sim N(\\mu, \\sigma)$. The mean, median, and mode are all equal, the total area under the curve equals 1 (100%), and the tails extend infinitely without touching the x-axis. The Empirical Rule states that in any normal distribution, approximately 68% of data falls within $\\mu \\pm 1\\sigma$, approximately 95% within $\\mu \\pm 2\\sigma$, and approximately 99.7% within $\\mu \\pm 3\\sigma$. Breaking this down further: each half of the first tier contains 34%, each second-tier slice contains 13.5%, each third-tier slice contains 2.35%, and each far tail contains 0.15%. The strategy for every problem is identical: identify $\\mu$ and $\\sigma$, draw and label the bell curve with all seven boundary values and all eight region percentages, then shade and sum the region(s) of interest. The Empirical Rule applies ONLY to approximately normal data — not to skewed distributions. These concepts form the direct foundation for z-scores (Section 10.3), confidence intervals (Section 10.6), and margin of error (Section 10.7)."
}
