{
  "expanded_description": "The Empirical Rule gave us a quick way to estimate proportions for values that fall exactly 1, 2, or 3 standard deviations from the mean. But what about a score that is 1.3 standard deviations above the mean? Or 2.7 below? Real data rarely lands exactly on those whole numbers. To handle any value, we need a method to standardize any data point from any normal distribution. This is where z-scores and the Standard Normal Distribution come in. They allow us to calculate precise probabilities and compare values from completely different scales—like comparing an SAT score to an ACT score, or a height in inches to a weight in pounds. Mastering z-scores unlocks the full power of inferential statistics.",

  "core_concept": {
    "principle": "Any value from any normal distribution can be transformed into a z-score that tells us exactly how many standard deviations it is from its mean. These z‑scores follow a special distribution called the Standard Normal Distribution, which has a mean of 0 and a standard deviation of 1. By using this standard distribution, we can find precise probabilities for any original value.",
    "explanation": "Think of z‑scores as a universal translator. Imagine you scored 85 on a math test and 120 on a reading test. Which is better? The raw numbers are incomparable because the tests have different means and spreads. Converting both to z‑scores puts them on the same scale: \"how many standard deviations above or below the mean?\" Once on this common scale, we can compare them directly and also use the standard normal curve (and its tables) to find the exact percent of people who scored below or above each score."
  },

  "sections": [
    {
      "section_title": "10.3 Z-scores and the Standard Normal Distribution",
      "introduction": "The Empirical Rule is a handy shortcut, but it only works for whole numbers of standard deviations. To find the proportion of data for any value—say, a test score of 680 when the mean is 500 and the standard deviation is 100—we need a more precise tool. That tool is the z‑score. By converting any normally distributed value into a z‑score, we can use the standard normal distribution (which has been extensively tabulated) to find exact probabilities. This section will teach you how to calculate z‑scores, how to use them with the standard normal table, and how to interpret the results in real‑world contexts.",

      "key_concept": {
        "definition": "A z‑score (also called a standard score) measures the distance between a data point and the mean in units of the standard deviation. The formula is $z = \\frac{x - \\mu}{\\sigma}$ for a population, or $z = \\frac{x - \\bar{x}}{s}$ for a sample. The Standard Normal Distribution is the distribution of all z‑scores; it is a normal distribution with mean $\\mu = 0$ and standard deviation $\\sigma = 1$, denoted as $N(0,1)$.",
        "context": "Why is this useful? Because once any value is converted to a z‑score, we can find the probability of observing a value less than (or greater than) that score using a single table—the standard normal (z) table. This table gives the cumulative area under the curve to the left of a given z‑score. With it, we can answer questions like \"What percentage of students scored lower than 680?\" or \"What score separates the top 10% from the rest?\""
      },

      "classifications": [
        {
          "type": "Calculating and Interpreting Z‑scores",
          "value": "Z‑scores are the essential first step in any normal probability calculation.",
          "characteristics": [
            "Formula: $z = \\frac{x - \\mu}{\\sigma}$ (population) or $z = \\frac{x - \\bar{x}}{s}$ (sample).",
            "The numerator $(x - \\mu)$ is the deviation from the mean.",
            "Dividing by the standard deviation scales the deviation into \"standard deviation units.\"",
            "A positive z‑score means the original value is **above** the mean.",
            "A negative z‑score means the original value is **below** the mean.",
            "A z‑score of 0 means the original value equals the mean.",
            "Z‑scores have no units—they are pure numbers, which allows comparison across different datasets.",
            "The magnitude of the z‑score tells you how far away the value is in terms of standard deviations (e.g., $z = 1.5$ means 1.5 standard deviations above the mean)."
          ],
          "behavior": "To calculate a z‑score, always subtract the mean first, then divide by the standard deviation. The result tells you the relative standing of that value. For example, if a student scores 680 on the SAT (which has $\\mu = 500$, $\\sigma = 100$), the z‑score is $(680-500)/100 = 1.8$. This means the student scored 1.8 standard deviations above the average. If another student scores 19 on the ACT (with $\\mu = 21$, $\\sigma = 4.7$), the z‑score is $(19-21)/4.7 \\approx -0.43$, meaning they scored about 0.43 standard deviations below the ACT average. Now the two scores can be compared: the SAT score of 680 is much more impressive (further above its mean) than the ACT score of 19 (which is slightly below its mean).",
          "examples": [
            {
              "process": "Basic Z‑score Calculation",
              "explanation": "Heights of adult women in the U.S. are approximately normally distributed with $\\mu = 65$ inches and $\\sigma = 2.5$ inches. Find the z‑score for a woman who is 70 inches tall. $z = (70 - 65) / 2.5 = 5 / 2.5 = 2.0$. She is exactly 2 standard deviations above the mean."
            },
            {
              "process": "Z‑score Below the Mean",
              "explanation": "Using the same height distribution, find the z‑score for a woman 60 inches tall. $z = (60 - 65) / 2.5 = (-5) / 2.5 = -2.0$. She is 2 standard deviations below the mean."
            },
            {
              "process": "Comparing Two Different Tests",
              "explanation": "Maria scored 85 on a history test with class mean 75 and standard deviation 8. Juan scored 82 on a chemistry test with class mean 70 and standard deviation 6. Who did better relative to their class? Maria: $z = (85-75)/8 = 10/8 = 1.25$. Juan: $z = (82-70)/6 = 12/6 = 2.0$. Juan's score is 2 standard deviations above his class mean, while Maria's is only 1.25 above. Juan performed better relative to his peers."
            },
            {
              "process": "Finding the Raw Score from a Z‑score",
              "explanation": "Sometimes we know the z‑score and need the original value. Rearranging the formula: $x = \\mu + z\\sigma$. For example, on an IQ test with $\\mu = 100$, $\\sigma = 15$, what raw score corresponds to a z‑score of 1.5? $x = 100 + 1.5(15) = 100 + 22.5 = 122.5$. So an IQ of about 123 is 1.5 standard deviations above the mean."
            }
          ]
        },
        {
          "type": "The Standard Normal Distribution ($N(0,1)$)",
          "value": "The standard normal distribution is the bridge between any normal distribution and exact probabilities.",
          "characteristics": [
            "Has mean $\\mu = 0$ and standard deviation $\\sigma = 1$.",
            "Often denoted by the letter $Z$: $Z \\sim N(0,1)$.",
            "The total area under the curve equals 1 (100%).",
            "Areas under this curve correspond to probabilities or percentages.",
            "The curve is symmetric about 0, so the area to the left of $z = 0$ is 0.5.",
            "Because it's a continuous distribution, the probability of any exact value is 0; we only consider intervals.",
            "Probabilities are found using a **z‑table** (standard normal table) or calculator functions (like `normalcdf`)."
          ],
          "behavior": "Once you have a z‑score, you can locate it on the horizontal axis of the standard normal curve. The area to the left of that z‑score (from negative infinity up to that point) is the cumulative probability. Z‑tables are typically organized with the first two digits of the z‑score (e.g., 1.2) in the rows, and the hundredths digit (e.g., 0.05) in the columns. The intersection gives $P(Z < z)$. Because the total area is 1, you can find right‑tail areas by subtracting from 1: $P(Z > z) = 1 - P(Z < z)$. Areas between two z‑scores are found by subtracting the smaller cumulative from the larger.",
          "examples": [
            {
              "process": "Reading the Z‑table for a Positive Z‑score",
              "explanation": "Find $P(Z < 1.25)$. Look at the row for 1.2 and the column for 0.05. In a typical table, the value is 0.8944. This means about 89.44% of the data lies below a z‑score of 1.25."
            },
            {
              "process": "Reading the Z‑table for a Negative Z‑score",
              "explanation": "Find $P(Z < -0.73)$. Negative z‑scores are either in a separate table or you can use symmetry: $P(Z < -0.73) = P(Z > 0.73) = 1 - P(Z < 0.73)$. But if your table includes negatives, look up row -0.7, column 0.03. Typically you get about 0.2327. So 23.27% of the data lies below -0.73."
            },
            {
              "process": "Finding the Area to the Right",
              "explanation": "What percent of data lies above $z = 1.25$? First find $P(Z < 1.25) = 0.8944$. Then $P(Z > 1.25) = 1 - 0.8944 = 0.1056$, or about 10.56%."
            },
            {
              "process": "Finding the Area Between Two Z‑scores",
              "explanation": "Find the probability that $Z$ is between $-1.00$ and $1.50$. $P(Z < 1.50) = 0.9332$, $P(Z < -1.00) = 0.1587$. The area between is $0.9332 - 0.1587 = 0.7745$, or 77.45%."
            }
          ]
        },
        {
          "type": "Finding Probabilities for Any Normal Distribution",
          "value": "The real power: use z‑scores to find probabilities for any normal variable $X \\sim N(\\mu, \\sigma)$.",
          "characteristics": [
            "Step 1: Convert the $x$‑value(s) to $z$‑scores using $z = \\frac{x - \\mu}{\\sigma}$.",
            "Step 2: Draw a sketch of the normal curve, shade the area of interest, and mark the $z$‑score(s).",
            "Step 3: Use the z‑table to find the area(s) corresponding to the $z$‑score(s).",
            "Step 4: Perform any necessary addition or subtraction to get the desired area.",
            "Step 5: Interpret the result as a probability or percentage in the context of the problem.",
            "This method works because the shape of the normal curve is preserved under linear transformation; the area under the original curve between two $x$‑values is exactly the same as the area under $N(0,1)$ between the corresponding $z$‑scores."
          ],
          "behavior": "For example, suppose heights of women ($\\mu = 65$, $\\sigma = 2.5$) are normally distributed. To find the proportion of women taller than 68 inches, first convert 68 to a z‑score: $z = (68-65)/2.5 = 1.2$. Then find $P(Z > 1.2) = 1 - P(Z < 1.2) = 1 - 0.8849 = 0.1151$. So about 11.5% of women are taller than 68 inches. Always sketch the curve to avoid mistakes about whether to use left, right, or between.",
          "examples": [
            {
              "process": "Finding the Probability Below a Value",
              "explanation": "The scores on a college entrance exam are normally distributed with $\\mu = 500$ and $\\sigma = 100$. What proportion of students score below 680? Step 1: $z = (680-500)/100 = 1.80$. Step 2: Sketch. Step 3: Look up $z=1.80$ in table → 0.9641. Step 4: That's the left‑tail area. Step 5: About 96.4% of students score below 680."
            },
            {
              "process": "Finding the Probability Above a Value",
              "explanation": "For the same exam, what percent score above 680? We already have $P(Z < 1.80) = 0.9641$, so $P(Z > 1.80) = 1 - 0.9641 = 0.0359$. About 3.6% score above 680."
            },
            {
              "process": "Finding the Probability Between Two Values",
              "explanation": "What proportion score between 450 and 600? Convert 450: $z_1 = (450-500)/100 = -0.50$. Convert 600: $z_2 = (600-500)/100 = 1.00$. $P(Z < 1.00) = 0.8413$, $P(Z < -0.50) = 0.3085$. Subtract: $0.8413 - 0.3085 = 0.5328$. About 53.3% score between 450 and 600."
            },
            {
              "process": "Real‑World Application: Quality Control",
              "explanation": "A machine fills bags of chips with weights normally distributed, mean $\\mu = 10.0$ oz, standard deviation $\\sigma = 0.2$ oz. Bags under 9.7 oz are considered underweight and rejected. What percent of bags are rejected? $z = (9.7-10.0)/0.2 = (-0.3)/0.2 = -1.5$. $P(Z < -1.5) = 0.0668$. About 6.7% of bags are rejected."
            }
          ]
        },
        {
          "type": "Finding Z‑scores from Given Probabilities (Inverse Lookup)",
          "value": "Sometimes we know the percentile and need to find the corresponding raw score. This is the reverse process.",
          "characteristics": [
            "Step 1: Identify the cumulative probability (area to the left) of interest.",
            "Step 2: Use the z‑table in reverse: find the area inside the table closest to the desired probability, then read the corresponding $z$‑score.",
            "Step 3: Convert the $z$‑score back to the original scale using $x = \\mu + z\\sigma$.",
            "This is often called the \"inverse normal\" problem.",
            "Many calculators have an `invNorm` function that does this directly."
          ],
          "behavior": "For example, suppose a college wants to admit only students whose test scores are in the top 10%. The test scores are $N(500,100)$. Top 10% means the 90th percentile (10% above means 90% below). Look for 0.9000 inside the z‑table; the closest is often 0.8997 corresponding to $z = 1.28$. Then $x = 500 + 1.28(100) = 628$. So a student needs about 628 to be in the top 10%.",
          "examples": [
            {
              "process": "Finding a Percentile",
              "explanation": "IQ scores are normally distributed with $\\mu = 100$, $\\sigma = 15$. Find the score that marks the 95th percentile. We need $z$ such that $P(Z < z) = 0.9500$. Look in the table: 0.9500 is exactly between 0.9495 ($z=1.64$) and 0.9505 ($z=1.65$). Often we take $z=1.645$ (the average). Then $x = 100 + 1.645(15) \\approx 124.7$. So an IQ of about 125 is the 95th percentile."
            },
            {
              "process": "Finding the Cutoff for the Bottom 5%",
              "explanation": "For the same IQ distribution, find the score that separates the bottom 5% from the rest. We need $P(Z < z) = 0.0500$. Looking in the negative z‑table (or using symmetry), the $z$ corresponding to 0.05 is about -1.645. Then $x = 100 + (-1.645)(15) \\approx 75.3$. So about 5% of people have an IQ below 75."
            },
            {
              "process": "Finding the Middle 60%",
              "explanation": "Heights of women ($\\mu=65$, $\\sigma=2.5$) are normally distributed. Find the range of heights that contains the middle 60% of women. Middle 60% means 30% in each tail, so 20% in the left tail and 20% in the right tail? Wait: middle 60% means 60% in the center, leaving 40% in the tails, split equally: 20% in the left tail, 20% in the right tail. So the left cutoff is the 20th percentile ($P(Z < z) = 0.20$). From the table, $z \\approx -0.84$. The right cutoff is the 80th percentile ($P(Z < z) = 0.80$) → $z \\approx 0.84$. Convert: $x_{low} = 65 + (-0.84)(2.5) = 65 - 2.1 = 62.9$ inches. $x_{high} = 65 + 0.84(2.5) = 65 + 2.1 = 67.1$ inches. The middle 60% of women are between about 62.9 and 67.1 inches tall."
            }
          ]
        }
      ],

      "worked_examples": [
        {
          "title": "SAT Scores and Percentiles",
          "problem": "SAT math scores are normally distributed with a mean of 500 and a standard deviation of 100. (a) What percentage of students score between 400 and 600? (b) What score is needed to be in the top 15% of test takers? (c) If a student scored 650, what is their percentile rank?",
          "step_by_step": [
            {
              "step": "Identify the parameters.",
              "explanation": "The problem tells us the distribution is normal with $\\mu = 500$ and $\\sigma = 100$.",
              "calculation": "$\\mu = 500$, $\\sigma = 100$."
            },
            {
              "step": "Part (a): Convert 400 and 600 to z‑scores.",
              "explanation": "Use $z = (x - \\mu)/\\sigma$.",
              "calculation": "For $x = 400$: $z_1 = (400-500)/100 = -1.00$. For $x = 600$: $z_2 = (600-500)/100 = 1.00$."
            },
            {
              "step": "Part (a): Find the area between $z = -1.00$ and $z = 1.00$.",
              "explanation": "From the standard normal table, $P(Z < 1.00) = 0.8413$ and $P(Z < -1.00) = 0.1587$.",
              "calculation": "Area between = $0.8413 - 0.1587 = 0.6826$."
            },
            {
              "step": "Part (a): Interpret.",
              "explanation": "About 68.26% of students score between 400 and 600. Notice this matches the Empirical Rule's 68% approximation.",
              "calculation": "Answer: ≈68.3%."
            },
            {
              "step": "Part (b): Top 15% means the 85th percentile.",
              "explanation": "We need the $z$-score such that $P(Z < z) = 0.8500$.",
              "calculation": "Look in the z‑table for 0.8500. The closest values are 0.8485 ($z=1.03$) and 0.8508 ($z=1.04$). Interpolating roughly gives $z \\approx 1.035$."
            },
            {
              "step": "Part (b): Convert z‑score back to raw score.",
              "explanation": "Use $x = \\mu + z\\sigma$.",
              "calculation": "$x = 500 + 1.035(100) = 500 + 103.5 = 603.5$. So a score of about 604 is needed to be in the top 15%."
            },
            {
              "step": "Part (c): Find percentile for a score of 650.",
              "explanation": "First convert 650 to a z‑score.",
              "calculation": "$z = (650-500)/100 = 1.50$."
            },
            {
              "step": "Part (c): Find cumulative probability for $z = 1.50$.",
              "explanation": "From the table, $P(Z < 1.50) = 0.9332$.",
              "calculation": "This means the student scored better than about 93.32% of test takers. The percentile rank is approximately 93rd."
            }
          ],
          "final_answer": "(a) About 68.3% score between 400 and 600. (b) A score of approximately 604 is needed for the top 15%. (c) A score of 650 is at about the 93rd percentile.",
          "concept_applied": "This example demonstrates the full cycle: converting raw scores to z‑scores to find probabilities, using the table to find percentiles, and using inverse lookup to find a cutoff score."
        },
        {
          "title": "Comparing Performance Across Different Scales",
          "problem": "Jonas took the ACT and scored 28. The ACT has a mean of 21 and a standard deviation of 4.7. Maria took the SAT and scored 1300. The SAT has a mean of 1100 and a standard deviation of 200. Who performed better relative to their test-taking population?",
          "step_by_step": [
            {
              "step": "Calculate Jonas's z‑score.",
              "explanation": "Use $z = (x - \\mu)/\\sigma$ for the ACT.",
              "calculation": "$z_J = (28 - 21) / 4.7 = 7 / 4.7 \\approx 1.49$."
            },
            {
              "step": "Calculate Maria's z‑score.",
              "explanation": "Use $z = (x - \\mu)/\\sigma$ for the SAT.",
              "calculation": "$z_M = (1300 - 1100) / 200 = 200 / 200 = 1.00$."
            },
            {
              "step": "Compare the z‑scores.",
              "explanation": "Jonas's z‑score of 1.49 means he scored 1.49 standard deviations above the ACT mean. Maria's z‑score of 1.00 means she scored 1.00 standard deviations above the SAT mean.",
              "calculation": "Since 1.49 > 1.00, Jonas performed better relative to his group."
            },
            {
              "step": "Optional: Find percentiles.",
              "explanation": "To see the difference in percentile terms, look up the cumulative probabilities.",
              "calculation": "For $z=1.49$, $P(Z<1.49) \\approx 0.9319$ (93rd percentile). For $z=1.00$, $P(Z<1.00) = 0.8413$ (84th percentile). Jonas outperformed Maria by a substantial margin."
            }
          ],
          "final_answer": "Jonas performed better relative to his test-taking population (z ≈ 1.49 vs. Maria's z = 1.00).",
          "concept_applied": "Z‑scores allow fair comparison of values from different normal distributions by removing the effects of different means and standard deviations."
        },
        {
          "title": "Working Backwards: Finding the Mean from a Known Percentile",
          "problem": "A researcher knows that in a normally distributed dataset, the value 75 corresponds to the 90th percentile. If the standard deviation is known to be 10, what is the mean of the distribution?",
          "step_by_step": [
            {
              "step": "Find the z‑score for the 90th percentile.",
              "explanation": "We need $z$ such that $P(Z < z) = 0.9000$.",
              "calculation": "From the z‑table, 0.9000 is approximately between $z=1.28$ (0.8997) and $z=1.29$ (0.9015). Using $z \\approx 1.28$ is common."
            },
            {
              "step": "Use the z‑score formula in reverse to solve for $\\mu$.",
              "explanation": "The formula $z = (x - \\mu)/\\sigma$ can be rearranged to $x = \\mu + z\\sigma$. We know $x=75$, $z \\approx 1.28$, $\\sigma=10$.",
              "calculation": "$75 = \\mu + 1.28(10)$ → $75 = \\mu + 12.8$ → $\\mu = 75 - 12.8 = 62.2$."
            },
            {
              "step": "Interpret.",
              "explanation": "The mean of the distribution is approximately 62.2.",
              "calculation": "Check: A value of 75 is 12.8 above the mean, which is 1.28 standard deviations (since $\\sigma=10$), matching the 90th percentile."
            }
          ],
          "final_answer": "The mean is approximately 62.2.",
          "concept_applied": "This shows how to use the inverse normal lookup to find an unknown parameter when a percentile and standard deviation are given."
        },
        {
          "title": "Probability Between Two Values with Non‑Integer Z‑scores",
          "problem": "The life span of a particular brand of light bulb is normally distributed with a mean of 800 hours and a standard deviation of 40 hours. What proportion of bulbs last between 750 and 850 hours?",
          "step_by_step": [
            {
              "step": "Convert the lower bound (750) to a z‑score.",
              "explanation": "Use $z = (x - \\mu)/\\sigma$.",
              "calculation": "$z_{750} = (750 - 800)/40 = (-50)/40 = -1.25$."
            },
            {
              "step": "Convert the upper bound (850) to a z‑score.",
              "explanation": "Similarly for 850.",
              "calculation": "$z_{850} = (850 - 800)/40 = 50/40 = 1.25$."
            },
            {
              "step": "Find the cumulative probabilities from the z‑table.",
              "explanation": "Look up $z = -1.25$ and $z = 1.25$.",
              "calculation": "$P(Z < 1.25) = 0.8944$. By symmetry, $P(Z < -1.25) = 1 - 0.8944 = 0.1056$ (or directly from negative table)."
            },
            {
              "step": "Subtract to find the area between.",
              "explanation": "Area between = $P(Z < 1.25) - P(Z < -1.25)$.",
              "calculation": "$0.8944 - 0.1056 = 0.7888$."
            },
            {
              "step": "Interpret.",
              "explanation": "About 78.88% of bulbs last between 750 and 850 hours.",
              "calculation": "Answer: ≈78.9%."
            }
          ],
          "final_answer": "Approximately 78.9% of bulbs last between 750 and 850 hours.",
          "concept_applied": "This example reinforces the process of converting raw scores to z‑scores and using the table to find the area between two non‑integer z‑values."
        }
      ]
    }
  ],

  "key_terms": [
    "Z‑score (Standard Score)",
    "Standard Normal Distribution",
    "$N(0,1)$",
    "Z‑table (Standard Normal Table)",
    "Cumulative Probability",
    "Percentile",
    "Inverse Normal Lookup",
    "Standardization",
    "Normalcdf",
    "InvNorm",
    "Left‑tail area",
    "Right‑tail area"
  ],

  "summary": "Z‑scores provide a universal way to compare values from any normal distribution by measuring how many standard deviations a value is from its mean. The formula $z = \\frac{x - \\mu}{\\sigma}$ converts any normal random variable $X$ into a standard normal variable $Z$, which follows the standard normal distribution $N(0,1)$. Using the z‑table (or calculator functions), we can find exact probabilities for any $z$‑score, representing the area under the curve to the left of that score. This allows us to determine percentiles, find the proportion of data between any two values, and even work backwards from a given percentile to find the corresponding raw score. Mastering z‑scores is essential for understanding statistical inference, confidence intervals, and hypothesis testing, which will be covered in later sections."
}
