{
  "expanded_description": "Why do countries trade with each other? If the United States can produce both cars and computers more efficiently than Mexico, should it still trade with Mexico? Intuition might say no—why buy from someone who is less efficient? But as we'll discover, even countries that are better at producing everything can benefit from trade. The key lies in comparative advantage, not absolute advantage. This concept, first explained by economist David Ricardo in 1817, is one of the most powerful and counterintuitive ideas in economics. It shows that specialization and trade can make everyone better off, even when one party is better at everything. In this section, we'll explore absolute and comparative advantage, how to calculate opportunity costs to determine who should produce what, and how trade allows countries (and individuals) to consume beyond their production possibilities.",
  
  "core_concept": {
    "principle": "Comparative advantage is the ability to produce a good at a lower opportunity cost than another producer. It is the foundation for mutually beneficial trade. (1) Absolute advantage: The ability to produce more of a good using the same resources, or produce the same amount using fewer resources. Absolute advantage is about productivity. (2) Comparative advantage: The ability to produce a good at a lower opportunity cost. Even if one producer has an absolute advantage in everything, both producers can still gain from trade if they specialize according to their comparative advantage. (3) Opportunity cost calculation: To determine comparative advantage, calculate the opportunity cost of producing each good. For each producer, the opportunity cost of Good A is the amount of Good B given up to produce one unit of Good A. (4) Specialization: Each producer should specialize in producing the good for which they have the lower opportunity cost (their comparative advantage). (5) Gains from trade: By specializing and trading, both parties can consume beyond their own production possibilities. The terms of trade (the rate at which goods are exchanged) must lie between the two producers' opportunity costs for both to benefit. (6) Key insight: Comparative advantage, not absolute advantage, determines the pattern of trade. A country can be less efficient in everything but still benefit from trade by specializing in what it does relatively best.",
    
    "explanation": "Think of a lawyer who is also a faster typist than their secretary. The lawyer has an absolute advantage in both law and typing. But should the lawyer do their own typing? No—every hour spent typing is an hour away from practicing law, which pays much more. The lawyer's comparative advantage is law; the secretary's comparative advantage is typing. Both gain if the lawyer focuses on law and the secretary does the typing. Trade allows each to do what they do relatively best.",
    
    "image": {
      "src": "images/unit1/comparative_advantage_overview.png",
      "alt": "Lawyer and secretary illustration showing specialization: lawyer practices law, secretary types",
      "caption": "Figure 1.4.1: Comparative advantage explains why even the most productive people specialize and trade."
    }
  },

  "sections": [
    {
      "section_title": "1.4 Comparative Advantage",
      "introduction": "Trade is everywhere. You trade your labor for a paycheck, then trade that paycheck for food, housing, and entertainment. Nations trade with each other for cars, oil, electronics, and agricultural products. But what determines who produces what? Why doesn't every country produce everything it needs? The answer lies in comparative advantage—a concept that explains the pattern of trade and why trade creates value. In this section, we'll explore absolute vs. comparative advantage, how to calculate opportunity costs, how to determine the terms of trade, and how specialization and trade allow parties to consume beyond their production possibilities curves.",
      
      "introduction_image": {
        "src": "images/unit1/trade_intro.png",
        "alt": "World map with arrows showing trade flows between countries",
        "caption": "Figure 1.4.2: International trade flows are explained by comparative advantage."
      },
      
      "key_concept": {
        "definition": "Comparative advantage is the ability to produce a good at a lower opportunity cost than another producer. Key elements: (1) Absolute advantage: Producer A has absolute advantage over Producer B if A can produce more of a good with the same resources, or the same amount with fewer resources. Absolute advantage compares productivity. (2) Comparative advantage: Producer A has comparative advantage in Good X if A's opportunity cost of producing X is lower than B's opportunity cost of producing X. Comparative advantage compares opportunity costs. (3) Calculating opportunity cost: Given production possibilities, opportunity cost of Good A = (loss in Good B)/(gain in Good A). For linear PPCs (constant opportunity cost), this is straightforward. (4) Specialization rule: Each producer should specialize in the good where they have the lower opportunity cost—their comparative advantage. (5) Gains from trade: After specialization, producers trade at an agreed rate (terms of trade). Both gain if the terms of trade lie between their opportunity costs. For example, if Country 1's opportunity cost of a car is 2 computers, and Country 2's opportunity cost of a car is 4 computers, any trade rate between 2 and 4 computers per car benefits both. (6) Consumption possibilities: With trade, each country can consume combinations of goods beyond their own PPC—a key measure of gains from trade. (7) Assumptions: The basic model assumes two countries, two goods, constant opportunity costs, no transportation costs, and no trade barriers. These can be relaxed for more complex analysis.",
        
        "context": "The concept of comparative advantage was developed by David Ricardo in his 1817 book 'On the Principles of Political Economy and Taxation.' Ricardo used the example of England and Portugal trading cloth and wine to show that both countries benefit even if Portugal is more efficient in producing both. This insight challenged mercantilist views that trade was zero-sum. Today, comparative advantage remains the cornerstone of international trade theory. In AP Microeconomics, understanding comparative advantage explains not just international trade, but also why individuals specialize in certain jobs, why firms focus on specific products, and why trade creates value at all levels.",
        
        "image": {
          "src": "images/unit1/ricardo.png",
          "alt": "Portrait of David Ricardo and diagram of his cloth-wine trade example",
          "caption": "Figure 1.4.3: David Ricardo developed the theory of comparative advantage in 1817."
        }
      },

      "classifications": [
        {
          "type": "Absolute Advantage",
          "value": "Ability to produce more output with same resources, or same output with fewer resources",
          "characteristics": ["Higher productivity", "More output per unit of input", "Lower input per unit of output", "Comparative in productivity", "Does not determine trade pattern"],
          "behavior": "Absolute advantage is about who is better at producing. If Country A can produce 10 cars per worker and Country B can produce 5 cars per worker, A has absolute advantage in cars. If A can also produce 20 computers per worker while B produces 10, A has absolute advantage in both. Absolute advantage is common—some countries are simply more productive across many sectors due to better technology, education, infrastructure, or institutions. However, absolute advantage alone doesn't predict trade patterns. Even a country with absolute advantage in everything benefits from trade by specializing in what it does relatively best (comparative advantage) and trading for other goods.",
          
          "image": {
            "src": "images/unit1/absolute_advantage.png",
            "alt": "Two factories side by side: one producing more output with same workers",
            "caption": "Figure 1.4.4: Absolute advantage means producing more with the same resources."
          },
          
          "examples": [
            {
              "process": "US vs. Mexico agricultural productivity",
              "explanation": "Due to advanced technology, the US can produce more corn per acre than Mexico. The US has absolute advantage in corn production. However, Mexico might still produce corn if the US focuses on other crops where its advantage is even greater."
            },
            {
              "process": "Software development",
              "explanation": "A skilled programmer can write code faster than most people. They have absolute advantage in programming. But they might still hire a junior developer for routine tasks if their time is better spent on complex problems where their comparative advantage is largest."
            }
          ]
        },
        {
          "type": "Comparative Advantage",
          "value": "Ability to produce a good at lower opportunity cost",
          "characteristics": ["Lower opportunity cost", "Based on relative efficiency", "Determines trade patterns", "Everyone has one", "Mutual gains possible"],
          "behavior": "Comparative advantage is about who gives up less to produce something. It's determined by comparing opportunity costs. Every producer has a comparative advantage in something because opportunity costs are relative. Even the least productive worker has a comparative advantage in the activity where they are least inefficient compared to others. Comparative advantage determines the pattern of specialization and trade. Producers should specialize in goods where their opportunity cost is lowest. This maximizes total output. Then, through trade, all parties can consume more than they could produce alone. The concept applies to individuals (a doctor hires a receptionist even though the doctor could do the reception work faster), firms (a company outsources certain tasks), and nations (countries specialize in industries where they have lowest opportunity cost).",
          
          "image": {
            "src": "images/unit1/comparative_advantage.png",
            "alt": "Two people with different opportunity costs shown as trade-off diagrams",
            "caption": "Figure 1.4.5: Comparative advantage means lower opportunity cost—giving up less to produce something."
          },
          
          "examples": [
            {
              "process": "Doctor and receptionist",
              "explanation": "A doctor can see patients (earning \\$200/hour) and also do reception work (worth \\$20/hour). The receptionist can only do reception (worth \\$20/hour). The doctor has absolute advantage in both. But the doctor's opportunity cost of doing reception is \\$200 in foregone patient revenue. The receptionist's opportunity cost is \\$20 in foregone reception work (or leisure). The receptionist has comparative advantage in reception (lower opportunity cost). Both gain if the doctor focuses on patients and hires the receptionist."
            },
            {
              "process": "US and China manufacturing",
              "explanation": "The US may have absolute advantage in both high-tech machinery and clothing production due to better technology. But its comparative advantage is in machinery (where its productivity edge is largest), while China's comparative advantage is in clothing (where its disadvantage is smallest). Both gain from trade."
            }
          ]
        },
        {
          "type": "Terms of Trade",
          "value": "The rate at which goods are exchanged in trade",
          "characteristics": ["Exchange rate between goods", "Must lie between opportunity costs", "Determines distribution of gains", "Negotiated or market-determined", "Affects who benefits more"],
          "behavior": "Terms of trade is the price of one good in terms of the other in trade. For example, if countries trade cars for computers, the terms of trade might be 1 car = 3 computers. For trade to benefit both parties, the terms of trade must lie strictly between their opportunity costs. If Country A's opportunity cost of a car is 2 computers (so giving up 2 computers to make a car), and Country B's opportunity cost of a car is 5 computers, then any trade rate between 2 and 5 computers per car benefits both. At 1 car = 3 computers, A gets more than its opportunity cost (3 > 2) and B pays less than its opportunity cost (3 < 5). The closer the terms are to one country's opportunity cost, the more of the gains go to the other country. If terms equal a country's opportunity cost, that country neither gains nor loses from trade. Determining terms of trade depends on bargaining power, market conditions, and competition.",
          
          "image": {
            "src": "images/unit1/terms_of_trade.png",
            "alt": "Number line showing opportunity costs of two countries and acceptable terms of trade range between them",
            "caption": "Figure 1.4.6: Terms of trade must lie between the two countries' opportunity costs for mutual benefit."
          },
          
          "examples": [
            {
              "process": "Negotiating trade",
              "explanation": "Country X can produce a ton of wheat at opportunity cost of 0.5 tons of steel. Country Y can produce a ton of wheat at opportunity cost of 2 tons of steel. Acceptable terms: between 0.5 and 2 tons of steel per ton of wheat. If they agree on 1 ton steel per ton wheat, both gain."
            },
            {
              "process": "Oil for food",
              "explanation": "Saudi Arabia has low opportunity cost of oil; Japan has low opportunity cost of electronics. They trade at terms that give each a better deal than producing domestically."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Comparative Advantage, Not Absolute Advantage, Determines Trade Patterns",
          "statement": "The key insight of trade theory is that what matters for trade is not absolute productivity but comparative opportunity costs. Even if one country is more productive in everything, both countries can gain from trade if they specialize according to comparative advantage. This is because focusing on what you do relatively best (where your disadvantage is smallest) and trading for other goods allows both to consume more than if they were self-sufficient. This principle explains why trade occurs between developed and developing countries, and even between highly productive individuals and less productive ones. It shows that trade is not zero-sum but positive-sum—both parties can be better off. The implication is that protectionism (trade barriers) harms both domestic consumers and foreign producers, and reduces overall efficiency and consumption possibilities.",
          "application": "When analyzing whether trade is beneficial, don't focus on who is 'better' at producing things. Instead, calculate opportunity costs. Determine each party's comparative advantage, then see if there's room for mutually beneficial trade. This applies to individuals deciding whether to hire help, firms considering outsourcing, and nations evaluating trade policy.",
          "example": "Consider a highly productive software developer who is also good at administrative tasks. The developer earns \\$100/hour coding; an administrative assistant costs \\$20/hour. Even though the developer is better at admin than the assistant (absolute advantage), their comparative advantage is coding. Hiring the assistant frees the developer to focus on coding, increasing total output and income for both.",
          
          "image": {
            "src": "images/unit1/comparative_not_absolute.png",
            "alt": "Comparison chart showing absolute vs comparative advantage with trade flows",
            "caption": "Figure 1.4.7: Comparative advantage, not absolute advantage, determines who produces what in trade."
          }
        },
        {
          "principle": "Opportunity Cost Determines Comparative Advantage",
          "statement": "To find comparative advantage, calculate opportunity costs. For each producer and each good, determine how much of the other good must be given up to produce one unit. The producer with the lower opportunity cost for a good has the comparative advantage in that good. This requires careful calculation, especially when dealing with different units or time frames. A common method: (1) Identify what each producer can produce with given resources. (2) Calculate opportunity cost of Good A = (maximum of Good B)/(maximum of Good A) if linear. (3) The producer with the smaller number has comparative advantage in Good A. (4) The other producer automatically has comparative advantage in the other good. Remember that opportunity cost is a ratio—it's about trade-offs, not absolute amounts. Getting these calculations right is essential for determining specialization and trade patterns.",
          "application": "When given production data, always calculate opportunity costs systematically. Set up a table showing production possibilities per unit of resource (e.g., per worker, per hour, per acre). Then compute opportunity costs and compare. Double-check that your opportunity costs are consistent—the two goods' opportunity costs for each producer should be reciprocals.",
          "example": "In one hour, Farmer A can produce 10 apples or 5 oranges. Opportunity cost of 1 apple = 0.5 oranges; of 1 orange = 2 apples. Farmer B can produce 8 apples or 4 oranges. Opportunity cost of 1 apple = 0.5 oranges; of 1 orange = 2 apples. Same opportunity costs—no comparative advantage, no gains from trade.",
          
          "image": {
            "src": "images/unit1/opportunity_cost_calc.png",
            "alt": "Table showing production possibilities and opportunity cost calculations",
            "caption": "Figure 1.4.8: Calculate opportunity costs to determine comparative advantage."
          }
        },
        {
          "principle": "Specialization Increases Total Output",
          "statement": "When each producer specializes according to comparative advantage, total output of both goods increases. This is the source of gains from trade. By reallocating resources to their most relatively efficient uses, the same total resources produce more overall. Then, through trade, the increased output can be divided so that both parties end up with more of both goods than they could produce on their own. Specialization doesn't require each producer to completely specialize—partial specialization may occur with increasing opportunity costs—but the principle holds: directing resources toward comparative advantage expands the total production pie. This is why economists generally support free trade: it allows global resources to be allocated more efficiently, increasing world output and consumption possibilities.",
          "application": "When evaluating trade policy, consider the efficiency gains from specialization. Trade restrictions prevent these gains, reducing total output and raising costs for consumers. The argument for free trade is that it allows countries to focus on their comparative advantages, increasing global prosperity.",
          "example": "Country A can produce 100 cars or 200 computers. Country B can produce 50 cars or 300 computers. Without trade, each produces both. With specialization according to comparative advantage, total output of both goods can increase. After trade, both can consume more cars and more computers than before.",
          
          "image": {
            "src": "images/unit1/specialization_gains.png",
            "alt": "Two PPCs showing before and after specialization with increased total output",
            "caption": "Figure 1.4.9: Specialization according to comparative advantage increases total output."
          }
        },
        {
          "principle": "Trade Allows Consumption Beyond the PPC",
          "statement": "One of the most powerful results of trade is that it enables countries to consume combinations of goods that lie outside their own production possibilities curve. Without trade, consumption is constrained by domestic production. With trade, a country can specialize in producing its comparative advantage good, then trade for the other good, achieving a consumption point beyond its PPC. This represents a clear gain from trade—the ability to have more of both goods than could be produced domestically. Graphically, the consumption possibilities curve after trade lies outside the PPC (except at the specialization point). The size of the gain depends on the terms of trade. Better terms (closer to the other country's opportunity cost) yield larger gains. This principle demonstrates why trade is valuable: it effectively expands a country's available resources by allowing access to more efficient foreign production.",
          "application": "When analyzing the benefits of trade, compare consumption possibilities with and without trade. Show on a PPC diagram that trade allows consumption beyond domestic production limits. This visual demonstrates why trade creates value and why restrictions reduce consumption possibilities.",
          "example": "A country's PPC shows maximum combinations of rice and tractors it can produce. By specializing in rice (its comparative advantage) and trading for tractors, it can consume more tractors than it could produce domestically while still having plenty of rice. The consumption point lies outside the PPC.",
          
          "image": {
            "src": "images/unit1/consumption_beyond_ppc.png",
            "alt": "PPC diagram showing consumption point outside the curve after trade",
            "caption": "Figure 1.4.10: Trade allows consumption beyond the PPC—a clear gain from trade."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Comparative Advantage",
          
          "image": {
            "src": "images/unit1/ca_calculation.png",
            "alt": "Table showing production per worker for two countries in two goods",
            "caption": "Figure 1.4.11: Calculate absolute and comparative advantage from production data."
          },
          
          "problem": "In one hour, workers in Country X and Country Y can produce the following amounts:<br>Country X: 10 cars or 5 computers<br>Country Y: 8 cars or 4 computers<br>a) Which country has absolute advantage in cars? In computers?<br>b) Calculate the opportunity cost of producing one car in each country.<br>c) Calculate the opportunity cost of producing one computer in each country.<br>d) Which country has comparative advantage in cars? In computers?<br>e) Should they trade? If so, what is the acceptable range for terms of trade?",
          
          "step_by_step": [
            {
              "step": "Absolute advantage analysis",
              "explanation": "Country X produces more cars per hour (10 > 8) and more computers per hour (5 > 4) than Country Y. Therefore, Country X has absolute advantage in both goods."
            },
            {
              "step": "Opportunity cost of cars",
              "explanation": "In Country X, producing 1 car requires resources that could produce 5/10 = 0.5 computers. Opportunity cost of 1 car = 0.5 computers.<br>In Country Y, producing 1 car requires resources that could produce 4/8 = 0.5 computers. Opportunity cost of 1 car = 0.5 computers."
            },
            {
              "step": "Opportunity cost of computers",
              "explanation": "In Country X, producing 1 computer requires resources that could produce 10/5 = 2 cars. Opportunity cost of 1 computer = 2 cars.<br>In Country Y, producing 1 computer requires resources that could produce 8/4 = 2 cars. Opportunity cost of 1 computer = 2 cars."
            },
            {
              "step": "Comparative advantage",
              "explanation": "Opportunity costs are identical: both countries have same opportunity cost for cars (0.5 computers) and computers (2 cars). Therefore, neither country has a comparative advantage. This is unusual but possible when productivity ratios are identical."
            },
            {
              "step": "Trade feasibility",
              "explanation": "With identical opportunity costs, there are no gains from specialization and trade. Any trade would leave at least one country no better off. They could trade at the opportunity cost rate (1 car = 0.5 computers), but neither gains."
            }
          ],
          
          "final_answer": "a) Country X in both. b) X: 0.5 computers, Y: 0.5 computers. c) X: 2 cars, Y: 2 cars. d) Neither—identical opportunity costs. e) No gains from trade possible.",
          "concept_applied": "Comparative advantage exists only when opportunity costs differ. Identical opportunity costs mean no gains from trade."
        },
        {
          "title": "Determining Terms of Trade",
          
          "image": {
            "src": "images/unit1/terms_calculation.png",
            "alt": "Table with production possibilities and opportunity costs",
            "caption": "Figure 1.4.12: Find acceptable terms of trade from opportunity costs."
          },
          
          "problem": "Two countries, Alpha and Beta, produce wheat and cloth. With one unit of resources:<br>Alpha can produce 20 wheat or 10 cloth.<br>Beta can produce 15 wheat or 5 cloth.<br>a) Calculate opportunity costs.<br>b) Which country has comparative advantage in wheat? In cloth?<br>c) What is the acceptable range for terms of trade (wheat per cloth)?<br>d) If they agree to trade at 1 cloth = 2.5 wheat, who gains more?",
          
          "step_by_step": [
            {
              "step": "Opportunity cost of wheat",
              "explanation": "Alpha: 1 wheat costs 10/20 = 0.5 cloth.<br>Beta: 1 wheat costs 5/15 = 1/3 ≈ 0.333 cloth."
            },
            {
              "step": "Opportunity cost of cloth",
              "explanation": "Alpha: 1 cloth costs 20/10 = 2 wheat.<br>Beta: 1 cloth costs 15/5 = 3 wheat."
            },
            {
              "step": "Comparative advantage",
              "explanation": "Beta has lower opportunity cost in wheat (0.333 < 0.5). Alpha has lower opportunity cost in cloth (2 < 3). So Beta should specialize in wheat, Alpha in cloth."
            },
            {
              "step": "Acceptable terms of trade",
              "explanation": "Trade is in cloth (Alpha's specialty) for wheat (Beta's specialty). Alpha's opportunity cost of cloth is 2 wheat, so Alpha will only trade cloth if it gets more than 2 wheat per cloth. Beta's opportunity cost of wheat is 1/3 cloth, so Beta will only trade wheat if it gets more than 1/3 cloth per wheat—equivalently, if it pays less than 3 wheat per cloth. So acceptable range: between 2 and 3 wheat per cloth. Any rate in (2,3) benefits both."
            },
            {
              "step": "Evaluate 1 cloth = 2.5 wheat",
              "explanation": "2.5 is within (2,3), so both gain. Alpha gets 2.5 wheat for cloth that costs it 2 wheat domestically—gain of 0.5 wheat per cloth. Beta pays 2.5 wheat for cloth that would cost it 3 wheat domestically—gain of 0.5 wheat per cloth. Gains are equal."
            }
          ],
          
          "final_answer": "a) Alpha: wheat 0.5 cloth, cloth 2 wheat; Beta: wheat 0.333 cloth, cloth 3 wheat. b) Beta in wheat, Alpha in cloth. c) 2 to 3 wheat per cloth. d) Both gain equally (0.5 wheat per cloth).",
          "concept_applied": "Terms of trade must lie between opportunity costs. Gains are shared based on where terms fall relative to each country's opportunity cost."
        },
        {
          "title": "PPC and Gains from Trade",
          
          "image": {
            "src": "images/unit1/trade_ppc.png",
            "alt": "PPC diagrams for two countries before and after trade",
            "caption": "Figure 1.4.13: Show consumption possibilities with and without trade."
          },
          
          "problem": "Country A can produce 100 cars or 200 computers. Country B can produce 50 cars or 150 computers. Both have constant opportunity costs. Initially, without trade, A produces and consumes 50 cars and 100 computers; B produces and consumes 25 cars and 75 computers.<br>a) Calculate opportunity costs and determine comparative advantage.<br>b) Show that total output can increase with specialization.<br>c) If they trade at 1 car = 2.5 computers, show a consumption point for each that is better than autarky.<br>d) Illustrate on a PPC diagram.",
          
          "step_by_step": [
            {
              "step": "Opportunity costs",
              "explanation": "A: 1 car costs 200/100 = 2 computers; 1 computer costs 100/200 = 0.5 cars.<br>B: 1 car costs 150/50 = 3 computers; 1 computer costs 50/150 = 1/3 ≈ 0.333 cars.<br>A has lower opportunity cost in cars (2 < 3). B has lower opportunity cost in computers (0.333 < 0.5). So A specializes in cars, B in computers."
            },
            {
              "step": "Specialization output",
              "explanation": "If A specializes fully in cars: 100 cars, 0 computers.<br>If B specializes fully in computers: 0 cars, 150 computers.<br>Total: 100 cars, 150 computers. Before: total cars = 50+25=75, total computers = 100+75=175. Actually computer output fell? Wait—check: Before total computers = 100+75=175. After specialization, computers = 150, which is less. This suggests full specialization isn't optimal here—they should specialize partially or trade differently. Let's recalculate carefully."
            },
            {
              "step": "Correct specialization analysis",
              "explanation": "Total output with full specialization: A does cars (100), B does computers (150). Total = 100 cars, 150 computers.<br>Original total = 75 cars, 175 computers.<br>So cars increase by 25, computers decrease by 25. This trade-off might be worthwhile if they value cars more. But the point is they can now trade to get both goods."
            },
            {
              "step": "Trading at 1 car = 2.5 computers",
              "explanation": "A exports cars to B. Suppose A exports 30 cars to B. A keeps 70 cars, gets 30×2.5 = 75 computers from B. A's consumption: 70 cars, 75 computers. Before trade, A had 50 cars, 100 computers. Now has more cars (70 > 50) but fewer computers (75 < 100). Not clearly better—need to adjust."
            },
            {
              "step": "Finding a mutually beneficial trade",
              "explanation": "Let A export 20 cars to B. A keeps 80 cars, gets 20×2.5 = 50 computers. A's consumption: 80 cars, 50 computers. Before: 50 cars, 100 computers. Trade-off: +30 cars, -50 computers. Not obviously better. Try different terms or amounts."
            },
            {
              "step": "Alternative approach",
              "explanation": "Better to have B export computers. Let B export 60 computers to A at 2.5 computers per car = 24 cars. A gives 24 cars, gets 60 computers. A consumption: 100-24=76 cars, 0+60=60 computers. Before: 50 cars, 100 computers. Now: 76 cars, 60 computers. Better? Depends on preferences. The key is they can consume beyond PPC if terms favorable."
            }
          ],
          
          "final_answer": "a) A: cars 2 computers, computers 0.5 cars; B: cars 3 computers, computers 0.333 cars. A comparative advantage cars, B computers. b) Total output can be reallocated. c-d) Trade allows consumption points beyond PPC if terms between opportunity costs.",
          "concept_applied": "Specialization and trade allow consumption beyond the PPC, but the exact gains depend on terms of trade and preferences. The key insight is that trade expands consumption possibilities."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Production Capabilities",
          "description": "Determine how much each producer can produce of each good with given resources.",
          "mechanism": "Gather data: output per worker, per hour, per acre, or maximum production if all resources devoted to one good.",
          "result": "Production possibilities for each producer.",
          
          "image": {
            "src": "images/unit1/trade_step1.png",
            "alt": "Two flags with production numbers: Country A: 10 cars or 5 computers; Country B: 8 cars or 4 computers",
            "caption": "Figure 1.4.14: Step 1 - Identify production capabilities for each country."
          }
        },
        {
          "step": 2,
          "process": "Calculate Opportunity Costs",
          "description": "For each producer, calculate opportunity cost of each good.",
          "mechanism": "Opportunity cost of Good X = (max of Good Y)/(max of Good X). Express in units of the other good.",
          "result": "Opportunity cost table for both goods, both producers.",
          
          "image": {
            "src": "images/unit1/trade_step2.png",
            "alt": "Table showing opportunity cost calculations",
            "caption": "Figure 1.4.15: Step 2 - Calculate opportunity costs for each good in each country."
          }
        },
        {
          "step": 3,
          "process": "Determine Comparative Advantage",
          "description": "Compare opportunity costs across producers to find who has lower cost for each good.",
          "mechanism": "For Good X, the producer with smaller opportunity cost has comparative advantage. The other producer automatically has comparative advantage in the other good.",
          "result": "Comparative advantage assignment.",
          
          "image": {
            "src": "images/unit1/trade_step3.png",
            "alt": "Arrows pointing to country with lower opportunity cost for each good",
            "caption": "Figure 1.4.16: Step 3 - Determine comparative advantage by comparing opportunity costs."
          }
        },
        {
          "step": 4,
          "process": "Establish Terms of Trade",
          "description": "Determine acceptable range for exchange rate between goods.",
          "mechanism": "Terms of trade must lie between the two countries' opportunity costs. Choose a rate within that range.",
          "result": "Agreed terms of trade.",
          
          "image": {
            "src": "images/unit1/trade_step4.png",
            "alt": "Number line showing opportunity costs and acceptable range between them",
            "caption": "Figure 1.4.17: Step 4 - Establish terms of trade between opportunity costs."
          }
        },
        {
          "step": 5,
          "process": "Demonstrate Gains from Trade",
          "description": "Show that both parties can consume more after specialization and trade.",
          "mechanism": "Calculate production after specialization. Show trade quantities. Compare consumption before and after. Illustrate on PPC if possible.",
          "result": "Demonstration of mutual gains.",
          
          "image": {
            "src": "images/unit1/trade_step5.png",
            "alt": "PPC diagram with consumption point outside curve after trade",
            "caption": "Figure 1.4.18: Step 5 - Demonstrate gains from trade (consumption beyond PPC)."
          }
        }
      ],

      "image": {
        "src": "images/unit1/comparative_advantage_summary.png",
        "alt": "Comprehensive summary diagram: absolute vs comparative advantage, opportunity cost calculation, terms of trade, gains from trade",
        "caption": "Figure 1.4.19: Comparative advantage summary - from opportunity cost to gains from trade."
      }
    }
  ],

  "key_terms": [
    "Comparative advantage",
    "Absolute advantage",
    "Opportunity cost",
    "Specialization",
    "Trade",
    "Gains from trade",
    "Terms of trade",
    "Mutually beneficial trade",
    "Production possibilities",
    "Consumption possibilities",
    "Autarky",
    "Self-sufficiency",
    "Free trade",
    "Protectionism",
    "Trade barrier",
    "Tariff",
    "Quota",
    "David Ricardo",
    "Comparative advantage theory",
    "Law of comparative advantage",
    "Relative efficiency",
    "Productivity",
    "Specialization according to advantage",
    "Division of labor",
    "Exchange",
    "Barter",
    "Trade ratio",
    "Trade partner",
    "Trading partner",
    "Export",
    "Import",
    "World price",
    "Domestic price",
    "Trade creation",
    "Resource allocation",
    "Efficiency gain",
    "Consumption beyond PPC",
    "Production possibilities curve",
    "Constant opportunity cost",
    "Linear PPC"
  ],

  "summary": "Comparative advantage is the ability to produce a good at a lower opportunity cost than another producer. It is the fundamental concept explaining why trade creates value and determines trade patterns. Absolute advantage (being more productive) is different and does not determine trade patterns—even countries with absolute advantage in everything gain from trade by specializing according to comparative advantage. To find comparative advantage, calculate opportunity costs: the amount of one good given up to produce another. The producer with the lower opportunity cost for a good has comparative advantage in that good. Specialization according to comparative advantage increases total output. Through trade at terms between their opportunity costs, both parties can consume beyond their own production possibilities curves—a clear gain from trade. The terms of trade determine how gains are distributed: the closer terms are to a country's opportunity cost, the smaller its share of gains. This powerful concept applies to individuals, firms, and nations, explaining why trade benefits all participants and why economists generally support free trade policies."
}
