{
  "expanded_description": "Every society must answer three fundamental questions: What goods and services should be produced? How should they be produced? And who gets to consume them? Different societies answer these questions in different ways. Some rely on millions of individual decisions coordinated by markets. Others depend on central planners making decisions for everyone. Most combine elements of both. These different approaches are called economic systems. In this section, we'll explore the three main types of economic systems—market economies, command economies, and mixed economies—and examine how each answers the basic economic questions. Understanding these systems helps us compare different countries' approaches to organizing economic activity and evaluate the strengths and weaknesses of each.",
  
  "core_concept": {
    "principle": "An economic system is the method a society uses to answer the three fundamental economic questions: What to produce? How to produce? For whom to produce? The three main types are: (1) Market economy: Decisions are made by individuals and firms through markets, guided by self-interest and prices. Private property rights are protected. Production is determined by consumer demand and profit motives. The role of government is limited to enforcing contracts and property rights. (2) Command economy: Decisions are made by a central authority (usually the government). The government owns resources and determines what to produce, how to produce, and who gets the output. Individual choices are limited. (3) Mixed economy: Combines elements of market and command systems. Most decisions are made by markets, but government intervenes to correct market failures, provide public goods, and address inequality. Most modern economies are mixed. Each system has strengths and weaknesses. Market economies are efficient and innovative but can produce inequality and fail to provide public goods. Command economies can ensure equality and direct resources to social goals but are inefficient and lack innovation. Mixed economies attempt to balance these trade-offs.",
    
    "explanation": "Think of economic systems like different ways of organizing a potluck dinner. In a market economy, everyone brings whatever dish they think others will want, and people eat whatever they choose. In a command economy, a central planner decides what everyone should bring and who gets which dishes. In a mixed economy, most people bring what they want, but the organizer might assign a few key dishes (like drinks or plates) to ensure everything runs smoothly. Each approach has pros and cons, and different societies choose different balances.",
    
    "image": {
      "src": "images/unit1/economic_systems_overview.png",
      "alt": "Three panels showing market economy (individuals trading), command economy (central planner directing), mixed economy (combination)",
      "caption": "Figure 1.5.1: Economic systems determine how societies answer what, how, and for whom to produce."
    }
  },

  "sections": [
    {
      "section_title": "1.5 Economic Systems",
      "introduction": "How does a society decide how many cars to produce, what technology to use, and who gets to drive those cars? In some countries, these decisions are made by millions of individual consumers and businesses through markets. In others, government planners make the decisions. Most countries fall somewhere in between. The way a society organizes its economy—its economic system—shapes everything from what's available in stores to who gets opportunities and how much inequality exists. In this section, we'll explore the three main types of economic systems, their defining characteristics, how they answer the basic economic questions, and their respective strengths and weaknesses.",
      
      "introduction_image": {
        "src": "images/unit1/systems_intro.png",
        "alt": "Comparison of a busy market (market economy), a government planning office (command economy), and a modern city with both private businesses and public services (mixed economy)",
        "caption": "Figure 1.5.2: Different economic systems organize production and distribution in different ways."
      },
      
      "key_concept": {
        "definition": "An economic system is the institutional framework through which a society answers the three fundamental questions: (1) What to produce? Which goods and services should be produced and in what quantities? (2) How to produce? What methods, technologies, and resources should be used in production? (3) For whom to produce? How should the output be distributed among members of society? The three main types: (a) Market economy: Relies on decentralized decisions by households and firms interacting in markets. Prices coordinate economic activity. Private property rights are essential. Government's role is limited to protecting property rights and enforcing contracts. (b) Command economy: Relies on centralized decisions by government planners. The state owns resources and directs production. Planners decide what to produce, set production targets, allocate resources, and determine distribution. Individual choice is limited. (c) Mixed economy: Combines market mechanisms with government intervention. Most resources are allocated through markets, but government regulates, provides public goods, corrects market failures, and redistributes income. Most modern economies (US, Japan, Germany, etc.) are mixed. (4) Additional concepts: Traditional economies (based on custom and tradition, common in pre-industrial societies) and the spectrum of economic systems from pure market to pure command. (5) Key distinctions: Ownership of resources (private vs. state), decision-making (decentralized vs. centralized), coordination mechanism (prices vs. directives), and role of government.",
        
        "context": "Economic systems have evolved throughout history. Early societies relied on tradition. The rise of markets in medieval Europe and the Industrial Revolution led to market capitalism. The 20th century saw experiments with command economies in the Soviet Union, China, and Eastern Europe. The collapse of the Soviet Union and China's shift toward markets demonstrated the limitations of central planning. Today, the debate is not about market vs. command, but about the appropriate mix of markets and government intervention. In AP Microeconomics, understanding economic systems provides context for analyzing how different institutional arrangements affect efficiency, equity, and growth.",
        
        "image": {
          "src": "images/unit1/systems_spectrum.png",
          "alt": "Spectrum from pure market to pure command with mixed economies in between, showing where different countries fall",
          "caption": "Figure 1.5.3: Economic systems exist on a spectrum from pure market to pure command, with most countries in the mixed middle."
        }
      },

      "classifications": [
        {
          "type": "Market Economy (Capitalism)",
          "value": "Decentralized decisions through markets, private ownership",
          "characteristics": ["Private property", "Markets coordinate activity", "Prices guide decisions", "Self-interest motivates", "Limited government", "Consumer sovereignty", "Competition", "Profit motive"],
          "behavior": "In a market economy, decisions are made by millions of households and firms acting independently. Consumers express preferences through purchasing decisions (consumer sovereignty). Firms respond to profit opportunities by producing what consumers want. Prices serve as signals: high prices signal scarcity and encourage more production; low prices signal abundance and encourage less production. Competition among firms keeps prices down and quality up. Resources are allocated to their most valued uses through the price system. Government's role is limited to protecting property rights, enforcing contracts, and providing a legal framework. Market economies tend to be efficient, innovative, and responsive to consumer preferences. However, they can produce inequality, fail to provide public goods, generate externalities (pollution), and experience instability (booms and busts). Proponents argue that markets maximize freedom and efficiency; critics point to inequality and market failures.",
          
          "image": {
            "src": "images/unit1/market_economy.png",
            "alt": "Circular flow diagram showing households and firms interacting in product and factor markets",
            "caption": "Figure 1.5.4: Market economies rely on decentralized decisions by households and firms interacting in markets."
          },
          
          "examples": [
            {
              "process": "United States",
              "explanation": "The US is primarily a market economy, with most decisions made by private individuals and firms. However, government plays significant roles in regulation, public goods, and redistribution—making it actually a mixed economy, but closer to the market end of the spectrum."
            },
            {
              "process": "Hong Kong (historically)",
              "explanation": "Before its return to China, Hong Kong was often cited as one of the closest approximations to a pure market economy, with minimal government intervention, low taxes, and strong property rights."
            }
          ]
        },
        {
          "type": "Command Economy (Central Planning)",
          "value": "Centralized decisions by government, state ownership",
          "characteristics": ["State ownership of resources", "Central planning", "Government sets prices", "Production targets", "Limited consumer choice", "Equality emphasized", "Less innovation", "Bureaucratic coordination"],
          "behavior": "In a command economy, a central planning authority (like Gosplan in the Soviet Union) makes decisions about what to produce, how to produce, and who gets the output. The government owns most resources—factories, land, natural resources. Planners set production targets for enterprises, allocate raw materials, and determine prices (which often don't reflect scarcity). Distribution is based on government priorities rather than purchasing power. Command economies can mobilize resources quickly for large projects (like industrialization or war) and can ensure basic needs are met for all citizens, reducing extreme inequality. However, they suffer from severe inefficiencies: lack of price signals leads to misallocation; no profit motive reduces innovation; bureaucracy creates delays and waste; and absence of competition reduces quality and choice. The collapse of the Soviet Union and Eastern European command economies demonstrated their long-term unsustainability.",
          
          "image": {
            "src": "images/unit1/command_economy.png",
            "alt": "Central planner at desk with flowcharts directing factories and farms",
            "caption": "Figure 1.5.5: Command economies rely on central planners to make production and distribution decisions."
          },
          
          "examples": [
            {
              "process": "Soviet Union",
              "explanation": "The Soviet Union operated a command economy from 1917-1991. The state owned all enterprises, and Gosplan set production targets for thousands of products. Despite early industrialization, the system became increasingly inefficient and collapsed."
            },
            {
              "process": "North Korea",
              "explanation": "North Korea maintains one of the world's few remaining command economies, with state ownership and central planning, though informal markets have emerged. Chronic shortages and inefficiency are widespread."
            }
          ]
        },
        {
          "type": "Mixed Economy",
          "value": "Combination of markets and government intervention",
          "characteristics": ["Private property with regulation", "Markets with government oversight", "Public goods provided", "Redistribution through taxes/transfers", "Safety nets", "Correct market failures", "Balance efficiency and equity"],
          "behavior": "Mixed economies combine market mechanisms with significant government intervention. Most decisions are made through markets, but government plays an active role in: (1) Correcting market failures: addressing externalities (pollution taxes), providing public goods (defense, roads), and preventing monopolies. (2) Redistributing income: progressive taxation, welfare programs, social security. (3) Regulating economic activity: consumer protection, environmental regulations, labor laws. (4) Stabilizing the economy: monetary and fiscal policy to smooth business cycles. Mixed economies attempt to capture the efficiency and innovation of markets while addressing inequality and market failures. The mix varies across countries: some lean more toward markets (US), others toward government intervention (Sweden, France). Most economists agree that some government intervention is necessary, but disagree on the optimal extent. Mixed economies have generally outperformed both pure market and pure command systems in delivering prosperity with stability and social cohesion.",
          
          "image": {
            "src": "images/unit1/mixed_economy.png",
            "alt": "Balance scale with market on one side and government on the other, both contributing to economy",
            "caption": "Figure 1.5.6: Mixed economies balance markets and government intervention."
          },
          
          "examples": [
            {
              "process": "Germany",
              "explanation": "Germany's social market economy combines market capitalism with extensive social welfare programs, worker codetermination laws, and significant regulation. It maintains strong private enterprise while ensuring social protections."
            },
            {
              "process": "Sweden",
              "explanation": "Sweden combines market-oriented production with extensive government-provided social services (education, healthcare, childcare) funded by high taxes. It demonstrates that markets and generous welfare states can coexist."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Every Society Must Answer Three Fundamental Questions",
          "statement": "Regardless of their economic system, all societies face scarcity and must answer: (1) What to produce? Given limited resources, which goods and services should be produced and in what quantities? More military defense or more schools? More cars or more public transit? (2) How to produce? What combination of resources, technology, and methods should be used? Should electricity come from coal, nuclear, or solar? Should production be labor-intensive or capital-intensive? (3) For whom to produce? How should the output be distributed among members of society? Who gets more and who gets less? Should distribution be based on ability to pay, need, effort, or equality? Different economic systems answer these questions differently. In market economies, consumer demand (what) determines production; competition and profit motives (how) guide methods; and purchasing power (for whom) determines distribution. In command economies, planners make all three decisions. In mixed economies, markets make most decisions but government modifies outcomes, especially for 'for whom' through redistribution. Understanding these questions helps analyze any economic system.",
          "application": "When studying any economy, ask: Who decides what gets produced? Who decides production methods? Who gets the output? The answers reveal the economic system and its values.",
          "example": "In the US, what gets produced is largely determined by consumer demand (people want smartphones, so companies make them). How they're produced is determined by firms seeking profit (using automated factories in China). Who gets them is determined by who can afford them. In contrast, in Cuba, what gets produced was historically determined by central planners; how by state enterprises; and who gets output by government distribution systems.",
          
          "image": {
            "src": "images/unit1/three_questions.png",
            "alt": "Three boxes labeled 'What?', 'How?', 'For Whom?' with arrows from each to different economic systems",
            "caption": "Figure 1.5.7: All societies must answer what, how, and for whom to produce."
          }
        },
        {
          "principle": "Markets Excel at Efficiency and Innovation",
          "statement": "Market economies have proven remarkably effective at producing goods efficiently and fostering innovation. The price system coordinates millions of decisions without central direction—a phenomenon Adam Smith called the 'invisible hand.' When prices rise, producers increase supply and consumers reduce demand, automatically balancing markets. Competition forces firms to minimize costs and improve products. The profit motive drives entrepreneurs to innovate, creating new goods and better methods. Markets also allow decentralized knowledge: local information about preferences and conditions is used by those closest to it. These advantages explain why market-oriented economies have generated unprecedented prosperity. However, markets are not perfect. They fail to provide public goods (like national defense), can generate negative externalities (pollution), may produce inequality, and can experience instability. These limitations justify some government intervention.",
          "application": "When evaluating policies, consider how they affect market efficiency. Policies that distort prices (price controls) or reduce competition typically reduce efficiency and innovation. Policies that correct market failures (pollution taxes) can improve outcomes while preserving market mechanisms.",
          "example": "The rapid innovation in technology—smartphones, internet services, medical advances—has occurred primarily in market-oriented economies where profit incentives drive research and development. Command economies lagged dramatically in consumer technology.",
          
          "image": {
            "src": "images/unit1/market_efficiency.png",
            "alt": "Graph showing increasing prosperity in market economies over time",
            "caption": "Figure 1.5.8: Markets excel at efficiency and innovation, driving prosperity."
          }
        },
        {
          "principle": "Command Economies Face Severe Information and Incentive Problems",
          "statement": "Command economies suffer from two fundamental problems that make them inefficient: (1) Information problem: Central planners cannot possibly gather and process all the information needed to coordinate a modern economy. Millions of goods, countless production methods, and ever-changing consumer preferences overwhelm any planning system. Prices convey information efficiently in markets; without them, planners lack essential data about scarcity and value. (2) Incentive problem: Without profit motives, managers and workers lack incentives to innovate, control costs, or satisfy consumers. Production targets lead to perverse behavior—meeting quantity targets by producing low-quality goods, or hoarding inputs to ensure targets are met. The result is chronic shortages, surpluses, waste, and low-quality goods. These problems explain why command economies consistently underperform market economies and why most have abandoned central planning.",
          "application": "When analyzing proposed government interventions, consider whether they create information or incentive problems. Price controls, for example, distort price signals and create shortages or surpluses—a milder version of command economy problems. Large-scale central planning amplifies these issues.",
          "example": "Soviet factories were often rewarded for meeting output targets measured in tons. This led to producing extremely heavy goods (like massive chandeliers) regardless of quality or consumer preferences. Nails were produced so heavy they were useless—but they met tonnage targets.",
          
          "image": {
            "src": "images/unit1/command_problems.png",
            "alt": "Two panels: 'Information Problem' showing overwhelmed planner with too much data; 'Incentive Problem' showing worker with no motivation",
            "caption": "Figure 1.5.9: Command economies suffer from information and incentive problems."
          }
        },
        {
          "principle": "Mixed Economies Attempt to Balance Efficiency and Equity",
          "statement": "Most modern economies are mixed, combining market mechanisms with government intervention. The rationale is that markets are excellent at producing efficiently but may generate outcomes considered unfair or socially undesirable. Government can intervene to: (1) Redistribute income through taxes and transfers to reduce poverty and inequality. (2) Provide public goods that markets underproduce (defense, basic research, infrastructure). (3) Correct externalities by taxing harmful activities (pollution) and subsidizing beneficial ones (education). (4) Regulate to protect consumers, workers, and the environment. (5) Stabilize the economy through monetary and fiscal policy. The challenge is finding the right balance—too little government allows market failures and inequality; too much government stifles innovation and creates inefficiency. Different countries strike different balances based on their values and circumstances. The Nordic model (Sweden, Denmark) features extensive welfare states; the US model has less redistribution but more dynamic markets; continental European countries fall in between.",
          "application": "When evaluating economic policy, consider both efficiency and equity. Policies that improve efficiency but worsen inequality may need complementary policies to address distribution. The goal is not to choose between markets and government, but to design institutions that harness markets while correcting their limitations.",
          "example": "Carbon taxes combine market mechanisms with government intervention: they use prices to correct the externality of pollution, allowing markets to find the cheapest ways to reduce emissions. Revenue can be used to reduce other taxes or fund clean energy, addressing both efficiency and equity.",
          
          "image": {
            "src": "images/unit1/mixed_balance.png",
            "alt": "Balance scale with 'Efficiency' on one side and 'Equity' on the other, government trying to balance them",
            "caption": "Figure 1.5.10: Mixed economies attempt to balance efficiency from markets with equity from government intervention."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Classifying Economic Systems",
          
          "image": {
            "src": "images/unit1/system_classification.png",
            "alt": "Table with country descriptions to classify",
            "caption": "Figure 1.5.11: Classify each description by economic system."
          },
          
          "problem": "Classify each as market, command, or mixed economy:<br>a) Most factories are state-owned. A central planning committee sets production targets and determines wages. Consumer goods are often in short supply.<br>b) Private individuals own most businesses. Prices are determined by supply and demand. Government provides national defense and enforces contracts but does little else.<br>c) Most businesses are privately owned, but government provides universal healthcare, generous unemployment benefits, and regulates working conditions. Taxes are high.<br>d) A small island nation where fishing and farming follow traditions passed down for generations. Economic roles are determined by family customs.<br>e) The government owns the oil industry and uses revenues to fund education and healthcare. Other industries are private and competitive.",
          
          "step_by_step": [
            {
              "step": "Description a",
              "explanation": "State ownership, central planning, production targets—these are classic features of a command economy. Shortages are typical. Answer: Command."
            },
            {
              "step": "Description b",
              "explanation": "Private ownership, market-determined prices, minimal government—this describes a market economy (though pure markets rarely exist). Answer: Market."
            },
            {
              "step": "Description c",
              "explanation": "Private businesses (market) combined with extensive government services and regulation—this is a mixed economy, leaning toward the social welfare model. Answer: Mixed."
            },
            {
              "step": "Description d",
              "explanation": "Traditions, customs, inherited roles—this describes a traditional economy, which is a fourth type beyond the three main categories. Answer: Traditional."
            },
            {
              "step": "Description e",
              "explanation": "Government ownership in one sector (oil) with private enterprise elsewhere—this is mixed, with selective state ownership common in many countries. Answer: Mixed."
            }
          ],
          
          "final_answer": "a) Command, b) Market, c) Mixed, d) Traditional, e) Mixed",
          "concept_applied": "Economic systems are classified by who owns resources, how decisions are made, and the role of government."
        },
        {
          "title": "Analyzing Policy in Different Systems",
          
          "image": {
            "src": "images/unit1/policy_analysis.png",
            "alt": "Policy proposal description",
            "caption": "Figure 1.5.12: Analyze how different systems would handle a policy issue."
          },
          
          "problem": "A country faces rising healthcare costs and wants to ensure all citizens have access to medical care. How would this goal be addressed differently in:<br>a) A pure market economy<br>b) A pure command economy<br>c) A mixed economy like Germany or Canada<br>Evaluate the likely strengths and weaknesses of each approach.",
          
          "step_by_step": [
            {
              "step": "Market economy approach",
              "explanation": "Healthcare would be provided by private firms and doctors. Patients pay directly or through private insurance. Government role limited to enforcing contracts and perhaps regulating fraud. Strengths: competition could drive innovation and efficiency; consumer choice. Weaknesses: those who cannot afford care may go without; inequality in access; profit motive may lead to over-treatment or under-provision of preventive care."
            },
            {
              "step": "Command economy approach",
              "explanation": "Government would own hospitals, employ doctors, and provide care free at point of service. Planners would decide how many hospitals, where to locate them, and what services to offer. Strengths: universal access guaranteed; no one denied care due to inability to pay. Weaknesses: long waits, limited choice, no competition to drive innovation, potential shortages, bureaucratic inefficiency."
            },
            {
              "step": "Mixed economy approach",
              "explanation": "Combination: private providers but government funding (single-payer like Canada) or regulated private insurance with subsidies (like Germany or Netherlands). Government ensures universal coverage but allows private delivery. Strengths: universal access with more choice and competition than command; efficiency incentives better than command; equity better than pure market. Weaknesses: still may have waits; cost control challenging; political debates over design."
            },
            {
              "step": "Evaluation",
              "explanation": "Most developed countries have chosen mixed approaches, suggesting they balance trade-offs better than pure systems. The optimal mix depends on values: those prioritizing choice and efficiency lean toward market; those prioritizing equity lean toward government. Evidence shows mixed systems can achieve universal coverage with reasonable costs and outcomes."
            }
          ],
          
          "final_answer": "Market: private provision, consumer choice, but inequality and access gaps. Command: universal access, but inefficiency and limited choice. Mixed: universal access with market mechanisms, balancing trade-offs. Mixed systems generally preferred in practice.",
          "concept_applied": "Different economic systems handle the same problem differently, with trade-offs between efficiency, equity, and choice."
        },
        {
          "title": "Transition from Command to Market",
          
          "image": {
            "src": "images/unit1/transition.png",
            "alt": "Graph showing economic performance during transition",
            "caption": "Figure 1.5.13: Analyze challenges of transitioning from command to market economy."
          },
          
          "problem": "After the collapse of the Soviet Union, countries like Russia and Poland transitioned from command to market economies. Describe the challenges they faced and how economic systems concepts explain those challenges.",
          
          "step_by_step": [
            {
              "step": "Challenge 1: Price liberalization",
              "explanation": "Under command, prices were set artificially low, causing shortages. Moving to market prices caused sudden inflation, hurting living standards. But without price signals, markets cannot function."
            },
            {
              "step": "Challenge 2: Privatization",
              "explanation": "State-owned enterprises had to be sold to private owners. This was often chaotic, leading to insider deals, corruption, and the rise of oligarchs. Creating effective private ownership was difficult."
            },
            {
              "step": "Challenge 3: Institutional vacuum",
              "explanation": "Market economies require institutions: property rights, contract enforcement, banking system, regulatory agencies. These had to be built from scratch, creating chaos and uncertainty."
            },
            {
              "step": "Challenge 4: Restructuring",
              "explanation": "State enterprises were inefficient and produced goods nobody wanted. Closing them caused massive unemployment. New businesses took time to emerge, causing severe recessions."
            },
            {
              "step": "Challenge 5: Cultural adjustment",
              "explanation": "Decades of command economy created habits and expectations (expecting guaranteed jobs, distrust of entrepreneurs) that hindered market development."
            }
          ],
          
          "final_answer": "Transition challenges: price liberalization (inflation), privatization (corruption), institutional vacuum (chaos), restructuring (unemployment), cultural adjustment. These illustrate why moving between systems is difficult and why the mix of institutions matters.",
          "concept_applied": "Economic systems are embedded in institutions and culture. Transitioning between systems involves enormous challenges beyond simply changing policies."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify Ownership Structure",
          "description": "Determine who owns the means of production (factories, land, natural resources).",
          "mechanism": "Ask: Are resources privately owned, state-owned, or a mix? Private ownership indicates market orientation; state ownership indicates command orientation.",
          "result": "Clarity on resource ownership.",
          
          "image": {
            "src": "images/unit1/systems_step1.png",
            "alt": "Two buildings: one with 'Private Property' sign, one with 'State Property' sign",
            "caption": "Figure 1.5.14: Step 1 - Identify who owns resources (private, state, or mixed)."
          }
        },
        {
          "step": 2,
          "process": "Examine Decision-Making Process",
          "description": "Analyze how decisions about what, how, and for whom are made.",
          "mechanism": "Are decisions made by individuals and firms in markets, by central planners, or a combination? Who has authority over production and distribution?",
          "result": "Understanding of coordination mechanism.",
          
          "image": {
            "src": "images/unit1/systems_step2.png",
            "alt": "Flowchart: 'Market' with many individual decision-makers vs 'Command' with one central planner",
            "caption": "Figure 1.5.15: Step 2 - Examine who makes economic decisions."
          }
        },
        {
          "step": 3,
          "process": "Analyze Coordination Mechanism",
          "description": "Determine how economic activity is coordinated.",
          "mechanism": "Is coordination through prices and markets, through government directives, or both? Prices indicate market coordination; quotas and targets indicate command.",
          "result": "Clarity on primary coordination method.",
          
          "image": {
            "src": "images/unit1/systems_step3.png",
            "alt": "Price tags vs government directives document",
            "caption": "Figure 1.5.16: Step 3 - Analyze whether prices or directives coordinate activity."
          }
        },
        {
          "step": 4,
          "process": "Evaluate Role of Government",
          "description": "Assess the extent and nature of government involvement.",
          "mechanism": "What does government do? Provide public goods? Redistribute income? Regulate? Set prices? Own enterprises? More government roles indicate more command elements.",
          "result": "Assessment of government's economic role.",
          
          "image": {
            "src": "images/unit1/systems_step4.png",
            "alt": "Government building with icons of its functions: regulation, welfare, public goods, state enterprises",
            "caption": "Figure 1.5.17: Step 4 - Evaluate the extent of government intervention."
          }
        },
        {
          "step": 5,
          "process": "Classify the System",
          "description": "Based on ownership, decision-making, coordination, and government role, classify the economic system.",
          "mechanism": "Place on spectrum from pure market to pure command. Most economies will be mixed—determine whether they lean more toward market or command.",
          "result": "Classification of economic system.",
          
          "image": {
            "src": "images/unit1/systems_step5.png",
            "alt": "Spectrum from Market to Command with marker placed based on analysis",
            "caption": "Figure 1.5.18: Step 5 - Classify the system on the market-command spectrum."
          }
        }
      ],

      "image": {
        "src": "images/unit1/economic_systems_summary.png",
        "alt": "Comprehensive summary: three systems with their characteristics, how they answer three questions, strengths and weaknesses",
        "caption": "Figure 1.5.19: Economic systems summary - market, command, mixed and how they compare."
      }
    }
  ],

  "key_terms": [
    "Economic system",
    "Market economy",
    "Market capitalism",
    "Command economy",
    "Central planning",
    "Mixed economy",
    "Traditional economy",
    "What to produce",
    "How to produce",
    "For whom to produce",
    "Three fundamental questions",
    "Private property",
    "Property rights",
    "State ownership",
    "Public ownership",
    "Resource allocation",
    "Coordination mechanism",
    "Price system",
    "Market prices",
    "Central planner",
    "Gosplan",
    "Production targets",
    "Consumer sovereignty",
    "Profit motive",
    "Self-interest",
    "Invisible hand",
    "Adam Smith",
    "Karl Marx",
    "Friedrich Hayek",
    "Milton Friedman",
    "Capitalism",
    "Socialism",
    "Communism",
    "Social democracy",
    "Nordic model",
    "Welfare state",
    "Regulation",
    "Deregulation",
    "Privatization",
    "Nationalization",
    "Market failure",
    "Government failure",
    "Public goods",
    "Externalities",
    "Redistribution",
    "Progressive taxation",
    "Safety net",
    "Economic freedom",
    "Economic efficiency",
    "Equity",
    "Equality",
    "Information problem",
    "Incentive problem",
    "Transition economy",
    "Shock therapy",
    "Gradualism"
  ],

  "summary": "Economic systems are the ways societies organize to answer the three fundamental questions: What to produce? How to produce? For whom to produce? Market economies rely on decentralized decisions by individuals and firms, coordinated through prices and guided by self-interest. They excel at efficiency and innovation but can produce inequality and fail to provide public goods. Command economies rely on central planning, with government ownership and decisions. They can ensure equality and mobilize resources for social goals but suffer from severe information and incentive problems, leading to inefficiency and low quality. Mixed economies combine markets with government intervention to correct market failures, provide public goods, and redistribute income. Most modern economies are mixed, with different countries balancing markets and government differently based on their values and circumstances. The spectrum from pure market to pure command helps classify systems, though pure forms rarely exist. Understanding economic systems provides context for analyzing how institutional arrangements affect economic outcomes and why economies perform differently."
}
