{
  "expanded_description": "How do economists make sense of the complex world around us? Just as a map simplifies a city to help you navigate, economic models simplify reality to help us understand how the economy works. Models allow economists to isolate cause and effect, make predictions, and analyze policy options. But models are only useful if we understand their assumptions and how to interpret them. In this section, we'll explore how economists use models and graphs to represent economic relationships, the difference between endogenous and exogenous factors, the distinction between positive and normative analysis, and the key graphs you'll encounter throughout this course. Mastering these tools early will make the rest of your microeconomics journey much smoother.",
  
  "core_concept": {
    "principle": "Economic models are simplified representations of reality used to understand economic relationships and make predictions. They abstract from unnecessary details to focus on essential features. (1) Purpose of models: Explain economic phenomena, predict outcomes of changes, and evaluate policy options. Good models balance simplicity with accuracy. (2) Building models: Models start with assumptions (e.g., ceteris paribus—'all else equal') to isolate relationships. They identify variables: endogenous variables (determined within the model) and exogenous variables (determined outside the model). (3) Testing models: Models generate predictions that can be tested with real-world data. If predictions consistently match data, the model is useful; if not, it may need revision. (4) Graphs: Most economic models use graphs to visualize relationships between variables. Common graphs include supply and demand, production possibilities curves, and cost curves. Understanding how to read, interpret, and create these graphs is essential. (5) Caution: Models are simplifications—they don't capture every detail. Relying on models without understanding their limitations can lead to errors.",
    
    "explanation": "Think of an economic model like a recipe. A recipe doesn't include every detail of cooking—it doesn't tell you how to turn on the stove or wash your hands. It simplifies the cooking process to focus on ingredients and steps. Similarly, economic models ignore irrelevant details to focus on the key relationships. A map of the subway system is another example: it doesn't show every building or street, just the lines and stations you need to navigate. That's what makes it useful. Economic models work the same way—they're tools for navigating the economy.",
    
    "image": {
      "src": "images/unit1/models_overview.png",
      "alt": "Comparison of a complex city photograph with a simple subway map, illustrating simplification",
      "caption": "Figure 1.2.1: Economic models simplify reality, like a subway map simplifies a city."
    }
  },

  "sections": [
    {
      "section_title": "1.2 Models and Graphs",
      "introduction": "Economists can't run laboratory experiments like physicists or biologists. Instead, they build models—simplified representations of reality—to understand how the economy works. These models help economists analyze relationships, predict outcomes, and evaluate policies. But models are only as good as their assumptions and our ability to interpret them. Graphs are a key tool for visualizing economic models, allowing us to see relationships between variables at a glance. In this section, we'll explore the purpose and structure of economic models, the difference between positive and normative analysis, how to build and interpret graphs, and the common graphical relationships you'll encounter throughout AP Microeconomics.",
      
      "introduction_image": {
        "src": "images/unit1/models_intro.png",
        "alt": "Economist at a whiteboard drawing graphs and models, with data in background",
        "caption": "Figure 1.2.2: Economists use models and graphs to understand and predict economic behavior."
      },
      
      "key_concept": {
        "definition": "Economic models are simplified frameworks for analyzing economic behavior and predicting outcomes. They consist of: (1) Assumptions: Models simplify reality by making assumptions. The most common is ceteris paribus (all else equal)—assuming other factors remain constant while examining one relationship. For example, when analyzing how price affects quantity demanded, we assume income, tastes, and other prices don't change. (2) Variables: Models identify key variables and their relationships. Endogenous variables are explained within the model (e.g., price and quantity in supply/demand). Exogenous variables are determined outside the model and taken as given (e.g., weather, technology, government policies). (3) Equations and relationships: Models express relationships mathematically or graphically. For example, Qd = a - bP represents demand, showing quantity demanded depends negatively on price. (4) Predictions: Models generate hypotheses about how changes in exogenous variables affect endogenous variables. For instance, 'if income increases, demand for normal goods will increase.' (5) Testing: Predictions are compared with real-world data. If a model consistently fails, economists revise or replace it. Models are judged by their predictive power and usefulness, not by the realism of their assumptions. Good models balance simplicity and accuracy. Graphs are visual representations of models, showing relationships between two variables while holding others constant. Common graphs include: time-series graphs (showing changes over time), scatter plots (showing correlations), and economic models like the production possibilities curve, supply and demand, and cost curves. Understanding how to interpret slope, intercepts, and shifts is essential.",
        
        "context": "The use of models in economics dates back to Adam Smith, but modern economic modeling emerged in the 19th century with David Ricardo's comparative advantage model and Léon Walras's general equilibrium theory. In the 20th century, economists like Paul Samuelson formalized mathematical modeling. Today, models range from simple supply-demand diagrams to complex computer simulations. In AP Microeconomics, you'll focus on graphical models that illustrate core concepts. The ceteris paribus assumption is crucial—it allows us to isolate relationships, but we must remember that in the real world, many factors change simultaneously. Recognizing both the power and limitations of models is key to becoming a sophisticated economic thinker.",
        
        "image": {
          "src": "images/unit1/model_structure.png",
          "alt": "Diagram showing model components: assumptions, variables, relationships, predictions, testing",
          "caption": "Figure 1.2.3: Economic models consist of assumptions, variables, relationships, and predictions that can be tested."
        }
      },

      "classifications": [
        {
          "type": "Positive Economics",
          "value": "Objective, fact-based analysis of what is",
          "characteristics": ["Testable with data", "Value-free", "Descriptive", "\"What is\" statements", "Can be proven true or false"],
          "behavior": "Positive economics deals with objective explanations and predictions. It describes economic phenomena without making value judgments. Positive statements can be tested and confirmed or refuted with evidence. For example, 'An increase in the minimum wage will lead to higher unemployment among teenagers' is a positive statement—it can be tested with data. Positive analysis is the backbone of economic science. Economists build models to generate positive predictions about cause and effect. While economists may disagree about which models are correct, the goal is to converge on accurate positive explanations through empirical testing. Positive economics tells us what will happen if we change a policy, but it doesn't tell us whether that outcome is good or bad.",
          
          "image": {
            "src": "images/unit1/positive_economics.png",
            "alt": "Magnifying glass examining data with \"what is\" label",
            "caption": "Figure 1.2.4: Positive economics analyzes what is—objective, testable statements."
          },
          
          "examples": [
            {
              "process": "Price and quantity relationship",
              "explanation": "If the price of gasoline increases by 10\\%, the quantity demanded will decrease by about 2\\% in the short run. This is a positive statement that can be tested with data."
            },
            {
              "process": "Minimum wage effect",
              "explanation": "A study finds that a \\$1 increase in the minimum wage reduced employment by 1.5\\% among restaurant workers. This positive finding is based on empirical evidence."
            }
          ]
        },
        {
          "type": "Normative Economics",
          "value": "Subjective, value-based analysis of what ought to be",
          "characteristics": ["Based on values and opinions", "Prescriptive", "\"What ought to be\" statements", "Cannot be tested", "Involves ethical judgments"],
          "behavior": "Normative economics involves value judgments about what the economy should be like or what policies should be implemented. Normative statements cannot be tested because they reflect opinions, not facts. For example, 'The minimum wage should be increased to \\$15 per hour' is a normative statement—it expresses a view about what ought to happen, based on values about fairness, poverty, or worker rights. Normative analysis is essential for policy debates because economics alone cannot tell us what goals society should pursue. Positive economics can inform normative debates by predicting the consequences of different policies, but the final judgment involves values. When economists offer policy advice, they typically combine positive analysis (what will happen) with normative assumptions (what goals matter). Recognizing the difference helps separate factual disagreements from value disagreements.",
          
          "image": {
            "src": "images/unit1/normative_economics.png",
            "alt": "Speech bubble with \"what ought to be\" and thought bubble with values and ethics",
            "caption": "Figure 1.2.5: Normative economics addresses what ought to be—based on values and opinions."
          },
          
          "examples": [
            {
              "process": "Tax policy debate",
              "explanation": "The government should tax the wealthy more to reduce inequality. This is normative—it reflects a value judgment about fairness and the desired degree of redistribution."
            },
            {
              "process": "Environmental regulation",
              "explanation": "Society should prioritize environmental protection over economic growth. This normative statement reflects values about the importance of nature relative to material prosperity."
            }
          ]
        },
        {
          "type": "Economic Graphs",
          "value": "Visual representations of economic relationships",
          "characteristics": ["X and Y axes", "Variables", "Slope", "Intercepts", "Curves or lines", "Shifts vs movements"],
          "behavior": "Graphs are essential tools in economics for visualizing relationships between variables. Key concepts include: (1) Axes: The vertical (Y) and horizontal (X) axes represent different variables. In economics, the independent variable often goes on the X-axis, but conventions vary (e.g., in supply and demand, price is on the Y-axis). (2) Slope: The steepness of a line, calculated as rise over run (ΔY/ΔX). Slope indicates how much Y changes when X changes. Positive slope: variables move together. Negative slope: variables move in opposite directions. (3) Intercepts: Where the line crosses the axes, showing values when the other variable is zero. (4) Movement along a curve: Caused by a change in the variable on the X-axis. (5) Shift of a curve: Caused by a change in an exogenous variable not on the axes. For example, in demand graphs, a change in price causes movement along the demand curve; a change in income causes the entire curve to shift. (6) Nonlinear relationships: Some relationships curve—slope changes at different points. Marginal analysis often deals with nonlinear relationships. (7) Important graph types: Time-series (variable over time), scatter plots (correlation between variables), and economic models (PPC, supply/demand, cost curves). Mastering graph interpretation is essential for success in AP Microeconomics.",
          
          "image": {
            "src": "images/unit1/graph_types.png",
            "alt": "Three panels showing time-series graph, scatter plot, and economic model (demand curve)",
            "caption": "Figure 1.2.6: Common graph types in economics: time-series, scatter plots, and economic models."
          },
          
          "examples": [
            {
              "process": "Demand curve graph",
              "explanation": "A demand curve shows quantity demanded on the X-axis and price on the Y-axis. It slopes downward, showing the inverse relationship: as price increases, quantity demanded decreases. A change in price causes movement along the curve; a change in consumer income shifts the entire curve."
            },
            {
              "process": "Production function graph",
              "explanation": "A production function shows output (Y-axis) as a function of labor input (X-axis). It typically slopes upward but flattens as diminishing returns set in, showing that each additional worker adds less to output."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Ceteris Paribus Assumption Is Essential for Analysis",
          "statement": "Ceteris paribus, Latin for 'all other things held constant,' is a crucial assumption in economic modeling. It allows economists to isolate the relationship between two variables by assuming that everything else remains unchanged. For example, when examining how price affects quantity demanded, we assume income, tastes, prices of related goods, and expectations don't change. This simplification makes analysis possible. Without it, we couldn't determine cause and effect because too many factors change simultaneously. However, ceteris paribus is a simplification—in reality, other things do change. Sophisticated analysis involves recognizing when ceteris paribus holds approximately and when other factors are too important to ignore. Models that rely on ceteris paribus generate predictions that can be tested with statistical methods that control for other factors.",
          "application": "When analyzing a graph or model, identify what's being held constant. A shift in a curve indicates that something held constant has changed. Ask: 'What factors are assumed constant here? What would cause this curve to shift?' This helps distinguish between movements along curves and shifts of curves.",
          "example": "The law of demand states that, ceteris paribus, as price increases, quantity demanded decreases. If you observe that both price and quantity increased, ceteris paribus was violated—something else (like income) must have changed, shifting the demand curve.",
          
          "image": {
            "src": "images/unit1/ceteris_paribus.png",
            "alt": "Balance scale with 'price' and 'quantity' on one side and 'all other factors' on the other, held constant",
            "caption": "Figure 1.2.7: Ceteris paribus holds all other factors constant to isolate relationships."
          }
        },
        {
          "principle": "Models Are Judged by Their Predictive Power, Not Their Assumptions",
          "statement": "A common criticism of economic models is that their assumptions are unrealistic. For example, the assumption of rational behavior ignores psychological complexities. However, economist Milton Friedman argued that models should be judged by how well they predict, not by the realism of their assumptions. A model with unrealistic assumptions can still make accurate predictions—like a map that simplifies terrain but still helps you navigate. Conversely, a model with realistic assumptions that predicts poorly is useless. This view, called instrumentalism, holds that models are tools for prediction, not complete descriptions of reality. Good models balance simplicity and predictive accuracy. They abstract from irrelevant details to focus on key relationships. When a model fails to predict well, economists revise it—not because assumptions are unrealistic, but because it doesn't work.",
          "application": "When evaluating a model, ask: 'Does it generate accurate predictions?' Don't dismiss a model solely because its assumptions seem too simple. Consider whether it captures the essential forces at work and whether its predictions hold up empirically.",
          "example": "The supply and demand model assumes perfect competition (many buyers and sellers, identical products, perfect information). Real markets rarely meet these conditions perfectly, yet the model predicts prices and quantities reasonably well in many contexts. Its usefulness comes from predictive power, not perfect realism.",
          
          "image": {
            "src": "images/unit1/predictive_power.png",
            "alt": "Target with arrows hitting bullseye labeled 'accurate predictions' and assumptions in background",
            "caption": "Figure 1.2.8: Models are judged by their predictive accuracy, not the realism of their assumptions."
          }
        },
        {
          "principle": "Correlation Does Not Imply Causation",
          "statement": "A fundamental principle in empirical economics: just because two variables move together (correlation) does not mean one causes the other. There may be: (1) Reverse causation: Y causes X instead of X causing Y. (2) Omitted variables: A third factor Z causes both X and Y, creating a spurious correlation. (3) Coincidence: Random chance produces an apparent relationship. Economists use careful research designs—natural experiments, randomized controlled trials, instrumental variables, and regression analysis—to establish causation. Graphs can show correlations, but establishing causation requires deeper analysis. This principle is crucial for interpreting economic evidence and avoiding policy mistakes based on misleading correlations.",
          "application": "When you see a graph showing two variables moving together, always ask: 'Could there be reverse causation? Is there an omitted variable driving both?' Don't assume causation without evidence. Look for studies that use credible research designs to identify causal effects.",
          "example": "Countries with more doctors per capita have higher mortality rates. Does this mean doctors cause death? No—wealthier countries have both more doctors and better reporting of deaths, and poorer countries have fewer doctors but also underreport deaths. The correlation is spurious, driven by development level.",
          
          "image": {
            "src": "images/unit1/correlation_vs_causation.png",
            "alt": "Three panels showing correlation, possible reverse causation, and omitted variable",
            "caption": "Figure 1.2.9: Correlation does not imply causation—beware of reverse causation and omitted variables."
          }
        },
        {
          "principle": "Graphs Have Conventions That Must Be Learned",
          "statement": "Economic graphs follow specific conventions that may differ from math class. For example: (1) In supply and demand graphs, price (the independent variable in the relationship) goes on the vertical Y-axis, and quantity (dependent) goes on the horizontal X-axis—the reverse of math convention. (2) Slope has economic meaning: slope of demand curve shows how quantity responds to price; slope of production possibilities curve shows opportunity cost. (3) Shifts vs. movements: A change in the variable on the X-axis causes movement along the curve; a change in any other relevant variable causes the entire curve to shift. (4) Reading graphs: Identify what's on each axis, what's being measured, what's held constant, and what direction relationships go. (5) Nonlinear graphs: Many economic relationships are curved; slope changes at different points. Understanding these conventions is essential for correctly interpreting economic models and avoiding common mistakes.",
          "application": "When approaching any economic graph, first identify: What's on each axis? What does the slope represent? What's held constant? What would cause a shift? Practice drawing key graphs from memory—this builds intuition and prepares you for exams.",
          "example": "In the production possibilities curve (PPC), the axes show quantities of two goods. The slope at any point shows the opportunity cost of producing more of the good on the X-axis. A bowed-out PPC has increasing opportunity cost; a straight-line PPC has constant opportunity cost.",
          
          "image": {
            "src": "images/unit1/graph_conventions.png",
            "alt": "Side-by-side comparison of math graph (X independent) and economics graph (price on Y) with labels",
            "caption": "Figure 1.2.10: Economic graphs have special conventions—learn them early."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Distinguishing Positive and Normative Statements",
          
          "image": {
            "src": "images/unit1/positive_normative.png",
            "alt": "Table with positive and normative statements to classify",
            "caption": "Figure 1.2.11: Classify each statement as positive or normative."
          },
          
          "problem": "Classify each statement as positive (P) or normative (N):<br>a) The unemployment rate is 4.2\\%.<br>b) The government should increase spending on education.<br>c) Increasing the minimum wage will reduce employment among low-skilled workers.<br>d) A 10\\% increase in the price of cigarettes reduces smoking by 5\\%.<br>e) Tax cuts for the wealthy are unfair.<br>f) Countries with higher inflation tend to have higher interest rates.",
          
          "step_by_step": [
            {
              "step": "Statement a",
              "explanation": "'The unemployment rate is 4.2\\%' reports a fact that can be verified with data. It is positive (descriptive, testable)."
            },
            {
              "step": "Statement b",
              "explanation": "'The government should increase spending on education' expresses a value judgment about what ought to be done. It is normative."
            },
            {
              "step": "Statement c",
              "explanation": "'Increasing the minimum wage will reduce employment' is a testable prediction about cause and effect. It is positive (even if different studies disagree)."
            },
            {
              "step": "Statement d",
              "explanation": "'A 10\\% increase in price reduces smoking by 5\\%' is a quantitative, testable claim. It is positive."
            },
            {
              "step": "Statement e",
              "explanation": "'Tax cuts for the wealthy are unfair' expresses a value judgment about fairness. It is normative."
            },
            {
              "step": "Statement f",
              "explanation": "'Countries with higher inflation tend to have higher interest rates' is a testable correlation. It is positive."
            }
          ],
          
          "final_answer": "a) P, b) N, c) P, d) P, e) N, f) P",
          "concept_applied": "Positive statements are factual and testable; normative statements express values and opinions about what ought to be."
        },
        {
          "title": "Interpreting Slope and Shifts",
          
          "image": {
            "src": "images/unit1/demand_graph.png",
            "alt": "Demand curve graph with points A, B, and a shifted curve",
            "caption": "Figure 1.2.12: Analyze movements along and shifts of the demand curve."
          },
          
          "problem": "Consider a demand curve for coffee. Initially, the demand curve is D1. At point A, price = \\$4, quantity = 100. At point B, price = \\$3, quantity = 120. Then, consumer incomes increase, and the demand curve shifts to D2. At the original price of \\$4, quantity now = 130.<br>a) What is the slope between points A and B?<br>b) Is the movement from A to B a shift or a movement along the curve?<br>c) What caused the movement from A to B?<br>d) Is the movement from D1 to D2 a shift or a movement?<br>e) What caused the shift?<br>f) At a price of \\$4 on D2, what's the quantity?",
          
          "step_by_step": [
            {
              "step": "Calculate slope from A to B",
              "explanation": "Slope = ΔPrice/ΔQuantity = (\\$3 - \\$4)/(120 - 100) = (-\\$1)/(20) = -0.05. This means price decreases by \\$0.05 for each additional unit of quantity."
            },
            {
              "step": "Movement A to B type",
              "explanation": "This is a movement along the demand curve D1 because price changed, causing quantity demanded to change, with other factors constant."
            },
            {
              "step": "Cause of A to B",
              "explanation": "The movement was caused by a decrease in price from \\$4 to \\$3 (ceteris paribus)."
            },
            {
              "step": "Movement D1 to D2 type",
              "explanation": "This is a shift of the entire demand curve. At every price, quantity demanded is higher."
            },
            {
              "step": "Cause of shift",
              "explanation": "The shift was caused by an increase in consumer income (assuming coffee is a normal good)."
            },
            {
              "step": "Quantity at \\$4 on D2",
              "explanation": "Given: at \\$4 on D2, quantity = 130."
            }
          ],
          
          "final_answer": "a) -0.05. b) Movement along the curve. c) Decrease in price. d) Shift of the curve. e) Increase in income. f) 130 units.",
          "concept_applied": "Changes in the price of the good cause movements along the curve; changes in other factors (income, tastes, etc.) cause shifts of the entire curve."
        },
        {
          "title": "Building a Simple Model",
          
          "image": {
            "src": "images/unit1/simple_model.png",
            "alt": "Table of data and blank graph for plotting",
            "caption": "Figure 1.2.13: Build a model from data and make a prediction."
          },
          
          "problem": "You collect data on the price of movie tickets and attendance at a local theater:<br>Price: \\$10, \\$9, \\$8, \\$7, \\$6<br>Attendance: 200, 240, 280, 320, 360<br>a) Plot these points with price on the vertical axis and attendance on the horizontal axis.<br>b) Draw a line through the points. What is the equation?<br>c) What is the slope? Interpret it.<br>d) Predict attendance if price = \\$5.<br>e) Is this model positive or normative?",
          
          "step_by_step": [
            {
              "step": "Plot and find equation",
              "explanation": "The relationship appears linear. When price decreases by \\$1, attendance increases by 40. Using point-slope: Price = 10 - (1/40)(Attendance - 200)? Let's derive properly: Slope = ΔPrice/ΔAttendance = (-\\$1)/40 = -0.025. Using point (200,10): Price - 10 = -0.025(Attendance - 200) → Price = -0.025(Attendance) + 15. Alternatively, solve for attendance: Attendance = 600 - 40×Price? Check: At price 10, 600 - 400 = 200. At price 6, 600 - 240 = 360. Yes."
            },
            {
              "step": "Slope interpretation",
              "explanation": "Slope = -0.025 means that each additional attendee is associated with a \\$0.025 (2.5 cent) decrease in price. Or, more usefully, each \\$1 increase in price reduces attendance by 40 people."
            },
            {
              "step": "Predict attendance at \\$5",
              "explanation": "Attendance = 600 - 40×5 = 600 - 200 = 400."
            },
            {
              "step": "Positive or normative",
              "explanation": "This is a positive model—it describes the relationship between price and attendance based on data. It doesn't say what price should be."
            }
          ],
          
          "final_answer": "b) Attendance = 600 - 40×Price. c) Slope = -0.025 (or -40 in inverse form). d) 400 attendees. e) Positive.",
          "concept_applied": "Building models from data involves identifying relationships, finding equations, and making predictions—all within positive economics."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Economic Question",
          "description": "Start with a clear question about cause and effect or policy impact.",
          "mechanism": "Ask: What relationship do we want to understand? What outcome do we want to predict?",
          "result": "Focused research question.",
          
          "image": {
            "src": "images/unit1/model_step1.png",
            "alt": "Question mark with economic symbols: What happens if price increases?",
            "caption": "Figure 1.2.14: Step 1 - Identify the economic question to be answered."
          }
        },
        {
          "step": 2,
          "process": "Make Simplifying Assumptions",
          "description": "Decide which factors to include and which to hold constant.",
          "mechanism": "Use ceteris paribus to isolate key relationships. Specify endogenous vs exogenous variables.",
          "result": "Set of assumptions defining model scope.",
          
          "image": {
            "src": "images/unit1/model_step2.png",
            "alt": "List of assumptions with 'ceteris paribus' highlighted",
            "caption": "Figure 1.2.15: Step 2 - Make simplifying assumptions, including ceteris paribus."
          }
        },
        {
          "step": 3,
          "process": "Define Variables and Relationships",
          "description": "Specify the variables and how they relate mathematically or graphically.",
          "mechanism": "Identify dependent and independent variables. Specify equations or draw curves showing relationships.",
          "result": "Formal model specification.",
          
          "image": {
            "src": "images/unit1/model_step3.png",
            "alt": "Equation Qd = a - bP and downward-sloping demand curve",
            "caption": "Figure 1.2.16: Step 3 - Define variables and specify relationships."
          }
        },
        {
          "step": 4,
          "process": "Generate Predictions",
          "description": "Use the model to predict what will happen when variables change.",
          "mechanism": "Change an exogenous variable and trace effects on endogenous variables. Use graphs or equations.",
          "result": "Testable predictions.",
          
          "image": {
            "src": "images/unit1/model_step4.png",
            "alt": "Arrow from exogenous change to predicted outcome with question mark",
            "caption": "Figure 1.2.17: Step 4 - Generate predictions about how changes affect outcomes."
          }
        },
        {
          "step": 5,
          "process": "Test Predictions with Data",
          "description": "Compare predictions to real-world evidence.",
          "mechanism": "Collect data, use statistical analysis. If predictions match, model is useful. If not, revise assumptions or relationships.",
          "result": "Validated or revised model.",
          
          "image": {
            "src": "images/unit1/model_step5.png",
            "alt": "Data points compared to model prediction line",
            "caption": "Figure 1.2.18: Step 5 - Test predictions against real-world data and revise as needed."
          }
        }
      ],

      "image": {
        "src": "images/unit1/models_summary.png",
        "alt": "Comprehensive summary diagram: from question to assumptions to model to predictions to testing",
        "caption": "Figure 1.2.19: Economic modeling summary - the process from question to validated model."
      }
    }
  ],

  "key_terms": [
    "Economic model",
    "Assumptions",
    "Ceteris paribus",
    "Variables",
    "Endogenous variable",
    "Exogenous variable",
    "Positive economics",
    "Normative economics",
    "Graph",
    "Axis",
    "X-axis",
    "Y-axis",
    "Slope",
    "Intercept",
    "Movement along the curve",
    "Shift of the curve",
    "Time-series graph",
    "Scatter plot",
    "Correlation",
    "Causation",
    "Omitted variable",
    "Reverse causation",
    "Spurious correlation",
    "Prediction",
    "Testing",
    "Empirical evidence",
    "Simplification",
    "Abstraction",
    "Instrumentalism",
    "Milton Friedman",
    "Model building",
    "Data",
    "Relationship",
    "Linear relationship",
    "Nonlinear relationship",
    "Demand curve",
    "Supply curve",
    "Production possibilities curve"
  ],

  "summary": "Economic models are simplified representations of reality used to understand economic relationships and make predictions. They rely on assumptions, most notably ceteris paribus (all else equal), to isolate key relationships. Models identify endogenous variables (determined within the model) and exogenous variables (determined outside). Positive economics deals with objective, testable statements about what is; normative economics involves value judgments about what ought to be. Graphs are essential tools for visualizing economic models, with specific conventions about axes, slopes, and shifts versus movements along curves. A change in the variable on the X-axis causes movement along a curve; a change in any other relevant variable causes the entire curve to shift. Models are judged by their predictive power, not the realism of their assumptions. Correlation does not imply causation—observed relationships may reflect reverse causation or omitted variables. The process of economic modeling involves identifying a question, making assumptions, specifying relationships, generating predictions, and testing with data. Mastering these tools and distinctions is essential for analyzing economic problems and evaluating policies throughout AP Microeconomics and beyond."
}
