{
  "expanded_description": "How does an economy decide what to produce? With limited resources, producing more of one good means producing less of another. The Production Possibilities Curve (PPC) is a simple but powerful model that illustrates this fundamental trade-off. It shows the maximum combinations of two goods an economy can produce given its resources and technology. But the PPC does more than just show trade-offs—it also illustrates concepts like efficiency, inefficiency, economic growth, and opportunity cost. In this section, we'll explore the PPC model, how it works, what causes it to shift, and how it helps us understand real-world economic choices. By the end, you'll be able to use the PPC to analyze everything from a country's production decisions to the effects of technological change.",
  
  "core_concept": {
    "principle": "The Production Possibilities Curve (PPC) is a model that shows the maximum combinations of two goods or services an economy can produce with its available resources and technology, assuming full and efficient use of resources. (1) Shape and slope: The PPC typically slopes downward (showing trade-offs) and is bowed outward (concave to the origin) due to increasing opportunity costs. A straight-line PPC would show constant opportunity cost. (2) Points on the curve: Represent efficient production—all resources are fully and efficiently used. To produce more of one good, the economy must produce less of the other. (3) Points inside the curve: Represent inefficiency—resources are underutilized or misallocated. The economy could produce more of both goods without sacrificing anything. (4) Points outside the curve: Unattainable with current resources and technology. (5) Opportunity cost: On the PPC, the opportunity cost of producing more of one good is the amount of the other good that must be given up. The slope of the PPC at any point equals the opportunity cost. (6) Shifts of the PPC: Economic growth shifts the PPC outward, allowing more of both goods. Growth comes from increases in resources (more labor, capital, natural resources) or improvements in technology. A shift inward represents economic decline. (7) Applications: The PPC illustrates scarcity (unattainable points), choice (which combination to produce), opportunity cost (trade-offs), efficiency (on the curve), and growth (shifts outward).",
    
    "explanation": "Imagine you have a plot of land and you can grow either corn or soybeans. If you plant all corn, you get 100 bushels. If all soybeans, 80 bushels. You can also mix: some corn, some soybeans. The PPC shows all possible combinations. If you're producing efficiently (using all land well), you're on the curve. If you leave land fallow, you're inside the curve—inefficient. If you discover better seeds or get more land, the curve shifts out—you can produce more of both. The PPC is like a menu of possibilities given your current resources.",
    
    "image": {
      "src": "images/unit1/ppc_overview.png",
      "alt": "Production Possibilities Curve showing trade-off between two goods, with points on, inside, and outside the curve labeled",
      "caption": "Figure 1.3.1: The Production Possibilities Curve (PPC) models trade-offs, efficiency, and growth."
    }
  },

  "sections": [
    {
      "section_title": "1.3 PPC in Action",
      "introduction": "The Production Possibilities Curve is one of the first models economists use to teach fundamental concepts. It visually represents scarcity, choice, opportunity cost, efficiency, and growth in a single diagram. But the PPC isn't just an abstract classroom tool—it applies to real-world decisions made by individuals, firms, and governments. In this section, we'll explore the PPC in depth: how to construct it, what different points mean, how opportunity cost varies along the curve, what causes the curve to shift, and how to use the PPC to analyze real economic issues like technological change, resource discovery, and policy decisions.",
      
      "introduction_image": {
        "src": "images/unit1/ppc_intro.png",
        "alt": "Factory with two production lines, one for cars and one for trucks, illustrating trade-off",
        "caption": "Figure 1.3.2: The PPC models real-world trade-offs like a factory deciding between cars and trucks."
      },
      
      "key_concept": {
        "definition": "The Production Possibilities Curve (PPC) represents all maximum combinations of two goods that an economy can produce given its resources and technology. Key elements: (1) Assumptions: The model assumes fixed resources, fixed technology, and that the economy produces only two goods (simplification). Resources are fully employed and used efficiently. (2) Shape: The PPC is typically bowed outward (concave to the origin) because of increasing opportunity costs. As an economy produces more of one good, resources that are less suited to that good must be used, increasing the opportunity cost. For example, shifting workers from teaching to farming: the first workers moved are the least productive farmers but best teachers, so farming output rises little while teaching output falls a lot—high opportunity cost. (3) Constant opportunity cost: If resources were perfectly adaptable between uses, the PPC would be a straight line. This is rare but possible. (4) Points on the curve: Represent efficient production—the economy cannot produce more of one good without producing less of the other. (5) Points inside: Inefficient—unemployment, underutilized capacity, or misallocated resources. The economy could produce more of both goods. (6) Points outside: Unattainable with current resources and technology. (7) Opportunity cost calculation: Moving between two points, opportunity cost = (loss in Good Y)/(gain in Good X). (8) Law of increasing opportunity cost: As production of a good increases, the opportunity cost of producing additional units rises. This explains the bowed shape. (9) Shifts: Increases in resources (labor, capital, natural resources) or technological progress shift the PPC outward (economic growth). Decreases (disasters, war, resource depletion) shift it inward. (10) Applications: The PPC helps analyze trade-offs in policy decisions, the effects of investment vs. consumption, the impact of technological change, and the costs of unemployment and inefficiency.",
        
        "context": "The Production Possibilities Curve emerged from early 20th-century economic thinking about scarcity and choice. Economist Paul Samuelson popularized the PPC in his influential textbook 'Economics' (1948). The famous 'guns and butter' trade-off during the Cold War illustrated the PPC concept: countries had to choose between military spending (guns) and consumer goods (butter). Today, the PPC is used to analyze everything from environmental trade-offs (clean air vs. economic output) to healthcare decisions (more hospitals vs. more schools). In AP Microeconomics, the PPC is your first tool for visualizing core concepts that will appear throughout the course.",
        
        "image": {
          "src": "images/unit1/ppc_detailed.png",
          "alt": "Detailed PPC diagram with labeled points: A (on curve), B (inside), C (outside), and arrows showing shifts",
          "caption": "Figure 1.3.3: The PPC shows efficiency (on curve), inefficiency (inside), unattainable combinations (outside), and growth (outward shift)."
        }
      },

      "classifications": [
        {
          "type": "Constant Opportunity Cost PPC",
          "value": "Straight-line PPC where opportunity cost remains constant",
          "characteristics": ["Linear (straight line)", "Constant slope", "Resources perfectly adaptable", "Opportunity cost constant", "Simpler calculations"],
          "behavior": "A constant opportunity cost PPC is a straight line. This occurs when resources are perfectly adaptable between producing the two goods—that is, resources used to produce one good are equally productive in producing the other. For example, if labor is the only resource and workers are equally skilled at making either pizzas or calzones, the trade-off is constant: each pizza given up always yields the same number of calzones. While rare in reality, constant opportunity cost PPCs are useful for simplifying calculations and introducing the model. The slope of the line equals the opportunity cost: if the slope is -2, producing one more unit of the good on the X-axis requires giving up 2 units of the good on the Y-axis. Constant opportunity cost PPCs appear in problems about comparative advantage and trade, where linear production possibilities simplify analysis.",
          
          "image": {
            "src": "images/unit1/ppc_constant.png",
            "alt": "Straight-line PPC with constant slope labeled",
            "caption": "Figure 1.3.4: Constant opportunity cost PPC (straight line) - resources are perfectly adaptable."
          },
          
          "examples": [
            {
              "process": "Pizzas and calzones",
              "explanation": "A pizzeria can produce either pizzas or calzones using the same ingredients and labor. Each pizza requires the same resources as each calzone. The PPC is a straight line: giving up 1 pizza always yields 2 calzones (or whatever the constant ratio)."
            },
            {
              "process": "Apples and oranges (simplified)",
              "explanation": "If a farmer's land is equally suited to apples and oranges, and labor is equally productive, the trade-off is constant. Planting more apple trees means fewer orange trees in a fixed ratio."
            }
          ]
        },
        {
          "type": "Increasing Opportunity Cost PPC",
          "value": "Bowed-out PPC where opportunity cost increases as more of a good is produced",
          "characteristics": ["Curved (concave to origin)", "Slope becomes steeper", "Resources not perfectly adaptable", "Opportunity cost increases", "More realistic"],
          "behavior": "An increasing opportunity cost PPC is bowed outward (concave to the origin). This is the typical shape for real economies because resources are not equally productive in all uses. As an economy produces more of one good, it must increasingly use resources that are less suited to that good, causing the opportunity cost to rise. For example, shifting land from growing wheat to growing corn: the best wheat land is also good for corn, but as more corn is needed, land that is terrible for corn but decent for wheat gets converted, so corn output increases little while wheat output drops a lot. The slope of the PPC at any point equals the opportunity cost of producing one more unit of the good on the X-axis. Near the Y-axis, the PPC is flatter (low opportunity cost); near the X-axis, it's steeper (high opportunity cost). This shape reflects the law of increasing opportunity cost. Most real-world trade-offs follow this pattern.",
          
          "image": {
            "src": "images/unit1/ppc_increasing.png",
            "alt": "Bowed-out PPC with slope changing from flat to steep",
            "caption": "Figure 1.3.5: Increasing opportunity cost PPC (bowed outward) - resources are not perfectly adaptable."
          },
          
          "examples": [
            {
              "process": "Guns and butter",
              "explanation": "An economy producing military goods (guns) and consumer goods (butter). Initially, shifting resources from butter to guns uses workers who are somewhat skilled in both. But as more guns are needed, workers who are excellent butter producers but poor gun makers must be shifted—gun output rises little while butter output falls a lot. Opportunity cost increases."
            },
            {
              "process": "Healthcare and education",
              "explanation": "A government deciding between funding hospitals or schools. Initially, resources (workers, buildings) can be somewhat adapted. But eventually, shifting more resources to healthcare means converting schools into hospitals and retraining teachers as nurses—very costly and inefficient, so the opportunity cost rises."
            }
          ]
        },
        {
          "type": "Economic Growth (Outward Shift)",
          "value": "Increase in the economy's capacity to produce goods and services",
          "characteristics": ["Outward shift of PPC", "More of both goods possible", "Caused by more resources", "Caused by better technology", "Caused by improved institutions"],
          "behavior": "Economic growth occurs when the PPC shifts outward, meaning the economy can produce more of both goods than before. Growth can be: (1) Balanced: The PPC shifts outward proportionally, allowing equal percentage increases in both goods. (2) Biased: The PPC shifts outward more for one good than the other, reflecting technological progress or resource discoveries that favor a particular sector. Causes of growth include: (a) Increases in resources: More labor (population growth, immigration), more capital (investment in factories and machines), discovery of natural resources. (b) Technological progress: Better methods of production allow more output from the same resources. (c) Improvements in institutions: Better property rights, rule of law, education that improves productivity. Growth is not automatic—it requires investment, innovation, and sound policies. The PPC can also shift inward (economic decline) due to disasters, war, resource depletion, or loss of productive capacity.",
          
          "image": {
            "src": "images/unit1/ppc_growth.png",
            "alt": "Two PPCs showing outward shift from original to new curve with arrows",
            "caption": "Figure 1.3.6: Economic growth shifts the PPC outward, allowing more of both goods."
          },
          
          "examples": [
            {
              "process": "Industrial Revolution",
              "explanation": "Technological innovations during the Industrial Revolution—steam engine, mechanized textile production—shifted economies' PPCs outward dramatically, enabling unprecedented production of both consumer and capital goods."
            },
            {
              "process": "China's economic growth",
              "explanation": "China's rapid growth since 1980 resulted from increased capital investment, technological adoption, and institutional reforms, shifting its PPC outward and lifting hundreds of millions from poverty."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Law of Increasing Opportunity Cost",
          "statement": "As production of a good increases, the opportunity cost of producing an additional unit rises. This occurs because resources are not equally productive in all uses. When an economy produces more of a good, it must increasingly use resources that are less suited to that production, sacrificing larger amounts of the other good. Graphically, this law gives the PPC its bowed-out shape. Near one axis, the PPC is relatively flat (low opportunity cost); near the other axis, it's steep (high opportunity cost). The law of increasing opportunity cost is fundamental to understanding why economies face tougher trade-offs as they push production of any one good. It also explains why specialization and trade can benefit all parties—by allowing each economy to produce where its opportunity costs are lower.",
          "application": "When analyzing production decisions, consider how opportunity cost changes as output expands. The first units of a good are relatively cheap in terms of foregone alternatives; additional units become increasingly costly. This has implications for policy—pushing production of any good beyond a certain point becomes very expensive.",
          "example": "A farm produces wheat and corn. The first few acres shifted from wheat to corn use land that's fairly good for corn—corn output rises a lot, wheat falls a little. But after using the best corn land, further shifts use land that's terrible for corn but decent for wheat—corn output rises little, wheat falls a lot. Opportunity cost increases.",
          
          "image": {
            "src": "images/unit1/increasing_oc.png",
            "alt": "PPC with three points showing increasing slope as more of X is produced",
            "caption": "Figure 1.3.7: The law of increasing opportunity cost gives the PPC its bowed-out shape."
          }
        },
        {
          "principle": "Efficiency Means Being on the PPC",
          "statement": "An economy is efficient when it's producing on its PPC—when it cannot produce more of one good without producing less of another. This is productive efficiency. Points inside the PPC are inefficient: the economy could produce more of both goods without sacrificing anything. Inefficiency can result from unemployment (workers without jobs), underutilized capital (idle factories), or misallocation of resources (using resources where they're not best suited). Moving from an inefficient point to the PPC represents a 'free lunch'—more of both goods without trade-offs. However, once on the PPC, trade-offs reappear: producing more of one good requires producing less of the other. Allocative efficiency—producing the combination society most desires—is a separate concept requiring value judgments about which point on the PPC is best.",
          "application": "When evaluating an economy's performance, ask: Is it producing on its PPC? High unemployment suggests inefficiency (inside the PPC). Policies that reduce unemployment or improve resource allocation can move the economy toward the PPC, increasing output without trade-offs.",
          "example": "During the Great Depression, the U.S. economy operated far inside its PPC due to massive unemployment and idle factories. World War II mobilization moved the economy onto the PPC, increasing both military and civilian output despite the massive war effort—because idle resources were put to work.",
          
          "image": {
            "src": "images/unit1/ppc_efficiency.png",
            "alt": "PPC with points on curve (efficient), inside (inefficient), and outside (unattainable)",
            "caption": "Figure 1.3.8: Efficiency means being on the PPC; inside points are inefficient; outside points are unattainable."
          }
        },
        {
          "principle": "The PPC Illustrates Scarcity, Choice, and Trade-offs",
          "statement": "The PPC visually demonstrates the three fundamental economic concepts: (1) Scarcity: Points outside the PPC are unattainable—society cannot have everything it wants because resources are limited. This is scarcity. (2) Choice: Society must choose which combination of goods to produce—which point on the PPC to select. Every choice reflects priorities and values. (3) Trade-offs: Moving along the PPC, producing more of one good means producing less of the other. This trade-off is unavoidable because of scarcity. The PPC makes these abstract concepts concrete and visual. It shows that there's no such thing as a free lunch—every choice has an opportunity cost. Understanding this helps evaluate policy proposals that promise more of everything without acknowledging trade-offs.",
          "application": "When you hear policy proposals, ask: Where on the PPC would this take us? Does it acknowledge trade-offs? If a politician promises more healthcare, more education, and lower taxes, the PPC suggests this is impossible without growth—something must give.",
          "example": "A city government wants to build both a new sports stadium and a new library, but has a fixed budget. The PPC illustrates that choosing more stadium means less library (or vice versa). They cannot have both at the highest level without finding additional resources or improving efficiency.",
          
          "image": {
            "src": "images/unit1/ppc_tradeoffs.png",
            "alt": "PPC with two points A and B showing trade-off: more of one good means less of the other",
            "caption": "Figure 1.3.9: The PPC illustrates scarcity (unattainable points), choice (selecting a point), and trade-offs (moving along the curve)."
          }
        },
        {
          "principle": "Investment in Capital Goods Leads to Future Growth",
          "statement": "The PPC can be used to analyze the trade-off between producing consumption goods (for present use) and capital goods (machines, factories, infrastructure—for future production). An economy that devotes more resources to capital goods will have a smaller quantity of consumption goods now, but its PPC will shift outward faster in the future because the capital stock increases productive capacity. An economy that devotes most resources to consumption goods enjoys more now but grows more slowly. This intertemporal trade-off is a key application of the PPC. Countries that invest heavily in capital goods—like China and South Korea—have experienced rapid growth. Countries that consume most of their output grow more slowly. The optimal balance depends on society's preferences for present vs. future consumption.",
          "application": "When analyzing growth strategies, consider the consumption vs. capital goods trade-off. Policies that encourage investment (tax incentives for business investment, spending on infrastructure) may reduce current consumption but boost future growth. The PPC helps visualize this dynamic.",
          "example": "After World War II, Japan invested heavily in capital goods rather than consumption. This reduced living standards temporarily but led to rapid growth as the PPC shifted outward. By the 1980s, Japan had one of the highest living standards in the world.",
          
          "image": {
            "src": "images/unit1/ppc_investment.png",
            "alt": "Two PPCs: one showing more capital goods now leading to larger future PPC; one showing more consumption now leading to smaller future PPC",
            "caption": "Figure 1.3.10: Investment in capital goods trades off current consumption for future growth."
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Constructing and Interpreting a PPC",
          
          "image": {
            "src": "images/unit1/ppc_construction.png",
            "alt": "Table of production possibilities for robots and corn",
            "caption": "Figure 1.3.11: Use the data to construct a PPC and answer questions."
          },
          
          "problem": "An economy can produce combinations of robots and corn shown in the table:<br>Combination A: 0 robots, 500 tons corn<br>Combination B: 100 robots, 480 tons corn<br>Combination C: 200 robots, 440 tons corn<br>Combination D: 300 robots, 360 tons corn<br>Combination E: 400 robots, 200 tons corn<br>Combination F: 500 robots, 0 tons corn<br>a) Plot these points and draw the PPC.<br>b) Is this PPC constant or increasing opportunity cost? How can you tell?<br>c) Calculate the opportunity cost of moving from B to C.<br>d) Calculate the opportunity cost of moving from E to F.<br>e) What happens to opportunity cost as more robots are produced?<br>f) Is point G (250 robots, 400 tons corn) attainable, efficient, or inefficient?",
          
          "step_by_step": [
            {
              "step": "Plot points",
              "explanation": "Plot robots on X-axis, corn on Y-axis. Points: A(0,500), B(100,480), C(200,440), D(300,360), E(400,200), F(500,0). Connect them smoothly."
            },
            {
              "step": "Determine shape",
              "explanation": "The curve is bowed outward (concave to origin). As robots increase, corn sacrificed per additional robot rises, indicating increasing opportunity cost."
            },
            {
              "step": "Opportunity cost B to C",
              "explanation": "Moving from B(100,480) to C(200,440): Gain 100 robots. Lose 40 tons corn. Opportunity cost = 40/100 = 0.4 tons corn per robot."
            },
            {
              "step": "Opportunity cost E to F",
              "explanation": "Moving from E(400,200) to F(500,0): Gain 100 robots. Lose 200 tons corn. Opportunity cost = 200/100 = 2 tons corn per robot."
            },
            {
              "step": "Trend in opportunity cost",
              "explanation": "Opportunity cost increases from 0.4 to 2 tons corn per robot as more robots are produced. This confirms increasing opportunity cost."
            },
            {
              "step": "Point G analysis",
              "explanation": "G(250,400). Compare to nearby points: At 250 robots, the curve would give about 420 corn (between C and D). 400 corn is less than 420, so G is inside the PPC—attainable but inefficient (resources underutilized)."
            }
          ],
          
          "final_answer": "b) Increasing opportunity cost (bowed outward). c) 0.4 tons corn per robot. d) 2 tons corn per robot. e) Opportunity cost increases. f) G is attainable but inefficient (inside PPC).",
          "concept_applied": "The PPC shows trade-offs, and its bowed shape reflects increasing opportunity cost. Points inside are inefficient; points on are efficient; points outside are unattainable."
        },
        {
          "title": "Analyzing PPC Shifts",
          
          "image": {
            "src": "images/unit1/ppc_shifts.png",
            "alt": "Original PPC and several scenarios causing shifts",
            "caption": "Figure 1.3.12: Determine how each event affects the PPC."
          },
          
          "problem": "An economy produces cars and computers. Show how each event affects its PPC (shift out, shift in, or movement along):<br>a) A new technology doubles computer production efficiency.<br>b) A earthquake destroys factories.<br>c) Immigration increases the labor force.<br>d) Unemployment rises from 4% to 10%.<br>e) Schools improve, increasing worker productivity.<br>f) Society decides to produce more cars and fewer computers.",
          
          "step_by_step": [
            {
              "step": "Event a: Computer technology improves",
              "explanation": "This is biased technological progress favoring computers. The PPC shifts outward more for computers than for cars. The economy can produce more computers with the same resources, but car capacity unchanged."
            },
            {
              "step": "Event b: Earthquake destroys factories",
              "explanation": "This reduces capital stock. The PPC shifts inward (left/down). Less of both goods can be produced."
            },
            {
              "step": "Event c: Immigration increases labor",
              "explanation": "More labor increases productive capacity for both goods. The PPC shifts outward (balanced if labor equally useful in both sectors)."
            },
            {
              "step": "Event d: Unemployment rises",
              "explanation": "This doesn't shift the PPC—the maximum possible production hasn't changed. Instead, the economy moves from a point on the PPC to a point inside it (inefficiency)."
            },
            {
              "step": "Event e: Schools improve productivity",
              "explanation": "Better human capital increases productivity across sectors. The PPC shifts outward (balanced if productivity gains affect both sectors equally)."
            },
            {
              "step": "Event f: Society chooses more cars, fewer computers",
              "explanation": "This is a movement along the existing PPC, not a shift. Society is choosing a different point on the same curve."
            }
          ],
          
          "final_answer": "a) Shift outward (biased toward computers). b) Shift inward. c) Shift outward. d) Movement inside (inefficiency). e) Shift outward. f) Movement along.",
          "concept_applied": "Changes in resources or technology shift the PPC; changes in choices or unemployment cause movements along or inside the curve."
        },
        {
          "title": "Consumption vs. Investment Trade-off",
          
          "image": {
            "src": "images/unit1/ppc_consumption_investment.png",
            "alt": "Two PPCs showing different growth paths from different choices",
            "caption": "Figure 1.3.13: Analyze growth consequences of consumption vs. investment choices."
          },
          
          "problem": "Two countries, Alpha and Beta, have identical PPCs currently. Alpha chooses to produce at point A (90 consumption goods, 10 capital goods). Beta chooses point B (50 consumption goods, 50 capital goods).<br>a) Draw their current positions on a PPC with consumption on X-axis and capital on Y-axis.<br>b) Which country has higher current consumption?<br>c) Which country is investing more in future productive capacity?<br>d) What will happen to their PPCs over time?<br>e) After 20 years, which country will likely have higher consumption?",
          
          "step_by_step": [
            {
              "step": "Draw positions",
              "explanation": "On a bowed PPC, point A is near the consumption end (high consumption, low capital). Point B is more balanced (moderate consumption, high capital). Both on the same PPC."
            },
            {
              "step": "Current consumption comparison",
              "explanation": "Alpha has higher current consumption (90 > 50)."
            },
            {
              "step": "Investment comparison",
              "explanation": "Beta is investing more in capital goods (50 > 10). Capital goods increase future productive capacity."
            },
            {
              "step": "Future PPCs",
              "explanation": "Beta's higher investment will shift its PPC outward faster. Alpha's lower investment leads to slower growth. After 20 years, Beta's PPC will be further out than Alpha's."
            },
            {
              "step": "Future consumption",
              "explanation": "Even though Alpha consumed more initially, Beta's faster growth may allow it to eventually exceed Alpha's consumption. If Beta continues to invest heavily, its future consumption possibilities could far surpass Alpha's."
            }
          ],
          
          "final_answer": "b) Alpha. c) Beta. d) Beta's PPC shifts outward faster. e) Beta will likely have higher future consumption due to greater investment and growth.",
          "concept_applied": "The trade-off between current consumption and investment in capital goods determines future growth. Sacrificing consumption today can lead to higher consumption tomorrow."
        }
      ],

      "process_flow": [
        {
          "step": 1,
          "process": "Identify the Two Goods",
          "description": "Determine what two categories of goods the PPC will model.",
          "mechanism": "Choose two broad categories (e.g., consumer goods vs. capital goods, or two specific goods) that compete for the same resources.",
          "result": "Clear definition of axes.",
          
          "image": {
            "src": "images/unit1/ppc_step1.png",
            "alt": "Two labels: 'Cars' on X-axis, 'Trucks' on Y-axis",
            "caption": "Figure 1.3.14: Step 1 - Identify the two goods for the PPC."
          }
        },
        {
          "step": 2,
          "process": "Determine Production Possibilities",
          "description": "Calculate the maximum amounts of each good possible if all resources are used.",
          "mechanism": "If all resources go to Good A, how much? If all to Good B, how much? Then determine intermediate combinations based on resource allocation.",
          "result": "Set of points showing trade-offs.",
          
          "image": {
            "src": "images/unit1/ppc_step2.png",
            "alt": "Table showing production combinations: all A, all B, and mixed",
            "caption": "Figure 1.3.15: Step 2 - Determine maximum production possibilities."
          }
        },
        {
          "step": 3,
          "process": "Plot the PPC",
          "description": "Graph the points and connect them.",
          "mechanism": "Put Good A on X-axis, Good B on Y-axis. Plot each combination. Connect points smoothly—bowed outward for increasing opportunity cost, straight line for constant.",
          "result": "Visual PPC model.",
          
          "image": {
            "src": "images/unit1/ppc_step3.png",
            "alt": "Points plotted and connected to form bowed PPC",
            "caption": "Figure 1.3.16: Step 3 - Plot the points and draw the PPC."
          }
        },
        {
          "step": 4,
          "process": "Analyze Points and Movements",
          "description": "Interpret different points and calculate opportunity costs.",
          "mechanism": "Points on curve = efficient. Inside = inefficient. Outside = unattainable. Slope = opportunity cost. Compare points to find trade-offs.",
          "result": "Understanding of current situation and trade-offs.",
          
          "image": {
            "src": "images/unit1/ppc_step4.png",
            "alt": "PPC with points labeled efficient, inefficient, unattainable",
            "caption": "Figure 1.3.17: Step 4 - Analyze points for efficiency and calculate opportunity costs."
          }
        },
        {
          "step": 5,
          "process": "Consider Changes and Shifts",
          "description": "Determine how events shift the PPC.",
          "mechanism": "More resources or better technology = shift out. Fewer resources = shift in. Changes in allocation or unemployment = movement along or inside.",
          "result": "Dynamic analysis of growth and decline.",
          
          "image": {
            "src": "images/unit1/ppc_step5.png",
            "alt": "Original PPC and outward-shifted PPC with arrows",
            "caption": "Figure 1.3.18: Step 5 - Analyze how events shift the PPC over time."
          }
        }
      ],

      "image": {
        "src": "images/unit1/ppc_summary.png",
        "alt": "Comprehensive PPC diagram showing all features: axes, points, shifts, opportunity cost calculations",
        "caption": "Figure 1.3.19: PPC summary - trade-offs, efficiency, growth, and opportunity cost."
      }
    }
  ],

  "key_terms": [
    "Production Possibilities Curve (PPC)",
    "Production Possibilities Frontier (PPF)",
    "Trade-off",
    "Opportunity cost",
    "Law of increasing opportunity cost",
    "Constant opportunity cost",
    "Efficiency",
    "Productive efficiency",
    "Inefficiency",
    "Unemployment",
    "Underemployment",
    "Idle resources",
    "Full employment",
    "Unattainable points",
    "Attainable points",
    "Economic growth",
    "Economic decline",
    "Outward shift",
    "Inward shift",
    "Biased growth",
    "Balanced growth",
    "Technological progress",
    "Technological change",
    "Resource discovery",
    "Resource depletion",
    "Capital goods",
    "Consumption goods",
    "Investment",
    "Future growth",
    "Present consumption",
    "Intertemporal choice",
    "Guns and butter",
    "Military spending",
    "Consumer goods",
    "Scarcity",
    "Choice",
    "Resource allocation",
    "Factors of production",
    "Land",
    "Labor",
    "Capital",
    "Entrepreneurship",
    "Productivity"
  ],

  "summary": "The Production Possibilities Curve (PPC) is a fundamental economic model that illustrates scarcity, choice, opportunity cost, efficiency, and growth. It shows the maximum combinations of two goods an economy can produce with its available resources and technology. The PPC typically bows outward due to the law of increasing opportunity cost: as more of a good is produced, the opportunity cost of additional units rises because resources are not equally productive in all uses. Points on the curve represent efficient production; points inside represent inefficiency (unemployment, idle capacity, misallocation); points outside are unattainable with current resources. The slope of the PPC at any point equals the opportunity cost of producing one more unit of the good on the X-axis. Economic growth shifts the PPC outward, caused by increases in resources (labor, capital, natural resources) or technological progress. A shift inward represents economic decline. The PPC also illustrates the trade-off between present consumption and investment in capital goods: sacrificing consumption today to produce more capital goods leads to faster future growth and a larger PPC tomorrow. Understanding the PPC helps analyze real-world policy choices, the effects of technological change, the costs of unemployment, and the determinants of economic growth."
}
