
{
  "topic": "5.4 Magnetic Force on Wire",
  "unit_title": "Magnetic Forces on Current-Carrying Conductors",
  "unit_number": "Unit 5.4",
  "grade_level": "Grade 12",
  "subject": "Physics",
  "duration": "3-4 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "Comprehensive study of magnetic forces on current-carrying wires, including force calculations for straight and curved conductors, applications in motors and instruments, and the relationship between microscopic charge forces and macroscopic wire forces.",

  "learning_objectives": [
    "Calculate magnetic forces on straight current-carrying wires",
    "Determine force direction using right-hand rules",
    "Analyze forces on curved conductors and current loops",
    "Apply force principles to electric motors and instruments",
    "Solve problems involving torque on current loops",
    "Relate microscopic charge forces to macroscopic wire forces"
  ],

  "prerequisites": [
    "Magnetic force on moving charges",
    "Current and current density concepts",
    "Vector cross product operations",
    "Torque and rotational motion",
    "Right-hand rule applications",
    "Basic integration techniques"
  ],

  "core_concept": {
    "principle": "Magnetic force on current element: $d\\vec{F} = I d\\vec{l} \\times \\vec{B}$, Straight wire: $\\vec{F} = I\\vec{L} \\times \\vec{B}$, Magnitude: $F = ILB\\sin\\theta$, Current loop torque: $\\vec{\\tau} = \\vec{\\mu} \\times \\vec{B}$, Magnetic moment: $\\vec{\\mu} = NI\\vec{A}$, Motor principle: $\\tau = NIAB\\sin\\theta$.",
    "explanation": "Current-carrying wires experience magnetic forces due to the motion of charge carriers. The force depends on current, wire length, field strength, and their relative orientation. Current loops experience torque that tends to align them with the magnetic field.",
    "image": {
      "url": "images/wire-force-core.png",
      "alt": "Magnetic force on current-carrying wire",
      "caption": "Force on straight wire and torque on current loop"
    }
  },

  "sections": [
    {
      "section_title": "1. Fundamental Force Calculations and Right-Hand Rules",
      "introduction": "Analysis of magnetic forces on straight current-carrying wires, force direction determination using right-hand rules, and calculation of force magnitudes for various configurations.",

      "key_concept": {
        "definition": "Wire force fundamentals: Force element $d\\vec{F} = I d\\vec{l} \\times \\vec{B}$, Straight wire $\\vec{F} = I\\vec{L} \\times \\vec{B}$, Magnitude $F = ILB\\sin\\theta$, Maximum force when L⟂B, Zero force when L∥B, Right-hand rule: fingers I to B, thumb F, Force perpendicular to both current and field, Net force on closed loop in uniform B is zero.",
        "context": "The magnetic force on a current-carrying wire results from the sum of forces on individual moving charges within the wire, with the net force depending on the wire's orientation relative to the magnetic field.",
        "image": {
          "url": "images/wire-force-fundamentals.png",
          "alt": "Wire force fundamentals",
          "caption": "Force on straight wire and direction rules"
        }
      },

      "classifications": [
        {
          "type": "Wire Force Configurations",
          "value": "Classification based on wire geometry and field orientation",
          "characteristics": [
            "Straight wires in uniform fields",
            "Angled wires relative to field",
            "Multiple parallel wires",
            "Curved wire segments",
            "Closed loops in uniform fields",
            "Wires in non-uniform fields"
          ],
          "behavior": "Different configurations produce characteristic forces: straight wires experience translational force; angled wires have reduced force; parallel wires attract/repel; curved segments require integration; closed loops have zero net force but may have torque; non-uniform fields can produce net force on loops",
          "examples": [
            {
              "process": "Straight Wire Force Calculation",
              "explanation": "A straight current-carrying wire in uniform magnetic field experiences force F = ILBsinθ, with direction perpendicular to both wire and field given by right-hand rule",
              "image": {
                "url": "images/straight-wire-force.png",
                "alt": "Straight wire force calculation",
                "caption": "Force on straight current-carrying wire"
              }
            },
            {
              "process": "Parallel Wire Interaction",
              "explanation": "Two parallel current-carrying wires exert magnetic forces on each other: attractive for same current direction, repulsive for opposite directions, with force per unit length F/L = μ₀I₁I₂/(2πd)",
              "image": {
                "url": "images/parallel-wires.png",
                "alt": "Parallel wire interaction",
                "caption": "Force between parallel current-carrying wires"
              }
            }
          ],
          "note": "The force on a wire segment is the vector sum of forces on all charge carriers. For straight wires in uniform B, the force is the same as if all current were concentrated at the center. The right-hand rule gives force direction for conventional current (positive charge flow). For curved wires, integration is needed. In uniform fields, closed loops experience zero net force but may experience torque."
        }
      ],

      "principles": [
        {
          "principle": "Right-Hand Rule for Wire Forces",
          "statement": "The direction of magnetic force on a current-carrying wire is determined by the right-hand rule for cross products: Point fingers in direction of conventional current I, Curl fingers toward magnetic field direction B, Thumb points in direction of magnetic force F. This rule applies to: (1) Straight wires: F = I(L × B), where L is vector along wire in current direction, (2) Curved wires: integrate dF = I(dl × B) over wire path, (3) Current loops: different segments experience different force directions, (4) Multiple wires: determine force direction between parallel or angled conductors. Important considerations: For electron flow (negative charges), force direction is opposite to right-hand rule. The force is always perpendicular to both current direction and magnetic field. For maximum force, current should be perpendicular to magnetic field. This rule enables quick determination of force directions in motors, instruments, and various electromagnetic devices.",
          "application": "Determine force directions in motor designs. Analyze wire motion in magnetic fields. Understand galvanometer operation. Design electromagnetic actuators. Solve problems involving multiple current-carrying conductors. Predict wire deflection in magnetic fields.",
          "example": "Wire carrying current north in eastward magnetic field: fingers north, curl east → thumb points up (force upward)",
          "analogy": "Like determining the direction a screw would move when turned - current direction is rotation, field direction is axis, force is screw motion",
          "image": {
            "url": "images/wire-right-hand-rule.png",
            "alt": "Right-hand rule for wire forces",
            "caption": "Force direction determination for current-carrying wires"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Straight Wire Force Calculation",
          "problem": "A 0.5 m long straight wire carries 4 A current oriented 30° to 0.8 T uniform magnetic field. Calculate: (a) Force magnitude, (b) Force direction using right-hand rule, (c) Maximum possible force for this I and B.",
          "step_by_step": [
            {
              "step": "Force magnitude formula",
              "explanation": "F = ILBsinθ = (4)(0.5)(0.8)sin30°"
            },
            {
              "step": "Numerical calculation",
              "explanation": "F = (4)(0.5)(0.8)(0.5) = 0.8 N"
            },
            {
              "step": "Direction determination",
              "explanation": "Right-hand rule: point fingers in I direction, curl toward B, thumb gives F perpendicular to both"
            },
            {
              "step": "Maximum force condition",
              "explanation": "Maximum when θ=90°: F_max = ILB = (4)(0.5)(0.8) = 1.6 N"
            },
            {
              "step": "Comparison",
              "explanation": "Current force is 50% of maximum due to 30° angle"
            }
          ],
          "final_answer": "(a) Force magnitude: 0.8 N, (b) Direction perpendicular to both wire and field (specific direction depends on orientations), (c) Maximum force: 1.6 N when wire perpendicular to field.",
          "concept_applied": "Straight wire force calculation",
          "image": {
            "url": "images/straight-wire-example.png",
            "alt": "Straight wire force example",
            "caption": "Force calculation for angled wire"
          }
        },
        {
          "title": "Parallel Wire Force Analysis",
          "problem": "Two long parallel wires 10 cm apart carry 5 A currents. Find force per unit length when: (a) Currents same direction, (b) Currents opposite directions, (c) Force direction in each case.",
          "step_by_step": [
            {
              "step": "Force per unit length formula",
              "explanation": "F/L = μ₀I₁I₂/(2πd) = (4π×10⁻⁷)(5)(5)/[2π(0.1)]"
            },
            {
              "step": "Numerical calculation",
              "explanation": "F/L = (4π×10⁻⁷)(25)/(0.2π) = (100π×10⁻⁷)/(0.2π) = 5×10⁻⁴ N/m"
            },
            {
              "step": "Same direction currents",
              "explanation": "Wires attract each other with 5×10⁻⁴ N/m force"
            },
            {
              "step": "Opposite direction currents",
              "explanation": "Wires repel with same magnitude 5×10⁻⁴ N/m"
            },
            {
              "step": "Direction verification",
              "explanation": "Right-hand rule: for parallel currents, magnetic fields between wires are opposite, causing attraction. For anti-parallel, fields reinforce between wires, causing repulsion"
            }
          ],
          "final_answer": "(a) Same direction: attractive force 5×10⁻⁴ N/m, (b) Opposite directions: repulsive force 5×10⁻⁴ N/m, (c) Directions: toward each other (attraction) or away (repulsion).",
          "concept_applied": "Parallel wire force interaction",
          "image": {
            "url": "images/parallel-wire-example.png",
            "alt": "Parallel wire force example",
            "caption": "Force between parallel current-carrying wires"
          }
        }
      ]
    },
    {
      "section_title": "2. Current Loops and Torque Applications",
      "introduction": "Analysis of magnetic forces on current loops, torque calculations, applications to electric motors and measuring instruments, and the concept of magnetic moment.",

      "key_concept": {
        "definition": "Current loop physics: Net force on closed loop in uniform B is zero, Torque $\\vec{\\tau} = \\vec{\\mu} \\times \\vec{B}$, Magnetic moment $\\vec{\\mu} = NI\\vec{A}$, Magnitude $\\tau = \\mu B\\sin\\theta$, Motor principle $\\tau = NIAB\\sin\\theta$, Galvanometer operation, Loop equilibrium at θ=0° or 180°, Potential energy $U = -\\vec{\\mu} \\cdot \\vec{B}$.",
        "context": "Current loops experience torque that tends to align their magnetic moment with the external field, enabling the operation of electric motors and various measuring instruments.",
        "image": {
          "url": "images/current-loop-physics.png",
          "alt": "Current loop physics",
          "caption": "Torque on current loop and magnetic moment"
        }
      },

      "classifications": [
        {
          "type": "Current Loop Configurations",
          "value": "Classification based on loop geometry and application",
          "characteristics": [
            "Rectangular current loops",
            "Circular current loops",
            "Solenoids as loop arrays",
            "Multi-turn coils",
            "Moving coil instruments",
            "Electric motor armatures"
          ],
          "behavior": "Different loop configurations exhibit characteristic behavior: rectangular loops have simple torque calculation; circular loops have same torque formula; solenoids behave like bar magnets; multi-turn coils have enhanced magnetic moment; moving coil instruments measure current; motor armatures convert electrical to mechanical energy",
          "examples": [
            {
              "process": "Rectangular Loop Torque",
              "explanation": "A rectangular current loop in magnetic field experiences equal but opposite forces on opposite sides, creating torque τ = NIABsinθ that tends to align the loop with the field",
              "image": {
                "url": "images/rectangular-loop-torque.png",
                "alt": "Rectangular loop torque",
                "caption": "Torque on rectangular current loop"
              }
            },
            {
              "process": "Galvanometer Operation",
              "explanation": "A current-carrying coil in radial magnetic field experiences torque proportional to current, with restoring spring providing counter-torque, enabling current measurement",
              "image": {
                "url": "images/galvanometer-operation.png",
                "alt": "Galvanometer operation",
                "caption": "Current measurement using magnetic torque"
              }
            }
          ],
          "note": "The magnetic moment μ = NIA is a vector perpendicular to the loop plane (right-hand rule: fingers in current direction, thumb gives μ direction). Torque is maximum when μ⟂B and zero when μ∥B. Stable equilibrium at θ=0° (μ parallel to B), unstable at θ=180° (μ anti-parallel to B). In non-uniform fields, loops may experience net force. Multi-turn coils multiply the magnetic moment by N."
        }
      ],

      "principles": [
        {
          "principle": "Magnetic Torque and Motor Action",
          "statement": "Current loops in magnetic fields experience torque given by $\\vec{\\tau} = \\vec{\\mu} \\times \\vec{B}$, where $\\vec{\\mu} = NI\\vec{A}$ is the magnetic moment. This torque: (1) Tends to align the magnetic moment with the external field, (2) Has magnitude τ = μBsinθ, maximum when loop plane parallel to field (θ=90°), (3) Is zero when loop plane perpendicular to field (θ=0° or 180°), (4) Does work to rotate the loop, changing its orientation energy. Electric motors exploit this principle: Commutators reverse current direction as the loop passes through alignment, maintaining torque in same rotational direction. Galvanometers use this torque for current measurement, with springs providing restoring torque. The potential energy U = -μ·B = -μBcosθ is minimum at stable alignment (μ∥B) and maximum at anti-alignment (μ anti-parallel to B). This torque principle enables conversion between electrical and mechanical energy in countless devices.",
          "application": "Design electric motors and generators. Calculate torque on current loops. Analyze galvanometer and ammeter operation. Understand magnetic moment alignment. Design electromagnetic actuators. Solve problems involving rotational equilibrium in magnetic fields.",
          "example": "DC motor: rectangular coil with N turns, area A, current I in field B experiences torque τ = NIABsinθ, causing rotation until commutator reverses current",
          "analogy": "Like a compass needle aligning with Earth's field - the magnetic moment experiences torque until it points along the field lines",
          "image": {
            "url": "images/motor-action.png",
            "alt": "Magnetic torque and motor action",
            "caption": "Torque principle in electric motors"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Rectangular Loop Torque Calculation",
          "problem": "A rectangular loop 10 cm × 15 cm with 50 turns carries 2 A current in 0.3 T magnetic field. Find maximum torque and torque when loop makes 30° with field.",
          "step_by_step": [
            {
              "step": "Loop area",
              "explanation": "A = (0.10)(0.15) = 0.015 m²"
            },
            {
              "step": "Magnetic moment",
              "explanation": "μ = NIA = (50)(2)(0.015) = 1.5 A·m²"
            },
            {
              "step": "Maximum torque",
              "explanation": "τ_max = μB = (1.5)(0.3) = 0.45 N·m (when θ=90°)"
            },
            {
              "step": "Torque at 30°",
              "explanation": "τ = μBsinθ = (1.5)(0.3)sin30° = 0.45 × 0.5 = 0.225 N·m"
            },
            {
              "step": "Angle interpretation",
              "explanation": "θ is angle between μ and B, so 30° means loop plane at 60° to field"
            }
          ],
          "final_answer": "Maximum torque: 0.45 N·m, Torque at 30°: 0.225 N·m. The multi-turn coil significantly increases torque compared to single loop.",
          "concept_applied": "Current loop torque calculation",
          "image": {
            "url": "images/loop-torque-example.png",
            "alt": "Loop torque calculation example",
            "caption": "Torque on rectangular current loop"
          }
        },
        {
          "title": "Galvanometer Sensitivity Analysis",
          "problem": "A galvanometer coil has 100 turns, area 2 cm², spring constant k=10⁻⁶ N·m/degree. Calculate: (a) Current for full-scale deflection (90°), (b) Sensitivity in degrees/mA, (c) Effect of doubling turns.",
          "step_by_step": [
            {
              "step": "Torque balance at 90°",
              "explanation": "Magnetic torque = spring torque: NIAB = kθ_max"
            },
            {
              "step": "Current calculation",
              "explanation": "I = kθ_max/(NAB) = (10⁻⁶)(90)/[(100)(2×10⁻⁴)(0.1)] = 9×10⁻⁵/0.002 = 0.045 A"
            },
            {
              "step": "Sensitivity calculation",
              "explanation": "For small angles, θ ∝ I, sensitivity = θ_max/I_max = 90°/0.045A = 2000°/A = 2°/mA"
            },
            {
              "step": "Doubling turns effect",
              "explanation": "I ∝ 1/N for same deflection, so current halved to 22.5 mA for full scale, sensitivity doubles to 4°/mA"
            },
            {
              "step": "Practical consideration",
              "explanation": "Radial magnetic field ensures constant torque regardless of coil position"
            }
          ],
          "final_answer": "(a) Full-scale current: 45 mA, (b) Sensitivity: 2°/mA, (c) Doubling turns halves current requirement and doubles sensitivity to 4°/mA.",
          "concept_applied": "Galvanometer design analysis",
          "image": {
            "url": "images/galvanometer-analysis.png",
            "alt": "Galvanometer sensitivity analysis",
            "caption": "Current measurement using magnetic torque"
          }
        }
      ]
    },
    {
      "section_title": "3. Applications and Advanced Systems",
      "introduction": "Practical applications of magnetic forces on current-carrying conductors, including electric motors, loudspeakers, mass spectrometers, and advanced electromagnetic systems.",

      "key_concept": {
        "definition": "Applications: DC motors and generators, Loudspeakers and headphones, Galvanometers and ammeters, Mass spectrometer ion sources, Electromagnetic pumps, Maglev trains, Particle beam steering, Circuit breakers, Current balances, Force measurement devices.",
        "context": "Magnetic forces on current-carrying conductors enable numerous technological applications from everyday devices to advanced scientific instruments, converting electrical energy to mechanical motion or force.",
        "image": {
          "url": "images/wire-force-applications.png",
          "alt": "Wire force applications",
          "caption": "Technological applications of magnetic forces on conductors"
        }
      },

      "classifications": [
        {
          "type": "Magnetic Force Applications",
          "value": "Classification based on application principle and device function",
          "characteristics": [
            "Energy conversion devices",
            "Measurement instruments",
            "Actuation and control systems",
            "Particle manipulation devices",
            "Fluid pumping systems",
            "Transportation systems"
          ],
          "behavior": "Different applications exploit specific aspects: motors convert electrical to mechanical energy; instruments measure current or force; actuators provide controlled motion; spectrometers separate particles; pumps move conducting fluids; maglev trains provide levitation",
          "examples": [
            {
              "process": "DC Motor Operation",
              "explanation": "Current-carrying coils in magnetic field experience torque, with commutator reversing current direction to maintain rotation, converting electrical energy to mechanical work",
              "image": {
                "url": "images/dc-motor-operation.png",
                "alt": "DC motor operation",
                "caption": "Torque production in electric motors"
              }
            },
            {
              "process": "Loudspeaker Mechanism",
              "explanation": "Voice coil carrying audio current in permanent magnet field experiences oscillating force, causing diaphragm vibration that produces sound waves",
              "image": {
                "url": "images/loudspeaker-mechanism.png",
                "alt": "Loudspeaker mechanism",
                "caption": "Sound production using magnetic forces"
              }
            }
          ],
          "note": "DC motors use split-ring commutators for continuous rotation. Loudspeakers require linear force proportional to current. Galvanometers use delicate suspensions for high sensitivity. Mass spectrometers use magnetic forces to separate ions. Electromagnetic pumps move liquid metals without moving parts. Maglev trains use repulsive forces for levitation. Current balances measure current via force calibration."
        }
      ],

      "principles": [
        {
          "principle": "Electric Motor Design Principles",
          "statement": "Electric motors convert electrical energy to mechanical rotation using magnetic forces on current-carrying conductors. Key design principles: (1) Torque Production: τ = NIABsinθ for each coil, maximized by strong magnetic fields, high current, and multiple turns, (2) Commutation: Brushes and commutator reverse current direction as coils pass through alignment, maintaining torque in same direction, (3) Armature Design: Multiple coils distributed around rotor provide smoother torque, (4) Field Configuration: Permanent magnets or electromagnets create magnetic field, with various geometries (radial, axial), (5) Back EMF: Rotating coils generate voltage opposing applied voltage, limiting current at high speed, (6) Efficiency Optimization: Minimizing resistive losses, eddy currents, and friction. DC Motors: Simple construction, easy speed control. AC Motors: No commutator, self-starting in some designs. Stepper Motors: Precise position control. Universal Motors: Work on AC or DC. Understanding these principles enables motor design for specific applications including industrial drives, automotive systems, and precision instruments.",
          "application": "Design electric motors for specific torque requirements. Calculate motor performance parameters. Understand motor speed control methods. Analyze motor efficiency and losses. Design motor control circuits. Solve problems involving motor operation under load.",
          "example": "Small DC motor: 4-pole permanent magnet field, 12-slot armature with wave winding, rated 12V, 2A, 3000 RPM with 0.1 N·m torque",
          "analogy": "Like rowing a boat - the oars (coils) push against water (magnetic field) to propel the boat, with oars reversing direction at each stroke (commutation)",
          "image": {
            "url": "images/motor-design.png",
            "alt": "Electric motor design principles",
            "caption": "Key elements in electric motor design"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "DC Motor Design Calculation",
          "problem": "Design a simple DC motor to produce 0.5 N·m torque at 1800 RPM. Available: magnetic field 0.4 T, maximum current 5 A, coil area 50 cm². Find: (a) Required number of turns, (b) Power input, (c) Mechanical power output.",
          "step_by_step": [
            {
              "step": "Torque formula",
              "explanation": "τ = NIAB (assuming sinθ=1 for maximum torque)"
            },
            {
              "step": "Number of turns calculation",
              "explanation": "N = τ/(IAB) = 0.5/[(5)(0.005)(0.4)] = 0.5/0.01 = 50 turns"
            },
            {
              "step": "Angular speed",
              "explanation": "ω = 1800 RPM × 2π/60 = 188.5 rad/s"
            },
            {
              "step": "Mechanical power",
              "explanation": "P_mech = τω = (0.5)(188.5) = 94.25 W"
            },
            {
              "step": "Electrical power input",
              "explanation": "P_elec = VI, but V depends on back EMF. Assuming 80% efficiency, P_elec ≈ 94.25/0.8 = 118 W"
            },
            {
              "step": "Practical considerations",
              "explanation": "Need commutator, multiple coils for smooth operation, cooling for 5 A current"
            }
          ],
          "final_answer": "(a) 50 turns needed, (b) Electrical power input ~118 W, (c) Mechanical power output 94 W. This represents a small industrial motor.",
          "concept_applied": "DC motor design calculation",
          "image": {
            "url": "images/motor-design-example.png",
            "alt": "DC motor design example",
            "caption": "Motor parameter calculation from torque requirements"
          }
        },
        {
          "title": "Loudspeaker Force Analysis",
          "problem": "A loudspeaker voice coil has 100 turns, length 5 cm, diameter 2 cm, in 1 T radial magnetic field. Calculate: (a) Force per ampere, (b) Peak force for 2 A peak current, (c) Cone acceleration if moving mass=10 g.",
          "step_by_step": [
            {
              "step": "Force formula for straight wire",
              "explanation": "F = NILB for voice coil in radial field"
            },
            {
              "step": "Force per ampere",
              "explanation": "F/I = NLB = (100)(0.05)(1) = 5 N/A"
            },
            {
              "step": "Peak force",
              "explanation": "F_peak = (F/I) × I_peak = 5 × 2 = 10 N"
            },
            {
              "step": "Peak acceleration",
              "explanation": "a = F/m = 10/0.01 = 1000 m/s² (about 100 g)"
            },
            {
              "step": "Audio frequency response",
              "explanation": "This high acceleration enables good high-frequency response, though actual response limited by suspension and air loading"
            }
          ],
          "final_answer": "(a) Force sensitivity: 5 N/A, (b) Peak force: 10 N, (c) Peak acceleration: 1000 m/s² (100 g). Enables good audio reproduction across frequency range.",
          "concept_applied": "Loudspeaker force analysis",
          "image": {
            "url": "images/loudspeaker-analysis.png",
            "alt": "Loudspeaker force analysis",
            "caption": "Voice coil forces in loudspeaker operation"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Magnetic force on wire",
    "Right-hand rule",
    "Current loop",
    "Magnetic moment",
    "Torque",
    "Motor principle",
    "Galvanometer",
    "Commutator",
    "Voice coil",
    "Parallel wire force"
  ],

  "common_misconceptions": [
    "Thinking magnetic forces can do net work on closed current loops",
    "Believing all parts of a current loop experience force in same direction",
    "Confusing torque direction on current loops",
    "Thinking magnetic forces require moving wires",
    "Believing parallel wires always attract",
    "Confusing magnetic moment direction with current direction"
  ],

  "real_world_applications": [
    "Electric motors and generators",
    "Loudspeakers and headphones",
    "Galvanometers and analog meters",
    "Mass spectrometer ion sources",
    "Electromagnetic relays and actuators",
    "Maglev transportation systems",
    "Circuit breakers and protection devices",
    "Current balances for calibration",
    "Particle beam steering magnets",
    "Magnetic pumping of liquid metals"
  ],

  "summary": "Current-carrying wires experience magnetic forces F = ILBsinθ, with direction given by right-hand rule. Parallel wires attract for same current direction, repel for opposite directions. Current loops experience zero net force in uniform fields but experience torque τ = μ × B, where μ = NIA is the magnetic moment. This torque tends to align μ with B, with maximum torque when μ⟂B. Applications include: electric motors (converting electrical to mechanical energy), galvanometers (current measurement), loudspeakers (sound production), and various electromagnetic devices. The principles enable precise control of mechanical motion using electrical currents and magnetic fields, forming the basis for numerous technologies from household appliances to scientific instruments."
}