
{
  "topic": "5.1 Magnetic Field Definition",
  "unit_title": "Magnetic Fields and Forces",
  "unit_number": "Unit 5.1",
  "grade_level": "Grade 12",
  "subject": "Physics",
  "duration": "3-4 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "Comprehensive introduction to magnetic fields, including field definition, visualization methods, sources of magnetic fields, and the fundamental differences between electric and magnetic phenomena. Covers historical context, field mapping techniques, and basic magnetic properties of materials.",

  "learning_objectives": [
    "Define magnetic field and understand its vector nature",
    "Visualize magnetic fields using field lines and patterns",
    "Identify natural and artificial sources of magnetic fields",
    "Distinguish between electric and magnetic phenomena",
    "Apply right-hand rules for field direction determination",
    "Calculate basic magnetic field strengths for simple configurations"
  ],

  "prerequisites": [
    "Vector mathematics and coordinate systems",
    "Electric field concepts and visualization",
    "Basic atomic structure knowledge",
    "Force and motion principles",
    "Scientific notation and unit conversions"
  ],

  "core_concept": {
    "principle": "Magnetic field definition: $\\vec{B}$ is a vector field that exerts force on moving charges and magnetic materials. Units: tesla (T) or gauss (1 T = 10⁴ G). Field lines: continuous loops from N to S pole externally, no magnetic monopoles. Right-hand rules determine field directions around currents.",
    "explanation": "Magnetic fields are produced by moving charges (currents) and magnetic materials, and exert forces on other moving charges and magnetic materials. Unlike electric fields, magnetic field lines form continuous loops with no starting or ending points.",
    "image": {
      "url": "images/magnetic-field-core.png",
      "alt": "Magnetic field definition and properties",
      "caption": "Magnetic field lines and fundamental properties"
    }
  },

  "sections": [
    {
      "section_title": "1. Fundamental Concepts and Field Visualization",
      "introduction": "Introduction to magnetic fields as vector fields, visualization techniques using field lines, and comparison with electric fields to establish foundational understanding.",

      "key_concept": {
        "definition": "Magnetic field fundamentals: Vector field $\\vec{B}$, Field strength measured in tesla (T), 1 T = 1 N/(A·m), Earth's field ~50 μT, refrigerator magnet ~5 mT, MRI ~1-3 T, Field lines: density indicates strength, direction tangent to field, form continuous loops, no monopoles, Right-hand rules for current-field relationships.",
        "context": "Magnetic fields represent the magnetic influence in space, visualized through field patterns that reveal both direction and relative strength of magnetic effects.",
        "image": {
          "url": "images/magnetic-fundamentals.png",
          "alt": "Magnetic field fundamentals",
          "caption": "Basic magnetic field properties and visualization"
        }
      },

      "classifications": [
        {
          "type": "Magnetic Field Sources",
          "value": "Classification based on origin and characteristics of magnetic fields",
          "characteristics": [
            "Permanent magnets",
            "Current-carrying wires",
            "Electromagnets",
            "Earth's magnetic field",
            "Atomic-scale currents",
            "Time-varying electric fields"
          ],
          "behavior": "Different sources produce characteristic field patterns: permanent magnets have dipole fields; straight wires produce circular fields; solenoids create uniform internal fields; Earth approximates a dipole; atomic currents explain material magnetism; changing electric fields produce magnetic fields",
          "examples": [
            {
              "process": "Bar Magnet Field Pattern",
              "explanation": "Permanent magnets exhibit dipole fields with lines emerging from north pole, entering south pole externally, and completing loops through the magnet, with field strength strongest near poles",
              "image": {
                "url": "images/bar-magnet-field.png",
                "alt": "Bar magnet field pattern",
                "caption": "Dipole field pattern of permanent magnets"
              }
            },
            {
              "process": "Straight Wire Magnetic Field",
              "explanation": "Current-carrying straight wire produces concentric circular field lines around wire, with direction given by right-hand rule: thumb in current direction, fingers curl in field direction",
              "image": {
                "url": "images/wire-field.png",
                "alt": "Straight wire magnetic field",
                "caption": "Circular field around current-carrying wire"
              }
            }
          ],
          "note": "Magnetic field lines always form closed loops - no magnetic monopoles exist. Field line density indicates field strength. The direction of magnetic field is defined as the direction a compass needle points (toward geographic north). Right-hand rules consistently relate current directions to field directions. Magnetic fields do no work on charges since magnetic force is always perpendicular to velocity."
        }
      ],

      "principles": [
        {
          "principle": "Magnetic Field Line Properties",
          "statement": "Magnetic field lines provide a powerful visualization tool with specific properties: (1) They are continuous, forming closed loops with no beginning or end, (2) The tangent to a field line at any point gives the direction of the magnetic field $\\vec{B}$ at that point, (3) The density of field lines (number per unit area perpendicular to the field) indicates the magnitude of the magnetic field, (4) Field lines never cross - each point in space has a unique field direction, (5) In regions of uniform field, lines are parallel and equally spaced, (6) Field lines emerge from north poles and enter south poles of magnets, but always complete their path through the magnet. These properties distinguish magnetic field lines from electric field lines, which begin on positive charges and end on negative charges. The continuous nature of magnetic field lines reflects the absence of magnetic monopoles. Field line patterns provide immediate qualitative understanding of field behavior in different regions.",
          "application": "Visualize magnetic field patterns from various sources. Estimate relative field strengths from line density. Predict compass needle behavior in magnetic fields. Design magnetic systems using field line patterns. Understand magnetic shielding principles. Analyze complex field configurations qualitatively.",
          "example": "Bar magnet: dense field lines near poles indicate strong fields, spreading lines between poles show field weakening with distance. Solenoid: parallel, equally spaced lines inside indicate uniform field",
          "analogy": "Like flow lines of an incompressible fluid - continuous, never starting or stopping, with density indicating flow speed",
          "image": {
            "url": "images/field-line-properties.png",
            "alt": "Magnetic field line properties",
            "caption": "Characteristic properties of magnetic field lines"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Field Direction Determination",
          "problem": "Determine the magnetic field direction for: (a) Straight wire with current upward, (b) Circular loop with clockwise current, (c) Solenoid with current as shown, (d) Bar magnet with N pole on left.",
          "step_by_step": [
            {
              "step": "Straight wire right-hand rule",
              "explanation": "Thumb in current direction (up), fingers curl showing field circles wire counterclockwise when viewed from above"
            },
            {
              "step": "Circular loop rule",
              "explanation": "Curl fingers in current direction (clockwise), thumb points in field direction through loop - into page for clockwise loop"
            },
            {
              "step": "Solenoid rule",
              "explanation": "Curl fingers in current direction around coils, thumb points toward north pole of solenoid"
            },
            {
              "step": "Bar magnet convention",
              "explanation": "Field lines emerge from N pole, enter S pole, so from left N pole, field points away from magnet to right"
            }
          ],
          "final_answer": "(a) Concentric circles counterclockwise, (b) Into page at center, (c) Depends on winding direction - use right-hand rule, (d) From left to right away from N pole",
          "concept_applied": "Right-hand rules and field direction",
          "image": {
            "url": "images/field-direction-examples.png",
            "alt": "Field direction examples",
            "caption": "Applying right-hand rules to various configurations"
          }
        },
        {
          "title": "Field Strength Comparison",
          "problem": "Compare magnetic field strengths: (a) Earth's surface ~50 μT, (b) Refrigerator magnet ~5 mT, (c) Small electromagnet ~0.1 T, (d) MRI machine ~3 T. Convert all to tesla and order by strength.",
          "step_by_step": [
            {
              "step": "Unit conversions",
              "explanation": "50 μT = 50×10⁻⁶ T = 5×10⁻⁵ T, 5 mT = 5×10⁻³ T, 0.1 T = 0.1 T, 3 T = 3 T"
            },
            {
              "step": "Order by strength",
              "explanation": "Earth (5×10⁻⁵ T) < Refrigerator magnet (5×10⁻³ T) < Electromagnet (0.1 T) < MRI (3 T)"
            },
            {
              "step": "Ratio calculations",
              "explanation": "MRI is 60,000× stronger than Earth's field, electromagnet is 2,000× stronger"
            },
            {
              "step": "Practical significance",
              "explanation": "Different applications require different field strengths: navigation vs holding vs medical imaging"
            }
          ],
          "final_answer": "Order from weakest to strongest: Earth (50 μT) < Refrigerator magnet (5 mT) < Electromagnet (0.1 T) < MRI (3 T). MRI field is 60,000× stronger than Earth's field.",
          "concept_applied": "Magnetic field units and comparisons",
          "image": {
            "url": "images/field-strength-comparison.png",
            "alt": "Field strength comparison",
            "caption": "Relative strengths of common magnetic fields"
          }
        }
      ]
    },
    {
      "section_title": "2. Magnetic Field Sources and Calculations",
      "introduction": "Analysis of magnetic field sources including currents and magnetic materials, with quantitative calculations for simple geometries and understanding of field superposition.",

      "key_concept": {
        "definition": "Field sources and calculations: Biot-Savart Law $d\\vec{B} = \\frac{\\mu_0}{4\\pi}\\frac{I d\\vec{l} \\times \\hat{r}}{r^2}$, Straight wire $B = \\frac{\\mu_0 I}{2\\pi r}$, Circular loop center $B = \\frac{\\mu_0 I}{2R}$, Solenoid $B = \\mu_0 nI$, $\\mu_0 = 4\\pi \\times 10^{-7}$ T·m/A, Field superposition $\\vec{B}_{total} = \\sum \\vec{B}_i$, Right-hand rules for direction.",
        "context": "Magnetic fields originate from moving charges, with field strength depending on current magnitude, geometry, and distance from source. Superposition allows calculation of complex field patterns.",
        "image": {
          "url": "images/field-sources.png",
          "alt": "Magnetic field sources and calculations",
          "caption": "Field calculations for common current configurations"
        }
      },

      "classifications": [
        {
          "type": "Current Configuration Fields",
          "value": "Classification based on current geometry and resulting field patterns",
          "characteristics": [
            "Straight wire fields",
            "Circular loop fields",
            "Solenoid and toroid fields",
            "Multiple wire systems",
            "Complex current distributions",
            "Moving point charge fields"
          ],
          "behavior": "Different current geometries produce characteristic fields: straight wires give 1/r dependence; loops give dipole-like patterns; solenoids create uniform internal fields; multiple wires superposition fields; complex distributions require integration; moving charges produce circular fields",
          "examples": [
            {
              "process": "Solenoid Magnetic Field",
              "explanation": "Long coil with closely spaced turns produces nearly uniform magnetic field inside parallel to axis, with field strength B = μ₀nI where n is turns per meter, and weak external field similar to bar magnet",
              "image": {
                "url": "images/solenoid-field.png",
                "alt": "Solenoid magnetic field",
                "caption": "Uniform field inside long solenoid"
              }
            },
            {
              "process": "Multiple Wire Superposition",
              "explanation": "Magnetic field from multiple current-carrying wires found by vector sum of individual fields, with cancellation or reinforcement depending on current directions and positions",
              "image": {
                "url": "images/multiple-wires.png",
                "alt": "Multiple wire superposition",
                "caption": "Vector addition of fields from multiple sources"
              }
            }
          ],
          "note": "The Biot-Savart Law provides the fundamental relationship for calculating magnetic fields from current elements. For symmetric configurations, Ampere's Law offers simpler calculations. Field direction always follows right-hand rules relative to current direction. The permeability constant μ₀ determines the strength of magnetic fields produced by currents. Real solenoids have end effects that reduce field uniformity near ends."
        }
      ],

      "principles": [
        {
          "principle": "Superposition of Magnetic Fields",
          "statement": "The magnetic field produced by multiple sources equals the vector sum of the fields produced by each source individually: $\\vec{B}_{total} = \\vec{B}_1 + \\vec{B}_2 + \\vec{B}_3 + \\cdots$. This superposition principle applies to all magnetic field sources including currents, permanent magnets, and any combination thereof. Key aspects: (1) Each source contributes independently to the total field, (2) Vector addition must account for both magnitude and direction, (3) Fields can reinforce or cancel depending on relative directions, (4) The principle enables calculation of complex field patterns by breaking them into simpler components, (5) Superposition works because magnetic fields linear in their sources (for non-magnetic materials). This principle is fundamental to understanding and designing magnetic systems, from simple two-wire configurations to complex electromagnet arrays. It also explains how Earth's magnetic field interacts with local fields from magnets or currents.",
          "application": "Calculate fields from complex current distributions. Design magnetic field configurations using multiple sources. Understand field cancellation in twisted pair wires. Analyze magnetic shielding effectiveness. Solve problems with combined permanent and electromagnets. Predict compass deviations near multiple sources.",
          "example": "Two parallel wires with equal currents in same direction: fields between wires oppose and partially cancel, fields outside reinforce. Opposite currents: fields between reinforce, outside cancel",
          "analogy": "Like multiple sound sources - the total sound pattern results from superposition of waves from each source, with interference creating regions of reinforcement and cancellation",
          "image": {
            "url": "images/field-superposition.png",
            "alt": "Magnetic field superposition",
            "caption": "Vector addition of fields from multiple sources"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Straight Wire Field Calculation",
          "problem": "A long straight wire carries 5.0 A current. Calculate magnetic field at points: (a) 2.0 cm from wire, (b) 5.0 cm from wire, (c) Where field equals Earth's field (50 μT).",
          "step_by_step": [
            {
              "step": "Magnetic field formula",
              "explanation": "B = μ₀I/(2πr) = (4π×10⁻⁷)(5.0)/(2πr) = (1×10⁻⁶)/r T"
            },
            {
              "step": "2.0 cm calculation",
              "explanation": "r = 0.02 m, B = 1×10⁻⁶/0.02 = 5×10⁻⁵ T = 50 μT"
            },
            {
              "step": "5.0 cm calculation",
              "explanation": "r = 0.05 m, B = 1×10⁻⁶/0.05 = 2×10⁻⁵ T = 20 μT"
            },
            {
              "step": "Equal to Earth's field",
              "explanation": "Set B = 50×10⁻⁶ T, so 1×10⁻⁶/r = 50×10⁻⁶, r = 0.02 m = 2.0 cm"
            },
            {
              "step": "Direction",
              "explanation": "Right-hand rule: thumb in current direction, fingers curl showing field direction"
            }
          ],
          "final_answer": "(a) 50 μT at 2.0 cm, (b) 20 μT at 5.0 cm, (c) Field equals Earth's at 2.0 cm from wire",
          "concept_applied": "Straight wire magnetic field calculation",
          "image": {
            "url": "images/straight-wire-calculation.png",
            "alt": "Straight wire field calculation",
            "caption": "Field strength vs distance from current-carrying wire"
          }
        },
        {
          "title": "Multiple Wire Field Superposition",
          "problem": "Two parallel wires 10 cm apart carry 4 A currents in opposite directions. Find magnetic field at point P midway between wires.",
          "step_by_step": [
            {
              "step": "Field from left wire",
              "explanation": "Distance = 5 cm = 0.05 m, B_left = μ₀I/(2πr) = (4π×10⁻⁷)(4)/(2π×0.05) = 1.6×10⁻⁵ T"
            },
            {
              "step": "Field from right wire",
              "explanation": "Same distance, same magnitude B_right = 1.6×10⁻⁵ T"
            },
            {
              "step": "Direction analysis",
              "explanation": "Right-hand rule: left wire current into page, field at P circles counterclockwise - up. Right wire current out of page, field circles clockwise - also up"
            },
            {
              "step": "Vector sum",
              "explanation": "Both fields upward, so B_total = 1.6×10⁻⁵ + 1.6×10⁻⁵ = 3.2×10⁻⁵ T upward"
            },
            {
              "step": "Comparison",
              "explanation": "This is 64% of Earth's magnetic field strength"
            }
          ],
          "final_answer": "Magnetic field at midpoint is 32 μT directed upward, twice the field from single wire due to reinforcement.",
          "concept_applied": "Field superposition with multiple wires",
          "image": {
            "url": "images/two-wire-superposition.png",
            "alt": "Two wire superposition",
            "caption": "Field reinforcement between opposite currents"
          }
        }
      ]
    },
    {
      "section_title": "3. Magnetic Materials and Applications",
      "introduction": "Study of magnetic materials, their classification, behavior in magnetic fields, and practical applications of magnetic fields in technology and everyday life.",

      "key_concept": {
        "definition": "Magnetic materials: Ferromagnetic (iron, nickel, cobalt), Paramagnetic (aluminum, oxygen), Diamagnetic (copper, water, bismuth), Magnetic domains and alignment, Curie temperature, Hysteresis loops, Permanent magnets, Electromagnets, Magnetic shielding, Applications: motors, generators, MRI, data storage, compasses.",
        "context": "Materials respond differently to magnetic fields based on their atomic structure and electron configurations, enabling diverse technological applications from data storage to medical imaging.",
        "image": {
          "url": "images/magnetic-materials.png",
          "alt": "Magnetic materials and applications",
          "caption": "Material classification and practical applications"
        }
      },

      "classifications": [
        {
          "type": "Magnetic Material Types",
          "value": "Classification based on magnetic response and atomic mechanisms",
          "characteristics": [
            "Ferromagnetic materials",
            "Paramagnetic materials",
            "Diamagnetic materials",
            "Antiferromagnetic materials",
            "Ferrimagnetic materials",
            "Superparamagnetic materials"
          ],
          "behavior": "Different materials exhibit characteristic responses: ferromagnets strongly attracted, can be permanent magnets; paramagnets weakly attracted; diamagnets weakly repelled; antiferromagnets have canceling atomic moments; ferrimagnets have partial cancellation; superparamagnets are nanoscale ferromagnets",
          "examples": [
            {
              "process": "Ferromagnetic Domain Alignment",
              "explanation": "In ferromagnetic materials, atomic magnetic moments align in regions called domains; external fields cause domain growth and alignment, creating strong magnetization that can persist after field removal",
              "image": {
                "url": "images/magnetic-domains.png",
                "alt": "Magnetic domain alignment",
                "caption": "Domain structure in ferromagnetic materials"
              }
            },
            {
              "process": "Electromagnet Operation",
              "explanation": "Current-carrying coil with ferromagnetic core produces strong magnetic field, with field strength controlled by current and enhanced by core material saturation",
              "image": {
                "url": "images/electromagnet.png",
                "alt": "Electromagnet operation",
                "caption": "Current-controlled magnetic field generation"
              }
            }
          ],
          "note": "Ferromagnetic materials have high permeability and can become permanently magnetized. Paramagnetic materials have weak attraction to magnets. Diamagnetic materials have weak repulsion from magnets. The Curie temperature is where ferromagnetic materials lose their magnetism. Hysteresis describes how magnetization lgs behind applied field. Magnetic shielding uses high-permeability materials to redirect field lines."
        }
      ],

      "principles": [
        {
          "principle": "Magnetic Domains and Hysteresis",
          "statement": "Ferromagnetic materials contain microscopic regions called domains where atomic magnetic moments are aligned. In unmagnetized state, domains are randomly oriented, producing no net magnetization. When external field applied: (1) Domains aligned with field grow at expense of others (domain wall motion), (2) Domains rotate toward field direction, (3) At saturation, all domains aligned. Hysteresis describes how magnetization lags behind applied field: (1) Initial magnetization curve shows how material magnetizes, (2) Remanence (B_r) is magnetization remaining when field removed, (3) Coercivity (H_c) is reverse field needed to demagnetize, (4) Hysteresis loop area represents energy loss per cycle. This behavior enables permanent magnets (high remanence, high coercivity) and transformer cores (low remanence, low coercivity for low losses). Understanding domains and hysteresis is crucial for designing magnetic materials for specific applications.",
          "application": "Select materials for permanent magnets. Design efficient transformer cores. Understand magnetic data storage principles. Predict material behavior in alternating fields. Design magnetic sensors and actuators. Optimize material processing for magnetic properties.",
          "example": "Hard magnetic materials (neodymium): large hysteresis loop, high remanence and coercivity for permanent magnets. Soft magnetic materials (silicon steel): small loop, low losses for transformers",
          "analogy": "Like groups of people - domains are groups facing same direction; applied field makes more people join aligned groups; hysteresis is like resistance to changing direction once committed",
          "image": {
            "url": "images/hysteresis-loop.png",
            "alt": "Magnetic hysteresis loop",
            "caption": "Hysteresis behavior in ferromagnetic materials"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Solenoid Design Calculation",
          "problem": "Design a solenoid to produce 0.1 T magnetic field using: (a) Air core with 1000 turns/m, (b) Iron core with μ/μ₀ = 5000, same current. Find required current for each case.",
          "step_by_step": [
            {
              "step": "Air core formula",
              "explanation": "B = μ₀nI ⇒ I = B/(μ₀n) = 0.1/[(4π×10⁻⁷)(1000)]"
            },
            {
              "step": "Air core current",
              "explanation": "I = 0.1/(1.257×10⁻³) = 79.6 A"
            },
            {
              "step": "Iron core effect",
              "explanation": "With iron core, B = μnI = (μ/μ₀)μ₀nI = 5000 × μ₀nI"
            },
            {
              "step": "Iron core current",
              "explanation": "I = B/(μn) = 0.1/[5000×(4π×10⁻⁷)(1000)] = 0.1/(6.283) = 0.0159 A"
            },
            {
              "step": "Comparison",
              "explanation": "Iron core reduces required current by factor 5000, from 80 A to 16 mA"
            }
          ],
          "final_answer": "(a) Air core: 79.6 A required, (b) Iron core: 15.9 mA required. Iron core reduces current requirement by factor 5000 due to high permeability.",
          "concept_applied": "Solenoid design with different cores",
          "image": {
            "url": "images/solenoid-design.png",
            "alt": "Solenoid design calculation",
            "caption": "Core material effect on magnetic field"
          }
        },
        {
          "title": "Magnetic Shielding Analysis",
          "problem": "A sensitive instrument needs protection from Earth's magnetic field (50 μT). A soft iron shield with μ/μ₀ = 5000 redirects field lines. Explain shielding principle and estimate field reduction inside spherical shell.",
          "step_by_step": [
            {
              "step": "Shielding principle",
              "explanation": "High-permeability material provides easy path for magnetic field lines, diverting them around shielded region"
            },
            {
              "step": "Spherical shell analysis",
              "explanation": "For spherical shell in uniform field, internal field reduced by factor approximately 2μ/(3μ₀) for μ >> μ₀"
            },
            {
              "step": "Field reduction estimate",
              "explanation": "B_inside ≈ B_external × (3μ₀)/(2μ) = 50×10⁻⁶ × 3/(2×5000) = 50×10⁻⁶ × 3/10000 = 1.5×10⁻⁸ T"
            },
            {
              "step": "Practical considerations",
              "explanation": "Real shields have finite thickness and openings, reducing effectiveness. Multiple layers improve shielding."
            }
          ],
          "final_answer": "Spherical iron shield reduces internal field from 50 μT to approximately 15 nT, a reduction factor of about 3300. High permeability material redirects field lines around protected volume.",
          "concept_applied": "Magnetic shielding principles",
          "image": {
            "url": "images/magnetic-shielding.png",
            "alt": "Magnetic shielding analysis",
            "caption": "Field line redirection by high-permeability material"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Magnetic field",
    "Tesla",
    "Right-hand rule",
    "Biot-Savart Law",
    "Permeability",
    "Solenoid",
    "Ferromagnetic",
    "Paramagnetic",
    "Diamagnetic",
    "Magnetic domains",
    "Hysteresis"
  ],

  "common_misconceptions": [
    "Thinking magnetic field lines start and end at poles",
    "Believing magnetic fields can do work on charges",
    "Confusing electric and magnetic field properties",
    "Thinking all metals are magnetic",
    "Believing magnetic fields require contact to exert forces",
    "Confusing field direction with force direction"
  ],

  "real_world_applications": [
    "Electric motors and generators",
    "Magnetic resonance imaging (MRI)",
    "Magnetic data storage (hard drives)",
    "Compass navigation",
    "Particle accelerators",
    "Magnetic levitation trains",
    "Transformers and inductors",
    "Magnetic sensors",
    "Loudspeakers and microphones",
    "Magnetic separation processes"
  ],

  "summary": "Magnetic fields ($\\vec{B}$) are vector fields produced by moving charges and magnetic materials, measured in tesla. Field lines form continuous loops with density indicating strength. Right-hand rules relate current directions to field directions. Calculations use Biot-Savart Law for general cases or simplified formulas for symmetric configurations (straight wire: B = μ₀I/2πr, solenoid: B = μ₀nI). Materials classify as ferromagnetic (strongly attracted), paramagnetic (weakly attracted), or diamagnetic (weakly repelled). Ferromagnetic materials exhibit domains and hysteresis. Applications range from everyday magnets to advanced technologies like MRI and data storage. Magnetic fields exert forces on moving charges and other magnetic materials, but unlike electric fields, do no work and always form closed loops."
}