
{
  "topic": "6.2 RC Circuits",
  "unit_title": "RC Circuit Analysis and Applications",
  "unit_number": "Unit 6.2",
  "grade_level": "Grade 12",
  "subject": "Physics",
  "duration": "2-3 hours",
  "difficulty_level": "intermediate",
  "expanded_description": "Comprehensive study of RC circuits including charging and discharging behavior, time constant analysis, transient response, and practical applications in timing, filtering, and signal processing circuits. Builds on DC circuit fundamentals to analyze dynamic circuit behavior.",

  "learning_objectives": [
    "Analyze RC circuit charging and discharging behavior",
    "Calculate time constants and predict circuit response times",
    "Solve for voltage and current as functions of time in RC circuits",
    "Design RC timing circuits for specific delay requirements",
    "Analyze RC filters and understand their frequency response",
    "Apply RC circuit principles to practical electronic applications"
  ],

  "prerequisites": [
    "DC circuit fundamentals (Ohm's Law, Kirchhoff's Laws)",
    "Series and parallel circuit analysis",
    "Exponential functions and natural logarithms",
    "Basic capacitor properties and charging behavior",
    "Algebra and equation solving skills"
  ],

  "core_concept": {
    "principle": "RC Circuit Fundamentals: Time constant $\\tau = RC$, Charging: $V_C(t) = V_0(1 - e^{-t/\\tau})$, $I(t) = \\frac{V_0}{R}e^{-t/\\tau}$, Discharging: $V_C(t) = V_0e^{-t/\\tau}$, $I(t) = -\\frac{V_0}{R}e^{-t/\\tau}$, 5τ for full charge/discharge, Instantaneous rates determined by time constant.",
    "explanation": "RC circuits exhibit exponential charging and discharging behavior characterized by the time constant τ=RC, which determines how quickly the circuit responds to voltage changes and forms the basis for timing, filtering, and wave-shaping applications.",
    "image": {
      "url": "images/rc-circuit-core.png",
      "alt": "RC circuit fundamental concepts",
      "caption": "Charging and discharging behavior in RC circuits"
    }
  },

  "sections": [
    {
      "section_title": "1. RC Circuit Fundamentals and Time Response",
      "introduction": "Analysis of basic RC circuit behavior including charging and discharging processes, time constant calculation, and transient response characteristics.",

      "key_concept": {
        "definition": "RC circuit fundamentals: Time constant τ = RC, Charging process: capacitor voltage rises exponentially, Discharging process: capacitor voltage decays exponentially, Transient response analysis, Initial and final conditions, 5τ rule for practical settling time, Energy storage in capacitors, Rate of voltage change.",
        "context": "Understanding RC circuit time response is essential for analyzing timing circuits, filters, and any system where capacitors interact with resistors to create time-dependent behavior.",
        "image": {
          "url": "images/rc-fundamentals.png",
          "alt": "RC circuit fundamentals",
          "caption": "Basic RC circuit configurations and response curves"
        }
      },

      "classifications": [
        {
          "type": "RC Circuit Configurations",
          "value": "Classification based on circuit topology and analysis approach",
          "characteristics": [
            "Series RC charging circuits",
            "Series RC discharging circuits",
            "Parallel RC configurations",
            "Multiple time constant circuits",
            "RC differentiator circuits",
            "RC integrator circuits"
          ],
          "behavior": "Different RC configurations exhibit characteristic behaviors: series charging follows exponential rise to source voltage; series discharging follows exponential decay from initial voltage; parallel configurations have different current distributions; multiple time constants create complex responses; differentiators approximate derivative operation; integrators approximate integral operation",
          "examples": [
            {
              "process": "Series RC Charging",
              "explanation": "When voltage is applied to uncharged series RC circuit, capacitor voltage rises exponentially toward source voltage while current decreases exponentially from initial maximum",
              "image": {
                "url": "images/rc-charging.png",
                "alt": "RC charging process",
                "caption": "Exponential voltage rise and current decay during charging"
              }
            },
            {
              "process": "Series RC Discharging",
              "explanation": "When charged capacitor discharges through resistor, both voltage and current decay exponentially from initial values to zero",
              "image": {
                "url": "images/rc-discharging.png",
                "alt": "RC discharging process",
                "caption": "Exponential voltage and current decay during discharging"
              }
            }
          ],
          "note": "Time constant τ=RC determines speed of response. Larger τ means slower charging/discharging. After 1τ, voltage reaches 63% of final value (charging) or 37% of initial value (discharging). After 5τ, circuit reaches 99.3% of final state. Initial capacitor voltage cannot change instantaneously. Final capacitor current is zero in DC steady state."
        }
      ],

      "principles": [
        {
          "principle": "Exponential Response and Time Constant",
          "statement": "RC circuits exhibit exponential charging and discharging behavior governed by the time constant τ = RC. During charging: Capacitor voltage $V_C(t) = V_0(1 - e^{-t/\\tau})$ rises exponentially toward the source voltage $V_0$, while current $I(t) = \\frac{V_0}{R}e^{-t/\\tau}$ decays exponentially from its initial maximum. During discharging: Capacitor voltage $V_C(t) = V_0e^{-t/\\tau}$ and current $I(t) = -\\frac{V_0}{R}e^{-t/\\tau}$ both decay exponentially. The time constant τ represents the time required for the voltage to reach 63.2% of its final value during charging or fall to 36.8% of its initial value during discharging. Practically, circuits reach within 1% of final values after 5 time constants (5τ). This exponential behavior arises from the fundamental relationship $I_C = C\\frac{dV_C}{dt}$ for capacitors combined with Ohm's Law and Kirchhoff's Laws. The time constant provides a direct measure of circuit speed: small τ values give fast response, large τ values give slow response.",
          "application": "Calculate charging and discharging times for RC circuits. Design timing circuits with specific delay requirements. Predict circuit behavior at any time during transient response. Analyze energy storage and dissipation in RC circuits. Determine appropriate component values for desired time response.",
          "example": "RC circuit with R=10kΩ, C=100μF: τ = RC = 10,000 × 0.0001 = 1 second. Charging from 0V to 10V: after 1s, V_C = 10(1-e⁻¹) = 6.32V; after 5s, V_C ≈ 10(1-e⁻⁵) = 9.93V",
          "analogy": "Like filling a water tank through a narrow pipe - initial flow is fast when empty, slows as tank fills; emptying follows similar pattern. Pipe resistance and tank size determine filling/emptying speed",
          "image": {
            "url": "images/exponential-response.png",
            "alt": "Exponential response and time constant",
            "caption": "Characteristic exponential curves for RC circuit response"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Basic RC Charging Analysis",
          "problem": "A series RC circuit has R=2.2kΩ, C=470μF, and V_source=12V. The capacitor is initially uncharged. Find: (a) Time constant, (b) Capacitor voltage after 1 second, (c) Time to reach 8V, (d) Current after 2 seconds.",
          "step_by_step": [
            {
              "step": "Time constant",
              "explanation": "τ = RC = 2200 × 0.00047 = 1.034 seconds"
            },
            {
              "step": "Voltage after 1 second",
              "explanation": "V_C(1) = 12(1 - e^{-1/1.034}) = 12(1 - e^{-0.967}) = 12(1 - 0.380) = 12 × 0.620 = 7.44V"
            },
            {
              "step": "Time to reach 8V",
              "explanation": "8 = 12(1 - e^{-t/1.034}), 8/12 = 1 - e^{-t/1.034}, 0.667 = 1 - e^{-t/1.034}, e^{-t/1.034} = 0.333, -t/1.034 = ln(0.333) = -1.099, t = 1.099 × 1.034 = 1.136 seconds"
            },
            {
              "step": "Current after 2 seconds",
              "explanation": "I(2) = (12/2200)e^{-2/1.034} = 0.00545 × e^{-1.934} = 0.00545 × 0.144 = 0.000785A = 0.785mA"
            },
            {
              "step": "Initial current verification",
              "explanation": "I(0) = 12/2200 = 5.45mA, which decays exponentially as calculated"
            }
          ],
          "final_answer": "(a) τ = 1.034s, (b) V_C(1) = 7.44V, (c) t = 1.136s to reach 8V, (d) I(2) = 0.785mA. Demonstrates complete RC charging analysis.",
          "concept_applied": "RC charging analysis",
          "image": {
            "url": "images/rc-charging-example.png",
            "alt": "RC charging analysis example",
            "caption": "Complete analysis of RC charging process"
          }
        },
        {
          "title": "RC Discharging Calculation",
          "problem": "A 100μF capacitor is charged to 24V and then discharged through a 10kΩ resistor. Find: (a) Time constant, (b) Voltage after 2 seconds, (c) Time when voltage reaches 5V, (d) Initial discharge current.",
          "step_by_step": [
            {
              "step": "Time constant",
              "explanation": "τ = RC = 10,000 × 0.0001 = 1 second"
            },
            {
              "step": "Voltage after 2 seconds",
              "explanation": "V_C(2) = 24e^{-2/1} = 24e^{-2} = 24 × 0.1353 = 3.25V"
            },
            {
              "step": "Time to reach 5V",
              "explanation": "5 = 24e^{-t/1}, 5/24 = e^{-t}, 0.2083 = e^{-t}, -t = ln(0.2083) = -1.569, t = 1.569 seconds"
            },
            {
              "step": "Initial discharge current",
              "explanation": "I(0) = V_0/R = 24/10000 = 0.0024A = 2.4mA"
            },
            {
              "step": "Current at 5V",
              "explanation": "I = V/R = 5/10000 = 0.0005A = 0.5mA (or using formula: I = 2.4e^{-1.569} = 0.5mA)"
            }
          ],
          "final_answer": "(a) τ = 1s, (b) V_C(2) = 3.25V, (c) t = 1.57s to reach 5V, (d) I_initial = 2.4mA. Demonstrates RC discharging analysis.",
          "concept_applied": "RC discharging analysis",
          "image": {
            "url": "images/rc-discharging-example.png",
            "alt": "RC discharging analysis example",
            "caption": "Complete analysis of RC discharging process"
          }
        }
      ]
    },
    {
      "section_title": "2. Advanced RC Analysis and Multiple Time Constants",
      "introduction": "Analysis of complex RC circuits with multiple time constants, including sequential charging, differentiator and integrator configurations, and circuits with multiple capacitors.",

      "key_concept": {
        "definition": "Advanced RC analysis: Multiple time constant circuits, Sequential RC charging, RC differentiator circuits, RC integrator circuits, Time constant superposition, Circuit response to pulse inputs, Square wave response, Phase relationships, Complex impedance approach, Bode plot analysis.",
        "context": "Complex RC circuits with multiple time constants exhibit more sophisticated behavior that enables advanced applications in signal processing, filtering, and timing control.",
        "image": {
          "url": "images/advanced-rc-analysis.png",
          "alt": "Advanced RC analysis",
          "caption": "Complex RC circuits and their analysis methods"
        }
      },

      "classifications": [
        {
          "type": "Advanced RC Circuit Types",
          "value": "Classification based on circuit complexity and application",
          "characteristics": [
            "Multiple capacitor circuits",
            "Sequential RC networks",
            "Differentiator configurations",
            "Integrator configurations",
            "RC phase shift networks",
            "Pulse response circuits"
          ],
          "behavior": "Different advanced configurations serve specific purposes: multiple capacitor circuits have complex transient responses; sequential networks create delayed timing; differentiators approximate mathematical derivatives; integrators approximate mathematical integrals; phase shift networks alter signal timing; pulse response circuits shape waveform characteristics",
          "examples": [
            {
              "process": "RC Differentiator Circuit",
              "explanation": "When τ << input pulse width, output approximates derivative of input signal, producing spikes at input transitions while remaining near zero during constant input periods",
              "image": {
                "url": "images/rc-differentiator.png",
                "alt": "RC differentiator circuit",
                "caption": "Circuit that approximates mathematical differentiation"
              }
            },
            {
              "process": "RC Integrator Circuit",
              "explanation": "When τ >> input pulse width, output approximates integral of input signal, producing ramp responses to square wave inputs while smoothing rapid changes",
              "image": {
                "url": "images/rc-integrator.png",
                "alt": "RC integrator circuit",
                "caption": "Circuit that approximates mathematical integration"
              }
            }
          ],
          "note": "Differentiator behavior requires τ << T (input period). Integrator behavior requires τ >> T. Multiple time constants create multi-stage exponential responses. Sequential RC networks have dominant time constants that determine overall response. Pulse response depends on ratio of τ to pulse width. Complex circuits may require Laplace transform analysis for complete solution."
        }
      ],

      "principles": [
        {
          "principle": "Differentiator and Integrator Circuits",
          "statement": "RC circuits can approximate mathematical operations based on the relationship between time constant and input signal characteristics. RC Differentiator: When configured with output across the resistor and τ << input signal period, the circuit approximates $V_{out} ≈ RC\\frac{dV_{in}}{dt}$. This occurs because the capacitor voltage follows the input with small time constant, making resistor voltage proportional to capacitor current, which is $C\\frac{dV_C}{dt}$. Differentiators produce sharp spikes at input transitions and are used for edge detection and high-pass filtering. RC Integrator: When configured with output across the capacitor and τ >> input signal period, the circuit approximates $V_{out} ≈ \\frac{1}{RC}\\int V_{in}dt$. This occurs because the capacitor has insufficient time to charge significantly during each input pulse, making the charging current approximately constant and proportional to input voltage. Integrators produce ramp outputs for square wave inputs and are used for low-pass filtering and waveform generation. The quality of approximation depends on the ratio τ/T, where T is the characteristic time of the input signal. Practical circuits often use op-amps to improve these approximations, but basic RC versions demonstrate the fundamental principles.",
          "application": "Design differentiator circuits for edge detection and spike generation. Design integrator circuits for ramp generation and signal smoothing. Analyze pulse response of RC circuits. Select appropriate time constants for specific input signals. Understand frequency-dependent behavior of RC networks.",
          "example": "Differentiator: R=1kΩ, C=0.1μF, τ=0.1ms. For 1kHz square wave (T=1ms), τ/T=0.1, good differentiation. Integrator: R=10kΩ, C=10μF, τ=100ms. For 10Hz square wave (T=100ms), τ/T=1, marginal integration; better with τ=1s (τ/T=10)",
          "analogy": "Differentiator like speedometer - responds to changes in position. Integrator like odometer - accumulates total distance traveled. Small time constant tracks changes quickly; large time constant averages over time",
          "image": {
            "url": "images/diff-integrator.png",
            "alt": "Differentiator and integrator circuits",
            "caption": "RC circuits as mathematical operators"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "RC Differentiator Analysis",
          "problem": "An RC differentiator has R=2kΩ, C=0.01μF. Input is 5V square wave with 10kHz frequency. Find: (a) Time constant, (b) Output voltage characteristics, (c) Approximate output spike magnitude.",
          "step_by_step": [
            {
              "step": "Time constant",
              "explanation": "τ = RC = 2000 × 0.01×10^{-6} = 2×10^{-5} = 20μs"
            },
            {
              "step": "Input signal period",
              "explanation": "T = 1/f = 1/10000 = 0.0001s = 100μs"
            },
            {
              "step": "τ/T ratio",
              "explanation": "τ/T = 20/100 = 0.2, which satisfies τ << T for differentiator operation"
            },
            {
              "step": "Output behavior",
              "explanation": "Circuit will produce positive spike at rising edge, negative spike at falling edge, with exponential decay between spikes"
            },
            {
              "step": "Spike magnitude",
              "explanation": "Initial spike magnitude ≈ input voltage = 5V (theoretical maximum, practically slightly less due to finite rise time)"
            },
            {
              "step": "Spike duration",
              "explanation": "Spikes decay with time constant 20μs. After 1τ (20μs), spike decays to 37% of initial value"
            },
            {
              "step": "Between transitions",
              "explanation": "During constant input periods, output decays to nearly zero as capacitor charges fully"
            }
          ],
          "final_answer": "(a) τ = 20μs, (b) Positive and negative spikes at input transitions with exponential decay, (c) Spike magnitude ≈ 5V. Demonstrates differentiator circuit analysis.",
          "concept_applied": "RC differentiator analysis",
          "image": {
            "url": "images/differentiator-example.png",
            "alt": "RC differentiator analysis example",
            "caption": "Analysis of differentiator circuit behavior"
          }
        },
        {
          "title": "Multiple Time Constant Circuit",
          "problem": "Two RC circuits are connected in sequence: First stage R₁=10kΩ, C₁=1μF; Second stage R₂=10kΩ, C₂=0.1μF. Find: (a) Individual time constants, (b) Approximate overall response to step input, (c) Time for second stage to reach 5V when first stage source is 10V.",
          "step_by_step": [
            {
              "step": "First stage time constant",
              "explanation": "τ₁ = R₁C₁ = 10,000 × 0.000001 = 0.01s = 10ms"
            },
            {
              "step": "Second stage time constant",
              "explanation": "τ₂ = R₂C₂ = 10,000 × 0.0000001 = 0.001s = 1ms"
            },
            {
              "step": "Overall response",
              "explanation": "Second stage responds faster (τ₂=1ms) but is driven by first stage which responds slower (τ₁=10ms). Overall response dominated by slower first stage"
            },
            {
              "step": "Second stage input voltage",
              "explanation": "First stage output: V₁(t) = 10(1 - e^{-t/0.01})"
            },
            {
              "step": "Second stage response",
              "explanation": "V₂(t) = V₁(t)(1 - e^{-t/0.001}) = 10(1 - e^{-t/0.01})(1 - e^{-t/0.001})"
            },
            {
              "step": "Time for V₂=5V (approximate)",
              "explanation": "Since τ₁ >> τ₂, second stage tracks first stage closely. When V₂=5V, V₁≈5V. 5 = 10(1 - e^{-t/0.01}), 0.5 = 1 - e^{-t/0.01}, e^{-t/0.01} = 0.5, t = -0.01×ln(0.5) = 0.00693s = 6.93ms"
            },
            {
              "step": "Verification",
              "explanation": "At t=6.93ms, V₁=5V, second stage with τ₂=1ms reaches 5(1-e^{-6.93})≈5(1-0.001)=4.995V, very close to 5V"
            }
          ],
          "final_answer": "(a) τ₁=10ms, τ₂=1ms, (b) Overall response dominated by slower 10ms time constant, (c) t≈6.93ms for second stage to reach 5V. Demonstrates multiple time constant analysis.",
          "concept_applied": "Multiple time constant analysis",
          "image": {
            "url": "images/multiple-tau-example.png",
            "alt": "Multiple time constant circuit example",
            "caption": "Analysis of sequential RC circuit response"
          }
        }
      ]
    },
    {
      "section_title": "3. RC Circuit Applications and Filter Design",
      "introduction": "Practical applications of RC circuits including filtering, timing, wave shaping, and real-world electronic systems that utilize RC network properties.",

      "key_concept": {
        "definition": "RC applications: Low-pass filters, High-pass filters, Band-pass filters, Timing circuits, Oscillators, Wave-shaping circuits, Power supply filters, Signal coupling, Bypass capacitors, Differentiator applications, Integrator applications, Pulse generators, Time delay circuits.",
        "context": "RC circuits form the foundation of many practical electronic systems including filters for signal processing, timing circuits for control systems, and wave-shaping circuits for signal conditioning.",
        "image": {
          "url": "images/rc-applications.png",
          "alt": "RC circuit applications",
          "caption": "Practical applications of RC circuits in electronics"
        }
      },

      "classifications": [
        {
          "type": "RC Filter and Application Types",
          "value": "Classification based on application purpose and circuit function",
          "characteristics": [
            "Low-pass filter circuits",
            "High-pass filter circuits",
            "Timing and delay circuits",
            "Wave-shaping circuits",
            "Power supply filtering",
            "Signal coupling circuits"
          ],
          "behavior": "Different applications leverage specific RC properties: low-pass filters pass low frequencies and attenuate high frequencies; high-pass filters do the opposite; timing circuits use predictable charging times; wave-shaping circuits modify signal waveforms; power filters smooth DC voltages; coupling circuits block DC while passing AC",
          "examples": [
            {
              "process": "RC Low-Pass Filter",
              "explanation": "Output across capacitor passes low frequencies with little attenuation while attenuating high frequencies, with cutoff frequency f_c = 1/(2πRC) where output is -3dB",
              "image": {
                "url": "images/rc-lowpass.png",
                "alt": "RC low-pass filter",
                "caption": "Frequency-selective circuit that passes low frequencies"
              }
            },
            {
              "process": "RC High-Pass Filter",
              "explanation": "Output across resistor passes high frequencies with little attenuation while attenuating low frequencies, with same cutoff frequency f_c = 1/(2πRC)",
              "image": {
                "url": "images/rc-highpass.png",
                "alt": "RC high-pass filter",
                "caption": "Frequency-selective circuit that passes high frequencies"
              }
            }
          ],
          "note": "Cutoff frequency f_c = 1/(2πRC) defines -3dB point where output power is half. Filter slope is -20dB/decade for single-pole RC filters. Multiple stages can create steeper slopes. Timing circuits use the predictable exponential response. Wave-shaping depends on τ relative to signal period. Bypass capacitors provide low-impedance paths at high frequencies. Coupling capacitors block DC component of signals."
        }
      ],

      "principles": [
        {
          "principle": "RC Filters and Frequency Response",
          "statement": "RC circuits function as frequency-selective filters based on the capacitor's impedance $X_C = \\frac{1}{2\\pi fC}$ which decreases with increasing frequency. Low-Pass Filter: Configuration with output across the capacitor passes low frequencies (where $X_C >> R$) and attenuates high frequencies (where $X_C << R$). The cutoff frequency $f_c = \\frac{1}{2\\pi RC}$ marks the -3dB point where output voltage is 70.7% of input and output power is half. Below $f_c$, attenuation is minimal; above $f_c$, attenuation increases at -20dB/decade. High-Pass Filter: Configuration with output across the resistor passes high frequencies (where $X_C << R$) and attenuates low frequencies (where $X_C >> R$), with the same cutoff frequency $f_c$. The frequency response follows a first-order rolloff characterized by the transfer function $H(f) = \\frac{1}{1 + j(f/f_c)}$ for low-pass and $H(f) = \\frac{j(f/f_c)}{1 + j(f/f_c)}$ for high-pass. Phase shift occurs across the cutoff region: 0° to -90° for low-pass, +90° to 0° for high-pass, with -45°/+45° at $f_c$. These simple RC filters form the building blocks for more complex filter designs and are widely used in audio systems, signal processing, and noise reduction applications.",
          "application": "Design RC filters for specific cutoff frequencies. Calculate filter attenuation at given frequencies. Analyze frequency response of RC networks. Select component values for filter applications. Understand phase relationships in filtered signals. Design multi-stage filters for improved performance.",
          "example": "Low-pass filter: R=1kΩ, C=0.1μF, f_c = 1/(2π×1000×0.1×10^{-6}) = 1592Hz. At 500Hz: minimal attenuation. At 5kHz: ~-10dB attenuation. At 50kHz: ~-30dB attenuation",
          "analogy": "Like water filtration - low-pass filter like sieve that blocks large particles (high frequencies) but passes water and small particles (low frequencies). High-pass filter opposite - blocks fine sediment but passes water with large particles",
          "image": {
            "url": "images/rc-filters.png",
            "alt": "RC filters and frequency response",
            "caption": "Frequency-selective behavior of RC filter circuits"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Low-Pass Filter Design",
          "problem": "Design an RC low-pass filter with cutoff frequency 1kHz. Using standard value R=1.5kΩ, find: (a) Required capacitor value, (b) Attenuation at 100Hz and 10kHz, (c) Phase shift at 1kHz.",
          "step_by_step": [
            {
              "step": "Required capacitor value",
              "explanation": "f_c = 1/(2πRC), C = 1/(2πRf_c) = 1/(2π×1500×1000) = 1.06×10^{-7} = 0.106μF"
            },
            {
              "step": "Use standard value",
              "explanation": "Use C=0.1μF (standard value), recalculate f_c = 1/(2π×1500×0.1×10^{-6}) = 1061Hz (close enough)"
            },
            {
              "step": "Attenuation at 100Hz",
              "explanation": "f/f_c = 100/1061 = 0.094, attenuation = 1/√(1+(f/f_c)²) = 1/√(1+0.0088) = 1/√1.0088 = 0.996 = -0.035dB (minimal)"
            },
            {
              "step": "Attenuation at 10kHz",
              "explanation": "f/f_c = 10000/1061 = 9.43, attenuation = 1/√(1+88.9) = 1/√89.9 = 0.105 = -19.6dB"
            },
            {
              "step": "Phase shift at 1kHz",
              "explanation": "f/f_c = 1000/1061 = 0.942, phase = -arctan(f/f_c) = -arctan(0.942) = -43.2°"
            },
            {
              "step": "Verification at exact f_c",
              "explanation": "At f=f_c=1061Hz, attenuation = 1/√2 = 0.707 = -3dB, phase = -45°"
            }
          ],
          "final_answer": "(a) C=0.1μF (giving f_c=1061Hz), (b) At 100Hz: -0.035dB, at 10kHz: -19.6dB, (c) Phase at 1kHz: -43.2°. Demonstrates low-pass filter design and analysis.",
          "concept_applied": "Low-pass filter design",
          "image": {
            "url": "images/lowpass-design-example.png",
            "alt": "Low-pass filter design example",
            "caption": "Complete low-pass filter design and analysis"
          }
        },
        {
          "title": "RC Timing Circuit Application",
          "problem": "Design an RC timing circuit that will trigger an action 5 seconds after switch closure. Available: 22μF capacitor. Find: (a) Required resistor value, (b) Capacitor voltage at trigger time if source is 9V, (c) Initial charging current.",
          "step_by_step": [
            {
              "step": "Time constant relationship",
              "explanation": "For RC charging: V_C(t) = V_0(1 - e^{-t/τ}). Need to find when this reaches trigger voltage"
            },
            {
              "step": "Assume trigger at 63% of source",
              "explanation": "Common practice: trigger at ~63% (1τ) or ~86% (2τ) or ~95% (3τ). For 5s delay, if trigger at 1τ, then τ=5s"
            },
            {
              "step": "Resistor calculation",
              "explanation": "τ = RC, R = τ/C = 5 / 0.000022 = 227kΩ. Use standard 220kΩ"
            },
            {
              "step": "Actual time constant",
              "explanation": "τ = RC = 220,000 × 0.000022 = 4.84s"
            },
            {
              "step": "Voltage at 5 seconds",
              "explanation": "V_C(5) = 9(1 - e^{-5/4.84}) = 9(1 - e^{-1.033}) = 9(1 - 0.356) = 9 × 0.644 = 5.80V"
            },
            {
              "step": "Trigger at 63% of source",
              "explanation": "63% of 9V = 5.67V. Our circuit reaches 5.67V when: 5.67 = 9(1 - e^{-t/4.84}), 0.63 = 1 - e^{-t/4.84}, e^{-t/4.84} = 0.37, t = 4.84s (slightly less than 5s)"
            },
            {
              "step": "Adjust for exact 5s",
              "explanation": "Need V_C(5) = 9(1 - e^{-5/τ}) = trigger voltage. If we want trigger at 63%, then need τ=5s exactly, so R = 5/0.000022 = 227kΩ (use 220kΩ + 6.8kΩ in series)"
            },
            {
              "step": "Initial charging current",
              "explanation": "I(0) = V_0/R = 9/227,000 = 0.0000396A = 39.6μA"
            }
          ],
          "final_answer": "(a) R=227kΩ (combine 220kΩ + 6.8kΩ), (b) V_C(5)=5.67V (at 63% trigger), (c) I_initial=39.6μA. Demonstrates RC timing circuit design.",
          "concept_applied": "RC timing circuit design",
          "image": {
            "url": "images/timing-circuit-example.png",
            "alt": "RC timing circuit example",
            "caption": "Design of RC circuit for specific timing application"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Time constant",
    "RC circuit",
    "Charging",
    "Discharging",
    "Transient response",
    "Exponential decay",
    "Low-pass filter",
    "High-pass filter",
    "Cutoff frequency",
    "Differentiator",
    "Integrator",
    "Phase shift"
  ],

  "common_misconceptions": [
    "Thinking capacitors charge linearly with time",
    "Believing current flows through capacitors in DC steady state",
    "Confusing charging and discharging time constants",
    "Thinking RC filters have sharp cutoff frequencies",
    "Believing differentiators work for all input signals",
    "Confusing time constant with half-life"
  ],

  "real_world_applications": [
    "Camera flash circuits",
    "Timers and delay circuits",
    "Audio equalizers and crossovers",
    "Power supply filtering",
    "Signal coupling in amplifiers",
    "Touch screen sensors",
    "Pulse shaping in digital circuits",
    "Tone controls in audio systems",
    "Noise reduction filters",
    "Oscillator circuits"
  ],

  "summary": "RC circuits exhibit exponential charging and discharging behavior characterized by the time constant τ=RC. During charging, capacitor voltage rises as V_C(t)=V_0(1-e^{-t/τ}) while current decays exponentially. During discharging, both voltage and current decay as V_C(t)=V_0e^{-t/τ}. The time constant determines circuit speed: after 1τ, voltage reaches 63% of final value; after 5τ, circuit is essentially at steady state. RC circuits function as filters: low-pass (output across capacitor) passes low frequencies, high-pass (output across resistor) passes high frequencies, both with cutoff frequency f_c=1/(2πRC). Differentiator circuits (τ << input period) approximate mathematical differentiation, while integrator circuits (τ >> input period) approximate integration. These properties make RC circuits fundamental to timing, filtering, wave-shaping, and many other electronic applications."
}