{
  "expanded_description": "When your success depends on what others do, you're playing a game. This is the insight of game theory, one of the most powerful tools in economics. Whether it's two competing firms deciding whether to cut prices, countries negotiating trade agreements, or even friends deciding where to eat, strategic situations surround us. Game theory provides a framework for understanding these interactions - predicting outcomes, explaining why cooperation often fails, and revealing the logic behind seemingly irrational behavior. Developed by mathematician John von Neumann and economist Oskar Morgenstern in the 1940s, game theory has revolutionized economics, political science, biology, and business strategy. This section introduces the basic concepts of game theory and applies them to understand oligopoly behavior.",
  
  "core_concept": {
    "principle": "Game theory is the study of strategic decision-making where the outcome for each participant depends on the choices of all participants. It provides tools to analyze situations where players are interdependent, predicting outcomes based on assumptions about rationality, information, and strategic interaction.",
    "explanation": "Think about rock-paper-scissors. Your choice only makes sense in relation to what your opponent might choose. If you knew they'd pick rock, you'd pick paper. But they know you know that, so they might pick scissors... This strategic reasoning - thinking about what others are thinking about what you're thinking - is what game theory captures. In economics, firms in oligopoly face similar dilemmas: should I cut prices? Will my rival match me? What if they don't? Game theory gives us a language and set of tools to analyze these situations, predict outcomes, and understand why cooperation is so difficult to sustain. It explains phenomena from price wars to advertising battles to why some industries are prone to collusion.",
    "image": {
      "src": "images/unit10/game_theory_intro.png",
      "alt": "Illustration of strategic interaction showing two players choosing between options with interdependent outcomes",
      "caption": "Game theory analyzes situations where your best move depends on what others do"
    }
  },

  "sections": [
    {
      "section_title": "6.10 Game Theory Introduction",
      "introduction": "Imagine you and a classmate are caught cheating on a test. The prosecutor separates you and offers each the same deal: 'Confess and implicate your partner, and you'll go free while your partner gets 10 years. If you both stay silent, we can only prove a minor offense - 1 year each. If you both confess, you both get 5 years.' What do you do? Your decision depends entirely on what you think your partner will do. This classic scenario, called the prisoner's dilemma, captures the essence of strategic thinking. In this section, we'll learn the basics of game theory - the study of strategic interactions - and see how it illuminates behavior in oligopoly and beyond.",
      
      "key_concept": {
        "definition": "Game theory is the study of mathematical models of strategic interaction among rational decision-makers. A game consists of players, strategies (the choices available to each player), payoffs (the outcomes for each combination of strategies), and information (what players know about the game and each other). Games can be classified as cooperative or non-cooperative, simultaneous or sequential, one-shot or repeated, and with perfect or imperfect information.",
        "context": "Game theory was developed in the 1940s by John von Neumann and Oskar Morgenstern, who recognized that standard economic analysis couldn't handle situations where outcomes depend on interactions. Since then, it has become essential in economics, political science, biology, and business. For oligopoly, game theory explains why firms might end up in price wars even when cooperation would benefit everyone, why some industries are stable while others are turbulent, and how firms can signal intentions to competitors. The concepts we'll learn - Nash equilibrium, dominant strategies, prisoner's dilemma, and others - provide the vocabulary for understanding strategic behavior."
      },

      "categories": [
        {
          "type": "Elements of a Game",
          "description": "Every game can be described by four key elements that define the strategic situation.",
          "examples": [
            {
              "process": "Players",
              "explanation": "The decision-makers in the game. In oligopoly, players are the competing firms. In the prisoner's dilemma, players are the two suspects. Players can be individuals, firms, governments, or any entity that makes strategic choices."
            },
            {
              "process": "Strategies",
              "explanation": "The possible actions each player can take. In a pricing game, strategies might be 'charge high price' or 'charge low price'. In advertising, strategies might be 'advertise' or 'don't advertise'. Strategies can be simple (binary choices) or complex (pricing along a continuum)."
            },
            {
              "process": "Payoffs",
              "explanation": "The outcomes players receive for each combination of strategies. Payoffs are typically profits for firms, years in prison for suspects, or utility for individuals. The payoff matrix shows payoffs for all players given every possible strategy combination."
            },
            {
              "process": "Information",
              "explanation": "What players know about the game and each other. In perfect information games, players know all previous moves. In complete information games, players know each other's payoffs. In reality, information is often imperfect or incomplete, adding complexity."
            }
          ]
        },
        {
          "type": "Representing Games: The Payoff Matrix",
          "description": "For simple games with two players and a few strategies, we can represent the game using a payoff matrix.",
          "examples": [
            {
              "process": "Structure of a payoff matrix",
              "explanation": "A payoff matrix has rows for Player 1's strategies and columns for Player 2's strategies. Each cell shows the payoff for Player 1 and Player 2 (in that order) for that combination. For example, a cell with $(5,3)$ means Player 1 gets 5, Player 2 gets 3."
            },
            {
              "process": "Reading the matrix",
              "explanation": "To find the outcome if Player 1 chooses row A and Player 2 chooses column B, look at the cell where row A and column B intersect. This shows what both players get. Players choose strategies simultaneously (in simultaneous games) or sequentially (in sequential games)."
            },
            {
              "process": "Example: Prisoner's dilemma matrix",
              "explanation": "Construct matrix: Two players, each with strategies Confess (C) or Remain Silent (S). Payoffs: If both Silent, (1,1) year each. If both Confess, (5,5) years each. If one Confesses and other Silent, Confessor gets 0 years, Silent gets 10 years. This creates the classic dilemma."
            }
          ]
        },
        {
          "type": "Key Solution Concepts",
          "description": "Game theorists use several concepts to predict how games will be played.",
          "examples": [
            {
              "process": "Dominant strategy",
              "explanation": "A dominant strategy is one that gives a player a higher payoff regardless of what the other player does. If a player has a dominant strategy, we can confidently predict they'll play it. In the prisoner's dilemma, confessing is a dominant strategy - it's better whether the other confesses or stays silent."
            },
            {
              "process": "Nash equilibrium",
              "explanation": "Named after Nobel laureate John Nash, a Nash equilibrium occurs when each player is choosing their best response to the other players' strategies. No player can improve their payoff by unilaterally changing their strategy. A game can have zero, one, or multiple Nash equilibria. This is the most important solution concept in game theory."
            },
            {
              "process": "Best response",
              "explanation": "A player's best response is the strategy that maximizes their payoff given what they think the other player will do. Finding Nash equilibria involves looking for strategy combinations where each player's strategy is a best response to the others'."
            }
          ]
        },
        {
          "type": "The Prisoner's Dilemma",
          "description": "The most famous game in game theory, illustrating why rational individuals might not cooperate even when cooperation benefits everyone.",
          "examples": [
            {
              "process": "The story",
              "explanation": "Two suspects are arrested and held in separate cells. Each is offered: Confess and implicate your partner, and you go free while your partner gets 10 years. If both confess, both get 5 years. If both stay silent, both get 1 year on minor charges. What should they do?"
            },
            {
              "process": "The payoff matrix",
              "explanation": "Let's create the matrix: Player 1 rows, Player 2 columns. Strategies: Confess (C) or Silent (S). Payoffs are (years in prison, so lower is better). (C,C): (5,5). (C,S): (0,10). (S,C): (10,0). (S,S): (1,1)."
            },
            {
              "process": "Analysis",
              "explanation": "Look at Player 1: If Player 2 confesses, Player 1 gets 5 if confess, 10 if silent → better to confess. If Player 2 is silent, Player 1 gets 0 if confess, 1 if silent → better to confess. Confessing is a dominant strategy. Same for Player 2. So both confess, getting (5,5), which is worse for both than (1,1) if they'd cooperated by staying silent. This is the dilemma: individual rationality leads to collectively worse outcome."
            },
            {
              "process": "Applications in economics",
              "explanation": "The prisoner's dilemma explains why competing firms often end up in price wars, why advertising battles escalate, why countries struggle to cooperate on environmental agreements, and why cartels are unstable. In each case, individual incentives lead to outcomes that leave everyone worse off."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Nash Equilibrium Is the Fundamental Solution Concept",
          "statement": "A Nash equilibrium is a set of strategies, one for each player, such that no player can improve their payoff by unilaterally changing their strategy. In equilibrium, each player's strategy is a best response to the others' strategies.",
          "application": "When analyzing any strategic situation, economists look for Nash equilibria as predictions of how rational players will behave. This applies to oligopoly pricing, bargaining, auctions, international trade negotiations, and countless other contexts. Finding Nash equilibria helps predict outcomes and design better policies or strategies.",
          "example": "In a simple pricing game where two firms choose high or low price, the Nash equilibrium might be both choosing low price - even though both would prefer high price. Neither can unilaterally raise price without losing customers, so low price is the equilibrium."
        },
        {
          "principle": "Dominant Strategies Simplify Prediction",
          "statement": "When a player has a strategy that yields a better payoff regardless of what others do, that dominant strategy is a powerful predictor. In such games, we don't need to speculate about others' behavior - the rational choice is clear.",
          "application": "In business, if a strategy is dominant, a firm can proceed confidently without worrying about competitors' reactions. This is rare but powerful when it occurs. More commonly, firms face situations where the best move depends on what others do, requiring more complex analysis.",
          "example": "In the prisoner's dilemma, confessing is dominant. Regardless of whether your partner confesses or stays silent, you're better off confessing. This is why we can confidently predict that rational players will confess, even though both would prefer the silent-silent outcome."
        },
        {
          "principle": "Repeated Play Can Enable Cooperation",
          "statement": "In one-shot games like the prisoner's dilemma, cooperation is unlikely. But when the same players interact repeatedly, cooperation can emerge because players can punish non-cooperation in future rounds. This is called the 'folk theorem' - in repeated games, many outcomes (including cooperation) can be sustained as equilibria.",
          "application": "This explains why real-world oligopolies often maintain prices above competitive levels despite the prisoner's dilemma incentive to cheat. Firms know that if they cut prices today, rivals will retaliate tomorrow, starting a price war that hurts everyone. The threat of future punishment sustains cooperation.",
          "example": "Two gas stations across the street from each other could play the prisoner's dilemma every day. If one cuts prices, the other will cut prices tomorrow, and they'll both lose. Knowing this, they might maintain higher prices, implicitly cooperating. The ongoing relationship changes the game."
        },
        {
          "principle": "Games Can Have Multiple Equilibria",
          "statement": "Some games have more than one Nash equilibrium, creating coordination problems. Players must find a way to coordinate on one equilibrium, or risk ending up in a worse outcome. This arises in situations like technology standards, location choices, or pricing conventions.",
          "application": "When multiple equilibria exist, history, culture, communication, or focal points can determine which equilibrium emerges. This explains why different countries might have different conventions (driving on left vs right) or why industries develop particular pricing norms.",
          "example": "Two firms choosing whether to enter a new market might face a game where both entering is bad (overcrowded), both staying out is bad (miss opportunity), but one entering and one staying out is good. Which firm enters? This coordination game has two equilibria: (A enters, B stays) and (A stays, B enters). Which one happens depends on expectations, timing, or communication."
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing a Prisoner's Dilemma",
          "problem": "Two firms, A and B, are deciding whether to spend heavily on advertising. The payoff matrix (profits in millions) is: If both advertise, A gets $\\$10$, B gets $\\$10$. If neither advertises, A gets $\\$20$, B gets $\\$20$. If A advertises and B doesn't, A gets $\\$25$, B gets $\\$5$. If B advertises and A doesn't, B gets $\\$25$, A gets $\\$5$. a) Does either firm have a dominant strategy? b) Find the Nash equilibrium. c) Is this a prisoner's dilemma? Why? d) What could change the outcome?",
          "step_by_step": [
            {
              "step": "Set up the payoff matrix",
              "explanation": "Let's create matrix: A's strategies in rows (Advertise, Don't), B's in columns (Advertise, Don't). Cells: (A payoff, B payoff). (Advertise, Advertise): (10,10). (Advertise, Don't): (25,5). (Don't, Advertise): (5,25). (Don't, Don't): (20,20)."
            },
            {
              "step": "Check for dominant strategy for A",
              "explanation": "If B advertises: A gets 10 if advertise, 5 if don't → better to advertise. If B doesn't advertise: A gets 25 if advertise, 20 if don't → better to advertise. So advertising is A's dominant strategy - better regardless of what B does."
            },
            {
              "step": "Check for dominant strategy for B",
              "explanation": "If A advertises: B gets 10 if advertise, 5 if don't → better to advertise. If A doesn't advertise: B gets 25 if advertise, 20 if don't → better to advertise. So advertising is B's dominant strategy as well."
            },
            {
              "step": "Find Nash equilibrium",
              "explanation": "Since both have dominant strategies, they'll both advertise. The outcome (Advertise, Advertise) gives (10,10). Check: Given B advertises, A's best response is advertise (10 > 5). Given A advertises, B's best response is advertise (10 > 5). So (Advertise, Advertise) is a Nash equilibrium."
            },
            {
              "step": "Determine if this is a prisoner's dilemma",
              "explanation": "A prisoner's dilemma requires: (1) Each has dominant strategy leading to (2) an outcome that is worse for both than another feasible outcome. Here, (Don't, Don't) gives (20,20) which is better for both than (10,10). And both have dominant strategy to advertise. So yes, this is a classic prisoner's dilemma."
            },
            {
              "step": "Discuss what could change outcome",
              "explanation": "If the game is repeated indefinitely, firms might sustain cooperation (don't advertise) using trigger strategies: if you advertise today, I'll advertise forever after. This threat can maintain cooperation. Also, if firms could collude and enforce an agreement, they'd choose not to advertise. But in a one-shot game, the dilemma is inescapable."
            }
          ],
          "final_answer": "a) Yes, both have dominant strategy to advertise. b) Nash equilibrium is (Advertise, Advertise) with payoffs (10,10). c) Yes, it's a prisoner's dilemma because the dominant strategy leads to an outcome worse for both than (Don't, Don't) with (20,20). d) Repeated play or enforceable collusion could sustain cooperation.",
          "concept_applied": "The prisoner's dilemma shows how individual rationality leads to collectively worse outcomes. It explains why firms might overspend on advertising, engage in price wars, or fail to cooperate even when cooperation would benefit everyone."
        },
        {
          "title": "Finding Nash Equilibrium in a Coordination Game",
          "problem": "Two firms are choosing which technology standard to adopt. They can choose Standard X or Standard Y. If they choose the same standard, both earn $\\$100$ million. If they choose different standards, both earn $\\$0$ (incompatible). a) Construct the payoff matrix. b) Find all Nash equilibria. c) What problem does this create for the firms? d) How might they resolve it?",
          "step_by_step": [
            {
              "step": "Construct payoff matrix",
              "explanation": "Players: Firm A (rows), Firm B (columns). Strategies: X or Y. Payoffs: (X,X): (100,100). (Y,Y): (100,100). (X,Y): (0,0). (Y,X): (0,0)."
            },
            {
              "step": "Find Nash equilibria",
              "explanation": "Check (X,X): Given B chooses X, A's best response is X (100 > 0). Given A chooses X, B's best response is X (100 > 0). So (X,X) is a Nash equilibrium. Check (Y,Y): Same logic, (Y,Y) is also a Nash equilibrium. Check (X,Y): Given B chooses Y, A gets 0 with X, 100 with Y - so A would want to switch to Y. Not equilibrium. (Y,X): Similarly not equilibrium. So there are two Nash equilibria: (X,X) and (Y,Y)."
            },
            {
              "step": "Identify the coordination problem",
              "explanation": "Both firms want to coordinate on the same standard, but they don't know which one the other will choose. If they pick different standards, both lose. This is a coordination game with two possible good outcomes but risk of miscoordination."
            },
            {
              "step": "Discuss resolution mechanisms",
              "explanation": "Firms could communicate and agree on a standard (legal and common). One standard might be historically dominant (incumbency advantage). An industry group might set a standard. Government might mandate a standard. Or one firm might move first, committing to a standard, and the other follows (first-mover advantage)."
            },
            {
              "step": "Real-world example",
              "explanation": "This is exactly what happened with high-definition DVD formats (Blu-ray vs HD DVD). Both were Nash equilibria, but once enough studios committed to Blu-ray, the market coordinated on that equilibrium, and HD DVD failed. The coordination problem was resolved through sequential moves and industry commitments."
            }
          ],
          "final_answer": "a) Matrix: (X,X): (100,100), (Y,Y): (100,100), (X,Y): (0,0), (Y,X): (0,0). b) Nash equilibria: (X,X) and (Y,Y). c) Coordination problem: both want same standard but risk choosing different ones. d) Resolution through communication, industry standards, government mandate, or first-mover advantage.",
          "concept_applied": "Coordination games have multiple equilibria, creating uncertainty about which outcome will prevail. History, communication, and strategic moves determine which equilibrium emerges."
        }
      ],

      "image": {
        "src": "images/unit10/prisoners_dilemma_matrix.png",
        "alt": "Payoff matrix for prisoner's dilemma showing dominant strategies and worse cooperative outcome",
        "caption": "The prisoner's dilemma payoff matrix: each player has a dominant strategy, but the resulting equilibrium is worse for both than the cooperative outcome"
      }
    }
  ],

  "key_terms": [
    "Game theory",
    "Players",
    "Strategies",
    "Payoffs",
    "Payoff matrix",
    "Dominant strategy",
    "Nash equilibrium",
    "Best response",
    "Prisoner's dilemma",
    "Cooperation",
    "Defection",
    "Zero-sum game",
    "Coordination game",
    "Multiple equilibria",
    "Folk theorem",
    "Repeated games",
    "Trigger strategy",
    "Tit-for-tat",
    "John Nash",
    "Von Neumann",
    "Morgenstern"
  ],

  "summary": "Game theory provides a framework for analyzing strategic interactions where outcomes depend on the choices of all participants. A game consists of players, strategies, payoffs, and information. Games can be represented using payoff matrices, which show the outcomes for every combination of strategies. Key solution concepts include dominant strategy (a strategy that's best regardless of what others do) and Nash equilibrium (a set of strategies where each player is doing the best they can given what others are doing). The prisoner's dilemma is the most famous game, demonstrating how individual rationality can lead to collectively worse outcomes: each player has a dominant strategy, but the resulting equilibrium is worse for both than another feasible outcome. This explains many real-world phenomena including price wars, advertising battles, and the instability of cartels. Not all games are prisoner's dilemmas - coordination games have multiple equilibria and require players to coordinate on one outcome. When games are repeated, cooperation becomes possible through strategies like tit-for-tat, where players cooperate as long as others do, but punish defection. This insight from the folk theorem explains why real-world oligopolies often sustain prices above competitive levels despite short-run incentives to cheat. Game theory has applications far beyond economics, including political science (voting, international relations), biology (evolutionary game theory), and business strategy. Understanding game theory provides the tools to analyze any situation where your success depends on the choices of others, making it essential for understanding oligopoly behavior and strategic decision-making in general."
}
