{
  "title": "6.10 Game Theory Introduction",
  "expanded_description": "Analyzing the fundamentals of game theory as a framework for understanding strategic decision-making in economics, where outcomes depend on the interactions between multiple decision-makers with potentially conflicting interests.",
  "core_concept": {
    "principle": "Game theory provides a systematic framework for analyzing strategic situations where the outcomes of individuals' decisions depend on the choices of others, enabling prediction of behavior in interdependent decision-making environments common in economics, business, and social interactions.",
    "explanation": "Unlike individual optimization problems, game theory addresses situations of strategic interdependence where each player's optimal strategy depends on what they expect other players to do. This framework is essential for understanding oligopoly behavior, bargaining, auctions, and many other economic phenomena involving multiple decision-makers with competing or complementary interests.",
    "image": {
      "url": "/images/economics/game-theory-framework.svg",
      "alt": "Game Theory Framework",
      "caption": "Strategic interdependence in multi-agent decision making"
    }
  },
  "sections": [
    {
      "section_title": "Basic Elements of Games",
      "introduction": "Understanding the fundamental components that define any strategic situation in game theory, including players, strategies, payoffs, and information structures.",
      "key_concept": {
        "definition": "A game consists of players (decision-makers), strategies (possible actions), payoffs (outcomes based on strategy combinations), and information (what players know when making decisions). Games can be simultaneous (players move at same time) or sequential (players move in order), with perfect or imperfect information.",
        "context": "This formal structure allows systematic analysis of strategic situations ranging from simple two-player games to complex multi-agent interactions in markets, negotiations, and social dilemmas.",
        "image": {
          "url": "/images/economics/game-elements.svg",
          "alt": "Basic Elements of Games",
          "caption": "Players, strategies, payoffs, and information in game theory"
        }
      },
      "classifications": [
        {
          "type": "Game Components",
          "value": "Essential elements defining any strategic situation",
          "characteristics": ["Players", "Strategy Sets", "Payoff Functions", "Information Sets", "Timing Structure"],
          "behavior": "The combination of these elements determines the game's strategic complexity and the appropriate solution concepts for predicting outcomes. Different information and timing structures lead to fundamentally different strategic considerations.",
          "examples": [
            {
              "process": "Strategy Definition",
              "explanation": "A strategy is a complete plan of action for all possible situations in a game. In simultaneous games, strategies are simple actions. In sequential games, strategies specify actions at each decision point.",
              "image": {
                "url": "/images/economics/strategy-definition.svg",
                "alt": "Strategy Definition",
                "caption": "Complete contingency plans as strategies in games"
              }
            },
            {
              "process": "Payoff Matrix Construction",
              "explanation": "For simultaneous games, payoffs are organized in matrices showing each player's outcome for every possible combination of strategies. The matrix structure reveals strategic interdependence clearly.",
              "image": {
                "url": "/images/economics/payoff-matrix-construction.svg",
                "alt": "Payoff Matrix Construction",
                "caption": "Organizing strategic outcomes in matrix form"
              }
            }
          ]
        },
        {
          "type": "Game Classifications",
          "value": "Categorizing games by their structural features",
          "characteristics": ["Simultaneous vs Sequential", "Perfect vs Imperfect Information", "Zero-Sum vs Non-Zero-Sum", "Cooperative vs Non-cooperative"],
          "behavior": "Different game types require different analytical approaches and solution concepts. Zero-sum games involve pure conflict, while non-zero-sum games allow for both conflict and cooperation.",
          "examples": [
            {
              "process": "Zero-Sum Game Characteristics",
              "explanation": "In zero-sum games, one player's gain equals another's loss, creating pure conflict. These games have well-defined solutions using minimax strategies but are rare in economics.",
              "image": {
                "url": "/images/economics/zero-sum-game.svg",
                "alt": "Zero-Sum Game Characteristics",
                "caption": "Pure conflict games where gains equal losses"
              }
            },
            {
              "process": "Sequential Game Analysis",
              "explanation": "In sequential games, players move in sequence with knowledge of previous moves. These are analyzed using game trees and backward induction to find subgame perfect equilibria.",
              "image": {
                "url": "/images/economics/sequential-game-analysis.svg",
                "alt": "Sequential Game Analysis",
                "caption": "Game trees and backward induction in sequential moves"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Basic Game Matrix Analysis",
          "problem": "Two firms are considering advertising campaigns. If neither advertises, each earns $5 million. If both advertise, each earns $3 million. If one advertises while the other doesn't, the advertiser earns $8 million and the non-advertiser earns $1 million. Construct the payoff matrix and identify dominant strategies.",
          "step_by_step": [
            {
              "step": "Set Up Players and Strategies",
              "explanation": "Identify the decision-makers and their possible actions",
              "calculation": "Players: Firm A and Firm B\nStrategies for each: Advertise or Don't Advertise"
            },
            {
              "step": "Construct Payoff Matrix",
              "explanation": "Organize outcomes for all strategy combinations",
              "calculation": "Firm B: Advertise | Don't Advertise\nFirm A: Advertise | (3,3) | (8,1)\nFirm A: Don't Advertise | (1,8) | (5,5)\n(Values in $ millions, A's payoff first)"
            },
            {
              "step": "Analyze Firm A's Best Responses",
              "explanation": "Determine A's optimal strategy for each of B's choices",
              "calculation": "If B advertises: A gets 3 by advertising, 1 by not advertising → Prefer advertising\nIf B doesn't advertise: A gets 8 by advertising, 5 by not advertising → Prefer advertising\nAdvertising is always better for A"
            },
            {
              "step": "Analyze Firm B's Best Responses",
              "explanation": "Determine B's optimal strategy for each of A's choices",
              "calculation": "If A advertises: B gets 3 by advertising, 1 by not advertising → Prefer advertising\nIf A doesn't advertise: B gets 8 by advertising, 5 by not advertising → Prefer advertising\nAdvertising is always better for B"
            },
            {
              "step": "Identify Dominant Strategies",
              "explanation": "Find strategies that are optimal regardless of opponent's choice",
              "calculation": "Both firms have advertising as dominant strategy\nNo matter what the other does, advertising yields higher payoff"
            },
            {
              "step": "Find Nash Equilibrium",
              "explanation": "Identify strategy combination where no player wants to deviate",
              "calculation": "Both advertising: (3,3)\nIf either firm unilaterally switches to not advertising, their payoff falls from 3 to 1\nThis is the only Nash equilibrium"
            },
            {
              "step": "Pareto Efficiency Analysis",
              "explanation": "Compare equilibrium to other possible outcomes",
              "calculation": "Mutual not advertising (5,5) Pareto dominates mutual advertising (3,3)\nBut mutual not advertising isn't an equilibrium due to cheating incentives"
            }
          ],
          "final_answer": "The game has a unique Nash equilibrium where both firms advertise, earning $3 million each. However, this outcome is Pareto inefficient since both would prefer the outcome where neither advertises (earning $5 million each). The dominant strategy of advertising leads to a prisoner's dilemma where individual rationality produces a collectively worse outcome. This explains why industries often experience excessive advertising despite its cost.",
          "concept_applied": "Basic game theory analysis using payoff matrices to identify dominant strategies and Nash equilibrium, demonstrating how individual rationality can lead to collectively suboptimal outcomes in strategic situations—the classic prisoner's dilemma structure.",
          "image": {
            "url": "/images/economics/advertising-game-analysis.svg",
            "alt": "Advertising Game Analysis",
            "caption": "Prisoner's dilemma in advertising competition"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Strategic Thinking Principle",
          "statement": "Rational decision-making in strategic situations requires thinking not only about what you should do, but also about what other players are likely to do, and what they think you will do, and what you think they think you will do, and so on. This infinite regress of mutual expectations is resolved in equilibrium concepts like Nash equilibrium, where each player's strategy is optimal given correct beliefs about others' strategies.",
          "application": "This principle explains why successful business strategy, negotiation, and policy design require anticipating others' responses and understanding how your actions will influence their subsequent decisions.",
          "example": "When Apple considers launching a new iPhone, it must anticipate how Samsung will respond with its Galaxy line, how these responses will affect market dynamics, and how Samsung expects Apple to react to those responses.",
          "analogy": "Like playing chess—you don't just consider your immediate move, but how your opponent will likely respond, how you'll respond to that response, and so on several moves ahead.",
          "image": {
            "url": "/images/economics/strategic-thinking-principle.svg",
            "alt": "Strategic Thinking Principle",
            "caption": "Multiple levels of reasoning in strategic decision-making"
          }
        }
      ]
    },
    {
      "section_title": "Nash Equilibrium and Solution Concepts",
      "introduction": "Understanding Nash equilibrium as the fundamental solution concept in game theory and its extensions for predicting outcomes in different types of strategic situations.",
      "key_concept": {
        "definition": "A Nash equilibrium occurs when each player's strategy is optimal given the strategies chosen by other players—no player can improve their payoff by unilaterally changing strategy. This represents a stable outcome where expectations are mutually consistent and no player has incentive to deviate.",
        "context": "Nash equilibrium provides the benchmark for predicting outcomes in non-cooperative games, though it may not be unique or Pareto efficient. Refinements address limitations for specific game types.",
        "image": {
          "url": "/images/economics/nash-equilibrium-concept.svg",
          "alt": "Nash Equilibrium Concept",
          "caption": "Mutually consistent strategies where no player wants to deviate"
        }
      },
      "classifications": [
        {
          "type": "Equilibrium Concepts",
          "value": "Different solution concepts for different game types",
          "characteristics": ["Nash Equilibrium", "Dominant Strategy Equilibrium", "Subgame Perfect Equilibrium", "Bayesian Nash Equilibrium"],
          "behavior": "Different equilibrium concepts address specific game structures: dominant strategy equilibrium for games with unconditional best responses, subgame perfection for sequential games, and Bayesian equilibrium for games with incomplete information.",
          "examples": [
            {
              "process": "Finding Nash Equilibria",
              "explanation": "Nash equilibria are identified by checking each strategy combination to see if any player can benefit by unilaterally changing strategy. In mixed strategies, players randomize to make opponents indifferent.",
              "image": {
                "url": "/images/economics/finding-nash-equilibria.svg",
                "alt": "Finding Nash Equilibria",
                "caption": "Systematic identification of equilibrium strategy profiles"
              }
            },
            {
              "process": "Subgame Perfection",
              "explanation": "In sequential games, subgame perfect equilibrium requires strategies to form Nash equilibria in every subgame, eliminating incredible threats by requiring credibility at every decision point.",
              "image": {
                "url": "/images/economics/subgame-perfection.svg",
                "alt": "Subgame Perfection",
                "caption": "Eliminating non-credible threats in sequential games"
              }
            }
          ]
        },
        {
          "type": "Equilibrium Properties and Limitations",
          "value": "Strengths and weaknesses of Nash equilibrium",
          "characteristics": ["Existence", "Multiplicity", "Pareto Efficiency", "Refinements"],
          "behavior": "While Nash equilibrium always exists in finite games (possibly in mixed strategies), it may not be unique or efficient. Equilibrium selection and refinement address these issues in specific contexts.",
          "examples": [
            {
              "process": "Mixed Strategy Equilibrium",
              "explanation": "When no pure strategy Nash equilibrium exists, players randomize strategies to make opponents indifferent. Mixed strategy equilibria always exist in finite games.",
              "image": {
                "url": "/images/economics/mixed-strategy-equilibrium.svg",
                "alt": "Mixed Strategy Equilibrium",
                "caption": "Randomization as equilibrium in games without pure strategy equilibria"
              }
            },
            {
              "process": "Equilibrium Selection Problem",
              "explanation": "When multiple Nash equilibria exist, additional criteria (payoff dominance, risk dominance, focal points) may determine which equilibrium players coordinate on.",
              "image": {
                "url": "/images/economics/equilibrium-selection.svg",
                "alt": "Equilibrium Selection Problem",
                "caption": "Choosing among multiple possible equilibria"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Mixed Strategy Nash Equilibrium",
          "problem": "In a penalty kick game, the kicker can shoot left or right, and the goalkeeper can dive left or right. If both choose same side, goalkeeper saves (payoffs: 0 for kicker, 1 for keeper). If they choose different sides, kicker scores (payoffs: 1 for kicker, 0 for keeper). Find the mixed strategy Nash equilibrium.",
          "step_by_step": [
            {
              "step": "Set Up Payoff Matrix",
              "explanation": "Organize the strategic situation",
              "calculation": "Goalkeeper: Left | Right\nKicker: Left | (0,1) | (1,0)\nKicker: Right | (1,0) | (0,1)\n(Kicker's payoff first)"
            },
            {
              "step": "Check for Pure Strategy Equilibrium",
              "explanation": "See if any pure strategy combination is stable",
              "calculation": "If both choose Left: (0,1) - Kicker wants to deviate to Right\nIf both choose Right: (0,1) - Kicker wants to deviate to Left\nIf different sides: (1,0) - Goalkeeper wants to deviate\nNo pure strategy Nash equilibrium exists"
            },
            {
              "step": "Define Mixed Strategies",
              "explanation": "Let p = probability kicker shoots left, q = probability goalkeeper dives left",
              "calculation": "Kicker: Shoot left with probability p, right with probability 1-p\nGoalkeeper: Dive left with probability q, right with probability 1-q"
            },
            {
              "step": "Kicker's Indifference Condition",
              "explanation": "Kicker should be indifferent between shooting left and right",
              "calculation": "Expected payoff shooting left: q×0 + (1-q)×1 = 1-q\nExpected payoff shooting right: q×1 + (1-q)×0 = q\nSet equal: 1-q = q → 1 = 2q → q = 0.5"
            },
            {
              "step": "Goalkeeper's Indifference Condition",
              "explanation": "Goalkeeper should be indifferent between diving left and right",
              "calculation": "Expected payoff diving left: p×1 + (1-p)×0 = p\nExpected payoff diving right: p×0 + (1-p)×1 = 1-p\nSet equal: p = 1-p → 2p = 1 → p = 0.5"
            },
            {
              "step": "Mixed Strategy Equilibrium",
              "explanation": "Both players randomize with equal probabilities",
              "calculation": "Kicker: p = 0.5 (shoot left 50%, right 50%)\nGoalkeeper: q = 0.5 (dive left 50%, right 50%)"
            },
            {
              "step": "Verify Equilibrium",
              "explanation": "Check that neither player can improve by deviating",
              "calculation": "At these probabilities, each player's expected payoff is 0.5 regardless of strategy\nNo profitable unilateral deviation exists"
            }
          ],
          "final_answer": "Mixed strategy Nash equilibrium: Kicker randomizes 50-50 between left and right, Goalkeeper randomizes 50-50 between left and right. Both players receive expected payoff of 0.5. This equilibrium emerges because any predictable pattern would be exploited by the opponent, making randomization the only stable strategy. In professional soccer, this explains why penalty takers and goalkeepers both use unpredictable patterns.",
          "concept_applied": "Mixed strategy Nash equilibrium calculation showing how players randomize strategies to make opponents indifferent, demonstrating equilibrium in games without pure strategy solutions and explaining unpredictable behavior in competitive situations.",
          "image": {
            "url": "/images/economics/penalty-kick-equilibrium.svg",
            "alt": "Penalty Kick Mixed Strategy Equilibrium",
            "caption": "Randomization as optimal strategy in competitive games"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Nash Equilibrium Existence Theorem",
          "statement": "Every finite game with a finite number of players and finite strategy sets has at least one Nash equilibrium, possibly in mixed strategies. This fundamental theorem guarantees that strategic situations always have stable outcomes where players' expectations are mutually consistent, providing the foundation for game theory as a predictive tool in economics.",
          "application": "This theorem ensures that game-theoretic analysis always yields predictions about behavior in strategic situations, making it applicable to market competition, bargaining, auctions, and any economic situation with multiple decision-makers.",
          "example": "In oligopoly markets, the existence theorem guarantees that there is always some stable pattern of pricing and output, whether it involves competition, collusion, or mixed strategies, though the specific equilibrium depends on market conditions.",
          "analogy": "Like water always finding its level—no matter how complex the container, water settles into some stable configuration. Similarly, no matter how complex the strategic situation, players' behavior settles into some equilibrium pattern.",
          "image": {
            "url": "/images/economics/nash-existence-theorem.svg",
            "alt": "Nash Equilibrium Existence Theorem",
            "caption": "Guaranteed existence of stable outcomes in finite games"
          }
        }
      ]
    },
    {
      "section_title": "Applications in Economics and Business",
      "introduction": "Exploring how game theory provides insights into economic phenomena including market competition, bargaining, auctions, and strategic business decisions.",
      "key_concept": {
        "definition": "Game theory applications in economics include oligopoly behavior (Cournot, Bertrand models), auction design, bargaining theory, principal-agent problems, and industrial organization. These applications demonstrate how strategic thinking explains market outcomes that cannot be understood through individual optimization alone.",
        "context": "From understanding why firms sometimes engage in destructive price wars to designing efficient auction mechanisms, game theory has become essential for analyzing modern economic institutions and business strategies.",
        "image": {
          "url": "/images/economics/game-theory-applications.svg",
          "alt": "Game Theory Applications",
          "caption": "Strategic analysis in markets, auctions, and business decisions"
        }
      },
      "classifications": [
        {
          "type": "Market Competition Applications",
          "value": "Strategic behavior in imperfectly competitive markets",
          "characteristics": ["Oligopoly Models", "Entry Deterrence", "Product Differentiation", "Price Signaling"],
          "behavior": "Game theory explains how firms strategically choose prices, outputs, product characteristics, and capacity to maximize profits while anticipating competitors' responses, leading to outcomes between perfect competition and monopoly.",
          "examples": [
            {
              "process": "Entry Deterrence Strategies",
              "explanation": "Incumbent firms may maintain excess capacity or engage in limit pricing to deter potential entrants, using credible commitments to make entry unprofitable even when incumbents earn monopoly profits.",
              "image": {
                "url": "/images/economics/entry-deterrence.svg",
                "alt": "Entry Deterrence Strategies",
                "caption": "Strategic investments to prevent market entry"
              }
            },
            {
              "process": "Product Positioning Games",
              "explanation": "Firms strategically differentiate products to reduce price competition, using game theory to optimal position products in characteristic space to balance market share against profit margins.",
              "image": {
                "url": "/images/economics/product-positioning.svg",
                "alt": "Product Positioning Games",
                "caption": "Strategic differentiation in product characteristic space"
              }
            }
          ]
        },
        {
          "type": "Auction and Mechanism Design",
          "value": "Designing rules for efficient resource allocation",
          "characteristics": ["Auction Formats", "Revelation Principle", "Efficient Mechanisms", "Revenue Equivalence"],
          "behavior": "Game theory helps design auction mechanisms that allocate resources efficiently while maximizing seller revenue, with different auction formats creating different strategic incentives for bidders.",
          "examples": [
            {
              "process": "Revenue Equivalence Theorem",
              "explanation": "Under certain conditions, different auction formats (English, Dutch, first-price, second-price) yield the same expected revenue, as bidders adjust their bidding strategies to the auction rules.",
              "image": {
                "url": "/images/economics/revenue-equivalence.svg",
                "alt": "Revenue Equivalence Theorem",
                "caption": "Different auction formats yielding equivalent outcomes"
              }
            },
            {
              "process": "Optimal Auction Design",
              "explanation": "Sellers can design auction rules to maximize revenue, sometimes setting reserve prices or using asymmetric information to extract more surplus from bidders with higher valuations.",
              "image": {
                "url": "/images/economics/optimal-auction-design.svg",
                "alt": "Optimal Auction Design",
                "caption": "Revenue-maximizing auction mechanisms"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Second-Price Auction Strategy",
          "problem": "In a second-price sealed-bid auction, the highest bidder wins but pays the second-highest bid. Three bidders have private valuations: Bidder A values item at $100, Bidder B at $80, Bidder C at $60. Show that bidding true valuation is a dominant strategy.",
          "step_by_step": [
            {
              "step": "Understand Auction Rules",
              "explanation": "Clarify how second-price auctions work",
              "calculation": "Highest bidder wins, pays second-highest bid\nBidders submit sealed bids simultaneously"
            },
            {
              "step": "Analyze Bidder A's Strategy",
              "explanation": "Consider A's valuation = $100",
              "calculation": "If A bids true value $100:\n- If highest bidder, pays second-highest bid (≤$80)\n- Profit = $100 - payment ≥ $20\nIf A bids less than true value, say $90:\n- Might lose to bidder with valuation between $90-$100\n- Would miss profitable opportunities\nIf A bids more than true value, say $110:\n- Might win but pay more than $100 if second bid > $100\n- Could incur losses"
            },
            {
              "step": "General Dominant Strategy Proof",
              "explanation": "Show bidding true value is always optimal",
              "calculation": "Let v = bidder's true valuation\nLet b = bid\nLet w = highest competing bid\nCase 1: b > w (wins auction)\n- If v > w: Pays w < v, gets surplus v-w > 0\n- If v < w: Pays w > v, gets negative surplus\nTruthful bidding avoids negative surplus\nCase 2: b < w (loses auction)\n- If v > w: Misses surplus v-w > 0\n- If v < w: Avoids negative surplus\nTruthful bidding captures available surplus"
            },
            {
              "step": "Apply to Specific Bidders",
              "explanation": "Determine optimal bids for each bidder",
              "calculation": "Bidder A (v=$100): Bid $100\nBidder B (v=$80): Bid $80\nBidder C (v=$60): Bid $60"
            },
            {
              "step": "Predict Auction Outcome",
              "explanation": "Determine who wins and at what price",
              "calculation": "Highest bid: $100 (Bidder A)\nSecond-highest bid: $80 (Bidder B)\nA wins, pays $80\nA's surplus: $100 - $80 = $20"
            },
            {
              "step": "Verify No Profitable Deviation",
              "explanation": "Check if any bidder can improve by bidding differently",
              "calculation": "Bidder A: Lowering bid might cause loss to Bidder B\nBidder B: Raising bid above $80 might win but pay >$80\nBidder C: Cannot win profitably at any bid\nNo profitable deviations from truthful bidding"
            }
          ],
          "final_answer": "In second-price auctions, bidding true valuation is a dominant strategy for all bidders. In this example: Bidder A bids $100 and wins, paying $80 (second-highest bid) for a surplus of $20. Bidder B bids $80 and loses. Bidder C bids $60 and loses. No bidder can improve their outcome by bidding differently than their true valuation. This strategyproof property makes second-price auctions efficient—the bidder who values the item most wins it.",
          "concept_applied": "Second-price auction analysis demonstrating strategyproofness—the property that truthful bidding is a dominant strategy—and showing how this auction format efficiently allocates resources to the highest-value user while requiring minimal strategic sophistication from bidders.",
          "image": {
            "url": "/images/economics/second-price-auction.svg",
            "alt": "Second-Price Auction Strategy",
            "caption": "Truthful bidding as dominant strategy in second-price auctions"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Mechanism Design Principle",
          "statement": "Mechanism design (reverse game theory) involves designing the rules of economic interactions to achieve desired outcomes given strategic behavior. By understanding how different rules create different strategic incentives, economists can design auctions, markets, and institutions that are efficient, strategyproof, and revenue-maximizing despite participants acting in their self-interest.",
          "application": "This principle underlies the design of spectrum auctions, electricity markets, school choice systems, and many other economic institutions where rules must align individual incentives with social objectives.",
          "example": "The FCC uses sophisticated auction designs to allocate wireless spectrum efficiently among telecommunications companies, creating rules that encourage truthful bidding and prevent strategic manipulation.",
          "analogy": "Like designing a traffic system—you can't control where each driver wants to go, but by designing road rules, signals, and intersections properly, you can create a system where individual driving decisions collectively produce smooth traffic flow.",
          "image": {
            "url": "/images/economics/mechanism-design-principle.svg",
            "alt": "Mechanism Design Principle",
            "caption": "Designing rules to achieve desired outcomes given strategic behavior"
          }
        }
      ]
    }
  ],
  "key_terms": [
    "Game Theory",
    "Strategic Interdependence",
    "Nash Equilibrium",
    "Dominant Strategy",
    "Payoff Matrix",
    "Mixed Strategy",
    "Simultaneous Game",
    "Sequential Game",
    "Backward Induction",
    "Subgame Perfect Equilibrium",
    "Prisoner's Dilemma",
    "Zero-Sum Game",
    "Mechanism Design",
    "Auction Theory",
    "Strategyproofness",
    "Complete Information",
    "Perfect Information",
    "Game Tree",
    "Reaction Function",
    "Credible Threat"
  ],
  "summary": "Game theory provides a systematic framework for analyzing strategic decision-making where outcomes depend on the interactions between multiple decision-makers. The fundamental solution concept is Nash equilibrium—strategies where no player can benefit by unilaterally deviating. Key game types include simultaneous games (analyzed with payoff matrices), sequential games (analyzed with game trees and backward induction), and games with incomplete information. Applications in economics include oligopoly behavior, where firms strategically choose prices and outputs; auction design, where rules create different bidding incentives; and mechanism design, where institutions are structured to achieve desired outcomes despite strategic behavior. Game theory explains why individually rational decisions can lead to collectively suboptimal outcomes (prisoner's dilemma), how credible commitments and threats influence strategic interactions, and why certain institutions efficiently allocate resources while others create strategic inefficiencies. This framework has become essential for understanding modern economic phenomena involving strategic interdependence."
}
