{
  "title": "6.5 Long Run Equilibrium in Perfect Competition",
  "expanded_description": "Analyzing the long-run equilibrium conditions in perfectly competitive markets where free entry and exit drive economic profits to zero, firms produce at minimum efficient scale, and markets achieve both productive and allocative efficiency.",
  "core_concept": {
    "principle": "In long-run competitive equilibrium, firms earn zero economic profit (P = ATC), produce at minimum average cost (productive efficiency), and set price equal to marginal cost (allocative efficiency), with market forces ensuring optimal resource allocation without external guidance.",
    "explanation": "The zero economic profit outcome occurs through the entry and exit process: economic profits attract new firms, increasing supply and driving down prices until profits disappear; economic losses cause firm exits, reducing supply and raising prices until losses are eliminated. This self-correcting mechanism ensures that in long-run equilibrium, firms earn only normal profit—the minimum return necessary to keep resources in their current use.",
    "image": {
      "url": "/images/economics/long-run-equilibrium-perfect-competition.svg",
      "alt": "Long Run Equilibrium in Perfect Competition",
      "caption": "Zero economic profit outcome with P = MC = minimum ATC"
    }
  },
  "sections": [
    {
      "section_title": "The Zero Economic Profit Condition",
      "introduction": "Understanding why zero economic profit represents market efficiency rather than business failure, and how normal profits differ from economic profits in competitive equilibrium.",
      "key_concept": {
        "definition": "Zero economic profit occurs when total revenue equals total cost including all opportunity costs (P = ATC), meaning firms earn exactly the normal rate of return—the minimum necessary to keep resources employed in their current use. This differs from accounting profit, which excludes some implicit costs.",
        "context": "The zero economic profit condition signals that resources are earning their opportunity cost elsewhere in the economy and that no reallocation would increase total value, representing an efficient market outcome rather than business distress.",
        "image": {
          "url": "/images/economics/zero-economic-profit-condition.svg",
          "alt": "Zero Economic Profit Condition",
          "caption": "Relationship between economic profit, accounting profit, and normal profit"
        }
      },
      "classifications": [
        {
          "type": "Profit Concepts and Measurements",
          "value": "Differentiating between profit types in equilibrium analysis",
          "characteristics": ["Economic Profit", "Accounting Profit", "Normal Profit", "Opportunity Cost"],
          "behavior": "Economic profit includes all implicit opportunity costs, while accounting profit uses explicit costs only. Zero economic profit means firms earn exactly their opportunity cost—the normal return for risk and entrepreneurship.",
          "examples": [
            {
              "process": "Normal Profit Calculation",
              "explanation": "Normal profit represents the return to entrepreneurship and risk-taking that exactly matches what the resources could earn in their next-best alternative use, making economic profit zero.",
              "image": {
                "url": "/images/economics/normal-profit-calculation.svg",
                "alt": "Normal Profit Calculation",
                "caption": "How normal profit represents opportunity cost of resources"
              }
            },
            {
              "process": "Economic vs Accounting Profit",
              "explanation": "A firm can have positive accounting profit while having zero economic profit if the accounting profit exactly equals the owner's implicit opportunity costs (forgone salary, alternative investments).",
              "image": {
                "url": "/images/economics/economic-vs-accounting-profit.svg",
                "alt": "Economic vs Accounting Profit",
                "caption": "Relationship between different profit measures"
              }
            }
          ]
        },
        {
          "type": "Long-Run Equilibrium Conditions",
          "value": "Multiple simultaneous efficiency conditions",
          "characteristics": ["P = MC (Allocative Efficiency)", "P = min ATC (Productive Efficiency)", "Zero Economic Profit", "Optimal Plant Size"],
          "behavior": "In long-run competitive equilibrium, three conditions hold simultaneously: price equals marginal cost, price equals minimum average total cost, and economic profit equals zero, ensuring both allocative and productive efficiency.",
          "examples": [
            {
              "process": "Triple Equality Condition",
              "explanation": "The fundamental long-run equilibrium condition P = MC = minimum ATC ensures that consumers get the optimal quantity at the lowest possible cost with no wasted resources.",
              "image": {
                "url": "/images/economics/triple-equality-condition.svg",
                "alt": "Triple Equality Condition",
                "caption": "P = MC = minimum ATC as the complete efficiency condition"
              }
            },
            {
              "process": "Optimal Scale Achievement",
              "explanation": "Firms automatically select the plant size that minimizes long-run average costs, achieving the most efficient production scale through competitive pressure.",
              "image": {
                "url": "/images/economics/optimal-scale-achievement.svg",
                "alt": "Optimal Scale Achievement",
                "caption": "How competition drives firms to most efficient scale"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Long-Run Equilibrium Calculation",
          "problem": "A perfectly competitive industry has market demand P = 100 - 0.02Q. All firms have identical cost functions TC = 100 + 10Q + Q². Determine the long-run equilibrium price, output per firm, number of firms, and verify zero economic profit.",
          "step_by_step": [
            {
              "step": "Find Minimum ATC",
              "explanation": "Determine the price where zero economic profit occurs",
              "calculation": "ATC = TC/Q = 100/Q + 10 + Q\nFind min ATC where dATC/dQ = -100/Q² + 1 = 0\nQ² = 100 → Q = 10\nMin ATC = 100/10 + 10 + 10 = 10 + 10 + 10 = 30\nLong-run P = min ATC = 30"
            },
            {
              "step": "Calculate Market Quantity",
              "explanation": "Find total market demand at equilibrium price",
              "calculation": "P = 100 - 0.02Q\n30 = 100 - 0.02Q\n0.02Q = 70\nQ = 3,500 units"
            },
            {
              "step": "Determine Output Per Firm",
              "explanation": "Each firm produces at minimum ATC point",
              "calculation": "Each firm produces Q = 10 units (from min ATC calculation)"
            },
            {
              "step": "Calculate Number of Firms",
              "explanation": "Divide total market output by output per firm",
              "calculation": "Number of firms = Total Q / Q per firm = 3,500 / 10 = 350 firms"
            },
            {
              "step": "Verify Zero Economic Profit",
              "explanation": "Confirm that at equilibrium, economic profit is zero",
              "calculation": "TR per firm = P × Q = 30 × 10 = 300\nTC per firm = 100 + 10(10) + (10)² = 100 + 100 + 100 = 300\nEconomic Profit = TR - TC = 300 - 300 = 0 ✓"
            },
            {
              "step": "Check MC Condition",
              "explanation": "Verify that P = MC at equilibrium",
              "calculation": "MC = dTC/dQ = 10 + 2Q\nAt Q=10: MC = 10 + 20 = 30\nP = 30, so P = MC ✓"
            }
          ],
          "final_answer": "Long-run equilibrium: Price = $30, Market quantity = 3,500 units, Each firm produces 10 units, Number of firms = 350. At this equilibrium, economic profit is zero (P = ATC = $30) and allocative efficiency is achieved (P = MC = $30). The market automatically reaches this outcome through entry and exit responding to profit signals.",
          "concept_applied": "Long-run competitive equilibrium where free entry and exit ensure zero economic profit, with firms producing at minimum average cost and price equal to marginal cost, demonstrating the self-regulating nature of perfectly competitive markets.",
          "image": {
            "url": "/images/economics/long-run-equilibrium-calculation.svg",
            "alt": "Long Run Equilibrium Calculation",
            "caption": "Mathematical determination of long-run competitive equilibrium"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Normal Profit Benchmark Principle",
          "statement": "Zero economic profit represents the efficient market benchmark where resources earn exactly their opportunity cost—no more and no less. This outcome signals that consumer valuations exactly match production costs at the margin, and that resources cannot earn higher returns in alternative uses. Positive economic profits signal under-allocation of resources, while negative economic profits signal over-allocation.",
          "application": "This principle explains why competitive markets tend toward zero economic profit in the long run and provides the benchmark for evaluating market efficiency and resource allocation across different industries.",
          "example": "When a new technology creates economic profits, resources flow into that industry until profits return to normal, ensuring that the benefits of innovation are passed to consumers through lower prices rather than retained as permanent excess profits.",
          "analogy": "Like water seeking its own level - economic profits act as slopes that guide resource flows until a flat equilibrium is reached where no further reallocation can improve outcomes.",
          "image": {
            "url": "/images/economics/normal-profit-benchmark.svg",
            "alt": "Normal Profit Benchmark Principle",
            "caption": "Zero economic profit as the efficient equilibrium condition"
          }
        }
      ]
    },
    {
      "section_title": "Entry, Exit and Market Adjustment Process",
      "introduction": "The journey from short-run disequilibrium to long-run equilibrium occurs through the entry and exit process, where profit signals guide resource allocation and market capacity adjustments.",
      "key_concept": {
        "definition": "The entry-exit mechanism functions as the market's self-correction system: economic profits attract new firms, increasing supply and driving down prices until profits disappear; economic losses cause firm exits, reducing supply and raising prices until losses are eliminated.",
        "context": "This dynamic adjustment process ensures that markets automatically respond to changing conditions and maintain efficiency over time, with the speed of adjustment depending on entry barriers, resource mobility, and information availability.",
        "image": {
          "url": "/images/economics/entry-exit-adjustment-process.svg",
          "alt": "Entry and Exit Adjustment Process",
          "caption": "How profit signals drive market capacity adjustments"
        }
      },
      "classifications": [
        {
          "type": "Entry Response to Profits",
          "value": "Market expansion through new firm creation",
          "characteristics": ["Profit Signals", "Resource Attraction", "Supply Increase", "Price Decline"],
          "behavior": "When existing firms earn economic profits, new entrepreneurs enter the market, bidding up input prices and increasing output until market price falls to the zero-profit level.",
          "examples": [
            {
              "process": "New Firm Creation Dynamics",
              "explanation": "Economic profits attract entrepreneurs who establish new firms, increasing industry capacity and market supply. The entry process continues until the additional supply drives prices down to the break-even level.",
              "image": {
                "url": "/images/economics/new-firm-creation.svg",
                "alt": "New Firm Creation Dynamics",
                "caption": "How profits stimulate market entry and capacity expansion"
              }
            },
            {
              "process": "Input Market Effects",
              "explanation": "Entry bids up prices for specialized inputs (skilled labor, raw materials, prime locations), shifting cost curves upward and helping to eliminate the original profit opportunity.",
              "image": {
                "url": "/images/economics/input-market-effects.svg",
                "alt": "Input Market Effects",
                "caption": "How entry affects input prices and costs"
              }
            }
          ]
        },
        {
          "type": "Exit Response to Losses",
          "value": "Market contraction through firm departure",
          "characteristics": ["Loss Signals", "Resource Release", "Supply Decrease", "Price Increase"],
          "behavior": "When firms experience economic losses, marginal operators exit the industry, reducing market supply and allowing prices to rise until remaining firms can cover their costs.",
          "examples": [
            {
              "process": "Marginal Firm Exit",
              "explanation": "The highest-cost firms exit first when prices fall below their break-even points, removing their output from the market and reducing total supply, which helps raise prices for remaining firms.",
              "image": {
                "url": "/images/economics/marginal-firm-exit.svg",
                "alt": "Marginal Firm Exit",
                "caption": "How losses drive the least efficient firms from the market"
              }
            },
            {
              "process": "Capacity Reduction Mechanism",
              "explanation": "As firms exit, industry capacity declines, reducing market supply. This supply reduction continues until prices rise sufficiently for remaining firms to cover their costs.",
              "image": {
                "url": "/images/economics/capacity-reduction.svg",
                "alt": "Capacity Reduction Mechanism",
                "caption": "How exit reduces industry capacity and raises prices"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Market Adjustment from Short-Run to Long-Run Equilibrium",
          "problem": "A competitive industry has 200 identical firms, each with TC = 50 + 2Q². Market demand is P = 100 - 0.1Q. A technological innovation reduces costs to TC = 50 + Q² for all firms. Analyze the adjustment process to new long-run equilibrium.",
          "step_by_step": [
            {
              "step": "Original Equilibrium",
              "explanation": "Find pre-innovation equilibrium",
              "calculation": "Original MC = 4Q, so firm supply: Q = P/4\nIndustry supply: Q_s = 200 × (P/4) = 50P\nSet supply = demand: 50P = 1000 - 10P\n60P = 1000 → P = 16.67\nQ = 50×16.67 = 833.5\nEach firm: Q = 4.17, Profit = (16.67×4.17) - (50+34.72) = 69.5-84.72 = -15.22 (loss)"
            },
            {
              "step": "Immediate Short-Run Impact",
              "explanation": "Effect of cost reduction with fixed number of firms",
              "calculation": "New MC = 2Q, so firm supply: Q = P/2\nIndustry supply: Q_s = 200 × (P/2) = 100P\nSet new supply = demand: 100P = 1000 - 10P\n110P = 1000 → P = 9.09\nQ = 100×9.09 = 909\nEach firm: Q = 4.55, Profit = (9.09×4.55) - (50+20.70) = 41.36-70.70 = -29.34 (larger loss)"
            },
            {
              "step": "Long-Run Equilibrium Conditions",
              "explanation": "Find new zero-profit equilibrium",
              "calculation": "New ATC = 50/Q + Q\nMin ATC where dATC/dQ = -50/Q² + 1 = 0\nQ² = 50 → Q = 7.07\nMin ATC = 50/7.07 + 7.07 = 7.07 + 7.07 = 14.14\nLong-run P = 14.14"
            },
            {
              "step": "Long-Run Market Quantity",
              "explanation": "Find market output at new equilibrium price",
              "calculation": "At P=14.14, market demand Q = 1000 - 10×14.14 = 858.6"
            },
            {
              "step": "Long-Run Number of Firms",
              "explanation": "Calculate new equilibrium firm count",
              "calculation": "Each firm produces Q=7.07 at P=14.14\nNumber of firms = 858.6 / 7.07 = 121.4 ≈ 121 firms"
            },
            {
              "step": "Adjustment Process Description",
              "explanation": "Explain the transition dynamics",
              "calculation": "Initial: 200 firms with losses\nCost reduction initially increases losses due to price drop\nExit of 79 firms (200 - 121)\nSupply reduction raises price from 9.09 to 14.14\nRemaining firms earn zero profit at efficient scale"
            }
          ],
          "final_answer": "Original equilibrium: 200 firms with $15.22 losses each. Immediate impact: Cost reduction causes price drop to $9.09, increasing losses to $29.34 per firm. Long-run equilibrium: Exit of 79 firms leaves 121 firms, price rises to $14.14, each produces 7.07 units with zero economic profit. The technological improvement ultimately benefits consumers through lower prices (from $16.67 to $14.14) and increased output (from 833.5 to 858.6 units), while forcing industry consolidation to fewer, more efficient firms.",
          "concept_applied": "Market adjustment from technological change showing how cost reductions can initially increase losses, triggering exit that eventually leads to a new equilibrium with lower prices, more output, and fewer but larger firms operating at optimal scale.",
          "image": {
            "url": "/images/economics/technological-change-adjustment.svg",
            "alt": "Technological Change Adjustment",
            "caption": "Market adjustment process following cost-reducing innovation"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Invisible Hand Adjustment Principle",
          "statement": "Market prices serve as invisible signals that coordinate the independent actions of buyers and sellers, with profit and loss providing the incentives that automatically guide resources toward their most valued uses. No central direction is needed—the pursuit of self-interest through the entry-exit process naturally moves markets toward efficient long-run equilibrium.",
          "application": "This principle explains how decentralized market economies achieve coordination and efficiency without central planning, and why attempts to suppress price signals or prevent entry/exit typically reduce economic welfare.",
          "example": "When consumer preferences shift toward electric vehicles, high profits in that sector attract investment and entry, while losses in internal combustion vehicle production trigger exit, automatically reallocating resources toward the changing pattern of demand.",
          "analogy": "Like a complex ecosystem where each organism's pursuit of survival collectively maintains balance—no central planner directs which plants or animals should thrive, but the system self-organizes through individual responses to environmental signals.",
          "image": {
            "url": "/images/economics/invisible-hand-adjustment.svg",
            "alt": "Invisible Hand Adjustment Principle",
            "caption": "How decentralized decisions achieve coordinated outcomes"
          }
        }
      ]
    },
    {
      "section_title": "Efficiency Properties and Welfare Implications",
      "introduction": "Long-run competitive equilibrium achieves remarkable efficiency properties that maximize social welfare, providing the benchmark against which real market performance is evaluated.",
      "key_concept": {
        "definition": "Perfect competition achieves both productive efficiency (production at minimum cost) and allocative efficiency (production of optimal quantity where P = MC), maximizing the sum of consumer and producer surplus and ensuring Pareto optimality where no reallocation can make someone better off without making others worse off.",
        "context": "These efficiency properties explain why competitive markets serve as the theoretical ideal and why deviations from perfect competition typically reduce economic welfare through deadweight losses.",
        "image": {
          "url": "/images/economics/efficiency-properties-welfare.svg",
          "alt": "Efficiency Properties and Welfare Implications",
          "caption": "Total surplus maximization in competitive equilibrium"
        }
      },
      "classifications": [
        {
          "type": "Productive Efficiency",
          "value": "Cost minimization in production",
          "characteristics": ["Minimum ATC Operation", "Optimal Scale", "No Waste", "Technical Efficiency"],
          "behavior": "Competitive pressure forces firms to adopt the most efficient production methods and operate at optimal scale, eliminating organizational slack and ensuring that goods are produced at the lowest possible resource cost.",
          "examples": [
            {
              "process": "Cost Minimization Pressure",
              "explanation": "Firms that fail to minimize costs will earn below-normal profits and eventually exit, while efficient firms survive. This continuous selection process ensures that production occurs using the least-cost methods.",
              "image": {
                "url": "/images/economics/cost-minimization-pressure.svg",
                "alt": "Cost Minimization Pressure",
                "caption": "How competition eliminates inefficient producers"
              }
            },
            {
              "process": "Optimal Scale Achievement",
              "explanation": "Free entry and exit ensure that in long-run equilibrium, all firms operate at the minimum point of their long-run average cost curves, achieving the most efficient production scale.",
              "image": {
                "url": "/images/economics/optimal-scale-achievement.svg",
                "alt": "Optimal Scale Achievement",
                "caption": "Production at minimum long-run average cost"
              }
            }
          ]
        },
        {
          "type": "Allocative Efficiency",
          "value": "Optimal resource allocation across uses",
          "characteristics": ["P = MC Condition", "Consumer Sovereignty", "Marginal Benefit = Marginal Cost", "No Deadweight Loss"],
          "behavior": "The P = MC condition ensures that resources are allocated to produce exactly the quantity where the marginal benefit to consumers equals the marginal cost of production, maximizing total economic welfare.",
          "examples": [
            {
              "process": "Marginal Decision Optimality",
              "explanation": "When P = MC, the value consumers place on the last unit (measured by their willingness to pay) exactly equals the opportunity cost of producing it, indicating optimal production level.",
              "image": {
                "url": "/images/economics/marginal-decision-optimality.svg",
                "alt": "Marginal Decision Optimality",
                "caption": "P = MC as the allocative efficiency condition"
              }
            },
            {
              "process": "Total Surplus Maximization",
              "explanation": "Competitive markets maximize the sum of consumer and producer surplus—the total gains from trade—indicating that all mutually beneficial exchanges have occurred.",
              "image": {
                "url": "/images/economics/total-surplus-maximization.svg",
                "alt": "Total Surplus Maximization",
                "caption": "How competition maximizes combined consumer and producer benefits"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Welfare Analysis of Competitive Equilibrium",
          "problem": "A competitive market has demand P = 120 - 2Q and supply P = 20 + Q. Calculate consumer surplus, producer surplus, and total surplus. Then analyze the welfare loss if output is restricted to Q = 20.",
          "step_by_step": [
            {
              "step": "Find Competitive Equilibrium",
              "explanation": "Determine equilibrium price and quantity",
              "calculation": "Set demand = supply: 120 - 2Q = 20 + Q\n100 = 3Q → Q = 33.33\nP = 120 - 2(33.33) = 53.33"
            },
            {
              "step": "Calculate Consumer Surplus",
              "explanation": "Area between demand curve and price",
              "calculation": "CS = ½ × (120 - 53.33) × 33.33 = ½ × 66.67 × 33.33 = 1,111.11"
            },
            {
              "step": "Calculate Producer Surplus",
              "explanation": "Area between supply curve and price",
              "calculation": "PS = ½ × (53.33 - 20) × 33.33 = ½ × 33.33 × 33.33 = 555.56"
            },
            {
              "step": "Calculate Total Surplus",
              "explanation": "Sum of consumer and producer surplus",
              "calculation": "TS = CS + PS = 1,111.11 + 555.56 = 1,666.67"
            },
            {
              "step": "Analyze Output Restriction",
              "explanation": "Calculate welfare at Q = 20",
              "calculation": "At Q=20: P_demand = 120 - 2(20) = 80\nP_supply = 20 + 20 = 40\nCS = ½ × (120-80) × 20 + (80-53.33)×20? Wait, need proper calculation"
            },
            {
              "step": "Correct Restricted Output Welfare",
              "explanation": "Properly calculate surplus with output restriction",
              "calculation": "At Q=20:\nCS = ½ × (120-80) × 20 = ½ × 40 × 20 = 400\nPS = ½ × (40-20) × 20 = ½ × 20 × 20 = 200\nTS = 400 + 200 = 600\nDeadweight loss = 1,666.67 - 600 = 1,066.67"
            },
            {
              "step": "Verify Allocative Efficiency",
              "explanation": "Check P = MC condition at both output levels",
              "calculation": "At Q=33.33: P=53.33, MC=20+33.33=53.33 ✓\nAt Q=20: P_demand=80, MC=20+20=40 → P > MC (inefficient)"
            }
          ],
          "final_answer": "Competitive equilibrium: Q=33.33, P=53.33, Consumer surplus=1,111.11, Producer surplus=555.56, Total surplus=1,666.67. With output restricted to Q=20: Consumer surplus=400, Producer surplus=200, Total surplus=600, Deadweight loss=1,066.67. The output restriction creates massive inefficiency, reducing total surplus by 64% and demonstrating why the competitive equilibrium maximizes social welfare.",
          "concept_applied": "Welfare analysis showing how competitive markets maximize total surplus through the price mechanism, with any deviation from equilibrium quantity creating deadweight loss that reduces social welfare, demonstrating the efficiency properties of long-run competitive equilibrium.",
          "image": {
            "url": "/images/economics/welfare-analysis-competitive-equilibrium.svg",
            "alt": "Welfare Analysis of Competitive Equilibrium",
            "caption": "Surplus maximization and deadweight loss from output restrictions"
          }
        }
      ],
      "principles": [
        {
          "principle": "The First Fundamental Theorem of Welfare Economics",
          "statement": "Every competitive equilibrium is Pareto efficient—no reallocation can make someone better off without making someone else worse off. This theorem provides the formal proof that perfectly competitive markets automatically achieve optimal resource allocation without any central direction, assuming complete markets, perfect information, and absence of externalities.",
          "application": "This theorem justifies reliance on market mechanisms for resource allocation and provides the benchmark for identifying market failures where government intervention might improve outcomes, such as with public goods, externalities, or information problems.",
          "example": "In competitive labor markets, workers are paid their marginal revenue product and firms hire until the value of additional output equals the wage, ensuring optimal employment levels and factor allocation without central planning.",
          "analogy": "Like a perfectly balanced scale—the competitive equilibrium represents a state where no weight can be shifted without upsetting the balance, indicating optimal allocation where all mutual gains have been exhausted.",
          "image": {
            "url": "/images/economics/first-welfare-theorem.svg",
            "alt": "First Fundamental Theorem of Welfare Economics",
            "caption": "Competitive equilibrium leads to Pareto efficient outcomes"
          }
        }
      ]
    }
  ],
  "key_terms": [
    "Long Run Equilibrium",
    "Zero Economic Profit",
    "Normal Profit",
    "Productive Efficiency",
    "Allocative Efficiency",
    "Pareto Efficiency",
    "Minimum Efficient Scale",
    "Entry and Exit",
    "Market Adjustment",
    "Perfect Competition",
    "Economic Profit",
    "Accounting Profit",
    "Opportunity Cost",
    "Consumer Surplus",
    "Producer Surplus",
    "Total Surplus",
    "Deadweight Loss",
    "First Welfare Theorem",
    "Invisible Hand",
    "Market Signals"
  ],
  "summary": "Long-run equilibrium in perfect competition represents the theoretical ideal of market efficiency, characterized by zero economic profit, production at minimum average cost (productive efficiency), and price equal to marginal cost (allocative efficiency). This outcome is achieved through the self-correcting entry-exit mechanism: economic profits attract new firms, increasing supply and driving down prices until profits disappear; economic losses cause firm exits, reducing supply and raising prices until losses are eliminated. The resulting equilibrium maximizes social welfare by ensuring that goods are produced at lowest possible cost and in optimal quantities that reflect consumer valuations. While real markets rarely achieve perfect competition, this model provides the crucial benchmark for evaluating market performance, identifying market failures, and designing economic policies that promote efficiency and consumer welfare."
}
