{
  "expanded_description": "In the long run, everything can change. Firms can enter or exit industries, build new factories, or sell off old equipment. This flexibility transforms the short-run chaos of profits and losses into a predictable equilibrium where firms earn exactly zero economic profit. Understanding long-run equilibrium in perfect competition reveals one of economics' most elegant results: competitive markets drive prices down to the minimum possible cost, force firms to be efficient, and ensure that resources are allocated to their most valued uses. This section explores how entry and exit work, what zero profit really means, and why perfectly competitive markets achieve both productive and allocative efficiency in the long run.",
  
  "core_concept": {
    "principle": "In the long run, perfectly competitive markets reach equilibrium where firms earn zero economic profit, price equals minimum average total cost ($P = \\min ATC$), and production occurs at the most efficient scale. Entry and exit of firms drive this adjustment process.",
    "explanation": "Imagine a bustling college town with many pizza places. One pizza shop discovers a new recipe and starts earning big profits. What happens? Other entrepreneurs notice and open their own pizza shops. As more shops enter, the supply of pizza increases, driving down prices. Profits at the original shop shrink. Conversely, if a town has too many pizza shops and they're all losing money, some will close. As they exit, supply decreases, prices rise, and remaining shops return to profitability. This entry and exit process continues until profits are zero - where price exactly covers all costs including a normal return to the owners' time and investment. At this point, no one wants to enter (no profit opportunity) and no one wants to exit (covering all costs). This equilibrium is stable and efficient.",
    "image": {
      "src": "images/unit6/long_run_equilibrium.png",
      "alt": "Graph showing long-run equilibrium with price at minimum ATC, firm producing at efficient scale",
      "caption": "In long-run equilibrium, the firm produces at the minimum point of its ATC curve, earning zero economic profit"
    }
  },

  "sections": [
    {
      "section_title": "6.5 Long Run Equilibrium in Perfect Competition",
      "introduction": "Think about your favorite restaurant in town. Some years, it's packed and seems to be making a fortune. Other years, it's quiet and you worry it might close. But over the long haul, successful restaurants settle into a pattern where they're doing okay - not making crazy profits, not losing money, just covering costs and providing a living for the owners. This is the long-run equilibrium of a competitive market. In this section, we'll see how the invisible hand of entry and exit guides markets toward this outcome, and why it's such an efficient result for society.",
      
      "key_concept": {
        "definition": "Long-run equilibrium in perfect competition occurs when three conditions are met: 1) Firms are producing at the profit-maximizing output where $P = MC$. 2) Firms earn zero economic profit, so $P = ATC$. 3) There is no incentive for entry or exit, which requires $P = \\min ATC$ (the lowest possible cost). Combining these gives $P = MC = ATC = \\min ATC$ at the equilibrium output.",
        "context": "The long run is defined as a period long enough that all inputs are variable and firms can enter or exit the industry. This flexibility drives the adjustment process. When existing firms earn economic profits, new firms enter, increasing market supply and driving down price until profits disappear. When firms suffer losses, some exit, decreasing supply and driving up price until losses are eliminated. The process continues until zero economic profit is restored. At this point, the market is in long-run equilibrium, and firms produce at the most efficient scale possible."
      },

      "categories": [
        {
          "type": "The Entry and Exit Mechanism",
          "description": "Entry and exit are the forces that drive markets toward long-run equilibrium. Understanding how they work is key to predicting market outcomes.",
          "examples": [
            {
              "process": "Entry when profits exist",
              "explanation": "When existing firms earn positive economic profit ($P > ATC$), it signals to entrepreneurs that resources can earn more in this industry than elsewhere. New firms enter, increasing market supply. The supply curve shifts right, causing market price to fall. Entry continues until price falls to where $P = ATC$ and profits disappear."
            },
            {
              "process": "Exit when losses exist",
              "explanation": "When firms suffer losses ($P < ATC$), some firms will exit the industry. They sell their equipment and leave. This decreases market supply, shifting the supply curve left. Market price rises. Exit continues until price rises to where $P = ATC$ and losses are eliminated."
            },
            {
              "process": "Speed of adjustment",
              "explanation": "The speed of entry and exit depends on barriers to entry and the time needed to build new capacity. In industries with low barriers (like food trucks or consulting), adjustment can be quick. In industries with high barriers (like manufacturing), adjustment takes longer. But in perfect competition, we assume free entry and exit, so adjustment continues until equilibrium is reached."
            },
            {
              "process": "**Advanced note:** Long-run industry supply curves",
              "explanation": "The shape of the long-run industry supply curve depends on how input costs change with industry output. In constant-cost industries (input prices unchanged as industry expands), long-run supply is horizontal at the minimum $ATC$. In increasing-cost industries (input prices rise with industry output), long-run supply slopes upward. In decreasing-cost industries (rare), it slopes downward."
            }
          ]
        },
        {
          "type": "Characteristics of Long-Run Equilibrium",
          "description": "When long-run equilibrium is reached, several important conditions hold simultaneously.",
          "examples": [
            {
              "process": "Zero economic profit ($P = ATC$)",
              "explanation": "Firms earn exactly zero economic profit, meaning they cover all costs including opportunity costs. This is often called \"normal profit\" - the minimum return needed to keep resources in the industry. Accounting profit may still be positive, but economic profit is zero."
            },
            {
              "process": "Production at minimum $ATC$",
              "explanation": "Firms produce at the output level that minimizes average total cost. This is the most efficient scale of production. Any other output would have higher average costs. This achieves productive efficiency."
            },
            {
              "process": "Price equals marginal cost ($P = MC$)",
              "explanation": "The profit-maximizing condition holds, and since $P = MC$, the value consumers place on the last unit (price) exactly equals the cost of producing it. This achieves allocative efficiency."
            },
            {
              "process": "No incentive for entry or exit",
              "explanation": "Because profits are zero, no outside firms want to enter. Because losses are zero, no existing firms want to exit. The market is stable until something changes (technology, demand, input costs)."
            }
          ]
        },
        {
          "type": "Graphical Analysis",
          "description": "The transition from short-run equilibrium to long-run equilibrium can be seen through shifts in market and firm graphs.",
          "examples": [
            {
              "process": "Starting with short-run profit",
              "explanation": "Begin with market demand $D$ and short-run supply $S_{SR}$ determining price $P_1 > \\min ATC$. A representative firm at this price earns profit (rectangle where $P > ATC$). This profit attracts entry."
            },
            {
              "process": "Entry shifts market supply",
              "explanation": "As new firms enter, market supply shifts right to $S_{SR}'$. Market price falls from $P_1$ to $P_2$. At the firm level, the horizontal demand curve shifts down. Profit shrinks."
            },
            {
              "process": "Equilibrium reached",
              "explanation": "Entry continues until price falls to $P^* = \\min ATC$. At this price, each firm produces at $Q^*$ where $P = MC = ATC = \\min ATC$. Profit is zero. No further entry occurs."
            },
            {
              "process": "Starting with short-run losses",
              "explanation": "If instead firms were losing money ($P < ATC$), exit would occur. Market supply shifts left, price rises, and losses shrink until price rises to $\\min ATC$ and zero profit is restored."
            }
          ]
        },
        {
          "type": "Efficiency in Long-Run Equilibrium",
          "description": "Perfect competition in long-run equilibrium achieves two important types of efficiency that other market structures cannot match.",
          "examples": [
            {
              "process": "Productive efficiency",
              "explanation": "Productive efficiency means producing at the lowest possible cost. In long-run equilibrium, firms produce at the minimum point of their $ATC$ curves. No other output level would yield lower average cost. This ensures resources are not wasted in production."
            },
            {
              "process": "Allocative efficiency",
              "explanation": "Allocative efficiency means producing the mix of goods that consumers value most. It occurs when $P = MC$. Price measures what consumers are willing to pay for the last unit; marginal cost measures what society gives up to produce it. When they're equal, society can't reallocate resources to make anyone better off without harming someone else."
            },
            {
              "process": "Consumer and producer surplus",
              "explanation": "In long-run equilibrium, total surplus (consumer surplus + producer surplus) is maximized. Consumer surplus is the area between demand and price. Producer surplus is the area between price and supply (which equals $MC$). No other output level would yield larger total surplus."
            },
            {
              "process": "**Advanced note:** Dynamic efficiency",
              "explanation": "While perfect competition achieves static efficiency (productive and allocative), it may be less dynamic than other structures. Competitive firms have little profit to reinvest in R&D, so innovation may be slower than in markets with some monopoly power. This is a trade-off economists debate."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Zero Economic Profit Does Not Mean Failure",
          "statement": "In long-run equilibrium, firms earn zero economic profit, which includes a normal return on all resources. This is a sustainable, healthy situation where firms cover all costs including opportunity costs. Accounting profit may still be positive.",
          "application": "This principle helps avoid confusion when analyzing industries. Students sometimes think zero profit means firms are failing. In reality, zero economic profit means resources are earning exactly what they could elsewhere - no better, no worse. It's a signal that the industry is in balance.",
          "example": "A small business owner earns $\\$80,000$ accounting profit. But she could earn $\\$70,000$ working for someone else and could rent her building for $\\$15,000$. Her economic profit is $\\$80,000 - (\\$70,000 + \\$15,000) = -\\$5,000$ (loss). She should exit. If instead her accounting profit was $\\$85,000$, economic profit = $0$, she's covering all opportunity costs - this is sustainable long-run equilibrium."
        },
        {
          "principle": "Long-Run Equilibrium Achieves Productive Efficiency",
          "statement": "In long-run equilibrium, perfectly competitive firms produce at the minimum point of their average total cost curves. This means they're using the most efficient production methods and scale possible with current technology.",
          "application": "This explains why competitive industries tend to have low costs and prices. Firms that don't produce efficiently can't survive - they'll have higher costs and lose money. Only the most efficient production methods persist. This pressure for efficiency benefits consumers through lower prices.",
          "example": "Consider the personal computer industry in the 1980s vs today. Early on, many small manufacturers had different cost structures. Over time, competition drove firms to adopt efficient production methods, outsource components, and achieve economies of scale. Today, PC manufacturing is highly efficient, with thin profit margins and low prices."
        },
        {
          "principle": "Long-Run Equilibrium Achieves Allocative Efficiency",
          "statement": "In long-run equilibrium, price equals marginal cost ($P = MC$). This means the value consumers place on the last unit produced exactly equals the cost of resources used to produce it. Society's resources are allocated optimally.",
          "application": "This is a powerful result: competitive markets, left to themselves, produce the socially optimal quantity of goods. No government planning needed - the invisible hand guides resources to their most valued uses. This is why economists generally favor competition and worry about monopoly power that breaks the $P = MC$ condition.",
          "example": "Suppose the marginal cost of producing a loaf of bread is $\\$2$, and consumers are willing to pay $\\$3$ for the 1,000th loaf. Society would benefit from more bread production (value > cost). In a competitive market, firms will produce until price falls to $\\$2$, where value equals cost. This ensures the right amount of bread is produced."
        },
        {
          "principle": "Entry and Exit Are the Adjustment Mechanisms",
          "statement": "The movement toward long-run equilibrium is driven by firms entering when profits exist and exiting when losses occur. This process continues until zero profit is restored, regardless of whether the initial disturbance was a demand shock, cost change, or technology improvement.",
          "application": "This principle helps predict how markets respond to changes. If demand increases, short-run profits emerge, entry follows, supply increases, and price falls back toward minimum $ATC$. If a cost-saving technology is invented, early adopters earn profits, entry spreads the technology, and long-run price falls to the new lower minimum $ATC$.",
          "example": "When ride-sharing apps like Uber and Lyft first appeared, early drivers earned high profits. This attracted many new drivers, increasing supply and reducing fares. Over time, driver earnings fell to a level just covering their costs (including vehicle depreciation) - zero economic profit. The market adjusted through entry."
        }
      ],

      "worked_examples": [
        {
          "title": "Analyzing the Transition to Long-Run Equilibrium",
          "problem": "The market for wheat is initially in long-run equilibrium. Then, due to health studies showing benefits of whole grains, demand for wheat increases permanently. Using supply and demand graphs and firm cost curves, trace the adjustment from short-run to long-run equilibrium. Describe what happens to price, quantity, firm profits, and the number of firms in each phase.",
          "step_by_step": [
            {
              "step": "Initial long-run equilibrium",
              "explanation": "Initially, market demand $D_1$ and supply $S_1$ intersect at price $P_1$, with market quantity $Q_1$. Each firm produces $q_1$ where $P_1 = MC = \\min ATC$, earning zero economic profit. Number of firms $N_1 = Q_1/q_1$."
            },
            {
              "step": "Demand increases (short-run response)",
              "explanation": "Demand shifts right to $D_2$. In the short run, number of firms is fixed. Market price rises to $P_2 > P_1$. Existing firms increase output along their $MC$ curves to $q_2 > q_1$. At $P_2$, firms now earn positive economic profit because $P_2 > ATC$ at $q_2$. Market quantity increases to $Q_2$."
            },
            {
              "step": "Entry begins (adjustment phase)",
              "explanation": "Positive profits attract new firms to enter the wheat industry. As new firms enter, market supply shifts right from $S_1$ to $S_2$, then $S_3$, etc. Market price begins to fall from $P_2$ toward $P_1$. Existing firms reduce output as price falls. Profits shrink."
            },
            {
              "step": "New long-run equilibrium",
              "explanation": "Entry continues until price falls back to $P^* = P_1 = \\min ATC$. At this price, each firm produces $q^* = q_1$ (original output per firm) and earns zero economic profit. Market quantity is now $Q_3 > Q_2 > Q_1$. Number of firms $N_2 = Q_3/q^* > N_1$ because more firms now serve the larger market at the same per-firm output."
            },
            {
              "step": "Summary of changes",
              "explanation": "Price: Returns to original level. Firm output: Returns to original level. Firm profit: Zero in both equilibria (temporarily positive in between). Number of firms: Increases. Market quantity: Increases permanently due to more firms."
            }
          ],
          "final_answer": "The adjustment sequence: Initial equilibrium ($P_1$, zero profit). Demand increase → short-run price rises to $P_2$, firms earn profit, increase output. Entry occurs → supply shifts right, price falls, profits shrink. New equilibrium: price returns to $P_1$, firms produce original output, zero profit restored, more firms in industry, higher market quantity.",
          "concept_applied": "Long-run equilibrium is restored after demand shifts through entry and exit. Price returns to minimum ATC, firm output returns to efficient scale, but number of firms adjusts to serve new market quantity."
        },
        {
          "title": "Calculating Long-Run Equilibrium Values",
          "problem": "In a perfectly competitive industry, each firm has total cost: $TC = 100 + 5q + q^2$. Market demand is $Q_D = 1000 - 20P$, where $Q$ is market quantity and $P$ is price. a) Find the long-run equilibrium price, output per firm, and number of firms. b) If demand increases to $Q_D = 1200 - 20P$, find the new long-run equilibrium price, output per firm, and number of firms.",
          "step_by_step": [
            {
              "step": "Find minimum ATC for a firm",
              "explanation": "$ATC = TC/q = 100/q + 5 + q$. To find minimum, set derivative = 0 or use $MC = ATC$. $MC = 5 + 2q$. Set $MC = ATC$: $5 + 2q = 100/q + 5 + q$ → $2q = 100/q + q$ → $q = 100/q$ → $q^2 = 100$ → $q = 10$ (positive). At $q = 10$, $ATC = 100/10 + 5 + 10 = 10 + 5 + 10 = \\$25$. So long-run equilibrium price $P^* = \\$25$, output per firm $q^* = 10$."
            },
            {
              "step": "Find market quantity and number of firms initially",
              "explanation": "With $P = \\$25$, market demand $Q_D = 1000 - 20(25) = 1000 - 500 = 500$. Number of firms $N = Q/q = 500/10 = 50$ firms."
            },
            {
              "step": "Verify long-run conditions",
              "explanation": "At $P = \\$25$, each firm produces $q = 10$ where $P = MC$ ($25 = 5 + 2(10) = 25$). $P = ATC = \\$25$, so zero profit. $P = \\min ATC$, so productive efficiency achieved. All conditions satisfied."
            },
            {
              "step": "Analyze demand increase to $Q_D = 1200 - 20P$",
              "explanation": "In long run, price must return to minimum $ATC = \\$25$ (assuming constant-cost industry). At $P = \\$25$, new market quantity $Q_D = 1200 - 20(25) = 1200 - 500 = 700$. With each firm still producing $q = 10$, number of firms $N = 700/10 = 70$ firms."
            },
            {
              "step": "Check short-run adjustment (briefly)",
              "explanation": "In the short run, with 50 firms fixed, price would rise above \\$25, creating profits, attracting entry. In long run, entry brings price back to \\$25, and the only permanent change is more firms (70 vs 50) serving the larger market at same price and per-firm output."
            }
          ],
          "final_answer": "a) Initial equilibrium: $P^* = \\$25$, $q^* = 10$ per firm, $N = 50$ firms. b) After demand increase: $P^* = \\$25$ (same), $q^* = 10$ (same), $N = 70$ firms.",
          "concept_applied": "In a constant-cost industry, long-run equilibrium price is fixed at minimum ATC. Demand increases lead to more firms, not higher prices. Each firm continues producing at efficient scale with zero profit."
        },
        {
          "title": "Distinguishing Short-Run and Long-Run Effects",
          "problem": "A technological breakthrough reduces production costs for all firms in a competitive industry. Each firm's cost curves shift down: new $TC = 64 + 4q + q^2$ (old was $TC = 100 + 5q + q^2$ from previous example). Market demand is $Q_D = 1000 - 20P$. Describe the short-run and long-run effects on price, firm output, firm profit, and number of firms. Calculate the new long-run equilibrium.",
          "step_by_step": [
            {
              "step": "Find new minimum ATC",
              "explanation": "New $ATC = 64/q + 4 + q$. Set $MC = ATC$ for minimum. $MC = 4 + 2q$. Set $4 + 2q = 64/q + 4 + q$ → $2q = 64/q + q$ → $q = 64/q$ → $q^2 = 64$ → $q = 8$. At $q=8$, $ATC = 64/8 + 4 + 8 = 8 + 4 + 8 = \\$20$. So new minimum ATC = \\$20."
            },
            {
              "step": "Short-run effects (immediately after technology improves)",
              "explanation": "In the short run, number of firms is fixed at 50 (from previous equilibrium). Market price is still \\$25 initially because supply hasn't changed. But each firm now has lower costs. At $P = \\$25$, each firm produces where $P = MC$: $25 = 4 + 2q$ → $2q = 21$ → $q = 10.5$. At this output, $ATC$ at $q=10.5$ is $64/10.5 + 4 + 10.5 ≈ 6.10 + 4 + 10.5 = \\$20.60$. Profit per unit = $\\$25 - \\$20.60 = \\$4.40$, total profit per firm = $\\$4.40 × 10.5 ≈ \\$46.20$. Existing firms earn positive economic profit in short run."
            },
            {
              "step": "Long-run adjustment",
              "explanation": "Positive profits attract new firms to enter. As they enter, market supply increases, price falls. Entry continues until price falls to new minimum $ATC = \\$20$. At $P = \\$20$, each firm produces where $P = MC$: $20 = 4 + 2q$ → $2q = 16$ → $q = 8$ (the efficient scale). Profit = zero."
            },
            {
              "step": "Find new number of firms",
              "explanation": "At $P = \\$20$, market demand $Q_D = 1000 - 20(20) = 1000 - 400 = 600$. Each firm produces $q = 8$, so number of firms $N = 600/8 = 75$ firms."
            },
            {
              "step": "Compare old and new equilibria",
              "explanation": "Old: $P = \\$25$, $q = 10$, $N = 50$, market $Q = 500$. New: $P = \\$20$, $q = 8$, $N = 75$, market $Q = 600$. Price fell, per-firm output fell (because efficient scale changed), number of firms increased, market quantity increased. Consumers benefit from lower price and more output."
            }
          ],
          "final_answer": "Short run: At original price \\$25, firms earn profits (≈\\$46 per firm), increase output to 10.5. Long run: Entry drives price down to new minimum ATC = \\$20, firm output = 8, number of firms = 75, market quantity = 600. Technology improvement benefits consumers through lower prices and greater availability.",
          "concept_applied": "Cost-reducing technology leads to short-run profits for existing firms, followed by entry that drives price down to the new lower minimum ATC. Long-run equilibrium features lower prices, more firms, and greater market output, with each firm producing at the new efficient scale."
        }
      ],

      "image": {
        "src": "images/unit6/long_run_adjustment.png",
        "alt": "Two-panel graph showing market adjustment from short-run profit to long-run equilibrium through entry",
        "caption": "Entry shifts market supply right, driving price down until firms earn zero profit at minimum ATC"
      }
    }
  ],

  "key_terms": [
    "Long-run equilibrium",
    "Zero economic profit",
    "Normal profit",
    "Entry and exit",
    "Minimum efficient scale",
    "Productive efficiency",
    "Allocative efficiency",
    "$P = MC = \\min ATC$",
    "Constant-cost industry",
    "Increasing-cost industry",
    "Decreasing-cost industry",
    "Long-run industry supply curve",
    "Adjustment process",
    "Break-even point",
    "Efficient scale",
    "Consumer surplus",
    "Producer surplus"
  ],

  "summary": "Long-run equilibrium in perfect competition represents the ultimate outcome of competitive forces when all adjustments are possible. The key result is that firms earn zero economic profit, price equals minimum average total cost ($P = \\min ATC$), and production occurs at the most efficient scale. This equilibrium is achieved through entry and exit: positive profits attract new firms, increasing supply and driving price down until profits disappear; losses cause firms to exit, decreasing supply and driving price up until losses are eliminated. The adjustment process continues until no incentive remains for entry or exit. In long-run equilibrium, three conditions hold simultaneously: profit maximization ($P = MC$), zero profit ($P = ATC$), and production at efficient scale ($P = \\min ATC$). This combination achieves both productive efficiency (production at lowest possible cost) and allocative efficiency (price equals marginal cost, meaning society's resources are allocated optimally). The long-run equilibrium price equals the minimum point of the typical firm's average total cost curve, and each firm produces at that efficient scale. Changes in demand or technology trigger short-run profits or losses, followed by entry or exit that restores long-run equilibrium at a new price (if costs changed) or with a different number of firms (if demand changed). In constant-cost industries, long-run supply is perfectly elastic at the minimum $ATC$ price; in increasing-cost industries, long-run supply slopes upward as input prices rise with industry output. Understanding long-run equilibrium explains why competitive markets are efficient, why profits don't persist, and how markets adapt to changing conditions over time."
}
