{
  "expanded_description": "If you're the only game in town, how do you decide what to charge? Too high, and customers will cut back drastically - you might actually make less money. Too low, and you're leaving profits on the table. Finding the sweet spot - the price and quantity that maximize profit - is the monopolist's central challenge. Unlike competitive firms that simply take the market price, monopolists must actively choose their position on the demand curve. This requires understanding the relationship between price, marginal revenue, and marginal cost. This section explores how monopolists find their profit-maximizing price and quantity, how we can calculate and visualize monopoly profit, and why monopolists never produce on the inelastic portion of their demand curve.",
  
  "core_concept": {
    "principle": "A monopolist maximizes profit by producing the quantity where marginal revenue equals marginal cost ($MR = MC$), then charging the highest price consumers are willing to pay for that quantity as given by the demand curve. This yields a price greater than marginal cost and positive economic profit if price exceeds average total cost.",
    "explanation": "Imagine you own the only coffee shop in a remote town. You know that if you charge $\\$8$ per cup, only a few desperate caffeine addicts will buy. If you charge $\\$2$, everyone will buy, but you might not cover your costs. Somewhere in between is the price that maximizes your profit. To find it, you think incrementally: what would happen if I sold one more cup? The revenue from that cup (marginal revenue) isn't just the price - because to sell that extra cup, you had to lower the price slightly on ALL cups. That's why marginal revenue is less than price. You keep expanding until that extra revenue just equals the extra cost of making that cup ($MC$). Then you stop. The price you charge comes from the demand curve at that quantity. This logic applies to every monopolist, from pharmaceutical companies with patent-protected drugs to local cable providers.",
    "image": {
      "src": "images/unit7/monopoly_profit_max.png",
      "alt": "Graph showing monopoly profit maximization with MR=MC intersection, price from demand curve, and profit rectangle",
      "caption": "Monopolists maximize profit where MR = MC, then set price from demand curve. Profit is the rectangle (P - ATC) × Q."
    }
  },

  "sections": [
    {
      "section_title": "6.7 Monopoly Profit Maximization",
      "introduction": "Think about the last time you bought a prescription drug. It probably cost a lot more than the pills cost to make. That's not because the drug company is evil - it's because they're a monopolist, at least until the patent expires. How do they decide that price? Why don't they charge even more? The answer lies in the careful calculus of monopoly profit maximization. In this section, we'll learn how monopolists find their optimal price and quantity, how to calculate their profit, and why they never operate on certain parts of the demand curve. These tools will help you understand pricing decisions in any market with market power.",
      
      "key_concept": {
        "definition": "Monopoly profit maximization follows the same basic rule as all firms: produce where marginal revenue equals marginal cost ($MR = MC$). However, because the monopolist faces the downward-sloping market demand curve, marginal revenue is less than price and declines with output. The optimal quantity $Q^*$ is found at $MR = MC$, and the optimal price $P^*$ is read from the demand curve at $Q^*$. Profit is $\\pi = (P^* - ATC) \\times Q^*$.",
        "context": "The key insight is that monopolists, unlike competitive firms, must consider how increasing output affects the price received on all units sold. This creates a wedge between price and marginal revenue. For a linear demand curve $P = a - bQ$, marginal revenue is $MR = a - 2bQ$ - twice as steep. This means the monopolist's profit-maximizing quantity is always less than the competitive quantity (where $P = MC$), and the price is always higher. The difference between price and marginal cost ($P - MC$) measures the monopolist's market power. If this difference is large, the monopolist has significant power to raise price above cost."
      },

      "categories": [
        {
          "type": "Deriving Marginal Revenue",
          "description": "Understanding why marginal revenue is less than price is crucial for monopoly analysis.",
          "examples": [
            {
              "process": "The intuition behind $MR < P$",
              "explanation": "When a monopolist sells one more unit, two things happen: (1) revenue increases by the price of that unit, but (2) revenue decreases because to sell that unit, the price on ALL previous units must be lowered slightly. The net effect is that marginal revenue is less than price. The more elastic the demand, the smaller this effect; the more inelastic, the larger the effect."
            },
            {
              "process": "Mathematical derivation for linear demand",
              "explanation": "Given $P = a - bQ$, total revenue $TR = P \\times Q = (a - bQ)Q = aQ - bQ^2$. Marginal revenue is the derivative: $MR = \\frac{dTR}{dQ} = a - 2bQ$. Compare to demand: $P = a - bQ$. So $MR$ has the same intercept but twice the slope. For any positive $Q$, $MR < P$."
            },
            {
              "process": "Numerical example",
              "explanation": "Suppose demand is $P = 100 - 2Q$. At $Q=10$, $P = 100 - 20 = \\$80$, $TR = \\$800$. At $Q=11$, $P = 100 - 22 = \\$78$, $TR = 11 \\times 78 = \\$858$. $MR$ from 10 to 11 = $\\$858 - \\$800 = \\$58$, while price at Q=11 is $\\$78$. The $\\$20$ difference comes from losing $\\$2$ on each of the first 10 units ($\\$20$ total) when price dropped."
            }
          ]
        },
        {
          "type": "The Monopolist's Profit-Maximizing Decision",
          "description": "Step-by-step, how a monopolist finds the optimal price and quantity.",
          "examples": [
            {
              "process": "Step 1: Find $MR$ curve",
              "explanation": "From the demand curve, derive marginal revenue. For linear demand $P = a - bQ$, $MR = a - 2bQ$. For non-linear demand, this requires calculus or estimation."
            },
            {
              "process": "Step 2: Set $MR = MC$",
              "explanation": "Find the quantity $Q^*$ where marginal revenue equals marginal cost. This is the profit-maximizing quantity. At this point, producing one more unit would add less to revenue than to cost."
            },
            {
              "process": "Step 3: Find price from demand curve",
              "explanation": "Once $Q^*$ is known, plug it into the demand curve to find the price $P^*$ consumers will pay for that quantity. This is the profit-maximizing price."
            },
            {
              "process": "Step 4: Calculate profit",
              "explanation": "Profit $\\pi = TR - TC = P^* \\times Q^* - TC$. Alternatively, if $ATC$ is known at $Q^*$, $\\pi = (P^* - ATC) \\times Q^*$."
            },
            {
              "process": "Step 5: Check shutdown condition",
              "explanation": "In the short run, the monopolist should produce only if $P \\ge AVC$. If $P < AVC$, even a monopolist should shut down temporarily. This is rare for monopolists because they have pricing power, but possible in extreme cases."
            }
          ]
        },
        {
          "type": "Graphical Analysis",
          "description": "The monopoly outcome has a clear visual representation that reveals key insights.",
          "examples": [
            {
              "process": "The graph setup",
              "explanation": "Draw downward-sloping demand $D$, marginal revenue $MR$ below it, upward-sloping marginal cost $MC$, and U-shaped average total cost $ATC$. $MR$ intersects $MC$ at $Q^*$. Go up to demand to find $P^*$. At $Q^*$, read $ATC$ from the $ATC$ curve."
            },
            {
              "process": "The profit rectangle",
              "explanation": "The vertical distance between $P^*$ and $ATC$ at $Q^*$ is profit per unit. Multiply by $Q^*$ to get total profit. Shade this rectangle. If $P^* > ATC$, profit positive. If $P^* < ATC$, loss (shade loss rectangle)."
            },
            {
              "process": "Comparing to competition",
              "explanation": "Add a line at $P = MC$ (competitive outcome) to see the difference. The competitive quantity $Q_C$ is where demand intersects $MC$. $Q^*$ is always less than $Q_C$. The triangle between demand and $MC$ from $Q^*$ to $Q_C$ is deadweight loss."
            },
            {
              "process": "Why no supply curve for monopoly",
              "explanation": "Unlike competitive firms, monopolists don't have a supply curve - there's no unique relationship between price and quantity supplied. The same quantity could be supplied at different prices depending on demand conditions. The monopolist chooses a point on the demand curve, not a price independently."
            }
          ]
        },
        {
          "type": "The Elasticity Rule",
          "description": "Monopolists never produce on the inelastic portion of their demand curve - this is a powerful insight.",
          "examples": [
            {
              "process": "Relationship between $MR$, $P$, and elasticity",
              "explanation": "There's a formula connecting marginal revenue, price, and elasticity of demand: $MR = P(1 + \\frac{1}{E})$, where $E$ is the price elasticity of demand (negative). When demand is elastic ($E < -1$), $MR$ is positive. When demand is inelastic ($-1 < E < 0$), $MR$ is negative. When $E = -1$, $MR = 0$."
            },
            {
              "process": "Why monopolists avoid inelastic range",
              "explanation": "If demand is inelastic, $MR$ is negative - selling one more unit actually reduces total revenue. Since marginal cost is always positive (or at least non-negative), $MR = MC$ cannot occur where $MR$ is negative. Therefore, the profit-maximizing quantity must be in the elastic region where $MR > 0$."
            },
            {
              "process": "Implication for pricing",
              "explanation": "Monopolists always operate where demand is elastic. This means they will never raise price into the inelastic range because doing so would reduce total revenue while also reducing output (saving some costs) - but the math shows this can't be optimal. The optimal price is always in the elastic region."
            },
            {
              "process": "Numerical illustration",
              "explanation": "For demand $P = 100 - 2Q$, elasticity varies. At $Q=10$, $P=80$, $E = -4$ (elastic). At $Q=25$, $P=50$, $E = -1$ (unit elastic). At $Q=40$, $P=20$, $E = -0.5$ (inelastic). The monopolist's $Q^*=20$ (from earlier example) has $P=60$, $E = -3$, well within elastic range."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Monopolists Produce Where $MR = MC$, Not Where $P = MC$",
          "statement": "Unlike competitive firms that produce where price equals marginal cost, monopolists produce where marginal revenue equals marginal cost. This always results in $P > MC$, meaning the monopolist charges more than the cost of producing the last unit.",
          "application": "This principle is the heart of monopoly analysis. When evaluating a monopoly, always find $MR = MC$ first, then read price from demand. Never set $P = MC$ - that would give the competitive quantity, which is not profit-maximizing for a monopolist.",
          "example": "A monopolist with demand $P = 100 - Q$ and $MC = 20$: Set $MR = 100 - 2Q = 20$ → $2Q = 80$ → $Q = 40$, $P = 100 - 40 = \\$60$. Competitive outcome would be $P = MC = 20$ → $Q = 80$. The monopolist produces half as much at triple the price."
        },
        {
          "principle": "Monopoly Profit Can Persist in the Long Run",
          "statement": "Because of barriers to entry, monopolists can earn positive economic profit in the long run. This is different from perfect competition, where entry drives profit to zero. The sustainability of profit depends on the durability of barriers.",
          "application": "This explains why monopolies are both attractive to firms and concerning to regulators. The potential for long-run profit motivates innovation (through patent-seeking) but also creates incentives for anti-competitive behavior to maintain barriers.",
          "example": "A pharmaceutical company with a 20-year patent on a blockbuster drug can earn billions in profit annually. Competitors cannot enter because the patent is a legal barrier. When the patent expires, generic entry eliminates profit. The profit persisted as long as the barrier remained."
        },
        {
          "principle": "The Markup Over Marginal Cost Depends on Demand Elasticity",
          "statement": "The monopolist's markup - how much price exceeds marginal cost - is inversely related to the elasticity of demand. The formula $\\frac{P - MC}{P} = -\\frac{1}{E}$ (the Lerner Index) shows that less elastic demand leads to higher markups.",
          "application": "This principle helps predict which monopolies will charge the highest markups. Necessities with few substitutes (insulin, water) have inelastic demand and thus high markups. Goods with many substitutes have more elastic demand and lower markups, even if sold by a monopolist.",
          "example": "A life-saving drug with no substitutes might have elasticity $E = -0.5$, giving markup $\\frac{P-MC}{P} = -\\frac{1}{-0.5} = 2$, meaning price is 200% above marginal cost ($P = 3 \\times MC$). A luxury good with elasticity $E = -3$ would have markup $\\frac{1}{3}$, meaning price is only 33% above marginal cost ($P = 1.33 \\times MC$)."
        },
        {
          "principle": "Monopolists Have No Supply Curve",
          "statement": "A supply curve shows the quantity a firm will produce at each price. For a monopolist, there's no unique relationship - the same quantity could be supplied at different prices depending on demand, and the same price could correspond to different quantities. The monopolist chooses a point on the demand curve, not a price independently.",
          "application": "This is why microeconomics texts don't draw a monopoly supply curve. When analyzing monopoly, we always start with demand and cost, then find the optimal point. This contrasts with perfect competition, where the firm's supply curve is its $MC$ curve above $AVC$.",
          "example": "Consider a monopolist with constant $MC = \\$20$. If demand is $P = 100 - Q$, optimal $Q = 40$, $P = \\$60$. If demand shifts to $P = 120 - Q$, new optimal $Q = 50$, $P = \\$70$. Price and quantity both changed. There's no single supply curve that would predict these outcomes."
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Monopoly Profit Maximization",
          "problem": "A monopolist faces demand $P = 120 - 3Q$. Total cost is $TC = 50 + 10Q + Q^2$. a) Find the profit-maximizing quantity and price. b) Calculate total revenue, total cost, and profit. c) Find the markup over marginal cost and the Lerner Index. d) Determine if the firm should operate in the short run.",
          "step_by_step": [
            {
              "step": "Derive marginal revenue",
              "explanation": "From $P = 120 - 3Q$, $TR = P \\times Q = 120Q - 3Q^2$. Therefore, $MR = \\frac{dTR}{dQ} = 120 - 6Q$. (Or use the rule: for linear demand, $MR$ has same intercept, twice the slope.)"
            },
            {
              "step": "Derive marginal cost",
              "explanation": "From $TC = 50 + 10Q + Q^2$, $MC = \\frac{dTC}{dQ} = 10 + 2Q$."
            },
            {
              "step": "Set $MR = MC$ to find $Q^*$",
              "explanation": "$120 - 6Q = 10 + 2Q$ → $120 - 10 = 2Q + 6Q$ → $110 = 8Q$ → $Q = 13.75$ units."
            },
            {
              "step": "Find price from demand curve",
              "explanation": "$P = 120 - 3(13.75) = 120 - 41.25 = \\$78.75$."
            },
            {
              "step": "Calculate total revenue",
              "explanation": "$TR = P \\times Q = 78.75 \\times 13.75 = \\$1,082.81$ (rounded)."
            },
            {
              "step": "Calculate total cost",
              "explanation": "$TC = 50 + 10(13.75) + (13.75)^2 = 50 + 137.5 + 189.06 = \\$376.56$ (rounded)."
            },
            {
              "step": "Calculate profit",
              "explanation": "$\\pi = TR - TC = 1,082.81 - 376.56 = \\$706.25$."
            },
            {
              "step": "Calculate markup and Lerner Index",
              "explanation": "$MC$ at $Q=13.75$ is $10 + 2(13.75) = 10 + 27.5 = \\$37.50$. Markup = $P - MC = 78.75 - 37.50 = \\$41.25$. Lerner Index = $\\frac{P - MC}{P} = \\frac{41.25}{78.75} = 0.524$, meaning price is 52.4% above marginal cost."
            },
            {
              "step": "Check shutdown condition",
              "explanation": "Need $AVC$. Variable cost = $10Q + Q^2$, so $AVC = 10 + Q = 10 + 13.75 = \\$23.75$. $P = \\$78.75 > AVC$, so definitely operate."
            }
          ],
          "final_answer": "a) $Q^* = 13.75$ units, $P^* = \\$78.75$. b) $TR = \\$1,082.81$, $TC = \\$376.56$, $\\pi = \\$706.25$. c) Markup = $\\$41.25$, Lerner Index = 0.524. d) Yes, operate since $P > AVC$.",
          "concept_applied": "Monopolists maximize profit by setting $MR = MC$, then reading price from demand. The markup reflects market power and depends on demand elasticity."
        },
        {
          "title": "Graphical Analysis with ATC",
          "problem": "A monopolist has demand $P = 100 - 4Q$ and costs such that at the profit-maximizing output, $ATC = \\$30$. Marginal cost is constant at $\\$20$. a) Find the profit-maximizing quantity and price. b) Calculate profit. c) Show on a graph the demand, $MR$, $MC$, $ATC$, profit rectangle, and deadweight loss triangle. d) Calculate the deadweight loss numerically.",
          "step_by_step": [
            {
              "step": "Find $MR$ and set $MR = MC$",
              "explanation": "$P = 100 - 4Q$, so $MR = 100 - 8Q$. Set $MR = MC = 20$: $100 - 8Q = 20$ → $8Q = 80$ → $Q^* = 10$."
            },
            {
              "step": "Find price from demand",
              "explanation": "$P = 100 - 4(10) = 100 - 40 = \\$60$."
            },
            {
              "step": "Calculate profit",
              "explanation": "Given $ATC = \\$30$ at $Q=10$, profit per unit = $P - ATC = 60 - 30 = \\$30$. Total profit $\\pi = 30 \\times 10 = \\$300$."
            },
            {
              "step": "Find competitive outcome for deadweight loss",
              "explanation": "Under competition, $P = MC = 20$. From demand: $20 = 100 - 4Q$ → $4Q = 80$ → $Q_C = 20$. Competitive quantity = 20 units."
            },
            {
              "step": "Calculate deadweight loss",
              "explanation": "Deadweight loss is the triangle between demand and $MC$ from $Q=10$ to $Q=20$. Height at $Q=10$: $P - MC = 60 - 20 = 40$. Height at $Q=20$: $P - MC = 20 - 20 = 0$. The triangle area = $\\frac{1}{2} \\times (20-10) \\times 40 = \\frac{1}{2} \\times 10 \\times 40 = \\$200$."
            },
            {
              "step": "Describe the graph",
              "explanation": "Draw demand $P = 100 - 4Q$ (downward sloping), $MR = 100 - 8Q$ (steeper, same intercept), $MC = 20$ (horizontal line), and $ATC$ curve passing through $\\$30$ at $Q=10$. $MR$ and $MC$ intersect at $Q=10$. Go up to demand at $P=60$. Profit rectangle from $P=60$ down to $ATC=30$ across $Q=10$. Deadweight loss triangle between demand and $MC$ from $Q=10$ to $Q=20$."
            }
          ],
          "final_answer": "a) $Q^* = 10$, $P^* = \\$60$. b) Profit = $\\$300$. c) Graph as described. d) Deadweight loss = $\\$200$.",
          "concept_applied": "Monopoly profit is the rectangle $(P - ATC) \\times Q$. Deadweight loss is the triangle of lost surplus from units not produced. The graph shows both the transfer from consumers to producer (profit) and the net loss to society (DWL)."
        },
        {
          "title": "Elasticity and Monopoly Pricing",
          "problem": "A monopolist faces demand with elasticity $E = -2$ at its current price. Marginal cost is constant at $\\$30$. a) What price should the monopolist charge to maximize profit? b) If demand becomes more elastic ($E = -4$), how does the optimal price change? c) If demand becomes less elastic ($E = -1.5$), how does the optimal price change? d) Explain the relationship between elasticity and monopoly pricing.",
          "step_by_step": [
            {
              "step": "Use the markup formula",
              "explanation": "The Lerner Index formula: $\\frac{P - MC}{P} = -\\frac{1}{E}$. Rearranging: $P - MC = -\\frac{P}{E}$ → $P - MC = \\frac{P}{|E|}$ (since $E$ is negative). Solve for $P$: $P = \\frac{MC}{1 + \\frac{1}{E}}$ or more cleanly $P = \\frac{MC}{1 - \\frac{1}{|E|}}$."
            },
            {
              "step": "Calculate price for $E = -2$",
              "explanation": "$|E| = 2$. $P = \\frac{30}{1 - \\frac{1}{2}} = \\frac{30}{0.5} = \\$60$."
            },
            {
              "step": "Calculate price for $E = -4$",
              "explanation": "$|E| = 4$. $P = \\frac{30}{1 - \\frac{1}{4}} = \\frac{30}{0.75} = \\$40$."
            },
            {
              "step": "Calculate price for $E = -1.5$",
              "explanation": "$|E| = 1.5$. $P = \\frac{30}{1 - \\frac{1}{1.5}} = \\frac{30}{1 - 0.667} = \\frac{30}{0.333} = \\$90$."
            },
            {
              "step": "Interpret the relationship",
              "explanation": "As demand becomes more elastic ($|E|$ increases), the optimal price falls toward marginal cost. As demand becomes less elastic ($|E|$ decreases toward 1), the optimal price rises. A monopolist facing very inelastic demand can charge very high markups. A monopolist facing highly elastic demand must keep price close to cost."
            },
            {
              "step": "Check the boundary",
              "explanation": "As $|E| \\to \\infty$, $P \\to MC$ (perfectly elastic demand eliminates monopoly power). As $|E| \\to 1$, $P \\to \\infty$ (but in practice, demand becomes inelastic below $|E|=1$, and monopolists won't operate there because $MR$ would be negative)."
            }
          ],
          "final_answer": "a) At $E = -2$, $P = \\$60$. b) At $E = -4$, $P = \\$40$ (more elastic → lower price). c) At $E = -1.5$, $P = \\$90$ (less elastic → higher price). d) The optimal monopoly price is inversely related to demand elasticity: more elastic demand constrains monopoly pricing; less elastic demand allows higher markups.",
          "concept_applied": "The markup formula $\\frac{P-MC}{P} = -\\frac{1}{E}$ shows how demand elasticity determines monopoly pricing. Monopolists with inelastic demand can charge much higher prices; those with elastic demand must keep prices close to cost."
        }
      ],

      "image": {
        "src": "images/unit7/monopoly_profit_details.png",
        "alt": "Detailed monopoly graph showing demand, MR, MC, ATC, profit rectangle, and deadweight loss triangle",
        "caption": "Monopoly profit maximization: $MR = MC$ at $Q^*$, price $P^*$ from demand, profit = $(P^* - ATC) \\times Q^*$, deadweight loss = triangle between demand and $MC$ from $Q^*$ to competitive $Q_C$"
      }
    }
  ],

  "key_terms": [
    "Monopoly profit maximization",
    "$MR = MC$ rule",
    "Marginal revenue",
    "Price maker",
    "Markup",
    "Lerner Index",
    "Demand elasticity",
    "Elasticity rule",
    "Deadweight loss",
    "Profit rectangle",
    "No supply curve",
    "Inelastic demand",
    "Elastic demand",
    "Price discrimination (preview)",
    "Natural monopoly",
    "Patent monopoly"
  ],

  "summary": "Monopoly profit maximization follows the universal $MR = MC$ rule, but with a crucial twist: because the monopolist faces the entire downward-sloping market demand curve, marginal revenue is less than price and declines with output. For linear demand $P = a - bQ$, marginal revenue is $MR = a - 2bQ$ - twice as steep. The monopolist finds the optimal quantity $Q^*$ where $MR = MC$, then charges the price $P^*$ consumers are willing to pay for that quantity, read from the demand curve. This always results in $P^* > MC$, with the difference representing market power. Profit is calculated as $\\pi = (P^* - ATC) \\times Q^*$, shown graphically as a rectangle with height $(P^* - ATC)$ and width $Q^*$. Compared to the competitive outcome ($P = MC$), monopoly produces less output and charges a higher price, creating deadweight loss - the triangle of surplus from units that would have been produced under competition but aren't under monopoly. The markup over marginal cost is related to demand elasticity by the Lerner Index: $\\frac{P - MC}{P} = -\\frac{1}{E}$. This means monopolists facing inelastic demand charge higher markups, while those facing elastic demand must keep prices closer to cost. Monopolists never operate on the inelastic portion of demand because there $MR$ would be negative, making $MR = MC$ impossible. Unlike competitive firms, monopolists have no supply curve - there's no unique relationship between price and quantity supplied. Barriers to entry allow monopoly profits to persist in the long run, unlike perfect competition where entry drives profit to zero. Understanding monopoly profit maximization is essential for analyzing real-world firms with market power, evaluating antitrust policy, and understanding why monopolies create inefficiency."
}
