{
  "title": "6.7 Monopoly Profit Maximization",
  "expanded_description": "Analyzing how monopolists use their pricing power to maximize profits through strategic output restriction and price setting, understanding the mathematical and graphical determination of monopoly equilibrium, and examining the welfare implications of monopoly pricing behavior.",
  "core_concept": {
    "principle": "Monopolists maximize profits by producing where marginal revenue equals marginal cost (MR = MC) and charging the highest price consumers will pay for that quantity, leveraging their market power to set prices above marginal cost and restrict output compared to competitive markets.",
    "explanation": "Unlike competitive firms that are price takers, monopolists face the entire market demand curve and understand that to sell more output, they must lower prices on all units. This relationship between price and marginal revenue (MR < P) leads profit-maximizing monopolists to restrict output and charge higher prices, creating deadweight loss but generating economic profits.",
    "image": {
      "url": "/images/economics/monopoly-profit-maximization.svg",
      "alt": "Monopoly Profit Maximization",
      "caption": "Profit maximization where MR = MC with price determined from demand curve"
    }
  },
  "sections": [
    {
      "section_title": "The Mathematics of Monopoly Pricing",
      "introduction": "Understanding the mathematical foundation of monopoly profit maximization, including revenue relationships, cost structures, and the optimization conditions that determine monopoly equilibrium.",
      "key_concept": {
        "definition": "The monopoly profit maximization problem involves choosing output Q to maximize π(Q) = TR(Q) - TC(Q), which yields the first-order condition MR(Q) = MC(Q). The profit-maximizing price is then found from the demand curve P(Q), with economic profit given by [P - ATC(Q)] × Q.",
        "context": "This mathematical framework reveals why monopolists naturally restrict output compared to competitive firms and how market power translates into both higher prices and economic profits sustained by barriers to entry.",
        "image": {
          "url": "/images/economics/monopoly-mathematics.svg",
          "alt": "Mathematics of Monopoly Pricing",
          "caption": "Mathematical derivation of monopoly equilibrium conditions"
        }
      },
      "classifications": [
        {
          "type": "Revenue Relationships",
          "value": "How price and quantity decisions affect monopoly revenue",
          "characteristics": ["Demand Curve", "Total Revenue", "Marginal Revenue", "Price Elasticity"],
          "behavior": "For a linear demand curve P = a - bQ, marginal revenue MR = a - 2bQ has twice the slope, ensuring MR < P for all positive quantities. The relationship MR = P(1 - 1/|E|) shows that monopolists always produce where |E| > 1.",
          "examples": [
            {
              "process": "Marginal Revenue Derivation",
              "explanation": "When a monopolist lowers price to sell one more unit, they gain revenue from the additional unit but lose revenue on all previous units due to the lower price, making MR < P.",
              "image": {
                "url": "/images/economics/marginal-revenue-derivation.svg",
                "alt": "Marginal Revenue Derivation",
                "caption": "Why marginal revenue lies below demand curve for monopolists"
              }
            },
            {
              "process": "Elasticity and Revenue Relationship",
              "explanation": "When demand is elastic (|E| > 1), MR > 0 and price cuts increase total revenue. When demand is inelastic (|E| < 1), MR < 0 and price cuts decrease total revenue. Monopolists always operate where |E| > 1.",
              "image": {
                "url": "/images/economics/elasticity-revenue-relationship.svg",
                "alt": "Elasticity and Revenue Relationship",
                "caption": "How price elasticity determines marginal revenue sign"
              }
            }
          ]
        },
        {
          "type": "Cost and Profit Structures",
          "value": "Cost considerations in monopoly profit maximization",
          "characteristics": ["Total Cost", "Marginal Cost", "Average Cost", "Profit Calculation"],
          "behavior": "Monopolists face the same cost structures as competitive firms but different output decisions. Economic profit equals (P - ATC) × Q and can persist in long run due to barriers to entry.",
          "examples": [
            {
              "process": "Profit Maximization Condition",
              "explanation": "The monopolist expands output as long as MR > MC (additional revenue exceeds additional cost) and stops where MR = MC. Producing beyond this point would reduce profits since MC > MR.",
              "image": {
                "url": "/images/economics/profit-maximization-condition.svg",
                "alt": "Profit Maximization Condition",
                "caption": "MR = MC as the profit-maximizing output rule"
              }
            },
            {
              "process": "Economic Profit Determination",
              "explanation": "At the profit-maximizing output, economic profit equals the rectangle between price and average total cost multiplied by quantity. This profit can persist indefinitely with effective barriers to entry.",
              "image": {
                "url": "/images/economics/economic-profit-determination.svg",
                "alt": "Economic Profit Determination",
                "caption": "Calculating monopoly economic profits"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Comprehensive Monopoly Profit Calculation",
          "problem": "A monopolist faces demand P = 120 - 3Q and has cost function TC = 100 + 10Q + 2Q². Find the profit-maximizing price, quantity, and profit. Verify the second-order condition and calculate the Lerner Index.",
          "step_by_step": [
            {
              "step": "Derive Revenue Functions",
              "explanation": "Calculate total revenue and marginal revenue from demand",
              "calculation": "TR = P × Q = (120 - 3Q)Q = 120Q - 3Q²\nMR = dTR/dQ = 120 - 6Q"
            },
            {
              "step": "Derive Cost Functions",
              "explanation": "Calculate marginal cost and average total cost",
              "calculation": "MC = dTC/dQ = 10 + 4Q\nATC = TC/Q = 100/Q + 10 + 2Q"
            },
            {
              "step": "Set MR = MC",
              "explanation": "Apply profit-maximizing condition",
              "calculation": "MR = MC\n120 - 6Q = 10 + 4Q\n110 = 10Q\nQ = 11"
            },
            {
              "step": "Find Profit-Maximizing Price",
              "explanation": "Substitute optimal quantity into demand function",
              "calculation": "P = 120 - 3Q = 120 - 3(11) = 120 - 33 = 87"
            },
            {
              "step": "Calculate Economic Profit",
              "explanation": "Compute total revenue minus total cost",
              "calculation": "TR = P × Q = 87 × 11 = 957\nTC = 100 + 10(11) + 2(11)² = 100 + 110 + 242 = 452\nProfit = TR - TC = 957 - 452 = 505"
            },
            {
              "step": "Verify Second-Order Condition",
              "explanation": "Ensure profit is maximized, not minimized",
              "calculation": "d²π/dQ² = d(MR - MC)/dQ = (-6) - (4) = -10 < 0 ✓\nConfirms profit maximum"
            },
            {
              "step": "Calculate Lerner Index",
              "explanation": "Measure degree of monopoly power",
              "calculation": "At Q=11: MC = 10 + 4(11) = 54\nLerner Index = (P - MC)/P = (87 - 54)/87 = 33/87 = 0.379\nMonopoly has 37.9% price markup over marginal cost"
            },
            {
              "step": "Check Elasticity Condition",
              "explanation": "Verify monopolist operates where demand is elastic",
              "calculation": "From Lerner Index: (P-MC)/P = 1/|E|\n0.379 = 1/|E| → |E| = 1/0.379 = 2.64 > 1 ✓\nDemand is elastic at optimum"
            }
          ],
          "final_answer": "Profit-maximizing equilibrium: Q=11 units, P=$87, Economic profit=$505. The Lerner Index of 0.379 indicates significant market power, with price 37.9% above marginal cost. The monopolist operates where demand elasticity is 2.64, confirming the requirement that monopolists always produce where |E| > 1. Barriers to entry allow these economic profits to persist in the long run.",
          "concept_applied": "Comprehensive monopoly profit maximization analysis including optimal price and quantity determination, profit calculation, verification of second-order conditions, and measurement of market power using the Lerner Index and elasticity relationships.",
          "image": {
            "url": "/images/economics/comprehensive-monopoly-analysis.svg",
            "alt": "Comprehensive Monopoly Analysis",
            "caption": "Complete graphical and mathematical monopoly equilibrium"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Inverse Elasticity Rule",
          "statement": "A profit-maximizing monopolist's price markup over marginal cost is inversely proportional to the price elasticity of demand: (P - MC)/P = 1/|E|. This relationship shows that monopolists have greater pricing power when facing less elastic demand, and that they always set prices in the elastic region of demand (|E| > 1) where marginal revenue is positive.",
          "application": "This principle explains why monopolists charge higher markups for products with fewer substitutes (inelastic demand) and why they avoid the inelastic portion of demand curves where price cuts would reduce total revenue.",
          "example": "Pharmaceutical companies charge high prices for patented drugs with no close substitutes (inelastic demand) but must lower prices when generics become available (more elastic demand).",
          "analogy": "Like a seller at an isolated location versus a competitive market—the isolated seller (facing inelastic demand) can charge high markups, while the competitive market seller (facing elastic demand) has little pricing power.",
          "image": {
            "url": "/images/economics/inverse-elasticity-rule.svg",
            "alt": "Inverse Elasticity Rule",
            "caption": "Relationship between price elasticity and monopoly markup"
          }
        }
      ]
    },
    {
      "section_title": "Graphical Analysis of Monopoly Equilibrium",
      "introduction": "Visualizing monopoly profit maximization through graphical tools that illustrate the relationship between demand, marginal revenue, costs, and the resulting equilibrium price, quantity, and profits.",
      "key_concept": {
        "definition": "The graphical determination of monopoly equilibrium involves finding the intersection of MR and MC curves to determine optimal quantity, then using the demand curve to find the corresponding price, with economic profit represented by the rectangle between price and average total cost.",
        "context": "Graphical analysis provides intuitive understanding of why monopolists restrict output compared to competitive markets and how different cost structures affect monopoly pricing and profitability.",
        "image": {
          "url": "/images/economics/graphical-monopoly-equilibrium.svg",
          "alt": "Graphical Analysis of Monopoly Equilibrium",
          "caption": "Visual determination of monopoly price, quantity, and profit"
        }
      },
      "classifications": [
        {
          "type": "Standard Monopoly Diagram",
          "value": "Basic graphical representation of monopoly equilibrium",
          "characteristics": ["Demand Curve", "MR Curve", "MC Curve", "ATC Curve", "Profit Rectangle"],
          "behavior": "The standard monopoly diagram shows the profit-maximizing quantity at MR=MC intersection, price from the demand curve above this quantity, and economic profit as the area between price and ATC.",
          "examples": [
            {
              "process": "Quantity Determination",
              "explanation": "The monopolist finds the output level where the MR curve intersects the MC curve. This quantity is always less than the competitive quantity where P = MC.",
              "image": {
                "url": "/images/economics/quantity-determination.svg",
                "alt": "Quantity Determination",
                "caption": "Finding optimal output where MR = MC"
              }
            },
            {
              "process": "Price Setting",
              "explanation": "After determining optimal quantity from MR=MC, the monopolist charges the highest price consumers will pay for that quantity, found by going up to the demand curve.",
              "image": {
                "url": "/images/economics/price-setting.svg",
                "alt": "Price Setting",
                "caption": "Determining price from demand curve at optimal quantity"
              }
            }
          ]
        },
        {
          "type": "Welfare Analysis Graphics",
          "value": "Visualizing efficiency losses from monopoly power",
          "characteristics": ["Consumer Surplus", "Producer Surplus", "Deadweight Loss", "Surplus Redistribution"],
          "behavior": "Welfare analysis compares monopoly outcomes to perfect competition, showing the deadweight loss triangle from output restriction and the transfer of consumer surplus to producer surplus.",
          "examples": [
            {
              "process": "Deadweight Loss Visualization",
              "explanation": "The deadweight loss represents the lost consumer and producer surplus from units between monopoly output and competitive output that would be mutually beneficial but aren't produced.",
              "image": {
                "url": "/images/economics/deadweight-loss-visualization.svg",
                "alt": "Deadweight Loss Visualization",
                "caption": "Graphical representation of monopoly efficiency loss"
              }
            },
            {
              "process": "Surplus Distribution Changes",
              "explanation": "Compared to competition, monopoly reduces consumer surplus (higher prices), increases producer surplus (economic profits), and creates deadweight loss (reduced total surplus).",
              "image": {
                "url": "/images/economics/surplus-distribution.svg",
                "alt": "Surplus Distribution Changes",
                "caption": "How monopoly redistributes and destroys economic surplus"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Graphical Monopoly Analysis with Different Cost Structures",
          "problem": "A monopolist faces demand P = 100 - 2Q. Analyze profit maximization under three cost scenarios: (A) Constant MC = 20, (B) Increasing MC = 10 + 2Q, (C) Natural monopoly with ATC = 300/Q + 10. Graphically compare outcomes.",
          "step_by_step": [
            {
              "step": "Common Revenue Functions",
              "explanation": "Derive revenue relationships applicable to all scenarios",
              "calculation": "TR = 100Q - 2Q²\nMR = 100 - 4Q\nCompetitive outcome: P = MC → 100 - 2Q = MC"
            },
            {
              "step": "Scenario A: Constant MC",
              "explanation": "Analyze with MC = 20 (perfectly competitive industry)",
              "calculation": "MR = MC: 100 - 4Q = 20 → 4Q = 80 → Q = 20\nP = 100 - 2(20) = 60\nIf competitive: P = MC = 20, Q = 40\nMonopoly restricts output by 50%, triples price"
            },
            {
              "step": "Scenario B: Increasing MC",
              "explanation": "Analyze with MC = 10 + 2Q (typical cost structure)",
              "calculation": "MR = MC: 100 - 4Q = 10 + 2Q → 90 = 6Q → Q = 15\nP = 100 - 2(15) = 70\nIf competitive: P = MC → 100 - 2Q = 10 + 2Q → 90 = 4Q → Q = 22.5, P = 55\nMonopoly restricts output by 33%, raises price 27%"
            },
            {
              "step": "Scenario C: Natural Monopoly",
              "explanation": "Analyze with declining ATC (ATC = 300/Q + 10)",
              "calculation": "MC = dTC/dQ (from ATC: TC = 300 + 10Q, so MC = 10)\nMR = MC: 100 - 4Q = 10 → 4Q = 90 → Q = 22.5\nP = 100 - 2(22.5) = 55\nATC at Q=22.5: 300/22.5 + 10 = 13.33 + 10 = 23.33\nProfit = (55-23.33) × 22.5 = 31.67 × 22.5 = 712.58"
            },
            {
              "step": "Graphical Comparison",
              "explanation": "Describe how graphs would differ across scenarios",
              "calculation": "Scenario A: Horizontal MC at 20, large output restriction\nScenario B: Upward-sloping MC, moderate restriction\nScenario C: Declining ATC, natural monopoly characteristics\nAll show MR=MC determining quantity, demand determining price"
            },
            {
              "step": "Welfare Implications",
              "explanation": "Compare efficiency losses across scenarios",
              "calculation": "Scenario A: Largest DWL (output 20 vs 40 competitive)\nScenario B: Moderate DWL (output 15 vs 22.5 competitive)\nScenario C: Natural monopoly - competition not feasible\nRegulation might improve Scenario C outcome"
            }
          ],
          "final_answer": "Scenario A (Constant MC): Q=20, P=60, 50% output restriction. Scenario B (Increasing MC): Q=15, P=70, 33% output restriction. Scenario C (Natural Monopoly): Q=22.5, P=55, substantial economic profits. The cost structure significantly affects the degree of output restriction and pricing: constant MC leads to greatest restriction, increasing MC moderates restriction, while natural monopoly presents a policy dilemma where breaking up the monopoly would raise costs. All scenarios demonstrate the fundamental monopoly behavior of producing where MR=MC and charging P>MC.",
          "concept_applied": "Comparative analysis of monopoly profit maximization under different cost structures, showing how marginal cost characteristics affect the degree of output restriction, pricing decisions, and welfare implications, with special consideration of natural monopoly cases where competition is inherently inefficient.",
          "image": {
            "url": "/images/economics/cost-structure-comparison.svg",
            "alt": "Monopoly with Different Cost Structures",
            "caption": "How cost assumptions affect monopoly equilibrium outcomes"
          }
        }
      ],
      "principles": [
        {
          "principle": "The No Supply Curve Principle for Monopoly",
          "statement": "Unlike competitive firms, monopolists have no supply curve—there is no unique relationship between price and quantity supplied. Instead, the monopolist chooses both price and quantity simultaneously based on market demand and cost conditions. The same monopolist might supply different quantities at the same price depending on demand elasticity, or the same quantity at different prices depending on cost structure.",
          "application": "This principle explains why monopoly markets don't have well-defined supply curves and why monopoly output depends on the shape and position of the demand curve, not just costs.",
          "example": "A pharmaceutical monopolist might charge different prices for the same drug in different countries based on varying demand elasticities, supplying different quantities at different prices without a predictable price-quantity relationship.",
          "analogy": "Like a custom artisan rather than a mass producer—the artisan sets both price and quantity based on the specific customer's willingness to pay and production costs, rather than taking market price as given.",
          "image": {
            "url": "/images/economics/no-supply-curve.svg",
            "alt": "No Supply Curve Principle",
            "caption": "Why monopolists lack a well-defined supply curve"
          }
        }
      ]
    },
    {
      "section_title": "Strategic Pricing and Market Power Leverage",
      "introduction": "Monopolists employ various strategic pricing techniques to enhance profits beyond basic MR=MC optimization, including multi-part pricing, bundling, and peak-load pricing that better extract consumer surplus.",
      "key_concept": {
        "definition": "Beyond single-price monopoly, profit-maximizing monopolists can use advanced pricing strategies like two-part tariffs (fixed fee + per-unit price), bundling (selling products together), and peak-load pricing (varying prices by time) to capture more consumer surplus and approach the ideal of perfect price discrimination.",
        "context": "These sophisticated pricing strategies demonstrate how monopolists with detailed market information and control over terms of sale can significantly increase profits while potentially reducing deadweight loss by serving more customers.",
        "image": {
          "url": "/images/economics/strategic-pricing-techniques.svg",
          "alt": "Strategic Pricing and Market Power Leverage",
          "caption": "Advanced pricing strategies to enhance monopoly profits"
        }
      },
      "classifications": [
        {
          "type": "Multi-Part Pricing",
          "value": "Pricing structures with multiple components",
          "characteristics": ["Two-Part Tariffs", "Block Pricing", "Quantity Discounts", "Membership Fees"],
          "behavior": "Multi-part pricing allows monopolists to capture consumer surplus through fixed fees while setting per-unit prices closer to marginal cost, increasing both profits and efficiency.",
          "examples": [
            {
              "process": "Two-Part Tariff Optimization",
              "explanation": "The monopolist sets per-unit price equal to marginal cost (efficient) and captures all consumer surplus through a fixed fee. This achieves efficiency while granting all surplus to the monopolist.",
              "image": {
                "url": "/images/economics/two-part-tariff.svg",
                "alt": "Two-Part Tariff Optimization",
                "caption": "Fixed fee plus per-unit price to capture consumer surplus"
              }
            },
            {
              "process": "Block Pricing Strategy",
              "explanation": "Monopolists charge different prices for different quantity blocks, effectively creating a stepped demand curve that captures more surplus than single pricing.",
              "image": {
                "url": "/images/economics/block-pricing.svg",
                "alt": "Block Pricing Strategy",
                "caption": "Quantity-based price discrimination through blocks"
              }
            }
          ]
        },
        {
          "type": "Product and Market Strategies",
          "value": "Leveraging product design and market segmentation",
          "characteristics": ["Bundling", "Versioning", "Peak-Load Pricing", "Intertemporal Pricing"],
          "behavior": "Monopolists design products and market access to facilitate price discrimination, creating artificial product differences or using timing to segment consumers by willingness to pay.",
          "examples": [
            {
              "process": "Product Bundling",
              "explanation": "Selling products together as a bundle can increase profits when consumers have different valuations for individual products but similar valuations for the bundle.",
              "image": {
                "url": "/images/economics/product-bundling.svg",
                "alt": "Product Bundling",
                "caption": "How bundling different products enhances monopoly profits"
              }
            },
            {
              "process": "Peak-Load Pricing",
              "explanation": "Charging higher prices during peak demand periods and lower prices during off-peak periods helps manage capacity and extract more surplus from high-value users.",
              "image": {
                "url": "/images/economics/peak-load-pricing.svg",
                "alt": "Peak-Load Pricing",
                "caption": "Time-based price discrimination to manage demand"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Two-Part Tariff Profit Maximization",
          "problem": "A monopolist faces 100 identical consumers each with demand P = 20 - Q. Marginal cost is constant at MC = 4. Compare profits under: (A) Single-price monopoly, (B) Two-part tariff with optimal fixed fee and per-unit price.",
          "step_by_step": [
            {
              "step": "Single-Price Monopoly",
              "explanation": "Standard MR=MC optimization for individual consumer",
              "calculation": "Individual demand: P = 20 - Q\nMR = 20 - 2Q\nSet MR = MC: 20 - 2Q = 4 → 2Q = 16 → Q = 8\nP = 20 - 8 = 12\nProfit per consumer = (12-4) × 8 = 8 × 8 = 64\nTotal profit = 100 × 64 = 6,400"
            },
            {
              "step": "Two-Part Tariff - Per-Unit Price",
              "explanation": "Set per-unit price equal to MC for efficiency",
              "calculation": "Per-unit price = MC = 4\nAt P=4, each consumer demands Q = 20 - 4 = 16 units"
            },
            {
              "step": "Two-Part Tariff - Fixed Fee",
              "explanation": "Set fixed fee equal to individual consumer surplus",
              "calculation": "At P=4, consumer surplus = ½ × (20-4) × 16 = ½ × 16 × 16 = 128\nFixed fee = 128 per consumer"
            },
            {
              "step": "Two-Part Tariff Profit",
              "explanation": "Calculate total profit from both fee and unit sales",
              "calculation": "Profit from units = (4-4) × 16 × 100 = 0 (P=MC)\nProfit from fixed fees = 128 × 100 = 12,800\nTotal profit = 12,800"
            },
            {
              "step": "Efficiency Comparison",
              "explanation": "Compare output and deadweight loss",
              "calculation": "Single-price: Q=8 per consumer, Total Q=800\nTwo-part tariff: Q=16 per consumer, Total Q=1,600\nCompetitive output: P=MC=4, Q=16 per consumer\nTwo-part tariff achieves efficient output (no DWL)"
            },
            {
              "step": "Distributional Comparison",
              "explanation": "Analyze surplus distribution",
              "calculation": "Single-price: CS=½×(20-12)×8=32 per consumer, PS=64 per consumer\nTwo-part tariff: CS=0, PS=128 per consumer\nAll surplus goes to monopolist with two-part tariff"
            }
          ],
          "final_answer": "Single-price monopoly: Profit=$6,400, Output=800 units, Deadweight loss present. Two-part tariff: Profit=$12,800, Output=1,600 units, No deadweight loss. The two-part tariff doubles profits while achieving efficient output by setting per-unit price at marginal cost and capturing all consumer surplus through the fixed fee. This demonstrates how sophisticated pricing strategies can both increase monopoly profits and improve economic efficiency compared to standard monopoly pricing.",
          "concept_applied": "Two-part tariff optimization showing how monopolists can achieve both higher profits and economic efficiency by separating the pricing decision into a fixed access fee and a per-unit price set at marginal cost, perfectly capturing consumer surplus while eliminating deadweight loss.",
          "image": {
            "url": "/images/economics/two-part-tariff-optimization.svg",
            "alt": "Two-Part Tariff Optimization",
            "caption": "How two-part tariffs increase profits and efficiency"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Perfect Price Discrimination Ideal",
          "statement": "Under perfect (first-degree) price discrimination, a monopolist charges each consumer exactly their willingness to pay for each unit, capturing all consumer surplus as profit while producing the efficient competitive quantity where P = MC. This represents the profit-maximizing ideal for monopolists and demonstrates that market power alone doesn't necessarily cause inefficiency—it's the combination of market power and uniform pricing that creates deadweight loss.",
          "application": "This principle explains why monopolists invest in market research and segmentation strategies, and why policies that prevent price discrimination might actually increase deadweight loss by forcing monopolists to use uniform pricing.",
          "example": "A custom software developer charging each corporate client based on their specific needs and budget approaches perfect price discrimination, while a standardized software product with one price for all customers creates the standard monopoly deadweight loss.",
          "analogy": "Like an ideal auctioneer who extracts every dollar of value from each bidder—the monopolist gets all the surplus while ensuring the good goes to those who value it most, achieving efficiency despite extreme market power.",
          "image": {
            "url": "/images/economics/perfect-discrimination-ideal.svg",
            "alt": "Perfect Price Discrimination Ideal",
            "caption": "How perfect discrimination achieves efficiency with all surplus to monopolist"
          }
        }
      ]
    }
  ],
  "key_terms": [
    "Monopoly Profit Maximization",
    "Marginal Revenue",
    "Pricing Power",
    "Lerner Index",
    "Inverse Elasticity Rule",
    "Deadweight Loss",
    "Economic Profit",
    "Two-Part Tariff",
    "Block Pricing",
    "Bundling",
    "Peak-Load Pricing",
    "Price Discrimination",
    "Consumer Surplus",
    "Producer Surplus",
    "No Supply Curve",
    "Barriers to Entry",
    "Market Power",
    "Elasticity of Demand",
    "Perfect Discrimination",
    "Welfare Analysis"
  ],
  "summary": "Monopoly profit maximization involves producing where marginal revenue equals marginal cost (MR = MC) and charging the corresponding price from the demand curve, resulting in prices above marginal cost and output restriction compared to competitive markets. The degree of monopoly power is measured by the Lerner Index (P-MC)/P, which equals the inverse of the price elasticity of demand. Monopolists employ various strategic pricing techniques—including price discrimination, two-part tariffs, bundling, and peak-load pricing—to capture more consumer surplus and increase profits. While single-price monopoly creates deadweight loss, perfect price discrimination can achieve efficient output while transferring all surplus to the monopolist. The absence of a supply curve for monopolists reflects their simultaneous choice of both price and quantity based on demand conditions. Understanding monopoly profit maximization provides the foundation for analyzing market power, designing antitrust policy, and evaluating the welfare implications of different market structures."
}
