{
  "expanded_description": "When a few large firms dominate an industry, the game changes entirely. Think about airlines, wireless carriers, car manufacturers, or soft drink companies. These aren't the many small firms of perfect competition, nor the single seller of monopoly. They're something in between - and they behave in ways that neither of those models can explain. In oligopoly, every decision a firm makes - whether to cut prices, launch a new product, or increase advertising - depends critically on how competitors will respond. This strategic interdependence makes oligopoly the most complex and fascinating market structure. This section introduces the key features of oligopoly, why it arises, and the range of possible outcomes from fierce competition to tacit collusion.",
  
  "core_concept": {
    "principle": "Oligopoly is a market structure dominated by a small number of large firms, selling either identical or differentiated products, with significant barriers to entry. The key feature is strategic interdependence: each firm's decisions affect and are affected by rivals' actions, leading to complex strategic behavior ranging from intense competition to coordinated collusion.",
    "explanation": "Imagine you're one of only three airlines flying between two major cities. If you lower fares, you might attract more customers - but your two rivals will probably match your price cut, leaving everyone worse off. If you raise fares, your rivals might not follow, and you'll lose customers. So you constantly have to think: what will they do? This strategic interdependence is what makes oligopoly different. Firms may compete aggressively (sparking price wars), or they may find ways to coordinate (tacitly or explicitly) to keep prices high. The outcome depends on factors like number of firms, product similarity, and how easy it is to detect cheating. Understanding oligopoly requires tools from game theory, which we'll explore in the next section.",
    "image": {
      "src": "images/unit9/oligopoly_intro.png",
      "alt": "Illustration of a few large firms dominating an industry, like airlines, car companies, or wireless providers",
      "caption": "Oligopoly features a few dominant firms whose fortunes are intertwined - each must consider rivals' reactions"
    }
  },

  "sections": [
    {
      "section_title": "6.9 Oligopoly",
      "introduction": "Think about the last time you booked a flight or chose a wireless carrier. You probably had a few major options - maybe United, American, and Delta for flights; Verizon, AT&T, and T-Mobile for phone service. These are oligopolies: markets where a handful of large firms dominate. Why do these industries look so different from the restaurants and hair salons we just studied? How do these few giants compete? Why don't they just charge whatever they want? In this section, we'll explore the unique dynamics of oligopoly, where every move is strategic and rivals are always watching.",
      
      "key_concept": {
        "definition": "Oligopoly is a market structure characterized by: (1) a small number of large firms that dominate the market, (2) products that may be either identical (homogeneous) or differentiated, (3) significant barriers to entry that protect existing firms, and (4) strategic interdependence - each firm must consider how its rivals will respond to its decisions. This interdependence means that outcomes in oligopoly are not uniquely determined but depend on firm behavior and market conditions.",
        "context": "Oligopoly is the most common market structure in modern industrial economies. Think about automobiles (Ford, GM, Toyota, Honda, Volkswagen), airlines (Delta, United, American, Southwest), wireless service (Verizon, AT&T, T-Mobile), soft drinks (Coca-Cola, Pepsi), banking, healthcare, and many manufacturing industries. These markets don't fit the simple models of perfect competition or monopoly because firms are large enough to affect market outcomes but not alone. Understanding oligopoly is crucial for antitrust policy, business strategy, and predicting how industries will evolve. The range of possible outcomes - from cutthroat competition to cozy collusion - makes it both challenging and fascinating."
      },

      "categories": [
        {
          "type": "Characteristics of Oligopoly",
          "description": "Several key features distinguish oligopoly from other market structures.",
          "examples": [
            {
              "process": "Few large firms",
              "explanation": "The industry is dominated by a small number of firms, each with significant market share. The exact number varies - sometimes as few as two (duopoly) like Boeing and Airbus, sometimes five or six major players like in wireless service. What matters is that each firm is large enough that its actions affect market conditions."
            },
            {
              "process": "Strategic interdependence",
              "explanation": "This is the defining feature. When Delta cuts fares, United and American feel it. When Samsung releases a new phone, Apple takes notice. Firms must anticipate and react to rivals' moves. No firm can make decisions in isolation - they're playing a strategic game."
            },
            {
              "process": "Barriers to entry",
              "explanation": "High barriers protect existing firms from new competitors. These might include economies of scale (huge factories), brand loyalty (Coca-Cola), patents (pharmaceuticals), control of resources, or government regulations. Without barriers, profits would attract entrants and the oligopoly would break up."
            },
            {
              "process": "Products may be identical or differentiated",
              "explanation": "Some oligopolies sell homogeneous products: steel, oil, cement, industrial chemicals. Others sell differentiated products: cars, smartphones, airlines (service differentiation), breakfast cereals. This affects how firms compete - price vs. non-price competition."
            }
          ]
        },
        {
          "type": "Types of Oligopoly",
          "description": "Oligopolies can be classified based on product type and firm behavior.",
          "examples": [
            {
              "process": "Pure (homogeneous) oligopoly",
              "explanation": "Firms sell identical products. Competition is primarily on price, but this can lead to price wars, so firms often seek ways to avoid direct price competition. Examples: steel, cement, oil refining, commodity chemicals."
            },
            {
              "process": "Differentiated oligopoly",
              "explanation": "Firms sell similar but not identical products. Competition occurs through price, product features, advertising, and branding. Examples: automobiles, smartphones, airlines, soft drinks, breakfast cereals."
            },
            {
              "process": "Collusive oligopoly",
              "explanation": "Firms cooperate (explicitly or tacitly) to restrict output and raise prices, acting like a joint monopoly. This is usually illegal in the U.S. under antitrust laws. Example: OPEC (Organization of Petroleum Exporting Countries) is a legal international cartel."
            },
            {
              "process": "Non-collusive oligopoly",
              "explanation": "Firms compete aggressively, though they must consider rivals' reactions. This can lead to price wars or competitive outcomes. Most oligopolies fall somewhere between pure competition and perfect collusion."
            }
          ]
        },
        {
          "type": "Measuring Concentration",
          "description": "Economists use several measures to determine how concentrated (how oligopolistic) an industry is.",
          "examples": [
            {
              "process": "Concentration ratio (CR)",
              "explanation": "The concentration ratio measures the combined market share of the largest firms. The four-firm concentration ratio ($CR_4$) sums the market shares of the top four firms. If $CR_4 > 40\\%$, the industry is often considered an oligopoly. If $CR_4 > 60\\%$, it's highly concentrated. Examples: Wireless service $CR_4$ is nearly 100% (Verizon, AT&T, T-Mobile, and a tiny fraction for others)."
            },
            {
              "process": "Herfindahl-Hirschman Index (HHI)",
              "explanation": "The HHI is calculated by summing the squares of each firm's market share. It ranges from near 0 (perfect competition) to 10,000 (monopoly). The formula is $HHI = \\sum_{i=1}^{n} s_i^2$, where $s_i$ is firm $i$'s market share. The U.S. Department of Justice considers markets with $HHI > 2,500$ to be highly concentrated. **Example:** If four firms have shares 30%, 30%, 20%, 20%, $HHI = 900 + 900 + 400 + 400 = 2,600$ (highly concentrated)."
            },
            {
              "process": "Interpreting concentration measures",
              "explanation": "High concentration doesn't automatically mean bad outcomes - sometimes it reflects efficiency (natural oligopoly) or innovation. But it does indicate potential for market power and collusion, which is why antitrust authorities monitor these measures closely."
            }
          ]
        },
        {
          "type": "Coordination and Collusion",
          "description": "Because firms in oligopoly are mutually interdependent, they have incentives to coordinate their behavior to raise profits.",
          "examples": [
            {
              "process": "Explicit collusion (cartels)",
              "explanation": "Firms openly agree to set prices, divide markets, or restrict output. This is illegal in most countries under antitrust laws. The most famous example is OPEC, which coordinates oil production to influence world prices. Cartels are unstable because each member has incentive to cheat on the agreement."
            },
            {
              "process": "Tacit collusion",
              "explanation": "Without explicit agreement, firms may coordinate by watching and matching each other's prices. If everyone knows that price cuts will be matched immediately, no one has incentive to cut. This can lead to prices above competitive levels without any formal agreement. Example: Airlines often match fare changes within hours."
            },
            {
              "process": "Price leadership",
              "explanation": "<strong>Common form of tacit collusion</strong> One firm (usually the largest) announces price changes, and others follow. The leader acts as a barometer for industry conditions. This avoids the chaos of independent pricing. Examples: In the auto industry, one manufacturer might announce price increases, and others follow similar patterns."
            },
            {
              "process": "Why collusion breaks down",
              "explanation": "Collusion is unstable because each firm can increase its own profit by cheating - cutting price slightly to gain market share. If others don't notice immediately, the cheater gains. But once cheating starts, the agreement unravels, often leading to price wars. Successful collusion requires monitoring and punishment mechanisms."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "Strategic Interdependence Defines Oligopoly",
          "statement": "In oligopoly, each firm's profit depends not only on its own decisions but also on the decisions of its rivals. This creates strategic situations where firms must anticipate and react to competitors' actions, making outcomes uncertain and complex.",
          "application": "This principle means that simple supply-and-demand analysis isn't enough for oligopoly. Instead, we need game theory to understand strategic interactions. Managers in oligopolistic industries spend enormous effort analyzing competitors - tracking their prices, products, capacity expansions, and strategic moves.",
          "example": "When Airbus decides whether to launch a new aircraft model, it must consider not just demand and costs, but also how Boeing will respond. Will Boeing launch a competing model? Cut prices on existing models? Speed up development of their next plane? These strategic considerations are as important as the basic economics."
        },
        {
          "principle": "Oligopoly Outcomes Range from Competitive to Monopoly",
          "statement": "Depending on how firms interact, oligopoly can produce outcomes anywhere between perfect competition (if firms compete aggressively) and monopoly (if they collude successfully). This range makes oligopoly both flexible and unpredictable.",
          "application": "This explains why similar industries in different countries or time periods can have very different prices and profits. It also explains why antitrust authorities closely monitor oligopolistic industries - they want to ensure outcomes are closer to competition than collusion.",
          "example": "Consider the airline industry on a particular route. If airlines compete aggressively, fares might be low, near marginal cost. If they tacitly coordinate, fares might be much higher. The same industry, same costs, can produce very different outcomes depending on strategic behavior."
        },
        {
          "principle": "Barriers to Entry Protect Oligopoly Profits",
          "statement": "Like monopoly, oligopoly can sustain long-run profits only if barriers to entry prevent new firms from entering when profits are high. Without barriers, entry would increase competition and erode profits.",
          "application": "This principle helps identify which oligopolies are likely to persist. Industries with high barriers (auto manufacturing, aerospace, wireless) tend to remain oligopolies. Industries where barriers erode (like retail due to e-commerce) see their oligopoly structure break down.",
          "example": "The automobile industry has high barriers: enormous capital requirements, complex supply chains, brand loyalty, and dealership networks. These barriers have kept the industry as an oligopoly for nearly a century despite periods of high profits. No new major car company has successfully entered the U.S. market in decades."
        },
        {
          "principle": "The Kinked Demand Curve Explains Price Stickiness",
          "statement": "An old but useful model of oligopoly suggests that firms face a kinked demand curve: if they raise price, rivals won't follow (so demand is elastic, losing many customers); if they cut price, rivals will match (so demand is inelastic, gaining few customers). This creates a situation where prices tend to be sticky - firms have little incentive to change price.",
          "application": "This model explains why prices in some oligopolistic industries seem rigid - they change infrequently despite cost changes. However, the model has limitations; it doesn't explain how the price got to that point in the first place. Still, it captures an important intuition about asymmetric responses.",
          "example": "In the 1990s, cigarette prices were remarkably stable for long periods. If one company raised prices, others didn't follow (they'd gain market share), so no one raised. If one cut prices, others immediately matched (so no one gained), so no one cut. Prices stayed put. This is the kinked demand curve in action."
        }
      ],

      "worked_examples": [
        {
          "title": "Calculating Concentration Measures",
          "problem": "An industry has eight firms with the following market shares: Firm A: 25%, Firm B: 20%, Firm C: 15%, Firm D: 10%, Firm E: 8%, Firm F: 7%, Firm G: 5%, Firm H: 10%. a) Calculate the four-firm concentration ratio ($CR_4$). b) Calculate the Herfindahl-Hirschman Index (HHI). c) Based on these measures, would you classify this industry as an oligopoly? d) If Firm H and Firm F merge, what happens to HHI? Would antitrust authorities be concerned?",
          "step_by_step": [
            {
              "step": "Identify the top four firms",
              "explanation": "The top four firms by market share: A (25%), B (20%), C (15%), D (10%). Their combined share = 25 + 20 + 15 + 10 = 70%."
            },
            {
              "step": "Calculate $CR_4$",
              "explanation": "$CR_4 = 70\\%$. This is well above the 40% threshold typically used to identify oligopoly, and above the 60% threshold for high concentration."
            },
            {
              "step": "Calculate HHI",
              "explanation": "$HHI = \\sum s_i^2 = 25^2 + 20^2 + 15^2 + 10^2 + 8^2 + 7^2 + 5^2 + 10^2$ = $625 + 400 + 225 + 100 + 64 + 49 + 25 + 100 = 1,588$."
            },
            {
              "step": "Interpret HHI",
              "explanation": "The U.S. Department of Justice considers markets with HHI below 1,500 to be unconcentrated, 1,500-2,500 moderately concentrated, and above 2,500 highly concentrated. Here, HHI = 1,588 falls in the moderately concentrated range. This is interesting - $CR_4$ suggests oligopoly (70%), but HHI suggests only moderate concentration because the remaining firms have significant shares."
            },
            {
              "step": "Analyze proposed merger",
              "explanation": "Firm H (10%) and Firm F (7%) merge. New firm would have 17% share. Recalculate HHI: Remove H and F, add new firm at 17%. Original HHI = 1,588. The contributions of H and F were $10^2 + 7^2 = 100 + 49 = 149$. New contribution = $17^2 = 289$. Change in HHI = $289 - 149 = 140$. New HHI = $1,588 + 140 = 1,728$."
            },
            {
              "step": "Antitrust concern",
              "explanation": "The merger increases HHI by 140 points, moving from 1,588 to 1,728. DOJ guidelines say mergers that increase HHI by more than 100 points in moderately concentrated markets may raise significant competitive concerns. This merger would likely be scrutinized."
            }
          ],
          "final_answer": "a) $CR_4 = 70\\%$. b) HHI = 1,588. c) Yes, $CR_4$ suggests oligopoly, though HHI shows only moderate concentration. d) After merger, HHI = 1,728, an increase of 140 points, which would likely trigger antitrust review.",
          "concept_applied": "Concentration measures help identify oligopoly and guide antitrust policy. $CR_4$ is simple but crude; HHI gives more weight to large firms and is used in merger guidelines."
        },
        {
          "title": "Analyzing Strategic Interdependence",
          "problem": "Consider two competing coffee shops, A and B, in a small town. They face the following situation: If both charge $\\$3$ per cup, each earns $\\$500$ profit per day. If both charge $\\$2.50$, each earns $\\$300$ profit per day. If one charges $\\$3$ and the other charges $\\$2.50$, the low-price shop earns $\\$700$ (gains customers) and the high-price shop earns $\\$100$. a) What type of market structure is this? b) If the shops act independently and selfishly, what will happen? c) Why might this outcome be worse for both than if they cooperated? d) What could they do to achieve the better outcome?",
          "step_by_step": [
            {
              "step": "Identify market structure",
              "explanation": "Two firms dominate the market, they're interdependent, and there are barriers to entry (small town can't support many coffee shops). This is a **duopoly**, a special case of oligopoly."
            },
            {
              "step": "Analyze independent decision-making",
              "explanation": "From A's perspective: If B charges $\\$3$, A can charge $\\$3$ and earn $\\$500$, or charge $\\$2.50$ and earn $\\$700$. Better to charge $\\$2.50$. If B charges $\\$2.50$, A can charge $\\$3$ and earn $\\$100$, or charge $\\$2.50$ and earn $\\$300$. Better to charge $\\$2.50$. So regardless of what B does, A's best move is to charge $\\$2.50$. Same logic for B. So both charge $\\$2.50$, each earning $\\$300$."
            },
            {
              "step": "Compare to cooperative outcome",
              "explanation": "If they cooperated and both charged $\\$3$, each would earn $\\$500$. That's better for both than $\\$300$. But individually, each has incentive to cheat by cutting price to $\\$2.50$ to gain more customers. The cooperative outcome is unstable."
            },
            {
              "step": "Explain the dilemma",
              "explanation": "This is a classic prisoner's dilemma. Acting in their individual self-interest leads to a worse outcome for both ($\\$300$ each) than if they could cooperate ($\\$500$ each). But cooperation is fragile because each has incentive to cheat."
            },
            {
              "step": "Discuss possible solutions",
              "explanation": "They might try to collude explicitly (illegal), or find ways to coordinate tacitly - perhaps one acts as price leader and both maintain $\\$3$. But without enforcement, cheating tempts. Repeat interaction can help - if they expect to compete forever, they might maintain cooperation to avoid price wars. This is why repeated games differ from one-shot games."
            }
          ],
          "final_answer": "a) Duopoly (oligopoly). b) Both charge $\\$2.50$, earning $\\$300$ each. c) Cooperative outcome of $\\$3$ each would give $\\$500$ each - better for both but unstable. d) They might collude (illegal) or develop tacit coordination through price leadership or repeated interaction.",
          "concept_applied": "Strategic interdependence in oligopoly can lead to prisoner's dilemma outcomes where individual rationality leads to collectively worse results. This explains why oligopolies often have incentives to collude and why collusion is unstable."
        }
      ],

      "image": {
        "src": "images/unit9/oligopoly_kinked_demand.png",
        "alt": "Graph showing kinked demand curve with gap in marginal revenue, explaining price stickiness in oligopoly",
        "caption": "The kinked demand curve model suggests prices in oligopoly are sticky because rivals match price cuts but not increases"
      }
    }
  ],

  "key_terms": [
    "Oligopoly",
    "Duopoly",
    "Strategic interdependence",
    "Concentration ratio (CR)",
    "Herfindahl-Hirschman Index (HHI)",
    "Barriers to entry",
    "Collusion",
    "Cartel",
    "Tacit collusion",
    "Price leadership",
    "Kinked demand curve",
    "Price stickiness",
    "Non-price competition",
    "Game theory (preview)",
    "Prisoner's dilemma",
    "Antitrust",
    "Merger guidelines",
    "OPEC"
  ],

  "summary": "Oligopoly is a market structure dominated by a small number of large firms, characterized by strategic interdependence - each firm's decisions affect and are affected by rivals. Key features include few large firms, significant barriers to entry, and products that may be homogeneous or differentiated. Concentration measures like the four-firm concentration ratio ($CR_4$) and the Herfindahl-Hirschman Index ($HHI = \\sum s_i^2$) help identify oligopolistic industries and guide antitrust policy. Oligopoly outcomes span a wide range depending on firm behavior. At one extreme, fierce competition can drive prices toward marginal cost; at the other, successful collusion can achieve monopoly-like prices and profits. Collusion may be explicit (illegal cartels like OPEC) or tacit (price leadership, follow-the-leader pricing). However, collusion is unstable because each firm has incentive to cheat, leading to the prisoner's dilemma. The kinked demand curve model suggests prices in oligopoly tend to be sticky because rivals match price cuts but not increases, creating asymmetric incentives. Real-world oligopolies include automobiles, airlines, wireless services, soft drinks, and many manufacturing industries. Understanding oligopoly is crucial for business strategy, antitrust enforcement, and predicting industry evolution. The complexity of strategic interaction means that simple models are insufficient - we need game theory to fully analyze oligopoly behavior, which we'll explore in the next section."
}

