{
  "title": "6.9 Oligopoly",
  "expanded_description": "Analyzing oligopoly market structure characterized by a small number of large firms producing either homogeneous or differentiated products, where strategic interdependence leads to complex competitive behavior and various equilibrium outcomes.",
  "core_concept": {
    "principle": "Oligopoly features a market dominated by a few interdependent firms where each firm's decisions significantly affect competitors and are affected by competitors' decisions, creating strategic behavior that can lead to collusion, competition, or various intermediate outcomes.",
    "explanation": "The fundamental characteristic of oligopoly is strategic interdependence—each firm must consider competitors' likely reactions when making pricing, output, or investment decisions. This interdependence leads to multiple possible equilibria and makes game theory essential for understanding oligopoly behavior. Outcomes range from competitive pricing to monopoly-level collusion depending on market conditions, firm strategies, and institutional constraints.",
    "image": {
      "url": "/images/economics/oligopoly-structure.svg",
      "alt": "Oligopoly Market Structure",
      "caption": "Few dominant firms with strategic interdependence"
    }
  },
  "sections": [
    {
      "section_title": "Characteristics and Types of Oligopoly",
      "introduction": "Understanding the defining features of oligopoly markets and the different forms they take based on product differentiation, market concentration, and competitive dynamics.",
      "key_concept": {
        "definition": "Oligopoly is characterized by: (1) few dominant firms with substantial market share, (2) significant barriers to entry, (3) strategic interdependence, and (4) either homogeneous (pure oligopoly) or differentiated (differentiated oligopoly) products. The small number of firms creates mutual awareness and strategic interaction.",
        "context": "Oligopoly represents the most common market structure for major industries like automobiles, airlines, telecommunications, and consumer electronics, where a handful of firms dominate global or national markets.",
        "image": {
          "url": "/images/economics/oligopoly-characteristics.svg",
          "alt": "Characteristics of Oligopoly",
          "caption": "Key features distinguishing oligopoly from other market structures"
        }
      },
      "classifications": [
        {
          "type": "Market Concentration Measures",
          "value": "Quantifying the degree of market dominance",
          "characteristics": ["Concentration Ratios", "Herfindahl-Hirschman Index", "Market Share Distribution", "Barriers to Entry"],
          "behavior": "Higher concentration typically leads to more coordinated behavior and greater market power, though the relationship depends on product differentiation, cost structures, and competitive dynamics.",
          "examples": [
            {
              "process": "Concentration Ratio Calculation",
              "explanation": "The four-firm concentration ratio (CR4) measures the percentage of total industry sales accounted for by the four largest firms. CR4 > 40% often indicates oligopoly, while CR4 > 60% suggests tight oligopoly.",
              "image": {
                "url": "/images/economics/concentration-ratio-calculation.svg",
                "alt": "Concentration Ratio Calculation",
                "caption": "Measuring market dominance through concentration ratios"
              }
            },
            {
              "process": "Herfindahl-Hirschman Index (HHI)",
              "explanation": "HHI sums the squares of all firms' market shares, giving greater weight to larger firms. HHI > 1,500 indicates high concentration, while HHI > 2,500 suggests tight oligopoly.",
              "image": {
                "url": "/images/economics/hhi-calculation.svg",
                "alt": "Herfindahl-Hirschman Index",
                "caption": "Comprehensive measure of market concentration"
              }
            }
          ]
        },
        {
          "type": "Oligopoly Types and Classifications",
          "value": "Different forms of oligopoly based on market conditions",
          "characteristics": ["Pure vs Differentiated Oligopoly", "Collusive vs Non-collusive", "Symmetric vs Asymmetric", "Global vs Regional"],
          "behavior": "Different oligopoly types exhibit distinct competitive dynamics: homogeneous product oligopolies compete mainly on price, while differentiated oligopolies compete on product attributes, branding, and innovation.",
          "examples": [
            {
              "process": "Pure Oligopoly Dynamics",
              "explanation": "In markets with homogeneous products (steel, chemicals, cement), firms have identical cost structures and compete primarily on price and production capacity, often leading to price wars or collusion.",
              "image": {
                "url": "/images/economics/pure-oligopoly-dynamics.svg",
                "alt": "Pure Oligopoly Dynamics",
                "caption": "Competition in homogeneous product oligopolies"
              }
            },
            {
              "process": "Differentiated Oligopoly Strategies",
              "explanation": "With differentiated products (automobiles, smartphones, airlines), firms compete through product features, quality, branding, and innovation while maintaining price premiums for perceived differences.",
              "image": {
                "url": "/images/economics/differentiated-oligopoly.svg",
                "alt": "Differentiated Oligopoly Strategies",
                "caption": "Non-price competition in differentiated oligopolies"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Market Concentration Analysis",
          "problem": "An industry has 8 firms with market shares: Firm A: 30%, Firm B: 25%, Firm C: 15%, Firm D: 10%, Firm E: 8%, Firm F: 6%, Firm G: 4%, Firm H: 2%. Calculate the 4-firm concentration ratio and Herfindahl-Hirschman Index. Classify the market structure.",
          "step_by_step": [
            {
              "step": "Calculate Four-Firm Concentration Ratio",
              "explanation": "Sum the market shares of the four largest firms",
              "calculation": "CR4 = Firm A + Firm B + Firm C + Firm D\nCR4 = 30% + 25% + 15% + 10% = 80%"
            },
            {
              "step": "Calculate Herfindahl-Hirschman Index",
              "explanation": "Sum the squares of all firms' market shares",
              "calculation": "HHI = 30² + 25² + 15² + 10² + 8² + 6² + 4² + 2²\nHHI = 900 + 625 + 225 + 100 + 64 + 36 + 16 + 4 = 1,970"
            },
            {
              "step": "Interpret Concentration Ratio",
              "explanation": "Classify based on CR4 value",
              "calculation": "CR4 = 80% > 60%\nThis indicates a highly concentrated market (tight oligopoly)"
            },
            {
              "step": "Interpret HHI Value",
              "explanation": "Classify based on HHI guidelines",
              "calculation": "HHI = 1,970\n1,500 < HHI < 2,500 indicates moderately concentrated market\nHHI > 1,800 often triggers antitrust concerns"
            },
            {
              "step": "Market Structure Classification",
              "explanation": "Synthesize both measures",
              "calculation": "Both CR4 (80%) and HHI (1,970) indicate oligopoly\nHigh concentration with dominant firms\nSubstantial market power exists"
            },
            {
              "step": "Competitive Implications",
              "explanation": "Discuss likely market behavior",
              "calculation": "With 80% concentration in 4 firms, coordinated behavior likely\nSubstantial barriers to entry protect incumbent profits\nAntitrust authorities would monitor this market closely"
            }
          ],
          "final_answer": "Four-firm concentration ratio: CR4 = 80%. Herfindahl-Hirschman Index: HHI = 1,970. This market represents a tight oligopoly with high concentration. The CR4 exceeding 60% and HHI near 2,000 indicate substantial market power held by a few dominant firms. This level of concentration typically enables coordinated behavior, creates significant barriers to entry, and would attract antitrust scrutiny, particularly if the HHI increased further through mergers.",
          "concept_applied": "Market concentration analysis using both concentration ratios and HHI to classify market structure and assess the degree of competition, demonstrating how these measures complement each other in evaluating market power and competitive conditions in oligopolistic markets.",
          "image": {
            "url": "/images/economics/market-concentration-analysis.svg",
            "alt": "Market Concentration Analysis",
            "caption": "Using concentration measures to classify market structure"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Mutual Interdependence Principle",
          "statement": "In oligopoly, each firm's optimal decisions depend on competitors' actions and expected reactions, creating a complex web of strategic interdependence. Unlike other market structures, oligopolists cannot ignore how rivals will respond to their price changes, output decisions, or product innovations. This interdependence makes game theory essential for understanding oligopoly behavior and leads to multiple possible equilibria.",
          "application": "This principle explains why oligopoly outcomes are indeterminate without additional assumptions about firm behavior, and why different oligopoly models (Cournot, Bertrand, Stackelberg) produce different predictions based on their behavioral assumptions.",
          "example": "When Airbus considers launching a new aircraft model, it must anticipate how Boeing will respond—with price cuts on existing models, accelerated development of competing aircraft, or other competitive moves—and incorporate these expectations into its decision.",
          "analogy": "Like players in a poker game—each player's betting strategy depends not only on their own cards but on how they expect other players to react to their bets, creating a complex strategic interaction where outcomes depend on mutual expectations.",
          "image": {
            "url": "/images/economics/mutual-interdependence-principle.svg",
            "alt": "Mutual Interdependence Principle",
            "caption": "How firms' decisions are interconnected in oligopoly"
          }
        }
      ]
    },
    {
      "section_title": "Non-Collusive Oligopoly Models",
      "introduction": "Analyzing different theoretical models of oligopoly behavior where firms compete rather than collude, each based on different assumptions about how firms make strategic decisions.",
      "key_concept": {
        "definition": "Non-collusive oligopoly models include Cournot (quantity competition), Bertrand (price competition), and Stackelberg (leader-follower) models, each producing different equilibrium outcomes based on assumptions about strategic variables and decision timing.",
        "context": "These models provide frameworks for understanding how oligopolists might behave competitively, with the choice of model depending on industry characteristics like production flexibility, capacity constraints, and product differentiation.",
        "image": {
          "url": "/images/economics/non-collusive-oligopoly-models.svg",
          "alt": "Non-Collusive Oligopoly Models",
          "caption": "Different competitive models for oligopoly behavior"
        }
      },
      "classifications": [
        {
          "type": "Quantity Competition Models",
          "value": "Firms compete by choosing output levels",
          "characteristics": ["Cournot Model", "Reaction Functions", "Nash Equilibrium", "Market Share Stability"],
          "behavior": "In quantity competition, firms choose output levels simultaneously, with each firm's optimal output depending on competitors' outputs. The equilibrium occurs where all firms are on their reaction functions.",
          "examples": [
            {
              "process": "Cournot Equilibrium",
              "explanation": "Each firm chooses its profit-maximizing output taking competitors' outputs as given. The Nash equilibrium occurs where all firms' reaction functions intersect, with total output between monopoly and competitive levels.",
              "image": {
                "url": "/images/economics/cournot-equilibrium.svg",
                "alt": "Cournot Equilibrium",
                "caption": "Nash equilibrium in quantity competition"
              }
            },
            {
              "process": "Reaction Function Derivation",
              "explanation": "Each firm's reaction function shows its profit-maximizing output for every possible output level chosen by competitors. Equilibrium requires mutual consistency—each firm's output is optimal given others' choices.",
              "image": {
                "url": "/images/economics/reaction-function-derivation.svg",
                "alt": "Reaction Function Derivation",
                "caption": "How firms determine optimal responses to competitors"
              }
            }
          ]
        },
        {
          "type": "Price Competition Models",
          "value": "Firms compete by setting prices",
          "characteristics": ["Bertrand Model", "Price Undercutting", "Differentiated Products", "Capacity Constraints"],
          "behavior": "In price competition with homogeneous products, the Bertrand paradox occurs—even with only two firms, competition drives prices to marginal cost. With differentiated products or capacity constraints, equilibrium prices exceed marginal cost.",
          "examples": [
            {
              "process": "Bertrand Paradox",
              "explanation": "With homogeneous products and no capacity constraints, price competition between two firms leads to perfectly competitive pricing (P = MC) regardless of the number of firms, contradicting the intuition that fewer firms mean higher prices.",
              "image": {
                "url": "/images/economics/bertrand-paradox.svg",
                "alt": "Bertrand Paradox",
                "caption": "How price competition can eliminate market power"
              }
            },
            {
              "process": "Differentiated Bertrand Competition",
              "explanation": "With product differentiation, price competition leads to equilibrium prices above marginal cost, with the markup depending on the degree of differentiation and cross-price elasticities.",
              "image": {
                "url": "/images/economics/differentiated-bertrand.svg",
                "alt": "Differentiated Bertrand Competition",
                "caption": "Price competition with imperfect substitutes"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Cournot Duopoly Equilibrium",
          "problem": "Two firms produce identical products with market demand P = 100 - Q, where Q = Q₁ + Q₂. Both firms have MC = 10. Find the Cournot equilibrium quantities, price, and profits.",
          "step_by_step": [
            {
              "step": "Set Up Firm 1's Profit Maximization",
              "explanation": "Write Firm 1's profit function taking Q₂ as given",
              "calculation": "Firm 1's demand: P = 100 - (Q₁ + Q₂)\nTR₁ = P × Q₁ = [100 - (Q₁ + Q₂)]Q₁ = 100Q₁ - Q₁² - Q₁Q₂\nMR₁ = ∂TR₁/∂Q₁ = 100 - 2Q₁ - Q₂"
            },
            {
              "step": "Firm 1's First-Order Condition",
              "explanation": "Set MR₁ = MC for profit maximization",
              "calculation": "MR₁ = MC\n100 - 2Q₁ - Q₂ = 10\n2Q₁ = 90 - Q₂\nQ₁ = 45 - 0.5Q₂ (Firm 1's reaction function)"
            },
            {
              "step": "Set Up Firm 2's Profit Maximization",
              "explanation": "By symmetry, Firm 2 has identical problem",
              "calculation": "Firm 2's reaction function: Q₂ = 45 - 0.5Q₁"
            },
            {
              "step": "Solve Simultaneous Equations",
              "explanation": "Find intersection of reaction functions",
              "calculation": "Substitute Q₂ into Q₁'s reaction function:\nQ₁ = 45 - 0.5(45 - 0.5Q₁)\nQ₁ = 45 - 22.5 + 0.25Q₁\nQ₁ - 0.25Q₁ = 22.5\n0.75Q₁ = 22.5\nQ₁ = 30"
            },
            {
              "step": "Find Q₂ and Total Output",
              "explanation": "Use symmetry and calculate market total",
              "calculation": "By symmetry, Q₂ = 30\nTotal Q = Q₁ + Q₂ = 30 + 30 = 60"
            },
            {
              "step": "Calculate Equilibrium Price",
              "explanation": "Substitute total output into demand function",
              "calculation": "P = 100 - Q = 100 - 60 = 40"
            },
            {
              "step": "Calculate Firm Profits",
              "explanation": "Compute profit for each firm",
              "calculation": "Each firm's profit: π = (P - MC) × Q\nπ = (40 - 10) × 30 = 30 × 30 = 900"
            },
            {
              "step": "Compare to Monopoly and Competition",
              "explanation": "Benchmark against other market structures",
              "calculation": "Monopoly: MR=MC → 100-2Q=10 → Q=45, P=55, π=2,025\nCompetition: P=MC=10 → Q=90, π=0\nCournot: Intermediate outcome with duopoly profits"
            }
          ],
          "final_answer": "Cournot equilibrium: Each firm produces Q=30 units, Market price P=$40, Each firm earns profit=$900. Total market output (60 units) is between monopoly (45 units) and competitive (90 units) levels, with price between monopoly ($55) and competitive ($10) prices. The duopoly generates substantial economic profits while providing more output at lower prices than monopoly.",
          "concept_applied": "Cournot quantity competition model showing how duopolists independently choose outputs based on competitors' expected production, reaching a Nash equilibrium where both firms are on their reaction functions, producing an intermediate outcome between monopoly and perfect competition.",
          "image": {
            "url": "/images/economics/cournot-duopoly-equilibrium.svg",
            "alt": "Cournot Duopoly Equilibrium",
            "caption": "Nash equilibrium in Cournot quantity competition"
          }
        }
      ],
      "principles": [
        {
          "principle": "The First-Mover Advantage Principle",
          "statement": "In sequential-move oligopoly games (Stackelberg model), the firm that moves first gains a strategic advantage by committing to an output level that competitors must take as given. The Stackelberg leader produces more and earns higher profits than Cournot competitors, while followers produce less and earn lower profits. This explains why firms often race to enter new markets or invest in irreversible capacity.",
          "application": "This principle explains strategic pre-emption in industries with significant scale economies or network effects, where establishing an early dominant position creates sustainable competitive advantages.",
          "example": "In commercial aircraft manufacturing, Airbus and Boeing engage in intense competition to launch new aircraft models first, knowing the first-mover can shape market expectations and capture early orders that influence subsequent purchasing decisions.",
          "analogy": "Like claiming the best spot on a beach—the first arrival gets the prime location and forces later arrivals to accommodate themselves around the established position.",
          "image": {
            "url": "/images/economics/first-mover-advantage.svg",
            "alt": "First-Mover Advantage Principle",
            "caption": "Strategic benefits of moving first in sequential games"
          }
        }
      ]
    },
    {
      "section_title": "Collusive Oligopoly and Game Theory",
      "introduction": "Analyzing how oligopolists may coordinate behavior to increase joint profits, the factors affecting collusion stability, and how game theory explains both cooperation and cheating in repeated interactions.",
      "key_concept": {
        "definition": "Collusive oligopoly occurs when firms explicitly or tacitly coordinate their actions to reduce competition and increase joint profits. Game theory, particularly the prisoner's dilemma framework, explains why collusion is often unstable despite its mutual benefits, as each firm has incentives to cheat on agreements.",
        "context": "While explicit collusion (cartels) is generally illegal, tacit coordination is common in concentrated industries. Understanding the conditions that support or undermine collusion helps explain pricing patterns and informs antitrust policy.",
        "image": {
          "url": "/images/economics/collusive-oligopoly.svg",
          "alt": "Collusive Oligopoly and Game Theory",
          "caption": "Coordination, cheating incentives, and repeated games"
        }
      },
      "classifications": [
        {
          "type": "Cartels and Explicit Collusion",
          "value": "Formal agreements to restrict competition",
          "characteristics": ["Output Quotas", "Price Fixing", "Market Sharing", "Bid Rigging"],
          "behavior": "Cartels explicitly coordinate to restrict output and raise prices, acting as a multi-plant monopoly. However, cheating incentives and enforcement problems typically undermine cartel stability over time.",
          "examples": [
            {
              "process": "Joint Profit Maximization",
              "explanation": "A perfect cartel acts as a multi-plant monopolist, allocating production among members to equalize marginal costs and setting monopoly price to maximize total industry profits.",
              "image": {
                "url": "/images/economics/joint-profit-maximization.svg",
                "alt": "Joint Profit Maximization",
                "caption": "How cartels coordinate to achieve monopoly outcomes"
              }
            },
            {
              "process": "Quota Allocation Problems",
              "explanation": "Cartels face challenges in allocating production quotas among members, particularly when firms have different cost structures or capacity constraints, creating tensions that can destabilize agreements.",
              "image": {
                "url": "/images/economics/quota-allocation-problems.svg",
                "alt": "Quota Allocation Problems",
                "caption": "Distributional conflicts in cartel operations"
              }
            }
          ]
        },
        {
          "type": "Tacit Collusion and Facilitating Practices",
          "value": "Informal coordination without explicit agreement",
          "characteristics": ["Price Leadership", "Signaling", "Most-Favored-Customer Clauses", "Meeting Competition Clauses"],
          "behavior": "Tacit collusion occurs when firms coordinate without explicit communication, often through price leadership, advance price announcements, or other practices that facilitate parallel behavior.",
          "examples": [
            {
              "process": "Price Leadership Dynamics",
              "explanation": "In many oligopolies, one firm (often the largest or most efficient) initiates price changes that other firms follow, creating coordinated pricing without explicit agreement.",
              "image": {
                "url": "/images/economics/price-leadership-dynamics.svg",
                "alt": "Price Leadership Dynamics",
                "caption": "How dominant firms coordinate industry pricing"
              }
            },
            {
              "process": "Prisoner's Dilemma in Oligopoly",
              "explanation": "The one-shot prisoner's dilemma explains why cheating dominates cooperation, while repeated games show how tit-for-tat strategies can sustain cooperation when firms value future profits sufficiently.",
              "image": {
                "url": "/images/economics/prisoners-dilemma-oligopoly.svg",
                "alt": "Prisoner's Dilemma in Oligopoly",
                "caption": "Strategic tensions between cooperation and cheating"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Prisoner's Dilemma in Duopoly",
          "problem": "Two firms consider colluding on price. If both cooperate (maintain high prices), each earns $10 million. If both cheat (cut prices), each earns $6 million. If one cheats while the other cooperates, the cheater earns $15 million while the cooperator earns $2 million. Analyze this game and discuss repeated interaction implications.",
          "step_by_step": [
            {
              "step": "Set Up Payoff Matrix",
              "explanation": "Organize the strategic situation",
              "calculation": "Firm B: Cooperate | Cheat\nFirm A: Cooperate | (10,10) | (2,15)\nFirm A: Cheat | (15,2) | (6,6)\n(Values in $ millions, A's payoff first)"
            },
            {
              "step": "Find Dominant Strategies",
              "explanation": "Identify each firm's best response regardless of competitor's choice",
              "calculation": "If B cooperates: A gets 10 by cooperating, 15 by cheating → Prefer cheating\nIf B cheats: A gets 2 by cooperating, 6 by cheating → Prefer cheating\nCheating is dominant strategy for both firms"
            },
            {
              "step": "Identify Nash Equilibrium",
              "explanation": "Find where both firms play best responses",
              "calculation": "Both cheating is only Nash equilibrium: (6,6)\nMutual cheating is stable despite mutual cooperation being better (10,10)"
            },
            {
              "step": "Pareto Efficiency Analysis",
              "explanation": "Compare equilibrium to other outcomes",
              "calculation": "Mutual cooperation (10,10) Pareto dominates mutual cheating (6,6)\nBut mutual cooperation isn't equilibrium due to cheating incentives"
            },
            {
              "step": "Repeated Game Considerations",
              "explanation": "How repeated interaction changes incentives",
              "calculation": "In repeated games, firms can punish cheating in future periods\nIf discount rate is low enough, cooperation can be sustained\nTit-for-tat: cooperate if opponent cooperated last period, cheat if they cheated"
            },
            {
              "step": "Collusion Sustainability Condition",
              "explanation": "When cooperation can be equilibrium in repeated game",
              "calculation": "Cooperation sustainable if: Gain from cheating ≤ Future loss from punishment\n(15-10) ≤ (10-6)/r where r is discount rate\n5 ≤ 4/r → r ≤ 0.8 → Cooperation sustainable if firms value future sufficiently"
            }
          ],
          "final_answer": "One-shot game: Unique Nash equilibrium is both firms cheating, earning $6 million each, despite mutual cooperation yielding $10 million each—classic prisoner's dilemma. In repeated games, cooperation can be sustained if firms value future profits sufficiently (discount rate ≤ 0.8). This explains why collusion is more stable in industries with stable membership, good monitoring, and low discount rates, while it breaks down when cheating is hard to detect or punishment is ineffective.",
          "concept_applied": "Prisoner's dilemma analysis of collusion showing why cheating dominates in one-shot games but cooperation can emerge in repeated interactions through credible punishment threats, explaining the conditions under which collusion is stable or unstable in oligopolistic markets.",
          "image": {
            "url": "/images/economics/prisoners-dilemma-analysis.svg",
            "alt": "Prisoner's Dilemma Analysis",
            "caption": "Strategic analysis of cooperation and cheating in oligopoly"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Folk Theorem of Repeated Games",
          "statement": "In infinitely repeated games, almost any payoff combination that gives each player more than their minimax payoff can be sustained as a Nash equilibrium if players are sufficiently patient. This theorem explains why many different outcomes—from cutthroat competition to perfect collusion—can emerge in oligopoly depending on firms' expectations, monitoring capabilities, and punishment strategies.",
          "application": "This principle explains the diversity of observed outcomes in oligopolistic industries and why the same market structure can produce either competitive or collusive results based on factors like information transparency, demand stability, and firms' time horizons.",
          "example": "The airline industry exhibits periods of intense price competition alternating with periods of stable, coordinated pricing, depending on capacity utilization, monitoring effectiveness, and firms' financial conditions affecting their discount rates.",
          "analogy": "Like neighbors maintaining a shared fence—both benefit from cooperation, but either could cheat by not contributing. The outcome depends on whether they expect to interact repeatedly and value future cooperation enough to resist short-term cheating temptations.",
          "image": {
            "url": "/images/economics/folk-theorem.svg",
            "alt": "Folk Theorem of Repeated Games",
            "caption": "Multiple possible equilibria in repeated oligopoly games"
          }
        }
      ]
    }
  ],
  "key_terms": [
    "Oligopoly",
    "Strategic Interdependence",
    "Concentration Ratio",
    "Herfindahl-Hirschman Index",
    "Cournot Model",
    "Bertrand Model",
    "Stackelberg Model",
    "Reaction Function",
    "Nash Equilibrium",
    "Collusion",
    "Cartel",
    "Price Leadership",
    "Prisoner's Dilemma",
    "Game Theory",
    "Tacit Collusion",
    "Barriers to Entry",
    "Market Power",
    "Differentiated Products",
    "Homogeneous Products",
    "First-Mover Advantage",
    "Folk Theorem"
  ],
  "summary": "Oligopoly represents markets dominated by a few interdependent firms where each firm's decisions significantly affect competitors and are affected by competitors' decisions. Market concentration is measured by concentration ratios and the Herfindahl-Hirschman Index. Non-collusive oligopoly models include Cournot (quantity competition), Bertrand (price competition), and Stackelberg (sequential moves), each producing different equilibrium outcomes. The Cournot model yields intermediate outcomes between monopoly and competition, while the Bertrand model with homogeneous products paradoxically gives competitive pricing even with few firms. Collusive oligopoly involves explicit cartels or tacit coordination to restrict output and raise prices, but stability is challenged by cheating incentives explained by the prisoner's dilemma. Repeated game theory shows how cooperation can be sustained through credible punishment threats. Oligopoly outcomes are inherently indeterminate and depend on product differentiation, cost structures, information conditions, and firms' strategic behavior, making this the most complex and strategically rich market structure."
}
