{
  "expanded_description": "At the heart of every business decision lies a simple question: how much should we produce? Produce too little, and you leave money on the table - customers who would have bought from you go elsewhere. Produce too much, and you're stuck with unsold inventory or, worse, selling each additional unit for less than it cost to make. Finding the sweet spot - the quantity that maximizes profit - is the fundamental challenge of running a business. Economists have developed a powerful and universal rule for finding this optimal output: produce until the revenue from one more unit just equals the cost of making that unit. This marginal approach works for every firm, from a tiny lemonade stand to a massive multinational corporation, regardless of market structure. This section explores the profit maximization rule, why it works, and how firms apply it in practice.",
  
  "core_concept": {
    "principle": "Firms maximize profit by producing the quantity where marginal revenue (MR) equals marginal cost (MC). At this point, the additional revenue from the last unit produced exactly equals the additional cost, and any change in output would reduce profit.",
    "explanation": "Think about eating pizza when you're hungry. The first slice is delicious - huge satisfaction (marginal benefit). The second is still good. By the fourth or fifth, you're getting full - the satisfaction from another slice is small. You stop eating when the satisfaction from one more slice would be less than the discomfort of being too full. Firms do the same thing, but with dollars. They compare the extra revenue from selling one more unit (marginal revenue) to the extra cost of making it (marginal cost). If MR > MC, that unit adds to profit - make it. If MR < MC, that unit reduces profit - don't make it. The profit-maximizing quantity is exactly where MR = MC. This rule works whether the firm is a price taker in perfect competition or a price maker with market power - the only difference is how MR behaves.",
    "image": {
      "src": "images/unit6/profit_maximization_intro.png",
      "alt": "Diagram showing marginal revenue and marginal cost curves intersecting, with profit-maximizing quantity at the intersection",
      "caption": "Profit is maximized where the marginal revenue curve crosses the marginal cost curve - the golden rule of firm behavior"
    }
  },

  "sections": [
    {
      "section_title": "6.3 Profit Maximization",
      "introduction": "Imagine you're running a small bakery. Each morning, you decide how many loaves of bread to bake. Bake too few, and you run out by noon, missing sales. Bake too many, and you're throwing away stale bread at the end of the day. Somewhere in between is the perfect number - the quantity that maximizes your profit. But how do you find it? You could guess, but economists have discovered a precise rule that works every time. This rule - produce until marginal revenue equals marginal cost - is one of the most powerful ideas in economics. It applies to every firm, in every industry, in every market structure. Once you understand it, you understand how businesses make their most fundamental decision.",
      
      "key_concept": {
        "definition": "Profit maximization is the process by which firms determine the price and output level that yields the greatest possible profit. The general rule is to produce where marginal revenue (MR) equals marginal cost (MC). This condition ensures that the last unit produced adds exactly as much to revenue as to cost, so no profitable expansion remains and no loss-producing contraction is needed.",
        "context": "The MR = MC rule comes from basic logic about changes. Profit = Total Revenue - Total Cost. If we produce one more unit, profit changes by MR - MC. If MR > MC, profit increases - so we should produce that unit. If MR < MC, profit decreases - so we should not produce that unit. The only place where profit can't be increased by changing output is where MR = MC. This is true for all firms, but the shape of MR depends on market structure. In perfect competition, MR is constant and equals price. In imperfect competition, MR falls as output increases. Understanding this rule helps explain why competitive firms produce more and charge less than monopolies, and why firms respond to cost changes the way they do."
      },

      "categories": [
        {
          "type": "The Logic of Marginal Analysis",
          "description": "Profit maximization is an application of marginal thinking - comparing the benefits and costs of small changes.",
          "examples": [
            {
              "process": "Thinking at the margin",
              "explanation": "Instead of asking \"Should I produce 100 units or 200 units?\" firms ask \"Should I produce one more unit?\" This incremental approach is powerful because decisions are usually about small adjustments. By repeatedly asking about the next unit, firms naturally find the optimal quantity."
            },
            {
              "process": "The profit-maximizing condition",
              "explanation": "Formally, profit (π) = TR(Q) - TC(Q). To maximize, take derivative with respect to Q and set equal to zero: dπ/dQ = dTR/dQ - dTC/dQ = MR - MC = 0. Therefore, MR = MC. This is the mathematical foundation of the rule. **Advanced note:** The second-order condition requires that MC crosses MR from below, ensuring we've found a maximum, not a minimum."
            },
            {
              "process": "Why MR = MC maximizes, not minimizes",
              "explanation": "At low output, MR typically exceeds MC - each unit adds to profit. As output increases, MC eventually rises. When MC catches up to MR, we've reached the peak. If we go further, MC exceeds MR and profit falls. So MR = MC identifies the summit, not the valley. Graphically, profit is maximized where the slopes of TR and TC are equal."
            }
          ]
        },
        {
          "type": "Marginal Revenue in Different Market Structures",
          "description": "The behavior of marginal revenue differs fundamentally between competitive and non-competitive markets, affecting the profit-maximizing outcome.",
          "examples": [
            {
              "process": "Marginal revenue in perfect competition",
              "explanation": "In perfect competition, firms are price takers. They can sell any quantity at the market price P. Therefore, each additional unit adds exactly P to revenue. MR = P, constant. The MR curve is a horizontal line at the market price. This makes profit maximization simple: produce where P = MC."
            },
            {
              "process": "Marginal revenue with market power",
              "explanation": "When a firm faces downward-sloping demand, it must lower price to sell more. This creates a crucial complication: selling one more unit requires lowering the price on ALL units sold, not just the extra one. So marginal revenue is less than price and falls as output increases. For linear demand P = a - bQ, MR = a - 2bQ - twice as steep."
            },
            {
              "process": "Example of MR with market power",
              "explanation": "Suppose a firm can sell 10 units at \\$100 each (TR = \\$1,000). To sell 11 units, price must fall to \\$99. TR at 11 units = 11 × \\$99 = \\$1,089. The marginal revenue of the 11th unit is only \\$89 (\\$1,089 - \\$1,000), even though the price is \\$99. Why? Because the first 10 units now sell for \\$1 less each, losing \\$10 in revenue, which offsets part of the gain from the 11th unit."
            }
          ]
        },
        {
          "type": "Graphical Interpretation",
          "description": "The profit-maximizing condition has a clear visual representation that helps understand firm behavior.",
          "examples": [
            {
              "process": "The intersection point",
              "explanation": "On a graph with quantity on the horizontal axis and dollars on the vertical, plot the marginal revenue curve and marginal cost curve. Their intersection determines the profit-maximizing quantity Q*. From Q*, go up to the demand curve to find the price P* the firm will charge (for firms with pricing power) or simply note the market price (for competitive firms)."
            },
            {
              "process": "Profit on the graph",
              "explanation": "To see profit, find average total cost at Q*. Draw a rectangle: height is P - ATC (profit per unit), width is Q*. The area of this rectangle is total economic profit. If P > ATC, the rectangle represents positive profit. If P < ATC, it represents loss."
            },
            {
              "process": "Why the graph matters",
              "explanation": "The graph tells the whole story at a glance: optimal quantity where curves cross, price from demand, costs from ATC, and profit as the rectangle. This visual intuition helps managers and economists quickly assess a firm's situation."
            }
          ]
        },
        {
          "type": "Common Mistakes in Profit Maximization",
          "description": "Students and even real businesses sometimes fall for tempting but incorrect rules. Understanding these errors helps avoid them.",
          "examples": [
            {
              "process": "Mistake: Maximize per-unit profit",
              "explanation": "Some think firms should maximize profit per unit (P - ATC). But selling fewer units at a higher markup might yield less total profit than selling more units at a lower markup. Example: Selling 10 units at \\$10 profit each = \\$100 total profit. Selling 20 units at \\$6 profit each = \\$120 total profit. The lower per-unit profit yields higher total profit. Firms maximize total, not per-unit, profit."
            },
            {
              "process": "Mistake: Maximize total revenue",
              "explanation": "Revenue maximization means selling where MR = 0. But this ignores costs. Unless marginal cost is zero, MR = 0 means MC > 0, so the last units cost more to make than they bring in - they're destroying profit. Firms want to maximize profit, not revenue."
            },
            {
              "process": "Mistake: Produce where ATC is minimized",
              "explanation": "Productive efficiency (minimum ATC) is desirable, but it's not the profit-maximizing condition. The optimal quantity depends on revenue as well as costs. A firm might maximize profit at a quantity different from minimum ATC, especially if it has market power."
            },
            {
              "process": "Mistake: Confusing average and marginal",
              "explanation": "Using average cost instead of marginal cost leads to wrong decisions. Example: If ATC is \\$10 but MC of the next unit is only \\$5, and price is \\$8, that unit adds \\$3 to profit even though average cost exceeds price. Decisions should be based on marginal, not average, values."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The MR = MC Rule Is Universal",
          "statement": "Every profit-maximizing firm, regardless of market structure, should produce where marginal revenue equals marginal cost. This condition ensures that no profitable expansion or contraction remains.",
          "application": "Managers can implement this by estimating marginal revenue (easy if competitive, harder if market power) and marginal cost (from production data). They then adjust output until the two are equal. This rule guides production decisions, pricing, and even whether to enter or exit markets.",
          "example": "A furniture manufacturer calculates that producing the 1,000th chair adds \\$200 to revenue (MR) and \\$180 to cost (MC). Profit increases by \\$20 - make it. The 1,100th chair has MR = \\$190, MC = \\$185 - still profitable. The 1,200th has MR = \\$180, MC = \\$180 - exactly equal, optimal. The 1,300th would have MR = \\$170, MC = \\$190 - it would reduce profit, so stop at 1,200."
        },
        {
          "principle": "The Shape of MR Depends on Market Structure",
          "statement": "For perfectly competitive firms, MR is constant and equals price. For firms with market power, MR is less than price and declines as output increases. This difference explains why competitive firms produce more and charge less than monopolies.",
          "application": "When analyzing a firm, first determine its market structure to understand its MR curve. This will tell you whether you can use the simple P = MC rule or need to find the more complex MR curve from demand information.",
          "example": "A wheat farmer (perfect competition) faces MR = \\$5 per bushel regardless of output. They produce where MC = \\$5. A software company (market power) faces demand P = 100 - Q. Their MR = 100 - 2Q. If MC = \\$20, they set 100 - 2Q = 20 → Q = 40, then price from demand P = 100 - 40 = \\$60. Note price > MC, unlike competition."
        },
        {
          "principle": "Profit Maximization Is About Total, Not Per-Unit, Profit",
          "statement": "Firms should maximize total profit (TR - TC), not profit per unit or total revenue. A common fallacy is to think higher per-unit profit is always better, but selling more units at a lower markup can yield higher total profit.",
          "application": "This principle guides pricing strategy. Don't be afraid to accept lower margins if volume increases enough to raise total profit. It also explains why firms sometimes run promotions or discounts - lower per-unit profit but higher volume can increase total profit.",
          "example": "A movie theater sells tickets for \\$12 and sells 200 tickets, profit \\$5 per ticket = \\$1,000 total profit. If they lower price to \\$10, they sell 300 tickets, profit \\$3 per ticket = \\$900 total profit - worse. But if they sell 400 tickets at \\$10, profit \\$3 each = \\$1,200 total profit - better. The decision depends on how much quantity responds to price."
        },
        {
          "principle": "The Shutdown Condition Modifies the Rule in the Short Run",
          "statement": "In the short run, if price falls below average variable cost, the firm should shut down and produce zero, even if MR = MC at some positive output. This is because producing any positive quantity would increase losses beyond fixed costs.",
          "application": "When applying MR = MC, always check whether the resulting output meets the shutdown condition. If P < minimum AVC, the best choice is Q = 0, not the MR = MC quantity. This is why the firm's supply curve is only the MC curve above minimum AVC.",
          "example": "A struggling manufacturer finds that at P = \\$15, MR = MC at Q = 1,000 units. But AVC at that output is \\$16. Even though MR = MC, every unit sold loses \\$1 beyond fixed costs. If they shut down, they only lose fixed costs. So they choose Q = 0, not 1,000. The MR = MC rule only applies when operating is worthwhile."
        }
      ],

      "worked_examples": [
        {
          "title": "Finding Profit-Maximizing Quantity from a Table",
          "problem": "A firm has the following revenue and cost data. Find the profit-maximizing quantity using the MR = MC rule. Quantity: 0, 1, 2, 3, 4, 5, 6. Total Revenue: \\$0, \\$90, \\$160, \\$210, \\$240, \\$250, \\$240. Total Cost: \\$20, \\$50, \\$70, \\$100, \\$140, \\$190, \\$250. Calculate marginal revenue, marginal cost, and profit at each quantity. Identify the profit-maximizing output.",
          "step_by_step": [
            {
              "step": "Calculate Marginal Revenue",
              "explanation": "MR = change in TR ÷ change in Q. Q=0 to 1: (\\$90 - \\$0) ÷ 1 = \\$90. Q=1 to 2: (\\$160 - \\$90) ÷ 1 = \\$70. Q=2 to 3: (\\$210 - \\$160) ÷ 1 = \\$50. Q=3 to 4: (\\$240 - \\$210) ÷ 1 = \\$30. Q=4 to 5: (\\$250 - \\$240) ÷ 1 = \\$10. Q=5 to 6: (\\$240 - \\$250) ÷ 1 = -\\$10."
            },
            {
              "step": "Calculate Marginal Cost",
              "explanation": "MC = change in TC ÷ change in Q. Q=0 to 1: (\\$50 - \\$20) ÷ 1 = \\$30. Q=1 to 2: (\\$70 - \\$50) ÷ 1 = \\$20. Q=2 to 3: (\\$100 - \\$70) ÷ 1 = \\$30. Q=3 to 4: (\\$140 - \\$100) ÷ 1 = \\$40. Q=4 to 5: (\\$190 - \\$140) ÷ 1 = \\$50. Q=5 to 6: (\\$250 - \\$190) ÷ 1 = \\$60."
            },
            {
              "step": "Calculate Profit at each quantity",
              "explanation": "Profit = TR - TC. Q=0: \\$0 - \\$20 = -\\$20. Q=1: \\$90 - \\$50 = \\$40. Q=2: \\$160 - \\$70 = \\$90. Q=3: \\$210 - \\$100 = \\$110. Q=4: \\$240 - \\$140 = \\$100. Q=5: \\$250 - \\$190 = \\$60. Q=6: \\$240 - \\$250 = -\\$10."
            },
            {
              "step": "Apply MR = MC rule",
              "explanation": "Look for where MR ≈ MC. At Q=2 to 3: MR = \\$50, MC = \\$30 (MR > MC, increase output). At Q=3 to 4: MR = \\$30, MC = \\$40 (MR < MC, decrease output). The optimal is between these. At Q=3, profit is \\$110. At Q=4, profit is \\$100. So Q=3 maximizes profit. Checking MR = MC: The marginal unit from 3 to 4 has MR = \\$30 and MC = \\$40, so that unit would reduce profit - confirming Q=3 is optimal."
            },
            {
              "step": "Verify with profit numbers",
              "explanation": "Profit peaks at Q=3 with \\$110. This confirms the MR = MC rule: the optimal quantity is where going to the next unit would reduce profit (MR < MC) and going to the previous unit would have increased profit (MR > MC)."
            }
          ],
          "final_answer": "Profit-maximizing quantity = 3 units. MR: \\$90, \\$70, \\$50, \\$30, \\$10, -\\$10. MC: \\$30, \\$20, \\$30, \\$40, \\$50, \\$60. Profit: -\\$20, \\$40, \\$90, \\$110, \\$100, \\$60, -\\$10. The firm maximizes profit at Q=3 where profit = \\$110.",
          "concept_applied": "The MR = MC rule identifies the profit-maximizing quantity. Comparing MR and MC for each potential unit tells us whether to produce it. The peak profit occurs where MR crosses MC from above."
        },
        {
          "title": "Profit Maximization for a Competitive Firm",
          "problem": "A perfectly competitive firm has marginal cost: MC = 2Q (where Q is in thousands). Fixed costs are \\$1,000. Market price is \\$20. a) Find the profit-maximizing quantity. b) Calculate total revenue, total cost, and profit at that quantity. c) Determine if the firm should operate in the short run. d) What will happen in the long run?",
          "step_by_step": [
            {
              "step": "Apply P = MC rule for competitive firm",
              "explanation": "In perfect competition, MR = P = \\$20. Set P = MC: 20 = 2Q → Q = 10 (thousand units). So profit-maximizing quantity = 10,000 units."
            },
            {
              "step": "Calculate Total Revenue",
              "explanation": "TR = P × Q = \\$20 × 10,000 = \\$200,000."
            },
            {
              "step": "Calculate Total Cost",
              "explanation": "First, find variable cost. MC = 2Q means MC is linear. Total variable cost is the area under MC curve: ∫ 2Q dQ from 0 to 10 = Q² = 10² = 100 (thousand) = \\$100,000. Alternatively, since MC = 2Q, at Q=10, average variable cost = (∫ 2Q dQ)/Q = Q = 10, so AVC = \\$10, so VC = AVC × Q = \\$10 × 10,000 = \\$100,000. TC = FC + VC = \\$1,000 + \\$100,000 = \\$101,000."
            },
            {
              "step": "Calculate Profit",
              "explanation": "Profit = TR - TC = \\$200,000 - \\$101,000 = \\$99,000 economic profit."
            },
            {
              "step": "Short-run operation decision",
              "explanation": "Check P vs AVC: AVC = VC/Q = \\$100,000 ÷ 10,000 = \\$10. P = \\$20 > AVC = \\$10, so definitely operate. Also, profit is positive, so no question."
            },
            {
              "step": "Long-run prediction",
              "explanation": "Positive economic profit (\\$99,000) will attract new firms to enter the industry. As new firms enter, market supply increases, driving down market price. Entry continues until price falls to minimum ATC, where firms earn zero economic profit. In the long run, price will fall below \\$20, and this firm's profit will disappear."
            }
          ],
          "final_answer": "a) Profit-maximizing quantity = 10,000 units. b) TR = \\$200,000, TC = \\$101,000, Profit = \\$99,000. c) Yes, operate because P > AVC and profit positive. d) In long run, positive profit attracts entry, price falls, and profit returns to zero.",
          "concept_applied": "For competitive firms, profit maximization simplifies to P = MC. Positive economic profit attracts entry in long run, driving price down to minimum ATC where zero profit occurs."
        },
        {
          "title": "Profit Maximization for a Firm with Market Power",
          "problem": "A monopoly faces demand: P = 100 - 2Q. Its marginal cost is constant at \\$20 per unit. Fixed costs are \\$200. a) Find the profit-maximizing quantity and price. b) Calculate total revenue, total cost, and profit. c) Calculate the markup over marginal cost. d) Compare to the competitive outcome (P = MC).",
          "step_by_step": [
            {
              "step": "Derive the Marginal Revenue curve",
              "explanation": "For linear demand P = a - bQ, MR = a - 2bQ. Here, P = 100 - 2Q, so a=100, b=2. Therefore, MR = 100 - 4Q. (Note: MR has same intercept, twice the slope.)"
            },
            {
              "step": "Set MR = MC to find optimal Q",
              "explanation": "MR = 100 - 4Q, MC = 20. Set equal: 100 - 4Q = 20 → 4Q = 80 → Q = 20 units."
            },
            {
              "step": "Find price from demand curve",
              "explanation": "P = 100 - 2(20) = 100 - 40 = \\$60."
            },
            {
              "step": "Calculate Total Revenue",
              "explanation": "TR = P × Q = \\$60 × 20 = \\$1,200."
            },
            {
              "step": "Calculate Total Cost",
              "explanation": "TC = FC + VC = \\$200 + (MC × Q) = \\$200 + (\\$20 × 20) = \\$200 + \\$400 = \\$600."
            },
            {
              "step": "Calculate Profit",
              "explanation": "Profit = TR - TC = \\$1,200 - \\$600 = \\$600 economic profit."
            },
            {
              "step": "Calculate markup over MC",
              "explanation": "Markup = P - MC = \\$60 - \\$20 = \\$40. As a percentage of MC: (\\$40 ÷ \\$20) × 100% = 200% markup."
            },
            {
              "step": "Compare to competitive outcome",
              "explanation": "If competitive (P = MC), then 100 - 2Q = 20 → 2Q = 80 → Q = 40, P = \\$20. Competitive quantity is double (40 vs 20), price is one-third (\\$20 vs \\$60). Competitive profit: TR = \\$800, TC = \\$200 + \\$800 = \\$1,000, profit = -\\$200 (loss). The monopoly restricts output, raises price, and earns profit, while competition would force the firm out of business (since P = MC = \\$20 < ATC = \\$25 at Q=40). This suggests this might be a natural monopoly."
            }
          ],
          "final_answer": "a) Q* = 20 units, P* = \\$60. b) TR = \\$1,200, TC = \\$600, Profit = \\$600. c) Markup = \\$40 (200% over MC). d) Competitive outcome would be Q=40, P=\\$20, but the firm would lose money (\\$200 loss). The monopoly restricts output by half and charges triple the competitive price to earn profit.",
          "concept_applied": "Firms with market power maximize profit where MR = MC, producing less and charging more than competitive firms. The markup over MC reflects the degree of market power."
        }
      ],

      "image": {
        "src": "images/unit6/profit_maximization_graph.png",
        "alt": "Graph showing MC and MR curves intersecting, with demand curve and ATC curve, profit area shaded",
        "caption": "Profit maximization occurs where MR = MC. The profit rectangle shows total economic profit: (P - ATC) × Q*"
      }
    }
  ],

  "key_terms": [
    "Profit maximization",
    "Marginal revenue (MR)",
    "Marginal cost (MC)",
    "MR = MC rule",
    "Marginal analysis",
    "Total revenue",
    "Total cost",
    "Economic profit",
    "Markup",
    "Price taker",
    "Price maker",
    "Market power",
    "Shutdown condition",
    "Derivation of MR",
    "Linear demand",
    "Profit rectangle"
  ],

  "summary": "Profit maximization is the fundamental goal of firms, achieved by producing where marginal revenue equals marginal cost (MR = MC). This universal rule applies to all market structures, though the behavior of marginal revenue differs: perfectly competitive firms have MR constant and equal to price, while firms with market power have MR declining with output and less than price. The logic of marginal analysis explains why: if MR > MC, producing one more unit adds to profit, so expand; if MR < MC, that unit would reduce profit, so contract. Only at MR = MC can profit not be increased by changing output. Graphically, the intersection of MR and MC determines optimal quantity Q*, and price comes from the demand curve (for price makers) or is given by the market (for price takers). Profit can be visualized as a rectangle with height (P - ATC) and width Q*. Common mistakes include trying to maximize per-unit profit (which can lead to lower total profit) or maximizing revenue (which ignores costs). In the short run, the MR = MC rule applies only if price exceeds average variable cost; otherwise, the firm should shut down and produce zero. Understanding profit maximization explains firm behavior across all market structures: why competitive firms produce where P = MC, why monopolies restrict output and charge higher prices, and how firms respond to changes in costs or demand. This framework is essential for analyzing real-world business decisions and market outcomes."
}
