{
  "title": "6.4 Short Run Profit and Loss",
  "expanded_description": "Analyzing how firms respond to temporary market conditions in the short run, making production decisions that maximize profits or minimize losses when fixed costs cannot be avoided and some inputs cannot be adjusted.",
  "core_concept": {
    "principle": "In the short run, firms continue operating if price exceeds average variable cost (P > AVC), even when experiencing losses, because fixed costs must be paid regardless of production. The shutdown point occurs where P = minimum AVC, while the break-even point occurs where P = minimum ATC.",
    "explanation": "Short-run decisions differ fundamentally from long-run decisions due to the presence of fixed costs that cannot be avoided. Firms analyze whether revenue covers variable costs when deciding to operate temporarily at a loss, recognizing that shutting down would mean losing all fixed costs while continuing operations might recover some fixed costs if price exceeds AVC.",
    "image": {
      "url": "/images/economics/short-run-decision-framework.svg",
      "alt": "Short Run Decision Framework",
      "caption": "Operating, shutdown, and break-even points in short-run analysis"
    }
  },
  "sections": [
    {
      "section_title": "Short Run Cost Structures and Decision Rules",
      "introduction": "Understanding short-run firm behavior requires analyzing the different cost categories and how they influence production decisions when some inputs are fixed.",
      "key_concept": {
        "definition": "Short-run costs are divided into fixed costs (unavoidable regardless of output) and variable costs (change with output level). The key decision rules are: operate if P > AVC (cover variable costs), shutdown if P < AVC, and break even where P = ATC.",
        "context": "These cost distinctions explain why firms may rationally choose to operate at a loss temporarily - to minimize losses when fixed costs cannot be recovered but variable costs can be covered by revenue.",
        "image": {
          "url": "/images/economics/short-run-cost-structure.svg",
          "alt": "Short Run Cost Structure",
          "caption": "Fixed, variable, and total costs in short-run production"
        }
      },
      "classifications": [
        {
          "type": "Cost Categories in Short Run",
          "value": "Classification of costs by variability with output",
          "characteristics": ["Fixed Costs (FC)", "Variable Costs (VC)", "Sunk Costs", "Avoidable vs Unavoidable Costs"],
          "behavior": "Fixed costs remain constant regardless of output in the short run, while variable costs change with production levels. Sunk costs are past expenditures that cannot be recovered and should not affect current decisions.",
          "examples": [
            {
              "process": "Fixed Cost Commitment",
              "explanation": "Once a firm commits to fixed inputs like factory leases or equipment purchases, these costs must be paid whether the firm produces zero output or maximum capacity output.",
              "image": {
                "url": "/images/economics/fixed-cost-commitment.svg",
                "alt": "Fixed Cost Commitment",
                "caption": "How fixed costs create the continue-operating incentive"
              }
            },
            {
              "process": "Variable Cost Behavior",
              "explanation": "Variable costs like raw materials, hourly labor, and utilities increase with production, initially at a decreasing rate then at an increasing rate due to diminishing returns.",
              "image": {
                "url": "/images/economics/variable-cost-behavior.svg",
                "alt": "Variable Cost Behavior",
                "caption": "How variable costs change with output levels"
              }
            }
          ]
        },
        {
          "type": "Short Run Decision Rules",
          "value": "Operating criteria under different price scenarios",
          "characteristics": ["Shutdown Rule (P < AVC)", "Operating Rule (P > AVC)", "Break-even Rule (P = ATC)", "Profit Maximization (MR = MC)"],
          "behavior": "Firms follow a hierarchical decision process: first determine whether to operate at all (P vs AVC), then determine optimal output level (MR = MC), with profit/loss determined by the relationship between P and ATC.",
          "examples": [
            {
              "process": "Shutdown Point Analysis",
              "explanation": "When price falls below minimum average variable cost, the firm cannot cover its ongoing operating costs and should shut down temporarily to minimize losses.",
              "image": {
                "url": "/images/economics/shutdown-point-analysis.svg",
                "alt": "Shutdown Point Analysis",
                "caption": "Price threshold below which temporary shutdown is optimal"
              }
            },
            {
              "process": "Loss Minimization Logic",
              "explanation": "When AVC < P < ATC, the firm loses money overall but loses less by operating than by shutting down, because revenue covers all variable costs and contributes something toward fixed costs.",
              "image": {
                "url": "/images/economics/loss-minimization-logic.svg",
                "alt": "Loss Minimization Logic",
                "caption": "Why operating at a loss can be rational in short run"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Short Run Operating Decision Under Losses",
          "problem": "A firm has cost function TC = 100 + 20Q + 2Q². The market price is P = 40. Should the firm operate in the short run? If so, what output should it produce and what will be its profit or loss?",
          "step_by_step": [
            {
              "step": "Identify Cost Components",
              "explanation": "Separate fixed and variable costs",
              "calculation": "TC = 100 + 20Q + 2Q²\nFC = 100 (constant term)\nVC = 20Q + 2Q²"
            },
            {
              "step": "Calculate Average Variable Cost",
              "explanation": "Find AVC function and minimum point",
              "calculation": "AVC = VC/Q = 20 + 2Q\nMinimum AVC occurs at lowest possible Q\nAt Q=0, AVC=20 (technically undefined, but limit approaches 20)\nMinimum AVC = 20"
            },
            {
              "step": "Apply Shutdown Rule",
              "explanation": "Compare price to minimum AVC",
              "calculation": "P = 40, Minimum AVC = 20\nSince P > Minimum AVC (40 > 20), firm should operate"
            },
            {
              "step": "Find Profit-Maximizing Output",
              "explanation": "Apply MR = MC rule",
              "calculation": "In perfect competition, MR = P = 40\nMC = dTC/dQ = 20 + 4Q\nSet MR = MC: 40 = 20 + 4Q\n20 = 4Q → Q = 5"
            },
            {
              "step": "Calculate Profit or Loss",
              "explanation": "Compute total revenue and total cost",
              "calculation": "TR = P × Q = 40 × 5 = 200\nTC = 100 + 20(5) + 2(5)² = 100 + 100 + 50 = 250\nProfit = TR - TC = 200 - 250 = -50 (Loss of 50)"
            },
            {
              "step": "Verify Loss Minimization",
              "explanation": "Compare operating loss to shutdown loss",
              "calculation": "If shutdown: Q=0, TR=0, TC=FC=100, Loss=100\nBy operating: Loss=50\nOperating reduces loss from 100 to 50"
            },
            {
              "step": "Calculate Contribution to Fixed Costs",
              "explanation": "Determine how much revenue covers fixed costs",
              "calculation": "Variable Cost at Q=5: VC=20(5)+2(25)=100+50=150\nTR - VC = 200 - 150 = 50 contribution to fixed costs\nFixed Costs = 100, so 50 of FC is covered"
            }
          ],
          "final_answer": "The firm should operate producing Q=5 units. Despite the $50 loss, operating is optimal because shutting down would result in a $100 loss (all fixed costs). By operating, the firm generates $200 revenue that covers all $150 variable costs and contributes $50 toward the $100 fixed costs, reducing the overall loss from $100 to $50.",
          "concept_applied": "Short-run decision making where firms operate at a loss when price exceeds average variable cost, minimizing losses by covering variable costs and contributing something toward fixed costs that would be lost entirely if the firm shut down.",
          "image": {
            "url": "/images/economics/short-run-operating-decision.svg",
            "alt": "Short Run Operating Decision",
            "caption": "Optimal production decision when facing economic losses"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Sunk Cost Fallacy Avoidance Principle",
          "statement": "Rational decision-making requires ignoring sunk costs - past expenditures that cannot be recovered - when making current production decisions. Only avoidable costs (variable costs and any avoidable fixed costs) should influence short-run operating decisions. Continuing operations because 'we've already invested so much' represents faulty economic reasoning when variable costs cannot be covered.",
          "application": "This principle explains why firms should shut down temporarily when price falls below AVC, even if they have substantial fixed investments, and why historical investment decisions shouldn't dictate current operating decisions.",
          "example": "A restaurant with high rent (fixed cost) should stay open for lunch even with few customers if revenue covers food and staff costs (variable costs), but should close if lunch revenue doesn't even cover these ongoing operating costs.",
          "analogy": "Like refusing to throw away spoiled groceries because you paid for them - the money is already spent (sunk cost), and consuming bad food creates additional harm rather than recovering the loss.",
          "image": {
            "url": "/images/economics/sunk-cost-fallacy.svg",
            "alt": "Sunk Cost Fallacy Avoidance",
            "caption": "Why historical costs shouldn't influence current decisions"
          }
        }
      ]
    },
    {
      "section_title": "Temporary Market Conditions and Firm Response",
      "introduction": "Firms face various temporary market disruptions - demand shocks, supply shocks, seasonal fluctuations - that require short-run adjustments while waiting for long-run equilibrium restoration.",
      "key_concept": {
        "definition": "Temporary market conditions include seasonal demand variations, temporary supply disruptions, short-term price spikes or collapses, and unexpected demand shocks. Firms respond by adjusting variable inputs and output levels while maintaining fixed capacity, accepting temporary profits or losses.",
        "context": "These short-run fluctuations test firm resilience and create the profit/loss signals that eventually drive long-run market adjustments through entry, exit, and capacity changes.",
        "image": {
          "url": "/images/economics/temporary-market-conditions.svg",
          "alt": "Temporary Market Conditions",
          "caption": "How firms respond to short-run market disruptions"
        }
      },
      "classifications": [
        {
          "type": "Demand-Side Shocks",
          "value": "Temporary changes in market demand conditions",
          "characteristics": ["Seasonal fluctuations", "Temporary fads", "Economic cycles", "Unexpected events"],
          "behavior": "Firms respond to demand changes by adjusting output along their MC curves in the short run, experiencing windfall profits during high-demand periods and losses during low-demand periods.",
          "examples": [
            {
              "process": "Seasonal Business Adaptation",
              "explanation": "Businesses with seasonal demand patterns (resorts, agriculture, retail) maintain capacity year-round but adjust variable inputs seasonally, accepting off-season losses as part of their business model.",
              "image": {
                "url": "/images/economics/seasonal-adaptation.svg",
                "alt": "Seasonal Business Adaptation",
                "caption": "How seasonal firms manage fluctuating demand"
              }
            },
            {
              "process": "Unexpected Demand Spikes",
              "explanation": "When unexpected events create temporary demand surges (weather emergencies, sudden trends), firms increase output until MC rises to meet the higher price, earning temporary economic profits.",
              "image": {
                "url": "/images/economics/demand-spikes.svg",
                "alt": "Unexpected Demand Spikes",
                "caption": "Firm response to temporary demand increases"
              }
            }
          ]
        },
        {
          "type": "Supply-Side Shocks",
          "value": "Temporary changes in production costs or capacity",
          "characteristics": ["Input price spikes", "Technology disruptions", "Natural disasters", "Regulatory changes"],
          "behavior": "Supply shocks shift firms' cost curves, changing optimal output levels and creating temporary profits or losses until input markets or technology adapts.",
          "examples": [
            {
              "process": "Input Cost Increases",
              "explanation": "When key input prices rise temporarily, firms reduce output along their new higher MC curve, potentially operating at a loss if they can cover variable costs, waiting for input prices to normalize.",
              "image": {
                "url": "/images/economics/input-cost-shocks.svg",
                "alt": "Input Cost Increases",
                "caption": "Adjusting to temporary cost increases"
              }
            },
            {
              "process": "Capacity Constraints",
              "explanation": "When temporary capacity limitations occur (equipment failure, supply chain disruptions), firms produce at maximum possible output, potentially earning high profits if demand remains strong.",
              "image": {
                "url": "/images/economics/capacity-constraints.svg",
                "alt": "Capacity Constraints",
                "caption": "Operating under temporary production limitations"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Seasonal Business Profit Fluctuations",
          "problem": "A beach resort has annual fixed costs of $500,000 and faces two seasons: High season (120 days) with demand P = 300 - Q/100, and Low season (245 days) with demand P = 150 - Q/200. Variable costs are VC = 50Q + 0.5Q². Analyze optimal operation in each season and annual profitability.",
          "step_by_step": [
            {
              "step": "High Season Analysis",
              "explanation": "Find profit-maximizing output during high season",
              "calculation": "High season: P = 300 - Q/100\nTR = 300Q - Q²/100\nMR = 300 - Q/50\nMC = dVC/dQ = 50 + Q\nSet MR = MC: 300 - Q/50 = 50 + Q\n250 = Q + Q/50 = 51Q/50\nQ = 250 × 50/51 = 245.1\nP = 300 - 245.1/100 = 297.55\nTR = 297.55 × 245.1 = 72,929\nVC = 50(245.1) + 0.5(245.1)² = 12,255 + 30,038 = 42,293\nContribution = TR - VC = 72,929 - 42,293 = 30,636"
            },
            {
              "step": "Low Season Analysis",
              "explanation": "Find optimal operation during low season",
              "calculation": "Low season: P = 150 - Q/200\nTR = 150Q - Q²/200\nMR = 150 - Q/100\nMC = 50 + Q\nSet MR = MC: 150 - Q/100 = 50 + Q\n100 = Q + Q/100 = 101Q/100\nQ = 100 × 100/101 = 99.0\nP = 150 - 99/200 = 149.51\nTR = 149.51 × 99 = 14,801\nVC = 50(99) + 0.5(99)² = 4,950 + 4,901 = 9,851\nContribution = TR - VC = 14,801 - 9,851 = 4,950"
            },
            {
              "step": "Calculate Minimum AVC",
              "explanation": "Verify firm should operate in both seasons",
              "calculation": "AVC = VC/Q = 50 + 0.5Q\nMinimum AVC = 50 (at Q=0)\nHigh season P=297.55 > 50 ✓\nLow season P=149.51 > 50 ✓\nOperate in both seasons"
            },
            {
              "step": "Annual Profit Calculation",
              "explanation": "Compute yearly profitability",
              "calculation": "High season days: 120\nLow season days: 245\nAnnual contribution = (30,636 × 120/365) + (4,950 × 245/365)\n= (30,636 × 0.329) + (4,950 × 0.671)\n= 10,069 + 3,321 = 13,390 per day\nAnnual contribution = 13,390 × 365 = 4,887,350\nAnnual FC = 500,000\nAnnual profit = 4,887,350 - 500,000 = 4,387,350"
            },
            {
              "step": "Interpret Seasonal Strategy",
              "explanation": "Analyze the business model implications",
              "calculation": "High season: High volume, high prices, large contribution\nLow season: Lower volume, lower prices, smaller contribution\nFixed costs covered by combined seasonal operations\nBusiness remains viable despite low-season minimal operation"
            }
          ],
          "final_answer": "High season: Produce 245 units at $297.55, generating $30,636 daily contribution. Low season: Produce 99 units at $149.51, generating $4,950 daily contribution. Annually: Total contribution $4,887,350, minus $500,000 fixed costs = $4,387,350 profit. The resort operates in both seasons since P > AVC in both cases, using high-season profits to cover fixed costs and generate overall annual profitability despite low-season minimal operation.",
          "concept_applied": "Seasonal businesses optimize output separately for each demand period, operating whenever price exceeds AVC, and relying on high-demand periods to cover fixed costs and generate annual profits despite operating at minimal levels during low-demand seasons.",
          "image": {
            "url": "/images/economics/seasonal-profit-fluctuations.svg",
            "alt": "Seasonal Profit Fluctuations",
            "caption": "How seasonal businesses manage different demand conditions"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Temporary Equilibrium Principle",
          "statement": "Markets can exist in temporary short-run equilibrium where firms earn economic profits or losses, with these profit signals eventually driving long-run adjustments through entry, exit, and capacity changes. Short-run analysis examines firm behavior during these transitional periods before the market reaches long-run equilibrium with normal profits.",
          "application": "This principle explains why markets can sustain temporary imbalances and why firms make different decisions in short-run versus long-run time horizons, particularly regarding fixed cost recovery and capacity utilization.",
          "example": "During an unexpected demand surge for face masks, existing manufacturers earn windfall profits temporarily, which eventually attracts new entrants and capacity expansion that drives prices back to normal levels in the long run.",
          "analogy": "Like water finding multiple temporary levels during a storm before eventually settling to equilibrium - short-run market conditions create temporary profit/loss situations that eventually self-correct through market adjustments.",
          "image": {
            "url": "/images/economics/temporary-equilibrium-principle.svg",
            "alt": "Temporary Equilibrium Principle",
            "caption": "Short-run profits/losses as signals for long-run adjustment"
          }
        }
      ]
    },
    {
      "section_title": "Industry Response to Temporary Conditions",
      "introduction": "While individual firms respond to short-run conditions by adjusting output, entire industries respond through price changes, inventory adjustments, and capacity utilization variations that eventually trigger long-run structural changes.",
      "key_concept": {
        "definition": "Industry-level short-run adjustments occur through changes in capacity utilization rates, inventory levels, and market prices, creating the profit/loss signals that eventually drive long-run changes in industry capacity, technology, and firm composition.",
        "context": "Understanding how industries absorb short-run shocks helps explain business cycle patterns, seasonal industry dynamics, and the transition mechanisms between short-run disequilibrium and long-run equilibrium.",
        "image": {
          "url": "/images/economics/industry-short-run-response.svg",
          "alt": "Industry Response to Temporary Conditions",
          "caption": "How industries adjust to temporary market disruptions"
        }
      },
      "classifications": [
        {
          "type": "Price and Output Adjustments",
          "value": "Market-level responses to temporary conditions",
          "characteristics": ["Price flexibility", "Output quantity changes", "Capacity utilization", "Inventory fluctuations"],
          "behavior": "Industries respond to temporary demand or supply changes primarily through price and output adjustments in the short run, with capacity fixed but utilization rates variable.",
          "examples": [
            {
              "process": "Agricultural Market Cycles",
              "explanation": "Agricultural markets experience seasonal price and output patterns, with prices lowest during harvest periods and highest during off-seasons, creating predictable profit cycles that farmers anticipate in their planning.",
              "image": {
                "url": "/images/economics/agricultural-cycles.svg",
                "alt": "Agricultural Market Cycles",
                "caption": "Seasonal price and output patterns in agriculture"
              }
            },
            {
              "process": "Manufacturing Capacity Utilization",
              "explanation": "Manufacturing industries adjust to demand fluctuations by varying capacity utilization rates, operating extra shifts during high demand and reducing hours during low demand while maintaining fixed plant capacity.",
              "image": {
                "url": "/images/economics/capacity-utilization.svg",
                "alt": "Manufacturing Capacity Utilization",
                "caption": "How manufacturers adjust to demand changes with fixed capacity"
              }
            }
          ]
        },
        {
          "type": "Transition to Long-Run Equilibrium",
          "value": "How temporary conditions trigger structural changes",
          "characteristics": ["Entry and exit signals", "Investment responses", "Technological adoption", "Market structure evolution"],
          "behavior": "Sustained short-run profits or losses eventually trigger long-run adjustments: profits attract new entrants and capacity expansion, while losses cause exit and capacity reduction.",
          "examples": [
            {
              "process": "Entry Response to Sustained Profits",
              "explanation": "When temporary high prices and profits persist, new firms enter the industry, increasing market supply and eventually driving prices down to the break-even level.",
              "image": {
                "url": "/images/economics/entry-response.svg",
                "alt": "Entry Response to Sustained Profits",
                "caption": "How profits attract new competitors over time"
              }
            },
            {
              "process": "Exit Process from Sustained Losses",
              "explanation": "When losses continue, marginal firms exit the industry, reducing market supply and allowing prices to rise until remaining firms can cover their costs.",
              "image": {
                "url": "/images/economics/exit-process.svg",
                "alt": "Exit Process from Sustained Losses",
                "caption": "How losses drive market consolidation"
              }
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Industry Adjustment to Demand Shock",
          "problem": "A competitive industry has 100 identical firms, each with TC = 100 + Q². Market demand is P = 60 - 0.01Q. A temporary demand shock increases demand to P = 80 - 0.01Q. Analyze short-run and long-run industry adjustment.",
          "step_by_step": [
            {
              "step": "Initial Equilibrium",
              "explanation": "Find pre-shock market equilibrium",
              "calculation": "Firm MC = 2Q, so supply: Q = MC/2 = P/2\nIndustry supply: Q_s = 100 × (P/2) = 50P\nSet supply = original demand: 50P = 6000 - 100P (from P=60-0.01Q)\n150P = 6000 → P = 40\nQ = 50×40 = 2000\nEach firm: Q = 20, Profit = (40×20) - (100+400) = 800-500=300"
            },
            {
              "step": "Short-Run Response to Demand Shock",
              "explanation": "Immediate impact with fixed number of firms",
              "calculation": "New demand: P = 80 - 0.01Q\nSet supply = new demand: 50P = 8000 - 100P\n150P = 8000 → P = 53.33\nQ = 50×53.33 = 2666.67\nEach firm: Q = 26.67, Profit = (53.33×26.67) - (100+711.1) = 1422-811=611"
            },
            {
              "step": "Long-Run Equilibrium Conditions",
              "explanation": "Determine where zero economic profit occurs",
              "calculation": "Long-run: P = min ATC\nATC = 100/Q + Q\nMin ATC where dATC/dQ = -100/Q² + 1 = 0\nQ² = 100 → Q = 10\nMin ATC = 100/10 + 10 = 20\nLong-run P = 20"
            },
            {
              "step": "Long-Run Market Quantity",
              "explanation": "Find market output at long-run price",
              "calculation": "At P=20, market demand Q = 8000 - 100×20 = 6000\n(from P=80-0.01Q → Q=8000-100P)"
            },
            {
              "step": "Long-Run Number of Firms",
              "explanation": "Calculate equilibrium firm count",
              "calculation": "Each firm produces Q=10 at P=20\nNumber of firms = 6000/10 = 600 firms"
            },
            {
              "step": "Adjustment Process Summary",
              "explanation": "Describe the transition dynamics",
              "calculation": "Short-run: 100 firms earn $611 profit each\nLong-run: 600 firms earn zero profit\nEntry of 500 new firms\nPrice falls from $53.33 to $20\nOutput increases from 2667 to 6000"
            }
          ],
          "final_answer": "Short-run response: Price increases to $53.33, output increases to 2,667 units, each firm earns $611 profit. Long-run adjustment: Profits attract entry of 500 new firms (total 600 firms), price falls to $20 (minimum ATC), output expands to 6,000 units, economic profit returns to zero. The temporary demand shock creates short-run profits that signal the need for industry expansion, eventually returning the market to long-run equilibrium through the entry process.",
          "concept_applied": "Industry adjustment from short-run disequilibrium to long-run equilibrium, demonstrating how temporary profits trigger entry that expands industry capacity and drives prices back to break-even levels, with the speed of adjustment depending on entry barriers and capacity construction time.",
          "image": {
            "url": "/images/economics/industry-adjustment-process.svg",
            "alt": "Industry Adjustment Process",
            "caption": "Transition from short-run to long-run equilibrium after demand shock"
          }
        }
      ],
      "principles": [
        {
          "principle": "The Market Signal Principle",
          "statement": "Short-run profits and losses serve as crucial market signals that guide resource allocation in the long run. Profits indicate that consumer valuation exceeds production costs and signal the need for industry expansion, while losses indicate the opposite and signal the need for contraction. These temporary profit/loss conditions create the information and incentives that drive the market toward long-run equilibrium.",
          "application": "This principle explains the self-correcting nature of competitive markets and why government interventions that suppress price signals (like price controls during shortages) can prevent efficient long-run adjustments.",
          "example": "High gasoline prices during supply disruptions signal the need for conservation and attract investment in alternative energy and expanded refining capacity, eventually bringing prices back down through increased supply and reduced demand.",
          "analogy": "Like pain signaling injury - short-run market 'pain' (losses) or 'pleasure' (profits) provides the feedback that guides the 'body' (market) toward health (equilibrium), with suppression of these signals preventing necessary adjustments.",
          "image": {
            "url": "/images/economics/market-signal-principle.svg",
            "alt": "Market Signal Principle",
            "caption": "How profits and losses guide long-run resource allocation"
          }
        }
      ]
    }
  ],
  "key_terms": [
    "Short Run",
    "Fixed Costs",
    "Variable Costs",
    "Average Variable Cost (AVC)",
    "Average Total Cost (ATC)",
    "Shutdown Point",
    "Break-even Point",
    "Operating Decision",
    "Loss Minimization",
    "Sunk Costs",
    "Temporary Equilibrium",
    "Capacity Utilization",
    "Seasonal Demand",
    "Market Signals",
    "Economic Profit",
    "Economic Loss",
    "Contribution Margin",
    "Short-run Supply",
    "Market Adjustment",
    "Entry and Exit"
  ],
  "summary": "In the short run, firms face fixed costs that cannot be avoided, leading to different decision rules than in the long run. The key shutdown rule is P > AVC - firms continue operating if price covers variable costs, even when experiencing overall losses, because this minimizes losses by contributing something toward fixed costs. Temporary market conditions like seasonal demand, supply shocks, and unexpected events create short-run profits or losses that serve as signals for long-run market adjustments. Industries respond to these conditions through price changes, output adjustments, and capacity utilization variations, with sustained profits attracting new entrants and losses causing exits. This dynamic process ensures that markets eventually return to long-run equilibrium, demonstrating how short-run disequilibrium provides the mechanism for efficient long-run resource allocation in market economies."
}
