{
  "expanded_description": "In the short run, firms are stuck with some fixed costs - they've signed leases, bought equipment, and made commitments they can't immediately undo. This creates a fascinating range of possible outcomes. Depending on market conditions, a firm might earn substantial profits, break even, suffer losses but keep operating, or shut down entirely. Understanding these short-run possibilities is crucial because they determine which firms survive, which industries attract new entrants, and how markets adjust toward long-run equilibrium. This section explores the four short-run scenarios every firm faces and the critical role of average variable cost in shutdown decisions.",
  
  "core_concept": {
    "principle": "In the short run, firms can earn economic profits, break even, incur losses but continue operating, or shut down temporarily. The decision to operate or shut down depends on whether price covers average variable cost, while the presence of profit or loss depends on whether price covers average total cost.",
    "explanation": "Think of a ski resort in summer. The lifts still need maintenance, insurance must be paid, and managers draw salaries - these fixed costs continue regardless. But the resort might operate summer activities (mountain biking, hiking) if the revenue covers the variable costs of running those activities (staff, electricity, marketing). Even if summer revenue doesn't cover all fixed costs, it might contribute something toward them - better than nothing. This is the logic of short-run decisions: fixed costs are sunk in the short run, so firms focus on covering variable costs and contributing to fixed costs. Depending on price relative to average variable cost and average total cost, firms find themselves in one of four distinct situations.",
    "image": {
      "src": "images/unit6/short_run_profit_loss.png",
      "alt": "Graph showing four scenarios: profit where P > ATC, break-even where P = ATC, loss where AVC < P < ATC, and shutdown where P < AVC",
      "caption": "In the short run, firms can experience profit, loss with operation, or shutdown depending on price relative to costs"
    }
  },

  "sections": [
    {
      "section_title": "6.4 Short Run Profit and Loss",
      "introduction": "Imagine two food trucks parked side by side. Both have fixed costs - truck payments, insurance, licenses - that they must pay whether they open for business or not. One truck faces a busy lunch crowd and earns healthy profits. The other faces a quiet street and loses money on every meal it sells. Should the losing truck open at all? The answer might surprise you: sometimes yes, sometimes no, depending on whether the revenue covers the cost of the food and the cook's wages. This is the reality of short-run decisions, where fixed costs are already committed and firms must decide whether operating makes sense given current prices. In this section, we'll explore the four possible short-run outcomes and the critical thresholds that separate them.",
      
      "key_concept": {
        "definition": "Short-run profit and loss refer to the economic outcomes firms experience when at least one input is fixed. In this period, firms can earn positive economic profit ($P > ATC$), break even ($P = ATC$), operate at a loss but continue producing ($AVC < P < ATC$), or shut down temporarily ($P < AVC$). The firm's supply curve is the portion of its marginal cost curve above minimum average variable cost.",
        "context": "The short run is defined by the presence of fixed costs that cannot be adjusted. This means firms may operate at a loss if they can cover variable costs and contribute something toward fixed costs. The decision rule is: operate if price is greater than or equal to average variable cost ($P \\ge AVC$); shut down if $P < AVC$. This logic explains why we sometimes see businesses operating during slow periods - they're covering their variable costs and hoping conditions improve, or they're minimizing losses while waiting for fixed costs to become avoidable in the long run."
      },

      "categories": [
        {
          "type": "The Four Short-Run Scenarios",
          "description": "Depending on where market price falls relative to a firm's cost curves, four distinct outcomes are possible.",
          "examples": [
            {
              "process": "Scenario 1: Economic Profit ($P > ATC$)",
              "explanation": "When market price exceeds average total cost at the profit-maximizing quantity, the firm earns positive economic profit. This is the best-case scenario. The firm is covering all costs, including opportunity costs, and has extra left over. Graphically, at $Q^*$ where $P = MC$, we have $P > ATC$, creating a profit rectangle of height $(P - ATC)$ times width $Q^*$."
            },
            {
              "process": "Scenario 2: Break-Even ($P = ATC$)",
              "explanation": "When price exactly equals average total cost at the profit-maximizing quantity, the firm earns zero economic profit. This is called the break-even point or normal profit. The firm covers all costs including opportunity costs but earns no extra. This is a sustainable long-run position. Graphically, the price line touches the minimum point of the ATC curve where $MC = ATC$."
            },
            {
              "process": "Scenario 3: Operating at a Loss ($AVC < P < ATC$)",
              "explanation": "When price is below average total cost but above average variable cost, the firm operates at a loss but continues producing. Why? Because revenue covers all variable costs and contributes something toward fixed costs. Shutting down would mean losing the entire fixed cost. By operating, the firm loses less than its fixed costs. This is a rational short-run response to bad times."
            },
            {
              "process": "Scenario 4: Shutdown ($P < AVC$)",
              "explanation": "When price falls below average variable cost, the firm cannot even cover its variable costs. Every unit produced adds to losses beyond fixed costs. In this case, the firm minimizes losses by shutting down temporarily, producing zero, and only losing fixed costs. The firm will resume production only if price rises above minimum $AVC$."
            }
          ]
        },
        {
          "type": "The Shutdown Point",
          "description": "The shutdown point is a critical threshold where the firm is indifferent between operating and shutting down.",
          "examples": [
            {
              "process": "Definition of shutdown point",
              "explanation": "The shutdown point occurs where price equals minimum average variable cost ($P = \\min AVC$). At this point, the firm's loss is exactly the same whether it operates or shuts down: loss equals fixed costs in both cases. For any price above this point, operating reduces losses (or increases profits). For any price below, shutting down minimizes losses."
            },
            {
              "process": "Location on the graph",
              "explanation": "On a graph with $MC$, $ATC$, and $AVC$, the shutdown point is where the $MC$ curve crosses the $AVC$ curve at its minimum point. This intersection determines the lowest price at which the firm will produce in the short run."
            },
            {
              "process": "Why the shutdown point matters",
              "explanation": "The shutdown point determines the firm's short-run supply curve. For all prices above minimum $AVC$, the firm supplies along its $MC$ curve. For prices below minimum $AVC$, the firm supplies zero. This is why the supply curve is only the portion of $MC$ above $AVC$."
            }
          ]
        },
        {
          "type": "The Firm's Short-Run Supply Curve",
          "description": "The relationship between price and quantity supplied by an individual firm in the short run is derived from its cost structure.",
          "examples": [
            {
              "process": "Deriving the supply curve",
              "explanation": "For any price $P$, the profit-maximizing firm produces where $P = MC$ (since $MR = P$ in perfect competition), provided $P \\ge AVC$. So as price varies, we can read quantity supplied from the $MC$ curve. This means the firm's supply curve is its $MC$ curve, but only for prices above minimum $AVC$."
            },
            {
              "process": "Why the supply curve slopes upward",
              "explanation": "Because marginal cost typically rises with output (due to diminishing returns), the $MC$ curve slopes upward. Therefore, as price increases, firms are willing to supply more quantity. This explains the fundamental law of supply: higher prices lead to greater quantity supplied."
            },
            {
              "process": "Market supply in the short run",
              "explanation": "The short-run market supply curve is the horizontal sum of all individual firms' supply curves (their $MC$ curves above shutdown). At each price, we add up the quantities all firms are willing to supply. This market supply curve, together with market demand, determines the short-run equilibrium price."
            }
          ]
        },
        {
          "type": "Calculating Profit and Loss",
          "description": "Once the profit-maximizing quantity is found, we can calculate the dollar amount of profit or loss.",
          "examples": [
            {
              "process": "Profit formula",
              "explanation": "Economic profit $\\pi = TR - TC = (P \\times Q) - TC$. Alternatively, $\\pi = (P - ATC) \\times Q$, which shows profit per unit times number of units. This formula works for all scenarios, with negative values indicating losses."
            },
            {
              "process": "Example: Profit calculation",
              "explanation": "Suppose a firm produces $Q = 100$ where $P = \\$20$ and $ATC = \\$15$. Then $\\pi = (\\$20 - \\$15) \\times 100 = \\$5 \\times 100 = \\$500$ economic profit."
            },
            {
              "process": "Example: Loss calculation",
              "explanation": "Suppose the same firm faces $P = \\$12$ with $ATC = \\$15$ and $AVC = \\$10$. Then $\\pi = (\\$12 - \\$15) \\times 100 = (-\\$3) \\times 100 = -\\$300$ loss. But since $P > AVC$, the firm continues operating because the loss is less than fixed costs. Fixed costs = $(ATC - AVC) \\times Q = (\\$15 - \\$10) \\times 100 = \\$5 \\times 100 = \\$500$. Operating loss of \\$300 is better than shutdown loss of \\$500."
            }
          ]
        }
      ],

      "principles": [
        {
          "principle": "The Shutdown Rule: Operate if $P \\ge AVC$, Shut Down if $P < AVC$",
          "statement": "In the short run, a firm should continue operating if price is greater than or equal to average variable cost. If price falls below average variable cost, the firm minimizes losses by shutting down temporarily.",
          "application": "Managers can apply this rule by comparing current market price to their average variable cost at the profit-maximizing output. This decision is revisited whenever market conditions change. The rule ensures that firms don't throw good money after bad by operating when they can't cover even their variable costs.",
          "example": "A hotel has fixed costs of \\$10,000 per month (mortgage, insurance) and variable costs of \\$20 per occupied room (cleaning, utilities). If the hotel can only book enough rooms at \\$50 each to generate \\$8,000 in revenue, but variable costs are \\$6,000, then revenue covers variable costs (\\$8,000 > \\$6,000) and contributes \\$2,000 toward fixed costs. Operating loss = \\$10,000 - \\$2,000 = \\$8,000, better than shutdown loss of \\$10,000. They operate. If revenue fell to \\$5,000 with same variable costs, then revenue < variable costs, each room adds to losses - shut down."
        },
        {
          "principle": "Profit or Loss Depends on $P$ vs $ATC$",
          "statement": "A firm earns economic profit when $P > ATC$, breaks even when $P = ATC$, and suffers losses when $P < ATC$. However, losses alone don't trigger shutdown - that requires $P < AVC$.",
          "application": "This principle helps distinguish between temporary losses (which may be worth enduring) and situations requiring shutdown or exit. Managers must know both their $AVC$ and $ATC$ to make correct decisions.",
          "example": "Consider three scenarios for the same firm with $ATC = \\$50$, $AVC = \\$30$: At $P = \\$60$: $P > ATC$ → profit. At $P = \\$50$: $P = ATC$ → break-even. At $P = \\$40$: $AVC < P < ATC$ → loss but operate. At $P = \\$25$: $P < AVC$ → shut down. The thresholds at \\$50 and \\$30 define different zones of behavior."
        },
        {
          "principle": "The Firm's Supply Curve Is Its $MC$ Curve Above $\\min AVC$",
          "statement": "In perfect competition, the firm's short-run supply curve is the portion of its marginal cost curve that lies above the minimum point of average variable cost. Below that price, quantity supplied is zero.",
          "application": "This relationship allows us to predict how firms will respond to price changes and to construct industry supply curves by summing individual firms' $MC$ curves. It's the foundation of supply-side analysis in competitive markets.",
          "example": "A farmer has $MC = 2Q$ and $\\min AVC = \\$4$ at $Q = 2$. If price is \\$3, supply = 0. If price is \\$5, set $5 = 2Q$ → $Q = 2.5$ units. If price is \\$10, set $10 = 2Q$ → $Q = 5$ units. The supply schedule comes directly from $MC$ above \\$4."
        },
        {
          "principle": "Short-Run Losses Can Be Rational",
          "statement": "Operating at a loss in the short run is often a rational decision if the loss is less than the fixed costs that would be incurred anyway. Firms may accept temporary losses while waiting for prices to improve or while fulfilling contracts.",
          "application": "This explains why we see firms continuing operations during recessions or seasonal downturns. It also explains why some industries with high fixed costs (airlines, hotels) sometimes sell below total cost - they're covering variable costs and contributing something to fixed costs rather than leaving seats or rooms empty.",
          "example": "An airline has a flight with 100 seats. Fixed costs (plane, crew salaries, gate fees) are \\$10,000 per flight regardless of passengers. Variable costs (fuel, food) are \\$50 per passenger. If they sell 60 tickets at \\$150 each, revenue = \\$9,000, variable costs = \\$3,000, contribution to fixed costs = \\$6,000. Loss = fixed \\$10,000 - \\$6,000 = \\$4,000. If they canceled the flight, loss would be full \\$10,000. Operating at a loss is rational."
        }
      ],

      "worked_examples": [
        {
          "title": "Identifying the Four Scenarios from Data",
          "problem": "A perfectly competitive firm has the following cost structure at its profit-maximizing output of 500 units: $ATC = \\$25$, $AVC = \\$18$, $MC = \\$22$ at Q=500. For each of the following market prices, determine: (i) the profit-maximizing output (assume the firm adjusts to where $P = MC$), (ii) whether the firm earns profit, breaks even, operates at a loss, or shuts down, and (iii) calculate total profit or loss. Prices: a) $P = \\$30$, b) $P = \\$25$, c) $P = \\$20$, d) $P = \\$15$.",
          "step_by_step": [
            {
              "step": "Analyze price $P = \\$30$",
              "explanation": "Since $P > ATC$ (\\$30 > \\$25), the firm earns profit. At $P = \\$30$, the firm produces where $P = MC$. Given $MC$ at Q=500 is \\$22, and $MC$ rises with output, the firm will increase output until $MC$ rises to \\$30. Without full $MC$ schedule, we use Q=500 as baseline. Profit per unit = $P - ATC = \\$30 - \\$25 = \\$5$. Total profit = \\$5 × 500 = \\$2,500. (Assuming Q adjusts but profit per unit remains similar.)"
            },
            {
              "step": "Analyze price $P = \\$25$",
              "explanation": "Here $P = ATC$ (\\$25 = \\$25), so the firm breaks even with zero economic profit. The firm produces where $P = MC$, which at Q=500 is \\$22, so output will increase until $MC$ rises to \\$25. Profit = $0$ (normal profit only)."
            },
            {
              "step": "Analyze price $P = \\$20$",
              "explanation": "Here $AVC < P < ATC$: \\$18 < \\$20 < \\$25. The firm operates at a loss but continues producing. It produces where $P = MC$, which at Q=500 is \\$22, so to have $MC = \\$20$, output must be lower than 500. Loss per unit = $P - ATC = \\$20 - \\$25 = -\\$5$. At lower output, $ATC$ might be different, but approximate loss = -\\$5 × Q. Since $P > AVC$, loss < fixed costs. Fixed costs = $(ATC - AVC) × Q = (\\$25 - \\$18) × 500 = \\$7 × 500 = \\$3,500$. Operating loss will be less than \\$3,500."
            },
            {
              "step": "Analyze price $P = \\$15$",
              "explanation": "Here $P < AVC$ (\\$15 < \\$18). The firm should shut down immediately. Producing any positive quantity would increase losses beyond fixed costs. Loss if shut down = fixed costs = \\$3,500. Loss if operating at some Q where $P = MC$ would be even larger because revenue wouldn't cover variable costs. The firm produces zero and loses \\$3,500."
            }
          ],
          "final_answer": "a) P=\\$30: Profit, output >500, profit ≈ \\$2,500+. b) P=\\$25: Break-even, zero economic profit. c) P=\\$20: Loss but operate, loss < \\$3,500. d) P=\\$15: Shut down, loss = \\$3,500.",
          "concept_applied": "The four short-run scenarios are determined by price relative to AVC and ATC. The shutdown point is where P = min AVC; below that, shut down. Between AVC and ATC, operate at a loss. At ATC, break even. Above ATC, earn profit."
        },
        {
          "title": "Finding the Shutdown and Break-Even Points",
          "problem": "A competitive firm has total cost: $TC = 100 + 10Q + Q^2$. This means $MC = 10 + 2Q$, $AVC = 10 + Q$, and $ATC = 100/Q + 10 + Q$. a) Find the shutdown price and quantity. b) Find the break-even price and quantity. c) If market price is \\$30, what is the profit-maximizing output and profit?",
          "step_by_step": [
            {
              "step": "Find shutdown point where $P = \\min AVC$",
              "explanation": "$AVC = 10 + Q$. This is linear and increasing, so minimum occurs at smallest Q. But wait - linear increasing means minimum at Q→0? That doesn't make sense for a typical firm. Let's check: $AVC = (10Q + Q^2)/Q = 10 + Q$. This increases with Q, so minimum is at the smallest possible Q > 0. But in theory, shutdown point is where $MC = AVC$. Solve $10 + 2Q = 10 + Q$ → $2Q = Q$ → $Q = 0$. That suggests minimum AVC at Q=0, which is \\$10. So shutdown price = \\$10, quantity = 0 (firm produces nothing below \\$10)."
            },
            {
              "step": "Find break-even point where $P = \\min ATC$",
              "explanation": "Break-even occurs where $P = \\min ATC$ and $MC = ATC$. Set $MC = ATC$: $10 + 2Q = 100/Q + 10 + Q$. Simplify: $2Q = 100/Q + Q$ → $Q = 100/Q$ → $Q^2 = 100$ → $Q = 10$ (positive). At Q=10, $ATC = 100/10 + 10 + 10 = 10 + 10 + 10 = \\$30$. So break-even price = \\$30, quantity = 10."
            },
            {
              "step": "Find profit-maximizing output at P = \\$30",
              "explanation": "Set $P = MC$: $30 = 10 + 2Q$ → $2Q = 20$ → $Q = 10$. This matches break-even quantity."
            },
            {
              "step": "Calculate profit at P = \\$30, Q = 10",
              "explanation": "$TR = 30 × 10 = \\$300$. $TC = 100 + 10(10) + (10)^2 = 100 + 100 + 100 = \\$300$. Profit = $300 - 300 = \\$0$ economic profit (normal profit)."
            },
            {
              "step": "Interpret results",
              "explanation": "At P = \\$30, the firm breaks even. This is the minimum price for long-run survival. At any price below \\$30 but above \\$10, the firm operates at a loss. At any price below \\$10, the firm shuts down."
            }
          ],
          "final_answer": "a) Shutdown price = \\$10, quantity = 0. b) Break-even price = \\$30, quantity = 10. c) At P = \\$30, Q = 10, profit = \\$0 (normal profit).",
          "concept_applied": "The shutdown point occurs where $P = \\min AVC$, below which the firm produces nothing. The break-even point occurs where $P = \\min ATC$, the minimum price for long-run viability. Between these, the firm operates at a loss in the short run."
        },
        {
          "title": "Graphical Analysis of Short-Run Outcomes",
          "problem": "Draw and describe the four short-run scenarios using a standard cost curve graph. For each scenario, explain where price lies relative to ATC and AVC, whether the firm operates, and what profit/loss looks like on the graph.",
          "step_by_step": [
            {
              "step": "Scenario 1: Economic Profit ($P > ATC$)",
              "explanation": "On a graph with $MC$, $ATC$, and $AVC$, draw a horizontal price line above the minimum point of $ATC$. The price line intersects $MC$ at the profit-maximizing quantity $Q^*$. At $Q^*$, go up to the demand curve (same as price line) and down to $ATC$. The vertical distance between price and $ATC$ is profit per unit. Shade the rectangle with height $(P - ATC)$ and width $Q^*$ - this is total economic profit."
            },
            {
              "step": "Scenario 2: Break-Even ($P = ATC$)",
              "explanation": "Draw the price line exactly tangent to the minimum point of the $ATC$ curve. At this point, $MC$ also crosses $ATC$ at its minimum. Price equals $ATC$, so profit per unit is zero. No profit rectangle - the firm earns normal profit. This is the lowest price at which the firm can survive in the long run."
            },
            {
              "step": "Scenario 3: Loss but Operate ($AVC < P < ATC$)",
              "explanation": "Draw the price line between the minimum points of $AVC$ and $ATC$. It intersects $MC$ at $Q^*$. At $Q^*$, price is below $ATC$ but above $AVC$. The loss per unit is $(ATC - P)$, shown as the vertical distance between $ATC$ and price. Shade this loss rectangle. However, note that price is above $AVC$, so revenue covers variable costs and contributes to fixed costs. The loss is less than fixed costs."
            },
            {
              "step": "Scenario 4: Shutdown ($P < AVC$)",
              "explanation": "Draw the price line below the minimum point of $AVC$. At this price, the firm's best choice is to produce zero. There is no intersection with $MC$ that makes sense because at any positive quantity, $P < AVC$, meaning each unit adds to losses. The firm shuts down, producing zero, and loses only fixed costs (the area between $ATC$ and $AVC$ at the shutdown point)."
            }
          ],
          "final_answer": "The four scenarios are distinguished by price relative to AVC and ATC: 1) P > ATC: profit rectangle above ATC. 2) P = ATC: break-even at minimum ATC. 3) AVC < P < ATC: loss rectangle between price and ATC, but operation continues. 4) P < AVC: shutdown, produce zero.",
          "concept_applied": "Graphical analysis shows clearly how the relationship between price and cost curves determines short-run outcomes. The shutdown point at minimum AVC and break-even point at minimum ATC are key thresholds."
        }
      ],

      "image": {
        "src": "images/unit6/short_run_scenarios.png",
        "alt": "Four panels showing the four short-run scenarios: profit, break-even, loss with operation, and shutdown",
        "caption": "The four short-run scenarios depend on where price falls relative to AVC and ATC"
      }
    }
  ],

  "key_terms": [
    "Short run",
    "Economic profit",
    "Economic loss",
    "Break-even point",
    "Shutdown point",
    "Shutdown rule",
    "Average variable cost (AVC)",
    "Average total cost (ATC)",
    "Marginal cost (MC)",
    "Fixed costs",
    "Variable costs",
    "Operating at a loss",
    "Temporary shutdown",
    "Supply curve",
    "Profit rectangle",
    "Loss rectangle",
    "Normal profit"
  ],

  "summary": "In the short run, firms face fixed costs that cannot be adjusted, leading to four possible outcomes based on market price relative to their cost curves. When price exceeds average total cost ($P > ATC$), the firm earns economic profit, shown graphically as a rectangle with height $(P - ATC)$ times quantity. When price equals average total cost ($P = ATC$), the firm breaks even, earning zero economic profit (normal profit) at the minimum point of the ATC curve. When price falls between average variable cost and average total cost ($AVC < P < ATC$), the firm operates at a loss but continues production because revenue covers all variable costs and contributes something toward fixed costs, making the loss smaller than shutting down. When price drops below average variable cost ($P < AVC$), the firm cannot even cover its variable costs and minimizes losses by shutting down temporarily, producing zero and losing only fixed costs. The shutdown point occurs where price equals minimum average variable cost ($P = \\min AVC$); below this price, quantity supplied is zero. The firm's short-run supply curve is the portion of its marginal cost curve above minimum AVC, as the firm produces where $P = MC$ for all prices above shutdown. These short-run outcomes are crucial for understanding firm behavior, industry dynamics, and the process of adjustment toward long-run equilibrium. They explain why firms sometimes operate at a loss, why some industries experience temporary shutdowns during downturns, and how markets allocate resources in the short run."
}
