{
  "expanded_description": "This section introduces acceleration, the rate at which velocity changes. Acceleration describes how quickly an object speeds up, slows down, or changes direction. Understanding acceleration is essential for analyzing non-uniform motion and forms the foundation for kinematics equations.",
  "core_concept": {
    "principle": "Acceleration is the rate of change of velocity. It tells us how quickly an object's velocity is changing, including both changes in speed and changes in direction.",
    "explanation": "Whenever an object's velocity changes - whether it speeds up, slows down, or turns - it is accelerating. Even an object moving at constant speed but changing direction (like a car going around a curve) is accelerating because its velocity vector changes.",
    "image": {
      "src": "images/unit2/acceleration_intro.png",
      "alt": "Diagram showing a car speeding up (increasing velocity), slowing down (decreasing velocity), and turning (changing direction)",
      "caption": "Acceleration occurs whenever velocity changes - in magnitude, direction, or both"
    }
  },
  "sections": [
    {
      "section_title": "What is Acceleration?",
      "introduction": "In everyday language, acceleration often means 'speeding up.' In physics, it has a broader meaning: any change in velocity, whether speeding up, slowing down, or changing direction.",
      "key_concept": {
        "definition": "Acceleration ($\\vec{a}$) is the rate of change of velocity. It is a vector quantity with units of meters per second squared ($\\text{m/s}^2$).",
        "context": "Acceleration tells us how quickly velocity changes. A large acceleration means velocity changes rapidly; zero acceleration means constant velocity (which could be zero or non-zero)."
      },
      "principles": [
        {
          "principle": "Acceleration Requires Velocity Change",
          "statement": "If velocity is constant (both magnitude and direction unchanged), acceleration is zero.",
          "application": "An object moving in a straight line at constant speed has zero acceleration. An object at rest also has zero acceleration (velocity constant at zero).",
          "example": "A car on cruise control on a straight highway has constant velocity → zero acceleration."
        },
        {
          "principle": "Acceleration is a Vector",
          "statement": "Like velocity, acceleration has both magnitude and direction. The direction of acceleration is the direction of the change in velocity.",
          "application": "The sign of acceleration (positive or negative) depends on the chosen sign convention and whether velocity is increasing or decreasing in that direction.",
          "example": "If a car moving east (+ direction) speeds up, its acceleration is positive. If it slows down while still moving east, its acceleration is negative (opposite to velocity)."
        },
        {
          "principle": "Acceleration Can Change Speed or Direction",
          "statement": "Acceleration occurs whenever the velocity vector changes - either its magnitude (speed), its direction, or both.",
          "application": "Circular motion at constant speed involves acceleration because direction changes continuously.",
          "example": "A satellite in circular orbit has constant speed but is accelerating toward Earth due to changing direction."
        }
      ],
      "worked_examples": [
        {
          "title": "Recognizing Acceleration",
          "problem": "For each scenario, state whether the object is accelerating and explain why: (a) A car increasing speed from 0 to 60 km/h on a straight road. (b) A car traveling at a constant 60 km/h around a curve. (c) A book resting on a table. (d) A ball thrown straight up at the top of its path.",
          "step_by_step": [
            {
              "step": "Scenario (a)",
              "explanation": "The car's speed is increasing, so its velocity magnitude is changing. Therefore it is accelerating."
            },
            {
              "step": "Scenario (b)",
              "explanation": "Speed is constant but direction is changing (going around a curve). Velocity vector changes → accelerating."
            },
            {
              "step": "Scenario (c)",
              "explanation": "Book at rest has constant velocity (zero). No change → not accelerating."
            },
            {
              "step": "Scenario (d)",
              "explanation": "At the top, velocity is instantaneously zero, but it is changing from upward to downward. Velocity is changing → accelerating (gravity still acts)."
            }
          ],
          "final_answer": "(a) accelerating (speed change), (b) accelerating (direction change), (c) not accelerating, (d) accelerating (velocity changing)",
          "concept_applied": "Acceleration is any change in velocity - magnitude, direction, or both."
        }
      ]
    },
    {
      "section_title": "Average and Instantaneous Acceleration",
      "introduction": "Just as with velocity, we distinguish between average acceleration over a time interval and instantaneous acceleration at a specific instant.",
      "key_concept": {
        "definition": "Average acceleration is the change in velocity divided by the time interval: $\\vec{a}_{avg} = \\frac{\\Delta \\vec{v}}{\\Delta t} = \\frac{\\vec{v}_f - \\vec{v}_i}{t_f - t_i}$. Instantaneous acceleration is the acceleration at a specific moment, the limit of average acceleration as the time interval approaches zero.",
        "context": "Average acceleration gives the overall rate of velocity change over a period; instantaneous acceleration tells how quickly velocity is changing right now."
      },
      "principles": [
        {
          "principle": "Average Acceleration Formula",
          "statement": "$\\vec{a}_{avg} = \\frac{\\vec{v}_f - \\vec{v}_i}{\\Delta t}$.",
          "application": "Use this when you know initial and final velocities and the time interval. The sign of the result indicates direction of average acceleration.",
          "example": "If a car's velocity changes from $10 \\text{ m/s}$ east to $20 \\text{ m/s}$ east in $5 \\text{ s}$, $\\vec{a}_{avg} = (20-10)/5 = +2 \\text{ m/s}^2$ east."
        },
        {
          "principle": "Instantaneous Acceleration",
          "statement": "Instantaneous acceleration is the slope of the velocity-time graph at a point, or the derivative of velocity with respect to time.",
          "application": "On a $v$ vs. $t$ graph, a steep slope means large acceleration; a flat line (zero slope) means zero acceleration.",
          "example": "If $v(t) = 5t$, then instantaneous acceleration $a = dv/dt = 5 \\text{ m/s}^2$ constant."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Average Acceleration",
          "problem": "A runner increases velocity from $2 \\text{ m/s}$ north to $8 \\text{ m/s}$ north in $3 \\text{ s}$. What is her average acceleration?",
          "step_by_step": [
            {
              "step": "Identify initial and final velocities",
              "explanation": "$\\vec{v}_i = +2 \\text{ m/s}$, $\\vec{v}_f = +8 \\text{ m/s}$ (north positive)"
            },
            {
              "step": "Find change in velocity",
              "explanation": "$\\Delta \\vec{v} = 8 - 2 = +6 \\text{ m/s}$"
            },
            {
              "step": "Divide by time interval",
              "explanation": "$\\vec{a}_{avg} = \\frac{6 \\text{ m/s}}{3 \\text{ s}} = +2 \\text{ m/s}^2$"
            }
          ],
          "final_answer": "$2 \\text{ m/s}^2$ north",
          "concept_applied": "Average acceleration is change in velocity over time, direction same as velocity change."
        },
        {
          "title": "Acceleration with Direction Change",
          "problem": "A car moving east at $20 \\text{ m/s}$ applies brakes and comes to a stop in $5 \\text{ s}$. Find its average acceleration (east positive).",
          "step_by_step": [
            {
              "step": "Identify velocities",
              "explanation": "$\\vec{v}_i = +20 \\text{ m/s}$, $\\vec{v}_f = 0 \\text{ m/s}$"
            },
            {
              "step": "Change in velocity",
              "explanation": "$\\Delta \\vec{v} = 0 - 20 = -20 \\text{ m/s}$"
            },
            {
              "step": "Average acceleration",
              "explanation": "$\\vec{a}_{avg} = \\frac{-20}{5} = -4 \\text{ m/s}^2$"
            }
          ],
          "final_answer": "$-4 \\text{ m/s}^2$ (west, opposite to motion)",
          "concept_applied": "Negative acceleration indicates acceleration opposite to the positive direction; here it means slowing down in the east direction."
        }
      ]
    },
    {
      "section_title": "Sign of Acceleration: Speeding Up and Slowing Down",
      "introduction": "The sign of acceleration alone does not tell whether an object is speeding up or slowing down. It depends on the direction of acceleration relative to velocity.",
      "key_concept": {
        "definition": "An object speeds up when acceleration and velocity are in the same direction. It slows down when acceleration and velocity are in opposite directions.",
        "context": "A positive acceleration does not always mean speeding up. If velocity is negative (moving in negative direction), a positive acceleration means slowing down because it opposes the velocity."
      },
      "principles": [
        {
          "principle": "Same Sign → Speeding Up",
          "statement": "If velocity and acceleration have the same sign (both positive or both negative), the object is speeding up.",
          "application": "The object's speed increases because acceleration acts in the same direction as motion.",
          "example": "Car moving east (+v) and accelerating east (+a): speeding up."
        },
        {
          "principle": "Opposite Signs → Slowing Down",
          "statement": "If velocity and acceleration have opposite signs (one positive, one negative), the object is slowing down.",
          "application": "Acceleration opposes velocity, reducing speed.",
          "example": "Car moving east (+v) but accelerating west (-a): slowing down (braking)."
        },
        {
          "principle": "Zero Acceleration → Constant Velocity",
          "statement": "If acceleration is zero, velocity is constant (could be zero or non-zero).",
          "application": "No change in speed or direction.",
          "example": "Cruise control on straight road."
        }
      ],
      "classifications": [
        {
          "type": "Interpreting Acceleration Sign",
          "value": "How to determine speeding up/slowing down from signs",
          "characteristics": [
            "Compare signs of v and a",
            "Same sign → speeding up",
            "Opposite signs → slowing down",
            "a = 0 → constant velocity"
          ],
          "behavior": "This rule works in one dimension with a consistent sign convention. In more dimensions, we consider the angle between v and a vectors.",
          "examples": [
            {
              "process": "Speeding up (positive direction)",
              "explanation": "$v = +10$, $a = +2$ → speeding up"
            },
            {
              "process": "Speeding up (negative direction)",
              "explanation": "$v = -10$, $a = -2$ → speeding up (more negative)"
            },
            {
              "process": "Slowing down (positive direction)",
              "explanation": "$v = +10$, $a = -2$ → slowing down"
            },
            {
              "process": "Slowing down (negative direction)",
              "explanation": "$v = -10$, $a = +2$ → slowing down (less negative)"
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Determining Speeding Up or Slowing Down",
          "problem": "For each case, state whether the object is speeding up, slowing down, or moving with constant velocity: (a) $v = +5 \\text{ m/s}$, $a = +1 \\text{ m/s}^2$; (b) $v = -5 \\text{ m/s}$, $a = -1 \\text{ m/s}^2$; (c) $v = +5 \\text{ m/s}$, $a = -1 \\text{ m/s}^2$; (d) $v = -5 \\text{ m/s}$, $a = +1 \\text{ m/s}^2$; (e) $a = 0$.",
          "step_by_step": [
            {
              "step": "Case (a)",
              "explanation": "$v$ and $a$ both positive → same sign → speeding up."
            },
            {
              "step": "Case (b)",
              "explanation": "$v$ and $a$ both negative → same sign → speeding up (in negative direction)."
            },
            {
              "step": "Case (c)",
              "explanation": "$v$ positive, $a$ negative → opposite signs → slowing down."
            },
            {
              "step": "Case (d)",
              "explanation": "$v$ negative, $a$ positive → opposite signs → slowing down."
            },
            {
              "step": "Case (e)",
              "explanation": "$a = 0$ → constant velocity."
            }
          ],
          "final_answer": "(a) speeding up, (b) speeding up, (c) slowing down, (d) slowing down, (e) constant velocity",
          "concept_applied": "Compare signs of v and a: same sign → speeding up; opposite → slowing down; a=0 → constant v."
        }
      ],
      "image": {
        "src": "images/unit2/speeding_up_slowing_down.png",
        "alt": "Number line showing cases of velocity and acceleration signs: same direction speeding up, opposite slowing down",
        "caption": "Speeding up occurs when velocity and acceleration point the same way; slowing down when they point opposite"
      }
    },
    {
      "section_title": "Acceleration and Velocity-Time Graphs",
      "introduction": "Velocity-time graphs provide a visual way to understand acceleration. The slope of a v-t graph at any point equals the instantaneous acceleration.",
      "key_concept": {
        "definition": "On a velocity vs. time graph, the slope (rise over run) represents acceleration. A steeper slope means larger acceleration; a horizontal line means zero acceleration.",
        "context": "Just as position-time graph slope gives velocity, v-t graph slope gives acceleration. The shape of the v-t graph reveals how velocity changes over time."
      },
      "principles": [
        {
          "principle": "Slope = Acceleration",
          "statement": "For a v-t graph, $a = \\frac{\\Delta v}{\\Delta t}$ is the slope of the line connecting two points (average acceleration) or the slope of the tangent at a point (instantaneous acceleration).",
          "application": "Calculate acceleration by finding the slope of the v-t graph over the interval of interest.",
          "example": "If a v-t graph is a straight line from (0 s, 10 m/s) to (5 s, 20 m/s), slope = $(20-10)/(5-0) = 2 \\text{ m/s}^2$ = constant acceleration."
        },
        {
          "principle": "Positive/Negative Slope",
          "statement": "Positive slope means positive acceleration (velocity increasing in positive direction). Negative slope means negative acceleration (velocity decreasing in positive direction or increasing in negative direction).",
          "application": "The sign of slope indicates the direction of acceleration relative to chosen sign convention.",
          "example": "A v-t graph with downward slope (negative slope) means acceleration is negative."
        },
        {
          "principle": "Curved v-t Graphs",
          "statement": "If the v-t graph is curved, acceleration is changing. The slope at any point gives instantaneous acceleration.",
          "application": "For a curved graph, acceleration is not constant; we can find it by drawing tangents.",
          "example": "A parabolic v-t graph indicates constant acceleration? Actually if v-t is linear, a constant; if curved, a varies."
        }
      ],
      "worked_examples": [
        {
          "title": "Finding Acceleration from v-t Graph",
          "problem": "A velocity-time graph shows a straight line passing through points (0 s, 5 m/s) and (4 s, 13 m/s). Find the acceleration.",
          "step_by_step": [
            {
              "step": "Identify coordinates",
              "explanation": "$(t_1, v_1) = (0, 5)$, $(t_2, v_2) = (4, 13)$"
            },
            {
              "step": "Calculate slope",
              "explanation": "$a = \\frac{13 - 5}{4 - 0} = \\frac{8}{4} = 2 \\text{ m/s}^2$"
            }
          ],
          "final_answer": "$2 \\text{ m/s}^2$",
          "concept_applied": "Slope of v-t line = acceleration (constant here)."
        }
      ],
      "image": {
        "src": "images/unit2/vt_graph_slope.png",
        "alt": "Velocity-time graph with slope triangle showing rise/run = acceleration",
        "caption": "On a v-t graph, slope equals acceleration"
      }
    },
    {
      "section_title": "Constant Acceleration",
      "introduction": "A special and important case is constant acceleration, where the rate of change of velocity is uniform. This leads to simple relationships between velocity, time, and displacement.",
      "key_concept": {
        "definition": "Constant acceleration means the velocity changes by the same amount in each equal time interval. The v-t graph is a straight line.",
        "context": "Many physical situations involve constant or nearly constant acceleration: free fall near Earth's surface (gravity), objects sliding down inclined planes, or cars with steady braking."
      },
      "principles": [
        {
          "principle": "Linear Velocity-Time Relationship",
          "statement": "Under constant acceleration, velocity changes linearly with time: $v(t) = v_0 + at$, where $v_0$ is initial velocity and $a$ is constant acceleration.",
          "application": "This equation allows prediction of velocity at any time given constant acceleration.",
          "example": "If $v_0 = 5 \\text{ m/s}$ and $a = 2 \\text{ m/s}^2$, then at $t=3 \\text{ s}$, $v = 5 + 2(3) = 11 \\text{ m/s}$."
        },
        {
          "principle": "Constant Acceleration on v-t Graph",
          "statement": "With constant acceleration, the v-t graph is a straight line with slope equal to a.",
          "application": "The area under the v-t line gives displacement.",
          "example": "A v-t line from (0,10) to (5,20) has slope 2 m/s² (constant a)."
        }
      ],
      "worked_examples": [
        {
          "title": "Velocity Under Constant Acceleration",
          "problem": "A train starts from rest and accelerates uniformly at $1.5 \\text{ m/s}^2$ for $10 \\text{ s}$. What is its velocity at the end of this time?",
          "step_by_step": [
            {
              "step": "Identify knowns",
              "explanation": "$v_0 = 0 \\text{ m/s}$, $a = 1.5 \\text{ m/s}^2$, $t = 10 \\text{ s}$"
            },
            {
              "step": "Apply equation",
              "explanation": "$v = v_0 + at = 0 + 1.5(10) = 15 \\text{ m/s}$"
            }
          ],
          "final_answer": "$15 \\text{ m/s}$",
          "concept_applied": "For constant acceleration, velocity increases linearly with time."
        }
      ]
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Understanding typical errors helps students correctly apply acceleration concepts.",
      "classifications": [
        {
          "type": "Confusing Acceleration with Velocity",
          "value": "Thinking that acceleration means moving fast, or that zero acceleration means at rest",
          "characteristics": [
            "Believing a = 0 implies v = 0",
            "Assuming large a means large v",
            "Not distinguishing between speed and rate of change of speed"
          ],
          "behavior": "Acceleration is about change in velocity, not velocity itself. An object can have high velocity and zero acceleration (constant speed), or zero velocity but non-zero acceleration (instantaneously at rest but changing).",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Student says a car at rest has zero acceleration (true), but also says a car moving at constant 100 km/h has zero acceleration (true), then concludes both situations are the same - missing that velocity differs."
            },
            {
              "process": "Correct",
              "explanation": "Zero acceleration means constant velocity, which could be zero or any constant value."
            }
          ]
        },
        {
          "type": "Sign Errors in Acceleration",
          "value": "Assuming positive acceleration always means speeding up",
          "characteristics": [
            "Ignoring direction of velocity",
            "Misinterpreting signs",
            "Confusing deceleration"
          ],
          "behavior": "The sign of acceleration alone does not indicate speeding up/slowing down; you must compare with velocity sign.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Object with v = -10 m/s and a = +2 m/s²: student says it's speeding up because a positive."
            },
            {
              "process": "Correct",
              "explanation": "v and a opposite signs → slowing down (speed decreases from 10 to eventually 0)."
            }
          ]
        },
        {
          "type": "Using Speed Instead of Velocity in Acceleration Formula",
          "value": "Plugging in speed (magnitude) and ignoring direction changes",
          "characteristics": [
            "Using only magnitudes when direction changes",
            "Getting zero acceleration for circular motion"
          ],
          "behavior": "Acceleration depends on velocity vector; if direction changes, acceleration is non-zero even if speed constant.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Car rounding curve at constant speed: student says a = 0 because speed constant."
            },
            {
              "process": "Correct",
              "explanation": "Velocity changes direction → acceleration non-zero (centripetal)."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit2/acceleration_mistakes.png",
        "alt": "Illustrations of common acceleration mistakes: confusing a with v, sign errors",
        "caption": "Common errors include confusing acceleration with velocity and misinterpreting signs"
      }
    }
  ],
  "key_terms": [
    "Acceleration",
    "Average Acceleration",
    "Instantaneous Acceleration",
    "Rate of Change of Velocity",
    "Vector",
    "Sign Convention",
    "Speeding Up",
    "Slowing Down",
    "Constant Acceleration",
    "Deceleration",
    "$\\text{m/s}^2$",
    "Velocity-Time Graph",
    "Slope"
  ],
  "summary": "Acceleration is the rate of change of velocity, a vector quantity measured in $\\text{m/s}^2$. It occurs whenever velocity changes - whether in magnitude (speeding up or slowing down) or direction. Average acceleration is $\\vec{a}_{avg} = \\Delta \\vec{v} / \\Delta t$; instantaneous acceleration is the slope of the velocity-time graph. The sign of acceleration alone does not indicate speeding up/slowing down; one must compare with the sign of velocity: same sign → speeding up, opposite → slowing down. On a v-t graph, the slope gives acceleration: positive slope → positive acceleration, negative slope → negative acceleration. Constant acceleration is a special case where velocity changes linearly with time, leading to the equation $v = v_0 + at$. Common mistakes include confusing acceleration with velocity, assuming positive acceleration always means speeding up, and neglecting direction changes in velocity. Understanding acceleration is fundamental for describing motion and for applying the kinematic equations in later sections."
}
