{
  "expanded_description": "This section introduces position and displacement, two fundamental concepts for describing where an object is and how much its location has changed. Understanding the distinction between distance (a scalar) and displacement (a vector) is crucial for correctly analyzing motion.",
  "core_concept": {
    "principle": "Position tells us where an object is located relative to a reference point. Displacement tells us how much and in what direction an object's position has changed. Distance tells us the total path length traveled, regardless of direction.",
    "explanation": "While distance and displacement are both measured in meters, they can be very different. A person walking 3 km east then 4 km west travels a distance of 7 km, but their displacement is only 1 km west. Understanding this difference is essential for correctly interpreting motion.",
    "image": {
      "src": "images/unit2/position_displacement.png",
      "alt": "Number line showing initial position, final position, displacement arrow, and curved path showing distance",
      "caption": "Displacement is the straight-line change in position; distance is the total path length"
    }
  },
  "sections": [
    {
      "section_title": "Position",
      "introduction": "Position answers the question \"Where is the object?\" In one dimension, position is simply a location on the chosen axis relative to a reference point called the origin.",
      "key_concept": {
        "definition": "Position is the location of an object relative to a reference point (origin). It is a vector quantity, specified by a number (coordinates) and a sign indicating direction from the origin.",
        "context": "In 1D motion, we typically use the variable $x$ to represent position. A position of $x = +5 \\text{ m}$ means 5 meters in the positive direction from the origin; $x = -3 \\text{ m}$ means 3 meters in the negative direction."
      },
      "principles": [
        {
          "principle": "Origin Matters",
          "statement": "Position is meaningless without specifying the origin. The same physical point can have different positions depending on where you set $x = 0$.",
          "application": "When solving problems, clearly state where you've placed the origin. Common choices: starting point, ground level, or a fixed object.",
          "example": "If the origin is at the school, your house might be at $x = +500 \\text{ m}$. If the origin is at the store, your house might be at $x = -200 \\text{ m}$. Both are correct with their respective origins."
        },
        {
          "principle": "Sign Indicates Direction",
          "statement": "The sign of the position tells which side of the origin the object is on, according to your chosen sign convention.",
          "application": "Decide at the start which direction is positive (usually right, east, or up). Positions in that direction are positive; opposite directions are negative.",
          "example": "With east as positive, a position of $x = -20 \\text{ m}$ means 20 meters west of the origin."
        },
        {
          "principle": "Position Changes with Time",
          "statement": "For an object in motion, position is a function of time: $x(t)$. Different positions at different times indicate motion.",
          "application": "To determine if an object is moving, compare its positions at two different times.",
          "example": "If $x(0) = 2 \\text{ m}$ and $x(5) = 7 \\text{ m}$, the object moved between $t=0$ and $t=5$."
        }
      ],
      "worked_examples": [
        {
          "title": "Determining Position",
          "problem": "A number line has its origin at a tree. A house is 30 m east of the tree, and a store is 15 m west of the tree. With east as positive, what are the positions of the house and store?",
          "step_by_step": [
            {
              "step": "Establish sign convention",
              "explanation": "East is positive, west is negative."
            },
            {
              "step": "House position",
              "explanation": "House is 30 m east of origin: $x_{house} = +30 \\text{ m}$"
            },
            {
              "step": "Store position",
              "explanation": "Store is 15 m west of origin: $x_{store} = -15 \\text{ m}$"
            }
          ],
          "final_answer": "House: $+30$ m, Store: $-15$ m",
          "concept_applied": "Position includes both distance from origin and direction (sign)."
        }
      ]
    },
    {
      "section_title": "Displacement",
      "introduction": "Displacement measures how much and in what direction an object's position has changed. It is the straight-line change from initial to final position, regardless of the path taken.",
      "key_concept": {
        "definition": "Displacement ($\\Delta x$) is the change in position: $\\Delta x = x_f - x_i$. It is a vector quantity with units of length (meters).",
        "context": "Displacement depends only on the starting and ending points, not on how the object got from one to the other. A car that drives around a block and returns to its starting point has zero displacement, even though it traveled a distance."
      },
      "principles": [
        {
          "principle": "Formula for Displacement",
          "statement": "$\\Delta x = x_f - x_i$, where $x_f$ is final position and $x_i$ is initial position.",
          "application": "Always subtract initial position from final position. The order matters - swapping gives the opposite sign.",
          "example": "From $x_i = 2 \\text{ m}$ to $x_f = 7 \\text{ m}$: $\\Delta x = 7 - 2 = +5 \\text{ m}$"
        },
        {
          "principle": "Sign Indicates Direction of Change",
          "statement": "A positive displacement means the object moved in the positive direction; negative means it moved in the negative direction.",
          "application": "The sign tells you which way the object went from start to finish.",
          "example": "$\\Delta x = -3 \\text{ m}$ means the object ended up 3 meters in the negative direction from where it started."
        },
        {
          "principle": "Displacement Can Be Zero",
          "statement": "If an object returns to its starting point, displacement is zero regardless of the distance traveled.",
          "application": "This is a key difference from distance - displacement does not account for the path.",
          "example": "Running around a 400 m track and finishing where you started: distance = 400 m, displacement = 0 m."
        }
      ],
      "worked_examples": [
        {
          "title": "Calculating Displacement",
          "problem": "An object moves from $x = 10 \\text{ m}$ to $x = -5 \\text{ m}$. Calculate its displacement.",
          "step_by_step": [
            {
              "step": "Identify initial and final positions",
              "explanation": "$x_i = 10 \\text{ m}$, $x_f = -5 \\text{ m}$"
            },
            {
              "step": "Apply displacement formula",
              "explanation": "$\\Delta x = x_f - x_i = (-5) - (10) = -15 \\text{ m}$"
            },
            {
              "step": "Interpret the sign",
              "explanation": "Negative displacement means the object moved 15 m in the negative direction."
            }
          ],
          "final_answer": "$\\Delta x = -15 \\text{ m}$",
          "concept_applied": "Displacement is final minus initial position, with sign indicating direction of movement."
        },
        {
          "title": "Multiple Segments",
          "problem": "A person walks 20 m east, then 10 m west, then 30 m east. What is their displacement?",
          "step_by_step": [
            {
              "step": "Establish sign convention",
              "explanation": "Let east be positive, west negative."
            },
            {
              "step": "Break into displacements",
              "explanation": "First segment: $\\Delta x_1 = +20 \\text{ m}$\nSecond: $\\Delta x_2 = -10 \\text{ m}$\nThird: $\\Delta x_3 = +30 \\text{ m}$"
            },
            {
              "step": "Add displacements",
              "explanation": "Total displacement $= \\Delta x_1 + \\Delta x_2 + \\Delta x_3 = 20 + (-10) + 30 = +40 \\text{ m}$"
            }
          ],
          "final_answer": "$40 \\text{ m}$ east",
          "concept_applied": "Total displacement is the vector sum of individual displacements, not the sum of distances."
        }
      ]
    },
    {
      "section_title": "Distance",
      "introduction": "Distance is a scalar quantity that measures the total length of the path traveled, regardless of direction. Unlike displacement, distance always increases (or stays the same) as an object moves.",
      "key_concept": {
        "definition": "Distance ($d$) is the total length of the path traveled by an object. It is a scalar quantity with units of length (meters).",
        "context": "Distance depends on the actual route taken, not just the start and end points. A winding road gives a longer distance than a straight line between the same two points."
      },
      "principles": [
        {
          "principle": "Distance is Always Positive",
          "statement": "Distance is a scalar with no direction, so it is always positive or zero. It never decreases as an object moves.",
          "application": "When calculating distance, add the absolute values of each segment's length.",
          "example": "Walking 5 m forward then 3 m back: distance = $5 + 3 = 8$ m (not 2 m)."
        },
        {
          "principle": "Path Dependence",
          "statement": "Distance depends on the actual path taken between two points. Different paths between the same points give different distances.",
          "application": "Distance is what an odometer in a car measures - it counts every twist and turn.",
          "example": "Two roads between the same towns: one straight (10 km), one winding (15 km). Distance differs, displacement is the same (10 km in a straight line)."
        },
        {
          "principle": "Distance vs. Displacement Magnitude",
          "statement": "The magnitude of displacement is the straight-line distance between start and end. Distance is always greater than or equal to the magnitude of displacement.",
          "application": "For a straight-line motion without changing direction, distance equals displacement magnitude. For any other path, distance is larger.",
          "example": "A runner on a circular track: after one lap, displacement = 0, distance = circumference."
        }
      ],
      "classifications": [
        {
          "type": "Comparing Distance and Displacement",
          "value": "Key differences between these two quantities",
          "characteristics": [
            "Distance is scalar; displacement is vector",
            "Distance has no sign; displacement can be positive/negative",
            "Distance depends on path; displacement depends only on endpoints",
            "Distance never decreases; displacement can be zero while distance is large"
          ],
          "behavior": "These differences matter in physics because many formulas use displacement (like average velocity) while others use distance (like average speed). Using the wrong one gives incorrect results.",
          "examples": [
            {
              "process": "Round trip",
              "explanation": "Go 100 m east, then 100 m west: distance = 200 m, displacement = 0 m"
            },
            {
              "process": "Winding path",
              "explanation": "Hike 3 km east, then 4 km north: distance = 7 km, displacement = 5 km at 53°"
            },
            {
              "process": "Straight line",
              "explanation": "Drive 50 km north directly: distance = 50 km, displacement = 50 km north"
            }
          ]
        }
      ],
      "worked_examples": [
        {
          "title": "Distance vs. Displacement",
          "problem": "A dog runs 15 m east, then 8 m west, then 6 m east. Calculate (a) the total distance traveled and (b) the displacement.",
          "step_by_step": [
            {
              "step": "Establish sign convention",
              "explanation": "East positive, west negative."
            },
            {
              "step": "Calculate distance",
              "explanation": "Distance = sum of absolute values: $15 + 8 + 6 = 29 \\text{ m}$"
            },
            {
              "step": "Calculate displacement",
              "explanation": "Displacement = sum of signed displacements: $15 + (-8) + 6 = 13 \\text{ m}$ east"
            }
          ],
          "final_answer": "(a) Distance = 29 m, (b) Displacement = 13 m east",
          "concept_applied": "Distance adds all path lengths regardless of direction; displacement adds with signs."
        }
      ]
    },
    {
      "section_title": "Position-Time Relationships",
      "introduction": "Understanding how position changes with time is the foundation of kinematics. We can express position as a function of time, and use this to find displacement over any time interval.",
      "key_concept": {
        "definition": "Position as a function of time, $x(t)$, describes where an object is at any instant. The displacement between $t_1$ and $t_2$ is $\\Delta x = x(t_2) - x(t_1)$.",
        "context": "In later sections, we'll learn how to determine $x(t)$ from velocity and acceleration. For now, we focus on interpreting given position information."
      },
      "principles": [
        {
          "principle": "Position Function",
          "statement": "For an object in motion, position changes with time. This relationship can be given as an equation, a table, or a graph.",
          "application": "Given $x(t)$, you can find position at any time by substituting the time value.",
          "example": "If $x(t) = 2t + 1$ meters, then at $t = 3$ s, $x = 2(3) + 1 = 7$ m."
        },
        {
          "principle": "Displacement from Position Function",
          "statement": "Displacement over a time interval is found by evaluating the position function at the endpoints and subtracting.",
          "application": "$\\Delta x = x(t_2) - x(t_1)$ for the time interval from $t_1$ to $t_2$.",
          "example": "Using $x(t) = 2t + 1$, from $t=1$ to $t=4$: $x(4)=9$, $x(1)=3$, $\\Delta x = 9-3 = 6$ m."
        }
      ],
      "worked_examples": [
        {
          "title": "Position and Displacement from a Function",
          "problem": "An object's position is given by $x(t) = 5t - t^2$ meters. Find: (a) position at $t=0$, $t=2$, and $t=5$ seconds. (b) displacement from $t=0$ to $t=2$, and from $t=2$ to $t=5$.",
          "step_by_step": [
            {
              "step": "Find positions",
              "explanation": "$x(0) = 5(0) - 0^2 = 0$ m\n$x(2) = 5(2) - 2^2 = 10 - 4 = 6$ m\n$x(5) = 5(5) - 5^2 = 25 - 25 = 0$ m"
            },
            {
              "step": "Displacement 0 to 2",
              "explanation": "$\\Delta x_{0\\to2} = x(2) - x(0) = 6 - 0 = +6$ m"
            },
            {
              "step": "Displacement 2 to 5",
              "explanation": "$\\Delta x_{2\\to5} = x(5) - x(2) = 0 - 6 = -6$ m"
            }
          ],
          "final_answer": "(a) $x(0)=0$ m, $x(2)=6$ m, $x(5)=0$ m\n(b) $\\Delta x_{0\\to2}=+6$ m, $\\Delta x_{2\\to5}=-6$ m",
          "concept_applied": "Position function gives location at any instant; displacement is difference between positions at two times."
        }
      ]
    },
    {
      "section_title": "Common Mistakes",
      "introduction": "Understanding common errors helps students correctly apply position, distance, and displacement concepts.",
      "classifications": [
        {
          "type": "Confusing Distance and Displacement",
          "value": "Using distance when displacement is needed or vice versa",
          "characteristics": [
            "Adding all path lengths for displacement",
            "Using displacement for odometer readings",
            "Not recognizing when each is appropriate"
          ],
          "behavior": "This error leads to wrong answers in velocity (which uses displacement) vs. speed (which uses distance) calculations, and in understanding whether an object returned to start.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "A car drives 10 km east then 10 km west. Student says displacement = 20 km."
            },
            {
              "process": "Correct",
              "explanation": "Displacement = 0 km (returned to start); distance = 20 km."
            }
          ]
        },
        {
          "type": "Wrong Subtraction Order",
          "value": "Subtracting initial from final incorrectly ($x_i - x_f$ instead of $x_f - x_i$)",
          "characteristics": [
            "Gives wrong sign for displacement",
            "Common when rushing",
            "Easily caught by checking reasonableness"
          ],
          "behavior": "This error reverses the direction of displacement. If you know which way the object moved, you can check if your sign makes sense.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "From $x=3$ to $x=8$, calculating $3-8 = -5$ m (should be $+5$ m)."
            },
            {
              "process": "Correct",
              "explanation": "$\\Delta x = x_f - x_i = 8-3 = +5$ m"
            }
          ]
        },
        {
          "type": "Ignoring Sign Convention",
          "value": "Not establishing or inconsistently applying sign convention",
          "characteristics": [
            "Mixed positive/negative assignments",
            "Positions without signs when direction matters",
            "Confusion in multi-segment problems"
          ],
          "behavior": "Without consistent signs, vector addition fails and answers are meaningless.",
          "examples": [
            {
              "process": "Mistake",
              "explanation": "Treating 20 m east as +20 and 10 m west as +10 instead of -10, then adding to get +30 instead of +10."
            },
            {
              "process": "Correct",
              "explanation": "East positive: +20, west negative: -10, sum = +10 m east."
            }
          ]
        }
      ],
      "image": {
        "src": "images/unit2/distance_displacement_mistakes.png",
        "alt": "Diagram showing common mistakes: adding distances for displacement, wrong subtraction order",
        "caption": "Common errors include confusing distance and displacement and incorrect subtraction order"
      }
    }
  ],
  "key_terms": [
    "Position",
    "Origin",
    "Reference Point",
    "Displacement",
    "Distance",
    "Scalar",
    "Vector",
    "Initial Position",
    "Final Position",
    "Change in Position",
    "Path Length",
    "Sign Convention",
    "$\\Delta x$",
    "$x_i$",
    "$x_f$"
  ],
  "summary": "Position and displacement are fundamental concepts for describing where objects are and how they move. Position ($x$) is the location of an object relative to a chosen origin, with sign indicating direction according to an established convention. Displacement ($\\Delta x = x_f - x_i$) is the change in position - a vector that depends only on starting and ending points, not on the path taken. Distance is the total path length traveled - a scalar that is always positive and depends on the actual route. Key differences: displacement can be positive, negative, or zero; distance is always positive or zero. Displacement can be zero while distance is large (round trip). For straight-line motion without changing direction, displacement magnitude equals distance; for any other motion, distance is greater. Understanding these distinctions is essential for correctly applying kinematics equations and interpreting motion, as velocity uses displacement while speed uses distance. Consistent sign conventions must be established and applied to all vector quantities to ensure correct calculations."
}
