{
  "topic": "Electrostatics",
  "unit_title": "Calculating Potential: Integration Methods for Potential Calculations",
  "unit_number": "Unit 1.8",
  "grade_level": "Grade 11-12",
  "subject": "AP Physics C: Electricity & Magnetism",
  "duration": "4-5 hours",
  "difficulty_level": "advanced",
  "expanded_description": "This unit develops systematic integration methods for calculating electric potential from continuous charge distributions. Students will master techniques for setting up and evaluating potential integrals for lines, surfaces, and volumes of charge, learning to choose appropriate coordinate systems and handle both uniform and non-uniform distributions. The unit emphasizes the relationship between potential calculations and previously learned field integration methods.",

  "learning_objectives": [
    "Set up and evaluate potential integrals for linear charge distributions",
    "Calculate potential from surface charge distributions using double integrals",
    "Determine potential from volume charge distributions using triple integrals",
    "Apply appropriate coordinate systems based on distribution symmetry",
    "Handle non-uniform charge densities in potential calculations",
    "Relate potential integration methods to field calculation techniques"
  ],

  "prerequisites": [
    "Mastery of electric potential definition and properties (Unit 1.7)",
    "Proficiency with multiple integration in various coordinate systems",
    "Understanding of charge density concepts (Unit 1.3)",
    "Familiarity with electric field integration methods",
    "Ability to work with Jacobians and differential elements"
  ],

  "core_concept": {
    "principle": "Potential Integration, Coordinate Systems, Charge Density, Superposition Integral, Symmetry Exploitation",
    "explanation": "The electric potential from continuous charge distributions is calculated using the superposition integral: V = ∫(kdq/r), where the integration extends over the entire charge distribution. The key steps involve: (1) expressing dq in terms of the appropriate charge density, (2) choosing a coordinate system that matches the distribution symmetry, (3) expressing the distance r in those coordinates, and (4) evaluating the resulting integral. Potential integrals are often simpler than field integrals because they involve scalar addition.",
    "image": {
      "url": "images/potential-integration-core.png",
      "alt": "Potential integration core concept",
      "caption": "Systematic approach to potential integration for continuous charge distributions"
    }
  },

  "sections": [
    {
      "section_title": "1. Linear and Surface Charge Integration",
      "introduction": "This section develops integration techniques for one-dimensional and two-dimensional charge distributions, focusing on line charges and charged surfaces with various symmetries.",

      "key_concept": {
        "definition": "Linear Charge Density, Surface Charge Density, Line Integrals, Surface Integrals, Coordinate Selection",
        "context": "For linear distributions, potential is calculated using line integrals with linear charge density λ. For surface distributions, double integrals with surface charge density σ are required. The choice of coordinate system (Cartesian, cylindrical, spherical) depends on the geometry of the distribution and the location of the field point.",
        "image": {
          "url": "images/linear-surface-integration-concepts.png",
          "alt": "Linear and surface integration concepts",
          "caption": "Coordinate systems and differential elements for linear and surface charge distributions"
        }
      },

      "classifications": [
        {
          "type": "Potential Integration Strategies",
          "value": "Methods for different distribution geometries and field point locations",
          "characteristics": [
            "Line charge: integration along curve",
            "Ring charge: single angular integral",
            "Disk charge: radial and angular integrals",
            "Straight line: Cartesian integration",
            "Curved lines: appropriate coordinate systems",
            "Planar surfaces: Cartesian or polar coordinates"
          ],
          "behavior": "Different geometries suggest different integration strategies. Straight lines often use Cartesian coordinates, circular geometries use cylindrical coordinates, and the field point location determines whether the integral simplifies significantly.",
          "examples": [
            {
              "process": "Finite Line Charge Potential",
              "explanation": "Integration along straight line segment with uniform charge density",
              "image": {
                "url": "images/finite-line-potential.png",
                "alt": "Finite line potential",
                "caption": "Potential calculation for finite line charge at arbitrary point"
              }
            },
            {
              "process": "Charged Disk Potential",
              "explanation": "Double integration over disk surface using polar coordinates",
              "image": {
                "url": "images/disk-potential-integration.png",
                "alt": "Disk potential integration",
                "caption": "Potential calculation for charged disk using surface integration"
              }
            }
          ],
          "note": "Potential integrals are often easier than field integrals because they involve scalar addition rather than vector addition"
        }
      ],

      "principles": [
        {
          "principle": "Potential Integration Methods for Lines and Surfaces",
          "statement": "General Potential Integral: V = ∫(kdq/r) over charge distribution. Linear Distributions: dq = λdl. Straight line: dl = dx. Circular arc: dl = Rdθ. General curve: dl = √(dx²+dy²+dz²). Surface Distributions: dq = σdA. Cartesian: dA = dxdy. Polar: dA = rdrdθ. Spherical: dA = R²sinθdθdφ. Coordinate Selection: Cartesian: rectangular symmetry. Cylindrical (r,θ,z): axial symmetry. Spherical (r,θ,φ): spherical symmetry. Field Point Considerations: On symmetry axis: integrals often simplify. Off-axis: generally more complex. Special Cases: Infinite line: V = -(λ/2πε₀)ln(r/r₀) (logarithmic divergence). Infinite plane: V = -σ|z|/2ε₀ + constant (linear in |z|). Integration Techniques: Trigonometric substitution for √(a²+x²) terms. Partial fractions for rational functions. Numerical integration for complex geometries. Verification: Check units: [kq/r] = N·m²/C² × C/m = N·m/C = J/C = V. Limiting cases: point charge, infinite distributions. Symmetry: potential should respect distribution symmetry.",
          "application": "Set up integrals for line charges and surfaces. Choose appropriate coordinate systems. Evaluate integrals using standard techniques. Handle infinite distributions with care. Verify results with physical reasoning.",
          "example": "Potential of finite line charge. Potential of charged ring. Potential of charged disk. Potential of spherical shell.",
          "analogy": "Calculating potential by integration is like assembling a mosaic - each tiny charge element contributes a small piece (kdq/r) to the overall picture (total potential), and by carefully summing all these pieces we build up the complete potential pattern throughout space.",
          "image": {
            "url": "images/potential-integration-principles.png",
            "alt": "Potential integration principles",
            "caption": "Systematic methods for potential integration from continuous distributions"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Potential of Finite Line Charge at General Point",
          "problem": "A rod of length L carries uniform linear charge density λ. Find the potential at a point P located a perpendicular distance d from one end of the rod.",
          "step_by_step": [
            {
              "step": "Set up coordinate system",
              "explanation": "Place rod along x-axis from x=0 to x=L. Field point at (0,d)."
            },
            {
              "step": "Charge element and distance",
              "explanation": "dq = λdx at position (x,0). Distance r = √(x² + d²)"
            },
            {
              "step": "Potential integral",
              "explanation": "V = k∫dq/r = kλ∫₀ᴸ dx/√(x² + d²)"
            },
            {
              "step": "Evaluate integral",
              "explanation": "∫dx/√(x² + d²) = ln|x + √(x² + d²)|"
            },
            {
              "step": "Apply limits",
              "explanation": "V = kλ[ln|x + √(x² + d²)|]₀ᴸ = kλ[ln(L + √(L² + d²)) - ln(d)]"
            },
            {
              "step": "Simplify expression",
              "explanation": "V = kλ ln[(L + √(L² + d²))/d]"
            },
            {
              "step": "Check limiting cases",
              "explanation": "As d→∞: V→kλL/d = kQ/d (point charge). As L→∞: V→∞ (logarithmic divergence of infinite line)"
            }
          ],
          "final_answer": "V = kλ ln[(L + √(L² + d²))/d]",
          "concept_applied": "Line charge potential integration",
          "image": {
            "url": "images/finite-line-potential-calc.png",
            "alt": "Finite line potential calc",
            "caption": "Potential calculation for finite line charge at arbitrary point"
          }
        },
        {
          "title": "Potential of Uniformly Charged Disk on Axis",
          "problem": "A disk of radius R carries uniform surface charge density σ. Find the potential on the axis at distance z from the center.",
          "step_by_step": [
            {
              "step": "Set up coordinate system",
              "explanation": "Use cylindrical coordinates. Disk in xy-plane, field point at (0,0,z)."
            },
            {
              "step": "Charge element",
              "explanation": "Ring of radius r, width dr: dq = σ(2πrdr)"
            },
            {
              "step": "Distance to field point",
              "explanation": "Distance = √(r² + z²) (constant for all points on ring)"
            },
            {
              "step": "Potential from ring",
              "explanation": "dV = kdq/√(r² + z²) = kσ(2πrdr)/√(r² + z²)"
            },
            {
              "step": "Integrate over disk",
              "explanation": "V = ∫dV = 2πkσ∫₀ᴿ rdr/√(r² + z²)"
            },
            {
              "step": "Evaluate integral",
              "explanation": "Let u = r² + z², du = 2rdr. ∫rdr/√(r² + z²) = ½∫du/√u = √u = √(r² + z²)"
            },
            {
              "step": "Apply limits",
              "explanation": "V = 2πkσ[√(r² + z²)]₀ᴿ = 2πkσ[√(R² + z²) - |z|]"
            },
            {
              "step": "Express in terms of total charge",
              "explanation": "Q = σπR², so V = (2kQ/R²)[√(R² + z²) - |z|]"
            },
            {
              "step": "Check limiting cases",
              "explanation": "As z→∞: V→kQ/z (point charge). As R→∞: V→πkσ|z| (infinite plane potential)"
            }
          ],
          "final_answer": "V = 2πkσ[√(R² + z²) - |z|] = (2kQ/R²)[√(R² + z²) - |z|]",
          "concept_applied": "Surface charge potential integration",
          "image": {
            "url": "images/disk-potential-calc.png",
            "alt": "Disk potential calc",
            "caption": "Potential calculation for charged disk using ring integration"
          }
        },
        {
          "title": "Potential of Charged Spherical Shell",
          "problem": "A spherical shell of radius R carries uniform surface charge density σ. Find the potential everywhere using direct integration.",
          "step_by_step": [
            {
              "step": "Outside the shell (r > R)",
              "explanation": "Field point distance r from center. Use spherical coordinates."
            },
            {
              "step": "Charge element",
              "explanation": "Ring at angle θ: dq = σ(2πRsinθ)(Rdθ) = 2πσR²sinθdθ"
            },
            {
              "step": "Distance law of cosines",
              "explanation": "Distance from dq to field point: r' = √(r² + R² - 2rRcosθ)"
            },
            {
              "step": "Potential integral",
              "explanation": "V = k∫dq/r' = 2πkσR²∫₀^π sinθdθ/√(r² + R² - 2rRcosθ)"
            },
            {
              "step": "Substitution",
              "explanation": "Let u = cosθ, du = -sinθdθ. When θ=0, u=1; θ=π, u=-1"
            },
            {
              "step": "Integral becomes",
              "explanation": "V = 2πkσR²∫₁⁻¹ (-du)/√(r² + R² - 2rRu) = 2πkσR²∫₋₁¹ du/√(r² + R² - 2rRu)"
            },
            {
              "step": "Evaluate integral",
              "explanation": "∫du/√(a + bu) = 2√(a + bu)/b. Here a=r²+R², b=-2rR"
            },
            {
              "step": "Apply limits",
              "explanation": "V = 2πkσR² × [2√(r²+R²-2rRu)/(-2rR)]₋₁¹ = (2πkσR/r)[√(r²+R²-2rR) - √(r²+R²+2rR)]"
            },
            {
              "step": "Simplify",
              "explanation": "√(r²+R²-2rR) = |r-R|, √(r²+R²+2rR) = r+R. For r>R: V = (2πkσR/r)[(r-R) - (r+R)] = (2πkσR/r)(-2R) = 4πkσR²/r = kQ/r"
            },
            {
              "step": "Inside the shell (r < R)",
              "explanation": "Similar calculation gives V = kQ/R (constant)"
            }
          ],
          "final_answer": "Outside (r>R): V = kQ/r; Inside (r<R): V = kQ/R",
          "concept_applied": "Surface integration with spherical symmetry",
          "image": {
            "url": "images/spherical-shell-potential.png",
            "alt": "Spherical shell potential",
            "caption": "Potential calculation for charged spherical shell using surface integration"
          }
        }
      ]
    },
    {
      "section_title": "2. Volume Charge and Advanced Integration",
      "introduction": "This section extends potential integration methods to three-dimensional charge distributions and develops advanced techniques for handling complex geometries, non-uniform densities, and special mathematical cases.",

      "key_concept": {
        "definition": "Volume Charge Density, Triple Integrals, Non-uniform Distributions, Special Functions, Numerical Methods",
        "context": "Volume charge distributions require triple integration with volume charge density ρ. Non-uniform distributions introduce functional dependencies that must be handled carefully. Complex geometries may require numerical integration or special mathematical functions. The choice of coordinate system and integration order can dramatically affect the difficulty of the calculation.",
        "image": {
          "url": "images/volume-integration-concepts.png",
          "alt": "Volume integration concepts",
          "caption": "Triple integration methods for volume charge distributions in various coordinate systems"
        }
      },

      "classifications": [
        {
          "type": "Volume Integration Strategies",
          "value": "Methods for three-dimensional charge distributions",
          "characteristics": [
            "Uniform spheres: radial integration",
            "Cylinders: radial and axial integration",
            "Boxes: Cartesian triple integrals",
            "Non-uniform distributions: functional integration",
            "Complex shapes: numerical integration",
            "Layered structures: piecewise integration"
          ],
          "behavior": "Different volume geometries suggest different integration strategies. Spherical symmetry uses spherical coordinates, cylindrical symmetry uses cylindrical coordinates, and rectangular symmetry uses Cartesian coordinates. Non-uniform densities require careful handling of the functional dependence.",
          "examples": [
            {
              "process": "Uniform Solid Sphere Potential",
              "explanation": "Triple integration using spherical coordinates and radial dependence",
              "image": {
                "url": "images/solid-sphere-potential.png",
                "alt": "Solid sphere potential",
                "caption": "Potential calculation for uniformly charged solid sphere"
              }
            },
            {
              "process": "Non-uniform Cylinder Potential",
              "explanation": "Integration with radially dependent charge density",
              "image": {
                "url": "images/nonuniform-cylinder-potential.png",
                "alt": "Nonuniform cylinder potential",
                "caption": "Potential calculation for cylinder with non-uniform charge density"
              }
            }
          ],
          "note": "The order of integration can often be chosen to simplify the calculation, especially when symmetry is present"
        }
      ],

      "principles": [
        {
          "principle": "Volume Charge Integration and Advanced Techniques",
          "statement": "Volume Distributions: dq = ρdV. Cartesian: dV = dxdydz. Cylindrical: dV = rdrdθdz. Spherical: dV = r²sinθdrdθdφ. Non-uniform Distributions: ρ = ρ(r) or ρ(r,θ,φ). Must include functional dependence in integral. Integration Order: Choose order to simplify: often do angular integrals first. Use symmetry to reduce dimensions. Special Cases: Uniform sphere: V_inside = kQ(3R²-r²)/2R³, V_outside = kQ/r. Uniform cylinder: complex Bessel function solutions. Infinite distributions: require careful handling of divergences. Advanced Techniques: Numerical integration for complex geometries. Fourier methods for periodic distributions. Green's function methods. Method of images for conductors. Verification Methods: Check at symmetry points. Verify field from E = -∇V. Test limiting cases. Ensure continuity at boundaries. Computational Approaches: Monte Carlo integration. Finite element methods. Boundary element methods. Software tools for complex geometries.",
          "application": "Set up triple integrals for volume distributions. Handle non-uniform charge densities. Choose optimal integration order. Apply numerical methods when needed. Verify results comprehensively.",
          "example": "Potential of uniform solid sphere. Potential of charged cube. Potential of non-uniform distributions. Potential of infinite cylinders.",
          "analogy": "Volume potential integration is like calculating the gravitational potential of an irregular planet - you must sum contributions from every cubic kilometer of material, taking into account how the density varies from place to place and how each piece's distance affects its contribution to the total potential at your location.",
          "image": {
            "url": "images/volume-integration-principles.png",
            "alt": "Volume integration principles",
            "caption": "Advanced integration techniques for volume charge distributions"
          }
        }
      ],

      "worked_examples": [
        {
          "title": "Potential of Uniform Solid Sphere",
          "problem": "A solid sphere of radius R carries uniform volume charge density ρ. Find the potential everywhere by direct integration.",
          "step_by_step": [
            {
              "step": "Outside the sphere (r > R)",
              "explanation": "Field point outside: integrate over entire sphere. Use spherical coordinates."
            },
            {
              "step": "Charge element",
              "explanation": "dq = ρdV = ρ(r'²sinθ'dr'dθ'dφ') with r' from 0 to R"
            },
            {
              "step": "Distance using law of cosines",
              "explanation": "Distance from dq to field point: D = √(r² + r'² - 2rr'cosγ) where γ is angle between r and r'"
            },
            {
              "step": "Potential integral",
              "explanation": "V = kρ∫∫∫ r'²sinθ'dr'dθ'dφ'/√(r² + r'² - 2rr'cosγ)"
            },
            {
              "step": "Angular integration",
              "explanation": "∫∫ sinθ'dθ'dφ'/D = 4π/r for r'<r, 4π/r' for r'>r (standard result)"
            },
            {
              "step": "Radial integration for r>R",
              "explanation": "All r'<r, so V = kρ∫₀ᴿ r'²(4π/r)dr' = (4πkρ/r)∫₀ᴿ r'²dr' = (4πkρ/r)(R³/3) = kQ/r"
            },
            {
              "step": "Inside the sphere (r < R)",
              "explanation": "Split integral: r' from 0 to r and r to R"
            },
            {
              "step": "Inside contribution",
              "explanation": "V_inside = kρ∫₀ʳ r'²(4π/r)dr' = (4πkρ/r)(r³/3) = (4πkρr²/3)"
            },
            {
              "step": "Outside contribution",
              "explanation": "V_outside = kρ∫_rᴿ r'²(4π/r')dr' = 4πkρ∫_rᴿ r'dr' = 4πkρ(R²-r²)/2"
            },
            {
              "step": "Total inside potential",
              "explanation": "V = V_inside + V_outside = 4πkρ(r²/3 + (R²-r²)/2) = 4πkρ(3R²-r²)/6 = kQ(3R²-r²)/2R³"
            }
          ],
          "final_answer": "Outside (r>R): V = kQ/r; Inside (r<R): V = kQ(3R²-r²)/2R³",
          "concept_applied": "Volume integration for spherical distribution",
          "image": {
            "url": "images/solid-sphere-potential-calc.png",
            "alt": "Solid sphere potential calc",
            "caption": "Potential calculation for uniformly charged solid sphere using volume integration"
          }
        },
        {
          "title": "Potential of Non-uniform Solid Sphere",
          "problem": "A solid sphere of radius R has charge density ρ(r) = ρ₀(1 - r/R). Find the potential at the center.",
          "step_by_step": [
            {
              "step": "Set up integration",
              "explanation": "V_center = k∫dq/r = k∫ρ(r)dV/r. At center, r = r' (distance from center)"
            },
            {
              "step": "Volume element",
              "explanation": "dV = 4πr'²dr' (integrate over shells)"
            },
            {
              "step": "Potential integral",
              "explanation": "V_center = k∫₀ᴿ ρ(r)(4πr'²dr')/r' = 4πk∫₀ᴿ ρ(r)r'dr'"
            },
            {
              "step": "Substitute ρ(r)",
              "explanation": "V_center = 4πk∫₀ᴿ ρ₀(1 - r'/R)r'dr' = 4πkρ₀∫₀ᴿ (r' - r'²/R)dr'"
            },
            {
              "step": "Evaluate integral",
              "explanation": "∫₀ᴿ (r' - r'²/R)dr' = [r'²/2 - r'³/3R]₀ᴿ = R²/2 - R³/3R = R²/2 - R²/3 = R²/6"
            },
            {
              "step": "Final potential",
              "explanation": "V_center = 4πkρ₀(R²/6) = (2πkρ₀R²)/3"
            },
            {
              "step": "Express in terms of total charge",
              "explanation": "Q = ∫ρdV = 4πρ₀∫₀ᴿ (1-r/R)r²dr = 4πρ₀[R³/3 - R³/4] = πρ₀R³/3, so ρ₀ = 3Q/πR³"
            },
            {
              "step": "Alternative expression",
              "explanation": "V_center = (2πk)(3Q/πR³)R²/3 = 2kQ/R"
            }
          ],
          "final_answer": "V_center = 2kQ/R",
          "concept_applied": "Potential integration with non-uniform density",
          "image": {
            "url": "images/nonuniform-sphere-potential.png",
            "alt": "Nonuniform sphere potential",
            "caption": "Potential calculation for sphere with linearly decreasing charge density"
          }
        },
        {
          "title": "Potential of Finite Cylinder on Axis",
          "problem": "A solid cylinder of radius R and length L carries uniform volume charge density ρ. Find the potential on the axis at point z from the center.",
          "step_by_step": [
            {
              "step": "Set up coordinates",
              "explanation": "Cylinder along z-axis from -L/2 to L/2, radius R. Field point at (0,0,z)."
            },
            {
              "step": "Build from disks",
              "explanation": "Slice cylinder into disks of thickness dz' at position z'"
            },
            {
              "step": "Charge on disk",
              "explanation": "dq = ρ(πR²)dz'"
            },
            {
              "step": "Potential from disk",
              "explanation": "From earlier: dV = 2πkσ[√(R² + (z-z')²) - |z-z'|], with σ = ρdz'"
            },
            {
              "step": "Total potential",
              "explanation": "V = 2πkρ∫_{-L/2}^{L/2} [√(R² + (z-z')²) - |z-z'|]dz'"
            },
            {
              "step": "Split integral for absolute value",
              "explanation": "Case 1: z > L/2 (point above cylinder). Then |z-z'| = z-z' for all z'"
            },
            {
              "step": "Evaluate for z > L/2",
              "explanation": "V = 2πkρ[∫√(R²+u²)du - ∫(z-z')dz'] with u=z-z'"
            },
            {
              "step": "First integral",
              "explanation": "∫√(R²+u²)du = ½[u√(R²+u²) + R²ln|u+√(R²+u²)|]"
            },
            {
              "step": "Second integral",
              "explanation": "∫(z-z')dz' = [zz' - z'²/2]"
            },
            {
              "step": "Apply limits",
              "explanation": "After careful algebra: V = πkρ[R²ln((z+L/2+√(R²+(z+L/2)²)/(z-L/2+√(R²+(z-L/2)²)) + (z+L/2)√(R²+(z+L/2)²) - (z-L/2)√(R²+(z-L/2)²) - Lz]"
            },
            {
              "step": "Special case: center (z=0)",
              "explanation": "V_center = 2πkρ[√(R²+L²/4) - L/2 + (R²/2)ln((L/2+√(R²+L²/4))/R)]"
            }
          ],
          "final_answer": "V = πkρ[R²ln((z+L/2+√(R²+(z+L/2)²)/(z-L/2+√(R²+(z-L/2)²)) + (z+L/2)√(R²+(z+L/2)²) - (z-L/2)√(R²+(z-L/2)²) - Lz] for z > L/2",
          "concept_applied": "Volume integration using disk superposition",
          "image": {
            "url": "images/cylinder-potential-calc.png",
            "alt": "Cylinder potential calc",
            "caption": "Potential calculation for finite cylinder using disk integration method"
          }
        },
        {
          "title": "Potential from Field Integration",
          "problem": "The electric field in a region is given by E(r) = E₀(r/R)² r̂ for r < R and E(r) = E₀(R/r)² r̂ for r > R. Find the potential everywhere, taking V=0 at infinity.",
          "step_by_step": [
            {
              "step": "Outside region (r > R)",
              "explanation": "V(r) = -∫_∞^r E·dr = -∫_∞^r E₀(R/r')² dr'"
            },
            {
              "step": "Evaluate outside integral",
              "explanation": "V(r) = -E₀R²∫_∞^r dr'/r'² = -E₀R²[-1/r']_∞^r = E₀R²/r"
            },
            {
              "step": "At r = R",
              "explanation": "V(R) = E₀R²/R = E₀R"
            },
            {
              "step": "Inside region (r < R)",
              "explanation": "V(r) = V(R) - ∫_R^r E·dr = E₀R - ∫_R^r E₀(r'/R)² dr'"
            },
            {
              "step": "Evaluate inside integral",
              "explanation": "V(r) = E₀R - (E₀/R²)∫_R^r r'² dr' = E₀R - (E₀/R²)[r'³/3]_R^r"
            },
            {
              "step": "Simplify",
              "explanation": "V(r) = E₀R - (E₀/R²)(r³/3 - R³/3) = E₀R - (E₀/3R²)(r³ - R³)"
            },
            {
              "step": "Final expression",
              "explanation": "V(r) = E₀R - (E₀r³/3R²) + (E₀R/3) = (4E₀R/3) - (E₀r³/3R²)"
            },
            {
              "step": "Check continuity",
              "explanation": "At r=R: V(R) = (4E₀R/3) - (E₀R³/3R²) = (4E₀R/3) - (E₀R/3) = E₀R ✓"
            }
          ],
          "final_answer": "Outside (r>R): V = E₀R²/r; Inside (r<R): V = (4E₀R/3) - (E₀r³/3R²)",
          "concept_applied": "Potential from field integration",
          "image": {
            "url": "images/potential-from-field.png",
            "alt": "Potential from field",
            "caption": "Calculating potential by integrating given electric field"
          }
        }
      ]
    }
  ],

  "key_terms": [
    "Potential integration",
    "Line integral",
    "Surface integral",
    "Volume integral",
    "Charge density",
    "Coordinate systems",
    "Superposition principle",
    "Non-uniform distributions",
    "Numerical integration",
    "Jacobian determinant",
    "Law of cosines",
    "Field integration"
  ],

  "common_misconceptions": [
    "Confusing potential integrals with field integrals",
    "Mishandling absolute values in distance calculations",
    "Forgetting Jacobian factors in coordinate transformations",
    "Assuming all potentials can be found analytically",
    "Confusing source coordinates with field point coordinates",
    "Mishandling infinite distributions and divergences",
    "Forgetting reference point for potential definition"
  ],

  "real_world_applications": [
    "Electrostatic lens design for particle beams",
    "Semiconductor device potential calculations",
    "Capacitor design and optimization",
    "Mass spectrometer electrode design",
    "Particle accelerator cavity potentials",
    "Electron microscope electrode design",
    "Plasma physics potential calculations",
    "Atmospheric electricity modeling",
    "Electrostatic precipitation optimization",
    "Spacecraft charging analysis"
  ],

  "summary": "This unit has developed comprehensive integration methods for calculating electric potential from continuous charge distributions. Through systematic approaches for linear, surface, and volume distributions, we've demonstrated how to set up and evaluate potential integrals using appropriate coordinate systems and handling both uniform and non-uniform charge densities. The scalar nature of potential makes these integrals often simpler than corresponding field calculations, though careful attention to coordinate systems, integration order, and mathematical techniques is essential. These methods provide powerful tools for analyzing real-world systems where charge is distributed throughout space, from nanoscale semiconductor devices to macroscopic atmospheric phenomena. The ability to calculate potentials directly from charge distributions completes our toolkit for solving electrostatic problems, complementing the field-based and Gauss' Law approaches developed earlier."
}
